{
  "week_number": 23,
  "title": "Week 23: June 1–7 - Ruth; 1 Samuel 1–7",
  "date_range": "June 1–7",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Rejoicing in Unexpected Paths",
      "scripture": {
        "reference": "1 Samuel 2:1",
        "text": "And Hannah prayed, and said, My heart rejoiceth in the Lord, mine horn is exalted in the Lord: my mouth is enlarged over mine enemies; because I rejoice in thy salvation."
      },
      "thought": "This week, as we study Ruth and 1 Samuel 1–7, we’ll explore the lives of Ruth and Hannah, two women who faced unexpected detours in life. Ruth, a widow, chose to stay with Naomi and embrace a new faith, while Hannah endured the pain of infertility with deep faith in God. Their stories remind us that life’s path isn’t always straight, yet the Lord can turn tragedy into triumph. We’ll see how their trust in God led to blessings beyond imagination. As we reflect on their examples, let’s consider how we, too, can find joy in the Lord during our own challenges. Their faith can inspire us to trust that God is guiding us, no matter where our journey leads.",
      "application": "Take a moment today to write down one unexpected challenge you’ve faced and how you’ve seen God’s hand in it, even if just a small way.",
      "question": "How can I find joy in the Lord even when my life takes unexpected turns?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Choosing Faith Over Fear",
      "scripture": {
        "reference": "Ruth 1:16",
        "text": "And Ruth said, Intreat me not to leave thee, or to return from following after thee: for whither thou goest, I will go; and where thou lodgest, I will lodge: thy people shall be my people, and thy God my God:"
      },
      "thought": "Ruth’s decision to stay with Naomi, despite the uncertainty of her future, shows incredible faith. As a widow in a foreign land, she could have returned to the familiarity of her old life, but instead, she chose to embrace Naomi’s faith and people. Her words reflect a deep commitment to trust God, no matter the cost. Like Ruth, we often face moments where we must choose between the comfort of the familiar and the unknown path of faith. Her story reminds us that God honors such courage and guides us through life’s uncertainties. Let’s draw strength from Ruth to trust God in our own difficult decisions.",
      "application": "Identify one area in your life where you can choose faith over fear today, and take a small step in that direction.",
      "question": "What is one decision I’m facing where I can show faith like Ruth did?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Challenges",
      "title": "Trusting Through Life’s Trials",
      "scripture": {
        "reference": "1 Samuel 1:10",
        "text": "And she was in bitterness of soul, and prayed unto the Lord, and wept sore."
      },
      "thought": "Hannah’s heartache over not having children left her in deep sorrow, yet she turned to the Lord in prayer. Her story teaches us that it’s okay to bring our pain to God, to pour out our hearts as she did. Even when blessings seem delayed, Hannah’s example shows that God hears us in our struggles. We may not always receive the exact answers we seek, but we can trust that the Savior offers help and guidance. Her faith in the midst of bitterness can inspire us to hold on during our own challenges. Let’s remember that God is with us, even in our darkest moments.",
      "application": "Take five minutes today to pray about a personal struggle, honestly sharing your feelings with Heavenly Father.",
      "question": "How can I trust God more fully when I face challenges like Hannah did?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Revelation",
      "title": "Hearing the Lord’s Voice",
      "scripture": {
        "reference": "1 Samuel 3:10",
        "text": "And the Lord came, and stood, and called as at other times, Samuel, Samuel. Then Samuel answered, Speak; for thy servant heareth."
      },
      "thought": "Samuel’s experience of hearing the Lord’s voice as a young boy teaches us the importance of being ready to listen. At first, he didn’t recognize God’s call, but with Eli’s help, he learned to respond with a willing heart. We, too, can learn to recognize the Lord’s voice in our lives, even if it takes time and practice. President Russell M. Nelson has assured us that God wants to speak to us, and we can increase our capacity to hear Him. Samuel’s story invites us to be open and attentive to the Spirit’s quiet promptings. Let’s strive to say, like Samuel, 'Speak; for thy servant heareth.'",
      "application": "Set aside a quiet moment today to listen for the Spirit, perhaps by reading a verse of scripture and pondering what God might be saying to you.",
      "question": "What can I do to better recognize the Lord’s voice in my daily life?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Obedience",
      "title": "Returning to God’s Protection",
      "scripture": {
        "reference": "1 Samuel 7:3",
        "text": "And Samuel spake unto all the house of Israel, saying, If ye do return unto the Lord with all your hearts, then put away the strange gods and Ashtaroth from among you, and prepare your hearts unto the Lord, and serve him only: and he will deliver you out of the hand of the Philistines."
      },
      "thought": "The Israelites learned a hard lesson when they relied on the ark of the covenant for protection without truly turning their hearts to God. Samuel’s call to put away false gods and serve the Lord with all their hearts reminds us that obedience is key to receiving God’s help. Their story shows that simply having sacred things isn’t enough; we must align our lives with God’s will. Like the Israelites, we can experience God’s deliverance when we repent and commit to following Him. This principle applies to us today as we strive to prioritize God above worldly distractions. Let’s heed Samuel’s counsel to prepare our hearts for the Lord.",
      "application": "Examine your life today and choose one distraction or habit to set aside so you can better focus on serving the Lord.",
      "question": "What is one thing I can 'put away' to more fully return to the Lord with my heart?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Finding Hope in God’s Plan",
      "scripture": {
        "reference": "Ruth 2:12",
        "text": "The Lord recompense thy work, and a full reward be given thee of the Lord God of Israel, under whose wings thou art come to trust."
      },
      "thought": "Boaz’s words to Ruth remind us of the hope that comes from trusting in the Lord. Ruth had left everything familiar to follow Naomi and embrace a new faith, and Boaz recognized her courage and trust in God. His blessing reflects the truth that God sees our efforts and rewards our faith, often in ways we don’t expect. Like Ruth, we can find hope in knowing that God is aware of our sacrifices and struggles. Her story encourages us to keep moving forward, trusting that God’s wings of protection are over us. Let’s hold on to hope, believing that God has a plan for each of us.",
      "application": "Share a kind word or small act of encouragement with someone today, reminding them that God sees their efforts, just as Boaz did for Ruth.",
      "question": "How can I trust more fully in God’s plan, even when I can’t see the outcome?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Rejoicing in the Journey",
      "scripture": {
        "reference": "1 Samuel 2:2",
        "text": "There is none holy as the Lord: for there is none beside thee: neither is there any rock like our God."
      },
      "thought": "As we wrap up this week’s study of Ruth and 1 Samuel 1–7, let’s reflect on the powerful examples of Ruth, Hannah, and Samuel. Ruth taught us to choose faith over fear, trusting God in uncertain times. Hannah showed us how to bring our deepest sorrows to the Lord in prayer, finding strength in Him. Samuel reminded us to listen for God’s voice and obey with a willing heart. Together, their stories affirm that no matter life’s detours, God is our rock, holy and unmatched. Let’s carry their lessons forward, rejoicing in the Lord as we trust Him on our unique paths.",
      "application": "Spend a few minutes reviewing your thoughts or notes from this week and write down one key lesson you want to remember and apply.",
      "question": "What is one way I’ve felt closer to God through studying Ruth and 1 Samuel this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:38:36",
  "source_week_file": "cfm_2026_week_23.json"
}