{
  "week_number": 14,
  "title": "Week 14: March 30–April 5 - Easter",
  "date_range": "March 30–April 5",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Celebrating Christ’s Victory",
      "scripture": {
        "reference": "Isaiah 25:8",
        "text": "He will swallow up death in victory; and the Lord God will wipe away tears from off all faces; and the rebuke of his people shall he take away from off all the earth: for the Lord hath spoken it."
      },
      "thought": "This Easter week, we turn our hearts to the Savior’s ultimate triumph over death and sin. The Resurrection of Jesus Christ, as prophesied in Isaiah, connects all of God’s children across time—those who looked forward to Him and those who look back with faith. His victory means that death is not the end, and every tear can be wiped away through His love. As we study this week, let’s reflect on how His Atonement influences our eternal destiny and brings us hope. Easter is a time of joy, a celebration of the peace and power Christ offers to each of us. Let’s prepare to feel that joy as we explore prophecies and testimonies of Him.",
      "application": "Take a moment today to write down one reason Easter feels meaningful to you, and share it with a family member or friend.",
      "question": "How does knowing Christ has overcome death change the way I face challenges in my life?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Hope",
      "title": "Finding Hope in Christ",
      "scripture": {
        "reference": "Psalms 16:9-10",
        "text": "Therefore my heart is glad, and my glory rejoiceth: my flesh also shall rest in hope. For thou wilt not leave my soul in hell; neither wilt thou suffer thine Holy One to see corruption."
      },
      "thought": "Easter reminds us of the hope we have in Jesus Christ, as beautifully expressed in the Psalms. This scripture points to the Resurrection, assuring us that Christ would not remain in the grave, and neither will we. His power to overcome death gives us a reason to rejoice, even in difficult times. When life feels heavy, we can rest in the hope that Christ’s victory is also ours. This hope can lift our spirits and help us trust in better days ahead. Let’s hold onto this promise as we celebrate Easter this week.",
      "application": "Reflect on a current struggle and write down one way Christ’s Resurrection gives you hope to keep going.",
      "question": "How can I let the hope of the Resurrection influence my attitude today?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Grace",
      "title": "Grace Through His Sacrifice",
      "scripture": {
        "reference": "Isaiah 53:4-5",
        "text": "Surely he hath borne our griefs, and carried our sorrows: yet we did esteem him stricken, smitten of God, and afflicted. But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed."
      },
      "thought": "Isaiah’s words remind us of the incredible price Jesus Christ paid for our salvation through His Atonement. He took upon Himself our griefs, sorrows, and sins, offering us healing and peace in return. This grace means we don’t have to carry our burdens alone—Christ has already borne them for us. As we ponder His sacrifice this Easter, we can feel gratitude for the healing only He can provide. His stripes remind us that no pain is beyond His reach. Let’s turn to Him today for strength and comfort.",
      "application": "Spend a quiet moment thanking the Savior for carrying a specific burden or sin you’ve struggled with.",
      "question": "How does knowing Christ bore my griefs help me trust in His grace?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Deliverance",
      "title": "Delivered by His Power",
      "scripture": {
        "reference": "Alma 7:11-12",
        "text": "And he shall go forth, suffering pains and afflictions and temptations of every kind; and this that the word might be fulfilled which saith he will take upon him the pains and the sicknesses of his people. And he will take upon him death, that he may loose the bands of death which bind his people; and he will take upon him their infirmities, that his bowels may be filled with mercy, according to the flesh, that he may know according to the flesh how to succor his people according to their infirmities."
      },
      "thought": "Alma teaches us that Christ’s Atonement delivers us not only from death but also from every pain and weakness we face. Jesus experienced every kind of suffering so He could perfectly understand and help us in our struggles. His mercy is personal—He knows exactly how to succor us because He has felt what we feel. This Easter, we can find comfort in knowing we are never alone in our trials. His power to deliver is real and available to us every day. Let’s seek His help as we navigate life’s challenges.",
      "application": "Identify a specific trial or weakness and pray specifically for Christ’s help to overcome it today.",
      "question": "In what ways have I felt Christ’s deliverance in my life?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Worship",
      "title": "Worshipping the Risen Lord",
      "scripture": {
        "reference": "John 14:27",
        "text": "Peace I leave with you, my peace I give unto you: not as the world giveth, give I unto you. Let not your heart be troubled, neither let it be afraid."
      },
      "thought": "As we approach Easter Sunday, let’s worship the Savior by reflecting on the peace He offers, as promised in John. His peace is different from anything the world can give—it calms our troubled hearts and casts out fear. This gift is a direct result of His Atonement and Resurrection, which assure us that all will be made right in the end. Worshipping Him means accepting this peace and letting it guide our lives. We can honor Him by trusting in His words and seeking His presence. Let’s make room for that peace today.",
      "application": "Sing or listen to an Easter hymn like ‘He Is Risen!’ and focus on feeling Christ’s peace as you do.",
      "question": "How can I make worship a more meaningful part of my Easter celebration?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Blessings",
      "title": "Blessed by His Atonement",
      "scripture": {
        "reference": "Doctrine and Covenants 19:16-17",
        "text": "For behold, I, God, have suffered these things for all, that they might not suffer if they would repent; But if they would not repent they must suffer even as I."
      },
      "thought": "On this day, often remembered as the day of Christ’s crucifixion, we reflect on the immense blessings of His Atonement, as taught in Doctrine and Covenants. Jesus suffered for each of us so that we might be spared the full weight of our sins if we repent. This blessing of forgiveness is a gift beyond measure, offered freely to all who turn to Him. His sacrifice ensures that we can find relief from guilt and pain. As we remember His suffering today, let’s also remember the hope and renewal it brings. We are truly blessed by His love and mercy.",
      "application": "Take time to repent of something specific today, seeking the blessing of forgiveness through Christ’s Atonement.",
      "question": "What blessings have I received because of Christ’s willingness to suffer for me?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Reflecting on Easter’s Promise",
      "scripture": {
        "reference": "1 Corinthians 15:22",
        "text": "For as in Adam all die, even so in Christ shall all be made alive."
      },
      "thought": "As we conclude this Easter week, let’s reflect on the central promise of the Savior’s Resurrection, as taught in Corinthians: through Christ, all shall be made alive. This week, we’ve explored His victory over death, the hope and grace He offers, and the personal deliverance and blessings of His Atonement. We’ve worshipped Him by seeking His peace and remembering the price He paid for us. His life and Resurrection connect us to all of God’s children across history, uniting us in faith. Easter reminds us that no trial, sin, or sorrow is beyond His power to heal. Let’s carry this truth into the coming days with renewed commitment to follow Him.",
      "application": "Share with a family member or friend one key insight or feeling you’ve gained about Christ this Easter week.",
      "question": "How has my understanding of Christ’s Atonement and Resurrection grown this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:32:51",
  "source_week_file": "cfm_2026_week_14.json"
}