{
  "week_number": 10,
  "title": "Week 10: March 2–8 - Genesis 24–33",
  "date_range": "March 2–8",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Let God Prevail Today",
      "scripture": {
        "reference": "Genesis 32:26",
        "text": "And he said, I will not let thee go, except thou bless me."
      },
      "thought": "This week, we dive into the remarkable story of Jacob, later named Israel, in Genesis 24–33. His journey teaches us about seeking God’s blessings, not through competition or deceit, but by letting God prevail in our lives. From covenant marriage to family reconciliation, these chapters reveal how God’s power can transform our relationships and personal struggles. Jacob’s wrestle with the Lord reminds us that true blessings come when we humbly persist in faith. As we study, let’s consider how we can invite God to guide our decisions and heal our hearts. What blessings are we seeking as we let Him lead?",
      "application": "Take a quiet moment today to pray and ask God to guide your week of study, seeking His direction in your life.",
      "question": "What does it mean to me to let God prevail in my daily choices?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Covenant",
      "title": "Marriage in God’s Plan",
      "scripture": {
        "reference": "Genesis 24:16",
        "text": "And the damsel was very fair to look upon, a virgin, neither had any man known her: and she went down to the well, and filled her pitcher, and came up."
      },
      "thought": "In Genesis 24, Abraham’s deep concern for Isaac’s marriage highlights the sacredness of covenant unions in God’s eternal plan. Rebekah’s kindness, diligence, and willingness to follow God’s will made her a fitting partner in this covenant. Her actions at the well—serving others without hesitation—show qualities that strengthen marriages and families today. God values marriage as a foundation for His plan, and He desires us to build relationships rooted in faith and service. As we reflect on Rebekah’s example, we can see how small acts of love and commitment fortify our own family bonds. How can we honor the sacredness of marriage in our lives?",
      "application": "Express appreciation to a family member or spouse today for a specific act of kindness or support.",
      "question": "How can I cultivate qualities like Rebekah’s in my relationships?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Faith",
      "title": "Valuing Eternal Blessings",
      "scripture": {
        "reference": "Genesis 25:32",
        "text": "And Esau said, Behold, I am at the point to die: and what profit shall this birthright do to me?"
      },
      "thought": "Esau’s choice to trade his birthright for a meal in Genesis 25 teaches a powerful lesson about prioritizing eternal blessings over temporary desires. The birthright represented not just material inheritance but spiritual responsibilities and covenants with God. Esau’s shortsightedness reminds us how easy it is to be distracted by worldly things. We, too, face choices daily between fleeting pleasures and lasting promises like temple covenants or family time. By focusing on the Savior, we can keep our eyes on what truly matters. Let’s strive to value God’s eternal gifts above momentary distractions.",
      "application": "Make a list of one eternal blessing you cherish and one worldly distraction to avoid today, then act on it.",
      "question": "What worldly things might I be prioritizing over eternal blessings?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Worship",
      "title": "Nearer to God’s House",
      "scripture": {
        "reference": "Genesis 28:16",
        "text": "And Jacob awaked out of his sleep, and he said, Surely the Lord is in this place; and I knew it not."
      },
      "thought": "Jacob’s dream in Genesis 28, where he saw a ladder reaching to heaven, transformed a lonely night into a sacred encounter with God. He called the place Bethel, meaning ‘house of God,’ recognizing the Lord’s presence. This story reminds us of the temple, a place where we feel nearer to God and make covenants that bring His power into our lives. Just as Jacob found peace amid uncertainty, we can find strength in sacred spaces or moments of worship. The temple, or even personal prayer, can be our Bethel. How can we draw closer to God through His house?",
      "application": "Spend a few minutes today reflecting on a temple experience or listening to a hymn like ‘Nearer, My God, to Thee.’",
      "question": "When have I felt God’s presence most strongly in my life?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Hope",
      "title": "God Remembers My Trials",
      "scripture": {
        "reference": "Genesis 30:22",
        "text": "And God remembered Rachel, and God hearkened to her, and opened her womb."
      },
      "thought": "In Genesis 29–30, both Rachel and Leah faced deep personal struggles, yet God saw their afflictions and remembered them with mercy. Rachel’s long wait for a child and Leah’s yearning for love show that God is aware of our individual trials. The phrase ‘God remembered’ reminds us that we are never forgotten, even when answers are delayed. In our own challenges, we can trust that the Lord sees us and will provide comfort or solutions in His timing. These stories invite us to hold onto hope during difficult seasons. How has God remembered you in past trials?",
      "application": "Write down one trial you’re facing and a time God has helped you before, then pray for strength to trust Him now.",
      "question": "How can I see God’s hand in my current challenges?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Relationships",
      "title": "Healing Family Bonds",
      "scripture": {
        "reference": "Genesis 33:4",
        "text": "And Esau ran to meet him, and embraced him, and fell on his neck, and kissed him: and they wept."
      },
      "thought": "The reunion of Jacob and Esau in Genesis 33 is a beautiful story of forgiveness and healing after years of conflict. Jacob, filled with fear, prepared to meet his brother by praying for help and humbling himself. Esau’s warm embrace shows the power of letting go of past hurts. This account reminds us that the Savior can mend broken family relationships when we turn to Him. Whether it’s a small misunderstanding or a deep wound, God can soften hearts on both sides. Let’s seek His help to heal and strengthen our family ties today.",
      "application": "Reach out to a family member today with a kind word or gesture, even if it’s just a simple text or call.",
      "question": "What family relationship could I work to improve with the Savior’s help?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Blessings Through God’s Will",
      "scripture": {
        "reference": "Genesis 32:28",
        "text": "And he said, Thy name shall be called no more Jacob, but Israel: for as a prince hast thou power with God and with men, and hast prevailed."
      },
      "thought": "This week, we’ve journeyed with Jacob from striving for blessings through his own means to learning to let God prevail, earning the name Israel. From Rebekah’s kindness to Esau’s forgiveness, we’ve seen how God’s power transforms marriages, personal choices, and family relationships. Jacob’s wrestle and sacred dream at Bethel remind us that true blessings come through covenants and trust in the Lord. We’ve pondered how to value eternal things and seek healing in our families. As we close this week, let’s commit to letting God guide our path. What lessons will you carry forward from Jacob’s story?",
      "application": "Share one insight from this week’s study with a family member or friend to strengthen each other’s faith.",
      "question": "How has letting God prevail changed my perspective this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:30:09",
  "source_week_file": "cfm_2026_week_10.json"
}