{
  "week_number": 8,
  "title": "Week 8: February 16–22 - Genesis 12–17; Abraham 1–2",
  "date_range": "February 16–22",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Becoming Greater Through Righteousness",
      "scripture": {
        "reference": "Abraham 1:2",
        "text": "And, finding there was greater happiness and peace and rest for me, I sought for the blessings of the fathers, and the right whereunto I should be ordained to administer the same; having been myself a follower of righteousness, desiring also to be one who possessed great knowledge, and to be a greater follower of righteousness, and to possess a greater knowledge, and to be a father of many nations, a prince of peace, and desiring to receive instructions, and to keep the commandments of God, I became a rightful heir, a High Priest, holding the right belonging to the fathers."
      },
      "thought": "This week, we dive into the life of Abraham, often called 'the father of the faithful.' Despite a challenging family background, Abraham desired to be a greater follower of righteousness, as we read in Abraham 1:2. His story teaches us that no matter where we come from, we can choose a future filled with hope and divine blessings. We’ll explore themes like faith, covenants, and God’s personal care for each of us. As we study Genesis 12–17 and Abraham 1–2, let’s consider how Abraham’s journey can inspire our own. How can we, like him, seek to grow closer to God each day?",
      "application": "Take a few minutes today to write down one righteous desire you have for this week, inspired by Abraham’s example.",
      "question": "What does it mean to you to be a 'greater follower of righteousness' in your daily life?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Faith in God’s Promises",
      "scripture": {
        "reference": "Genesis 15:5-6",
        "text": "And he brought him forth abroad, and said, Look now toward heaven, and tell the stars, if thou be able to number them: and he said unto him, So shall thy seed be. And he believed in the Lord; and he counted it to him for righteousness."
      },
      "thought": "Abraham faced the challenge of waiting many years for a child, yet he believed in God’s promise of a posterity as numerous as the stars. Genesis 15:5-6 shows his faith, even when the fulfillment seemed far off. Like Abraham, we often wait for blessings or answers to prayers. His example reminds us to trust God’s timing and promises, even when we can’t see the outcome. The Savior helps us embrace these promises, giving us strength to endure. How can we hold on to faith during our own waiting periods?",
      "application": "Identify one promise from God you’re waiting on, and write a short note of gratitude for His faithfulness, even before it’s fulfilled.",
      "question": "How has trusting in God’s promises, even when they seem far off, strengthened your faith?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Covenant",
      "title": "Blessed Through Sacred Covenants",
      "scripture": {
        "reference": "Abraham 2:9-10",
        "text": "And I will make of thee a great nation, and I will bless thee above measure, and make thy name great among all nations, and thou shalt be a blessing unto thy seed after thee, that in their hands they shall bear this ministry and Priesthood unto all nations; And I will bless them through thy name; for as many as receive this Gospel shall be called after thy name, and shall be accounted thy seed, and shall rise up and bless thee, as their father."
      },
      "thought": "God made a powerful covenant with Abraham, promising him a great nation and blessings for all who accept the gospel, as we read in Abraham 2:9-10. This covenant extends to us today through baptism and temple ordinances. It’s a reminder that God wants to make sacred promises with each of us, offering eternal blessings like inheritance and posterity. These covenants connect us to Abraham’s family and to God’s power. They also call us to be a blessing to others. How can we live up to this sacred responsibility?",
      "application": "Reflect on a covenant you’ve made with God, such as baptism, and do one small act today to honor that commitment.",
      "question": "How do the covenants you’ve made with God influence your daily choices?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Deliverance",
      "title": "God Hears Our Cries",
      "scripture": {
        "reference": "Genesis 16:10-11",
        "text": "And the angel of the Lord said unto her, I will multiply thy seed exceedingly, that it shall not be numbered for multitude. And the angel of the Lord said unto her, Behold, thou art with child, and shalt bear a son, and shalt call his name Ishmael; because the Lord hath heard thy affliction."
      },
      "thought": "Hagar, feeling alone and mistreated, received a divine message in the wilderness, as recorded in Genesis 16:10-11. The name Ishmael, meaning 'God hears,' reminds us that God is aware of our struggles and afflictions. Just as He heard Hagar, He hears us in our moments of loneliness or unfair treatment. This story encourages us to turn to Him, knowing He listens and cares. God’s response to Hagar shows His personal love for each of us. When have you felt that God has heard you?",
      "application": "Take a quiet moment today to pray about a specific struggle, trusting that God hears and cares for you.",
      "question": "When have you felt God’s presence in a difficult moment, knowing He heard your prayers?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Service",
      "title": "Being a Blessing to Others",
      "scripture": {
        "reference": "Genesis 12:2-3",
        "text": "And I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing: And I will bless them that bless thee, and curse him that curseth thee: and in thee shall all families of the earth be blessed."
      },
      "thought": "God promised Abraham not only blessings but also the opportunity to be a blessing to others, as seen in Genesis 12:2-3. This call to bless others is part of the covenant we inherit as members of Abraham’s seed through the gospel. We can be a blessing by sharing kindness, serving in our communities, or teaching the gospel. Abraham’s life shows that our faithfulness can impact generations. Each small act of service reflects God’s love through us. How can we be a blessing to someone today?",
      "application": "Do one intentional act of kindness today, such as helping a neighbor or sending an encouraging message, to be a blessing.",
      "question": "Who in your life could use a blessing from you, and how might you reach out to them?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Obedience",
      "title": "Tithing Reflects True Wealth",
      "scripture": {
        "reference": "Genesis 14:20",
        "text": "And blessed be the most high God, which hath delivered thine enemies into thy hand. And he gave him tithes of all."
      },
      "thought": "Abraham’s willingness to pay tithing, as noted in Genesis 14:20, shows his gratitude and trust in God over worldly wealth. He refused riches from the king of Sodom, valuing God’s blessings above material gain. This act of obedience teaches us to prioritize spiritual riches over temporary ones. Tithing helps us remember that all we have comes from God. It shifts our perspective, focusing on eternal treasures. How has tithing blessed your life with a deeper sense of purpose?",
      "application": "Review your budget or resources today and ensure you’re honoring the law of tithing with a grateful heart.",
      "question": "How has paying tithing helped you see God’s hand in your life?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Growing Through Abraham’s Example",
      "scripture": {
        "reference": "Abraham 1:18",
        "text": "Behold, I will lead thee by my hand, and I will take thee, to put upon thee my name, even the Priesthood of thy father, and my power shall be over thee."
      },
      "thought": "This week, we’ve studied Abraham’s journey to become a greater follower of righteousness, guided by God’s hand as promised in Abraham 1:18. From his faith in God’s promises to his covenant relationship, we’ve seen how God supports our righteous desires. We learned from Hagar that God hears us, and from Abraham’s tithing, that obedience brings spiritual wealth. His call to be a blessing reminds us to serve others. As we reflect on these lessons, let’s carry forward the hope and trust Abraham exemplified. How has his story inspired you to draw closer to God?",
      "application": "Share one lesson from this week with a family member or friend, and discuss how it applies to your lives.",
      "question": "Which of Abraham’s qualities or choices from this week’s study do you most want to emulate, and why?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:29:06",
  "source_week_file": "cfm_2026_week_08.json"
}