{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Discovering Our Divine Identity",
      "scripture": {
        "reference": "Moses 1:4",
        "text": "And, behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands; but not all, for my works are without end, and also my words, for they never cease."
      },
      "thought": "This week, we dive into Moses 1 and Abraham 3, scriptures that reveal profound truths about who we are and who God is. These chapters teach us that we are children of a loving Heavenly Father with a divine destiny. We’ll explore our premortal existence, God’s purpose for us, and how to resist Satan’s distractions. Moses’s experiences show us that knowing our identity as God’s children empowers us to face challenges. Abraham’s vision reminds us of our eternal journey and purpose. Let’s start this week by seeking to understand our true identity and God’s plan for us.",
      "application": "Take a moment today to write down one way you can remember your identity as a child of God, such as placing a note on your mirror that says, 'I am a child of God.'",
      "question": "How does knowing I am a child of God influence the way I see myself and others?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Identity",
      "title": "I Am God’s Child",
      "scripture": {
        "reference": "Moses 1:6",
        "text": "And I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten; and mine Only Begotten is and shall be the Savior, for he is full of grace and truth."
      },
      "thought": "In this verse, God speaks directly to Moses, affirming his identity as His son and giving him a purpose. This personal message reminds us that each of us is known and loved by Heavenly Father. Just as Moses had a divine work to do, we too have a unique role in God’s plan. Understanding that we are children of God can shape every decision we make. It helps us prioritize eternal truths over temporary labels or doubts. Today, let’s hold fast to this truth and let it guide our actions.",
      "application": "Look in the mirror this morning and say to yourself, 'I am a child of God,' then think of one decision you’ll make today based on that identity.",
      "question": "How does knowing I have a divine work to do change the way I approach my daily tasks?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Challenges",
      "title": "Resisting Satan’s Counterfeits",
      "scripture": {
        "reference": "Moses 1:13",
        "text": "And Moses looked upon Satan and said: Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?"
      },
      "thought": "Moses’s response to Satan teaches us a powerful lesson about resisting temptation. When Satan tried to deceive him, Moses stood firm in his identity as a son of God. He recognized that Satan’s power was a counterfeit, lacking the glory of God. We face similar counterfeits today—ideas or influences that mimic truth but lead us astray. By remembering who we are and seeking the Lord’s help, we can discern and reject these falsehoods. Let’s follow Moses’s example by confidently standing for truth.",
      "application": "Identify one temptation or distraction you face today and pray for strength to resist it, just as Moses did.",
      "question": "What are some counterfeits Satan uses in my life, and how can I recognize them?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Purpose",
      "title": "God’s Work for Me",
      "scripture": {
        "reference": "Moses 1:39",
        "text": "For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man."
      },
      "thought": "God’s purpose is clear in this verse: His work and glory are to help us gain immortality and eternal life. This shows how much He loves us and desires our eternal happiness. As we strive to follow Him, we become part of this divine work. Our daily efforts to grow spiritually and help others are aligned with His purpose. Reflect on how God’s goal for us can inspire your own goals. Knowing His work gives us direction and hope in our journey back to Him.",
      "application": "Choose one small way to help someone today, remembering that serving others is part of God’s work.",
      "question": "How can I align my personal goals with God’s work and glory?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Faith",
      "title": "My Premortal Life Matters",
      "scripture": {
        "reference": "Abraham 3:22-23",
        "text": "Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones; And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born."
      },
      "thought": "These verses reveal that we existed as spirits before coming to earth, and many of us were chosen for important roles. This truth helps us understand that our life has eternal significance. We were known and loved by God even before our birth. This knowledge can strengthen our faith, reminding us that we are here for a purpose. It encourages us to trust in God’s plan, even when life feels uncertain. Let’s hold onto this truth as we make choices each day.",
      "application": "Write down one way your premortal calling might influence a choice you make today, such as being kind or standing for truth.",
      "question": "How does knowing I was chosen before I was born affect my confidence in God’s plan for me?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Tested to Prove Faithful",
      "scripture": {
        "reference": "Abraham 3:25",
        "text": "And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them."
      },
      "thought": "This verse teaches that part of our purpose on earth is to be tested and proven through our choices. God wants to see if we will follow His commandments, even when it’s hard. This gives us hope because every challenge is an opportunity to grow closer to Him. Our trials are not random; they are part of a divine plan to help us become like Him. Knowing this can help us face difficulties with courage. Let’s trust that God is with us as we strive to be faithful.",
      "application": "When faced with a tough choice today, pause and pray for guidance to do what God would want.",
      "question": "How can I view my challenges as opportunities to prove my faith in God?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Embracing Our Divine Journey",
      "scripture": {
        "reference": "Moses 1:18",
        "text": "And again Moses said: I will not cease to call upon God, I have other things to inquire of him: for his glory has been upon me, wherefore I can judge between him and thee. Depart hence, Satan."
      },
      "thought": "This week, we’ve explored the powerful truths in Moses 1 and Abraham 3 about our identity, purpose, and eternal journey. We learned that as children of God, we have a divine destiny and work to do. Moses showed us how to resist Satan by holding fast to our identity and calling on God. Abraham’s vision reminded us of our premortal life and the importance of proving ourselves faithful. These scriptures invite us to see ourselves as God sees us—worthy, loved, and capable. Let’s carry these lessons forward, trusting in God’s plan for us.",
      "application": "Reflect on one key insight from this week and share it with a family member or friend to strengthen their faith.",
      "question": "What is one truth from this week’s study that I want to remember and apply in the coming days?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:25:20",
  "source_week_file": "cfm_2026_week_02.json"
}