{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Discovering Christ in Scripture",
      "scripture": {
        "reference": "Psalm 119:105",
        "text": "Thy word is a lamp unto my feet, and a light unto my path."
      },
      "thought": "As we begin our journey through the Old Testament this year, we’re invited to see it as a lamp guiding our path, just as the psalmist did. This ancient collection of writings may feel unfamiliar or even intimidating at times, but it holds powerful testimonies of Jesus Christ and God’s covenant love for His people. Like Abraham, Sarah, and Daniel, we’ll see people who faced joys and struggles, yet found hope through faith in a promised Savior. The Old Testament isn’t just history—it’s a witness of God’s hand in our lives today. Let’s approach this study with eagerness to find Christ in every story and symbol. Together, we can discover how His light still shines through these sacred words.",
      "application": "Take a moment today to share with your family why you’re excited to study the Old Testament this year, focusing on finding Jesus Christ in its pages.",
      "question": "How can the Old Testament guide us like a lamp in our daily challenges?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Identity",
      "title": "Jesus Is Jehovah",
      "scripture": {
        "reference": "Exodus 3:14",
        "text": "And God said unto Moses, I Am That I Am: and he said, Thus shalt thou say unto the children of Israel, I Am hath sent me unto you."
      },
      "thought": "When God revealed Himself to Moses as 'I Am,' He was declaring His eternal identity as Jehovah, who we know as Jesus Christ. President Dallin H. Oaks taught that when we read 'God' or 'Lord' in the Old Testament, it’s almost always referring to Jehovah, our Savior. This truth helps us see that Jesus wasn’t just a figure in the New Testament—He was actively guiding and redeeming His people from the beginning. Understanding that Jesus is Jehovah deepens our appreciation for His role in our lives. As we study the Old Testament, we can look for His voice and presence in every story. What a powerful reminder that He has always been with us!",
      "application": "As you read or discuss scriptures today, pause to recognize when 'Lord' or 'God' refers to Jesus Christ, and reflect on His eternal nature.",
      "question": "How does knowing Jesus is Jehovah change the way you see His love for you?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Covenant",
      "title": "God’s Covenant Treasure",
      "scripture": {
        "reference": "Exodus 19:5",
        "text": "Now therefore, if ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people: for all the earth is mine."
      },
      "thought": "In the Old Testament, God invites His people to be His 'peculiar treasure' through covenants—sacred promises between Him and us. This verse reminds us that by keeping His commandments and covenants, we become precious to Him in a unique way. Just as He sought a covenant relationship with ancient Israel, He seeks one with us today. President Russell M. Nelson has taught that covenants bring a special kind of love and mercy into our lives. As we study the Old Testament, we’ll see how covenants shaped the lives of prophets like Abraham and can shape ours too. Let’s cherish the opportunity to be His treasure through the promises we make and keep.",
      "application": "Discuss with your family one covenant you’ve made, like baptism, and how it helps you feel closer to God.",
      "question": "What does it mean to you to be God’s 'peculiar treasure' through covenants?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Faith",
      "title": "Symbols of the Savior",
      "scripture": {
        "reference": "John 6:35",
        "text": "And Jesus said unto them, I am the bread of life: he that cometh to me shall never hunger; and he that believeth on me shall never thirst."
      },
      "thought": "The Old Testament is filled with symbols that point to Jesus Christ, like the manna given to the Israelites in the wilderness. Just as manna sustained their physical lives, Jesus declares Himself the 'bread of life,' nourishing us spiritually. When we study stories like the manna, the sacrificial lamb, or the brass serpent, we’re reminded of Christ’s role as our Savior and Redeemer. These symbols invite us to deepen our faith in Him by recognizing His presence in every part of scripture. Elder Dale G. Renlund encouraged us to always focus on Jesus Christ as the treasure of our study. Let’s look for Him this year and let these symbols strengthen our belief in His power to sustain us.",
      "application": "Choose one Old Testament symbol of Christ (like manna) and discuss with someone how it relates to Jesus’ role in your life.",
      "question": "What symbols of Christ in the Old Testament help you feel closer to Him?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Revelation",
      "title": "Restored Truths Revealed",
      "scripture": {
        "reference": "1 Nephi 13:29",
        "text": "And after these plain and precious things were taken away it goeth forth unto all the nations of the Gentiles; and after it goeth forth unto all the nations of the Gentiles, yea, even across the many waters which thou hast seen with the Gentiles which have gone forth out of captivity, thou seest—because of the many plain and precious things which have been taken out of the book, which were plain unto the understanding of the children of men, according to the plainness which is in the Lamb of God—because of these things which are taken away out of the gospel of the Lamb, an exceedingly great many do stumble, yea, insomuch that Satan hath great power over them."
      },
      "thought": "Nephi saw in vision that 'plain and precious things' would be removed from the Bible over time, causing many to stumble. But God promised to restore these truths through the Prophet Joseph Smith, giving us treasures like the Book of Mormon, the Book of Moses, and the Book of Abraham. These restorations help us understand the Old Testament more fully, revealing details about Enoch’s Zion, Abraham’s visions, and Melchizedek’s ministry. This shows God’s love in providing ongoing revelation to guide us. As we study these restored scriptures alongside the Old Testament, we gain clearer insight into God’s plan. Let’s be grateful for the light these truths bring to our understanding.",
      "application": "Read a short passage from the Book of Moses or Abraham today to see how it adds to your understanding of the Old Testament.",
      "question": "How do restored truths help you feel God’s guidance in your life?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Isaiah’s Promise of Christ",
      "scripture": {
        "reference": "Isaiah 9:6",
        "text": "For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace."
      },
      "thought": "Isaiah’s beautiful prophecy of the Savior’s birth fills us with hope as we begin studying the Old Testament. He describes Jesus as 'Wonderful, Counsellor, The mighty God,' reminding us of the peace and strength He brings into our lives. Even in ancient times, prophets looked forward to Christ’s coming with joy and anticipation, just as we can look to Him today for comfort. This verse invites us to see the Old Testament as a testimony of Jesus, not just a collection of old stories. As we read about His promised coming, our hope in His power to save and heal grows stronger. Let’s carry this hope with us through every page we study this year.",
      "application": "Share this verse with a family member or friend and express one way Jesus brings peace to your life.",
      "question": "How does Isaiah’s description of Jesus inspire hope in your heart?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Christ in Every Story",
      "scripture": {
        "reference": "Moses 6:63",
        "text": "And behold, all things have their likeness, and all things are created and made to bear record of me, both things which are temporal, and things which are spiritual; things which are in the heavens above, and things which are on the earth, and things which are in the earth, and things which are under the earth, both above and beneath: all things bear record of me."
      },
      "thought": "This week, we’ve begun our Old Testament journey with a focus on finding Jesus Christ in its pages. From recognizing Him as Jehovah to seeing Him in symbols like manna and the sacrificial lamb, we’ve learned that all things bear record of Him. We’ve also explored how covenants make us God’s treasure and how restored truths through Joseph Smith illuminate ancient stories. Isaiah’s prophecy of Christ’s birth reminded us of the hope woven throughout scripture. As the Lord taught Adam, everything in creation points to the Savior, and the Old Testament is no exception. Let’s carry this perspective forward, seeking Christ in every story and strengthening our faith in Him.",
      "application": "Reflect on one insight from this week’s study and write it in a journal or share it with your family to solidify your learning.",
      "question": "What is one way you’ve seen Jesus Christ in the Old Testament this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:23:54",
  "source_week_file": "cfm_2026_week_01.json"
}