{
  "week_number": 25,
  "title": "Week 25: June 15–21 - 1 Samuel 17–18; 24–26; 2 Samuel 5–7",
  "date_range": "June 15–21",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "The Battle Is the Lord’s",
      "scripture": {
        "reference": "1 Samuel 17:47",
        "text": "And all this assembly shall know that the Lord saveth not with sword and spear: for the battle is the Lord’s, and he will give you into our hands."
      },
      "thought": "This week, we dive into the inspiring stories of David, a humble shepherd who became a mighty king through faith in the Lord. From his victory over Goliath to his Christlike mercy toward Saul, David shows us that true strength comes from trusting God. We’ll also explore themes of friendship, forgiveness, and seeking divine guidance as seen in his life and relationships. These chapters remind us that no matter the size of our challenges, the Lord fights our battles when we turn to Him. As we study, let’s consider how we can apply David’s courage and faith to our own lives. What 'Goliaths' are we facing, and how can we rely on the Lord to overcome them?",
      "application": "Take a moment today to write down one personal challenge you’re facing and pray specifically for the Lord’s help in overcoming it.",
      "question": "How can I trust the Lord more fully with the battles I face in my life?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Challenges",
      "title": "Facing Giants with Faith",
      "scripture": {
        "reference": "1 Samuel 17:37",
        "text": "David said moreover, The Lord that delivered me out of the paw of the lion, and out of the paw of the bear, he will deliver me out of the hand of this Philistine. And Saul said unto David, Go, and the Lord be with thee."
      },
      "thought": "David faced Goliath, a giant who terrified even the bravest soldiers, yet he wasn’t afraid because he remembered how the Lord had delivered him from danger before. His past experiences with the lion and bear gave him confidence that God would help him again. We, too, face 'giants' in our lives—whether it’s a difficult task, a fear, or a personal struggle. Like David, we can look back on times when the Lord has helped us and trust that He will do so again. His strength is greater than any challenge we encounter. Let David’s example inspire us to face our fears with faith in God’s power.",
      "application": "Recall a time when the Lord helped you through a challenge and write it down to remind yourself of His faithfulness.",
      "question": "What past experiences with the Lord’s help can give me courage to face my current challenges?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Relationships",
      "title": "True Friendship Reflects Christ",
      "scripture": {
        "reference": "1 Samuel 18:1",
        "text": "And it came to pass, when he had made an end of speaking unto Saul, that the soul of Jonathan was knit with the soul of David, and Jonathan loved him as his own soul."
      },
      "thought": "Jonathan and David shared a friendship rooted in deep love and loyalty, a bond that reminds us of Christ’s selfless love for us. Unlike Saul, who grew jealous of David’s success, Jonathan celebrated his friend’s victories, even though it meant he might not become king. Their story teaches us the beauty of supporting and uplifting those we care about, reflecting the Savior’s example. True friendship isn’t about competition but about genuine care and sacrifice. As we build relationships, let’s strive to be like Jonathan, loving others as our own souls. How can we show this kind of Christlike love in our friendships today?",
      "application": "Reach out to a friend today with a kind message or small act of support to strengthen your bond.",
      "question": "How can I show more Christlike love in my friendships, even when it’s hard?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Forgiveness",
      "title": "Choosing Mercy Over Revenge",
      "scripture": {
        "reference": "1 Samuel 24:10",
        "text": "Behold, this day thine eyes have seen how that the Lord had delivered thee to day into mine hand in the cave: and some bade me kill thee: but mine eye spared thee; and I said, I will not put forth mine hand against my lord; for he is the Lord’s anointed."
      },
      "thought": "David had every opportunity to take revenge on Saul, who was hunting him down, yet he chose mercy instead. Even when urged by others to harm Saul, David refused because he respected Saul as the Lord’s anointed. This act of forgiveness shows Christlike poise and self-control, teaching us that peace comes from letting go of anger. We may face situations where we feel wronged, but choosing forgiveness can heal our hearts. David’s example reminds us to trust God’s justice rather than seeking our own. How can we show mercy in our own lives, even when it’s difficult?",
      "application": "Think of someone who has wronged you and pray for the strength to forgive them today.",
      "question": "What is one situation in my life where I can choose mercy over holding a grudge?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Revelation",
      "title": "Seeking the Lord’s Guidance",
      "scripture": {
        "reference": "2 Samuel 5:19",
        "text": "And David inquired of the Lord, saying, Shall I go up to the Philistines? wilt thou deliver them into mine hand? And the Lord said unto David, Go up: for I will doubtless deliver the Philistines into thine hand."
      },
      "thought": "Even as king, David didn’t rely on his own wisdom when facing the Philistines—he sought the Lord’s guidance through prayer. Each time he faced a challenge, he inquired of God for direction, showing his deep trust in divine help. We, too, can turn to Heavenly Father when we need answers, whether for big decisions or small daily struggles. David’s example teaches us that the Lord is ready to guide us if we ask. His direction can bring clarity and peace to our lives. Let’s make prayer a priority as we navigate our own challenges.",
      "application": "Before making a decision today, pause to pray and ask for the Lord’s guidance on the matter.",
      "question": "How have I seen the Lord’s guidance make a difference in my life when I’ve sought it?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Our Eternal King Reigns",
      "scripture": {
        "reference": "2 Samuel 7:16",
        "text": "And thine house and thy kingdom shall be established for ever before thee: thy throne shall be established for ever."
      },
      "thought": "The Lord promised David that his throne would last forever, a prophecy fulfilled through Jesus Christ, our Eternal King. Unlike earthly kings who falter, Jesus reigns with perfect love and power, offering us hope that His kingdom will never end. This promise reminds us that no matter the chaos in the world, we can trust in Christ’s eternal rule. As descendants of David, His lineage brings salvation to all. Let this truth fill us with hope as we face uncertainties in life. How can we honor Jesus as our King in our daily actions?",
      "application": "Spend a few minutes today reading a scripture about Jesus Christ and reflecting on how you can honor Him as your King.",
      "question": "In what ways can I show loyalty to Jesus Christ as my Eternal King in my daily life?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Trusting in God’s Strength",
      "scripture": {
        "reference": "1 Samuel 17:45",
        "text": "Then said David to the Philistine, Thou comest to me with a sword, and with a spear, and with a shield: but I come to thee in the name of the Lord of hosts, the God of the armies of Israel, whom thou hast defied."
      },
      "thought": "This week, we’ve learned from David’s life that true strength comes from trusting in the Lord, whether facing giants like Goliath or personal struggles. His courage, friendships, mercy, and reliance on divine guidance show us how to live with faith. From Jonathan, we saw Christlike love in friendship, and from David’s choices, we learned the power of forgiveness. The eternal promise of Christ’s kingdom gives us hope beyond this life. As we reflect on these lessons, let’s commit to facing our battles with the same trust David had in God. How will we carry these insights into the coming week?",
      "application": "Share one lesson from this week’s study with a family member or friend and discuss how it applies to your lives.",
      "question": "Which story or principle from this week’s reading has most inspired me to trust the Lord more fully?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:39:54",
  "source_week_file": "cfm_2026_week_25.json"
}