{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Created in His Image",
      "scripture": {
        "reference": "Genesis 1:26-27",
        "text": "And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. So God created man in his own image, in the image of God created he him; male and female created he them."
      },
      "thought": "This week, we dive into the beautiful story of the Creation in Genesis, Moses, and Abraham. These accounts remind us that Heavenly Father and Jesus Christ are powerful Creators who made the earth and all things in it, including us. We are created in God’s image, which means we have divine potential to become like Him. As we study, we’ll explore what this means for how we see ourselves, care for the world, and honor sacred things like marriage and the Sabbath. These truths can bring light to dark moments and help us feel God’s love in our lives. Let’s open our hearts to the lessons of creation and transformation this week.",
      "application": "Take a moment today to write down one way you see God’s creativity in the world around you, and share it with someone.",
      "question": "How does knowing I am created in God’s image change the way I view myself and others?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Identity",
      "title": "Reflecting God’s Likeness",
      "scripture": {
        "reference": "Moses 2:26-27",
        "text": "And I, God, said unto mine Only Begotten, which was with me from the beginning: Let us make man in our image, after our likeness; and it was so. ... And I, God, created man in mine own image, in the image of mine Only Begotten created I him; male and female created I them."
      },
      "thought": "Reading that we are created in God’s image reminds us of our sacred identity. This truth teaches us that each of us, male and female, carries a divine spark and has worth beyond measure. It’s a powerful reminder when we feel inadequate or compare ourselves to others. Heavenly Father sees us as His children, with potential to become like Him. Knowing this can help us treat ourselves and others with greater respect and love. Let’s hold onto this truth as we navigate life’s challenges today.",
      "application": "Look in the mirror today and say to yourself, 'I am created in God’s image,' and think of one way to honor your body or mind.",
      "question": "How does knowing I reflect God’s image influence the way I treat myself and others?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Responsibility",
      "title": "Stewards of God’s Creations",
      "scripture": {
        "reference": "Abraham 4:28",
        "text": "And the Gods said: We will bless them. And the Gods said: We will cause them to be fruitful and multiply, and replenish the earth, and subdue it, and to have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth."
      },
      "thought": "God has entrusted us with the care of His creations, giving us dominion over the earth and its creatures. This responsibility is a sacred charge to protect and nurture the world around us. Whether it’s caring for the environment, animals, or even our own surroundings, we show gratitude for God’s gifts by being good stewards. This teaches us that our actions matter and can reflect our love for the Creator. Today, let’s consider how we can honor this trust in small, meaningful ways. We are part of God’s plan to sustain His beautiful world.",
      "application": "Pick up litter in your neighborhood or yard today as a way to care for God’s earth.",
      "question": "What is one way I can better care for God’s creations in my daily life?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Worship",
      "title": "Honoring the Holy Sabbath",
      "scripture": {
        "reference": "Genesis 2:2-3",
        "text": "And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made. And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made."
      },
      "thought": "God sanctified the Sabbath day, setting it apart as holy after the work of Creation. This teaches us the importance of rest and worship as part of our weekly rhythm. Keeping the Sabbath holy allows us to draw closer to Heavenly Father and Jesus Christ, reflecting on Their love and creations. It’s a day to recharge spiritually and focus on what matters most. When we honor the Sabbath, we show gratitude for God’s blessings and invite peace into our lives. How can we make this day special and different from the others?",
      "application": "Plan one activity for this coming Sabbath that helps you feel closer to God, like reading scriptures or serving someone.",
      "question": "What makes the Sabbath a blessed and holy day for me?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Relationships",
      "title": "Sacred Bonds of Marriage",
      "scripture": {
        "reference": "Moses 3:18, 24",
        "text": "And I, the Lord God, said unto mine Only Begotten, that it was not good that the man should be alone; wherefore, I will make an help meet for him. ... Therefore shall a man leave his father and his mother, and shall cleave unto his wife; and they shall be one flesh."
      },
      "thought": "God established marriage as a sacred union between a man and a woman, as seen in the story of Adam and Eve. This bond is ordained of God and meant to be a source of strength and unity. It reminds us that relationships built on love and commitment reflect divine principles. Whether married or not, we can honor this sacred institution by supporting strong families and valuing companionship. Today, let’s think about how we can strengthen the relationships that matter most to us. God’s plan for marriage teaches us about love, partnership, and eternity.",
      "application": "Express gratitude to a family member or friend today for their support and companionship in your life.",
      "question": "How can I show greater respect for the sacredness of marriage and family relationships?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Light in Life’s Chaos",
      "scripture": {
        "reference": "Abraham 4:2",
        "text": "And the earth, after it was formed, was empty and desolate, because they had not formed anything but the earth; and darkness reigned upon the face of the deep, and the Spirit of the Gods was brooding upon the face of the waters."
      },
      "thought": "Before the earth became the beautiful world we know, it was empty, desolate, and dark. Yet, through God’s power, it was transformed into something magnificent over time. This reminds us that Heavenly Father and Jesus Christ can bring light and order into the chaos of our lives. When we feel overwhelmed or lost, we can trust in Their creative power to help us. They are still working on us, shaping us into who we are meant to be. Let this truth fill you with hope today, no matter your struggles.",
      "application": "Write down one area of your life that feels chaotic and pray for God’s help to bring light to it today.",
      "question": "How have I seen God bring light or order to a dark or difficult time in my life?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Transformed by Creation Truths",
      "scripture": {
        "reference": "Moses 2:1",
        "text": "And it came to pass that the Lord spake unto Moses, saying: Behold, I reveal unto you concerning this heaven, and this earth; write the words which I speak. I am the Beginning and the End, the Almighty God; by mine Only Begotten I created these things; yea, in the beginning I created the heaven, and the earth upon which thou standest."
      },
      "thought": "This week, we’ve explored the profound story of the Creation and the truths it holds for us. We’ve learned that we are created in God’s image, with divine potential to become like Him. We’ve reflected on our responsibility to care for His world, the sacredness of marriage, and the holiness of the Sabbath. These accounts show us that God can transform chaos into beauty, just as He continues to shape our lives. As we’ve studied, we’ve seen how His creative power brings hope and purpose to our daily walk. Let’s carry these lessons forward, trusting in His ongoing work within us.",
      "application": "Share one insight from this week’s study with a family member or friend and discuss how it has impacted you.",
      "question": "What is one truth from the Creation story that I want to remember and apply in the coming weeks?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:25:55",
  "source_week_file": "cfm_2026_week_03.json"
}