{
  "week_number": 45,
  "title": "Week 45: November 2–8 - Ezekiel 1–3; 33–34; 36–37; 47",
  "date_range": "November 2–8",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "A New Spirit Awaits",
      "scripture": {
        "reference": "Ezekiel 36:26",
        "text": "A new heart also will I give you, and a new spirit will I put within you: and I will take away the stony heart out of your flesh, and I will give you an heart of flesh."
      },
      "thought": "This week, as we study Ezekiel, we’re reminded that God’s love reaches us even in our lowest moments. Ezekiel, a prophet in exile, saw the glory of the Lord far from the temple in Jerusalem, showing us that God is never far from His people. Despite Israel’s struggles and sins, the Lord promised renewal—a new heart and spirit for those who turn to Him. We’ll explore themes of repentance, gathering, healing, and the power of God’s house. These messages can inspire us to seek spiritual revival in our own lives. Let’s open our hearts this week to the transformation God offers.",
      "application": "Take a quiet moment today to pray for a renewed heart and spirit as you begin this week’s study.",
      "question": "How can I invite God’s transforming power into my life this week?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Service",
      "title": "Feed My Sheep Today",
      "scripture": {
        "reference": "Ezekiel 34:14",
        "text": "I will feed them in a good pasture, and upon the high mountains of Israel shall their fold be: there shall they lie in a good fold, and in a fat pasture shall they feed upon the mountains of Israel."
      },
      "thought": "In Ezekiel 34, the Lord calls His leaders shepherds who must feed His sheep with care. We are all shepherds in some way—whether as parents, friends, or ministering brothers and sisters. The ‘good pasture’ and ‘good fold’ symbolize the love, guidance, and safety we can offer others through Christ’s example. As the Savior seeks the lost and strengthens the weak, we too can nurture those around us. Think of someone who needs encouragement or support. How can you feed them with kindness or spiritual strength today?",
      "application": "Reach out to someone in your family or ward with a kind word or small act of service.",
      "question": "Who in my life needs me to be a shepherd today, and how can I help them?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Repentance",
      "title": "Trust in God’s Mercy",
      "scripture": {
        "reference": "Ezekiel 33:11",
        "text": "Say unto them, As I live, saith the Lord God, I have no pleasure in the death of the wicked; but that the wicked turn from his way and live: turn ye, turn ye from your evil ways; for why will ye die, O house of Israel?"
      },
      "thought": "Ezekiel 33 reminds us that the Lord desires to forgive, not to punish. He pleads with His people to turn from sin and live, showing His deep love for each of us. No matter how far we’ve strayed, God’s mercy is ready to welcome us back when we repent. This message can comfort anyone feeling weighed down by mistakes. The Lord doesn’t want us to despair; He wants us to change and find life in Him. Let’s trust in His willingness to forgive as we seek to improve.",
      "application": "Reflect on one area of your life where you can turn more fully to God, and take a small step toward change today.",
      "question": "How does knowing God desires my repentance and life change the way I view my mistakes?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Hope",
      "title": "New Life Through Gathering",
      "scripture": {
        "reference": "Ezekiel 37:12",
        "text": "Therefore prophesy and say unto them, Thus saith the Lord God; Behold, O my people, I will open your graves, and cause you to come up out of your graves, and bring you into the land of Israel."
      },
      "thought": "Ezekiel’s vision of dry bones coming to life in chapter 37 is a powerful symbol of hope and the gathering of Israel. God promises to revive what seems dead, bringing His people back to Him both physically and spiritually. This gathering happens today as we share the gospel, do family history work, and help others come to Christ. It’s a reminder that no one is too far gone for God’s redeeming power. We can find hope in knowing that God is actively working to bring us home. How can we participate in this miraculous gathering?",
      "application": "Spend a few minutes today learning about an ancestor or sharing a gospel message with someone.",
      "question": "How does the gathering of Israel give me hope for myself or my loved ones?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Worship",
      "title": "Healing in God’s House",
      "scripture": {
        "reference": "Ezekiel 47:9",
        "text": "And it shall come to pass, that every thing that liveth, which moveth, whithersoever the rivers shall come, shall live: and there shall be a very great multitude of fish, because these waters shall come thither: for they shall be healed; and every thing shall live whither the river cometh."
      },
      "thought": "In Ezekiel 47, a river flows from the temple, healing the Dead Sea and bringing life to everything it touches. This vision symbolizes the spiritual healing and life we receive through the temple and the Savior’s power. Just as the river revived a barren sea, temple covenants can renew our hearts and families. Attending the temple or preparing to do so brings us closer to Christ’s healing touch. Even if we can’t go often, we can feel this power by living worthy of its blessings. Let’s seek the life-giving waters of God’s house.",
      "application": "Set a goal to prepare for or attend the temple, or discuss temple blessings with your family today.",
      "question": "How have I felt spiritual healing through the temple or preparing for its blessings?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Revelation",
      "title": "Scriptures Unite Us to Christ",
      "scripture": {
        "reference": "Ezekiel 37:17",
        "text": "And join them one to another into one stick; and they shall become one in thine hand."
      },
      "thought": "Ezekiel 37 speaks of two sticks—representing the Bible and the Book of Mormon—becoming one, symbolizing how these scriptures work together to gather us to Christ. Both books testify of the Savior and guide us to Him with complementary truths. As we read them, we feel their united power drawing us closer to God. This vision reminds us how blessed we are to have multiple witnesses of Jesus Christ in our lives. Think of a time these scriptures have strengthened your faith. How can they guide you today?",
      "application": "Read a short passage from both the Bible and the Book of Mormon today, noting how they strengthen your testimony.",
      "question": "How do the Bible and Book of Mormon work together to bring me closer to Jesus Christ?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Renewed by God’s Promises",
      "scripture": {
        "reference": "Ezekiel 36:27",
        "text": "And I will put my spirit within you, and cause you to walk in my statutes, and ye shall keep my judgments, and do them."
      },
      "thought": "This week in Ezekiel, we’ve seen God’s incredible promises of renewal, healing, and gathering. From a new heart and spirit to the life-giving waters of the temple, His love transforms even the most desolate situations. We’ve learned to serve as shepherds, trust in His forgiveness, and unite through sacred scriptures. Ezekiel’s visions remind us that God is always near, ready to revive what seems lost. As we reflect on these lessons, let’s carry forward the hope of His presence. How has this week’s study changed your heart?",
      "application": "Write down one key insight from this week and share it with a family member or friend.",
      "question": "What is one way I’ve felt God’s renewing spirit in my life this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:51:47",
  "source_week_file": "cfm_2026_week_45.json"
}