{
  "week_number": 28,
  "title": "Week 28: July 6–12 - 2 Kings 2–7",
  "date_range": "July 6–12",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Miracles Testify of Christ",
      "scripture": {
        "reference": "2 Kings 6:17",
        "text": "And Elisha prayed, and said, Lord, I pray thee, open his eyes, that he may see. And the Lord opened the eyes of the young man; and he saw: and, behold, the mountain was full of horses and chariots of fire round about Elisha."
      },
      "thought": "This week, as we study 2 Kings 2–7, we’ll explore the powerful ministry of the prophet Elisha, whose miracles reflect the life-giving and healing power of Jesus Christ. From raising the dead to feeding multitudes, Elisha’s actions point us to the Savior’s divine mission. These stories remind us that miracles are not just ancient history—they can happen in our lives today. We’ll also learn about the importance of following prophetic counsel, even when it seems simple or unlikely. As we read, let’s pray to have our spiritual eyes opened, just as Elisha prayed for his servant, to see the Lord’s hand in our lives. Together, we can discover how God’s power and love are always near.",
      "application": "Set a goal as a family to look for small miracles or blessings each day this week and share them during dinner or family prayer.",
      "question": "What is one way I hope to see God’s power in my life this week?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Miracles in Small Things",
      "scripture": {
        "reference": "2 Kings 2:19-21",
        "text": "And the men of the city said unto Elisha, Behold, I pray thee, the situation of this city is pleasant, as my lord seeth: but the water is naught, and the ground barren. He said, Bring me a new cruse, and put salt therein. And they brought it to him. And he went forth unto the spring of the waters, and cast the salt in there, and said, Thus saith the Lord, I have healed these waters; there shall not be from thence any more death or barren land."
      },
      "thought": "In this miracle, Elisha healed the barren waters of a city with a simple act of casting salt, showing God’s power to transform even the smallest things for good. Just as the water was made pure, God can work miracles in the seemingly small challenges of our lives. Whether it’s a strained relationship, a financial worry, or a personal struggle, the Lord can bring healing. This story reminds us to trust in His power, even when the solution seems ordinary or unexpected. As we study Elisha’s miracles, we can learn to recognize God’s hand in our daily lives. Let’s have faith that He is working for our good, even in ways we might not yet see.",
      "application": "Take a moment to write down one small challenge you’re facing and pray for God’s help to see a solution or miracle in it.",
      "question": "How have I seen God turn something small into a blessing in my life?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Obedience",
      "title": "Healing Through Simple Acts",
      "scripture": {
        "reference": "2 Kings 5:13-14",
        "text": "And his servants came near, and spake unto him, and said, My father, if the prophet had bid thee do some great thing, wouldest thou not have done it? how much rather then, when he saith to thee, Wash, and be clean? Then went he down, and dipped himself seven times in Jordan, according to the saying of the man of God: and his flesh came again like unto the flesh of a little child, and he was clean."
      },
      "thought": "Naaman, a mighty captain, was hesitant to follow Elisha’s simple command to wash in the Jordan River to be healed of leprosy. Yet, when he humbled himself and obeyed, he was miraculously cleansed. This story teaches us that the Lord often invites us to do simple things—like praying, reading scriptures, or serving others—that can bring powerful healing to our spiritual challenges. Sometimes, we might overlook these invitations because they seem too easy, but obedience brings blessings. Naaman’s story encourages us to trust the prophet’s counsel, even when it doesn’t seem grand. Let’s seek to follow the Lord’s simple commands with faith and humility today.",
      "application": "Choose one simple teaching from a recent prophet’s message (like daily prayer or kindness) and commit to following it today.",
      "question": "What simple invitation from the Lord or His prophets might I be overlooking in my life?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Hope",
      "title": "Prophecies Bring Future Hope",
      "scripture": {
        "reference": "2 Kings 7:1",
        "text": "Then Elisha said, Hear ye the word of the Lord; Thus saith the Lord, To morrow about this time shall a measure of fine flour be sold for a shekel, and two measures of barley for a shekel, in the gate of Samaria."
      },
      "thought": "In a time of famine and despair, Elisha prophesied that food would be abundant the very next day—a promise that seemed impossible. Yet, the Lord fulfilled His word through unexpected means, showing that His promises through prophets always come to pass. This reminds us that even in our darkest moments, we can hold onto hope by trusting in the words of living prophets. Their teachings and prophecies offer us a vision of God’s plan for our future. As we face uncertainties, we can find strength in knowing the Lord is in control. Let’s cling to hope by acting on prophetic counsel with confidence.",
      "application": "Listen to or read a recent conference talk and write down one promise or prophecy that gives you hope for the future.",
      "question": "How can I strengthen my trust in the words of living prophets during difficult times?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Deliverance",
      "title": "We Are Never Alone",
      "scripture": {
        "reference": "2 Kings 6:16",
        "text": "And he answered, Fear not: for they that be with us are more than they that be with them."
      },
      "thought": "When Elisha’s servant was terrified by the surrounding enemy army, Elisha reassured him that God’s unseen forces were greater than any threat they faced. This powerful message applies to us when we feel overwhelmed by life’s challenges or outnumbered by difficulties. The Lord is with us, often through unseen help or the support of loved ones He places in our path. As President Eyring taught, there are more with us than we can see, and God will bear us up. This story invites us to trust in divine deliverance, even when we can’t see the full picture. Let’s remember that we are never truly alone in our struggles.",
      "application": "Make a list of people or unseen blessings that support you, and thank God for them in your personal prayer today.",
      "question": "When have I felt the Lord’s unseen help during a challenging time in my life?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Growth",
      "title": "Learning from Miracles",
      "scripture": {
        "reference": "2 Kings 4:42-43",
        "text": "And there came a man from Baal-shalisha, and brought the man of God bread of the firstfruits, twenty loaves of barley, and full ears of corn in the husk thereof. And he said, Give unto the people, that they may eat. And his servitor said, What, should I set this before an hundred men? He said again, Give them to the people, that they may eat: for thus saith the Lord, They shall eat, and shall leave thereof."
      },
      "thought": "Elisha’s miracle of feeding a hundred men with just twenty loaves echoes the Savior’s feeding of the multitudes, showing us that God can multiply our small offerings into great blessings. This story invites us to grow by trusting the Lord with what little we have—whether it’s our time, talents, or resources. When we give to Him, He can do more with it than we ever could alone. Miracles like this teach us about the Savior’s power to provide in ways we can’t imagine. As we study Elisha’s life, we can learn to see how God works through us to bless others. Let’s grow by offering what we have to the Lord with faith.",
      "application": "Offer a small act of service today, like sharing a kind word or helping someone, trusting God to multiply its impact.",
      "question": "What small thing can I give to the Lord today, trusting Him to use it for good?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Seeing God’s Power Today",
      "scripture": {
        "reference": "2 Kings 5:15",
        "text": "And he returned to the man of God, he and all his company, and came, and stood before him: and he said, Behold, now I know that there is no God in all the earth, but in Israel: now therefore, I pray thee, take a blessing of thy servant."
      },
      "thought": "This week in 2 Kings 2–7, we’ve seen how Elisha’s miracles and prophecies revealed God’s power and love, just as Naaman came to know the true God after being healed. From healing waters to feeding multitudes, these stories mirror the Savior’s ministry and remind us of His presence in our lives. We’ve learned to trust in prophetic words, obey simple commands, and recognize that we are never alone in our trials. These accounts encourage us to open our spiritual eyes to see miracles around us. As we reflect on this week, let’s carry forward the faith to seek God’s hand in both small and great things. Together, we can testify, like Naaman, of the living God who works in our lives today.",
      "application": "Share with a family member or friend one way you’ve seen God’s power or a small miracle in your life this week.",
      "question": "How has studying Elisha’s ministry helped me see the Savior’s power more clearly in my own life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:41:50",
  "source_week_file": "cfm_2026_week_28.json"
}