{
  "week_number": 39,
  "title": "Week 39: September 21–27 - Isaiah 13–14; 22; 24–30; 35",
  "date_range": "September 21–27",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "A Marvellous Work Begins",
      "scripture": {
        "reference": "Isaiah 29:14",
        "text": "Therefore, behold, I will proceed to do a marvellous work among this people, even a marvellous work and a wonder: for the wisdom of their wise men shall perish, and the understanding of their prudent men shall be hid."
      },
      "thought": "This week, we dive into the powerful words of Isaiah, a prophet who boldly warned kingdoms of the consequences of sin while offering hope through God’s promises. In Isaiah 29:14, we see a glimpse of the 'marvellous work and a wonder'—a prophecy of the Restoration of the gospel in our day. Isaiah’s messages remind us that even in times of darkness, the Lord has a plan to restore what is lost and heal what is broken. His words are not just for ancient Israel but for us, as we are part of this incredible work today. Let’s explore how Isaiah’s teachings about pride, repentance, and the Savior’s mission apply to our lives. As we study, we’ll find strength in Christ’s power to save and renew us.",
      "application": "Take a moment today to write down one way you’ve seen the Lord’s 'marvellous work' in your life or family, such as through the Book of Mormon or temple blessings.",
      "question": "How does knowing you are part of the Lord’s 'marvellous work' give you purpose this week?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Hope",
      "title": "Rest from Our Sorrows",
      "scripture": {
        "reference": "Isaiah 14:3",
        "text": "And it shall come to pass in the day that the Lord shall give thee rest from thy sorrow, and from thy fear, and from the hard bondage wherein thou wast made to serve."
      },
      "thought": "Isaiah’s promise in Isaiah 14:3 offers a beautiful assurance that the Lord will bring rest from our sorrows and fears. Just as He promised relief to ancient Israel from their burdens, He offers us peace today through the Savior. Life can feel heavy with worries or challenges, but Jesus Christ invites us to lay those burdens at His feet. This verse reminds us that no matter the struggles we face, there is hope for relief and renewal in Him. As we turn to the Lord, we can find strength to carry on, knowing He is with us. Let this promise inspire you to seek His comforting presence today.",
      "application": "Spend a quiet moment today praying about a specific sorrow or fear, asking the Lord for His rest and peace.",
      "question": "When have you felt the Lord give you rest from a burden, and how did it strengthen your faith?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Faith",
      "title": "Victory Over Death",
      "scripture": {
        "reference": "Isaiah 25:8",
        "text": "He will swallow up death in victory; and the Lord God will wipe away tears from off all faces; and the rebuke of his people shall he take away from off all the earth: for the Lord hath spoken it."
      },
      "thought": "Isaiah 25:8 is a powerful testimony of Jesus Christ’s victory over death through His Resurrection. This promise brings incredible hope, reminding us that death is not the end, and our Savior has the power to wipe away every tear. In moments of grief or fear of loss, we can hold onto this truth—Christ has triumphed, and because of Him, we will live again. This verse also speaks to the comfort He offers now, as He heals our hearts and lifts our burdens. As we trust in Him, we can face life’s challenges with faith in His ultimate victory. Let this promise strengthen your testimony of the Savior today.",
      "application": "Share with a family member or friend why the Resurrection of Jesus Christ brings you hope, using this verse as a starting point.",
      "question": "How does knowing Christ has swallowed up death in victory change the way you view life’s challenges?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Repentance",
      "title": "Danger of Turning Away",
      "scripture": {
        "reference": "Isaiah 29:13",
        "text": "Wherefore the Lord said, Forasmuch as this people draw near me with their mouth, and with their lips do honour me, but have removed their heart far from me, and their fear toward me is taught by the precept of men."
      },
      "thought": "Isaiah 29:13 warns of the spiritual danger of giving lip service to God while our hearts are far from Him. This verse challenges us to examine our own lives—are we truly devoted to the Lord, or are we just going through the motions? When our actions don’t match our faith, we risk losing the closeness with God that brings peace and direction. Isaiah’s words remind us that true worship comes from the heart, not just words or outward appearances. The Lord desires our sincere love and commitment, and He invites us to return to Him fully. Today, let’s reflect on how we can align our hearts with our actions.",
      "application": "Take a few minutes to honestly evaluate one area of your spiritual life, like prayer or scripture study, and set a goal to make it more heartfelt.",
      "question": "What is one way you can draw your heart closer to the Lord today?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Deliverance",
      "title": "Refuge in the Storm",
      "scripture": {
        "reference": "Isaiah 25:4",
        "text": "For thou hast been a strength to the poor, a strength to the needy in his distress, a refuge from the storm, a shadow from the heat, when the blast of the terrible ones is as a storm against the wall."
      },
      "thought": "In Isaiah 25:4, we are reminded that the Lord is our refuge from life’s storms, just as a shelter protects us from harsh weather. Whether we face emotional struggles, financial hardships, or other challenges, Jesus Christ offers strength and safety. This verse paints a vivid picture of His care—He is a shadow from the heat and a shield against the blasts of life. No matter how fierce the storm, we can turn to Him for peace and protection. As we trust in His power, we find the courage to keep moving forward. Let this image of Christ as your refuge bring comfort to your heart today.",
      "application": "When you feel overwhelmed today, pause and visualize the Savior as your refuge, and ask Him for strength in a specific challenge.",
      "question": "How has the Lord been a refuge for you during a personal storm?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Blessings",
      "title": "Healing the Broken",
      "scripture": {
        "reference": "Isaiah 35:7",
        "text": "And the parched ground shall become a pool, and the thirsty land springs of water: in the habitation of dragons, where each lay, shall be grass with reeds and rushes."
      },
      "thought": "Isaiah 35:7 offers a beautiful image of restoration, where parched ground becomes a pool and thirsty land flows with water. This symbolizes how the Lord can heal and renew what seems broken or lost in our lives. Whether it’s a strained relationship, a personal struggle, or a spiritual drought, God has the power to bring life and hope back to us. This promise reminds us that nothing is beyond His reach—He can transform even the most barren places in our hearts. As we turn to Him, we invite His healing waters to refresh us. Trust in His ability to restore you today, no matter how impossible it may seem.",
      "application": "Identify one area of your life that feels 'parched' and pray specifically for the Lord’s healing and renewal in that area.",
      "question": "What is one way you’ve seen the Lord turn a barren area of your life into something full of hope?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Part of His Wonder",
      "scripture": {
        "reference": "Isaiah 30:18",
        "text": "And therefore will the Lord wait, that he may be gracious unto you, and therefore will he be exalted, that he may have mercy upon you: for the Lord is a God of judgment: blessed are all they that wait for him."
      },
      "thought": "As we close this week of studying Isaiah, let’s reflect on the powerful themes of warning, hope, and restoration woven through his words. From the promise of rest in Isaiah 14 to the victory over death in Isaiah 25, we’ve seen how Jesus Christ is central to God’s plan for us. Isaiah 30:18 reminds us that the Lord waits to show us mercy, ready to bless us as we turn to Him. We’ve learned about the dangers of pride and straying, but also the incredible promise of healing and renewal. We are part of His 'marvellous work and a wonder,' living in a time of Restoration. Carry these truths into the coming week, trusting in His grace and power.",
      "application": "Share with your family or a friend one insight from this week’s study that strengthened your testimony of Jesus Christ.",
      "question": "How has studying Isaiah this week helped you feel closer to the Savior and His work in your life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:48:21",
  "source_week_file": "cfm_2026_week_39.json"
}