{
  "week_number": 13,
  "title": "Week 13: March 23–29 - Exodus 1–6",
  "date_range": "March 23–29",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "God Remembers His Covenant",
      "scripture": {
        "reference": "Exodus 6:6-7",
        "text": "Wherefore say unto the children of Israel, I am the Lord, and I will bring you out from under the burdens of the Egyptians, and I will rid you out of their bondage, and I will redeem you with a stretched out arm, and with great judgments: And I will take you to me for a people, and I will be to you a God: and ye shall know that I am the Lord your God, which bringeth you out from under the burdens of the Egyptians."
      },
      "thought": "This week, as we dive into Exodus 1–6, we witness the struggles of the Israelites under Egyptian bondage and God’s powerful promise to deliver them. Their story reminds us that even in our darkest moments, God does not forget His people or His covenants. He sees our pain, hears our cries, and promises redemption in His own time and way. Just as He declared to Israel, 'I am the Lord your God,' He reassures us today that we are never alone in our challenges. This week’s readings invite us to trust in His timing and recognize His hand in our deliverance. Let’s open our hearts to the lessons of faith, reverence, and purpose found in these chapters.",
      "application": "Take a moment today to write down one challenge you’re facing and a prayer asking God to help you trust in His timing.",
      "question": "How can I see God’s hand in my life, even when I feel burdened or forgotten?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Service",
      "title": "Serving in Small Ways",
      "scripture": {
        "reference": "Exodus 1:15-17",
        "text": "And the king of Egypt spake to the Hebrew midwives, of which the name of the one was Shiphrah, and the name of the other Puah: And he said, When ye do the office of a midwife to the Hebrew women, and see them upon the stools; if it be a son, then ye shall kill him: but if it be a daughter, then she shall live. But the midwives feared God, and did not as the king of Egypt commanded them, but saved the men children alive."
      },
      "thought": "The courage of the Hebrew midwives, Shiphrah and Puah, shows us how God can work through ordinary people to fulfill His extraordinary purposes. By choosing to fear God over Pharaoh, they protected countless lives, including Moses, who would later lead Israel to freedom. Their story teaches us that even small acts of service and obedience can play a vital role in God’s plan. We may not always see the full impact of our efforts, but God does. Like these faithful women, we can contribute to His work in our families, wards, and communities. Let their example inspire us to serve with faith, no matter how small the task seems.",
      "application": "Look for one small way to serve someone today, such as offering a kind word or helping with a simple task.",
      "question": "What small acts of service can I do this week that might contribute to God’s work?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Deliverance",
      "title": "Trusting in God’s Deliverance",
      "scripture": {
        "reference": "Exodus 2:23-25",
        "text": "And it came to pass in process of time, that the king of Egypt died: and the children of Israel sighed by reason of the bondage, and they cried, and their cry came up unto God by reason of the bondage. And God heard their groaning, and God remembered his covenant with Abraham, with Isaac, and with Jacob. And God looked upon the children of Israel, and God had respect unto them."
      },
      "thought": "The Israelites’ cries in bondage did not go unheard—God heard their groans and remembered His covenant with their ancestors. This moment reminds us that even when we feel trapped by life’s hardships, God sees us and cares deeply about our struggles. He is our Deliverer, just as He was for Israel, and He responds to our pleas in His perfect way. We may not always understand His timing, but we can trust that He is working for our good. This scripture invites us to turn to Him in our challenges, knowing He will never forget us. Let’s hold onto hope as we await His deliverance in our lives.",
      "application": "Spend a few minutes in prayer today, pouring out your heart to God about a specific struggle you’re facing.",
      "question": "How have I seen God deliver me from challenges in the past, and how can that strengthen my trust in Him now?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Worship",
      "title": "Reverence for Sacred Things",
      "scripture": {
        "reference": "Exodus 3:5-6",
        "text": "And he said, Draw not nigh hither: put off thy shoes from off thy feet, for the place whereon thou standest is holy ground. Moreover he said, I am the God of thy father, the God of Abraham, the God of Isaac, and the God of Jacob. And Moses hid his face; for he was afraid to look upon God."
      },
      "thought": "When Moses encountered the burning bush, God taught him about reverence by instructing him to remove his shoes on holy ground. Moses’s response—hiding his face in awe—shows his deep respect for God’s presence. This teaches us the importance of treating holy places and things with reverence in our own lives, whether at church, in the temple, or during personal prayer. Reverence helps us draw closer to God and feel His Spirit more fully. We can cultivate this same awe by being mindful of how we approach sacred moments. Let’s strive to honor God by creating space for reverence each day.",
      "application": "Choose one sacred place or activity today, like family prayer, and focus on being fully present and reverent during it.",
      "question": "What can I do to make my home or personal worship a more reverent, sacred space?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Faith",
      "title": "God Empowers the Called",
      "scripture": {
        "reference": "Exodus 4:10-12",
        "text": "And Moses said unto the Lord, O my Lord, I am not eloquent, neither heretofore, nor since thou hast spoken unto thy servant: but I am slow of speech, and of a slow tongue. And the Lord said unto him, Who hath made man’s mouth? or who maketh the dumb, or deaf, or the seeing, or the blind? have not I the Lord? Now therefore go, and I will be with thy mouth, and teach thee what thou shalt say."
      },
      "thought": "Moses felt inadequate when God called him to lead Israel, worrying about his lack of eloquence. Yet God reassured him, promising to be with his mouth and teach him what to say. This powerful exchange reminds us that when God calls us to do His work, He also equips us with the strength and abilities we need. We don’t have to rely on our own skills alone—God’s power can overcome our weaknesses. Whether it’s a church calling, a prompting, or a personal challenge, we can trust that He will help us. Let’s step forward in faith, knowing He is with us.",
      "application": "Identify one task or calling you feel inadequate for, and pray specifically for God’s help to strengthen you in it today.",
      "question": "When have I felt God’s power helping me overcome my weaknesses to do His work?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Waiting on the Lord",
      "scripture": {
        "reference": "Exodus 5:22-23",
        "text": "And Moses returned unto the Lord, and said, Lord, wherefore hast thou so evil entreated this people? why is it that thou hast sent me? For since I came to Pharaoh to speak in thy name, he hath done evil to this people; neither hast thou delivered thy people at all."
      },
      "thought": "Moses felt discouraged when his efforts to free Israel seemed to make things worse, questioning why God had sent him. Many of us can relate to this frustration when our sincere efforts don’t yield the results we expect. Yet, as we learn in Exodus 6, God reassured Moses that His purposes would be fulfilled in His own time. This teaches us to hold onto hope, even when progress feels slow or invisible. God sees the bigger picture and invites us to trust Him through the waiting. Let’s remember that delays are not denials, but part of His perfect plan for us.",
      "application": "Reflect on a situation where you’re waiting for an answer or result, and write down one way you can show trust in God’s timing today.",
      "question": "How can I find peace in waiting on the Lord, even when I don’t see immediate results?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "God’s Covenant Sustains Us",
      "scripture": {
        "reference": "Exodus 3:7-8",
        "text": "And the Lord said, I have surely seen the affliction of my people which are in Egypt, and have heard their cry by reason of their taskmasters; for I know their sorrows; And I am come down to deliver them out of the hand of the Egyptians, and to bring them up out of that land unto a good land and a large, unto a land flowing with milk and honey; unto the place of the Canaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and the Jebusites."
      },
      "thought": "As we wrap up our study of Exodus 1–6 this week, we’ve seen God’s unwavering commitment to His covenant people, even in their darkest times of bondage. From the courage of faithful women to Moses’s call at the burning bush, we’ve learned that God works through us, empowers us, and delivers us in His timing. He hears our cries, as He heard Israel’s, and promises a brighter future. We’ve been reminded to approach Him with reverence and trust, even when we feel inadequate or discouraged. These chapters assure us that we are never forgotten—God remembers His promises to us. Let’s carry this hope into the coming week, trusting in His plan for our lives.",
      "application": "Share one insight from this week’s study with a family member or friend, and discuss how it applies to your lives.",
      "question": "What is one way I’ve felt God’s presence or promises in my life this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:32:15",
  "source_week_file": "cfm_2026_week_13.json"
}