{
  "week_number": 43,
  "title": "Week 43: October 19–25 - Jeremiah 1–3; 7; 16–18; 20",
  "date_range": "October 19–25",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "God Knew Us Before Birth",
      "scripture": {
        "reference": "Jeremiah 1:5",
        "text": "Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto the nations."
      },
      "thought": "This week, as we study Jeremiah, we begin with a powerful truth: God knew us before we were born, just as He knew Jeremiah. This prophet felt unprepared for his calling, yet the Lord reassured him that he was chosen for a divine mission long before his birth. Like Jeremiah, each of us has a unique purpose in God’s plan. We’ll explore themes of identity, faith, and service as we see how Jeremiah’s story mirrors our own. His journey reminds us that God is with us, ready to guide and strengthen us, no matter how unprepared we may feel. Let’s dive into these chapters to discover how we can trust in His plan for us.",
      "application": "Take a moment today to write down one way you feel God has prepared you for a specific role or challenge in your life.",
      "question": "How does knowing that God knew you before you were born influence the way you view your purpose?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Identity",
      "title": "Chosen Before We Came",
      "scripture": {
        "reference": "Jeremiah 1:8",
        "text": "Be not afraid of their faces: for I am with thee to deliver thee, saith the Lord."
      },
      "thought": "Jeremiah felt inadequate when called as a prophet, fearing he couldn’t speak or face opposition. Yet, God promised to be with him, to deliver him from fear and danger. This promise extends to us as well—we are not alone in our challenges. Just as God knew Jeremiah before birth and prepared him, He knows us and stands by our side. When we feel overwhelmed by life’s demands, we can trust that the Lord is there to guide and protect us. His presence gives us courage to step forward in faith.",
      "application": "When you face a difficult moment today, pause and silently ask God for strength, remembering His promise to be with you.",
      "question": "When have you felt God’s presence helping you overcome fear or doubt?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Faith",
      "title": "Drinking from Living Waters",
      "scripture": {
        "reference": "Jeremiah 2:13",
        "text": "For my people have committed two evils; they have forsaken me the fountain of living waters, and hewed them out cisterns, broken cisterns, that can hold no water."
      },
      "thought": "The Lord compares Himself to a fountain of living waters, while the people turned to broken cisterns—symbols of relying on false sources of strength instead of God. In a dry land, a fountain was life-giving, unlike cracked containers that couldn’t hold water. We, too, can sometimes seek happiness in things that ultimately fail us, rather than turning to the Savior. Jesus offers us living water—His teachings, love, and peace—that truly sustains us. By choosing Him, we find lasting joy and strength. Let’s reflect on how we can drink from His fountain every day.",
      "application": "Spend five minutes today reading a favorite scripture or conference talk to refresh your spirit with Christ’s living water.",
      "question": "What ‘broken cisterns’ might you be relying on, and how can you turn to the Savior instead?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Service",
      "title": "Gathering Israel Together",
      "scripture": {
        "reference": "Jeremiah 16:16",
        "text": "Behold, I will send for many fishers, saith the Lord, and they shall fish them; and after will I send for many hunters, and they shall hunt them from every mountain, and from every hill, and out of the holes of the rocks."
      },
      "thought": "Jeremiah speaks of fishers and hunters gathering God’s people, a powerful image of the latter-day work of bringing souls to Christ. President Russell M. Nelson teaches that this gathering of Israel is the most important work on earth today. We are called to be part of this mission, whether as missionaries or by sharing the gospel with friends and family. Every kind word or invitation can help someone come closer to Zion. Like Jeremiah, we may feel unprepared, but God equips us for this sacred work. Let’s look for ways to help gather those around us.",
      "application": "Reach out to a friend or family member today with a simple message of love or an invitation to a Church activity.",
      "question": "Who in your life might need to feel God’s love through your actions this week?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Growth",
      "title": "Shaped by God’s Hands",
      "scripture": {
        "reference": "Jeremiah 18:6",
        "text": "O house of Israel, cannot I do with you as this potter? saith the Lord. Behold, as the clay is in the potter’s hand, so are ye in mine hand, O house of Israel."
      },
      "thought": "The Lord compares us to clay in a potter’s hands, showing how He shapes and molds our lives with purpose. Just as a potter transforms raw clay into something beautiful, God works with us through trials and experiences to help us grow. This process isn’t always easy, but it’s guided by His loving hands. Jeremiah’s message invites us to trust God’s plan, even when we don’t understand it. As we yield to His will, we become vessels of His light. Let’s strive to be pliable in His hands today.",
      "application": "Reflect on a current challenge and write down one way you can trust God to shape you through it.",
      "question": "How have past difficulties helped you become who you are today under God’s guidance?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Revelation",
      "title": "God’s Word Burns Within",
      "scripture": {
        "reference": "Jeremiah 20:9",
        "text": "Then I said, I will not make mention of him, nor speak any more in his name. But his word was in mine heart as a burning fire shut up in my bones, and I was weary with forbearing, and I could not stay."
      },
      "thought": "Jeremiah felt the weight of his calling, even wanting to stop speaking God’s word, yet he couldn’t hold it in—it burned like a fire in his heart. This shows the power of divine revelation and how God’s truth compels us to share it. We, too, can feel this fire when we receive personal inspiration or hear the prophet’s voice. It urges us to act, to testify, and to live the gospel boldly. Even when it’s hard, God’s word within us can give us strength to keep going. Let’s listen for that burning witness today.",
      "application": "Share a gospel truth or testimony with someone today, whether in person or through a message.",
      "question": "When have you felt God’s word or inspiration burning in your heart, and how did it influence you?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Trusting God’s Eternal Plan",
      "scripture": {
        "reference": "Jeremiah 3:14",
        "text": "Turn, O backsliding children, saith the Lord; for I am married unto you: and I will take you one of a city, and two of a family, and I will bring you to Zion."
      },
      "thought": "This week, we’ve learned from Jeremiah that God knew us before we were born and has a plan for each of us, just as He did for this ancient prophet. We’ve seen how He offers living waters to sustain us, calls us to gather His people, and shapes us like a potter shapes clay. Jeremiah’s burning desire to share God’s word reminds us to listen for divine inspiration in our lives. His story teaches us to trust in God’s presence, even amidst challenges. Above all, we are part of His covenant to bring His children to Zion, one by one. Let’s carry these lessons forward with faith and purpose.",
      "application": "Review one insight from this week’s study and set a goal to apply it in the coming days.",
      "question": "How has studying Jeremiah this week deepened your trust in God’s plan for your life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:50:33",
  "source_week_file": "cfm_2026_week_43.json"
}