{
  "week_number": 27,
  "title": "Week 27: June 29–July 5 - 1 Kings 12–13; 17–22",
  "date_range": "June 29–July 5",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Follow Him with Faith",
      "scripture": {
        "reference": "1 Kings 18:21",
        "text": "And Elijah came unto all the people, and said, How long halt ye between two opinions? if the Lord be God, follow him: but if Baal, then follow him. And the people answered him not a word."
      },
      "thought": "This week, we dive into the powerful stories of Elijah and the divided kingdoms of Israel and Judah from 1 Kings 12–22. These chapters reveal a time of spiritual struggle, where people wavered between following the Lord and turning to false gods like Baal. Elijah’s bold challenge to choose God over Baal reminds us of our own need to commit fully to the Savior. We’ll explore themes of faith, sacrifice, leadership, and listening to the still, small voice of the Spirit. These stories show that even in difficult times, the Lord works miracles—both grand and personal—to guide and bless His people. Let’s open our hearts to the lessons He has for us this week.",
      "application": "Take a few minutes today to preview 1 Kings 12–22 and pray for insight on how these stories can strengthen your faith.",
      "question": "What is one way I can more fully commit to following the Lord this week?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Sacrifice Brings Divine Blessings",
      "scripture": {
        "reference": "1 Kings 17:13-14",
        "text": "And Elijah said unto her, Fear not; go and do as thou hast said: but make me thereof a little cake first, and bring it unto me, and after make for thee and for thy son. For thus saith the Lord God of Israel, The barrel of meal shall not waste, neither shall the cruse of oil fail, until the day that the Lord sendeth rain upon the earth."
      },
      "thought": "In 1 Kings 17, the widow of Zarephath faced an impossible choice—feed Elijah or save the last of her food for herself and her son. Despite her fear, she trusted the prophet’s promise and sacrificed what little she had. Her faith led to a miracle as her meager supplies lasted through the famine. This story teaches us that when the Lord asks us to sacrifice, He often has greater blessings in store. In our lives, we may be asked to give up time, comfort, or resources to follow Him. Trusting in His promises, even when it’s hard, can strengthen our faith and open the way for His help.",
      "application": "Identify one small sacrifice you can make today, such as giving up personal time to serve someone, and act on it with faith.",
      "question": "How have I seen the Lord bless me when I’ve made sacrifices to follow Him?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Obedience",
      "title": "Choose to Follow Christ",
      "scripture": {
        "reference": "1 Kings 18:36-37",
        "text": "And it came to pass at the time of the offering of the evening sacrifice, that Elijah the prophet came near, and said, Lord God of Abraham, Isaac, and of Israel, let it be known this day that thou art God in Israel, and that I am thy servant, and that I have done all these things at thy word. Hear me, O Lord, hear me, that this people may know that thou art the Lord God, and that thou hast turned their heart back again."
      },
      "thought": "In 1 Kings 18, Elijah boldly confronted the priests of Baal, showing the power of the true God through a dramatic miracle of fire from heaven. His prayer reveals his deep desire for the people to turn their hearts back to the Lord. This moment challenges us to consider our own choices—are we fully committed to following Jesus Christ, or do we waver like the Israelites did? In a world full of distractions and competing priorities, we must decide daily to stand with the Savior. Elijah’s example invites us to act with courage and obedience. Choosing Christ brings clarity and strength to face any challenge.",
      "application": "Make a conscious choice today to follow Jesus by saying no to a distraction and yes to a spiritual priority, like prayer or scripture study.",
      "question": "What is one situation where I need to choose to follow Jesus Christ more fully?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Revelation",
      "title": "Hearing the Still Voice",
      "scripture": {
        "reference": "1 Kings 19:11-12",
        "text": "And he said, Go forth, and stand upon the mount before the Lord. And, behold, the Lord passed by, and a great and strong wind rent the mountains, and brake in pieces the rocks before the Lord; but the Lord was not in the wind: and after the wind an earthquake; but the Lord was not in the earthquake: And after the earthquake a fire; but the Lord was not in the fire: and after the fire a still small voice."
      },
      "thought": "After the dramatic events on Mount Carmel, Elijah found himself alone and discouraged, hiding in a cave. In 1 Kings 19, the Lord didn’t speak through the powerful wind, earthquake, or fire, but through a still, small voice. This teaches us that God often communicates in quiet, personal ways, even during our hardest moments. We may look for big signs, but the Spirit often whispers peace to our hearts. Tuning out life’s noise helps us hear His guidance. Let’s seek those quiet moments to feel His presence and direction in our lives.",
      "application": "Set aside five minutes today in a quiet place to listen for the Spirit’s gentle promptings through prayer or reflection.",
      "question": "When have I felt the Lord speak to me through a still, small voice?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Service",
      "title": "Lead with Christlike Love",
      "scripture": {
        "reference": "1 Kings 12:7",
        "text": "And they spake unto him, saying, If thou wilt be a servant unto this people this day, and wilt serve them, and answer them, and speak good words to them, then they will be thy servants for ever."
      },
      "thought": "In 1 Kings 12, King Rehoboam had a chance to unite his people by serving them with kindness, as his advisors suggested. Instead, he chose harshness and lost much of his kingdom. This story reminds us that true leadership is rooted in Christlike attributes like humility and service. Whether we lead in our families, workplaces, or Church callings, serving others with love builds trust and loyalty. Jesus taught that the greatest leaders are those who serve. Let’s strive to lead by lifting others, just as He did.",
      "application": "Look for an opportunity today to serve someone in your family or community with a kind word or helpful act.",
      "question": "How can I better lead others by serving them with Christlike love?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Trust in God’s Power",
      "scripture": {
        "reference": "1 Kings 17:21-22",
        "text": "And he stretched himself upon the child three times, and cried unto the Lord, and said, O Lord my God, I pray thee, let this child’s soul come into him again. And the Lord heard the voice of Elijah; and the soul of the child came into him again, and he revived."
      },
      "thought": "In 1 Kings 17, Elijah witnessed a heartbreaking loss when the widow’s son died, yet he turned to the Lord with unwavering hope and faith. Through his earnest prayer, God restored the boy to life—a powerful reminder of the Lord’s ability to bring hope even in the darkest moments. While we may not always see such dramatic miracles, this story encourages us to trust in God’s power to heal and renew. Challenges in our lives can feel overwhelming, but the Lord hears our prayers. His strength can lift us when we feel broken. Let’s hold onto hope, knowing He is with us.",
      "application": "Write down one worry or challenge you’re facing, then pray specifically for hope and strength to trust in God’s timing.",
      "question": "How has trusting in God’s power brought hope to me during difficult times?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Commit to His Path",
      "scripture": {
        "reference": "1 Kings 19:19-20",
        "text": "So he departed thence, and found Elisha the son of Shaphat, who was plowing with twelve yoke of oxen before him, and he with the twelfth: and Elijah passed by him, and cast his mantle upon him. And he left the oxen, and ran after Elijah, and said, Let me, I pray thee, kiss my father and my mother, and then I will follow thee. And he said unto him, Go back again: for what have I done to thee?"
      },
      "thought": "This week in 1 Kings 12–22, we’ve seen the courage of Elijah, the faith of the widow, and the call of Elisha to follow the prophet’s path. These stories remind us to choose the Lord over worldly distractions, to sacrifice with faith, and to listen for His still, small voice. From Rehoboam’s failure to lead with love to Elijah’s miracles, we’ve learned that true strength comes from trusting God. Elisha’s immediate willingness to leave everything behind challenges us to commit fully to the Savior. As we reflect on these lessons, let’s carry forward a renewed desire to follow Him. May we seek His guidance and blessings in all we do.",
      "application": "Share one lesson from this week with a family member or friend and discuss how it can strengthen your faith together.",
      "question": "What is one key takeaway from this week’s study that I want to apply in my life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:41:15",
  "source_week_file": "cfm_2026_week_27.json"
}