{
  "week_number": 31,
  "title": "Week 31: July 27–August 2 - Ezra 1; 3–7; Nehemiah 2; 4–6; 8",
  "date_range": "July 27–August 2",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Doing a Great Work",
      "scripture": {
        "reference": "Nehemiah 6:3",
        "text": "And I sent messengers unto them, saying, I am doing a great work, so that I cannot come down: why should the work cease, whilst I leave it, and come down to you?"
      },
      "thought": "This week, we dive into the inspiring stories of Ezra and Nehemiah, who led the Jewish people in a great work of rebuilding—both physically and spiritually—after years of captivity in Babylonia. Their efforts focused on restoring the temple, the city walls of Jerusalem, and the people’s commitment to God’s law. Despite opposition, they pressed forward with faith, knowing their work was divinely appointed. These accounts remind us that we, too, are engaged in a great work as we build our lives on the foundation of covenants and strive to follow the Savior. Their stories can inspire us to recognize the Lord’s hand in our efforts and to persevere through challenges. Let’s explore how their dedication can strengthen our own resolve to serve God.",
      "application": "Take a moment today to write down one 'great work' you feel called to do in your family or community, and pray for strength to accomplish it.",
      "question": "What is a 'great work' the Lord has given you to do in your life right now?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Inspired by the Lord",
      "scripture": {
        "reference": "Ezra 1:1",
        "text": "Now in the first year of Cyrus king of Persia, that the word of the Lord by the mouth of Jeremiah might be fulfilled, the Lord stirred up the spirit of Cyrus king of Persia, that he made a proclamation throughout all his kingdom, and put it also in writing."
      },
      "thought": "The Lord works in remarkable ways to accomplish His purposes, often through unexpected people. In Ezra 1, we see how God stirred the heart of Cyrus, a Persian king, to allow the Jewish people to return to Jerusalem and rebuild the temple. This shows us that the Lord can inspire anyone—whether they are part of His covenant people or not—to help fulfill His plans. We can trust that God is at work in the world around us, even when we don’t see it. Today, let’s look for ways the Lord is guiding those around us, including friends, neighbors, or leaders, to support His work. It’s a reminder that we are never alone in our efforts to follow Him.",
      "application": "Reach out to someone outside your usual circle today and thank them for a positive influence they’ve had in your life.",
      "question": "Who in your life might the Lord be inspiring to help you or others, even if they don’t realize it?",
      "historical_context": "After Persia conquered Babylonia, the Lord inspired the Persian king, Cyrus, to send a group of Jews to Jerusalem to rebuild the temple, fulfilling prophecies and allowing the Jews to return after about 70 years of captivity."
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Worship",
      "title": "Joy in the Temple",
      "scripture": {
        "reference": "Ezra 3:11",
        "text": "And they sang together by course in praising and giving thanks unto the Lord; because he is good, for his mercy endureth for ever toward Israel. And all the people shouted with a great shout, when they praised the Lord, because the foundation of the house of the Lord was laid."
      },
      "thought": "Imagine the overwhelming joy of the Jewish people as they laid the foundation of the temple after it had been destroyed by the Babylonians. In Ezra 3, their shouts of praise and thanksgiving echo their deep gratitude for the house of the Lord. The temple was more than a building; it was a symbol of God’s presence and mercy in their lives. We, too, can feel this joy when we attend the temple or even think about its sacred purpose. It’s a place where we draw closer to Heavenly Father and the Savior. Let’s cherish the temples we have today and the peace they bring to our hearts.",
      "application": "Look at a picture of a temple with your family today and share one reason the temple brings you joy.",
      "question": "What is one way the temple has helped you feel closer to Heavenly Father?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Challenges",
      "title": "Overcoming Opposition Together",
      "scripture": {
        "reference": "Nehemiah 4:6",
        "text": "So built we the wall; and all the wall was joined together unto the half thereof: for the people had a mind to work."
      },
      "thought": "Rebuilding the walls of Jerusalem was no easy task for Nehemiah and the people, as they faced mockery and threats from their enemies. Yet, in Nehemiah 4, we learn that they succeeded because they had 'a mind to work.' Their unity and determination kept them focused on the Lord’s purposes despite opposition. In our lives, we also face challenges when trying to do what’s right, whether it’s standing up for our beliefs or serving others. Like the people of Jerusalem, we can find strength in working together with family, friends, or ward members. The Lord blesses our efforts when we unite in His work with a willing heart.",
      "application": "Team up with a family member or friend today to complete a small task or service project, focusing on unity in your efforts.",
      "question": "How can working together with others help you overcome challenges in doing the Lord’s work?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Purpose",
      "title": "Strengthened by God’s Hand",
      "scripture": {
        "reference": "Nehemiah 2:18",
        "text": "Then I told them of the hand of my God which was good upon me; as also the king’s words that he had spoken unto me. And they said, Let us rise up and build. So they strengthened their hands for this good work."
      },
      "thought": "Nehemiah felt the 'good hand of God' upon him as he led the effort to rebuild Jerusalem’s walls, and this assurance inspired others to join in the work. This phrase reminds us that when we are doing the Lord’s work, we are never alone—His strength and guidance are with us. Whether we’re serving in our families, callings, or communities, we can feel His hand supporting us. Reflecting on times when we’ve felt God’s help can give us confidence to keep going, even when the task feels daunting. Nehemiah’s story teaches us to trust in divine assistance as we strive to fulfill our purpose. Let’s seek His strength today in all we do.",
      "application": "Before starting a challenging task today, pause to pray and ask for the Lord’s hand to be upon you.",
      "question": "When have you felt the 'good hand of God' helping you in your efforts to serve Him?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Blessings",
      "title": "Treasuring God’s Word",
      "scripture": {
        "reference": "Nehemiah 8:3",
        "text": "And he read therein before the street that was before the water gate from the morning until midday, before the men and the women, and those that could understand; and the ears of all the people were attentive unto the book of the law."
      },
      "thought": "After years of captivity with limited access to the scriptures, the Jewish people gathered to hear Ezra read the book of the law, listening attentively for hours. Their eagerness in Nehemiah 8 shows how much they valued God’s word as a source of guidance and strength. We are blessed to have the scriptures readily available to us, filled with truths that can guide our lives. When we approach the scriptures with the same attentiveness, we invite the Spirit to teach us and bring us closer to the Savior. This story reminds us that studying God’s word is a privilege that can bring great blessings. Let’s make time to listen to His voice through the scriptures today.",
      "application": "Set aside 10 minutes today to read a chapter from the scriptures with full attention, noting one truth that stands out to you.",
      "question": "What is one way you can show greater attentiveness to God’s word in your daily life?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Building with God’s Strength",
      "scripture": {
        "reference": "Ezra 6:22",
        "text": "And kept the feast of unleavened bread seven days with joy: for the Lord had made them joyful, and turned the heart of the king of Assyria unto them, to strengthen their hands in the work of the house of God, the God of Israel."
      },
      "thought": "This week, we’ve seen how the Lord guided and strengthened His people through Ezra and Nehemiah to accomplish a great work—rebuilding the temple, the walls of Jerusalem, and their covenant relationship with Him. Their stories remind us that God is always at work in our lives, inspiring others to help us, giving us joy in His house, and strengthening our hands against opposition. We’ve learned that studying His word brings blessings and that we each have a purpose in His plan. Like the Jews who celebrated with joy, we can find happiness in doing the Lord’s work. Reflecting on their perseverance, we can trust that God will support us in our own great works. Let’s carry this inspiration forward into the coming week.",
      "application": "Share with a family member or friend one lesson from this week’s study that has inspired you to keep building your faith.",
      "question": "How has studying Ezra and Nehemiah this week helped you see the Lord’s hand in your life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:43:34",
  "source_week_file": "cfm_2026_week_31.json"
}