{
  "week_number": 21,
  "title": "Week 21: May 18–24 - Joshua 1–8; 23–24",
  "date_range": "May 18–24",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Be Strong and Courageous",
      "scripture": {
        "reference": "Joshua 1:9",
        "text": "Have not I commanded thee? Be strong and of a good courage; be not afraid, neither be thou dismayed: for the Lord thy God is with thee whithersoever thou goest."
      },
      "thought": "This week, as we study Joshua 1–8 and 23–24, we’ll explore how the Lord encouraged Joshua and the Israelites to be strong and courageous as they faced daunting challenges like crossing the Jordan River and conquering Jericho. Their story reminds us that we, too, face our own rivers and walls—whether they’re personal struggles, fears, or uncertainties. The Lord’s promise to Joshua is also for us: He is with us wherever we go. As we read these chapters, we’ll see how faith, obedience, and scripture study brought God’s power into their lives. Let’s consider how we can apply these lessons to invite His strength into our own journeys. Together, we can find courage knowing the Lord will do wonders among us.",
      "application": "Take a moment today to write down one challenge you’re facing, and beside it, write Joshua 1:9 as a reminder of God’s presence with you.",
      "question": "How can I feel the Lord’s presence more fully as I face my challenges this week?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Faith and Works Together",
      "scripture": {
        "reference": "Joshua 2:11",
        "text": "And as soon as we had heard these things, our hearts did melt, neither did there remain any more courage in any man, because of you: for the Lord your God, he is God in heaven above, and in earth beneath."
      },
      "thought": "In Joshua 2, Rahab’s story teaches us about the power of faith and works. She believed in the God of Israel, recognizing His power, and acted on that belief by protecting the Israelite spies. Her faith wasn’t just in her heart—it was shown through her actions, which ultimately saved her and her family. Like Rahab, our faith in Jesus Christ grows stronger when we act on it. Her example reminds us that even small acts of courage and obedience can have a big impact on ourselves and others. How can we combine our faith with works today?",
      "application": "Choose one small act of service or obedience today that shows your faith in Christ, such as helping a family member or following a prompting.",
      "question": "How have my actions reflected my faith in Jesus Christ recently?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Obedience",
      "title": "Obedience Unlocks God’s Power",
      "scripture": {
        "reference": "Joshua 6:2-3",
        "text": "And the Lord said unto Joshua, See, I have given into thine hand Jericho, and the king thereof, and the mighty men of valour. And ye shall compass the city, all ye men of war, and go round about the city once. Thus shalt thou do six days."
      },
      "thought": "In Joshua 6, the Lord gave Joshua specific instructions to conquer Jericho, including marching around the city for six days. These instructions might have seemed unusual, but obedience to God’s command brought down the walls on the seventh day. This story teaches us that obedience invites God’s power into our lives, even when His ways don’t match our expectations. When we face temptations or challenges, like the battles of Jericho and Ai, following the Lord’s guidance can lead to victory. Let’s trust that His instructions, no matter how small or strange, are for our good. How can we obey more fully today?",
      "application": "Identify one prompting or commandment you’ve felt recently and commit to following it today, even if it feels small.",
      "question": "What is one area of my life where I can be more obedient to the Lord’s guidance?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Growth",
      "title": "Scriptures Bring Prosperous Ways",
      "scripture": {
        "reference": "Joshua 1:8",
        "text": "This book of the law shall not depart out of thy mouth; but thou shalt meditate therein day and night, that thou mayest observe to do according to all that is written therein: for then thou shalt make thy way prosperous, and then thou shalt have good success."
      },
      "thought": "In Joshua 1:8, the Lord counsels Joshua to meditate on the scriptures day and night, promising that this will make his way prosperous. This wasn’t just about reading—it was about letting God’s word shape his thoughts and actions. For us, regular scripture study can guide our decisions and bring blessings into our lives, just as it did for Joshua during his heavy responsibilities. It’s a reminder that God’s word is a source of strength and direction, no matter what we face. By immersing ourselves in the scriptures, we grow closer to Him and find success in His way. How can we make scripture study a daily habit?",
      "application": "Set aside 5 minutes today to read and think about a verse or story from this week’s chapters in Joshua.",
      "question": "How has studying the scriptures helped me feel God’s guidance in my life?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Deliverance",
      "title": "God’s Wonders Through Faith",
      "scripture": {
        "reference": "Joshua 3:5",
        "text": "And Joshua said unto the people, Sanctify yourselves: for to morrow the Lord will do wonders among you."
      },
      "thought": "In Joshua 3:5, Joshua tells the Israelites to sanctify themselves because the Lord would do wonders among them, like parting the Jordan River. This miracle happened only after they prepared spiritually and stepped forward in faith. It reminds us that God can work wonders in our lives when we strive to be clean and trust in Him. Whether it’s overcoming a personal struggle or seeing His hand in small ways, His power is real. Let’s prepare our hearts to recognize and receive His miracles. What wonders might the Lord have in store for us?",
      "application": "Take a moment today to pray and ask the Lord to help you see His wonders in your life, no matter how small.",
      "question": "What wonders has the Lord done in my life that I can be grateful for?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Covenant",
      "title": "Choose to Serve Today",
      "scripture": {
        "reference": "Joshua 24:15",
        "text": "And if it seem evil unto you to serve the Lord, choose you this day whom ye will serve; whether the gods which your fathers served that were on the other side of the flood, or the gods of the Amorites, in whose land ye dwell: but as for me and my house, we will serve the Lord."
      },
      "thought": "In Joshua 24:15, Joshua gives a powerful invitation to the Israelites to choose whom they will serve, declaring his own commitment to the Lord. This choice wasn’t just for him—it was for his household, showing the influence of our decisions on others. Every day, we face choices about whether to follow Jesus Christ or other influences. Joshua’s words inspire us to make a conscious decision to serve the Lord, even when it’s hard. Our choices can strengthen our families and bring us closer to God. How will you choose to serve Him today?",
      "application": "Discuss with your family or write in your journal one way you can serve the Lord together this week.",
      "question": "What daily choices can I make to show that I serve the Lord?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Courage in God’s Presence",
      "scripture": {
        "reference": "Joshua 23:8",
        "text": "But cleave unto the Lord your God, as ye have done unto this day."
      },
      "thought": "As we wrap up our study of Joshua 1–8 and 23–24, let’s reflect on the courage and strength the Israelites found by staying close to the Lord. From crossing the Jordan to choosing to serve God, their journey shows that His presence brings power and peace, no matter the obstacle. Joshua’s final counsel to ‘cleave unto the Lord’ reminds us to hold fast to Him through faith, obedience, and scripture study. We’ve seen how Rahab’s faith, the fall of Jericho, and daily choices all tie to trusting in God. Let’s carry this week’s lessons forward by seeking His guidance in our challenges. How has the Lord strengthened you this week?",
      "application": "Write down one key lesson from this week’s study that you want to remember and act on in the coming days.",
      "question": "How has studying Joshua’s story helped me feel closer to the Lord this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:37:20",
  "source_week_file": "cfm_2026_week_21.json"
}