{
  "week_number": 16,
  "title": "Week 16: April 13–19 - Exodus 14–18",
  "date_range": "April 13–19",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "See the Lord’s Salvation",
      "scripture": {
        "reference": "Exodus 14:13-14",
        "text": "And Moses said unto the people, Fear ye not, stand still, and see the salvation of the Lord, which he will shew to you to day: for the Egyptians whom ye have seen to day, ye shall see them again no more for ever. The Lord shall fight for you, and ye shall hold your peace."
      },
      "thought": "This week, as we study Exodus 14–18, we’ll witness the Lord’s mighty hand in delivering the Israelites from Pharaoh’s army at the Red Sea. Their story reminds us that even when we feel trapped by life’s challenges, God is ready to fight for us if we trust in Him. We’ll also explore how the Lord provides daily nourishment, turns bitter experiences sweet, and offers living water through Jesus Christ. These chapters teach us to rely on His power, just as the Israelites did. As we read, let’s reflect on how God has shown His strength in our own lives. What miracles are we hoping to see as we ‘stand still’ and trust Him?",
      "application": "Take a moment today to write down one challenge you’re facing and pray specifically for the Lord’s help to overcome it.",
      "question": "How have I seen the Lord’s salvation in my life when I’ve felt trapped or afraid?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Trust in God’s Power",
      "scripture": {
        "reference": "Exodus 14:21-22",
        "text": "And Moses stretched out his hand over the sea; and the Lord caused the sea to go back by a strong east wind all that night, and made the sea dry land, and the waters were divided. And the children of Israel went into the midst of the sea upon the dry ground: and the waters were a wall unto them on their right hand, and on their left."
      },
      "thought": "Imagine the faith it took for the Israelites to walk through the Red Sea with walls of water on either side. They had to trust that the Lord would protect them from an impossible situation. Like them, we often face challenges that seem insurmountable, whether it’s a personal struggle or a family concern. This miracle reminds us that God’s power can make a way where there seems to be none. When we feel stuck, we can turn to Him for strength and guidance. Let’s exercise faith today by trusting that He is working in our lives, even when we can’t see the path ahead.",
      "application": "Identify one ‘impossible’ situation in your life and take a small step of faith today, like praying for courage or seeking help.",
      "question": "What is one way I can show greater trust in God’s power to help me through my challenges?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Challenges",
      "title": "Turning Bitter to Sweet",
      "scripture": {
        "reference": "Exodus 15:23-25",
        "text": "And when they came to Marah, they could not drink of the waters of Marah, for they were bitter: therefore the name of it was called Marah. And the people murmured against Moses, saying, What shall we drink? And he cried unto the Lord; and the Lord shewed him a tree, which when he had cast into the waters, the waters were made sweet: there he made for them a statute and an ordinance, and there he proved them."
      },
      "thought": "The bitter waters of Marah represent the difficult, unpleasant experiences we all encounter in life. The Israelites complained, much like we sometimes do when things go wrong. Yet, when Moses turned to the Lord, He provided a solution to make the bitter sweet. This teaches us that God can transform our hardships into blessings if we seek His help. Think of a ‘bitter’ moment in your life—perhaps a loss or disappointment. How has the Lord helped sweeten that experience over time through His love or through lessons learned?",
      "application": "Reflect on a current struggle and pray for the Lord to help you see how it can become a source of growth or sweetness.",
      "question": "How has the Lord turned a bitter experience in my life into something sweet or meaningful?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Growth",
      "title": "Daily Spiritual Nourishment",
      "scripture": {
        "reference": "Exodus 16:4",
        "text": "Then said the Lord unto Moses, Behold, I will rain bread from heaven for you; and the people shall go out and gather a certain rate every day, that I may prove them, whether they will walk in my law, or no."
      },
      "thought": "The Lord provided manna daily for the Israelites, teaching them to rely on Him consistently rather than stockpiling for the future. This story is a powerful reminder that our spiritual nourishment—through prayer, scripture study, and other daily habits—must also be sought regularly. Just as the Israelites gathered manna each day, we need to seek the Lord’s guidance and strength continually. Skipping these practices can leave us spiritually hungry. Let’s commit to feeding our souls daily, trusting that God will provide what we need. How can we make time for this essential habit today?",
      "application": "Set aside 5 minutes today to read a verse of scripture or say a heartfelt prayer for spiritual strength.",
      "question": "What daily practices help me feel spiritually nourished, and how can I make them a priority?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Deliverance",
      "title": "Christ, My Living Water",
      "scripture": {
        "reference": "Exodus 17:6",
        "text": "Behold, I will stand before thee there upon the rock in Horeb; and thou shalt smite the rock, and there shall come water out of it, that the people may drink. And Moses did so in the sight of the elders of Israel."
      },
      "thought": "When the Israelites were thirsty and desperate, the Lord provided water from a rock, a miracle that sustained them in the wilderness. This story points us to Jesus Christ, who is our spiritual rock and source of living water. Just as water refreshed the Israelites, Christ offers us spiritual refreshment through His teachings and Atonement. When we feel spiritually dry or overwhelmed, we can turn to Him for strength and peace. This reminds us that no matter our circumstances, Christ is always there to sustain us. Let’s seek His living water today to renew our spirits.",
      "application": "Take a moment to drink a glass of water and reflect on how Christ refreshes your soul, perhaps by reading a favorite verse about Him.",
      "question": "In what ways do I feel Christ’s living water sustaining me during difficult times?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Service",
      "title": "Bearing Each Other’s Burdens",
      "scripture": {
        "reference": "Exodus 17:12",
        "text": "But Moses’ hands were heavy; and they took a stone, and put it under him, and he sat thereon; and Aaron and Hur stayed up his hands, the one on the one side, and the other on the other side; and his hands were steady until the going down of the sun."
      },
      "thought": "Moses couldn’t hold up his hands alone during the battle, but Aaron and Hur supported him, helping Israel prevail. This story teaches us the importance of serving and supporting one another in the Lord’s work. We all have moments when our hands feel heavy—whether from responsibilities, grief, or exhaustion—and we need others to lift us. Likewise, we can be like Aaron and Hur, offering help to family, friends, or Church leaders. Supporting each other strengthens God’s kingdom and builds our relationships. Let’s look for ways to bear someone’s burden today with kindness or encouragement.",
      "application": "Reach out to a family member, friend, or Church leader today with a kind word or offer to help with a task.",
      "question": "Who in my life might need my support right now, and how can I help lift their hands?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Trusting in God’s Care",
      "scripture": {
        "reference": "Exodus 15:2",
        "text": "The Lord is my strength and song, and he is become my salvation: he is my God, and I will prepare him an habitation; my father’s God, and I will exalt him."
      },
      "thought": "As we conclude our study of Exodus 14–18, let’s reflect on the powerful ways the Lord cared for the Israelites—parting the Red Sea, sweetening bitter waters, providing manna, and giving water from a rock. These stories remind us that God is our strength and salvation, just as He was for them. We’ve seen how He fights for us, nourishes us daily, and offers living water through Christ. We’ve also learned the value of supporting each other in His work. These lessons encourage us to trust Him more fully in our challenges. How will you carry this trust into the coming week?",
      "application": "Write down one key lesson from this week’s study and place it somewhere visible as a reminder to trust God daily.",
      "question": "How has studying these chapters increased my faith in the Lord’s ability to care for me and my family?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:34:05",
  "source_week_file": "cfm_2026_week_16.json"
}