{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "connected",
  "word_count": 1566,
  "character_count": 9833,
  "content": "# Come, Follow Me 2026 Old Testament Study Guide: Week 2 (January 5–11) - Moses 1; Abraham 3\n\nWelcome, dear friends, to this sacred journey through the Old Testament as we explore Moses 1 and Abraham 3. These chapters, revealed through the Prophet Joseph Smith, offer profound insights into our divine identity, God’s eternal plan, and our place in His work. Let’s dive into these scriptures with open hearts, seeking the Spirit’s guidance to uncover patterns and truths that will strengthen our faith.\n\n## Doctrinal Foundation\n\nLet’s begin by viewing these chapters through multiple lenses to uncover layers of meaning about our divine identity and God’s purpose.\n\n- **From Moses’ View**: In Moses 1:4, the Lord declares, “And, behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands.” Moses is personally affirmed as a child of God and invited to see the vastness of creation. Imagine the awe and humility Moses felt, realizing his connection to the Creator.\n- **From God’s View**: In Moses 1:39, the Lord states, “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” God’s purpose is clear—His entire work centers on our eternal progression. This reveals a God of infinite love, focused on His children.\n- **From Abraham’s View**: In Abraham 3:22–23, Abraham learns of the premortal existence of spirits, including the noble and great ones chosen before the world was. This perspective shows us that our journey began long before mortality, with purpose and potential already within us.\n- **From Our View Today**: As President Russell M. Nelson taught, “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity,” worldwide devotional for young adults, May 2022, Gospel Library). These chapters invite us to see ourselves as God sees us—children of divine heritage with eternal destinies.\n\nThese perspectives converge on a central truth: knowing who we are shapes how we live. Let’s hold this truth as we explore further.\n\n## Scripture Deep Dive\n\nHere are 6 key passages with escalating connections across dispensations, enriched by cultural and historical insights:\n\n1. **Moses 1:4 – “Thou art my son”**: This direct declaration from God to Moses establishes personal identity. This pattern of divine affirmation appears in Alma 36:3, where Alma tells Helaman, “I do know that whosoever shall put their trust in God shall be supported in their trials.” It echoes again in Doctrine and Covenants 121:7–8, where Joseph Smith is comforted with “My son, peace be unto thy soul.”\n2. **Moses 1:12 – Satan’s counterfeit identity**: Satan tells Moses, “Moses, son of man, worship me.” This attempt to confuse identity contrasts with God’s truth. This pattern of deception recurs in Matthew 4:3–4, where Satan tempts Jesus with counterfeits, and in modern times as Elder Gary E. Stevenson warns of deceptive influences (“Deceive Me Not,” Ensign or Liahona, Nov. 2019, 93–96).\n3. **Moses 1:18 – Resisting through testimony**: Moses declares, “I will not cease to call upon God.” His resistance through prayer mirrors Nephi’s resolve in 1 Nephi 7:17 and Joseph Smith’s plea in Joseph Smith—History 1:16 during the First Vision.\n4. **Moses 1:39 – God’s work and glory**: This verse defines God’s purpose. It connects to John 17:3, where eternal life is to know God, and to Doctrine and Covenants 88:18–20, where the earth’s sanctification is tied to our exaltation.\n5. **Abraham 3:22–23 – Premortal spirits**: Abraham sees “the intelligences that were organized before the world was.” This doctrine of premortal life is hinted at in Jeremiah 1:5 (“Before I formed thee in the belly I knew thee”) and expanded in Doctrine and Covenants 93:29.\n6. **Abraham 3:25 – Earth as a proving ground**: The Lord says, “We will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” This purpose of mortality echoes in 2 Nephi 2:21 and modern prophetic teachings about agency.\n\n**Cultural Insight**: In ancient Near Eastern culture, identity was often tied to lineage and tribal roles. God’s declaration to Moses as “my son” would have been revolutionary, elevating personal worth beyond earthly status. This transforms our understanding of Moses’ calling and our own.\n\n## Historical Context\n\nMoses 1 and Abraham 3, though not part of the traditional Old Testament canon, are rooted in ancient traditions of divine encounters and cosmic visions. In Moses’ time (circa 13th–15th century BC), Egyptian and Mesopotamian cultures often depicted gods as distant or capricious. Yet, Moses’ vision reveals a personal, loving God who calls him “son.” Similarly, Abraham’s vision in Abraham 3 reflects ancient astronomical interests—common in Babylonian culture where Abraham likely lived (Ur of the Chaldees)—but centers on spiritual truths rather than mere star-gazing. These revelations collapse time, showing us that God’s nature and plan transcend cultural boundaries, speaking directly to us today as they did to prophets of old.\n\n## Pattern Recognition Web\n\nThese chapters reveal prophetic patterns across dispensations:\n- **Divine Identity**: God affirms Moses (Moses 1:4), Jesus (Matthew 3:17), and Joseph Smith (Joseph Smith—History 1:17) as beloved sons.\n- **Satan’s Counterfeits**: Satan’s deception of Moses (Moses 1:12) mirrors temptations of Eve (Genesis 3:1–5) and modern warnings from Elder Stevenson (“Deceive Me Not”).\n- **Premortal Council**: Abraham’s vision (Abraham 3:22–28) connects to Job 38:7 (sons of God shouting for joy) and Doctrine and Covenants 138:55–56 (noble spirits prepared).\n- **Purpose of Mortality**: The proving ground of earth (Abraham 3:25) ties to Lehi’s teaching on opposition (2 Nephi 2:11) and President Nelson’s focus on eternal perspective (“Choices for Eternity”).\n\nThis web suggests a consistent divine narrative: God reveals identity, Satan distorts it, and mortality tests our fidelity to truth.\n\n## Discussion Framework\n\n1. What most people miss in Moses 1:4—how does God’s personal address to Moses as “my son” change the way we see ourselves?\n2. How does Satan’s tactic in Moses 1:12 reflect temptations you’ve faced to doubt your identity?\n3. What can we learn from Moses’ repeated prayers in Moses 1:18–20 about resisting temptation?\n4. How does Abraham 3:22–23 deepen your understanding of your premortal choices?\n5. Why do you think God emphasizes “prove them herewith” in Abraham 3:25 as the purpose of life?\n6. How does Moses 1:39 connect God’s glory to your personal progression?\n7. What counterfeits of truth do you see in today’s world, and how can Moses 1:13–18 guide us?\n8. How can knowing our premortal existence (Abraham 3:22–28) influence daily decisions?\n9. In what ways does God’s work (Moses 1:39) inspire you to participate in His plan?\n10. How do these chapters prepare us to face modern challenges to identity and faith?\n\n## Gospel Connections\n\nThe principles in Moses 1 and Abraham 3 anchor us in the Plan of Salvation. Our premortal existence (Abraham 3:22–28) parallels Doctrine and Covenants 93:29, showing we are eternal beings. The purpose of mortality as a test (Abraham 3:25) connects to 2 Nephi 2:21, emphasizing agency. God’s work to bring eternal life (Moses 1:39) ties to 3 Nephi 27:13–14, where Christ’s Atonement fulfills this purpose. These connections reveal a unified plan—from premortality to exaltation—centered on becoming like our Father.\n\n## Teaching Moments\n\n1. **Identity Mirror**: Share Moses 1:4 by inviting family or class members to look in a mirror and say, “I am a child of God,” reinforcing divine worth.\n2. **Counterfeit Game**: Use Moses 1:12–13 to discuss counterfeits. Show a real and fake item (like a toy dollar bill) and ask, “How do we spot Satan’s fakes?”\n3. **Premortal Picture**: Draw a timeline with Abraham 3:22–25, showing premortality, earth life, and eternity. Discuss how knowing “before” shapes “now.”\n4. **God’s Work Puzzle**: Use Moses 1:39 to ask, “How are we part of God’s glory?” Let each person add a puzzle piece labeled with a way they contribute.\n\n## Seminary Synthesis\n\nFrom the Seminary manual (as inferred from CFM content):\n1. **Identity as Power**: Moses 1:4 teaches that knowing we are children of God empowers us against doubt, a pattern teachers can explore through cross-references like Doctrine and Covenants 121:7.\n2. **Satan’s Tactics**: Moses 1:12–18 reveals Satan’s strategy of distorting identity, which teachers can connect to modern media influences and Elder Stevenson’s warnings.\n3. **Premortal Purpose**: Abraham 3:25’s focus on proving ourselves can be linked to agency discussions in 2 Nephi 2, encouraging deeper study of choices.\n\n## Personal Reflection\n\n- When have you felt God affirming your identity as His child, as in Moses 1:4?\n- How has knowing your premortal existence (Abraham 3:22–23) influenced a major life decision?\n- What “counterfeits” have you faced, and how did prayer or scripture help you resist, like Moses in Moses 1:18?\n\n## Prophetic Echoes\n\nModern prophetic teachings mirror these ancient revelations in striking ways:\n- President Russell M. Nelson’s teaching, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity,” May 2022, Gospel Library), echoes Moses 1:4’s affirmation of identity.\n- His counsel to make our identity as children of God our primary identifier parallels Abraham 3:22–23, reminding us of our eternal nature.\n\nI bear witness that these truths are from a loving Father who knows us personally. As we study Moses 1 and Abraham 3, may we feel His voice calling us His children, guiding us through mortality toward eternal life. Let’s treasure these revelations and apply them with faith.",
  "generated_timestamp": "2026-01-01 00:06:27",
  "source_week_file": "cfm_2026_week_02.json"
}