{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "study_level": "essential",
  "word_count": 735,
  "character_count": 4618,
  "content": "# Come, Follow Me 2026: Week 4 - Genesis 3–4; Moses 4–5\n\n## Week Overview\nFeel the weight when Adam and Eve stepped from the beauty of Eden into a world of opposition, pain, and death (see Genesis 3:16–19). At first, this Fall might seem a tragedy, casting them out and separating them from Heavenly Father. Yet the restored truths in Moses reveal a brighter view: leaving Eden opened the path to growth, choices, repentance, and “the joy of our redemption” (Moses 5:11). Notice this quiet, powerful detail—Adam and Eve needed more than paradise; they needed the chance to progress toward becoming like God.\n\n## Key Scripture Moments\nHere's the remarkable moment when temptation strikes: in Genesis 3:1–7 and Moses 4:22–31, mark the results of the Fall—spiritual separation, physical toil, and sorrow. What happens next transforms everything? In Moses 5:4–15, an angel reveals God's plan of redemption, leaving Adam and Eve “glad” as they learn of sacrifice and the Savior.\n\nNotice what happens next in Moses 4:1–4: Satan seeks to destroy agency, but Heavenly Father and Jesus Christ cast him out to protect the right to choose. Then, in Moses 5:9–12, Adam and Eve rejoice, saying Adam called his wife’s name Eve “because she was the mother of all living.”\n\n## Hidden Connections\nThese verses connect ancient choices to eternal patterns. The Fall's opposition links to 2 Nephi 2:19–25, where Lehi teaches that Adam fell that men might be (see also Mosiah 3:19; Alma 12:21–37; Doctrine and Covenants 29:39–43). Nakedness in Moses 4:13–16, 27 symbolizes vulnerability, while the Lord clothing them points forward to temple garments and white robes in Revelation 7:9, 13–15; 2 Nephi 9:14; Doctrine and Covenants 109:22–26, 76.\n\nSatan's deceptions in Moses 4:4–12; 5:13–33 echo modern temptations, countered by agency teachings in 2 Nephi 2:11–20, 25–30 and For the Strength of Youth: A Guide for Making Choices (4–5).\n\n## Pattern Discovery\nRecurring themes bind these chapters: opposition enables agency (Moses 4:1–4; 2 Nephi 2:27), sacrifices require willing hearts (Moses 5:4–9, 16–26, contrasting Abel and Cain), and redemption follows glad obedience (Moses 5:4–15). This pattern repeats from Eden through Cain's rebellion, showing Satan's blindings met by prayer and angelic instruction, much like Lehi's teachings on choosing freely amid opposition.\n\n## Simple Questions\n1. Why was the Fall important to God’s plan (Genesis 3; Moses 4)?  \n2. According to Moses 5:9–12, how did Adam and Eve feel about the Fall? How does this apply to experiences in this fallen world?  \n3. What results of the Fall appear in Genesis 3:1–7; Moses 4:22–31, and how does Moses 5:4–15 reveal redemption?  \n4. In Moses 4:1–4, what did Heavenly Father and Jesus Christ do to protect agency? How can their protecting power be accessed?  \n5. How does Satan tempt in Moses 4:4–12; 5:13–33 today, and how does Heavenly Father help resist?  \n6. What attitudes toward sacrifice in Moses 5:4–9, 16–26 shape personal offerings?\n\n## One Big Idea\nThe Fall marked the essential first step in God’s plan, transforming paradise lost into progression gained. In Eden, Adam and Eve lacked opposition for growth; their choice brought agency, choices, mistakes, repentance, and trust in the Savior’s Atonement (Moses 5:11). This restored perspective, through Joseph Smith’s revelations, shifts focus from tragedy to the glory awaiting those who choose redemption.\n\n## Living It\nHusbands and wives stand as equal partners, with righteous husbands ministering, acknowledging error, praising, and providing with respect (see “The Family: A Proclamation to the World”; Elder Dale G. Renlund and Sister Ruth Lybbert Renlund, The Melchizedek Priesthood: Understanding the Doctrine, Living the Principles [2018], 23).  \n\nMake inspired choices amid opposition, as in For the Strength of Youth (4–5), showing appreciation to Jesus Christ by choosing freely (2 Nephi 2:27).  \n\nOffer sacrifices with a willing heart, like Abel, pondering what the Lord asks today (Moses 5:4–9, 16–26).\n\n## Faith Builder\nElder Dale G. Renlund taught, “Our Heavenly Father’s goal in parenting is not to have His children do what is right; it is to have His children choose to do what is right and ultimately become like Him” (“Choose You This Day,” Ensign or Liahona, Nov. 2018, 104). This echoes agency protections in Moses 4:1–4 and Lehi’s opposition in 2 Nephi 2:11–20, 25–30. See also Dallin H. Oaks, “Opposition in All Things,” Ensign or Liahona, May 2016, 114–17.\n\nThese truths from the Fall invite all to embrace opposition as the path to redemption and joy through Jesus Christ.",
  "generated_timestamp": "2026-01-18 19:31:40",
  "source_week_file": "cfm_2026_week_04.json"
}