{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "word_count": 1186,
  "character_count": 7834,
  "content": "# Come, Follow Me 2026: Week 1 – Introduction to the Old Testament (December 29–January 4)\n\n## Doctrinal Foundation\nFrom Moses' view in the Pearl of Great Price, all creation bears record of the Savior: “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). From God's view, as revealed to Nephi, the scriptures form a covenant tapestry, with plain and precious truths restored to testify of Christ across dispensations (1 Nephi 13:21–29, 38–42). From our view today, the Old Testament bridges ancient symbols to personal faith, revealing Jesus Christ as Jehovah who spoke as “God” or the “Lord” (President Dallin H. Oaks, “The Teachings of Jesus Christ,” *Liahona*, May 2023, 102). These layers show the Old Testament not as distant history, but as a living witness that God seeks to make us His “peculiar treasure” by covenant (Exodus 19:5).\n\n## Scripture Deep Dive\n1. **Psalm 119:105, 140**: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it.” This sets the pattern for scripture as personal guidance, echoed in symbols of Christ.\n2. **Exodus 16:4, 11–15; John 6:35**: Manna foreshadows Jesus as “the bread of life,” transforming daily sustenance into eternal nourishment.\n3. **Exodus 12:3–5; John 1:29**: The sacrificial lamb points to the Lamb of God, revealing atonement's ancient roots.\n4. **Numbers 21:4–10; John 3:14**: The brass serpent heals through faith, prefiguring Christ's lifting up.\n5. **Jonah 1:4–17; Matthew 12:38–41**: Jonah's three days in the fish mirrors resurrection, a pattern Nephi saw restored (1 Nephi 13:21–29).\n6. **Exodus 3:13–15; 6:3–5; John 8:58–59**: Jehovah declares “I AM,” shocking Jews who knew His name from the burning bush.\n7. **Exodus 6:3 (Joseph Smith Translation, footnote c)**: Reveals names like Jehovah known before His mortal birth.\n8. **2 Nephi 3:12**: Bible and Book of Mormon unite as “one,” restoring truths like Enoch’s Zion (Moses 7:18–19).\n\nThis pattern escalates from symbols to Jehovah's identity, culminating in restored visions like Abraham’s council (Abraham 3:22–28), linking Old Testament shadows to clarified light.\n\n## Historical Context\nThe Old Testament stands as “one of the oldest collections of writings in the world,” from an “ancient culture that can seem foreign and sometimes strange or even uncomfortable.” Yet it captures universal experiences: Abraham's family joy and discord, Hannah's uncertainty, Daniel's unwavering faith. In this world, God moved through covenants, as with Abraham, Isaac, and Jacob, offering an “everlasting covenant” (President Russell M. Nelson, “The Everlasting Covenant,” *Liahona*, October 2022, 4–11). Archaeological echoes, like Egyptian papyri inspiring the book of Abraham, collapse time, aligning ancient papyri with modern revelation. Joseph's restorations—Enoch’s city, Melchizedek’s ministry (Joseph Smith Translation, Genesis 14:25–40)—bridge eras, making 2026 study a “time collapse moment” where ancient prophets feel like neighbors.\n\n## Pattern Recognition Web\n- **Christ Symbols**: Manna to bread (Exodus 16; John 6), lamb to Lamb (Exodus 12; John 1), serpent to cross (Numbers 21; John 3), Jonah to resurrection (Jonah 1; Matthew 12)—all bearing likeness to Christ (Moses 6:63).\n- **Jehovah's Voice**: “Words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah” (Oaks, *Liahona*, May 2023, 102), from Exodus 3 (“I AM”) to restored JST.\n- **Restoration Threads**: Nephi’s vision of lost truths (1 Nephi 13:28–29) fulfilled in Moses (Genesis 1–6), Abraham, JST footnotes—like Zion’s translation (Moses 7:18–19).\n- **Covenant Chain**: From Adam’s sacrifices to Abraham’s posterity (Exodus 19:5), mirrored in Jeremiah 31:31–34 and baptism (Mosiah 18:10, 13).\nThis web spans dispensations, suggesting God’s consistent pursuit through symbols, names, and covenants.\n\n## Discussion Framework\n1. What most people miss: Why does an “ancient culture” feel both “foreign” and “familiar” in depicting faith like ours?\n2. How do manna or the lamb resolve the mystery of finding Christ in “strange” Old Testament stories?\n3. What apparent conflict arises when Jews stone Jesus for “Before Abraham was, I am” (John 8:58)—and Exodus 3 resolves it?\n4. Why did Nephi foresee “many plain and precious things” removed, and how does 2 Nephi 3:12 restore harmony?\n5. In what ways is Jesus Christ “Jehovah” significant amid modern distractions?\n6. How does Exodus 19:5’s “peculiar treasure” elevate covenant-keeping?\n7. What hidden connection links Psalm 23 or Isaiah 53:3–9 to a child’s view of Christ?\n8. How might pioneer faith in restored scriptures parallel your 2026 study?\n9. What “special kind of love and mercy” from covenants (Nelson, *Liahona*, Oct. 2022) transforms daily trials?\n10. How does focusing on Christ, as Elder Dale G. Renlund urged—“remember and always focus on Jesus Christ” (*Liahona*, Nov. 2023, 98)—build profound faith?\n\n## Gospel Connections\nOld Testament symbols weave into the Plan of Salvation: Manna sustains premortal faith (Abraham 3:22–28 council), lamb enables repentance (Exodus 12), serpent offers healing through agency (Numbers 21), Jonah foreshadows judgment and resurrection. Covenants bind us as Abraham’s posterity (Exodus 19:5), echoing baptism’s promises (Mosiah 18:10, 13) and temple sealing. Nephi’s unified scriptures (2 Nephi 3:12) reveal the Savior’s role from council to exaltation, with restorations like Melchizedek’s order (JST, Genesis 14) paralleling priesthood keys today. I’ve felt this web draw me closer to Him who is both Jehovah and Redeemer.\n\n## Teaching Moments\n1. **Symbol Hunt Aha**: Display *The Prophet Isaiah Foretells Christ’s Birth* (Harry Anderson); have families trace baby Jesus to Isaiah 7:14; 9:6—sparking “I see Him everywhere!”\n2. **Name Game Reveal**: Ask children for “different names” (parent at home/work), then Exodus 6:3 (JST)—hidden connection: Jesus as Jehovah.\n3. **Covenant Promise Chain**: Share family promises, link to baptism picture (Mosiah 18:10), sing “When I Am Baptized” (CS, 103)—generational tie to pioneers.\n4. **Lamp Visualization**: Dim lights, read Psalm 119:105—“Thy word is a lamp”—then shine flashlight on Christ symbols for illuminating “aha.”\n\n## Seminary Synthesis\n1. Seminary teachers can adapt the “types or symbols of Christ” (Guide to the Scriptures) for pattern drills: Link Exodus lamb to John 1:29, building advanced webs.\n2. Use Nephi’s vision (1 Nephi 13) to contrast lost Bible truths with JST restorations like Enoch (Moses 7), fostering deeper dispensation awareness.\n3. Highlight Oaks’ Jehovah teaching for identity resolution, pairing Exodus 3 with John 8—equips youth for missionary bold testimony.\n\n## Personal Reflection\n- When have Old Testament-like trials (family discord, uncertainty) led to covenant strength, as with Abraham or Hannah?\n- Which symbol—manna, lamb, serpent—mirrors a recent faith step in your journey?\n- How has God made you His “peculiar treasure” through kept promises this year?\n- Trace a pattern: Where has Jehovah’s voice as “lamp” (Psalm 119:105) lit your path amid modern shadows?\n\n## Prophetic Echoes\nModern prophets mirror ancient revelations strikingly. President Oaks echoes Exodus 3’s “I AM” by clarifying: “scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (*Liahona*, May 2023, 102). Elder Renlund urges what psalmists knew: “remember and always focus on Jesus Christ” (*Liahona*, Nov. 2023, 98)—like manna’s daily bread. President Nelson revives Exodus 19:5’s covenant call in “The Everlasting Covenant,” asking why covenants bring “special kind of love and mercy” (*Liahona*, October 2022, 4–11). These echoes assure: The Old Testament’s God walks with us still.\n\n(Word count: 1,048)",
  "generated_timestamp": "2026-01-10 22:35:34",
  "source_week_file": "cfm_2026_week_01.json"
}