{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "word_count": 1745,
  "character_count": 11054,
  "content": "# Come, Follow Me 2026 Old Testament Study Guide  \n## Week 1: December 29–January 4 - Introduction to the Old Testament\n\nWelcome, dear students of the scriptures, to a year of profound discovery in the Old Testament! As we embark on this sacred journey, let us approach these ancient writings with humility and faith, seeking the Savior on every page. The Old Testament is a testament of Jesus Christ, a record of covenants, and a witness of God’s unchanging love for His children. I bear witness that as we study with open hearts, the Spirit will illuminate patterns and truths that will strengthen our testimonies and draw us closer to our Redeemer.\n\nBelow is a comprehensive study guide designed to ignite your understanding through theological depth, historical context, and prophetic connections. Let us dive into the scriptures together, recognizing the hand of the Lord across dispensations.\n\n---\n\n### Theological Framework: Pattern Recognition Mastery\n\nThe Old Testament is not merely a historical record; it is a theological tapestry weaving together themes of covenant, redemption, and divine guidance that resonate through all dispensations. One central pattern is God’s desire to make His people a “peculiar treasure” through covenants (Exodus 19:5). This theme begins with Adam, continues through Abraham, and extends to us today as we enter into sacred covenants. Another pattern is the testimony of Jesus Christ as the central figure of salvation, evident in symbols like the manna (Exodus 16:4, 11–15; John 6:35) and the sacrificial lamb (Exodus 12:3–5; John 1:29). This pattern indicates that from the foundation of the world, the plan of salvation has pointed to the Savior, a truth restored and clarified through modern revelation (Moses 6:63).\n\nAcross dispensations, we see God’s consistent invitation to “hear Him”—whether through Jehovah speaking to Moses (Exodus 3:13–15) or the Father introducing His Son in the New Testament and modern times. This framework reveals that the principles of faith, repentance, and covenant-making are eternal, uniting us with our ancient brothers and sisters in a shared journey to return to God.\n\n---\n\n### Exegetical Insights: Unpacking Ancient Texts\n\nWhile the provided bundle does not include specific Hebrew terms or archaeological discoveries for this introductory week, we can still lay a foundation for exegetical study by understanding the significance of names and titles in the Old Testament. For instance, the name “Jehovah,” revealed to Moses in Exodus 6:3, signifies the eternal nature of Jesus Christ, who declared, “Before Abraham was, I am” (John 8:58). This connection between Jehovah and Jesus Christ is a paradigm shift for many readers, showing that the God of the Old Testament is our Savior.\n\nLiterary structures in the Old Testament often use symbolism to point to Christ, such as the brass serpent (Numbers 21:4–10; John 3:14) and Jonah’s three days in the whale (Jonah 1:4–17; Matthew 12:38–41). These narratives are not random; they are divinely crafted to bear record of the Messiah (Moses 6:63). As we study this year, let us be attentive to such structures, allowing them to deepen our appreciation for the scriptures’ inspired design.\n\n---\n\n### Prophetic Pattern Architecture: Time Collapse Analysis\n\nThe Old Testament reveals divine patterns of revelation and redemption that collapse time, showing that God’s work is the same yesterday, today, and forever. Consider the pattern of covenant-making: God’s covenant with Abraham to make of him a great nation (Genesis 12) mirrors the covenant offered to us today through baptism and temple ordinances. This pattern indicates a divine consistency in how God binds Himself to His people across millennia.\n\nAnother pattern is the role of Jesus Christ as Jehovah, the God of the Old Testament. President Dallin H. Oaks taught, “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). This truth merges ancient and modern understanding, revealing that the voice calling to Moses from the burning bush is the same voice that speaks through prophets today.\n\n---\n\n### Cross-Reference Web Matrix: Hidden Scriptural Relationships\n\nThe Old Testament is deeply interconnected with other standard works, revealing truths through a web of references. Here are key connections to explore:\n\n- **Jesus as Jehovah**: Link Exodus 3:13–15 and John 8:58–59 to understand the significance of Christ’s declaration, “I am,” and why it provoked such a reaction among the Jews.\n- **Symbols of Christ**: Connect manna (Exodus 16:4, 11–15) with John 6:35, where Jesus declares, “I am the bread of life.” Similarly, tie the Passover lamb (Exodus 12:3–5) to John 1:29, where John the Baptist calls Jesus “the Lamb of God.”\n- **Restored Truths**: Explore 1 Nephi 13:21–29 with Moses 7:18–19 (Enoch’s Zion) and Abraham 3:22–28 (pre-mortal council) to see how the Lord restored “plain and precious things” through Joseph Smith.\n- **Covenant Relationship**: Pair Exodus 19:5 with Mosiah 18:10, 13 to see how ancient and modern covenants reflect God’s desire for a covenant people.\n\nThese connections reveal that the scriptures are a unified witness of God’s plan, designed to guide us to Christ.\n\n---\n\n### Historical and Cultural Context: Ancient Parallels to Modern Discipleship\n\nThe Old Testament emerges from an ancient Near Eastern culture that can seem foreign to us today, yet its themes are strikingly familiar. The CFM lesson notes that figures like Abraham, Sarah, and Daniel experienced “family joy and family discord, moments of faith and moments of uncertainty, and successes and failures—like all of us do” (Come, Follow Me: 2026). This context reminds us that their struggles and triumphs mirror our own, making their stories a source of empathy and inspiration.\n\nUnderstanding the centrality of covenants in ancient Israel also parallels our modern discipleship. Just as God sought to make Israel His “peculiar treasure” (Exodus 19:5), He invites us today to enter into sacred covenants that bind us to Him. This cultural backdrop helps us see that the Old Testament is not just history—it is a living guide for our covenant path.\n\n---\n\n### Contradiction Resolution: Harmonizing Apparent Conflicts\n\nWhile this introductory week does not present specific contradictions, a common concern in Old Testament study is the perceived harshness of God’s judgments compared to the mercy of Christ in the New Testament. This can be resolved by recognizing that Jehovah, the God of the Old Testament, is Jesus Christ Himself (Liahona, May 2023, 102). His justice and mercy are consistent across dispensations, as seen in His patience with Israel despite their repeated rebellion (e.g., Numbers 14). This pattern indicates that God’s character is unchanging, balancing justice with infinite love—a truth that becomes clearer as we study with the Spirit.\n\n---\n\n### Seminary Synthesis: Advanced Insights for Adult Study\n\nDrawing from the CFM lesson’s emphasis on Christ in the Old Testament, teachers can adapt the concept of “types and symbols” for deeper adult discussion. Encourage learners to identify symbols like the brass serpent (Numbers 21:4–10) and explore how these point to Christ’s Atonement (John 3:14). This pattern discovery fosters a richer understanding of how the Old Testament is a second witness of the Savior alongside the New Testament and Book of Mormon (2 Nephi 3:12). Adults can also discuss restored truths, such as Enoch’s city of Zion (Moses 7:18–19), as evidence of God’s plan for unity and holiness in every dispensation.\n\n---\n\n### Teaching Applications: Escalating Stakes Discussion Questions\n\n1. **Understanding**: How do symbols like the manna (Exodus 16:4, 11–15) and the sacrificial lamb (Exodus 12:3–5) help us recognize Jesus Christ in the Old Testament? What other symbols are you eager to discover this year?\n2. **Transformation**: Why is it significant to know that Jesus Christ is Jehovah, the God of the Old Testament (Liahona, May 2023, 102)? How does this knowledge change the way you read these ancient stories?\n3. **Testimony**: How have you seen the “plain and precious things” restored through Joseph Smith (1 Nephi 13:21–29) deepen your faith in God’s plan? Share a personal experience where studying covenants or restored truths strengthened your relationship with the Savior.\n\n---\n\n### Modern Prophetic Convergence: Ancient and Modern Mirroring\n\nModern prophets echo the ancient testimonies of Christ found in the Old Testament. Elder Dale G. Renlund taught, “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98), encouraging us to seek the Savior in every scripture. Similarly, President Dallin H. Oaks clarified, “the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). President Russell M. Nelson’s message on “The Everlasting Covenant” reminds us that covenants are central to God’s plan, just as they were in ancient Israel (Liahona, Oct. 2022, 4–11). These teachings mirror the Old Testament’s focus on Christ and covenants, showing that prophetic voices across time unite in testifying of eternal truths.\n\n---\n\n### Testimony Development: Building Unshakeable Conviction\n\nAs we recognize patterns in the Old Testament—such as God’s covenant love, Christ’s central role, and the restoration of plain and precious truths—our testimonies grow stronger. Studying how ancient prophets pointed to the Savior, and seeing those same truths affirmed by modern prophets, anchors us in the reality of God’s unchanging plan. I feel a deep gratitude for the Old Testament as a lamp unto my feet (Psalm 119:105), guiding me to Christ in ways I never anticipated. May we each experience this transformative power as we study with faith.\n\n---\n\n### Additional Study: Resources for Pattern Exploration\n\n- **CFM Lesson**: Revisit the sections on “Jesus Christ is Jehovah in the Old Testament” and “The Old Testament testifies of Jesus Christ” for further reflection on symbols and titles (Come, Follow Me: 2026).\n- **Guide to the Scriptures**: Explore “Types or Symbols of Christ” and “Jesus Christ” in the Gospel Library for additional cross-references.\n- **Prophetic Messages**: Study Elder Dale G. Renlund’s “Jesus Christ Is the Treasure” (Liahona, Nov. 2023, 98) and President Russell M. Nelson’s “The Everlasting Covenant” (Liahona, Oct. 2022, 4–11) to deepen your understanding of Christ and covenants.\n\n---\n\nAs we begin this year of study, let us commit to seeking the Savior in every chapter of the Old Testament. I know that as we do so, we will find Him, and through Him, we will draw nearer to our Heavenly Father. May the Spirit guide us in recognizing divine patterns that testify of God’s love and plan for each of us.",
  "generated_timestamp": "2025-12-31 23:38:50",
  "source_week_file": "cfm_2026_week_01.json"
}