{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "study_level": "connected",
  "word_count": 1196,
  "character_count": 7988,
  "content": "# Come, Follow Me—Old Testament 2026: Week 3 (January 12–18)  \n**Genesis 1–2; Moses 2–3; Abraham 4–5**  \n*God’s Creative Power Transforms Chaos into Magnificence*\n\n## Doctrinal Foundation\nFrom God's view, as revealed in these accounts, Creation begins with divine organization: “By mine Only Begotten I created these things” (CFM, “By mine Only Begotten I created these things”). Heavenly Father directs, and Jesus Christ executes, turning an earth “without form, and void” and “empty and desolate” (Genesis 1:2; Abraham 4:2) into something “magnificent.” From Moses' view in Pearl of Great Price, this mirrors eternal councils (Moses 2:1–25). From our view as spirit children, it teaches potential: “That’s what it means to be created in God’s image, after His likeness (see Genesis 1:26). We have the potential to become like Him: exalted, glorified, heavenly” (CFM Introduction). This layers meaning—God makes “light shine in dark moments” in our lives, filling emptiness with divine purpose.\n\nA mystery setup: Why repeat Creation three ways? Each reveals God's desire for us to know Him as Creator, ourselves as His image, and our role in stewardship and eternal families.\n\n## Scripture Deep Dive\n1. **Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25**: God teaches through progressive periods: “What does God teach you about it in Genesis 1:1–25; Moses 2:1–25; and Abraham 4:1–25? Why does He want you to know these things?” (CFM). This pattern appears in Moses, then Doctrine and Covenants 101:32–34, emphasizing organized beauty from chaos.\n\n2. **Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27**: “Ponder what it means to be created in God’s ‘image’ or ‘likeness,’ male and female” (CFM). Full verse: “And God said, Let us make man in our image, after our likeness” (Genesis 1:26). Escalates to self-worth: “How can they help you when you have negative feelings about yourself?”\n\n3. **Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18**: Marriage ordained: “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87).\n\n4. **Genesis 1:28; Moses 2:28; Abraham 4:28**: Stewardship: “What do Genesis 1:28; Moses 2:28; and Abraham 4:28 suggest about our responsibility toward God’s creations?” Links to Doctrine and Covenants 59:16–21; 104:13–18.\n\n5. **Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3**: Sabbath sanctified: “God made the Sabbath day holy, and He asks us to keep it holy” (CFM).\n\n6. **Contradiction Resolution**: Some say God's image means no need to improve (CFM). Resolve with “insights... from Mosiah 3:19 and Ether 12:27”—natural man opposed, but weakness made strong in Him.\n\n7. **Genesis 1:28**: Commands multiply, replenish—cultural context of ancient mandates for posterity, transforming in modern revelation.\n\n8. **Escalating Connection**: From earthly Creation to personal: “They can transform us into the divine beings we were meant to be” (CFM Intro). This pattern suggests endless progression.\n\n## Historical Context\nIn the ancient world, Genesis countered chaos myths, revealing one God organizing from nothing organized: “Because the world around us is so beautiful and majestic, it’s hard to imagine the earth when it was ‘without form, and void’” (CFM Intro). Moses and Abraham expand via restoration, creating time-collapse: pioneer Saints saw Creation anew amid wilderness (echoing bundle's generational tie via hymns like “All Creatures of Our God and King”). “For an overview of the book of Genesis, see ‘Genesis’ in the Bible Dictionary” (CFM)—positions as foundational history, aligning past desolation with our chaotic moments.\n\n## Pattern Recognition Web\n- Creation councils (Abraham 4:1) link to premortal councils (Doctrine and Covenants 101:32–34).\n- Image of God (Genesis 1:26–27) webs to bodies sacred (“Your body is sacred” in For the Strength of Youth, pages 22–29; Russell M. Nelson, “Your Body: A Magnificent Gift to Cherish,” Liahona, Aug. 2019).\n- Marriage (Genesis 2:18–25) to “The Family: A Proclamation to the World”; 1 Corinthians 11:11.\n- Stewardship (Genesis 1:28) to Doctrine and Covenants 59:16–21; Gérald Caussé, “Our Earthly Stewardship.”\n- Sabbath (Genesis 2:2–3) to Doctrine and Covenants 59:9–13.\nHidden connection: “By mine Only Begotten” (Moses 2) reveals Christ as Creator across dispensations, mirroring Adam-Eve eternal marriage.\n\nGenerational: Pioneers sang of Creation amid trials, as we do today.\n\n## Discussion Framework\n1. What most people miss: Why three Creation accounts? (CFM: “Why does He want you to know these things?”)\n2. How does “without form, and void” (Genesis 1:2) reflect personal chaos?\n3. From God's view, what does Creation teach about Jesus Christ?\n4. Ponder: “Because I know I am created in God’s image, I choose to…” (CFM).\n5. Respond to misconception: All desires approved? (Mosiah 3:19; Ether 12:27).\n6. How does eternal marriage (Genesis 2:24) elevate daily relationships?\n7. What stewardship means today (Genesis 1:28; Doctrine and Covenants 104:13–18)?\n8. Why “blessed and sanctified” Sabbath? (Genesis 2:2–3).\n9. Application: How can Creation heal negative self-feelings?\n10. Profound: How does God's ongoing Creation apply to exaltation?\n\n## Gospel Connections\nPrinciples web to Plan of Salvation: Premortal organization (Abraham 4) to mortal Creation in God's image (Genesis 1:26–27), stewardship as probation (Genesis 1:28; Doctrine and Covenants 59:16–21), eternal marriage (Genesis 2:18–25) sealing families. Surprising parallel: Sabbath rest foreshadows millennial peace (Doctrine and Covenants 59:9–13), from Creation to exaltation. “Their creative work with us is not finished” (CFM)—ongoing transformation.\n\n## Teaching Moments\n1. **Aha with Nature**: “Take them on a search outside for the kinds of things that were made during each period of Creation” (CFM Teaching Children). Hidden connection: Links Jesus as Creator to “My Heavenly Father Loves Me” (CS 228–29).\n2. **Mirror Puzzle**: Children see image in mirror while reading Moses 2:26–27; draw bodies as puzzles (CFM). Reveals reverence.\n3. **Sabbath Role-Play**: “Help your children role-play explaining... why they choose to do things on Sunday” using Genesis 2:2–3 (CFM).\n4. **Video Testimony**: Watch “God’s Greatest Creation” (President Nelson); contrast worldly messages (CFM).\n\n## Seminary Synthesis\n1. Seminary adapts mirror activity for youth: Deepen with “How does Heavenly Father want me to feel about my body?” (CFM video prompt), revealing body as “miraculous” (Nelson).\n2. Pattern: Progressive Creation days teach divine order—adapt for youth planners linking to Doctrine and Covenants 59 Sabbath laws.\n3. Stewardship insight: Use Gérald Caussé, “Our Earthly Stewardship,” with Genesis 1:28 for service projects.\n\n## Personal Reflection\n- Trace a “chaos to magnificent” moment in your life echoing Genesis 1:2.\n- What Creation element testifies of Christ's hand, filling your emptiness?\n- How has knowing “created in God’s image” (Moses 2:26–27) shifted self-treatment?\n- Sabbath: What makes it “blessed” uniquely for you (Genesis 2:2–3)?\n- Discover: One stewardship act from Genesis 1:28 to start this week.\n\n## Prophetic Echoes\nModern mirrors ancient: President Nelson echoes image of God: In “God’s Greatest Creation” (video), he “bears testimony of the miraculous human body” (CFM). Parallels “Your Body: A Magnificent Gift to Cherish” (Liahona, Aug. 2019). On marriage: “Adam and Eve were joined... by the power of [the] everlasting priesthood” (Nelson, “Lessons from Eve”). Stewardship: Gérald Caussé, “Our Earthly Stewardship,” Liahona, Nov. 2022, echoes Genesis 1:28. “The Sabbath Is a Delight” video sanctifies as God did (Genesis 2:2–3). These strike as God's voice across time.\n\nI bear testimony that pondering these truths draws us nearer to the Creators who organized worlds and hearts. Jesus Christ lives, and His light pierces every void.\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-10 10:56:40",
  "source_week_file": "cfm_2026_week_03.json"
}