{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "word_count": 855,
  "character_count": 5118,
  "content": "# Come, Follow Me Study Guide: Week 1 - December 29–January 4  \n**Introduction to the Old Testament**\n\n## Week Overview  \nWhat if the oldest book in the world could reveal the very nature of Jesus Christ and your personal covenant with God? The Old Testament, though ancient and sometimes intimidating, is a treasure map pointing to the Savior and His plan for us. As we begin this journey, let’s uncover how these sacred writings illuminate our path, just as the psalmist declared: “Thy word is a lamp unto my feet, and a light unto my path” (Psalm 119:105).\n\n## Key Scripture Moments  \nHere are pivotal moments that set the tone for our study. Notice what happens next in each:  \n1. **Jesus as Jehovah Revealed** - In Exodus 3:14, God declares to Moses, “I AM THAT I AM.” This becomes remarkable when Jesus echoes this in John 8:58, saying, “Before Abraham was, I am.” The connection stuns His listeners, revealing His divine identity as Jehovah.  \n2. **Symbols of Christ in Manna** - In Exodus 16:4, the Lord promises, “Behold, I will rain bread from heaven for you.” This points directly to John 6:35, where Jesus says, “I am the bread of life.” Notice the pattern of physical sustenance mirroring spiritual nourishment.  \n3. **Covenant Promises** - In Exodus 19:5, the Lord says, “If ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me.” This theme of covenant relationship echoes through Moses, Nephi (2 Nephi 3:12), and Joseph Smith’s restorations.  \n4. **Restored Truths** - In Moses 6:63, the Lord teaches Adam, “All things have their likeness, and all things are created and made to bear record of me.” This restored verse unveils how everything in scripture testifies of Christ—a pattern from Adam to today.\n\n## Hidden Connections  \nLet’s uncover links most miss:  \n- The brass serpent in Numbers 21:9, where “Moses made a serpent of brass, and put it upon a pole,” directly connects to John 3:14, where Jesus says, “As Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.” This ancient symbol solves our modern need for healing through faith in Christ.  \n- The “plain and precious things” lost from the Bible (1 Nephi 13:28) are restored through Joseph Smith, like Enoch’s Zion in Moses 7:18. This bridges ancient covenants to our modern understanding of gathering Israel.\n\n## Pattern Discovery  \nNotice this pattern: God’s covenant love repeats across time. From Abraham’s covenant in Exodus 19:5 to Jeremiah’s promise of a “new covenant” in Jeremiah 31:31, we see God’s persistent desire to claim us as His “peculiar treasure.” This pattern continues in the Book of Mormon (2 Nephi 3:12) and modern revelation through Joseph Smith, showing that covenants aren’t ancient history—they’re our living connection to God.\n\n## Simple Questions  \nLet’s build anticipation with these reflective prompts:  \n1. How does knowing Jesus Christ is Jehovah (Exodus 6:3) change the way you read the Old Testament?  \n2. What symbols of Christ, like manna or the sacrificial lamb, stand out to you in these early stories?  \n3. Why do you think God calls His people a “peculiar treasure” (Exodus 19:5)?  \n4. How do restored truths, like those in the book of Moses, deepen your understanding of God’s plan?  \n5. What does the idea of covenants teach you about your relationship with Heavenly Father?  \n6. How can looking for Christ in every story help you feel closer to Him this year?\n\n## One Big Idea  \nThe central principle is this: The Old Testament testifies of Jesus Christ as Jehovah, the covenant-making God who seeks to redeem us. Historically, these writings span thousands of years, from Adam to Malachi, yet they consistently point to the Savior through symbols, prophecies, and covenants. Understanding that “all things are created and made to bear record of me” (Moses 6:63) transforms the Old Testament from a distant history into a personal witness of Christ’s mission.\n\n## Living It  \nLet’s apply these ancient truths to today:  \n1. **Seek Christ Daily** - Just as manna sustained Israel, look for “daily bread” by seeking Jesus in scripture and prayer.  \n2. **Honor Covenants** - Reflect on promises you’ve made with God, like at baptism (Mosiah 18:10), and strive to keep them with joy.  \n3. **Share the Light** - Teach a child or friend how Old Testament stories, like Isaiah’s prophecies (Isaiah 9:6), point to Jesus, strengthening their faith.\n\n## Faith Builder  \nRecent prophetic teachings echo these truths. Elder Dale G. Renlund urged us to “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98), reminding us to seek the Savior in every page of the Old Testament. President Russell M. Nelson’s message on “The Everlasting Covenant” (Liahona, Oct. 2022, 4–11) invites us to see our covenant relationship as a source of “special love and mercy.” These modern voices confirm the ancient witness: Christ is the heart of all scripture. As we embark on this study, I feel a quiet assurance that the Spirit will guide us to see Him more clearly and draw nearer to our Heavenly Father through these sacred words.",
  "generated_timestamp": "2026-01-01 00:03:35",
  "source_week_file": "cfm_2026_week_01.json"
}