{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "study_level": "scholarly",
  "word_count": 1202,
  "character_count": 8807,
  "content": "# Advanced Scholarly Come, Follow Me Study Guide: Week 3  \n**January 12–18: Genesis 1–2; Moses 2–3; Abraham 4–5**\n\n## Doctrinal Architecture: Three-Lens Analysis\nThe Creation accounts in Genesis 1–2, Moses 2–3, and Abraham 4–5 reveal foundational principles of divine organization from chaos, human divine potential, and covenantal responsibilities.  \n\n**Ancient Context**: These texts portray a purposeful progression from an earth “without form, and void” (Genesis 1:2; Abraham 4:2) to a realm teeming with life, culminating in humanity formed in God's “image” and “likeness” (Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27). The plural “Gods” in Abraham 4 emphasizes council-like divine organization under Heavenly Father, with the Only Begotten as agent (Moses 2:1).  \n\n**Modern Application**: Revelation underscores ongoing creation: “By mine Only Begotten I created these things” (Moses 2:1), extending to personal transformation from chaos to magnificence, as life’s “empty and desolate” moments yield to light and purpose (Come, Follow Me—For Home and Church: Old Testament 2026).  \n\n**Eternal Principle**: Humanity’s creation male and female in God’s image (Genesis 1:27) establishes infinite potential for exaltation, with stewardship (Genesis 1:28) and Sabbath sanctification (Genesis 2:2–3) as covenant markers bridging dispensations.\n\n## Exegetical Analysis: Textual Archaeology\nDelving into 8–10 key passages uncovers layered meanings through prophetic restoration texts.  \n\n1. **Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25**: “By mine Only Begotten I created these things” (Moses 2:1). Ancient Hebrew *bara* (create from nothing) aligns with *organize* in Abraham 4, revealing premortal council patterns (Abraham 4:1). Prophetic lens: God reveals Christ’s role to affirm His creative power amid modern chaos.  \n\n2. **Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27**: “God said, Let us make man in our image, after our likeness” (Genesis 1:26). Layers: Physical form mirrors divine parents; spiritual potential counters natural man (Mosiah 3:19; Ether 12:27).  \n\n3. **Genesis 1:27–28; Moses 2:28; Abraham 4:28**: “Be fruitful, and multiply, and replenish the earth, and subdue it” (Genesis 1:28). Stewardship mandate includes dominion with care (Doctrine and Covenants 59:16–21).  \n\n4. **Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3**: “God blessed the seventh day, and sanctified it” (Genesis 2:3). Typological rest prefigures eternal Sabbath covenants (Doctrine and Covenants 59:9–13).  \n\n5. **Genesis 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18**: “It is not good that the man should be alone” (Genesis 2:18). Eternal marriage ordinance evident: Adam and Eve joined “for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87).  \n\n6–8. Parallel councils (Abraham 4:1, 26; Moses 2:1, 26) reveal Gods organizing; human image as covenantal type; Sabbath as capstone. Modern lens: Body as “magnificent gift” (see Russell M. Nelson, “Your Body: A Magnificent Gift to Cherish,” Liahona, Aug. 2019, 50–55).  \n\nThese excavations display prophetic fulfillment arcs from temporal creation to eternal progression.\n\n## Historical & Cultural Matrix\nIn ancient Near Eastern contexts, creation myths depicted chaotic battles; contrastingly, these biblical accounts emphasize serene organization by divine council (Abraham 4:1), bridging to Enoch’s visions (Moses 2, contextual via Pearl of Great Price). Edenic marriage (Genesis 2:24) counters polytheistic fragmentation, prefiguring “The Family: A Proclamation to the World.” Temporal bridges: Premortal council mirrors modern temple instruction; stewardship addresses contemporary environmental calls (see Gérald Caussé, “Our Earthly Stewardship,” Liahona, Nov. 2022, 57–59), fulfilling Genesis 1:28’s subdue-with-care pattern.\n\n## Cross-Reference Web Matrix\n\n**SCHOLARLY CROSS-REFERENCE WEB MATRIX**  \n*Doctrinal Threads Across Dispensations*\n\n**Primary Pattern**: Divine Creation through the Only Begotten, Forming Humanity in God's Image  \n├─ **Ancient Foundations** (Genesis through Malachi)  \n│   ├─ Genesis 1:26: “And God said, Let us make man in our image, after our likeness”  \n│   ├─ Genesis 2:2–3: “And on the seventh day God ended his work which he had made; and he rested”  \n│   └─ Prophetic type/symbol: Adam-Eve union as eternal marriage type (Genesis 2:24)  \n│  \n├─ **Meridian Fulfillment** (New Testament parallels)  \n│   ├─ Christ's teaching: 1 Corinthians 11:11: (neither is the man without the woman)  \n│   ├─ Apostolic witness: (Supporting natural man transcendence, see Mosiah 3:19; Ether 12:27)  \n│   └─ Gospel fulfillment: Sabbath rest in Christ’s finished work  \n│  \n├─ **Restoration Revelation** (D&C/Pearl of Great Price)  \n│   ├─ Modern revelation: Doctrine and Covenants 101:32–34 (upon receipt of light, comprehend God)  \n│   ├─ Joseph Smith insight: Moses 2:1: “By mine Only Begotten I created these things”  \n│   └─ Latter-day application: Sabbath delight (Doctrine and Covenants 59:9–13, 16–21)  \n│  \n└─ **Living Prophets** (From bundle sources only)  \n    ├─ Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87: “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood”  \n    ├─ Additional witness: see Russell M. Nelson, “Your Body: A Magnificent Gift to Cherish,” Liahona, Aug. 2019, 50–55  \n    └─ Modern application: Cherish body as sacred, countering worldly messages (video “God’s Greatest Creation”)\n\n## Theological Discussion Points: Socratic Progression\n1. What patterns emerge in the sequential “days” of Creation across Genesis 1, Moses 2, Abraham 4?  \n2. How does “image and likeness” (Genesis 1:26) distinguish humanity from prior creations?  \n3. In what ways does Abraham 4’s “Gods” council illuminate premortal organization?  \n4. Analyze stewardship in Genesis 1:28 alongside Doctrine and Covenants 104:13–18—what tensions arise?  \n5. How does natural man doctrine (Mosiah 3:19) refine “image of God” potential?  \n6. Trace Sabbath sanctification from Genesis 2:3 to personal “delight” (Doctrine and Covenants 59:9–13).  \n7. What covenantal implications reside in Adam-Eve’s eternal union (Nelson, “Lessons from Eve”)?  \n8. How do Creation accounts transform views of personal chaos into divine purpose?  \n9. Compare male-female creation (Genesis 1:27) with “The Family: A Proclamation to the World.”  \n10. Apply Ether 12:27 to body reverence amid modern influences.  \n11. Synthesize: How does Creation prefigure personal exaltation covenants?  \n12. Transformative: What weekly practices honor Creation stewardship today?\n\n## Modern Prophetic Synthesis: Then and Now\nBundle sources integrate ancient Creation with contemporary witness. Then: “Without form, and void” yields organized beauty (Genesis 1:2). Now: Nelson affirms eternal marriage priesthood power, elevating Genesis 2:18–25. “Then and Now” arc: Sabbath from rest (Genesis 2:3) to delight (“The Sabbath Is a Delight” video); stewardship from subdue (Genesis 1:28) to earthly care (Caussé reference). Continuity: Body as “magnificent” gift (Nelson video), fulfilling image doctrine.\n\n## Seminary & Institute Integration\nSeminary visuals (“The Creation of the Earth” in Old Testament Stories, 8–12) reveal sequential patterns for teachers. Institute-level: Mirror exercises with Moses 2:26–27 expose divine image reverence; puzzle activities symbolize wholeness in God’s likeness, deepening dispensational parallels.\n\n## Teaching Applications\nEmploy reverent discovery: Outdoor “Creation periods” hunts for children, linking to “My Heavenly Father Loves Me” (Children’s Songbook, 228–29). Adults: Role-play Sabbath explanations using Genesis 2:2–3. Sophisticated: “Temporal bridges” charts comparing Abraham 4 council to modern family proclamation, fostering typological analysis in elders quorum.\n\n## Personal Study Pathways\n**Level 1 (Foundational)**: Read parallels outdoors, noting reverence (Hymns, no. 62).  \n**Level 2 (Exegetical)**: Chart “image” usages across texts; apply “Because I know I am created in God’s image, I choose to…”  \n**Level 3 (Synthetic)**: Cross-reference stewardship with Doctrine and Covenants 59; journal Sabbath delights.  \n**Progressive Marker**: Track personal “creations” from chaos, anticipating eternal patterns.\n\n## Research Extensions\nConsult Bible Dictionary “Genesis”; Gospel Library “Environmental Stewardship.” Methodology: Parallel-column charts of Genesis/Moses/Abraham; trace “Only Begotten” through Pearl of Great Price. Further: Liahona/For the Strength of Youth issues; video “God’s Greatest Creation” with notetaking on body sacredness.\n\nThese ancient covenantal patterns invite deeper exploration of how divine revelation spans dispensations.",
  "generated_timestamp": "2026-01-18 19:31:26",
  "source_week_file": "cfm_2026_week_03.json"
}