{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "study_level": "essential",
  "word_count": 622,
  "character_count": 4058,
  "content": "# Come, Follow Me Week 3: Genesis 1–2; Moses 2–3; Abraham 4–5 (Jan 12–18)\n\n## Week Overview\nWhat if God revealed that He can transform “without form, and void” and “empty and desolate” chaos into majestic beauty (Genesis 1:2; Abraham 4:2)? These accounts show Heavenly Father and Jesus Christ as Creators who make “something magnificent out of something unorganized”—a promise for our chaotic moments.\n\n## Key Scripture Moments\n1. **The Creator at work**: \"By mine Only Begotten I created these things.\" Notice what happens in Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25—God organizes light from darkness, heavens from waters, life from void. Here's the remarkable moment: Jesus, the Only Begotten, directs it all.\n   \n2. **Our divine image revealed**: In Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27, God says, “Let us make man in our image, after our likeness.” Dramatic reveal: male and female, created sacred, with potential to become like Him.\n\n3. **Sacred union ordained**: Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18 show Adam and Eve joined. “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87).\n\n4. **Rest and holiness**: Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3 declare God “rested... and sanctified it.” The seventh day becomes blessed.\n\n## Hidden Connections\nThese parallel accounts (Genesis, Moses, Abraham) mirror each other verse-by-verse, illuminating Creation's order. Genesis 1:28; Moses 2:28; Abraham 4:28 command stewardship: “be fruitful, and multiply, and replenish the earth, and subdue it”—echoed in Doctrine and Covenants 59:16–21; 104:13–18. Ponder Mosiah 3:19 and Ether 12:27 against claims that God's image means no need to improve: “the natural man is an enemy to God” yet weaknesses become strengths through Christ.\n\n## Pattern Discovery\nNotice this pattern across prophets: Chaos yields light (Genesis 1:3; Moses 2:3; Abraham 4:3), then life, culminating in humanity in God's image. It repeats in stewardship (replenish, subdue) and Sabbath rest. This becomes powerful when we see God’s organizing hand—from formless earth to exalted beings—mirroring our transformation.\n\n## Simple Questions\n1. What does Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25 teach about Heavenly Father, Jesus Christ, the world, and yourself?\n2. How does knowing you’re created in God’s image (Genesis 1:26–27) change negative feelings about yourself?\n3. “Because I know I am created in God’s image, I choose to…” (complete this).\n4. What do Genesis 1:28; Moses 2:28; Abraham 4:28 suggest about caring for creations?\n5. What makes the Sabbath “blessed” to you (Genesis 2:2–3; Moses 3:2–3)?\n6. How can treating marriage as sacred honor God’s plan?\n\n## One Big Idea\nWe are created “in God’s image, after His likeness” (Genesis 1:26), with divine potential. Amid ancient formless void, God reveals through Moses and Abraham the same truth: Jesus creates order, blesses families, and sanctifies rest—transforming us into exalted beings.\n\n## Living It\n1. While among creations, read Genesis 1:1–25; share pictures and testimony, as suggested.\n2. Complete: “Because I know I am created in God’s image, I choose to…” honor your sacred body (For the Strength of Youth, 22–29).\n3. On the Sabbath, draw or role-play holy activities from Genesis 2:2–3, making it different and delightful.\n\n## Faith Builder\nPresident Russell M. Nelson testifies in “God’s Greatest Creation” (Gospel Library): the human body is miraculous—Heavenly Father wants us to cherish it, countering worldly messages. “Adam and Eve were joined together in marriage for time and for all eternity” (Russell M. Nelson, “Lessons from Eve”). Gérald Caussé echoes stewardship: “Our Earthly Stewardship” (Liahona, Nov. 2022). These align ancient Creation with today’s prophetic call to create, cherish, and rest in the Lord.\n\nI bear testimony: studying these accounts draws us nearer to the Creators who know and love us eternally. (748 words)",
  "generated_timestamp": "2026-01-10 10:56:18",
  "source_week_file": "cfm_2026_week_03.json"
}