{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "essential",
  "word_count": 654,
  "character_count": 4199,
  "content": "# Week 2: January 5–11 - Moses 1; Abraham 3\n\n## Week Overview\nFeel the weight when Moses, fresh from a vision of God's creations, pleads, “Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens” (Moses 1:36). This moment opens not with “in the beginning,” but with profound context for all creation—revealing who God is, who we are, and our place in His work. Through latter-day visions to Moses and Abraham, notice how these truths frame the entire Old Testament.\n\n## Key Scripture Moments\n- **Moses 1:4, 6**: Here's the remarkable moment when God declares to Moses his divine worth amid a vision of worlds without number. Notice what happens next: God contrasts this eternal truth with fleeting earthly identity.\n- **Moses 1:12**: Observe Satan's counterfeit message—“Moses, son of man”—immediately after Moses beholds God. This dramatic shift highlights the battle for identity.\n- **Moses 1:13–18, 24–26**: See Moses's triumph as he commands, “Depart hence, Satan,” relying on the Lord's deliverance. What finally overcomes the adversary?\n- **Abraham 3:22–28**: Discover the quiet power in Abraham's vision of premortal spirits, where truths about self and Christ emerge before “the world was.”\n\n## Hidden Connections\nThese visions link ancient questions to restored light. Moses 1:31–39 answers his plea about earth's inhabitants, echoing Abraham 3:24–26 on premortal choices to “prove” ourselves. Notice how Satan’s doubt in Moses 1:12 mirrors modern confusions President Russell M. Nelson described: “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity” [worldwide devotional for young adults, May 2022], Gospel Library). This pattern solves today's identity struggles by rooting worth in premortal reality.\n\n## Pattern Discovery\nTrace the recurring contrast between God's affirming voice and Satan's deceptions: God to Moses in 1:4, 6 declares divine sonship; Satan in 1:12 reduces to “son of man.” Moses resists by recalling God's power (1:13, 15, 18, 20–22, 26), a pattern extending to premortal council in Abraham 3:22–28, where spirits choose agency to gain eternal life. This becomes powerful when seen in God's work: “to bring to pass the immortality and eternal life of man” (Moses 1:39).\n\n## Simple Questions\n1. What differences emerge between God's words in Moses 1:4, 6 and Satan's in 1:12?\n2. How does Moses overcome temptation in 1:12–26—what step turns the tide?\n3. In Moses 1:31–39, why do these creations exist—what's the purpose?\n4. List truths about self and Christ from Abraham 3:22–28—how do they shift daily choices?\n5. Notice Moses 1:36's plea—how does Abraham 3:24–26 answer it?\n6. “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”)—which label comes first for you?\n\n## One Big Idea\nGod's work and glory centers on our divine identity as His children, proven through premortal choices and earthly tests (Moses 1:39; Abraham 3:22–28). In Joseph Smith's inspired translation, Moses's vision provides Creation's context, revealing immortality through Christ and eternal life by obedience—transforming Genesis from mere origins to a personal divine plan.\n\n## Living It\n- Counter Satan's counterfeits like fake plants by recalling God's voice: At meals or chores, affirm family as “children of God” using mirrors or pictures (Moses 1:4).\n- Practice resisting as Moses did—pray, walk away, seek help—then act it out with children facing choices (Moses 1:12–26; Abraham 3:25).\n- Draw premortal truths into decisions: Sing “I Will Follow God’s Plan” (Children’s Songbook, 164–65) while listing how identity guides choices.\n\n## Faith Builder\nRecent counsel echoes these visions: President Nelson urged knowing “the truth about who you are” first (“Choices for Eternity”). See also Gary E. Stevenson, “Deceive Me Not,” Ensign or Liahona, Nov. 2019, 93–96, linking Moses's resistance to recognizing modern counterfeits.\n\nThese visions of premortal councils and divine worth invite us to embrace our role in God's work toward eternal life through Jesus Christ.",
  "generated_timestamp": "2026-01-18 19:28:42",
  "source_week_file": "cfm_2026_week_02.json"
}