{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "study_level": "connected",
  "word_count": 989,
  "character_count": 6779,
  "content": "# Come, Follow Me 2026: Week 4 (January 19–25)  \n**Genesis 3–4; Moses 4–5**  \n*“Leaving the Garden of Eden was the necessary first step toward returning to God and eventually becoming like Him.” (Come, Follow Me—For Home and Church: Old Testament 2026, Introduction)*\n\n## Doctrinal Foundation\nConsider the Fall from three perspectives to uncover its divine purpose. From Adam and Eve's view in the Garden, it appears as separation: “cast out... into a world of pain, sorrow, and death” (Genesis 3:16–19). From Satan's view in Moses 4:1–4, it tempts toward misery, as he “sought... to destroy the agency of man.” Yet from God's view, revealed through Moses, it launches eternal progression: Adam and Eve “were glad” after learning of redemption, tasting “the joy of our redemption” (Moses 5:9–12, 11). This resolves the apparent contradiction—tragedy becomes triumph through opposition, enabling “choices, making mistakes, learning to repent, and trusting the Savior” (Introduction). As Lehi taught, without opposition “righteousness could not be brought to pass” (2 Nephi 2:19–25).\n\n## Scripture Deep Dive\nTrace escalating connections across six key passages, revealing God's merciful plan:\n\n1. **Moses 4:1–4**: Satan rebels, but God and Christ protect agency: “I will redeem all mankind... Get thee hence, Satan.” This pattern appears in Moses, then 2 Nephi 2:11–20, where Lehi echoes, “opposition... is essential to... agency.”\n\n2. **Genesis 3:1–7; Moses 4:22–31**: The Fall brings consequences—pain, toil, death. Mark these; they affect us daily, yet set up redemption.\n\n3. **Moses 5:4–15**: An angel reveals sacrifice and baptism; Adam and Eve rejoice, “glad” for gospel knowledge (Moses 5:10). Echoes Alma 12:21–37 on probationary state.\n\n4. **Moses 4:13–16, 27**: Nakedness symbolizes vulnerability; God “clothed them.” Parallels Revelation 7:9, 13–15 (white robes) and 2 Nephi 9:14 (spiritual nakedness without Atonement).\n\n5. **Moses 5:4–9, 16–26**: Abel's willing sacrifice accepted, Cain's not—due to heart. Links to Mosiah 3:19 (natural man) and D&C 29:39–43 (redemption from Fall).\n\n6. **Moses 5:13–33**: Satan deceives Cain to murder; yet God warns. Pattern escalates to D&C 109:22–26,76 (clothed in power).\n\nThese build from agency to redemption, transforming a “seeming tragedy” into “glory” (Introduction).\n\n## Historical Context\nIn the ancient world Adam and Eve entered, opposition defined existence—thorns, labor, mortality (Genesis 3:16–19). Moses restores clarity: post-Fall, they built altars, offered sacrifices “in similitude of the sacrifice of the Only Begotten” (Moses 5:5–9, as depicted in Mike Malm's painting). This creates a time-collapse moment: pioneers faced similar wilderness trials, yet found “joy” through covenants, mirroring Adam's prayerful solitude (Moses 5:4,8). Cultural misunderstandings, like Genesis 3:16's “rule over” Eve, resolve today: prophets clarify equal partnership (see “The Family: A Proclamation to the World”).\n\n## Pattern Recognition Web\nThis week's truths web across dispensations:\n- **Agency/Opposition**: Moses 4:1–4 → 2 Nephi 2:25–30 (“free to choose”) → D&C 29:39–43.\n- **Redemption from Fall**: Genesis 3:16; Moses 4:22 → Moses 5:8–11 (“Because of Him”) → Alma 11:42; Romans 5:12.\n- **Satan's Deceptions**: Moses 4:4–12; 5:13–33 → 2 Nephi 2:11–20.\n- **Sacrifices**: Moses 5:16–26 → Mosiah 3:19.\nGenerational link: Like Adam learning to pray outside Eden (Moses 5:4,8), early Saints sacrificed in Nauvoo, heeding prophetic calls amid opposition.\n\n## Discussion Framework\n1. What most people miss: Why were Adam and Eve “glad” post-Fall? (Moses 5:9–12).\n2. How does Satan's lie in Moses 4:4 (“Ye shall not surely die”) deceive today?\n3. Resolve: If Fall brought pain (Genesis 3:16–19), why no regret? (2 Nephi 2:19–25).\n4. What protects agency? (Moses 4:1–4; Elder Renlund: Heavenly Father wants us to “choose to do what is right” [“Choose You This Day,” Ensign or Liahona, Nov. 2018, 104]).\n5. Nakedness symbolism? (Moses 4:13–16,27; D&C 109:76).\n6. Why Abel over Cain? Heart attitude (Moses 5:16–26).\n7. Apply: “Because of the Fall, I…” vs. “Because of Jesus Christ, I…” (Moses 4:25; 5:8–11; 6:59).\n8. Modern echo: Equal partners despite Genesis 3:16? (Elder Renlund: Husband “will treat his wife with the utmost respect” [The Melchizedek Priesthood, 2018, 23]).\n9. How does opposition build joy? (Moses 5:11).\n10. Profound: What sacrifices does God accept today? (Moses 5:4–9).\n\n## Gospel Connections\nPrinciples anchor in Plan of Salvation: Fall initiates mortality for growth (Moses 5:9–12; D&C 29:39–43), opposition enables agency (2 Nephi 2:27), Atonement redeems (Moses 5:14–15; Alma 12:21–37). Surprising parallel: Cain's rejected offering (Moses 5:16–26) foreshadows natural-to-submissive man (Mosiah 3:19), leading to exaltation.\n\n## Teaching Moments\n1. **Aha with Pictures**: Sequence “Adam and Eve” pictures (Old Testament Stories, 13–16); reveal angel's hope (Moses 5:4–15) for “time collapse” gratitude.\n2. **Object Lesson**: One-color drawing (Moses 4:1–4); discuss choices, sing “Choose the Right Way” (CS 160–61).\n3. **Sentence Completions**: Families fill “Because of the Fall, I…” (Romans 5:12; 2 Nephi 2:22–23) then “Because of Jesus Christ, I…” (Moses 5:8–11)—hidden joy connection.\n4. **Pairs Teach**: One group Moses 4/2 Nephi 2; share agency protections.\n\n## Seminary Synthesis\n1. Seminary highlights Abel's “willing heart” vs. Cain (Moses 5:16–26), adapting for classes: Chart sacrifices' attitudes, link to modern obedience.\n2. Angel's gospel outline (Moses 5:4–15) reveals baptism/sacrifice pattern; teachers adapt by mapping to Aaronic Priesthood duties.\n3. Clothing motif (Moses 4:13–16,27) synthesizes temple readiness, prompting youth reflection on covenants.\n\n## Personal Reflection\n- Where has opposition revealed joy in your life, like Adam's gladness (Moses 5:10–11)?\n- What deceptions blind you today (Moses 5:13–33)? How access Christ's protection (Moses 4:1–4)?\n- Recall a “good choice” feeling (2 Nephi 2:27)—draw it, as with children.\nI testify Christ’s Atonement turns Fall's thorns to redemption's fruit, as these verses witness.\n\n## Prophetic Echoes\nModern prophets mirror ancient truths strikingly. Elder Dale G. Renlund: “Our Heavenly Father’s goal... is to have His children choose to do what is right” (Nov. 2018, 104)—echoes Moses 4:1–4's agency safeguard. On marriage, Elder Renlund and Sister Renlund: Righteous husband “will treat his wife with the utmost respect and deference” (2018, 23), clarifying Genesis 3:16 as equal partnership (“The Family: A Proclamation”). Elder Oaks' “Opposition in All Things” (May 2016) parallels 2 Nephi 2:19–25, urging choice amid Satan's deceptions (Moses 5:13–33). These align past glory with present path.\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-10 22:38:55",
  "source_week_file": "cfm_2026_week_04.json"
}