{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "essential",
  "word_count": 622,
  "character_count": 3944,
  "content": "# Come, Follow Me 2026: Week 2 (January 5–11)  \n**Moses 1; Abraham 3**\n\n## Week Overview\nWhat if the Lord revealed your true identity before answering your deepest questions about creation? That's exactly what happened to Moses when he asked, “Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens” (Moses 1:36). This vision, along with Abraham's, frames the Old Testament by answering: Who is God? Who are we? What is God’s work, and what is our place in it?\n\n## Key Scripture Moments\nHere's the remarkable moment when God declares Moses's divine worth: “thou art in the similitude of mine Only Begotten” (Moses 1:6). Notice what happens next—Satan counters with doubt: “Moses, son of man, worship me” (Moses 1:12). Then, the dramatic turning point: Moses calls on God and sees Satan's defeat (Moses 1:20–22, 26). Finally, after glimpsing endless worlds, Moses hears God's purpose: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39).\n\n## Hidden Connections\nThese visions connect ancient seers: Like Moses seeing God's creations (Moses 1:27–39), Abraham beholds premortal intelligences chosen for earth's proving (Abraham 3:22–28). Both reveal our premortal roots—“before the world was” (Abraham 3:22)—echoing Moses's plea for earth's inhabitants (Moses 1:36). Satan’s counterfeit power in Moses 1:13–18 mimics God's true authority, a pattern solved by invoking “the name of the Only Begotten” (Moses 1:25).\n\n## Pattern Discovery\nNotice this pattern across prophets: God affirms identity first—Moses as “son of man” yet like His Son (Moses 1:4, 6)—before Satan attacks it (Moses 1:12). Abraham sees noble spirits, including “one among the selves” like Jesus, prepared “to make an earth” and “prove them herewith” (Abraham 3:24–25). This repeats: divine worth precedes temptation and purpose, linking Moses's resistance (Moses 1:13, 15, 18, 20–22, 26) to our premortal choices.\n\n## Simple Questions\n1. In Moses 1:4, 6 and 1:12, how do God's words differ from Satan's—what does this teach about your identity?  \n2. What helped Moses overcome in Moses 1:24–26—how can that strengthen your testimony?  \n3. Why does Moses ask “why these things are so” after the vision (Moses 1:30)—what's God's answer in 1:31–39?  \n4. In Abraham 3:24–26, what truths about yourself and Jesus Christ stand out?  \n5. How does knowing you lived “before the world was” (Abraham 3:22) change daily decisions?  \n6. What's the difference between immortality and eternal life (Moses 1:39; Topics and Questions, “Eternal Life”)?\n\n## One Big Idea\nGod’s work and glory is “to bring to pass the immortality and eternal life of man” (Moses 1:39). Revealed to Moses after his identity affirmation, this principle from Joseph Smith's inspired translation reframes creation—not random, but purposeful for our eternal growth. Abraham's vision adds premortal context: We were spirits chosen to “prove” ourselves through obedience (Abraham 3:25).\n\n## Living It\nCompare God's message in Moses 1:4 with Satan's in 1:12 at family dinner—how does this guide treating yourself and others as children of God? When tempted, act out Moses's steps: pray, command in Christ's name, and seek help (Moses 1:13–26). List choices flowing from your divine identity, as it “affects almost every decision you will ever make” (“Choices for Eternity”).\n\n## Faith Builder\nPresident Russell M. Nelson taught, “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity” [worldwide devotional for young adults, May 2022], Gospel Library). Echoing Moses 1:4, 6, he urges knowing “the truth about who you are” first. These latter-day words confirm ancient visions, inviting us to let this truth shape our path to eternal life. I cherish how the Spirit witnesses this divine heritage in my own life.",
  "generated_timestamp": "2026-01-10 22:36:15",
  "source_week_file": "cfm_2026_week_02.json"
}