{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "word_count": 1498,
  "character_count": 9636,
  "content": "# Come, Follow Me 2026 Old Testament Study Guide  \n## Week 1: December 29–January 4 - Introduction to the Old Testament\n\nWelcome, dear friends, to a year of sacred exploration in the Old Testament. As we embark on this journey together, I invite you to open your hearts to the ancient voices that testify of Jesus Christ and the everlasting covenant. This study guide is designed to illuminate divine patterns, uncover hidden connections, and deepen your conviction in the restored gospel through rigorous study and spiritual reflection. Let’s dive into the scriptures with faith, seeking the light that will guide our path (Psalm 119:105).\n\n### Theological Framework: Pattern Recognition Mastery\nThe Old Testament is a tapestry of divine patterns that span dispensations, revealing God’s consistent plan for His children. One central theme is the testimony of Jesus Christ as Jehovah, the God of the Old Testament, who speaks and acts as the Savior across time. As President Dallin H. Oaks taught, “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). This pattern of Christ’s identity as Jehovah emerges from Exodus 3:14, where He declares Himself as “I AM,” and continues through modern revelation where His role is clarified (John 8:58–59). Another recurring theme is the covenant relationship, seen in God’s promise to make Israel His “peculiar treasure” (Exodus 19:5), a pattern that extends to us today as we enter into covenants through baptism and temple ordinances. These principles of divine identity and covenant-making connect Adam’s sacrifices (Moses 6:63) to Abraham’s promises (Abraham 3:22–28) and to President Russell M. Nelson’s teachings on the everlasting covenant (Liahona, October 2022, 4–11).\n\n### Exegetical Insights: Hebrew Terms and Literary Structures\nWhile the provided bundle does not include specific Hebrew terms or archaeological discoveries for this introductory week, we can still appreciate the literary structure of the Old Testament as a collection of testimonies. The Come, Follow Me manual highlights the ancient cultural context as “foreign and sometimes strange or even uncomfortable,” yet it invites us to see familiar gospel themes (Come, Follow Me: 2026, Introduction to the Old Testament). For instance, the poetic imagery in Psalm 119:105—“Thy word is a lamp unto my feet, and a light unto my path”—uses a metaphor of guidance that resonates across cultures and eras. This literary device of light as divine direction is a paradigm shift, reminding us that the Old Testament is not merely historical but a living guide for our discipleship.\n\n### Prophetic Pattern Architecture: Time Collapse Analysis\nThe Old Testament reveals a divine architecture where ancient events mirror modern truths. Consider the pattern of Jesus Christ as Jehovah: His declaration in Exodus 3:14 as “I AM” finds its echo in John 8:58, where He states, “Before Abraham was, I am,” shocking His listeners (Come, Follow Me: 2026). This time collapse shows that Christ’s identity as the eternal God spans dispensations. Similarly, the covenant pattern from Abraham to modern temple worship collapses time, as President Nelson explains in “The Everlasting Covenant” that these sacred agreements bind us to God with “a special kind of love and mercy” (Liahona, October 2022, 4–11). These patterns indicate that God’s plan is unchanging—whether in the wilderness of Sinai or in our sacrament meetings today, He seeks to redeem and covenant with His people.\n\n### Cross-Reference Web Matrix\nThe Old Testament is intricately connected to all standard works, revealing hidden relationships through a web of references:\n- **Christ as Jehovah**: Exodus 3:13–15 and 6:3–5 connect to John 8:58–59, affirming His divine identity across testaments.\n- **Symbols of Christ**: Manna (Exodus 16:4, 11–15) links to John 6:35, where Christ declares, “I am the bread of life.” The sacrificial lamb (Exodus 12:3–5) ties to John 1:29, “Behold the Lamb of God.” The brass serpent (Numbers 21:4–10) connects to John 3:14, and Jonah’s ordeal (Jonah 1:4–17) parallels Matthew 12:38–41.\n- **Restored Truths**: 1 Nephi 13:21–29 speaks of “plain and precious things” restored through Joseph Smith, such as Moses 7:18–19 (Enoch’s Zion) and Abraham 3:22–28 (the premortal council), enhancing our understanding of Genesis.\n- **Covenant Themes**: Exodus 19:5 and Jeremiah 31:31–34 connect to Mosiah 18:10, 13, illustrating the continuity of God’s promises through baptism and beyond.\n\nThese connections weave a matrix of truth, showing the Old Testament as a foundation for all scripture.\n\n### Historical and Cultural Context\nThe Old Testament emerges from an ancient Near Eastern culture that can feel distant, yet it reflects universal human experiences of faith, family, and failure (Come, Follow Me: 2026, Introduction). Understanding that Abraham, Sarah, and others lived in a world of nomadic tribes, polytheistic beliefs, and harsh survival challenges creates “aha moments” when we see their faith in Jehovah amidst such conditions. Their covenant-making, as in Exodus 19:5, parallels our modern discipleship as we strive to be a “peculiar treasure” through obedience in a secular world. This cultural backdrop helps us appreciate the radical nature of their trust in one true God and mirrors our call to stand apart today.\n\n### Contradiction Resolution\nOne apparent contradiction arises in understanding Jesus Christ as Jehovah while also recognizing the Father’s role. The Come, Follow Me manual clarifies this through President Oaks’ teaching: “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him’” (Liahona, May 2023, 102). Thus, when “God” or “Lord” speaks in the Old Testament, it is typically Jehovah—Christ—acting under the Father’s direction. This resolves any confusion by affirming distinct roles within the Godhead while maintaining unity of purpose, a profound theological truth of divine harmony.\n\n### Seminary Synthesis: Pattern Discovery for Adults\nDrawing from the Come, Follow Me manual’s emphasis on symbols of Christ, teachers can adapt lessons for adults by focusing on pattern discovery. For instance, explore how manna (Exodus 16:4) as a type of Christ (John 6:35) reflects the pattern of spiritual sustenance across dispensations—God provides daily bread, whether in the wilderness or through the sacrament. Encourage learners to map these patterns in their journals, noting how symbols like the brass serpent (Numbers 21:4–10) teach reliance on Christ for healing, a principle as relevant now as then. This synthesis elevates study from mere reading to active pattern recognition.\n\n### Teaching Applications: Escalating Stakes\nThese multi-level discussion questions build from understanding to transformation to testimony:\n1. **Understanding**: How do symbols like manna or the sacrificial lamb in the Old Testament help you recognize Jesus Christ? (Exodus 16:4; John 6:35)\n2. **Transformation**: In what ways can focusing on Christ as Jehovah change how you approach challenges, knowing He has always been the Savior? (Exodus 3:14; John 8:58)\n3. **Testimony**: How has studying restored truths, such as Enoch’s vision in Moses 7:18–19, deepened your faith in God’s plan across time?\n\nThese questions escalate the stakes, inviting learners to internalize and witness the power of these ancient truths.\n\n### Modern Prophetic Convergence\nContemporary prophetic teachings mirror Old Testament revelations with striking precision. President Dallin H. Oaks affirms, “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102), directly connecting to Exodus 3:14. Elder Dale G. Renlund urges us to “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98), echoing the Old Testament’s symbols like the brass serpent (Numbers 21:4–10). President Russell M. Nelson’s teaching on “The Everlasting Covenant” highlights how ancient promises to Abraham persist in our temple covenants today, stating that they offer “a special kind of love and mercy” (Liahona, October 2022, 4–11). These modern voices confirm the timeless nature of Old Testament truths.\n\n### Testimony Development\nAs we uncover patterns like Christ’s role as Jehovah or the continuity of covenants from Exodus to the Book of Mormon, our conviction grows unshakeable. Recognizing that the same God who spoke to Moses speaks through President Nelson today binds us to the ancients in a shared story of redemption. This deep study reveals that every page of the Old Testament is a witness of Christ, lighting our path as it did for the psalmist (Psalm 119:105). I have felt the Spirit confirm these truths as I’ve studied, and I know that as we seek Him in these pages, we will find Him.\n\n### Additional Study\nFor further pattern exploration, I recommend:\n- “Jesus Christ Is the Treasure” by Elder Dale G. Renlund (Liahona, Nov. 2023, 98) to deepen your search for Christ in the Old Testament.\n- “The Everlasting Covenant” by President Russell M. Nelson (Liahona, October 2022, 4–11) for insights into covenant patterns.\n- Guide to the Scriptures entries on “Types or Symbols of Christ” and “Jesus Christ” in the Gospel Library for cross-reference discovery.\n\nMay this year of study in the Old Testament draw us closer to the Savior, Jehovah, who has guided His people from the beginning. Let us walk this path together, with His word as our lamp and His covenant as our strength.",
  "generated_timestamp": "2026-01-01 00:05:16",
  "source_week_file": "cfm_2026_week_01.json"
}