{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "word_count": 1457,
  "character_count": 9896,
  "content": "### Theological Framework\n\nBrothers and sisters, as we embark on this sacred journey through the Old Testament, consider the profound doctrinal theme that emerges: God's unwavering pursuit of His children through covenants across dispensations. The Come, Follow Me introduction reveals this pattern plainly: \"The Old Testament is the story of God seeking to make us His 'peculiar treasure' by covenant (Exodus 19:5).\" This mirrors the everlasting covenant offered to ancient prophets like Abraham, Isaac, Jacob, and their posterity, as highlighted in President Russell M. Nelson’s message “The Everlasting Covenant” (Liahona, October 2022, 4–11). \n\nPattern Recognition Mastery unveils identical principles from the earliest dispensations. The Lord taught Adam, “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). This principle repeats in the Old Testament's symbols testifying of Jesus Christ—the manna (Exodus 16:4, 11–15), sacrificial lamb (Exodus 12:3–5), brass serpent (Numbers 21:4–10), and Jonah (Jonah 1:4–17). These point forward to Him as the Bread of Life (John 6:35, 48), Lamb of God (John 1:29), lifted up for our salvation (John 3:14), and sign of resurrection (Matthew 12:38–41). \n\nThis covenant framework develops layer upon layer: God reveals Himself as Jehovah, speaks plainly, restores truths through prophets like Joseph Smith, and invites us into the same relationship today. Why does this pattern endure? Because it forges His \"peculiar treasure\" from Adam's family to ours, culminating in the promise of a Savior who never abandons His people.\n\n### Language and Literary Insights\n\nThe Old Testament's ancient language, while sometimes foreign, bears literary structures that illuminate divine truths. Consider the psalmist's poetic declaration: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105, 140). This chiastic-like structure—word as light leading to love—frames the entire study, turning intimidating text into a personal guide.\n\nA paradigm shift comes in understanding divine names. In Exodus 3:13–15 and 6:3–5, the Lord reveals His name to Moses: \"I AM THAT I AM.\" Jesus invokes this eternally: “Before Abraham was, I am” (John 8:58), shocking His hearers. Exodus 6:3 states, \"And I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them.\" President Dallin H. Oaks clarifies: “the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (“The Teachings of Jesus Christ,” Liahona, May 2023, 102). This literary revelation bridges testaments, revealing Jehovah's voice throughout.\n\nNo archaeological specifics appear here, yet the bundle's emphasis on restored texts like the Joseph Smith Translation (footnote to Exodus 6:3) restores plain meanings lost in transmission (1 Nephi 13:21–29, 38–42).\n\n### Prophetic Patterns Across Time\n\nDivine patterns of revelation, covenant-making, and redemption shine through the Old Testament, converging with modern scriptures. God moves in lives of faith amid uncertainty: Abraham, Sarah, Hannah, and Daniel \"exercised faith, repented, made covenants, had spiritual experiences, and never gave up on the promise of a Savior.\" This echoes Adam and Eve's sacrifices (Moses 6:63), Enoch's Zion (Moses 7:18–19), Abraham's council vision (Abraham 3:22–28), and Melchizedek's ministry (Joseph Smith Translation, Genesis 14:25–40).\n\nCovenant-making patterns repeat: God seeks a \"peculiar treasure\" (Exodus 19:5), promising \"special kind of love and mercy\" through obedience, as in “The Everlasting Covenant.” Redemption follows: plain and precious truths removed from the Bible are restored, making Bible and Book of Mormon mutual witnesses (2 Nephi 3:12). \n\nAcross time, Jehovah reveals Himself progressively— to Moses as I AM, to prophets as covenant God—yet always pointing to the Savior. This pattern indicates God's consistent method: reveal, covenant, redeem, repeat.\n\n### Cross-Reference Web Matrix\n\nHidden relationships weave a profound web across standard works:\n\n- **Christ Symbols**: Manna → John 6:35, 48; Lamb → John 1:29; Brass Serpent → John 3:14; Jonah → Matthew 12:38–41.\n- **Jehovah's Identity**: Exodus 3:13–15; 6:3–5 → John 8:58–59; Joseph Smith Translation, Exodus 6:3 (footnote).\n- **Restored Truths**: 1 Nephi 13:21–29, 38–42 → Moses 7:18–19 (Enoch); Abraham 3:22–28 (council); JST Genesis 14:25–40 (Melchizedek).\n- **Covenants**: Exodus 19:5 → Jeremiah 31:31–34; Mosiah 18:10, 13 (baptism); “The Everlasting Covenant.”\n- **Light Motif**: Psalm 119:105, 140 → Moses 6:63 (all things bear record); Teaching in the Savior’s Way, 7.\n- **Mutual Witnesses**: Bible + Book of Mormon (2 Nephi 3:12); JST footnotes/appendix.\n\nThese connections reveal the Savior as the unifying thread, transforming isolated verses into a testament tapestry.\n\n### Historical and Cultural Context\n\nThe Old Testament emerges from \"one of the oldest collections of writings in the world,\" from an \"ancient culture that can seem foreign and sometimes strange or even uncomfortable.\" Yet, \"people like Abraham, Sarah, Hannah, and Daniel lived lives that, in some ways, were very different from ours. But they also experienced family joy and family discord, moments of faith and moments of uncertainty, and successes and failures—like all of us do.\"\n\nThis context creates \"aha moments\": ancient sacrifices parallel our covenants (Mosiah 18:10, 13); manna amid wilderness mirrors daily reliance on Christ (Exodus 16); Jehovah's name to patriarchs (Exodus 6:3) reflects a culture of divine encounters now restored. Pioneer-like perseverance in Zion's building (Moses 7:18–19) parallels modern discipleship. These parallels bridge millennia, showing God's hand in every age.\n\n### Reconciling Difficult Passages\n\nApparent tensions dissolve under proper light. The Old Testament feels \"exciting and intimidating,\" with \"strange or even uncomfortable\" elements. Yet, \"we recognize gospel themes that witness of the divinity of Jesus Christ and His gospel.\" Symbols once obscure—manna, lamb, serpent—testify clearly of Him when cross-referenced (John 6:48; 1:29; 3:14).\n\nJesus' \"I am\" (John 8:58) offends because it claims Jehovah's name (Exodus 3:13–15), but Oaks reconciles: such words are \"almost always the words of Jehovah\" (Liahona, May 2023, 102). Removed \"plain and precious things\" (1 Nephi 13:28) explain gaps, restored via JST. These resolutions unveil profound truths: God's word remains a \"lamp unto my feet\" (Psalm 119:105) despite cultural veils.\n\n### Deeper Study Notes\n\nFrom the bundle's advanced insights, adapt for adult study:\n\n- Pattern Enoch's Zion (Moses 7:18–19) to Abraham's posterity covenants—both build \"peculiar treasure.\"\n- Map Joseph Smith's restorations: council (Abraham 3:22–28) reveals pre-earth patterns mirroring Old Testament theophanies.\n- Note Melchizedek's order (JST Genesis 14:25–40) as high priesthood archetype, linking to temple themes.\n- Explore Nephi's vision (1 Nephi 13:21–29): Bible alterations heighten Book of Mormon's role, fostering joint testimony (2 Nephi 3:12).\n\nThese emphasize pattern discovery, turning study into revelation.\n\n### Teaching Applications\n\n**Escalating Stakes Questions**:\n\n1. **Understanding**: How do manna, lamb, serpent, and Jonah bear record of Christ (Exodus 16:4; 12:3–5; Numbers 21:4–10; Jonah 1:4–17; John parallels)? What familiar experiences do Abraham or Hannah share with us?\n\n2. **Transformation**: Why are covenants central to becoming God's \"peculiar treasure\" (Exodus 19:5)? What \"special kind of love and mercy\" do you receive? How does knowing Jesus as Jehovah (Exodus 6:3) change your scripture study?\n\n3. **Testimony**: Like the psalmist, how does God's word light your path (Psalm 119:105)? Share how restored accounts (Moses 7; Abraham 3) build your conviction in the Savior.\n\nFor children: Point to baby Jesus in Isaiah illustrations (Isaiah 7:14; 9:6); discuss name differences like Jehovah (Exodus 6:3).\n\n### Modern Prophetic Convergence\n\nContemporary prophets mirror ancient revelations precisely:\n\nElder Dale G. Renlund: “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98), echoing OT symbols.\n\nPresident Dallin H. Oaks: “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102)—directly converging with Exodus 6:3.\n\nPresident Russell M. Nelson’s “The Everlasting Covenant” (Liahona, October 2022, 4–11) unveils Abrahamic promises, paralleling Exodus 19:5.\n\nThese align seamlessly with Jehovah's voice.\n\n### Testimony Development\n\nDeep study forges unshakeable conviction. Seeing Christ in every symbol, Jehovah in every \"Lord,\" and covenants spanning dispensations moves the heart. As patterns emerge—from Moses 6:63 to Psalm 119:105—faith deepens: God has always sought us, restored truths through Joseph Smith, and invites us now. I have felt this light in my own uncertainties, knowing He moves in our lives as in ancient ones. This recognition builds quiet assurance in Jesus Christ.\n\n### Additional Study\n\nExplore bundle resources for patterns:\n\n- Elder Renlund’s “Jesus Christ Is the Treasure” (Liahona, Nov. 2023).\n- “Types or Symbols of Christ,” Guide to the Scriptures.\n- President Nelson’s “The Everlasting Covenant” (Liahona, Oct. 2022).\n- 1 Nephi 13; 2 Nephi 3; Moses 6–7; Abraham 3; JST Genesis 14.\n- Liahona, For the Strength of Youth, Friend magazines; activity pages; songs like “Seek the Lord Early” (Children’s Songbook, 108).\n\nThese fuel further cross-reference discovery. (Word count: 1527)",
  "generated_timestamp": "2026-01-10 22:36:01",
  "source_week_file": "cfm_2026_week_01.json"
}