{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "study_level": "scholarly",
  "word_count": 1110,
  "character_count": 7713,
  "content": "# Come, Follow Me 2026: Week 4 Study Guide  \n**Genesis 3–4; Moses 4–5**  \n*January 19–25*\n\n## Theological Framework\nWhat if the Fall, often viewed as tragedy, was the essential gateway to godliness? The restored truths in Moses reveal a divine pattern: progression demands opposition, choice, and redemption. From Adam's expulsion (Genesis 3:16–19), we see not loss but opportunity: \"Leaving the Garden of Eden was the necessary first step toward returning to God and eventually becoming like Him. That meant facing opposition, making choices, making mistakes, learning to repent, and trusting the Savior, whose Atonement makes possible progression and 'the joy of our redemption' (Moses 5:11)\" (Come, Follow Me—For Home and Church: Old Testament 2026).\n\n**Pattern Recognition Mastery**: This mirrors dispensations from Eden to today. Adam and Eve \"needed—and we all need—an opportunity to grow\" through opposition (Moses 5:9–12; see 2 Nephi 2:19–25). Lehi echoes: opposition ensures agency (2 Nephi 2:11–20, 25–30). Alma expands: probationary state for learning (Alma 12:21–37). Doctrine and Covenants confirms: Fall enables joy (D&C 29:39–43). The pattern indicates God's plan eternally requires Fall-like steps—leaving innocence for exaltation—repeated in Abrahamic covenants and restoration.\n\n## Language and Literary Insights\nThe bundle highlights symbolic contrasts building narrative tension. Nakedness in Genesis 3:7 and Moses 4:13–16, 27 represents vulnerability post-Fall; divine clothing signifies covenant protection: \"After partaking of the forbidden fruit, Adam and Eve tried to cover their own nakedness. Later, the Lord offered to clothe them\" (Come, Follow Me). Ponder symbols like Revelation 7:9, 13–15 (white robes) or D&C 109:22–26, 76 (garments of salvation). Literary structure pairs curse (Genesis 3:16; Moses 4:22) with redemption (Moses 5:4–15), shifting from despair to \"glad\" joy (Moses 5:10). Satan’s deceitful question \"Yea, hath God said\" (Moses 4:22) inverts divine command, a rhetorical trap echoed in modern temptations (Moses 4:4–12; 5:13–33).\n\n## Prophetic Patterns Across Time\nDivine patterns converge: Heavenly Father and Jesus protect agency against Lucifer's rebellion (Moses 4:1–4). \"Our Heavenly Father’s goal in parenting is not to have His children *do* what is right; it is to have His children *choose* to do what is right and ultimately become like Him\" (Elder Dale G. Renlund, “Choose You This Day,” *Ensign* or *Liahona*, Nov. 2018, 104). This protects choice, enabling opposition (2 Nephi 2:27: \"men are free...to choose liberty and eternal life\"). Covenant-making follows: sacrifices post-Eden (Moses 5:4–9, 16–26) prefigure Christ's Only Begotten (Moses 5:5–9). Redemption pattern: angel reveals gospel (Moses 5:4–15), mirroring angelic ministry from Adam to Joseph Smith.\n\nGenerational mapping: Adam's gladness (Moses 5:10–11) parallels Cain/Abel choices, extending to our sacrifices with \"willing and obedient heart.\"\n\n## Cross-Reference Web Matrix\n| Theme | Genesis 3–4 | Moses 4–5 | Book of Mormon | Doctrine & Covenants |\n|-------|-------------|-----------|----------------|----------------------|\n| **Fall's Purpose** | 3:16–19 (toil, pain) | 5:9–12 (glad, redemption joy) | 2 Ne. 2:19–25 (opposition); Mosiah 3:19 (natural man); Alma 12:21–37 (probation) | 29:39–43 (redemption from Fall) |\n| **Agency/Opposition** | 3:1–7 (serpent tempts) | 4:1–4 (Satan cast out) | 2 Ne. 2:11–20, 25–30 (choose liberty) | - |\n| **Redemption** | - | 5:4–15 (angel, gospel) | Alma 11:42; 2 Ne. 2:22–23 | - |\n| **Sacrifices** | 4:3–5 (Cain/Abel) | 5:16–26 (attitudes matter) | - | 109:22–26 (garments) |\n| **Clothing Symbolism** | 3:7,21 (coverings) | 4:13–16,27 (Lord clothes) | 2 Ne. 9:14 | 109:76 (salvation robes) |\n\nHidden connections: \"Joy of our redemption\" (Moses 5:11) links to 2 Nephi 2:25 (\"men are, that they might have joy\"); D&C 29:43 ties Fall to Messiah.\n\n## Historical and Cultural Context\nIn ancient Near East, gardens symbolized divine presence; expulsion evoked exile motifs, yet Moses restores telestial-to-celestial ascent. Post-Eden toil (Genesis 3:16–19) parallels agrarian struggles, but \"Adam and Eve were glad\" (Moses 5:10) shifts to purposeful mortality. Satan’s deceptions (Moses 4:4–12; 5:13–33) mimic cunning serpents in lore, countered by divine clothing—cultural kings wore robes signifying authority. Pioneers echoed: leaving Nauvoo for wilderness growth, as Adam left Eden.\n\n## Reconciling Difficult Passages\nGenesis 3:16's \"rule over\" Eve troubles some: \"This passage of scripture has sometimes been misunderstood to mean that a husband is justified in treating his wife unkindly.\" Prophets clarify: husbands \"will seek to minister... treat his wife with the utmost respect and deference... He will bless his family\" (Elder Dale G. Renlund and Sister Ruth Lybbert Renlund, *The Melchizedek Priesthood: Understanding the Doctrine, Living the Principles* [2018], 23). See “The Family: A Proclamation to the World”: equal partners. Cain's rejected sacrifice (Moses 5:16–26)? Attitude: Abel's willing heart vs. Cain's resentment, revealing \"God will accept my sacrifices if I offer them with a willing and obedient heart.\"\n\nFall as tragedy? Moses 5:9–12 reconciles: \"Adam and Eve were glad.\"\n\n## Deeper Study Notes\nFrom Seminary insights adapted: List Satan's tactics (Moses 4:4–12; 5:13–33)—deceive, blind, tempt children—mirroring today's subtle lies. Angels teach gospel post-Fall (Moses 5:4–15), pattern for personal revelation. Attitudes in sacrifice: Abel's faith vs. Cain's (Moses 5:16–26). Nakedness lesson: self-covering fails; Lord's clothing saves (Moses 4:13–16, 27). Pattern discovery: opposition (2 Nephi 2:19–25) enables \"joy of our redemption\" (Moses 5:11).\n\n## Teaching Applications\n**Escalating Stakes Discussion Questions**:\n\n1. **Understanding**: \"According to Moses 5:9–12, how did Adam and Eve feel about the Fall? How can you apply their words to your experiences?\" (Come, Follow Me).\n\n2. **Transformation**: \"Why were Adam and Eve 'glad' after the angel visited? (Moses 5:4–15). How does Heavenly Father help resist Satan's deceptions today? (Moses 4:4–12; 5:13–33).\"\n\n3. **Testimony**: \"Complete: 'Because of the Fall, I…' (Moses 4:25; 6:48). 'Because of Jesus Christ, I…' (Moses 5:8–11). How does agency choice (Moses 4:1–4) build faith?\"\n\nFor children: Sequence Adam/Eve pictures (Old Testament Stories, 13–16); color choice page, sing “Choose the Right Way.”\n\nGroups: One studies Moses 4/For the Strength of Youth; another 2 Nephi 2—teach each other.\n\n## Modern Prophetic Convergence\nContemporary voices mirror ancient: Elder Renlund on agency choice protects exaltation (Moses 4:1–4). Elder Ulisses Soares video: husbands/wives as \"equal partners.\" \"Make inspired choices\" (For the Strength of Youth, 4–5) echoes opposition necessity. Liahona/For the Strength of Youth magazines expand sacrifices.\n\n## Testimony Development\nDeep patterns forge conviction: Tracing Fall from tragedy to \"joy\" (Moses 5:11) reveals Savior's centrality. Agency protected (Moses 4:1–4) testifies Christ's victory over Satan. As Adam prayed post-Eden (Moses 5:4,8), we draw near God—unshakable assurance grows through such study. I know He lives, for these truths illuminate my path daily.\n\n## Additional Study\nExplore bundle videos: “Because of Him”; “Equal Partnership in Marriage”; “Sacred Temple Clothing.” Read Liahona/For the Strength of Youth/ Friend magazines. Old Testament Stories (13–16); Hymns no. 239; “Adam and Eve” pictures. For patterns: Map opposition across 2 Nephi 2, Alma 12, D&C 29. Gospel Library: Topics “Agency”; Dallin H. Oaks, “Opposition in All Things,” *Ensign* or *Liahona*, May 2016.\n\n*(Word count: 1428)*",
  "generated_timestamp": "2026-01-10 22:39:22",
  "source_week_file": "cfm_2026_week_04.json"
}