{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "study_level": "connected",
  "word_count": 1028,
  "character_count": 7194,
  "content": "# Come, Follow Me 2026: Week 3 – Genesis 1–2; Moses 2–3; Abraham 4–5\n\n## Doctrinal Foundation\nThe Creation accounts in Genesis 1–2, Moses 2–3, and Abraham 4–5 reveal layers of divine purpose through multiple perspectives. From God's view, the earth begins “without form, and void” and “empty and desolate” (Genesis 1:2; Abraham 4:2), yet “By mine Only Begotten I created these things” (as emphasized in the lesson). From Moses' view in the Pearl of Great Price, the process unfolds with precise divine council involvement. From the Abrahamic perspective, Gods organize the heavens and earth in a collaborative pattern. These views converge on core principles: Heavenly Father and Jesus Christ as Creators transform chaos into magnificence, inviting humanity to participate in that divine work. Being created in God's “image” and “likeness,” male and female (Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27), carries stewardship over creations (Genesis 1:28; Moses 2:28; Abraham 4:28) and honors marriage and the Sabbath.\n\nWhy three accounts? What hidden council operates in Abraham 4–5? How does “image” resolve self-doubt? These mysteries unfold as patterns of exaltation emerge.\n\n## Scripture Deep Dive\nAscend through six key passages, each step revealing escalating connections.\n\n**Step 1: Initial Chaos (Genesis 1:1–2; Moses 2:1–2; Abraham 4:1–2).** The earth is “without form, and void” (Genesis 1:2; Abraham 4:2). This sets the mystery: How does unorganized matter become “magnificent”?\n\n**Step 2: Divine Organization (Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25).** “By mine Only Begotten I created these things.” Gods command light, firmament, and life in sequence, resolving chaos through deliberate acts.\n\n**Step 3: Human Divinity (Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27).** “God said, Let us make man in our image, after our likeness.” This elevates humanity above creations, countering the notion that divine image excuses flaws—see Mosiah 3:19 and Ether 12:27 for improvement through Christ.\n\n**Step 4: Covenantal Union (Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18).** “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87). Marriage, ordained male and female, fulfills “be fruitful, and multiply.”\n\n**Step 5: Stewardship Charge (Genesis 1:28; Moses 2:28; Abraham 4:28).** Dominion over earth suggests care, deepened by Doctrine and Covenants 59:16–21 and 104:13–18.\n\n**Step 6: Sacred Rest (Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3).** God “rested the seventh day” and “sanctified it.” This crowns creation with holy rhythm.\n\nThese steps transform understanding: Patterns in Moses parallel Alma's faith growth and Joseph Smith's revelations on stewardship.\n\n## Historical Context\nIn an ancient world of polytheistic creation myths, these accounts collapse time by emphasizing one God—or Gods in council—organizing existing matter. The earth starts “empty and desolate” (Abraham 4:2), evoking Near Eastern voids, yet divine command brings order. Garden imagery (Genesis 2:18–25; Moses 3:18, 21–24) reflects Edenic paradise, as depicted in “The Garden of Eden” by Grant Romney Clawson. Pioneer parallels emerge: Just as unformed earth became habitable, Saints turned deserts into gardens, aligning past organization with modern restoration.\n\n## Pattern Recognition Web\nCreation's sequential days echo across dispensations. Genesis 1:1–25's periods mirror Doctrine and Covenants 101:32–34's preparatory states. Image of God (Genesis 1:26–27) connects to 1 Corinthians 11:11's marital equality and “The Family: A Proclamation to the World.” Stewardship (Genesis 1:28) webs to Doctrine and Covenants 104:13–18's inheritances. Sabbath sanctification (Genesis 2:2–3) patterns Doctrine and Covenants 59:9–13 and 59:16–21. Abraham 4–5's “Gods” foreshadows temple councils, linking to Moses' visions. This web spans Moses to modern prophets, revealing prophetic patterns of organization.\n\n## Discussion Framework\n1. What most people miss: Why three Creation accounts—Genesis, Moses, Abraham?\n2. From chaos “without form, and void” (Genesis 1:2), what transforms emptiness?\n3. How does “Let us make man in our image” (Genesis 1:26) differ from animal likenesses?\n4. Resolve: Some claim divine image means no need for change—what does Mosiah 3:19 clarify?\n5. In what ways does marriage in Genesis 2:18–25 echo eternal priesthood unions?\n6. How does Genesis 1:28's dominion imply care, per Doctrine and Covenants 59:16–21?\n7. Why sanctify the seventh day amid perfect creation (Genesis 2:2–3)?\n8. Connect to now: How do these patterns appear in Doctrine and Covenants 101:32–34?\n9. Apparent conflict: Rest after six days—laziness or holiness?\n10. Profound application: How does knowing “By mine Only Begotten” reshape daily creativity?\n\n## Gospel Connections\nPrinciples anchor the Plan of Salvation. Creation's organization parallels premortal council, prefiguring mortal probation. Image of God (Genesis 1:26–27) affirms divine potential, linking to spirit birth and exaltation. Marriage (Genesis 2:18–25) eternalizes family units. Stewardship (Genesis 1:28) ties to accountability in judgment. Sabbath (Genesis 2:2–3) foreshadows millennial rest. These surprise with Moses 2–3's detailed council, mirroring Abraham 4–5's Gods, connecting to postmortal glory.\n\n## Teaching Moments\n1. **Nature Hunt:** Search outdoors for Creation-day items (Genesis 1:1–25), singing “My Heavenly Father Loves Me” (Children’s Songbook, 228–29) for “aha” on Christ's handiwork.\n2. **Mirror Image:** Read Moses 2:26–27 while viewing reflections; assemble body puzzles to honor sacredness, resolving self-image mysteries.\n3. **Sabbath Role-Play:** Draw Sunday activities from Genesis 2:2–3; practice explaining to friends, creating family “time collapse” with Doctrine and Covenants 59:9–13.\n4. **Stewardship Share:** Discuss Genesis 1:28 with pictures, linking to “All Creatures of Our God and King” (Hymns, no. 62) for reverence.\n\n## Personal Reflection\n- When has personal chaos mirrored “without form, and void” (Genesis 1:2)—how did divine light emerge?\n- In what moments does knowing the image of God (Genesis 1:26–27) shift self-view?\n- Trace stewardship patterns: How has caring for creations echoed Genesis 1:28 in daily choices?\n- What makes the Sabbath “blessed” (Genesis 2:2–3) amid weekly patterns?\n\n## Prophetic Echoes\nModern teachings mirror ancient revelations strikingly. “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87) echoes Genesis 2:18–25's union. Video “God’s Greatest Creation” (Gospel Library) parallels Genesis 1:26–27's body as “miraculous.” See also Russell M. Nelson, “Your Body: A Magnificent Gift to Cherish,” Liahona, Aug. 2019, 50–55. “The Sabbath Is a Delight” (video) reflects Genesis 2:2–3's sanctification. These align chaos-to-magnificence with personal transformation.\n\nThese Creation patterns invite all to witness divine organization in personal emptiness turned to exaltation.",
  "generated_timestamp": "2026-01-18 19:30:46",
  "source_week_file": "cfm_2026_week_03.json"
}