{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "word_count": 833,
  "character_count": 4977,
  "content": "# Come, Follow Me Study Guide: Week 1 - December 29–January 4  \n## Introduction to the Old Testament\n\n### Week Overview  \nWhat if the oldest book in the world could reveal the Savior in ways you’ve never seen before? As we begin our journey through the Old Testament, we’re invited to discover Jesus Christ—Jehovah Himself—in ancient symbols, stories, and covenants. This week sets the tone for a year of finding Him in unexpected places and seeing how His gospel weaves through every page (see John 6:35).\n\n### Key Scripture Moments  \nHere are pivotal verses that set the stage for our study. Notice how they point to Christ and connect across time:  \n1. **Psalm 119:105** - “Thy word is a lamp unto my feet, and a light unto my path.” Here’s the remarkable moment when the psalmist testifies that God’s word guides us, much like Christ is our light today (John 8:12).  \n2. **Exodus 3:14** - “And God said unto Moses, I AM THAT I AM: and he said, Thus shalt thou say unto the children of Israel, I AM hath sent me unto you.” Notice what happens next: Jesus echoes this very name in John 8:58, declaring, “Before Abraham was, I am,” revealing Himself as Jehovah.  \n3. **Exodus 19:5** - “Now therefore, if ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people.” This covenant promise mirrors the invitations of later prophets like Nephi (2 Nephi 31:13) and Joseph Smith, showing God’s unchanging desire to claim us as His own.  \n4. **Moses 6:63** - “And behold, all things have their likeness, and all things are created and made to bear record of me.” This becomes powerful when we see how everything in the Old Testament—from manna to the brass serpent—points to Christ.\n\n### Hidden Connections  \n- **Manna and Christ**: Exodus 16:4 speaks of manna from heaven, which Jesus directly connects to Himself in John 6:35, saying, “I am the bread of life: he that cometh to me shall never hunger.” This ancient provision solves our modern spiritual hunger.  \n- **Brass Serpent as Atonement**: In Numbers 21:9, looking to the serpent brought healing, just as looking to Christ in faith heals us today (John 3:14). This pattern shows how ancient symbols address our need for redemption now.  \n- **Jonah and Resurrection**: Jonah’s three days in the whale (Jonah 1:17) prefigures Christ’s three days in the tomb (Matthew 12:40), linking an obscure story to the greatest event in history.\n\n### Pattern Discovery  \nNotice this pattern: God consistently uses symbols—manna, lambs, serpents—to teach of Christ across centuries. This echoes in Nephi’s vision of “plain and precious things” restored (1 Nephi 13:29) and Joseph Smith’s translations like Moses 7:18–19, where Enoch’s Zion points to Christ’s ultimate kingdom. The Old Testament isn’t just history; it’s a testimony of Jesus repeating through time.\n\n### Simple Questions  \n1. How does seeing Jesus as Jehovah (Exodus 3:14) change the way you read Old Testament stories of “the Lord”?  \n2. What symbols of Christ (like manna or the brass serpent) stand out to you, and why?  \n3. How do covenants in Exodus 19:5 connect to promises you’ve made with God today?  \n4. Why do you think God uses so many “likenesses” (Moses 6:63) to teach about Jesus?  \n5. What “plain and precious things” from Joseph Smith’s translations (like Abraham 3:22–28) deepen your understanding of God’s plan?  \n6. How can looking for Christ in the Old Testament light your path this year (Psalm 119:105)?\n\n### One Big Idea  \n**Jesus Christ is Jehovah, the central figure of the Old Testament.** Historically, ancient Israel knew God as Jehovah, but through modern revelation, we understand this is Jesus Christ before His mortal birth (see John 8:58; Exodus 3:14). As President Dallin H. Oaks taught, “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). This truth transforms every interaction with “the Lord” into a direct encounter with the Savior.\n\n### Living It  \n1. **Seek Christ Daily**: As you read the Old Testament, pause to find symbols of Jesus, like manna or the lamb, and journal how they strengthen your faith.  \n2. **Honor Covenants**: Reflect on Exodus 19:5 and consider one way to better keep your covenants this week, knowing you are God’s “peculiar treasure.”  \n3. **Teach Children**: Use Isaiah 7:14 with your family to show how prophets foresaw Jesus, making the Old Testament a shared discovery.\n\n### Faith Builder  \nElder Dale G. Renlund’s words echo this week’s focus: “Remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98). His invitation to center on the Savior aligns perfectly with the Old Testament’s purpose—to bear record of Him (Moses 6:63). As we embark on this study, I feel a quiet joy knowing that every page can draw us closer to Jesus, the Jehovah who has always sought to redeem and guide His people. Let’s treasure this journey together.",
  "generated_timestamp": "2025-12-31 23:37:12",
  "source_week_file": "cfm_2026_week_01.json"
}