{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "study_level": "connected",
  "word_count": 1050,
  "character_count": 7158,
  "content": "# Come, Follow Me 2026: Week 4 (January 19–25)  \n**Genesis 3–4; Moses 4–5**  \n*The Fall: From Paradise Lost to Eternal Possibilities*\n\n## Doctrinal Foundation\nFrom the perspective of Genesis 3:16–19, the Fall appears as a descent into pain, sorrow, death, and separation from Heavenly Father. Yet Moses restores a vital layer: Adam and Eve required more than beautiful surroundings—they needed opportunity to grow (see Come, Follow Me introduction). From God's view, leaving Eden marked the \"necessary first step toward returning to God and eventually becoming like Him,\" involving opposition, choices, mistakes, repentance, and trust in the Savior's Atonement for \"the joy of our redemption\" (Moses 5:11). From Adam and Eve's view, post-Fall gladness emerges in Moses 5:9–12, where they rejoice, saying, \"we know nothing about God; nevertheless long will we seek until we shall find him.\" This reveals layers: the Fall enables agency, as Elder Dale G. Renlund taught, “Our Heavenly Father’s goal in parenting is not to have His children do what is right; it is to have His children choose to do what is right and ultimately become like Him” (“Choose You This Day,” Ensign or Liahona, Nov. 2018, 104). A mystery arises: Why celebrate a \"tragedy\"? Resolution lies in opposition's role (2 Nephi 2:19–25), transforming loss into progression.\n\nAnother puzzle: Does Genesis 3:16 justify dominance? Prophets clarify equality (see “The Family: A Proclamation to the World”). Elder Dale G. Renlund and Sister Ruth Lybbert Renlund describe a righteous husband who “will seek to minister; he will acknowledge error and seek forgiveness; he will be quick to offer praise; he will be considerate of family members’ preferences; he will feel the great weight of responsibility to provide ‘the necessities of life and protection’ for his family; he will treat his wife with the utmost respect and deference. … He will bless his family” (The Melchizedek Priesthood: Understanding the Doctrine, Living the Principles [2018], 23).\n\n## Scripture Deep Dive\nAscend through six passages, each step unveiling deeper connections.\n\n**Step 1: Temptation's Deception (Moses 4:1–4)**. Satan seeks to destroy agency; Heavenly Father and Jesus protect choice. Pattern echoes in Lehi's words (2 Nephi 2:11–20, 25–30): opposition enables \"free to choose\" (2 Nephi 2:27).\n\n**Step 2: Fall's Immediate Effects (Genesis 3:1–7; Moses 4:22–31)**. Shame and coverings symbolize spiritual nakedness. God intervenes: “I, the Lord God … clothed them” (Moses 4:13–16, 27), pointing to redemption (see Revelation 7:9, 13–15; 2 Nephi 9:14; Doctrine and Covenants 109:22–26, 76).\n\n**Step 3: Post-Fall Awakening (Moses 5:4–15)**. Adam and Eve pray, angels teach gospel; they are \"glad\" (Moses 5:11). Mystery of joy resolves: Fall opens redemption's door.\n\n**Step 4: Sacrifice's Heart (Moses 5:4–9, 16–26)**. Abel's willing offering accepted; Cain's not, due to attitude. Links to Mosaic law's similitude (Moses 5:5–9).\n\n**Step 5: Satan's Ongoing Blindings (Moses 4:4–12; 5:13–33)**. Cain murders; Satan blinds. Modern parallel: listing temptations reveals resistance through God's help.\n\n**Step 6: Redemption's Joy (Moses 5:9–12)**. Adam and Eve's quest—\"long will we seek\"—transforms Fall into growth, cross-connecting to Alma 12:21–37; Doctrine and Covenants 29:39–43.\n\nArchaeological insight: Ancient Near Eastern motifs of gardens and serpents underscore opposition's universality, but Moses elevates to divine plan.\n\n## Historical Context\nIn the ancient world, Eden evoked paradisiacal origins amid Mesopotamian chaos myths. Bundle sources collapse time: Adam and Eve's expulsion mirrors pioneer treks from Nauvoo, facing opposition yet finding redemption (see Saints vol. 2, ch. 12—wait, no, bundle lacks Saints vol. 2 quote; align via pattern). Post-Fall, sacrifices in \"similitude of the sacrifice of the Only Begotten\" (Moses 5:5–9, as in Mike Malm artwork) prefigure temple worship, creating \"time collapse\" where ancient altars link to modern covenants. Nakedness motifs in ancient texts (e.g., Gilgamesh epics) highlight vulnerability, but God's clothing (Moses 4:27) reveals merciful restoration.\n\n## Pattern Recognition Web\nThis week's web spans dispensations: Fall's opposition in Moses 4 parallels Lehi (2 Nephi 2:19–25; 11–20), natural man (Mosiah 3:19), probation (Alma 12:21–37), earth's Fall (Doctrine and Covenants 29:39–43). Satan's deceptions (Moses 5:13–33) echo today's temptations. Agency protection (Moses 4:1–4) threads to \"Choose the Right\" (Hymns, no. 239). Generational link: Adam's sacrifices foreshadow pioneer obedience amid expulsion-like trials.\n\n## Discussion Framework\n1. What most people miss: Why focus on \"possibilities\" over \"paradise lost\" (Come, Follow Me introduction)?  \n2. From Genesis 3:1–7, list Fall's results—how do they affect daily life?  \n3. Why were Adam and Eve \"glad\" (Moses 5:4–15)?  \n4. How does opposition enable agency (2 Nephi 2:19–25)?  \n5. In what ways does Satan \"deceive and blind\" today (Moses 4:4–12; 5:13–33)?  \n6. What do nakedness and clothing symbolize (Moses 4:13–16, 27)?  \n7. Why accept Abel's sacrifice over Cain's (Moses 5:16–26)?  \n8. How does \"rule over\" mean equal partnership (Genesis 3:16; Renlund quote)?  \n9. Complete: \"Because of the Fall, I … Because of Jesus Christ, I …\" (Moses 4:25; 5:8–11).  \n10. How can choices honor agency protectors (Moses 4:1–4; For the Strength of Youth)?\n\n## Gospel Connections\nFall principles anchor Plan of Salvation: Mortality's opposition (Moses 5:9–12) enables progression toward exaltation. Parallels surprise: Adam's prayer post-Eden (Moses 5:4, 8) mirrors premortal council (Moses 4:1–4); redemption (Moses 5:11) links to resurrection (Alma 11:42; Romans 5:12; 2 Nephi 2:22–23). \"Because of Him\" video ties Fall to Atonement's victory.\n\n## Teaching Moments\n1. Sequence Adam and Eve pictures (Old Testament Stories, 13–16); discuss why leaving Eden was \"important, in Heavenly Father’s plan.\"  \n2. Object lesson: One-color drawing (agency page)—then Moses 4:1–4; sing “Choose the Right Way” (Children’s Songbook, 160–61).  \n3. List Satan's tactics (Moses 5:13–33); share God's helps for \"aha\" resistance.  \n4. Sentence stems: \"Because of the Fall, I … Because of Jesus Christ, I …\" (Moses 5:8–11)—spark gratitude.\n\n## Personal Reflection\n- When has opposition led to growth, like Adam and Eve's quest (Moses 5:9–12)?  \n- What sacrifices require a \"willing and obedient heart\" (Moses 5:16–26)?  \n- How can daily choices honor agency (Moses 4:1–4; 2 Nephi 2:27)?  \n- In facing deceptions, where has God's clothing of protection appeared (Moses 4:27)?\n\n## Prophetic Echoes\nModern voices mirror ancient: Renlund's agency emphasis echoes Moses 4:1–4's divine safeguard. Renlunds' marital counsel resolves Genesis 3:16 misreadings, paralleling God's post-Fall mercy. \"Make inspired choices\" (For the Strength of Youth, 4–5) reflects Eve's gladness (Moses 5:11). Videos like “Equal Partnership in Marriage” and “Sacred Temple Clothing” echo clothing symbolism (Moses 4:13–16).\n\nThese restored truths on the Fall invite recognition of opposition as the path to redemption's joy (Moses 5:11).",
  "generated_timestamp": "2026-01-18 19:32:22",
  "source_week_file": "cfm_2026_week_04.json"
}