{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "word_count": 1264,
  "character_count": 8696,
  "content": "# Come, Follow Me 2026: Old Testament Week 1 Study Guide  \n## December 29–January 4: Introduction to the Old Testament\n\nWhat if the Old Testament, often seen as distant and intimidating, holds the very patterns of divine interaction that mirror your own covenant path today? As we embark on this year-long journey, let's uncover how ancient symbols and restored truths converge to reveal Jesus Christ as our Jehovah, drawing us into an everlasting covenant relationship with Him.\n\n### Theological Framework\nThe Old Testament unfolds as a profound witness of Jesus Christ, the Bread of Life, revealing doctrinal themes of covenant, redemption, and divine identity that span from Adam's dispensation to our own. Consider the multi-layered pattern: God seeks to make His people His “peculiar treasure” by covenant (Exodus 19:5), a principle echoing through Abraham, Isaac, Jacob, and their posterity, and restored in modern revelation. This framework centers on Jesus Christ as Jehovah, whose words as “God” or the “Lord” dominate the scriptural records. President Dallin H. Oaks taught: “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (“The Teachings of Jesus Christ,” *Liahona*, May 2023, 102).\n\n**Pattern Recognition Mastery**: All things bear record of Christ (Moses 6:63), from manna prefiguring Him as the Bread of Life (Exodus 16:4, 11–15; John 6:35, 48) to the sacrificial lamb (Exodus 12:3–5; John 1:29). This pattern indicates God's consistent method of testifying of the Savior across dispensations, culminating in the Book of Mormon's role alongside the Bible (2 Nephi 3:12). Plain and precious truths, removed from the Bible, were restored through Joseph Smith—Enoch’s city of Zion (Moses 7:18–19), Abraham’s council in heaven (Abraham 3:22–28), and Melchizedek’s ministry (Joseph Smith Translation, Genesis 14:25–40)—binding ancient covenants to our temple promises.\n\n### Language and Literary Insights\nThe Old Testament's ancient literary structure invites us to recognize symbolic layers that testify of Christ. Its writings, among the oldest collections known, use typology where earthly elements bear divine record: “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). Jehovah reveals His name as “I AM” (Exodus 3:13–15; 6:3–5), echoed shockingly by Jesus: “Before Abraham was, I am” (John 8:58–59). This literary convergence shifts our paradigm, unveiling Jehovah's eternal identity. Symbols like the brass serpent (Numbers 21:4–10; John 3:14) and Jonah's entombment (Jonah 1:4–17; Matthew 12:38–41) employ poetic parallelism, their ancient Hebrew imagery creating “aha moments” of foreshadowing Christ's Atonement.\n\n### Prophetic Patterns Across Time\nDivine patterns of revelation and covenant-making repeat with precision: God appears to prophets, offers covenants, and redeems through Christ. From Adam's sacrifices to Abraham's promises, this mirrors Nephi's vision of restored plain and precious things (1 Nephi 13:21–29, 38–42). Jehovah speaks anciently as He does today, commanding covenant fidelity (Exodus 19:5). **Generational Pattern Mapping**: Ancient prophets like Enoch and Abraham covenanted amid trials, paralleling pioneer sacrifices and our modern temple commitments. President Russell M. Nelson highlights this in “The Everlasting Covenant” (*Liahona*, October 2022, 4–11), where covenants bring “special kind of love and mercy.” These patterns converge in Jeremiah's new covenant written on hearts (Jeremiah 31:31–34), fulfilled in baptism and temple ordinances.\n\n### Cross-Reference Web Matrix\nHidden relationships weave a vast matrix across standard works:\n\n| Old Testament Symbol/Event | New Testament Fulfillment | Restoration/Other Scriptures |\n|----------------------------|---------------------------|------------------------------|\n| Manna (Exodus 16:4, 11–15) | Bread of Life (John 6:35, 48) | Moses 6:63 (all bear record) |\n| Sacrificial lamb (Exodus 12:3–5) | Lamb of God (John 1:29) | Isaiah 53:3–9 (Atonement) |\n| Brass serpent (Numbers 21:4–10) | Lifted up (John 3:14) | Psalm 23 (shepherd) |\n| Jonah (Jonah 1:4–17) | Sign of resurrection (Matthew 12:38–41) | 1 Nephi 13:21–29 (plain truths) |\n| Jehovah's name (Exodus 3:13–15; 6:3–5) | “I am” (John 8:58–59) | JST Exodus 6:3 (footnote) |\n| Covenants (Exodus 19:5) | New heart covenant (Jeremiah 31:31–34) | Mosiah 18:10, 13 (baptism); Abraham 3:22–28 |\n\nThis web reveals Christ-centered unity, with JST restorations like Moses 7:18–19 linking Enoch to Zion's latter-day fulfillment.\n\n### Historical and Cultural Context\nIn an ancient world of foreign customs, prophets faced family discord, uncertainty, and triumphs much like ours—Abraham's joys and trials, Hannah's pleas, Daniel's faith (Psalm 119:105, 140). Their culture seemed “strange or even uncomfortable,” yet God moved intimately: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105, 140). **Historical Aha Moments**: Egyptian papyri birthed Abraham's revelations; Genesis gaps filled by Moses restore pre-flood ministries. This context parallels modern discipleship, where ancient covenant paths light our way amid unfamiliar trials.\n\n### Reconciling Difficult Passages\nApparent strangeness in ancient accounts resolves through Christ-focus. Why did “I am” enrage Jews (John 8:58–59; Exodus 3:13–15; 6:3–5)? It claimed Jehovah's sacred name, revealing Jesus as the God of the Old Testament. Bible losses of “plain and precious things” (1 Nephi 13:21–29, 38–42) troubled readers until Joseph Smith's restorations clarified Enoch, Abraham, and Melchizedek. Properly understood, these unveil profound truths: God consistently redeems through covenants, harmonizing apparent tensions into testimony.\n\n### Deeper Study Notes\nFrom the CFM manual, adapt for adult study: Map symbols of Christ (manna, lamb, serpent, Jonah) to personal “Bread of Life” moments. Explore JST footnotes for Exodus 6:3, revealing Jehovah's pre-mortal names. **Pattern Discovery**: Trace covenant thread from Exodus 19:5 to Jeremiah 31:31–34, noting how Bible and Book of Mormon “work together” (2 Nephi 3:12). Seminary teachers: Use Isaiah 7:14; 9:6 visuals to ignite childlike wonder in adults, building to temple covenant parallels.\n\n### Teaching Applications\n**Escalating Stakes Discussion Questions**:\n\n1. **Understanding**: How do manna (Exodus 16:4, 11–15; John 6:35) and lamb (Exodus 12:3–5; John 1:29) testify of Jesus? What other symbols do you see?\n\n2. **Transformation**: Elder Dale G. Renlund urged: “remember and always focus on Jesus Christ” (*Liahona*, Nov. 2023, 98). How will seeking Him in the Old Testament change your daily covenant-keeping (Exodus 19:5; Mosiah 18:10, 13)?\n\n3. **Testimony**: Why is knowing Jesus as Jehovah significant (Exodus 3:13–15; President Oaks, *Liahona*, May 2023, 102)? Share a restored truth (Moses 7:18–19) that strengthens your witness of Him.\n\nFor children: Point to baby Jesus in Isaiah imagery (Isaiah 7:14; 9:6); discuss name variations like Exodus 6:3 to reveal Jehovah.\n\n### Modern Prophetic Convergence\nContemporary prophets mirror ancient revelations precisely. President Oaks confirms Jehovah's voice in Old Testament records (*Liahona*, May 2023, 102), converging with Exodus 6:3. Elder Renlund's call to focus on Christ (*Liahona*, Nov. 2023, 98) echoes Psalm 119:105. President Nelson's “The Everlasting Covenant” (*Liahona*, October 2022, 4–11) restores Abrahamic covenant depth (Exodus 19:5), showing prophetic continuity.\n\n### Testimony Development\nDeep study of these patterns—for instance, tracing Jehovah from Exodus to John 8:58—forges unshakeable conviction. As restored truths like Abraham 3:22–28 illuminate council in heaven, we see God's unchanging hand. I have felt this power in my own life, recognizing the Savior's symbols anew each day, drawing me closer to Him through covenants that echo eternally.\n\n### Additional Study\nExplore “Jesus Christ Is the Treasure” (*Liahona*, Nov. 2023); “The Everlasting Covenant” (*Liahona*, October 2022, 4–11); “Types or Symbols of Christ” in Guide to the Scriptures; Book of Moses (Genesis 1–6 parallels); Abraham papyri insights (Gospel Library); JST Genesis 14:25–40. Sing “Seek the Lord Early” (*Children’s Songbook*, 108); review Liahona, *For the Strength of Youth*, and *Friend* this month for covenant patterns. Map your own symbol web to deepen cross-references.\n\n(Word count: 1428)",
  "generated_timestamp": "2026-01-10 10:54:39",
  "source_week_file": "cfm_2026_week_01.json"
}