{
  "week_number": 5,
  "title": "Week 5: January 26–February 1 - Genesis 5; Moses 6",
  "date_range": "January 26–February 1",
  "study_level": "connected",
  "word_count": 1087,
  "character_count": 7460,
  "content": "# Come, Follow Me 2026: Week 5  \n**Genesis 5; Moses 6** *(January 26–February 1)*\n\n## Doctrinal Foundation\nGenesis 5 presents a genealogy from Adam to Noah, punctuated by the enigma: “And Enoch walked with God: and he was not; for God took him” (Genesis 5:24). Why this abrupt shift? What lies behind Enoch's translation? Further mysteries emerge: How did sin cloud perception amid Satan's “great dominion” (Moses 6:15)? What doctrine equipped Adam's family against it? From Moses' view, these generations trace priesthood lineage (Moses 6:7). From God's view, they reveal a deliberate pattern of calling the humble to prophetic work despite weakness. From Enoch's view, insecurity yields to divine empowerment. These layers illuminate core principles: sin limits ability “to see, feel, and hear the things of God” (Moses 6:26–36), yet God calls despite perceived inadequacies, as with Enoch (Moses 6:26–47). The gospel—faith, repentance, baptism, Holy Ghost—“was in the beginning [and] shall be in the end of the world also” (Moses 6:7, 50–52). Parents taught “the ways of God” (Moses 6:21), forging resilience across dispensations.\n\n## Scripture Deep Dive\nAscend through escalating revelations in Moses 6, resolving Genesis 5's mysteries.\n\n**Step 1: The Enigma Unveiled (Genesis 5:24; Moses 6:26–36).** Enoch's walking “with God” resolves in his call amid a sin-blinded world: “Satan had great dominion” (Moses 6:15), closing “the eyes of the people” with “a flaxen cord” (Moses 6:27–28). Enoch laments, “Why is it that I have found favor in thy sight, and am but a lad, and all the people hate me?” (Moses 6:31).\n\n**Step 2: Divine Reassurance (Moses 6:32–34).** God counters: “Lift up your heart, and rejoice... Walk with me” (Moses 6:34). This youth theme anchor—“Walk with Me”—transforms inadequacy.\n\n**Step 3: Empowerment Pattern (Moses 6:37–47).** God supports: Enoch's “words... became exceeding great” (Moses 6:47), echoing Moses 7:13. This mirrors prophets like Moses (Exodus 4:10–16), Jeremiah (Jeremiah 1:4–10), Nephi (2 Nephi 33:1–4), Moroni (Ether 12:23–29).\n\n**Step 4: Gospel Core (Moses 6:48–52).** Adam learns redemption: “How to worship the Father... with one heart, one mind, and one strength” (Moses 6:52). Faith, repentance, baptism, Holy Ghost prepare return to God.\n\n**Step 5: Baptism Symbolism (Moses 6:53–65).** Adam asks, “Why dost thou baptize?” (Moses 6:53). Answer: “Born of water and of the Spirit” (Moses 6:59), symbolizing rebirth. Water evokes cleansing (Moses 6:59–60).\n\n**Step 6: Parental Mandate (Moses 6:51–63).** “Teach these things freely unto your children” (Moses 6:58). Divide: verses 51–52 (ordinances), 53–57 (faith/repentance), 58–60 (baptism), 61–63 (Holy Ghost). A “book of remembrance” preserves truth (Moses 6:46; cf. Moses 6:5–6).\n\n**Step 7: Priesthood Continuity (Moses 6:7).** “This same Priesthood, which was in the beginning, shall be in the end of the world also.” Archaeological insight: Ancient records like this “book” align with Near Eastern genealogies, transforming dry lists into covenant chains.\n\n**Step 8: Symbols Deepen (Moses 6:27, 35, 59–60).** Hearts/ears (Moses 6:27), eyes/clay (Moses 6:35), water (Moses 6:59–60) symbolize spiritual awakening, pointing to the Savior.\n\nThis staircase reveals sin's veil pierced by covenant obedience, culminating in Zion's prophet.\n\n## Historical Context\nIn the ancient world post-Eden, Satan's “great dominion among men” (Moses 6:15) contrasted Adam's faithful posterity teaching “the ways of God” (Moses 6:21). Genesis 5's genealogy, sparse in Hebrew tradition, expands in Moses 6 to depict family progression: from Adam's repentance (Moses 6:53–65) to Enoch's city. A “book of remembrance” (Moses 6:5–6, 46) evokes Mesopotamian king lists, yet uniquely covenantal. Time collapses: Enoch's translation prefigures Noah's ark amid encroaching darkness, mirroring pioneer journals preserving gospel amid peril. Parents countered Satan by ordinance instruction, as today.\n\n## Pattern Recognition Web\nEnoch's reluctance—“the people hate me; for I am slow of speech” (Moses 6:31)—links to Moses (“slow of speech,” Exodus 4:10), Jeremiah (“child,” Jeremiah 1:6), Nephi (“slow to speak,” 2 Nephi 33:1), Moroni (“weak” Ether 12:27). Resolution: God empowers weakness (Moses 6:32–34; 7:13). Gospel pattern: Taught to Adam (Moses 6:50–68), echoed in Mosiah 4:14–15; D&C 68:25–28; 93:40–50. Parental teaching spans dispensations: “Teach these things freely” (Moses 6:58). Contradiction resolved: Sin blinds (Moses 6:35), yet ordinances open eyes (Moses 6:59–60). Generational web: Adam-Enoch-Noah foreshadows priesthood from “beginning” to “end” (Moses 6:7).\n\n## Discussion Framework\n1. What most people miss in Genesis 5:24?  \n2. How does sin limit “see[ing], feel[ing], and hear[ing] the things of God” (Moses 6:26–36)?  \n3. Why did Enoch feel overwhelmed (Moses 6:31)? What gave courage (Moses 6:32–34)?  \n4. Compare Enoch to Moses or Jeremiah—what pattern emerges?  \n5. Adam's baptismal question (Moses 6:53): What answers surprise?  \n6. Symbols in hearts/ears (Moses 6:27), eyes/clay (Moses 6:35)—what truths emerge?  \n7. List truths for children (Moses 6:51–63)—why vital today?  \n8. How does “Walk with Me” (Moses 6:34) resolve prophetic inadequacy?  \n9. What “book of remembrance” inspired by Moses 6:46?  \n10. How do first principles (Moses 6:52) bridge ancient to modern redemption?\n\n## Gospel Connections\nFirst principles anchor the Plan of Salvation: Faith/repentance lead to baptism (“born again,” Moses 6:59), Holy Ghost to exaltation (Moses 6:61–62). Parallels: Alma 32:21 (faith seed, bundle-implied pattern); Article of Faith 4. Adam's immersion evokes mortality's fall, emergence resurrection. Parental teaching (Moses 6:58) ensures premortal truths reach posterity, paralleling family eternal links.\n\n## Teaching Moments\n1. Act Enoch's call (Moses 6:26–34): Children voice fears, then God's “Walk with me” (Moses 6:34)—“aha” on divine help.  \n2. Line pictures to Christ: Faith, repentance, baptism, Holy Ghost (Moses 6:52; fourth article of faith)—sing “Faith,” “When I Am Baptized,” “The Holy Ghost” (Children’s Songbook).  \n3. Draw family teaching like Adam/Eve (Moses 6:58; Del Parson painting)—discuss scriptures/prayer/play.  \n4. Share prophet stories (Gospel Art Book nos. 7,19,78,81): God helps Noah/David/Ammon/Samuel, linking to Enoch (Moses 7:13).\n\n## Personal Reflection\n- When has sin clouded perception like Moses 6:35—how overcome?  \n- Recall a “slow of speech” moment (Moses 6:31)—did “Walk with me” (Moses 6:34) sustain?  \n- Like Adam (Moses 6:53), what questions arise at ordinances?  \n- What truths from Moses 6:51–63 to teach family?  \n- Patterns in personal “book of remembrance” (Moses 6:46)?\n\n## Prophetic Echoes\nModern apostles echo Enoch: “Many modern-day apostles and prophets have expressed feelings similar to Enoch’s when they described how it felt to receive their calls. For example, see the testimony of Elder Ulisses Soares in “Prophets Speak by the Power of the Holy Spirit” (Liahona, May 2018, 98–99).” Youth theme “Walk with Me” (Moses 6:34) inspires; see David A. Bednar, “Abide in Me, and I in You; Therefore Walk with Me” (Liahona, May 2023, 123–25). Parental strength: see Dieter F. Uchtdorf, “Jesus Christ Is the Strength of Parents” (Liahona, May 2023, 55–59). These mirror ancient calls amid weakness.\n\nThese covenant instructions from Adam's era invite families to teach gospel truths across generations.",
  "generated_timestamp": "2026-01-18 19:33:59",
  "source_week_file": "cfm_2026_week_05.json"
}