{
  "week_number": 5,
  "title": "Week 5: January 26–February 1 - Genesis 5; Moses 6",
  "date_range": "January 26–February 1",
  "study_level": "essential",
  "word_count": 656,
  "character_count": 4153,
  "content": "# Come, Follow Me 2026: Week 5 – Genesis 5; Moses 6 (January 26–February 1)\n\n## Week Overview\nImagine the intrigue of that single, unexplained line amid a list of generations: “And Enoch walked with God: and he was not; for God took him” (Genesis 5:24). What story hides behind those words? Feel the weight lift as Moses 6 unveils Enoch’s humility, insecurities, and the mighty work God empowered him to do. Notice the quiet power in parents teaching children “the ways of God” (Moses 6:15, 21), revealing doctrine from the beginning—faith in Jesus Christ, repentance, baptism, and receiving the Holy Ghost (Moses 6:50–52)—that “was in the beginning [and] shall be in the end of the world also” (Moses 6:7).\n\n## Key Scripture Moments\n1. **Enoch's Overwhelm and God's Call**: Here's the remarkable moment when Enoch questions his prophetic call: in Moses 6:26–36, he feels inadequate, yet the Lord responds, empowering him despite weaknesses (see also Moses 7:13).  \n2. **Walking with God**: Notice what happens next in Moses 6:34—the youth theme “Walk with Me” captures this invitation, echoing how God lifts the hesitant to divine purpose.  \n3. **Adam's Redemption Question**: In Moses 6:53, Adam asks how to be redeemed, and verses 53–65 unfold the Lord's baptismal message, likening it to being “born again” (verse 59).  \n4. **Teaching Future Generations**: The drama peaks as the Lord commands in Moses 6:51–63 to “teach these things freely unto your children,” listing truths of faith, repentance, baptism, and the Holy Ghost (Moses 6:52, 57).\n\n## Hidden Connections\nSymbols illuminate eternal truths: hearts and ears in Moses 6:27 show sin's blinding effect; eyes and clay in Moses 6:35 reveal God's clarifying touch; water in Moses 6:59–60 symbolizes rebirth. These connect to the gospel's first principles taught from Adam's day, solving modern blindness from sin (Moses 6:26–36). A “book of remembrance” kept by Adam and Eve's family (Moses 6) links to FamilySearch.org for preserving truths today.\n\n## Pattern Discovery\nRecurring themes bind generations: prophets feel inadequate—Moses (Exodus 4:10–16), Jeremiah (Jeremiah 1:4–10), Nephi (2 Nephi 33:1–4), Moroni (Ether 12:23–29)—yet God empowers them, as with Enoch (Moses 6:26–47). Parents teach unchanging doctrine (Moses 6:51–63; see also Mosiah 4:14–15; Doctrine and Covenants 68:25–28; 93:40–50), from Adam to today. Satan's “great dominion” (Moses 6:15) contrasts families walking with God (Moses 6:34, 57–58).\n\n## Simple Questions\n1. What effects of sin stand out in Moses 6:26–36, and how did Enoch overcome them?  \n2. Why did Enoch feel overwhelmed in Moses 6:31, and what did the Lord say in verses 32–34?  \n3. In Moses 6:53, what question does Adam ask, and what answer comes in verses 59–60?  \n4. What truths from Moses 6:51–52 must parents teach children (Moses 6:58)?  \n5. How does “walk with Me” (Moses 6:34) apply to personal callings?  \n6. What symbols in Moses 6:27, 35, 59–60 point to the Savior?\n\n## One Big Idea\nGod calls the weak to His work, empowering them as He did Enoch (Moses 6:26–47), revealing gospel doctrine from the beginning—faith, repentance, baptism, Holy Ghost (Moses 6:50–68)—taught by parents across generations for redemption.\n\n## Living It\n1. When facing hard tasks, recall Enoch's story (Moses 6:26–34) and act them out with family, like Noah or David (Gospel Art Book, nos. 7, 19).  \n2. Create a family “book of remembrance” from Moses 6, adding scriptures, prayers, or FamilySearch.org entries.  \n3. Teach children first principles (Moses 6:52, 57) through talks, pictures leading to Christ, or songs like “Faith” (Children’s Songbook, 96–97).\n\n## Faith Builder\nThis year’s youth theme, “Walk with Me,” draws from Moses 6:34. See also David A. Bednar, “Abide in Me, and I in You; Therefore Walk with Me” (Liahona, May 2023, 123–25); Elder Ulisses Soares in “Prophets Speak by the Power of the Holy Spirit” (Liahona, May 2018, 98–99); Dieter F. Uchtdorf, “Jesus Christ Is the Strength of Parents” (Liahona, May 2023, 55–59).\n\nThese ancient revelations invite families to teach gospel truths freely, walking with the Savior toward eternal redemption.",
  "generated_timestamp": "2026-01-18 19:33:04",
  "source_week_file": "cfm_2026_week_05.json"
}