{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "word_count": 721,
  "character_count": 4466,
  "content": "# Come, Follow Me 2026: Week 1 - Introduction to the Old Testament (December 29–January 4)\n\n## Week Overview\nWhen you consider studying the Old Testament this year, how do you feel? Eager? Uncertain? Afraid? These emotions arise because the Old Testament holds one of the oldest collections of writings, from an ancient culture that feels foreign. Yet notice the quiet power: people like Abraham, Sarah, Hannah, and Daniel faced family joy and discord, faith and uncertainty, successes and failures. They exercised faith, repented, made covenants, had spiritual experiences, and held to the promise of a Savior. Feel the weight of the psalmist’s words: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105, 140).\n\n## Key Scripture Moments\n1. **Manna from heaven**: “Manna (Exodus 16:4, 11–15; John 6:35)”. Here’s the remarkable moment when God provides bread in the wilderness, pointing to Jesus as “the bread of life.”\n   \n2. **The sacrificial lamb**: “The sacrificial lamb (Exodus 12:3–5; John 1:29)”. Notice what happens next: the lamb without blemish prefigures the Lamb of God who takes away the sins of the world.\n\n3. **The brass serpent**: “The brass serpent (Numbers 21:4–10; John 3:14)”. In desperation, the people look and live, echoing the Savior’s lifting up on the cross.\n\n4. **Jesus declares His identity**: “Before Abraham was, I am” (John 8:58–59). This shocks the Jews, linking back to “Exodus 3:13–15; 6:3–5” where Jehovah reveals His name.\n\n## Hidden Connections\nThese symbols connect ancient events to the Savior: manna to John 6:35, lamb to John 1:29, serpent to John 3:14, Jonah to Matthew 12:38–41. The Lord taught Adam, “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). Jesus Christ is Jehovah: “the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (President Dallin H. Oaks, “The Teachings of Jesus Christ,” Liahona, May 2023, 102). Plain and precious truths return through Joseph Smith, like Enoch’s Zion (Moses 7:18–19) and Abraham’s council (Abraham 3:22–28).\n\n## Pattern Discovery\nNotice this pattern across prophets: God makes covenants as His “peculiar treasure” (Exodus 19:5), echoed in Abraham, Isaac, Jacob. Nephi sees losses from the Bible but restoration through “other books” like Moses and Abraham (1 Nephi 13:21–29, 38–42). This aligns with 2 Nephi 3:12, where Bible and Book of Mormon join. Jehovah’s name recurs: “I am” in Exodus 6:3, claimed by Jesus. Symbols repeat—bread, lamb, serpent—bearing record of Christ from Moses to today.\n\n## Simple Questions\n1. How do manna, lamb, and serpent reveal the Savior (Exodus 16:4, 11–15; John 6:35; Exodus 12:3–5; John 1:29; Numbers 21:4–10; John 3:14)?\n2. Why did “Before Abraham was, I am” shock the Jews (John 8:58–59; Exodus 3:13–15; 6:3–5)?\n3. What plain and precious things return in Moses 7:18–19 or Abraham 3:22–28?\n4. How does “All things … bear record of me” (Moses 6:63) change reading the Old Testament?\n5. In what ways is the Old Testament a covenant story (Exodus 19:5)?\n6. Why pair Bible and Book of Mormon (2 Nephi 3:12; 1 Nephi 13:21–29, 38–42)?\n\n## One Big Idea\nThe Old Testament testifies of Jesus Christ as Jehovah through symbols and covenants, with plain and precious truths restored. God seeks a covenant people as His “peculiar treasure” (Exodus 19:5), moving in lives like ours. Nephi foresaw losses but divine restoration (1 Nephi 13:21–29), making ancient words a lamp today (Psalm 119:105).\n\n## Living It\n1. Look for Christ in symbols like manna or lamb during family study, building faith as in Teaching in the Savior’s Way (7).\n2. Discuss everyday promises, then baptism covenants (Mosiah 18:10, 13), preparing hearts for temple promises.\n3. Sing “Seek the Lord Early” (Children’s Songbook, 108) or “When I Am Baptized” (103) to excite children about covenants.\n\n## Faith Builder\nElder Dale G. Renlund urged: “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98). President Dallin H. Oaks clarified Jehovah’s voice in Old Testament records (“The Teachings of Jesus Christ,” Liahona, May 2023, 102). See also President Russell M. Nelson’s “The Everlasting Covenant” (Liahona, October 2022, 4–11) for covenant insights.\n\nThese ancient symbols and restored truths invite us to discover the Savior in every page, strengthening covenant bonds with God.",
  "generated_timestamp": "2026-01-18 19:27:20",
  "source_week_file": "cfm_2026_week_01.json"
}