{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "word_count": 1164,
  "character_count": 7678,
  "content": "# Come, Follow Me 2026: Week 1 – Introduction to the Old Testament (December 29–January 4)\n\n## Doctrinal Foundation\nFrom Moses' view in the Pearl of Great Price, all creation bears record of the Savior: “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). From God's view, as revealed through Nephi, the Old Testament's plain and precious truths point to covenants and the Savior, despite losses in transmission (1 Nephi 13:21–29, 38–42). From our view today, these ancient writings bridge dispensations, revealing Jesus Christ as Jehovah who covenanted with prophets like Abraham. This layered foundation shows the Old Testament not as distant history, but as God's ongoing effort to make us His “peculiar treasure” by covenant (Exodus 19:5). What if the intimidation many feel—eager, uncertain, afraid—is the very invitation to discover His light?\n\n## Scripture Deep Dive\n1. **Psalm 119:105, 140**: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it.” This opens the week, linking ancient psalms to personal guidance.\n\n2. **Exodus 16:4, 11–15 with John 6:35**: Manna foreshadows Jesus as “the bread of life,” transforming daily sustenance into eternal symbolism.\n\n3. **Exodus 12:3–5 with John 1:29**: The sacrificial lamb points to the Lamb of God, escalating from Passover protection to ultimate redemption.\n\n4. **Numbers 21:4–10 with John 3:14**: The brass serpent heals by faith, mirroring Christ's lifting up on the cross—a pattern of looking to Him for life.\n\n5. **Jonah 1:4–17 with Matthew 12:38–41**: Jonah's three days in the fish prefigures resurrection, revealing Christ's power over death.\n\n6. **Exodus 3:13–15; 6:3–5 with John 8:58–59**: Jehovah declares “I AM,” shocking Jews when Jesus echoes it, confirming His eternal identity.\n\n7. **1 Nephi 13:21–29, 38–42**: Plain and precious things restored, like Enoch’s Zion (Moses 7:18–19), connect Old Testament gaps to latter-day clarity.\n\n8. **Exodus 19:5**: God seeks a “peculiar treasure” through covenant, echoed in Jeremiah 31:31–34's new covenant written on hearts.\n\nThis pattern escalates from symbols to Jehovah's voice to restored covenants, with archaeological echoes in ancient Egyptian papyri yielding Abraham's council (Abraham 3:22–28).\n\n## Historical Context\nImagine the ancient Near East: scrolls from millennia ago, penned in a culture of kings, prophets, and exiles. The bundle notes these as “one of the oldest collections of writings in the world,” from a “foreign and sometimes strange” world. Yet figures like Abraham faced family joy and discord amid pagan surroundings, much like pioneers crossing plains amid trials. Time collapses when we see Hannah's faith mirroring modern uncertainties, or Daniel's resolve in exile akin to early Saints in Nauvoo. Joseph Smith's translation restores Genesis 1–6 details absent in surviving texts, aligning ancient papyri with heavenly councils—bridging 4,000 years to our covenant path.\n\n## Pattern Recognition Web\nThis week's symbols web across dispensations: Manna in Exodus 16 links to John 6:35, then Alma's word as good seed (though not in bundle, pattern suggests nourishment motif). Brass serpent in Numbers 21 parallels Helaman's title of liberty for faith-looks. Covenants bind Abraham to Nelson's everlasting covenant, echoing 2 Nephi 3:12 where Bible and Book of Mormon “thrust hands” together. Jehovah's “I AM” (Exodus 3:13–15) voices through Old Testament “God” or “Lord” (per Oaks), matching Moses 6:63's likenesses. Restored JST like Melchizedek's ministry (JST Genesis 14:25–40) threads to modern Zion quests. A mystery: Why “plain and precious” losses? Resolved in Nephi's vision of restoration, firing prophetic patterns from Eden to now.\n\n## Discussion Framework\n1. What most people miss: How does viewing Old Testament “God” as Jehovah (Exodus 6:3) change familiar stories?\n2. Why do manna (Exodus 16) and lamb (Exodus 12) feel distant yet familiar as Christ symbols?\n3. Apparent contradiction: Ancient culture seems “strange”—how does Moses 6:63 resolve it with all things bearing His record?\n4. What hidden connection surprises you between Jonah's trial and Matthew 12?\n5. From Abraham's view, why are restored visions like council in heaven (Abraham 3:22–28) precious?\n6. How does Psalm 119:105 light your path amid Old Testament intimidation?\n7. Generational link: Pioneers echoed Hannah's faith—where do you see this in your family?\n8. Profound application: What covenant truth from Exodus 19:5 shifts your relationship with God?\n9. Mystery setup: Jews stoned at “Before Abraham was, I am” (John 8:58)—Exodus 3 resolves how?\n10. Living it: How will Renlund's counsel to “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98) guide your year?\n\n## Gospel Connections\nOld Testament symbols anchor the Plan of Salvation: Manna sustains premortal to mortal journey (Exodus 16; John 6:35); lamb redeems from opposition (Exodus 12; John 1:29); serpent offers healing choice (Numbers 21; John 3:14); Jonah previews resurrection glory. Covenants (Exodus 19:5) propel from agency to exaltation, paralleling Mosiah 18:10's baptismal promises. Jehovah as Creator (Moses 6:63) oversees premortal council (Abraham 3), making ancient whispers modern witnesses of eternal progression.\n\n## Teaching Moments\n1. **Aha Symbol Hunt**: With children, view *The Prophet Isaiah Foretells Christ’s Birth* by Harry Anderson; read Isaiah 7:14; 9:6. Point to baby Jesus—watch eyes light up at Old Testament prophecies.\n2. **Name Game**: Ask kids about different names for loved ones, then Exodus 6:3—reveal Jesus as Jehovah for “aha” identity moment.\n3. **Covenant Promise Chain**: Discuss family promises, link to baptism (Mosiah 18:10) and temple pictures; sing “When I Am Baptized” (Children’s Songbook, 103) for hidden joy connection.\n4. **Lamp Walk**: In dim light, read Psalm 119:105—create family “time collapse” linking psalmist to your path.\n\n## Seminary Synthesis\nSeminary teachers, adapt these from the manual: 1) JST expansions like Enoch’s Zion (Moses 7:18–19) reveal city patterns for dispensational Zion studies. 2) Oaks' insight—“scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah” (Liahona, May 2023, 102)—unlocks advanced deity doctrines. 3) Nephi's plain/precious framework (1 Nephi 13) equips students to bridge Bible losses with restorations, fostering pattern-spotting skills.\n\n## Personal Reflection\n- Trace a symbol like manna in your life: Where has Christ been your daily bread amid uncertainty?\n- Recall a covenant moment echoing Abraham—how has God made you His “peculiar treasure” (Exodus 19:5)?\n- Like ancient saints, where have family discord or faith trials shown His hand? Journal patterns aligning past promises to your path.\n- Ponder: “Why are these accounts ‘plain and precious’ to you?” as Joseph restored truths.\n\n## Prophetic Echoes\nModern voices mirror ancient fire: President Oaks echoes Exodus 3:13–15, declaring words of “God” or “Lord” as Jehovah's, our risen Lord (“The Teachings of Jesus Christ,” Liahona, May 2023, 102). Elder Renlund urges us to “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98), paralleling manna hunts. President Nelson's “The Everlasting Covenant” (Liahona, October 2022, 4–11) reflects Exodus 19:5's treasure, asking why covenants bring “special kind of love and mercy.” These echoes thrill—ancient Jehovah speaks through living prophets, lighting our 2026 path.\n\nI bear testimony that as we seek Him in these pages, He reveals Himself, just as to Abraham and Nephi. The Old Testament lives.\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-10 10:54:10",
  "source_week_file": "cfm_2026_week_01.json"
}