{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "word_count": 693,
  "character_count": 4398,
  "content": "# Come, Follow Me 2026: Old Testament  \n## Week 1: December 29–January 4  \n### Introduction to the Old Testament\n\n**Week Overview**  \nWhen you consider studying the Old Testament this year, how do you feel? Eager? Uncertain? Afraid? These emotions are understandable, as these are some of the oldest writings in the world from an ancient culture. Yet here we see people like Abraham, Sarah, Hannah, and Daniel experiencing family joy and discord, faith and uncertainty—just like us. They exercised faith, repented, made covenants, and held to the promise of a Savior. As the psalmist declared, “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105, 140).\n\n**Key Scripture Moments**  \nNotice what happens when the Lord reveals His name to Moses: “I AM THAT I AM” (Exodus 3:13–15; see also Exodus 6:3–5). Here's the remarkable moment when Jesus echoes this in the New Testament: “Before Abraham was, I am” (John 8:58), shocking the Jews who knew Jehovah's name.  \nSee the pattern across prophets: The Lord taught Adam, “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). Nephi saw plain and precious truths restored through Joseph Smith (1 Nephi 13:21–29, 38–42).  \nWatch Enoch’s city of Zion rise (Moses 7:18–19), Abraham’s vision of the premortal council (Abraham 3:22–28), and Melchizedek’s ministry (Joseph Smith Translation, Genesis 14:25–40)—truths making the Old Testament alive again.\n\n**Hidden Connections**  \nLook for the Bread of Life in manna from heaven (Exodus 16:4, 11–15; see John 6:35). The sacrificial lamb points to Him (Exodus 12:3–5; John 1:29). The brass serpent heals when looked upon (Numbers 21:4–10; John 3:14). Jonah in the great fish foreshadows resurrection (Jonah 1:4–17; Matthew 12:38–41). These symbols bridge ancient Israel to our Savior, solving modern doubts by showing His reality woven through history.\n\n**Pattern Discovery**  \nThis becomes powerful when we see the recurring theme: God seeks a “peculiar treasure” by covenant (Exodus 19:5). Abraham, Isaac, Jacob, and their posterity received the everlasting covenant. Notice it echoes in Jeremiah 31:31–34 and Nephi’s vision of Bible and Book of Mormon uniting (2 Nephi 3:12). Restored accounts like Moses and Abraham reveal God’s consistent pattern—covenants binding heaven and earth across dispensations.\n\n**Simple Questions**  \n1. How do manna, the lamb, serpent, and Jonah testify of Jesus Christ in your life?  \n2. Why did Jesus’ words “Before Abraham was, I am” shock the Jews (John 8:58; Exodus 3:13–15)?  \n3. What plain and precious things did Nephi see restored (1 Nephi 13:21–29)?  \n4. How does knowing Jesus Christ is Jehovah change your view of Old Testament “Lord” passages?  \n5. Why are covenants God’s way to make us His peculiar treasure (Exodus 19:5)?  \n6. What do restored visions like Enoch’s Zion teach about God’s promises (Moses 7:18–19)?\n\n**One Big Idea**  \nJesus Christ is Jehovah in the Old Testament. President Dallin H. Oaks taught: “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (“The Teachings of Jesus Christ,” Liahona, May 2023, 102). This transforms the Old Testament from ancient history into personal revelation from our living Savior.\n\n**Living It**  \nFocus on Jesus Christ as Elder Dale G. Renlund urged: “remember and always focus on Jesus Christ” (“Jesus Christ Is the Treasure,” Liahona, Nov. 2023, 98). When facing uncertainty, look for His symbols in your day—like daily bread in trials.  \nStudy covenants in President Russell M. Nelson’s “The Everlasting Covenant” (Liahona, October 2022, 4–11), asking: What special kind of love and mercy do I receive as I keep them? Watch for God teaching your covenant path this year.\n\n**Faith Builder**  \nRecent prophets echo these truths. President Oaks confirms Jehovah speaks throughout the Old Testament. Elder Renlund invites us to find the Savior everywhere. President Nelson reveals the everlasting covenant binding ancient prophets to us. These witnesses align past promises with our day—I feel the Spirit confirming Jesus Christ leads us still.\n\n*(Word count: 712)*",
  "generated_timestamp": "2026-01-10 22:35:12",
  "source_week_file": "cfm_2026_week_01.json"
}