{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "study_level": "essential",
  "word_count": 632,
  "character_count": 3993,
  "content": "# Week 3: January 12–18  \n**Genesis 1–2; Moses 2–3; Abraham 4–5**\n\n## Week Overview\nBecause the world around us is so beautiful and majestic, it’s hard to imagine the earth when it was “without form, and void” and “empty and desolate” (Genesis 1:2; Abraham 4:2). Notice what happens next: God, through His Only Begotten, transforms chaos into something magnificent. This reveals His ongoing creative power in our lives.\n\n## Key Scripture Moments\nHere's the remarkable moment when creation begins: “By mine Only Begotten I created these things” (Moses 2:1–25, as highlighted). Across Genesis 1:1–25, Moses 2:1–25, and Abraham 4:1–25, God reveals Jesus Christ as the Creator under the Father's direction.\n\nThen comes the dramatic reveal in Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27: God creates us, male and female, in His “image” or “likeness.” Ponder how this elevates our identity.\n\nNotice Genesis 1:28; Moses 2:28; Abraham 4:28—God commands us to “replenish the earth, and subdue it,” showing our stewardship role.\n\nFinally, Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3 declare the seventh day “blessed” and “sanctified,” setting a holy pattern from the start.\n\n## Hidden Connections\nThese accounts connect ancient Creation to modern revelation. Genesis 1:28; Moses 2:28; Abraham 4:28 link to Doctrine and Covenants 59:16–21 and 104:13–18, expanding our duty: “by obedience and sacrifice” we claim inheritance in Zion (Doctrine and Covenants 101:32–34). Genesis 1:26–27 gains depth from Mosiah 3:19 and Ether 12:27, countering ideas that divine image means no need for improvement—our natural man yields to godly potential.\n\n## Pattern Discovery\nNotice this pattern repeating seamlessly across Genesis 1–2, Moses 2–3, and Abraham 4–5: First, the Only Begotten organizes from void (periods 1–6); then humanity in God's image, male and female, with stewardship to multiply and care; capped by the sanctified Sabbath. This becomes powerful when we see God's consistent plan—Creation, Fall, and exaltation intertwined, mirroring His work with us today.\n\n## Simple Questions\n1. What does God teach you about Heavenly Father, Jesus Christ, the world, and yourself in Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25?  \n2. How do Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27 affect the way you see yourself, others, and God?  \n3. When you have negative feelings about yourself, how can knowing you are created in God’s image help?  \n4. What do Genesis 1:28; Moses 2:28; Abraham 4:28 suggest about caring for God’s creations?  \n5. What makes the Sabbath “blessed” to you in Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3?  \n6. Because I know I am created in God’s image, I choose to…?\n\n## One Big Idea\nWe are created in God’s image, after His likeness (Genesis 1:26), with divine potential. From an earth “without form, and void,” God made beauty; He does the same for us, transforming emptiness into exalted beings. This truth, echoed in parallel accounts, reminds us His creative work with us continues.\n\n## Living It\nTake a walk among creations, pondering Jesus as Creator—share pictures with your testimony (see “All Creatures of Our God and King,” Hymns, no. 62). Honor your body as sacred: complete “Because I know I am created in God’s image, I choose to…” and review “Your body is sacred” (For the Strength of Youth, pages 22–29). Keep the Sabbath holy by drawing or role-playing activities that differ from other days, using Genesis 2:2–3.\n\n## Faith Builder\nPresident Russell M. Nelson bears testimony of the human body in “God’s Greatest Creation” (Gospel Library): “How does Heavenly Father want me to feel about my body?” He taught, “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (“Lessons from Eve,” Ensign, Nov. 1987, 87). These echo Creation's truths, urging reverence for divine identity and eternal families.\n\nI testify these accounts draw us nearer to the Creators who know and love us perfectly. (748 words)",
  "generated_timestamp": "2026-01-10 22:37:27",
  "source_week_file": "cfm_2026_week_03.json"
}