{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "word_count": 1445,
  "character_count": 8971,
  "content": "# Come, Follow Me 2026 Old Testament Study Guide: Week 1 (December 29–January 4) - Introduction to the Old Testament\n\nWelcome, dear friends, to this sacred journey through the Old Testament in 2026. As we embark on this study together, my heart is full of gratitude for the opportunity to uncover the treasures of these ancient scriptures. I know that as we seek the Savior in these pages, we will find Him testifying of His divinity, His love, and His covenant promises to us.\n\n## Doctrinal Foundation\n\nLet’s begin by exploring the core principle of this week’s lesson—Jesus Christ as the central figure of the Old Testament—from multiple perspectives:\n\n- **From the perspective of ancient prophets**: Men like Isaiah and Moses saw Christ in visions and symbols, pointing their people to the coming Messiah. Isaiah declared, “Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel” (Isaiah 7:14), while Moses lifted up the brass serpent as a type of Christ’s healing power (Numbers 21:4–10).\n- **From God’s perspective**: The Father’s plan from the beginning was to center all things in His Son. As President Dallin H. Oaks taught, “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102).\n- **From our modern perspective**: As we read, we seek to recognize Christ in every story and symbol, knowing He is Jehovah, the God of the Old Testament, guiding us through these ancient words to understand our covenant relationship with Him.\n\n## Scripture Deep Dive\n\nLet’s dive into key passages that reveal Christ and build escalating connections across dispensations:\n\n1. **Exodus 16:4** - “Then said the Lord unto Moses, Behold, I will rain bread from heaven for you.” This manna prefigures Christ as the Bread of Life (John 6:35), showing God’s provision for both body and soul.\n2. **Exodus 12:3–5** - The sacrificial lamb, “without blemish,” points to Christ as “the Lamb of God, which taketh away the sin of the world” (John 1:29).\n3. **Numbers 21:8–9** - The brass serpent lifted up by Moses symbolizes Christ’s crucifixion and healing power, as He Himself taught (John 3:14).\n4. **Jonah 1:17** - Jonah’s three days in the whale’s belly foreshadows Christ’s resurrection after three days (Matthew 12:38–41).\n5. **Isaiah 7:14** - “Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel.” This direct prophecy of Christ’s birth ties the Old Testament to the New.\n6. **Psalm 119:105** - “Thy word is a lamp unto my feet, and a light unto my path.” This reflects how the scriptures, including the Old Testament, guide us to Christ.\n7. **Moses 6:63** - “All things have their likeness, and all things are created and made to bear record of me.” This restored truth from Joseph Smith shows the divine intent behind every symbol.\n8. **1 Nephi 13:21–29** - Nephi’s vision of the Bible losing “plain and precious things” connects to the Restoration, where Joseph Smith’s translations (like the Book of Moses) restore Christ-centered truths.\n\n**Cultural Context**: The ancient Near Eastern practice of animal sacrifice, central to the Old Testament, was deeply symbolic. Archaeological findings of altars and ritual sites confirm the pervasive use of lambs in offerings, reinforcing the connection to Christ as the ultimate sacrifice.\n\n## Historical Context\n\nThe Old Testament emerges from a world of ancient empires—Egypt, Babylon, Assyria—where polytheism dominated. Yet amidst this, God called a covenant people to worship Him alone. Understanding this backdrop creates a “time collapse moment”: just as Israel struggled to remain faithful amid surrounding idolatry, we too face pressures to conform to worldly values. The Old Testament’s accounts of covenant-making, like those with Abraham, were radical in a culture of transient alliances, highlighting God’s eternal promises.\n\n## Pattern Recognition Web\n\nThe Old Testament’s themes resonate across dispensations:\n- **Covenants**: God’s covenant with Abraham (Exodus 19:5) echoes in the baptismal covenant (Mosiah 18:10) and temple covenants today.\n- **Christ as Jehovah**: His identity as the God of Israel (Exodus 6:3) aligns with His New Testament declaration, “Before Abraham was, I am” (John 8:58).\n- **Restoration of Truth**: Nephi’s prophecy of lost truths (1 Nephi 13:21–29) connects to Joseph Smith’s translations, such as Moses 7:18–19 on Enoch’s Zion.\n- **Symbols of Christ**: From the manna to the brass serpent, these types recur in Book of Mormon teachings (Alma 33:19–21) and modern prophetic counsel.\n\n## Discussion Framework\n\n1. What most people miss: How does the ancient setting of the Old Testament make its stories feel distant, yet its themes so personal?\n2. Why do you think God used so many symbols like manna or the sacrificial lamb to teach about Christ?\n3. How does knowing Jesus Christ is Jehovah change the way you read Old Testament commandments or promises?\n4. What “plain and precious things” restored by Joseph Smith stand out to you, and why?\n5. How do covenants in the Old Testament mirror those we make today, like baptism or temple ordinances?\n6. What surprises you most about seeing Christ in unexpected Old Testament stories?\n7. How can focusing on Christ help us navigate difficult or unfamiliar passages in the Old Testament?\n8. What personal experiences have shown you God’s “special kind of love and mercy” through covenants?\n9. How does the Old Testament’s witness of Christ strengthen your faith in His Atonement?\n10. What are you most eager to discover about your covenant relationship with God this year?\n\n## Gospel Connections\n\nThe Old Testament is deeply tied to the Plan of Salvation. The covenant with Abraham (Exodus 19:5) reflects premortal promises to become God’s people, while symbols like the brass serpent (Numbers 21:8–9) point to Christ’s Atonement as the means of salvation. This pattern suggests a parallel in Alma 33:19–21, where the serpent is a type of Christ’s healing power for all who look to Him. Even the journey of Israel through the wilderness mirrors our mortal probation, seeking the promised land of exaltation.\n\n## Teaching Moments\n\n1. **Hidden Symbolism**: Share how everyday elements like manna (Exodus 16:4) point to Christ as the Bread of Life, inviting listeners to find Him in daily blessings.\n2. **Restored Truths**: Highlight a restored account, like Enoch’s Zion (Moses 7:18–19), showing how Joseph Smith’s work deepens our understanding of ancient faith.\n3. **Covenant Continuity**: Connect ancient covenants (Exodus 19:5) to modern ones, sparking an “aha moment” about God’s unchanging love.\n4. **Christ as Jehovah**: Teach how Jesus’ declaration “I am” (John 8:58) ties directly to Jehovah’s name in Exodus 3:14, revealing His eternal identity.\n\n## Seminary Synthesis\n\nFrom the Seminary manual, consider these insights for deeper study:\n1. The Old Testament’s central theme is Christ, with symbols like the sacrificial lamb (Exodus 12:3–5) as teaching tools for His Atonement.\n2. Joseph Smith’s translations, such as the Book of Moses, restore context to Genesis, revealing premortal councils (Abraham 3:22–28) that frame the Plan of Salvation.\n3. Covenants are a unifying thread, linking ancient Israel to us through shared promises of God’s mercy (Jeremiah 31:31–34).\n\n## Personal Reflection\n\n- When have you felt the Old Testament (or other scriptures) act as “a lamp unto [your] feet” (Psalm 119:105) during a dark time?\n- How do symbols of Christ in your life—like the sacrament—echo those in the Old Testament?\n- What patterns of faith or repentance in your journey mirror those of ancient prophets like Abraham or Hannah?\n\n## Prophetic Echoes\n\nModern prophetic teachings mirror ancient revelations in powerful ways:\n- President Russell M. Nelson’s message on “The Everlasting Covenant” (Liahona, October 2022, 4–11) reflects the Old Testament theme of God seeking us as His “peculiar treasure” (Exodus 19:5), emphasizing the eternal nature of covenants.\n- Elder Dale G. Renlund’s counsel to “remember and always focus on Jesus Christ” (Liahona, November 2023, 98) echoes the Old Testament’s purpose to bear record of Christ in all things (Moses 6:63).\n- President Dallin H. Oaks’ teaching that the words of “God” or “Lord” in scripture are “almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102) unveils the Savior’s voice throughout the Old Testament.\n\nAs we embark on this year of study, I bear witness of the power of these ancient words to draw us closer to Jesus Christ. May we seek Him in every page, finding light for our path and strength for our covenants. I’m thrilled to walk this journey with you, uncovering the Savior’s love woven through every story and promise.",
  "generated_timestamp": "2025-12-31 23:37:53",
  "source_week_file": "cfm_2026_week_01.json"
}