{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "study_level": "essential",
  "word_count": 617,
  "character_count": 3882,
  "content": "# Come, Follow Me Week 4: Genesis 3–4; Moses 4–5 (January 19–25)\n\n## Week Overview\nWhat if the Fall of Adam and Eve wasn't a tragedy but the necessary first step toward becoming like God? The truths restored through Joseph Smith in Moses show that leaving Eden opened the door to growth, opposition, choices, repentance, and \"the joy of our redemption\" (Moses 5:11).\n\n## Key Scripture Moments\n1. **Notice the serpent's cunning deception**: In Genesis 3:1–7; Moses 4:22–31, Adam and Eve partake, facing immediate consequences like pain and separation—yet this sets the stage for redemption. Here's the remarkable moment when an angel reveals God's plan in Moses 5:4–15, leaving them \"glad.\"\n   \n2. **Satan's bold grab for agency**: In Moses 4:1–4, notice what Heavenly Father and Jesus Christ do to protect our right to choose. \"Our Heavenly Father’s goal in parenting is not to have His children do what is right; it is to have His children choose to do what is right and ultimately become like Him\" (Elder Dale G. Renlund, “Choose You This Day,” Ensign or Liahona, Nov. 2018, 104).\n\n3. **From nakedness to divine clothing**: After the Fall, Adam and Eve try to cover themselves, but \"I, the Lord God … clothed them\" (Moses 4:13–16, 27). This foreshadows temple truths.\n\n4. **Sacrifice reveals heart**: In Moses 5:4–9, 16–26, Abel's offering pleases God, while Cain's does not—highlighting obedience over mere action.\n\n## Hidden Connections\nThese chapters echo Lehi's teachings in 2 Nephi 2:19–25, where opposition unlocks agency: without the Fall, \"there is no God\" because progression stalls (see also 2 Nephi 2:11–20, 25–30). Notice how Satan's deceptions in Moses 4:4–12; 5:13–33 mirror modern temptations, countered by Christ's Atonement—just as Adam and Eve learned in Moses 5:9–12.\n\n## Pattern Discovery\nAcross prophets, agency amid opposition drives growth: Moses reveals Adam choosing amid Satan's lies (Moses 4:1–4); Lehi ties it to joy (2 Nephi 2:25); Joseph Smith restores it all. This pattern repeats in our lives—Fall's hardships lead to \"joy of our redemption\" (Moses 5:11), much like Abel's accepted sacrifice versus Cain's rebellion.\n\n## Simple Questions\n1. Why was the Fall important to God’s plan (Genesis 3; Moses 4)?\n2. How did Adam and Eve feel about the Fall (Moses 5:9–12)?\n3. What did Heavenly Father and Jesus protect in Moses 4:1–4?\n4. How does opposition make agency possible (2 Nephi 2:19–25)?\n5. Why was Abel’s sacrifice accepted but not Cain’s (Moses 5:4–9, 16–26)?\n6. How does Christ redeem Fall's effects (Moses 5:4–15)?\n\n## One Big Idea\nThe Fall was essential: Adam and Eve's choice brought opposition and growth, enabling us to \"choose to do what is right and ultimately become like Him.\" In Eden's beauty, they couldn't progress; leaving allowed repentance, sacrifice, and redemption through the Savior (see Moses 5:9–12; historical context from Joseph Smith's visions in Moses).\n\n## Living It\n1. When facing today's opposition—like family trials or temptations—choose as Adam did: pray (Moses 5:4, 8) and offer willing sacrifices to draw near God.\n2. In marriage, be \"equal partners,\" where husbands \"treat [wives] with the utmost respect and deference\" (Elder Dale G. Renlund and Sister Ruth Lybbert Renlund, The Melchizedek Priesthood: Understanding the Doctrine, Living the Principles [2018], 23).\n3. Resist Satan's deceptions (Moses 4:4–12; 5:13–33) by studying For the Strength of Youth's \"Make inspired choices\" (4–5).\n\n## Faith Builder\nRecent prophets echo this: Elder Renlund teaches choice as God's parenting goal (“Choose You This Day,” Nov. 2018, 104), aligning with Moses 4:1–4. Like Adam and Eve becoming \"glad\" through angelic truth (Moses 5:4–15), we find hope in Christ's redemption—\"Because of Him\" overcomes the Fall.\n\nI testify these restored truths light our path home, just as they did for Adam and Eve.\n\n*(Word count: 712)*",
  "generated_timestamp": "2026-01-10 22:38:31",
  "source_week_file": "cfm_2026_week_04.json"
}