{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "essential",
  "word_count": 676,
  "character_count": 4413,
  "content": "# Come, Follow Me 2026: Week 2 (January 5–11)  \n**Moses 1; Abraham 3**\n\n## Week Overview\nWhat if the Lord spoke to you directly—what's the first thing He'd make sure you understand? President Russell M. Nelson taught, “If the Lord were speaking to you directly,” President Russell M. Nelson taught, “the first thing He would make sure you understand is your true identity” (“Choices for Eternity” [worldwide devotional for young adults, May 2022], Gospel Library). Moses 1 and Abraham 3 lift this veil, revealing who God is, who we are, and our place in His work—answering Moses's plea: “Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens” (Moses 1:36).\n\n## Key Scripture Moments\nNotice the dramatic contrast that sets the tone: In Moses 1:4, 6, God declares Moses's divine sonship and work, while in Moses 1:12, Satan strikes with doubt. Here's the remarkable moment when spiritual power meets temptation—after beholding God, Satan appears in Moses 1:12–26. Watch Moses pivot: “What do you learn that can help you stay true to the testimony you have received? What was it that finally helped Moses overcome Satan?” (CFM).  \n\nThen, the vision expands in Moses 1:27–39. After seeing God's creations, Moses asks, “Tell me … why these things are so” (Moses 1:30)—and the purpose unfolds in verses 31–39. Abraham echoes this: In Abraham 3:22–28, premortal intelligences prepare for earth. Notice the pattern across prophets—Moses and Abraham both glimpse eternity, fueling their missions.\n\n## Hidden Connections\nThese chapters bridge premortal existence to earth's purpose. Abraham 3:22–28 reveals “before the world was” spirits chosen to “make an earth” and “prove” themselves (Abraham 3:22–28; teaching children section). This illuminates Moses 1:31–39, where God's work brings “immortality and eternal life” (Moses 1:39). Satan’s counterfeits in Moses 1:13–18 mimic divine power—fake like “an artificial plant or a baby doll”—but Moses rejects them, calling on God (Moses 1:20–22, 24–26). This solves modern confusion: Premortal truths cut through today's doubts.\n\n## Pattern Discovery\nSpot this recurring pattern: God affirms identity first (Moses 1:4, 6), Satan attacks it immediately after visions (Moses 1:12). Both Moses and Abraham see vast creations, then learn personal purpose—spirits proving through choices (Abraham 3:24–26; 25). Notice how Moses resists by remembering: invoking God's name, commanding departure (Moses 1:13, 15, 18, 20–22, 26). This becomes powerful when we see it in our lives—spiritual highs invite temptation, but divine identity prevails.\n\n## Simple Questions\n1. In Moses 1:4, 6 and 1:12, what differences emerge between God's and Satan's messages?  \n2. From Moses 1:12–26, what helped Moses overcome—what can you apply?  \n3. How do counterfeits in Moses 1:13–18 show up today, and how does the Lord help (Moses 1:24–26)?  \n4. What impresses you in Moses 1:31–39 about immortality versus eternal life?  \n5. In Abraham 3:22–28, list truths about yourself and Jesus Christ—why are they valuable?  \n6. How does knowing premortal life (Abraham 3:25) change daily choices?\n\n## One Big Idea\nGod's work and glory centers on our eternal life: After Moses's cosmic vision, the Lord explains in Moses 1:31–39 why creations exist—to bring “immortality and eternal life” through Jesus Christ. Abraham 3:24–26 adds context: Noble spirits come to earth to be proven. Historically, Joseph Smith's visions restored this pre-Genesis truth, framing the Old Testament as God's response to Moses's questions.\n\n## Living It\n1. List choices flowing from your identity as a child of God, beyond other labels—“The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”).  \n2. Spot Satan's counterfeits daily; practice Moses's resistance—pray, command them away, rely on the Lord (Moses 1:12–26).  \n3. Teach children: Mirror affirmations from Moses 1:4—“I am a child of God”—and act out resisting temptation.\n\n## Faith Builder\nRecent prophets echo these truths. President Nelson urges knowing “the truth about who you are” first (“Choices for Eternity”). Like Moses resisting post-vision temptation, we overcome counterfeits through Christ—I've felt this power anchor me amid trials, testifying that our premortal nobility equips us for God's work today.  \n\n*(Word count: 712)*",
  "generated_timestamp": "2026-01-10 10:55:00",
  "source_week_file": "cfm_2026_week_02.json"
}