{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "scholarly",
  "word_count": 1626,
  "character_count": 10287,
  "content": "# Come, Follow Me Study Guide: Week 2 - January 5–11, 2026  \n## Moses 1; Abraham 3 - \"I Am a Child of God with a Divine Destiny\"\n\nWelcome, dear friends, to a journey through sacred revelation in Moses 1 and Abraham 3. As we embark on this study of the Old Testament for 2026, let us anchor ourselves in the profound truths of our divine identity and God’s eternal purposes. These chapters, revealed through the Prophet Joseph Smith, provide a heavenly perspective on who we are, why we are here, and how God’s work encompasses all of creation. Let us dive deep into patterns, contexts, and connections that illuminate the Restoration’s light on ancient scripture.\n\n---\n\n### Theological Framework: Pattern Recognition Mastery\nThe doctrinal themes in Moses 1 and Abraham 3 reveal a divine blueprint of identity, purpose, and opposition that spans all dispensations. From the premortal council to the mortal test, we see God’s consistent pattern of revealing our divine nature as His children, calling us to a work, and preparing us to resist Satan’s counterfeits. This framework is evident in Moses’s vision of God’s creations (Moses 1:27–39) and Abraham’s glimpse into the premortal realm (Abraham 3:22–28). These accounts mirror modern prophetic teachings about our eternal identity, showing that the same truths taught to ancient prophets apply to us today as children of God with a divine destiny.\n\nThis pattern indicates that God’s purpose—“to bring to pass the immortality and eternal life of man” (Moses 1:39)—is the unifying thread across time, from Adam’s covenant to the modern Restoration. It connects us to every prophet who has sought to know God’s will and work.\n\n---\n\n### Exegetical Insights: Hebrew Terms and Literary Structures\nWhile the provided bundle does not include specific Hebrew terms or archaeological data for Moses 1 and Abraham 3 (as these are latter-day revelations rather than direct translations of ancient texts), we can still appreciate the literary structure of these chapters. Moses 1 begins with a direct encounter between Moses and God, using repetitive affirmations of identity—“thou art my son” (Moses 1:4, 6)—to establish a personal relationship. This contrasts sharply with Satan’s demeaning address, “Moses, son of man” (Moses 1:12), highlighting a literary opposition between divine truth and counterfeit lies.\n\nAbraham 3 employs a visionary structure, moving from a cosmic perspective of “intelligences” and “spirits” (Abraham 3:22) to the specific purpose of earth life as a testing ground (Abraham 3:25). This pattern of zooming from the eternal to the temporal invites us to see our place in God’s vast plan. These literary devices underscore the central message of divine identity and purpose, inviting us to internalize these truths.\n\n---\n\n### Prophetic Pattern Architecture: Time Collapse Analysis\nThe revelations to Moses and Abraham collapse time, showing that God’s work of redemption and covenant-making is the same yesterday, today, and forever. In Moses 1:39, the Lord declares, “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” This echoes the premortal council in Abraham 3:25, where the Lord explains the purpose of earth life: “And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” This pattern of purpose and testing is mirrored in modern revelation, as President Russell M. Nelson teaches, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity,” worldwide devotional for young adults, May 2022, Gospel Library).\n\nThis time collapse reveals that whether in premortal councils, ancient mountains, or modern devotionals, God consistently affirms our identity as His children and calls us to align our choices with His plan.\n\n---\n\n### Cross-Reference Web Matrix\nThe truths in Moses 1 and Abraham 3 weave a web of connections across the standard works, revealing hidden relationships:\n- **Divine Identity**: Moses 1:4, “Thou art my son,” connects to Psalm 82:6, “Ye are gods; and all of you are children of the most High,” and Romans 8:16–17, where we are “joint-heirs with Christ.”\n- **Premortal Existence**: Abraham 3:22–23, describing intelligences and spirits “before the world was,” aligns with Jeremiah 1:5, “Before I formed thee in the belly I knew thee,” and Doctrine and Covenants 93:29, “Man was also in the beginning with God.”\n- **God’s Work and Glory**: Moses 1:39 links to John 17:4, where Christ speaks of finishing the work given by the Father, and Doctrine and Covenants 11:20, which calls us to labor in God’s vineyard.\n- **Opposition and Testing**: Moses 1:12–26, showing Satan’s temptations, parallels Matthew 4:1–11, Christ’s temptations, and 2 Nephi 2:11, teaching the necessity of opposition.\n\nThese connections reveal a divine tapestry where our identity, purpose, and trials are interwoven across scripture, affirming God’s unchanging plan.\n\n---\n\n### Historical and Cultural Context\nWhile Moses 1 and Abraham 3 are latter-day revelations, their context ties to the ancient Near Eastern worldview of creation and divine councils. In ancient cultures, creation stories often involved councils of gods determining the fate of humanity. Abraham 3:22–28 reflects this motif but elevates it with the truth of a singular, loving God who organizes spirits for a redemptive purpose. Similarly, Moses’s confrontation with Satan in Moses 1:12–26 parallels ancient narratives of divine beings facing adversarial forces, but it uniquely emphasizes personal agency and reliance on God’s power to overcome.\n\nThis context helps us see that these revelations, while modern, resonate with ancient patterns of divine interaction, making their truths both timeless and relevant to our discipleship today as we navigate opposition and seek God’s will.\n\n---\n\n### Contradiction Resolution\nA potential tension arises between God’s affirmation of Moses as His son (Moses 1:4, 6) and Satan’s claim that Moses is merely a “son of man” (Moses 1:12). This apparent conflict reveals a profound truth: Satan seeks to diminish our divine identity by focusing on our mortal frailties. However, as Moses counters in Moses 1:13, “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten,” we learn that embracing our divine heritage empowers us to resist deception. This resolution teaches that our true identity, as affirmed by God, must take precedence over worldly or adversarial labels.\n\n---\n\n### Seminary Synthesis: Advanced Insights for Adult Study\nDrawing from the Come, Follow Me lesson insights, we can adapt teachings for deeper adult study. The lesson emphasizes that “powerful spiritual experiences do not mean we’ll never be tempted again” (Moses 1:12–26 section). For adults, this can lead to a discussion of how Satan often targets our testimonies after spiritual highs, as seen in Moses’s experience. Encourage pattern discovery by asking learners to identify similar moments in their lives or in other scriptures, such as Christ’s temptations following His baptism (Matthew 4:1–11). This synthesis reveals the pattern of opposition following revelation, preparing us to stand firm in faith.\n\n---\n\n### Teaching Applications: Escalating Stakes\nThese discussion questions build from understanding to transformation to testimony:\n1. **Understanding**: What do Moses 1:4–6 and Abraham 3:22–23 teach about your identity as a child of God? How do these truths contrast with Satan’s messages in Moses 1:12?\n2. **Transformation**: How can knowing you lived as a spirit before earth (Abraham 3:22–28) influence daily choices? What decisions might change if you prioritize your divine identity, as President Nelson suggests in “Choices for Eternity” (May 2022)?\n3. **Testimony**: Reflect on a time when recognizing your identity as a child of God helped you resist temptation or make a hard choice. How can Moses’s example in Moses 1:13–26 strengthen your resolve to trust God’s voice over Satan’s?\n\n---\n\n### Modern Prophetic Convergence\nPresident Russell M. Nelson’s teachings in the provided bundle beautifully mirror the ancient revelations in Moses 1 and Abraham 3. He declares, “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity,” worldwide devotional for young adults, May 2022, Gospel Library). This echoes God’s affirmation to Moses, “Thou art my son” (Moses 1:4). Additionally, President Nelson teaches, “The way you think about who you really are affects almost every decision you will ever make” (ibid.), aligning with the purpose of earth life as a test of obedience in Abraham 3:25. These modern words confirm the ancient pattern that knowing our divine identity shapes our mortal journey.\n\n---\n\n### Testimony Development\nAs we study these chapters and recognize patterns of divine identity, opposition, and purpose across time, our conviction in revealed truth deepens. Seeing how God consistently affirms His children—from Moses on the mount to Abraham in vision to President Nelson’s modern counsel—strengthens my faith in a loving Father who knows me personally. These patterns remind me that I am part of an eternal plan, called to a work, and equipped to overcome Satan through Christ’s power. I feel a quiet assurance that as I embrace my identity as a child of God, I can navigate life’s tests with hope and purpose.\n\n---\n\n### Additional Study\nFor further exploration of these patterns and cross-references, I recommend:\n- Reviewing “Children of God” and “Premortal Life” in Topics and Questions, Gospel Library, to deepen understanding of identity and purpose.\n- Watching “Our True Identity” and “I Am a Son of God” videos (Gospel Library) for visual reinforcement of Moses’s experiences.\n- Studying related hymns like “I Am a Child of God” (Hymns, no. 301) and “I Will Follow God’s Plan” (Children’s Songbook, 164–65) to internalize these truths through music.\n\n---\n\nMay this study guide serve as a tool to uncover the profound patterns of God’s love and plan in Moses 1 and Abraham 3. Let us approach these scriptures with open hearts, ready to see ourselves as God sees us—His beloved children with a divine destiny.",
  "generated_timestamp": "2026-01-01 00:07:09",
  "source_week_file": "cfm_2026_week_02.json"
}