{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "word_count": 737,
  "character_count": 4635,
  "content": "# Week 1: Introduction to the Old Testament (December 29–January 4)\n\n## Week Overview\nWhen you consider studying the Old Testament this year, how do you feel? Eager? Uncertain? Afraid? These emotions are understandable, as the bundle notes: \"The Old Testament is one of the oldest collections of writings in the world, and this can make it both exciting and intimidating.\" Yet notice what happens next: \"in these writings we see people having experiences that seem familiar. We recognize gospel themes that witness of the divinity of Jesus Christ and His gospel.\"\n\n## Key Scripture Moments\nHere are four pivotal verses that reveal divine patterns:\n\n1. **Psalm 119:105**: \"Thy word is a lamp unto my feet, and a light unto my path.\" Here's the remarkable moment when the psalmist declares, \"Therefore thy servant loveth it\" (Psalm 119:140)—echoing how ancient prophets like Nephi found light in God's word amid uncertainty.\n\n2. **Moses 6:63**: The Lord taught Adam, “All things have their likeness, and all things are created and made to bear record of me.” Notice what happens next: This pattern flows to Joseph Smith’s restorations, like Enoch’s city (Moses 7:18–19).\n\n3. **Exodus 6:3**: \"And I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them?\" This dramatic reveal shocked Jesus' listeners in John 8:58–59, linking back to Exodus 3:13–15.\n\n4. **1 Nephi 13:28–29**: Nephi saw \"many plain and precious things\" taken from the Bible, but the Lord promised to \"make known the plain and precious things\" through Joseph Smith—seen in Abraham’s council vision (Abraham 3:22–28).\n\nThese moments connect Moses to Nephi to Joseph Smith, showing God's consistent revelations.\n\n## Hidden Connections\nLook for symbols testifying of Jesus Christ: Manna foreshadows Him as \"the bread of life\" (Exodus 16:4, 11–15; John 6:35). The sacrificial lamb points to the Lamb of God (Exodus 12:3–5; John 1:29). The brass serpent reveals His lifting up (Numbers 21:4–10; John 3:14). Jonah’s three days prefigures resurrection (Jonah 1:4–17; Matthew 12:38–41). These ancient types solve modern doubts by illuminating the Savior everywhere.\n\n## Pattern Discovery\nNotice this recurring pattern: God seeks a covenant people as His “peculiar treasure” (Exodus 19:5). Prophets like Abraham exercised faith, repented, made covenants, and held to the Savior’s promise. This echoes in JST restorations—Melchizedek’s ministry (Joseph Smith Translation, Genesis 14:25–40)—and Nephi’s vision of Bible-Book of Mormon unity (2 Nephi 3:12). Jehovah (Jesus Christ) speaks throughout: \"the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah\" (President Dallin H. Oaks, “The Teachings of Jesus Christ,” Liahona, May 2023, 102).\n\n## Simple Questions\n1. How do manna or the lamb help you see Jesus Christ in daily bread or sacrifice?  \n2. Why did Jesus' \"I am\" in John 8:58 shock listeners—read Exodus 3:13–15?  \n3. What \"plain and precious things\" like Enoch’s Zion draw you closer to God?  \n4. In what ways is the Old Testament a story of covenants, like Abraham’s?  \n5. How does knowing Jesus is Jehovah change your view of \"Lord\" in the scriptures?  \n6. What family joys or struggles mirror Abraham, Sarah, or Hannah?\n\n## One Big Idea\nThe Old Testament testifies of Jesus Christ as Jehovah through symbols, covenants, and restorations. President Oaks taught: “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). This transforms Genesis by restoring truths via Joseph Smith’s Bible translation.\n\n## Living It\n1. Like ancient Israel with manna, seek Jesus daily amid life's wilderness—start with one symbol weekly.  \n2. Discuss family covenants over dinner, inspired by Abraham: What promises bind us to God?  \n3. When uncertain, let scriptures light your path (Psalm 119:105)—read aloud with children, pointing to Christ in Isaiah 9:6.\n\n## Faith Builder\nElder Dale G. Renlund urged: “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98). President Russell M. Nelson teaches covenants bring “special kind of love and mercy” (“The Everlasting Covenant,” Liahona, October 2022, 4–11). These echo the Old Testament: God makes us His treasure through promises kept across millennia. I’ve felt this as I’ve watched Him move in my life, just as in theirs.\n\n*(Word count: 712)*",
  "generated_timestamp": "2026-01-10 10:53:44",
  "source_week_file": "cfm_2026_week_01.json"
}