{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "word_count": 1034,
  "character_count": 6716,
  "content": "# Come, Follow Me 2026: Week 1 - Introduction to the Old Testament (December 29–January 4)\n\n## Doctrinal Foundation\nThe Old Testament unfolds layers of meaning when viewed from multiple perspectives. From the ancient writers' view, these texts capture a foreign culture with strange customs, yet they reveal people experiencing family joy, discord, faith, uncertainty, successes, and failures (Come, Follow Me—For Home and Church: Old Testament 2026). From God's view, the writings testify of Jesus Christ as the Bread of Life, with symbols like manna (Exodus 16:4, 11–15; John 6:35), the sacrificial lamb (Exodus 12:3–5; John 1:29), the brass serpent (Numbers 21:4–10; John 3:14), and Jonah (Jonah 1:4–17; Matthew 12:38–41). From our view today, these symbols resolve the mystery of an intimidating text by pointing to the Savior, nourishing faith as “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105, 140). Another mystery emerges: Who speaks as “God” or “Lord” in these records? President Dallin H. Oaks taught: “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (“The Teachings of Jesus Christ,” Liahona, May 2023, 102). This reveals Jesus Christ as Jehovah, explaining reactions to His claim “Before Abraham was, I am” (John 8:58–59; see Exodus 3:13–15; 6:3–5). A third mystery: Why were plain truths lost? Nephi saw “many plain and precious things” removed from the Bible (1 Nephi 13:21–29, 38–42), restored through Joseph Smith in books like Moses and Abraham.\n\n## Scripture Deep Dive\nAscend through six key passages, each step unveiling deeper connections.\n\n**Step 1: Symbols Bear Record** – “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). Manna foreshadows Jesus as the Bread of Life (Exodus 16:4, 11–15; John 6:35).\n\n**Step 2: The Lamb Without Blemish** – The Passover lamb points to “the Lamb of God, which taketh away the sin of the world” (Exodus 12:3–5; John 1:29), resolving how sacrifices testify of atonement.\n\n**Step 3: Lifted Up for Healing** – The brass serpent heals those who look (Numbers 21:4–10; John 3:14), mirroring faith in the Savior.\n\n**Step 4: Jonah's Three Days** – Swallowed and delivered, Jonah prefigures resurrection (Jonah 1:4–17; Matthew 12:38–41).\n\n**Step 5: Jehovah's Names** – “I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them” (Exodus 6:3; see Joseph Smith Translation footnote). This connects to Jesus' bold declaration.\n\n**Step 6: Restored Plain Truths** – Enoch’s Zion (Moses 7:18–19), Abraham’s council (Abraham 3:22–28), and Melchizedek’s ministry (Joseph Smith Translation, Genesis 14:25–40) fulfill Nephi’s prophecy (1 Nephi 13:38–42; 2 Nephi 3:12), showing Bible and Book of Mormon as companions.\n\nThese steps transform foreign text into familiar witnesses.\n\n## Historical Context\nAncient writings from one of the world’s oldest collections evoke a strange culture, yet collapse time as readers recognize universal experiences: Abraham and Sarah’s family joys and trials, Hannah’s faith amid uncertainty, Daniel’s covenant loyalty. God sought a “peculiar treasure” through covenants (Exodus 19:5), mirroring pioneer endurance and modern lives. Joseph Smith’s restorations, like the book of Moses from Genesis 1–6 and Abraham from Egyptian papyri, bridge eras, aligning ancient prophets with latter-day revelation.\n\n## Pattern Recognition Web\nThis week’s principles web across dispensations. Symbols testifying of Christ repeat: from Moses 6:63 to Old Testament types (Guide to the Scriptures, “Types or Symbols of Christ”). Jehovah as speaker patterns in Exodus 3:13–15 and President Oaks’ teaching. Lost truths restored via Joseph Smith echo Nephi’s vision (1 Nephi 13:21–29), linking to “other books” like Moses 7 and Abraham 3. Covenants bind generations: Abraham to posterity (Exodus 19:5), baptism (Mosiah 18:10, 13), temple promises. Prophetic patterns appear in Jeremiah 31:31–34, foretelling new covenants.\n\n## Discussion Framework\n1. What most people miss: Why does the Old Testament feel foreign yet familiar?  \n2. How do manna, lamb, serpent, and Jonah resolve into one testimony?  \n3. What shocks in Jesus’ “I am” claim (John 8:58–59; Exodus 3:13–15)?  \n4. From Nephi’s view, why pair Bible and Book of Mormon (2 Nephi 3:12)?  \n5. Which restored account feels most “plain and precious”?  \n6. How does knowing Jehovah is Christ change reading “Lord” passages?  \n7. What covenant promises echo in Exodus 19:5 for today?  \n8. Resolve this: Ancient sacrifices seem strange—how do they point to mercy?  \n9. What symbols in Psalm 23 or Isaiah 53:3–9 reveal the Savior?  \n10. How do these patterns anticipate the year’s covenant journey?\n\n## Gospel Connections\nPrinciples anchor in the Plan of Salvation. Symbols trace premortal council (Abraham 3:22–28) to mortality’s tests, atonement (John 1:29; Isaiah 53), and exaltation via covenants (Exodus 19:5; Jeremiah 31:31–34). Restorations like Enoch’s Zion preview celestial gathering, while baptism covenants (Mosiah 18:10, 13) link to temple paths, showing God’s “special kind of love and mercy.”\n\n## Teaching Moments\n1. Show *The Prophet Isaiah Foretells Christ’s Birth* (Harry Anderson); have children find baby Jesus, read Isaiah 7:14; 9:6 for “aha” on symbols.  \n2. Use family promises to introduce covenants; show baptism/temple pictures, tie to Mosiah 18:10, 13.  \n3. Compare names (e.g., home/work) to Jehovah’s titles (Exodus 6:3); spark wonder at Christ’s identity.  \n4. Sing “Seek the Lord Early” (Children’s Songbook, 108) or “When I Am Baptized” (103), linking to Psalm 119:105.\n\n## Personal Reflection\n- Which symbol most draws the eye to Christ this week?  \n- Where has uncertainty met faith in personal experiences, like Hannah’s?  \n- How do restored truths clarify a past scripture puzzle?  \n- What covenant step feels like God seeking a “peculiar treasure”?\n\n## Prophetic Echoes\nElder Dale G. Renlund urged to “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98), mirroring symbols’ call. President Oaks’ insight on Jehovah echoes Exodus 6:3, aligning ancient words with the risen Lord. Nephi’s restored truths parallel Joseph Smith’s revelations, as in President Russell M. Nelson’s “The Everlasting Covenant” (Liahona, October 2022, 4–11; see also).\n\nThese covenant symbols invite deeper discovery of Jesus Christ across dispensations.",
  "generated_timestamp": "2026-01-18 19:27:40",
  "source_week_file": "cfm_2026_week_01.json"
}