{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "scholarly",
  "word_count": 1397,
  "character_count": 9832,
  "content": "# Come, Follow Me 2026: Week 2 (January 5–11) - Moses 1; Abraham 3\n\n## Theological Framework\n\nWhat if the opening of the scriptures were not merely a creation account, but a divine response to profound questions about identity, purpose, and eternity? The visions in Moses 1 and Abraham 3 establish a theological framework revealing God's work as the immortality and eternal life of man (Moses 1:39). This pattern unfolds across dispensations: Moses beholds God's creations and learns, “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39). Abraham similarly discerns premortal intelligences organized for earth's probation, where “we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them” (Abraham 3:25).\n\n**Pattern Recognition Mastery**: This mirrors the foundational doctrine from Adam's era onward—God's plan centers on bringing spirits to eternal increase. Moses 1:27–39 answers Moses's plea: “Tell me … why these things are so” (Moses 1:30), emphasizing purpose over mere existence. Abraham 3:22–28 extends this, showing noble spirits chosen for mortal proving grounds. The pattern indicates divine economy: premortal council (Abraham 3:22–26), mortal probation, and eternal exaltation, identical in principle to modern revelation's emphasis on divine destiny. Immortality comes through Christ, but eternal life requires obedience, converging Moses's vision with Abraham's in a unified plan of salvation.\n\n## Language and Literary Insights\n\nThe bundle provides no specific Hebrew terms or archaeological discoveries, limiting insights to literary structures within the texts. Notice the visionary parallelism: Moses 1 begins not with “in the beginning,” but with personal encounter—“Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens” (Moses 1:36). This frames Genesis as response, creating a chiastic-like ascent from identity (Moses 1:4, 6) to purpose (Moses 1:39).\n\nAbraham 3 employs repetitive phrasing—“before the world was” (Abraham 3:22)—building to crescendo in verses 24–26, listing truths about premortal nobility. Satan’s counterfeit rhetoric in Moses 1:12–18 mimics divine declaration (“Moses, son of man, worship me”) but lacks relational depth, contrasting God's “thou art my son” (Moses 1:4). This literary foil heightens recognition of authentic revelation. The pattern indicates rhetorical precision: true divine speech affirms sonship; deception isolates.\n\n## Prophetic Patterns Across Time\n\nAcross dispensations, prophets receive visions unveiling premortal reality and mortal purpose. Moses, post-vision, queries creation's why (Moses 1:30), answered with God's glory in man's exaltation (Moses 1:39). Abraham's seer-stone vision (Abraham 3) reveals “intelligences that were organized before the world was” (Abraham 3:22), with Christ as “one among the souls” yet preeminent (implied in selection for earth-making, Abraham 3:24–26).\n\n**Generational Pattern Mapping**: This echoes pioneer sacrifices—enduring trials to “prove” faithfulness—as modern echoes of Abrahamic probation (Abraham 3:25). Revelation patterns converge: post-vision temptation (Moses 1:12–26), premortal council to mortal testing, redemption through Christ. The pattern indicates God's consistent method: reveal identity, test resolve, exalt the faithful.\n\n## Cross-Reference Web Matrix\n\n| Moses 1 / Abraham 3 Reference | Connected Scriptures | Revealed Relationship |\n|-------------------------------|---------------------|-----------------------|\n| Moses 1:4, 6 (God's affirmation of sonship) | Matthew 4:1–11 (Christ resists Satan post-baptism) | Temptation follows divine identity affirmation; both overcome by invoking God's name (Moses 1:20–22, 26). |\n| Moses 1:12–26 (Resisting Satan) | Gary E. Stevenson, “Deceive Me Not,” Ensign or Liahona, Nov. 2019, 93–96 | Counterfeits exposed; Moses rejects worship demand as Christ does. |\n| Moses 1:39 (Work and glory) | Doctrine and Covenants 11:20 (God's work: bring souls to salvation) | Links Moses's purpose to latter-day commission; eternal life vs. immortality. |\n| Abraham 3:22–28 (Premortal spirits, proving) | Topics and Questions, “Premortal Life,” Gospel Library | Noble intelligences tested; ties to “Children of God” topic. |\n| Abraham 3:25 (“prove them herewith”) | For the Strength of Youth: A Guide for Making Choices | Mortal choices echo premortal commitments. |\n\nThese webs unveil hidden ties: Moses's resistance foreshadows Christ's (Matthew 4), while Abraham's council undergirds D&C missions.\n\n## Historical and Cultural Context\n\nIn the ancient Near East milieu implied by these Joseph Smith translations, creation visions countered pagan cosmologies exalting chaos gods. Moses 1 reframes existence pre-Genesis 1:1, addressing “what was there before this ‘beginning’?” (CFM Introduction). Abraham 3:22–28 provides premortal context absent in standard Genesis, aligning with Egyptian astronomical records Joseph viewed but elevating theology.\n\n**Aha Moments**: Pioneers, like Moses, beheld visions amid trials (Saints vol. 2, ch. 12 not in bundle; limited here). The pattern indicates cultural contrasts sharpen doctrine: against satanic counterfeits mimicking idols (Moses 1:13–18), God's voice affirms universal sonship.\n\n## Reconciling Difficult Passages\n\nWhy temptation immediately after divine vision (Moses 1:12)? This appears tension between peak revelation and vulnerability. Resolution: “powerful spiritual experiences do not mean we’ll never be tempted again. In fact, one of Satan’s tactics is to tempt us to doubt these experiences” (CFM). Moses overcomes by repeated invocation—“In the name of the Only Begotten” (Moses 1:26)—progressing from fear (v. 20) to triumph.\n\nSatan's “Moses, son of man” (Moses 1:12) vs. God's “thou art my son” (Moses 1:4) reconciles as counterfeit detection: fakes lack power (Moses 1:13–18). Immortality vs. eternal life (Moses 1:39; Topics, “Eternal Life”) clarifies: universal resurrection through Christ, exaltation via obedience. Proper understanding reveals profound truth: trials affirm, not undermine, identity.\n\n## Deeper Study Notes\n\nAdapted for adults from CFM principles: Pattern discovery in Moses 1:27–39—vision scales from earth to worlds without number, culminating in personal purpose. Seminary-level: Map Moses's questions (1:36, 30) to answers (1:39; Abraham 3:24–26), noting Christ's role bridging premortal to postmortal.\n\nKey actions against Satan (Moses 1:13, 15, 18, 20–22, 26): rebuke, depart, command, invoke Christ. Abraham 3:22–28 list-making exercise reveals self as spirit, Christ as Redeemer, earth as proving ground. Emphasize: “make a list of truths you find—including truths about yourself and about Jesus Christ” (CFM). This pattern indicates layered obedience from premortal choice to daily discipleship.\n\n## Teaching Applications\n\n**Escalating Stakes Discussion Questions**:\n\n1. **Understanding**: What differences emerge comparing God’s words in Moses 1:4, 6 with Satan’s in Moses 1:12? How does President Russell M. Nelson teach, “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity” [worldwide devotional for young adults, May 2022], Gospel Library)?\n\n2. **Transformation**: List choices shaped by “I am a child of God” over other labels, as Nelson adds, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”). Act out Moses 1:12–26 resistances at family dinner.\n\n3. **Testimony**: How does Abraham 3:25’s “prove them herewith” change responses to temptation? Practice with children using mirrors: “You are a child of God” (Moses 1:4), drawing premortal scenes to “I Will Follow God’s Plan” (Children’s Songbook, 164–65).\n\nFor youth: Debate counterfeits (artificial plant analogy) vs. authentic power (Moses 1:24–26).\n\n## Modern Prophetic Convergence\n\nContemporary prophets mirror these visions precisely. President Nelson emphasizes identity preceding choices: “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” and “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”). This converges with Moses 1:4, 6 against Satan's doubt (Moses 1:12).\n\nGary E. Stevenson’s “Deceive Me Not” (Ensign or Liahona, Nov. 2019, 93–96) echoes Moses 1:13–18 counterfeits. No further quotes in bundle, but pattern indicates unbroken line: ancient visions inform today's call to celestial thinking.\n\n## Testimony Development\n\nDeep study of these patterns—for instance, premortal nobility (Abraham 3:22–28) to mortal proving—forges unshakeable conviction. Recognizing Satan’s post-vision assault (Moses 1:12–26) as universal prepares us: Moses's triumph via Christ's name builds faith in personal resistance. Listing truths from Abraham 3 transforms abstract doctrine into lived reality, affirming divine sonship amid trials. This pattern recognition reveals God's unchanging hand, strengthening resolve that we, as His children, share Moses's destiny.\n\n## Additional Study\n\nExplore bundle resources: “Choices for Eternity” section “First: Know the truth about who you are”; Topics and Questions, “Children of God,” “Eternal Life,” “Premortal Life”; videos “Our True Identity,” “I Am a Son of God”; Hymns no. 301 “I Am a Child of God”; Gospel Art Book nos. 13–16; Old Testament Stories, pages 64–84. For patterns, map Abraham 3:22–28 phrases (“before the world was,” “spirits,” “prove”) across Liahona, For the Strength of Youth, Friend magazines. Practice family lists of premortal truths for cross-reference discovery.\n\n(Word count: 1428)",
  "generated_timestamp": "2026-01-10 10:55:58",
  "source_week_file": "cfm_2026_week_02.json"
}