{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "essential",
  "word_count": 756,
  "character_count": 4586,
  "content": "# Come Follow Me 2026 Study Guide: Week 2 (January 5–11) - Moses 1; Abraham 3\n\n## Week Overview\nWhat was there *before* the beginning, and why did God create all of this? The accounts in Moses 1 and Abraham 3, revealed through the Prophet Joseph Smith, pull back the veil on our premortal existence and God’s divine purposes. These chapters set the stage for the entire Old Testament by answering fundamental questions: Who is God? Who are we? And what is our place in His eternal plan?\n\n## Key Scripture Moments\n1. **Moses 1:4, 6 - God Reveals Moses’s Divine Identity**  \n   Notice the powerful declaration God makes to Moses: “And, behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands” (Moses 1:4). Here’s the remarkable moment when Moses learns he is a child of God, a truth echoed across time to Nephi (see 1 Nephi 17:36) and Joseph Smith (see Joseph Smith—History 1:17).\n   \n2. **Moses 1:12 - Satan’s Counterfeit Attack**  \n   Notice what happens next when Satan confronts Moses: “Moses, son of man, worship me” (Moses 1:12). Unlike God’s affirming words, Satan seeks to diminish Moses’s identity. This pattern of distortion mirrors temptations faced by Christ (see Matthew 4:3-6) and us today.\n   \n3. **Moses 1:39 - God’s Work and Glory**  \n   Here’s the stunning purpose behind all creation: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39). This principle connects to Abraham’s vision (Abraham 3:24-26) and modern revelation about our divine potential.\n\n## Hidden Connections\n- **Moses 1:4 and Abraham 3:22-23**: Both reveal our identity as children of God, existing as spirits “before the world was” (Abraham 3:22). This truth solves modern identity crises by grounding us in an eternal perspective—our worth isn’t defined by worldly labels but by divine parentage.\n- **Moses 1:12-15 and Matthew 4:1-11**: Satan’s tactics with Moses—doubt and deception—mirror his temptations of Jesus. Recognizing this pattern helps us detect counterfeits in today’s world, like false sources of happiness or worth.\n\n## Pattern Discovery\nNotice this pattern: God consistently affirms our divine nature (Moses 1:4, Abraham 3:22), while Satan distorts it (Moses 1:12). This becomes powerful when we see it across dispensations—from Moses to Christ to President Nelson’s teachings today. Each prophet is reminded of their identity to combat the adversary’s lies, showing us how to stand firm in our own battles.\n\n## Simple Questions\n1. How does God’s declaration in Moses 1:4, “thou art my son,” change the way you see yourself?\n2. What differences do you notice between God’s words in Moses 1:6 and Satan’s in Moses 1:12?\n3. How does knowing you lived as a spirit “before the world was” (Abraham 3:22) influence your daily choices?\n4. What counterfeits of truth do you see in the world, and how can Moses 1:13-18 help you reject them?\n5. Why do you think God’s ultimate purpose in Moses 1:39 centers on *your* eternal life?\n6. How does Jesus Christ’s role in Abraham 3:24-26 connect to God’s plan for you personally?\n\n## One Big Idea\nThe central truth of this week is found in Moses 1:39: God’s work and glory is to bring about our immortality and eternal life. Historically, this revelation to Moses reframes the entire Creation narrative—not as a mere act of power, but as an expression of divine love for His children. This suggests that every aspect of God’s plan, from premortal life to the Atonement, is designed to help us return to Him.\n\n## Living It\n1. **Affirm Your Identity**: Like Moses, remind yourself daily, “I am a child of God.” Write it somewhere visible or share it with a family member to counter negative self-talk.\n2. **Resist Counterfeits**: Identify one modern temptation (like seeking validation online) and use Moses’s example—prayer and testimony (Moses 1:18)—to stand firm.\n3. **Focus on Eternal Goals**: Reflect on God’s purpose in Moses 1:39 and set one small goal this week (like family prayer) that aligns with gaining eternal life.\n\n## Faith Builder\nPresident Russell M. Nelson’s words echo these ancient truths: “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity,” worldwide devotional for young adults, May 2022, Gospel Library). His teaching reinforces Moses 1:4 and Abraham 3:22, urging us to prioritize our divine identity above all else. I feel the Spirit confirming that as we embrace this truth, we draw closer to God and find strength to overcome any challenge.",
  "generated_timestamp": "2026-01-01 00:05:40",
  "source_week_file": "cfm_2026_week_02.json"
}