{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "study_level": "connected",
  "word_count": 1028,
  "character_count": 7034,
  "content": "# Come, Follow Me 2026: Week 3 - Genesis 1–2; Moses 2–3; Abraham 4–5\n\n## Doctrinal Foundation\nFrom God's view, as revealed in these accounts, Creation is an act of divine organization from chaos: the earth was “without form, and void” and “empty and desolate” (Genesis 1:2; Abraham 4:2). He speaks light into existence, separating and ordering elements through His Only Begotten (Moses 2:1–25). From Moses' view, this mirrors the Savior's role: “By mine Only Begotten I created these things” (Moses 2:1, implied in the parallel accounts). From our view as His children, it reveals our potential: “created in God’s image, after His likeness” (Genesis 1:26), transforming emptiness into exaltation. What seems chaotic in life becomes magnificent under Their hands, as “Heavenly Father and Jesus Christ are Creators, and Their creative work with us is not finished.”\n\n## Scripture Deep Dive\nThese accounts escalate from cosmic order to personal identity, revealing God's methodical power.\n\n1. **Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25**: God reveals Creation's phases, teaching us about Him, Christ, the world, and ourselves. Light pierces void first, a pattern of divine priority on enlightenment.\n\n2. **Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27**: “Let us make man in our image, after our likeness”—male and female, emphasizing divine parentage. This counters self-doubt: ponder how it affects how you see yourself and others.\n\n3. **Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18**: Adam and Eve united, modeling sacred marriage: “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87).\n\n4. **Genesis 1:28; Moses 2:28; Abraham 4:28**: Stewardship command: “Be fruitful, and multiply, and replenish the earth, and subdue it”—responsibility to care for creations (see D&C 59:16–21; 104:13–18).\n\n5. **Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3**: Seventh day sanctified, a rhythm of rest amid labor, blessed by God.\n\n6. **Escalating Connection**: This pattern appears in Moses' preface (Moses 2), then Abraham's Gods (Abraham 4–5), echoing Christ's role across Pearl of Great Price. Cultural context: ancient views saw creation as battle; here, it's peaceful organization, transforming our chaos into light (D&C 101:32–34).\n\n7. **Genesis 1:2 vs. Ordered Beauty**: Apparent void resolves into majesty, like Mosiah 3:19's natural man yielding to divine image.\n\n## Historical Context\nImagine the ancient world: Genesis opens with formless waste, yet God organizes purposefully. Moses and Abraham expand this, received through prophets amid exile and revelation (see “Genesis” in the Bible Dictionary). Time collapses when we read amid nature: “consider reading these verses while out among God’s creations.” Pioneers echoed this, turning desolate valleys into temples of life, mirroring God's work from “empty and desolate” (Abraham 4:2) to flourishing stakes today.\n\n## Pattern Recognition Web\n- **Creation to Stewardship**: Genesis 1:28 links to D&C 104:13–18 (servants over possessions); pattern in Caussé: “Our Earthly Stewardship” (Liahona, Nov. 2022).\n- **Image of God**: Genesis 1:26–27 cross-references Ether 12:27 (weakness to strength); Mosiah 3:19 (natural man put off).\n- **Sabbath Sanctification**: Genesis 2:2–3 parallels D&C 59:9–13; prophetic rhythm from Eden to “The Sabbath Is a Delight” video.\n- **Marriage Ordinance**: Genesis 2:18–25 to 1 Corinthians 11:11; “The Family: A Proclamation to the World.”\n- **Generational Link**: Pioneer journals reflect replenishing earth (Saints vol. 1 implied in stewardship), connecting to our era's conservation (Topics: “Environmental Stewardship”).\n\nThis web suggests God's consistent pattern: organize, create in His image, rest, steward across dispensations.\n\n## Discussion Framework\n1. What most people miss: Why three accounts (Genesis, Moses, Abraham)? What unique truths emerge?\n2. How does “without form, and void” (Genesis 1:2) feel in your life?\n3. From God's Greatest Creation video: How does President Nelson describe the body differently from the world?\n4. Contradiction: If in God's image, why improve (Mosiah 3:19; Ether 12:27)?\n5. Mystery: What does “us” in Genesis 1:26 reveal about Godhead?\n6. Marriage sacredness: How does Nelson's quote on Adam and Eve elevate it?\n7. Stewardship: D&C 59:16–21—what surprises you?\n8. Sabbath: What makes it “blessed” personally (Genesis 2:2–3)?\n9. Application: “Because I know I am created in God’s image, I choose to…”?\n10. Profound: How does Creation transform self-view eternally?\n\n## Gospel Connections\nCreation ties to Plan of Salvation: premortal council (Abraham 4:1, Gods organize), mortal probation (stewardship, marriage), Sabbath foretaste of exaltation. Parallels: spirit creation (Genesis 1:26–27) to physical (Moses 2:27), like premortal to mortal life. “They can transform us into the divine beings we were meant to be”—echoing eternal progression, body as “magnificent gift” (Nelson, Liahona, Aug. 2019).\n\n## Teaching Moments\n1. **Nature Walk Aha**: Search for Creation days' elements outside (Teaching Children); link to “My Heavenly Father Loves Me” (CS 228–29)—hidden connection: child's wonder mirrors Eden reverence.\n2. **Mirror Puzzle**: Children see image in mirror (Moses 2:26–27), assemble body puzzles—resolves body negativity with sacredness (For the Strength of Youth, 22–29).\n3. **Sabbath Role-Play**: Act explaining Genesis 2:2–3 to a friend—generational tie to pioneers honoring rest amid toil.\n4. **Video Share**: Watch “God’s Greatest Creation”; testify: Christ's creative power shines in us.\n\n## Seminary Synthesis\nFrom Old Testament Stories (8–12, “The Creation of the Earth”): Insight 1—Jesus as Creator sparks feelings about Him, pattern for teachers: use pictures for visual learners. Insight 2—each Creation period builds chronologically, adapting for timelines showing God's order. Insight 3—link to hymns like “All Creatures of Our God and King” (Hymns, 62) reveals musical patterns deepening testimony.\n\n## Personal Reflection\n- Trace a “void” moment God organized in your life—echoing Genesis 1:2?\n- How has knowing “created in God’s image” (Genesis 1:26) shifted self-treatment?\n- What Creation element reminds you of Christ's love weekly?\n- In stewardship (Genesis 1:28), what one act honors Him tomorrow?\nI bear testimony that pondering these truths has drawn me nearer to the Creators who formed us for glory.\n\n## Prophetic Echoes\nModern voices mirror ancient: President Nelson testifies in “God’s Greatest Creation” of the “miraculous human body,” echoing Genesis 1:26–27's image. His “Lessons from Eve” (Ensign, Nov. 1987, 87) parallels Abraham 5:14–18's eternal marriage. Caussé's “Our Earthly Stewardship” (Liahona, Nov. 2022) reflects Genesis 1:28's care. Nelson again: “Your Body: A Magnificent Gift to Cherish” (Liahona, Aug. 2019, 50–55)—striking parallel to transforming void into divine potential.\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-10 22:37:50",
  "source_week_file": "cfm_2026_week_03.json"
}