{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "word_count": 1166,
  "character_count": 8127,
  "content": "# Come, Follow Me 2026: Week 1 – Introduction to the Old Testament\n\n## Doctrinal Architecture: Three-Lens Analysis\n\n**Ancient Context**: The Old Testament emerges from an ancient culture presenting both foreign elements and familiar gospel themes, where figures like Abraham, Sarah, Hannah, and Daniel navigated family dynamics, faith, repentance, covenants, and the promise of a Savior. Symbols such as manna (Exodus 16:4, 11–15), the sacrificial lamb (Exodus 12:3–5), the brass serpent (Numbers 21:4–10), and Jonah (Jonah 1:4–17) bear record of divine patterns.\n\n**Modern Application**: These ancient witnesses align with Restoration revelations, restoring \"plain and precious things\" through the book of Moses, book of Abraham, and Joseph Smith Translation, including Enoch’s city of Zion (Moses 7:18–19), Abraham’s vision of the council in heaven (Abraham 3:22–28), and Melchizedek’s ministry (Joseph Smith Translation, Genesis 14:25–40). Covenants position individuals as God’s “peculiar treasure” (Exodus 19:5).\n\n**Eternal Principle**: All things bear record of Jesus Christ, who is Jehovah, as the Father commands to “hear Him,” with scriptural words of “God” or “Lord” denoting Jehovah, the risen Lord, Jesus Christ.\n\n## Exegetical Analysis: Textual Archaeology\n\nDelving into key passages uncovers layered meanings through prophetic types and Restoration clarifications.\n\n1. **Psalm 119:105, 140**: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it.” This psalmist declaration frames the Old Testament as illuminating divine guidance amid ancient unfamiliarity.\n\n2. **Exodus 16:4, 11–15; John 6:35, 48**: Manna prefigures the Bread of Life, revealing sustenance from Jehovah.\n\n3. **Exodus 12:3–5; John 1:29**: The sacrificial lamb symbolizes the Lamb of God, pointing to Atonement.\n\n4. **Numbers 21:4–10; John 3:14**: The brass serpent typifies healing through faith in the lifted Son of Man.\n\n5. **Jonah 1:4–17; Matthew 12:38–41**: Jonah’s three days in the fish foreshadows resurrection.\n\n6. **Moses 6:63**: “All things have their likeness, and all things are created and made to bear record of me,” unveiling universal symbolism.\n\n7. **Exodus 3:13–15; 6:3–5; John 8:58–59**: Jehovah’s name “I AM” identifies the premortal Christ, shocking Jewish leaders.\n\n8. **1 Nephi 13:21–29, 38–42; 2 Nephi 3:12**: Plain and precious truths removed from the Bible are restored, with Bible and Book of Mormon uniting as one.\n\n9. **Exodus 19:5**: God seeks a “peculiar treasure” through covenant, echoed in Jeremiah 31:31–34.\n\n10. **Isaiah 7:14; 9:6; Psalm 23; Isaiah 53:3–9**: Prophetic depictions of the Savior’s birth, shepherding, and suffering.\n\nThese layers, clarified by Joseph Smith Translation (e.g., Exodus 6:3 footnote), reveal Christocentric depth.\n\n## Historical & Cultural Matrix\n\nThe Old Testament, among the world’s oldest writings, reflects an ancient Near Eastern milieu of familial joys, discords, faith trials, and covenant-making. Practices like sacrifices and manna distribution were culturally embedded yet prophetically symbolic, bridging to Jehovah’s meridian ministry. Temporal bridges extend to Restoration accounts, such as Enoch’s Zion (Moses 7:18–19), paralleling modern gathering, and Abraham’s premortal council (Abraham 3:22–28), illuminating eternal identities amid ancient Egyptian papyri contexts.\n\n## Cross-Reference Web Matrix\n\n**SCHOLARLY CROSS-REFERENCE WEB MATRIX**  \n*Doctrinal Threads Across Dispensations*\n\n**Primary Pattern**: Jesus Christ as Jehovah, Testified through Symbols and Covenants  \n├─ **Ancient Foundations** (Genesis through Malachi)  \n│   ├─ Exodus 16:4, 11–15: Manna from heaven  \n│   ├─ Exodus 12:3–5: \"Your lamb shall be without blemish\"  \n│   └─ Prophetic type/symbol: Brass serpent (Numbers 21:4–10) lifted for healing  \n│  \n├─ **Meridian Fulfillment** (New Testament parallels)  \n│   ├─ Christ's teaching: \"I am the bread of life\" (John 6:35, 48)  \n│   ├─ Apostolic witness: \"Behold the Lamb of God\" (John 1:29)  \n│   └─ Gospel fulfillment: \"As Moses lifted up the serpent... even so must the Son of man be lifted up\" (John 3:14)  \n│  \n├─ **Restoration Revelation** (D&C/Pearl of Great Price)  \n│   ├─ Modern revelation: \"All things have their likeness, and all things are created and made to bear record of me\" (Moses 6:63)  \n│   ├─ Joseph Smith insight: Restored Enoch’s city (Moses 7:18–19); Abraham’s council (Abraham 3:22–28)  \n│   └─ Latter-day application: Plain and precious things make Bible and Book of Mormon \"one\" (1 Nephi 13:28; 2 Nephi 3:12)  \n└─ **Living Prophets** (From bundle sources only)  \n    ├─ President Dallin H. Oaks, “The Teachings of Jesus Christ,” Liahona, May 2023, 102: “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ”  \n    ├─ Elder Dale G. Renlund, “Jesus Christ Is the Treasure,” Liahona, Nov. 2023, 98: “remember and always focus on Jesus Christ”  \n    └─ Modern application: Covenants as God’s “peculiar treasure” (Exodus 19:5); see also President Russell M. Nelson, “The Everlasting Covenant” (Liahona, October 2022, 4–11)\n\n## Theological Discussion Points: Socratic Progression\n\n1. What symbols in Exodus 16 and 12 first appear as literal provisions yet reveal eternal sustenance?  \n2. How does Moses 6:63 transform reading unfamiliar ancient texts?  \n3. Why did “I am” in John 8:58–59 echo Exodus 3:14 so provocatively?  \n4. In what ways do 1 Nephi 13:26–28 and 2 Nephi 3:12 depict scriptural restoration?  \n5. How does Exodus 19:5 frame the Old Testament as covenant narrative?  \n6. What typological links bind Jonah 1:17 to Matthew 12:40?  \n7. How do JST expansions like Moses 7:18–19 enrich Genesis silences?  \n8. What covenant promises in Jeremiah 31:31–34 anticipate inward transformation?  \n9. How does recognizing Jehovah unify Old Testament theophanies?  \n10. In studying Isaiah 53:3–9 alongside Psalm 23, what Atonement facets emerge?  \n11. How do baptism covenants (Mosiah 18:10, 13) echo ancient temple themes?  \n12. What personal covenant-keeping flows from these dispensational patterns?\n\n## Modern Prophetic Synthesis: Then and Now\n\nAncient symbols (manna, lamb) find meridian fulfillment in Christ’s declarations (John 6:48; 1:29), restored plainly via Joseph Smith (Moses 6:63). President Oaks clarifies: words of “God” or “Lord” denote Jehovah (Liahona, May 2023, 102). Elder Renlund urges focus on this Treasure (Liahona, Nov. 2023, 98). Covenants then (Exodus 19:5) mirror now, as in Nelson’s message (see Liahona, Oct. 2022, 4–11), binding dispensations.\n\n## Seminary & Institute Integration\n\nSeminary patterns highlight Christ as Jehovah (Exodus 6:3, JST footnote), with Institute manuals expanding types like the brass serpent, fostering deeper prophetic fulfillment arcs across Genesis–Malachi.\n\n## Teaching Applications\n\nEmploy reverent discovery: Display images like *Adam and Eve Offering Sacrifices* or *The Prophet Isaiah Foretells Christ’s Birth*, inviting symbol identification (Isaiah 7:14; 9:6). For children, contrast names (Exodus 6:3) with modern aliases, singing “Seek the Lord Early” (Children’s Songbook, 108). In groups, map covenant paths from Abraham to baptism (Mosiah 18:10).\n\n## Personal Study Pathways\n\n**Foundation**: Read Psalm 119:105–140; note Christ symbols.  \n**Synthesis**: Compare Exodus 3:14 with John 8:58; trace JST restorations.  \n**Covenant Depth**: Study Exodus 19:5 alongside Jeremiah 31:31–34; journal applications.  \n**Advanced**: Chart 1 Nephi 13 with bundle examples (Moses 7; Abraham 3).\n\n## Research Extensions\n\nConsult Guide to the Scriptures, “Types or Symbols of Christ”; *Teaching in the Savior’s Way*, 7; Liahona issues. Method: Catalog symbols weekly, cross-referencing JST footnotes for plain truths.\n\nThese introductory covenantal patterns, spanning ancient symbols to living revelation, invite scholarly pursuit of Jehovah’s unifying witness across dispensations.",
  "generated_timestamp": "2026-01-18 19:28:22",
  "source_week_file": "cfm_2026_week_01.json"
}