{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "word_count": 1584,
  "character_count": 10060,
  "content": "# Come, Follow Me 2026 Old Testament Study Guide  \n## Week 1: December 29–January 4 - Introduction to the Old Testament  \n\nWelcome, dear friends, to a year of discovery in the Old Testament! As we embark on this sacred journey, let’s open our hearts to the ancient voices that testify of Jesus Christ, our covenant relationship with God, and the timeless patterns of His love. I’ve spent decades poring over these scriptures, and I’m thrilled to share insights that can illuminate your path. Let’s dive into the richness of this week’s introduction with a spirit of curiosity and faith, knowing that “Thy word is a lamp unto my feet, and a light unto my path” (Psalm 119:105).\n\n---\n\n## Doctrinal Foundation  \nThe Old Testament is a testament of Jesus Christ and God’s covenant with His people. Let’s explore this foundation from multiple perspectives to uncover layers of meaning:  \n- **From the perspective of ancient Israel**: The Old Testament was their history, law, and lifeline to God. They saw Jehovah as their Deliverer, the voice of God speaking through prophets and miracles (Exodus 3:13–15).  \n- **From the perspective of Jesus Christ (Jehovah)**: As President Dallin H. Oaks taught, “the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). Christ Himself was guiding Israel, revealing His identity as “I am” long before His mortal ministry (John 8:58–59).  \n- **From our modern perspective**: We see the Old Testament as a witness of Christ’s mission and a guide to understanding covenants. It’s a bridge connecting ancient promises to our lives today through restored truths (1 Nephi 13:38–42).  \n\nThese perspectives converge on one truth: the Old Testament is a living record of God’s unchanging plan, pointing us to the Savior and inviting us into covenant with Him.\n\n---\n\n## Scripture Deep Dive  \nLet’s explore 6 key passages with escalating connections to transform our understanding of the Old Testament’s witness of Christ and covenants:  \n1. **Psalm 119:105** - “Thy word is a lamp unto my feet, and a light unto my path.” This sets the tone for our study, showing scripture as a guide. This pattern of light appears in Moses (Moses 6:63), then in Christ’s teachings (John 8:12), and in modern revelation (D&C 84:45).  \n2. **Exodus 16:4, 11–15** - Manna as a type of Christ. God provides daily bread, just as Jesus declares, “I am the bread of life” (John 6:35). This symbol of sustenance connects to the sacrament today.  \n3. **Exodus 12:3–5** - The sacrificial lamb prefigures Christ, “the Lamb of God, which taketh away the sin of the world” (John 1:29). This pattern of atonement echoes through Isaiah 53 and into our understanding of the Atonement.  \n4. **Numbers 21:4–10** - The brass serpent, lifted up for healing, mirrors Christ’s crucifixion: “So must the Son of man be lifted up” (John 3:14). This visual symbol connects to faith in Christ across dispensations.  \n5. **Jonah 1:4–17** - Jonah’s three days in the whale foreshadows Christ’s resurrection (Matthew 12:38–41). This pattern of death and renewal appears in Joseph Smith’s teachings on resurrection (D&C 138).  \n6. **Exodus 19:5** - God’s covenant promise to make Israel a “peculiar treasure” reveals His desire for relationship. This covenant theme stretches from Abraham to Jeremiah (Jeremiah 31:31–34) and into our temple covenants today.  \n\n**Cultural Context Insight**: Archaeological evidence of ancient Near Eastern covenant practices, such as cutting animals in half to symbolize binding agreements (Genesis 15), shows how tangible and serious covenants were to ancient peoples. This transforms our understanding of God’s “everlasting covenant” as a deeply personal bond (Liahona, October 2022, 4–11).\n\n---\n\n## Historical Context  \nThe Old Testament emerges from a world of nomadic tribes, powerful empires, and sacred rituals spanning over a millennium. Written in Hebrew, Aramaic, and some Greek, these texts reflect cultures from Mesopotamia to Egypt, where gods were tied to nature and kings ruled as divine agents. Israel’s unique monotheism—worshipping Jehovah alone—set them apart, often leading to conflict with surrounding nations. This backdrop creates “time collapse moments”: when we read of Abraham’s faith amid uncertainty, we feel our own struggles mirrored. When Israel wanders in the wilderness, we see our journey to the promised land of discipleship. Understanding this ancient context—where covenants were public, binding agreements—helps us grasp why God’s promises to Israel are so central to their identity and ours (Exodus 19:5).\n\n---\n\n## Pattern Recognition Web  \nThe Old Testament’s themes weave a web of prophetic patterns across dispensations:  \n- **Christ as Jehovah**: Seen in Exodus 3:13–15, fulfilled in John 8:58, and clarified by President Oaks (Liahona, May 2023, 102).  \n- **Covenant Relationship**: From Exodus 19:5 to Jeremiah 31:31–34, mirrored in Mosiah 18:10 and modern temple ordinances.  \n- **Symbols of Christ**: Manna (Exodus 16), the lamb (Exodus 12), and the serpent (Numbers 21) connect to Christ’s teachings (John 6:35) and modern sacrament worship.  \n- **Restoration of Truths**: Nephi’s vision of lost “plain and precious things” (1 Nephi 13:21–29) links to Joseph Smith’s work in Moses 7 and Abraham 3.  \n- **Faith Amid Struggle**: Israel’s journey parallels Lehi’s family (1 Nephi 2), the pioneers (Saints vol. 1, ch. 12), and our modern challenges.  \nThis web suggests that God’s patterns of deliverance, covenant, and redemption are eternal, inviting us to see His hand in every era.\n\n---\n\n## Discussion Framework  \nLet’s build anticipation for deeper insights with these 8 questions:  \n1. What most people miss: How does knowing Jesus Christ is Jehovah (Exodus 3:13–15) change the way you read the Old Testament?  \n2. Why were the Jews shocked by Christ’s declaration, “Before Abraham was, I am” (John 8:58)?  \n3. How do symbols like manna or the brass serpent (Exodus 16, Numbers 21) deepen your appreciation for Christ’s mission?  \n4. What “plain and precious things” restored by Joseph Smith (Moses 7:18–19) stand out to you, and why?  \n5. How do ancient covenants (Exodus 19:5) connect to promises you’ve made with God?  \n6. What family joys or struggles in the Old Testament feel familiar to your life?  \n7. How does the Old Testament’s witness of Christ strengthen your faith in modern revelation?  \n8. What can we learn from Israel’s persistence in faith despite failures that applies to our discipleship today?  \n\n---\n\n## Gospel Connections  \nThe Old Testament ties directly to the Plan of Salvation through symbols and covenants. The sacrificial lamb (Exodus 12:3–5) points to Christ’s Atonement, a central pillar of our redemption. The covenant with Abraham (Genesis 17) mirrors the premortal council (Abraham 3:22–28), showing God’s plan from the beginning. Surprisingly, this connects to Alma’s teaching on foreordination (Alma 13:3–5), revealing that God’s covenant people were chosen before the foundation of the world. These parallels show the Old Testament as a roadmap of the plan—creation, fall, atonement, and eternal life—all centered on Christ.\n\n---\n\n## Teaching Moments  \nHere are 4 ways to share these discoveries with “aha moments”:  \n1. **Symbol Hunt**: Invite family or class to find Christ in Old Testament symbols (like manna or the lamb) and connect them to New Testament fulfillments (John 6:35). Watch their eyes light up!  \n2. **Covenant Connection**: Share how ancient covenants (Exodus 19:5) are like modern baptism or temple promises. Ask, “What promises do we make with God today?”  \n3. **Jehovah Reveal**: Highlight President Oaks’ teaching (Liahona, May 2023, 102) that Jehovah is Christ. Discuss how this changes reading “the Lord” in scripture.  \n4. **Restoration Wonder**: Compare Genesis 1 with Moses 7 to show restored truths. Ask, “What do we learn about God’s plan that we didn’t know before?”  \n\n---\n\n## Seminary Synthesis  \nFrom the Seminary manual, two insights stand out for deeper study:  \n1. **Christ in Symbols**: The manual emphasizes types of Christ (like the brass serpent) as teaching tools. Teachers can expand by linking to modern prophetic teachings on symbols (Liahona, Nov. 2023, 98).  \n2. **Covenant Focus**: The manual highlights covenants as God’s way of drawing us close. Teachers can connect this to President Nelson’s “The Everlasting Covenant” (Liahona, October 2022, 4–11) for profound application.  \n\n---\n\n## Personal Reflection  \nTake a quiet moment to ponder: How have you seen God’s hand in your life like He guided Israel? What covenant promises give you hope amid uncertainty? As you begin this Old Testament journey, what do you hope to discover about Jesus Christ in these ancient pages? I’ve found that reflecting on these questions often brings personal revelation, and I pray it will for you too.\n\n---\n\n## Prophetic Echoes  \nModern prophetic teachings mirror ancient revelations in striking ways:  \n- **Elder Dale G. Renlund** taught, “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98). This echoes the Old Testament’s symbols of Christ, urging us to seek Him in every story.  \n- **President Dallin H. Oaks** clarified, “the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102), connecting directly to Exodus 3:13–15 and deepening our understanding of Christ’s pre-mortal role.  \n- **President Russell M. Nelson** in “The Everlasting Covenant” (Liahona, October 2022, 4–11) emphasizes covenants as central to God’s plan, reflecting the promises in Exodus 19:5 and inviting us to see ourselves as covenant Israel today.  \n\n---\n\nAs we begin this sacred study, I bear witness that the Old Testament is a treasure trove of God’s love and Christ’s reality. May we approach it with open hearts, ready to see His hand in ancient and modern times alike. Let’s walk this path together, finding light in every verse.",
  "generated_timestamp": "2026-01-01 00:04:20",
  "source_week_file": "cfm_2026_week_01.json"
}