{
  "week_number": 17,
  "date_range": "Exodus 19–20",
  "title": ";24;31–34",
  "primary_scriptures": [
    {
      "book": "Exodus",
      "chapters": [
        "19",
        "20"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Exodus",
      "chapters": [
        "19",
        "20"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;24;31–34 ---\nAlthough the children of Israel had murmured and wavered in the past, when Moses read the law at the foot of Mount Sinai, they made this covenant: “All that the Lord hath said will we do, and be obedient” (\nExodus 24:7\n). God then called Moses onto the mountain, telling him to build a tabernacle so “that I may dwell among them” (\nExodus 25:8\n).\nBut while Moses was at the top of the mountain learning how the Israelites could have God’s presence among them, the Israelites were at the bottom of the mountain making a golden idol to worship instead. Soon after promising to “have no other gods,” they “turned aside quickly” from their promise (\nExodus 20:3\n;\n32:8\n; see also\nExodus 24:3\n). It was a surprising turn, but we know from experience that faith and commitment can sometimes be overcome by impatience, fear, or doubt. As we seek the Lord’s presence in our lives, it is encouraging to know the Lord did not give up on ancient Israel and He will not give up on us and the people we love—for He is “merciful and gracious, longsuffering, and abundant in goodness and truth” (\nExodus 34:6\n).\nIdeas for Learning at Home and at Church\nExodus 19:3–6\nThe Lord’s covenant people are a treasure to Him.\nPresident Russell M. Nelson taught: “In the Old Testament, the Hebrew term from which\npeculiar\nwas translated is\nsegullah\n, which means ‘valued property,’ or ‘treasure.’ … For us to be identified by servants of the Lord as his\npeculiar\npeople is a compliment of the highest order” (“\nChildren of the Covenant\n,”\nEnsign\n, May 1995, 34). How do President Nelson’s words affect the way you understand\nExodus 19:3–6\n? How has the Lord shown you that He treasures you?\nExodus 19:10–11, 17\nSacred experiences require preparation.\nThe Lord told Moses that the children of Israel needed to be prepared before they could “meet with God” (\nExodus 19:10–11, 17\n) and keep a covenant with Him (see\nExodus 19:5\n). How do you prepare for spiritual experiences, including the sacrament and temple ordinances? How can you help others prepare? What do you learn about preparation from\nLuke 6:12–13\n;\nEnos 1:2–6\n;\nAlma 17:2–3\n?\nThis mountain in Egypt is traditionally believed to be Mount Sinai.\nExodus 20:1–17\nObedience to God’s commandments brings blessings.\nWhile the Israelites were gathered at the base of Mount Sinai, they heard the voice of God give the Ten Commandments (see\nDeuteronomy 4:12–13\n). These, of course, aren’t God’s only commandments—there are many others in the scriptures. So as you read\nExodus 20:1–17\n, ask yourself why God emphasized these ten in particular. Here’s a sample table you could use as you ponder the importance of the Ten Commandments in your life:\nCommandment\nIn other words, the Lord is asking me to …\nBlessings that come from living this commandment\nHow does keeping these ten commandments help you keep the two great commandments Jesus gave in\nMatthew 22:34–40\n?\nWhat are things that you may be tempted to put before God? What blessings have you seen from putting God first?\nHow would you respond to someone who says the Ten Commandments were given a long time ago and do not apply today? What examples from your life would you share as part of your response? How might the hymn “\nHow Gentle God’s Commands\n” (\nHymns\n, no. 125) affect the way you explain God’s commandments to others?\nHow has the Lord fulfilled the promise in\nExodus 20:6\nin your life?\nSee also “\nThe Great Commandment—Love the Lord\n,” in\nTeachings of Presidents of the Church: Ezra Taft Benson\n(2014), 37–45; Dallin H. Oaks, “\nNo Other Gods\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 72–75; Topics and Questions, “\nCommandments\n,” Gospel Library.\nExodus 24:1–11\nMaking covenants shows my willingness to obey God’s law.\nAs you read\nExodus 24:3–8\n, consider the covenants you have made with God. While Israel’s covenant included rituals that are different from what God requires today, you may notice some similarities. For example,\nverses 4, 5, and 8\nmention an altar, animal sacrifices, and blood. What could these things represent, and how do they relate to your covenants?\nExodus 32–34\nSin is turning away from God; repentance is turning toward Him and away from evil.\nTry to put yourself in the Israelites’ place—you’re in the wilderness, Moses has been gone for 40 days, and a confrontation with the Canaanites over the promised land is in your future (see\nExodus 32:1–8\n). Why do you think the Israelites wanted a golden idol? What inspires you about Moses’s plea to the Lord in\nExodus 33:11–17\n?\nWhile the Israelites’ sin was serious, this story also includes a message of God’s mercy and forgiveness. What does\nExodus 34:1–10\nteach you about the Savior? (see\nExodus 32:30–32\n;\nMosiah 14:4–8\n;\n15:9\n;\nDoctrine and Covenants 45:3–5\n).\nExodus 31:13–16\nThe Sabbath is a sign.\nPresident Russell M. Nelson explained: “In my much younger years, I studied the work of others who had compiled lists of things to do and things\nnot\nto do on the Sabbath. It wasn’t until later that I learned from the scriptures that my conduct and my attitude on the Sabbath constituted a\nsign\nbetween me and my Heavenly Father [see\nExodus 31:13\n;\nEzekiel 20:12, 20\n]. With that understanding, I no longer needed lists of dos and don’ts. When I had to make a decision whether or not an activity was appropriate for the Sabbath, I simply asked myself, ‘What\nsign\ndo I want to give to God?’ That question made my choices about the Sabbath day crystal clear” (“\nThe Sabbath Is a Delight\n,”\nEnsign\nor\nLiahona\n, May 2015, 130). Ponder what sign you want to give God with your observance of the Sabbath.\nExodus 34:1–4\nWhat was the difference between the two sets of stone tables Moses made?\nWhen Moses came down from the mountain, he brought the law written on stone tables. After finding that the Israelites had broken their covenant, Moses broke the tables (see\nExodus 31:18\n;\n32:19\n). Later, God commanded Moses to make another set of stone tables and take them back to the mountain (see\nExodus 34:1–4\n). The\nJoseph Smith Translation of Exodus 34:1–2\n(in the Bible appendix) clarifies that the first set of stone tables included the ordinances of God’s “holy order,” or the Melchizedek Priesthood. The second set included “the law of a carnal commandment.” This was a lesser law administered by the “lesser priesthood” (see\nDoctrine and Covenants 84:17–27\n), which was meant to prepare the Israelites for the higher law and higher priesthood so they could enter into God’s presence.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat was significant about the Israelites’ unwillingness to have God speak directly to them?\nWhy did the Israelites create a golden calf to worship?\nWho can see God’s face and live?\nClick to see more.\nIdeas for Teaching Children\nExodus 20:3–17\nGod gives me commandments because He wants me to be happy.\nHow can you make learning about the Ten Commandments fun for your children? As you read\nExodus 20:3–17\ntogether, let your children help you find or draw a picture to represent each of the Ten Commandments. Then your children could take turns choosing a picture and talking about how they can live that commandment. Share with each other how living that commandment brings you happiness.\nYou could also sing a song like “\nKeep the Commandments\n” (\nChildren’s Songbook\n, 146–47). Help your children find words in the song that teach them why God wants us to keep His commandments.\nWhen children share spiritual experiences, their testimony grows.\nThe questions you ask can encourage your children to share how they feel about the Savior and how living the gospel has blessed them (see\nTeaching in the Savior’s Way\n,\n32\n). When they do this, they are bearing testimony. Consider how you can do this as you discuss the blessings that come from living the Ten Commandments.\nExodus 20:12\nThe Lord wants me to honor my parents.\nHelp your children learn the phrase “Honour thy father and thy mother” (\nExodus 20:12\n). You may want to explain that to “honor” someone can mean to show respect for them or to bring them happiness. What did Jesus do to honor His mortal mother and His Heavenly Father? (see\nLuke 2:48–51\n;\nJohn 19:26–27\n). Perhaps your children could take turns acting out things they can do to honor their parents, while the other children guess what they are doing.\nExodus 31:13, 16–17\nHonoring the Sabbath is a sign of my love for the Lord.\nYour children might enjoy looking at examples of signs—such as road signs or signs on a building. What are the purposes of signs? Your children could then find the word “sign” in\nExodus 31:13, 16–17\n. What did the Lord say is a sign between us and Him? Share with each other some of the ways you and your family try to show your love for the Lord on the Sabbath.\nIllustration of Moses holding the Ten Commandments, by Sam Lawlor (detail)\nExodus 32:1–8, 19–24\n;\n34:6–7\nI will not “turn aside” from God’s ways.\nConsider using “\nMoses on Mount Sinai\n” (in\nOld Testament Stories\n, 77–82) to help your children learn the story in\nExodus 32:1–8, 19–24\n. Why was it wrong for the Israelites to worship a statue instead of God?\n2:55\nMoses on Mount Sinai\nIt might be fun to create a path on the floor (or find one near your home) to illustrate these words from\nExodus 32:8\n: “They have turned aside quickly out of the way.” While walking on the path, your children could talk about temptations we face to turn away from God. What helps us remain on God’s path—and return to it if we have strayed? (see\nExodus 34:6–7\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 17: Lesson 48: Lesson 48—Exodus 19This lesson can help students feel in their hearts God’s desire to have a covenant relationship with them.; Lesson 49: Lesson 49—Exodus 20:1–11This lesson can help students love and honor God above everything else.... ---\n\n--- Lesson 48 ---\nHeavenly Father loves all His children and desires a covenant relationship with each of us. Learning how He felt about the Israelites can help us understand how He feels about us. After leading the children of Israel out of Egypt, the Lord brought them to Mount Sinai to make covenants with Him. This lesson can help students feel in their hearts God’s desire to have a covenant relationship with them. Student preparation: Invite students to reflect on what makes a relationship meaningful or important. They could think of someone whom they have a meaningful relationship with, and they could bring a picture of this person to share at the beginning of class. Possible Learning Activities Special relationships Consider displaying a picture of someone you have a meaningful relationship with, such as a family member or a mentor. Share why your relationship with this person is important to you. Invite students to think about someone meaningful in their lives. If students brought a picture to class, they could share it now. What makes your relationship with this person meaningful? Invite students to ponder the following questions prayerfully. Ask them to record their thoughts and feelings in their study journals. How meaningful to you is your relationship with Heavenly Father and Jesus Christ? What makes the connection that you have with Heavenly Father and Jesus Christ different from other relationships you have? In what ways do you think your life might change as you continually strengthen your relationship with Heavenly Father and Jesus Christ? Seek guidance from the Spirit to understand what you can do to strengthen your relationship with Heavenly Father and Jesus Christ. “A peculiar treasure unto me” After the children of Israel departed Egypt, the Lord led them to Mount Sinai (sometimes the scriptures refer to Mt. Sinai as Mt. Horeb; see Exodus 3:1 ), as He had promised (see Exodus 3:7–12 ; 19:1–4 ). For Moses and the children of Israel, Mount Sinai was like a temple: a place where they would make covenants with God. Read Exodus 19:3–6 , looking for words and phrases that teach about the kind of relationship Heavenly Father and Jesus Christ want with us. What did you find? President Russell M. Nelson explained what it means to be God’s “peculiar treasure” ( verse 5 ): In the Old Testament, the Hebrew term from which peculiar was translated is segullah , which means “valued property,” or “treasure.” … Thus, we see that the scriptural term peculiar signifies “valued treasure,” “made” or “selected by God.” For us to be identified by servants of the Lord as his peculiar people is a compliment of the highest order. (“ Children of the Covenant ,” Ensign , May 1995, 34) To help students identify a principle, you may want to point out the words if and then in verse 5 . What principles can you identify from these verses? Students may identify a variety of principles, including if we obey the Lord’s voice and keep our covenants with Him, we will become His holy people . President Russell M. Nelson taught about the covenant relationship we can have with God: Once you and I have made a covenant with God, our relationship with Him becomes much closer than before our covenant. Now we are bound together. Because of our covenant with God, He will never tire in His efforts to help us, and we will never exhaust His merciful patience with us. Each of us has a special place in God’s heart. He has high hopes for us. (Russell M. Nelson, “ The Everlasting Covenant ,” Liahona , Oct. 2022, 6) What stands out to you from this statement? Read the following scripture passages, looking for evidence that God wants a covenant relationship with you. You may want to link or cross-reference these verses with Exodus 19:5–6 . Matthew 11:28–30 Titus 2:11–14 1 Peter 1:15–16 Moroni 10:32–33 Invite students to share words and phrases from these verses that show that God wants a covenant relationship with us. Students may mention that the Savior invites us to come unto Him so He can help us and give us rest (see Matthew 11:28–30 ). They might mention that the Savior gave Himself to redeem and purify us as His peculiar people (see Titus 2:14 ) or that we can be holy because the Savior is holy (see 1 Peter 1:16 ). My relationship with God To prepare students to answer the following questions in their study journals, you could share ways you have felt that God wants a covenant relationship with you. Invite students to reflect on their own experiences as you share. You may also want to mention other evidence that God wants to have a covenant relationship with us. Examples might include feeling God’s love or receiving spiritual impressions that encourage us to do good and to become better. Reflect on any impressions you have received from the Spirit, and respond to one or more of the following questions in your study journal: What have you learned or felt that helps you want to make and keep covenants with God? How does knowing that God wants a close covenant relationship with you affect your desire to come closer to Him? How has God blessed you for striving to keep the covenants that you have made with Him? After enough time, invite willing students to share their thoughts and feelings with the class. Consider sharing ways God has blessed you for making and keeping covenants with Him. The Israelites prepare to make a covenant The following summary can help students understand what Israel did to prepare to make a covenant with God. You might want to mention that after this, the Lord revealed the Ten Commandments, which students will study in the next two lessons. As you conclude the lesson, you might also share your thoughts and feelings about how God wants to make covenants with us. The Israelites agreed to make a covenant with God to become His holy people. The Lord then indicated He would come and speak to the people (see Exodus 19:7–9 ). The Lord commanded Moses to sanctify the people, or make them holy, and for the people to cleanse their garments in preparation for when the Lord would “come down in the sight of all the people upon mount Sinai” ( Exodus 19:11 ). The people prepared themselves and gathered to Mount Sinai “to meet with God” ( Exodus 19:17 ). There, they saw evidence of the Lord’s presence on the mountain. The Lord called Moses up the mountain to speak with Him and to reveal His will for the people (see Exodus 19:18–25 ).\n\n\n--- Lesson 49 ---\nHeavenly Father and Jesus Christ love all of us and want us to choose Them first in our lives. After delivering the Israelites from Egypt, the Lord led them to Mount Sinai to make a covenant with Him. There He revealed the Ten Commandments to help them love Him more than anything else. This lesson can help students love and honor God above everything else. Student preparation: Invite students to list some of God’s commandments. Invite them to discuss with a family member or friend how the commandments they listed help them to show their love for God and to put Him first in their lives. Possible Learning Activities The greatest commandment Note: This lesson focuses on the first four commandments. Lesson 50: “ Exodus 20:12–17 ” will focus on the last six. You may want to begin class by asking students to think about what commandment, of all of God’s commandments they think is the most important. Then share the following summary. During His mortal ministry, the Savior was asked which of the commandments was the greatest, or most important (see Matthew 22:36 ). Read Matthew 22:37–39 (see also Leviticus 19:18 ; Deuteronomy 6:5 ), looking for the Savior’s response. Why do you think these are the two greatest commandments? As you study the Ten Commandments in this lesson and other lessons, look for how these commandments help us love God and our neighbors. During this lesson, you will study some of the Ten Commandments that help us love and honor God. Read Exodus 20:1–11 , looking for the first four commandments the Lord gave the Israelites. Exodus 20:3–17 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. What similarities do you see between these commandments and the first great commandment from Matthew 22:37–38 ? You may want to summarize on the board the truths that students share. They might look something like God commands us to love Him and put Him first in our lives . You could invite students to cross-reference or link Exodus 20:3–17 with Matthew 22:36–39 . What do you think it means to put God first in our lives? Help students think about how they are currently applying this truth in their lives. You could invite them to complete the following self-assessment. Ponder your responses to the following questions. You might want to record some of your thoughts in your study journal. Is my love for God the most important influence in my life? What might be holding me back from loving God and putting Him first in my life? Commandments that help us love God and put Him first The accompanying handout is designed to help students understand how the commandments in Exodus 20:3–11 can help us love God and put Him first in our lives. You could use the handout in a variety of ways. Open PDF Sharing can help students be more aware of what they are learning. Provide students with an opportunity to share what they learned from the handout. Students could share in small groups or with the class. As appropriate, consider responding to the following question with your own experience after willing students have responded. What blessings have you, or someone you know, experienced by putting God first? Putting God first The following activity can help students create a plan to love God and put Him first in their lives. Remind students that the number 1 refers to placing God first in our lives. In your study journal, or on a separate piece of paper, draw a large number 1. Make it large enough to write inside, or leave room to write next to it. Seek guidance from Heavenly Father through the Holy Ghost to decide what you can do to put God first in your life. Inside or next to the number 1 write what you will do. Write your answers to the following questions underneath: How might doing this help you love God and put Him first in your life? How might the Lord bless you for doing this? What challenges might you face as you do this? What can you do to overcome these challenges? Encourage students to act on the spiritual impressions they have had. Students will have an opportunity to follow up on their progress in Lesson 67: “ Assess Your Learning 4 .” Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Exodus 20:3–17 is “The Ten Commandments.” Ideas for memorization activities are in the appendix under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 50 ---\nWhen the children of Israel were camped at Mount Sinai, the Lord revealed the Ten Commandments. By keeping the Ten Commandments, we show our love for God and others. As we strive to love others as Heavenly Father and Jesus Christ do, our love for Them also increases. This lesson can help students understand ways to keep commandments that will help them love God and their neighbor. Student preparation: Invite students to test their knowledge of the Ten Commandments. They could work on listing them in order or reciting them from memory. Possible Learning Activities Survey about commandments Invite students to find and read the Ten Commandments in Exodus 20:3–17 or on page 39 in For the Strength of Youth: A Guide for Making Choices (2022). They can respond to the following questions, or they can rank the Ten Commandments from 1 (most obeyed) to 10 (most broken) based on what this survey might find. Which of the Ten Commandments do you feel people obey most often? Why? Which of the Ten Commandments do you feel people break most often? Why? How do you think our feelings for God are reflected in how we treat His commandments? The Ten Commandments help us love God and our neighbor Students might have studied the Ten Commandments in Lesson 49: “ Exodus 20:1–11 ”. You might want to have students read or review Matthew 22:36–40 , looking for the two great commandments that Jesus taught. Students could review how the Ten Commandments in Exodus 20:3–17 relate to these two great commandments. Help students notice how the last six commandments focus on loving our neighbor. Read Exodus 20:12–17 , the last six of the Ten Commandments. Look for how these verses teach that by living the Ten Commandments, we show our love for God and our neighbor . As you study, be open to impressions from the Holy Ghost. Ponder what you can do to love God and your neighbor by keeping the Ten Commandments. Commandments to love our neighbor Consider using the handout “Commandments That Help Us Love Our Neighbor” to help students take responsibility for their learning. Invite them to study one of the commandments and to prepare to share what they learn about it. Students could choose which commandment to study, or you could assign each student a commandment. They could study individually, in partnerships, or in small groups. Divide the handout among students according to the commandment they are studying. Give students a set amount of time to study. Leave enough time for the sharing activity later in the lesson. Open PDF Student sharing Thank students for their hard work, and praise them for their efforts. Think of a way for them to share what they learned. For example, you could arrange the seats so students are sitting across from one another in rows. Provide a set amount of time for them to share what they studied with the person sitting across from them. After both students share, invite students in one of the rows to move one seat over. Students will now be with a different partner. Repeat as many times as desired. Afterward, students could discuss the following questions as a class or with their current partner. Pick a specific commandment you studied, and answer the following questions: How can your love for God and your neighbor help you keep this commandment? What blessings have you experienced from living this commandment? Consider sharing your thoughts on how obedience to the Lord’s commandments can help us love God and others more. You might encourage students to continue striving to obey the Ten Commandments.\n\n\n--- Lesson 51 ---\nHow has the Savior’s justice, mercy, and long-suffering worked together to bless your life? When Moses returned from the presence of the Lord, he found that the Israelites had broken the covenants they had made and were worshipping a golden calf. The Israelites suffered the consequences of this sin, but the Lord demonstrates His justice, mercy, and long-suffering toward those who repent and return to Him. This lesson can help students understand that the Lord is just, merciful, and long-suffering. Student preparation: Invite students to ponder how they have seen the Lord’s justice, love, and long-suffering (patience) in their lives. You could invite them to visit with a family member or friend about how the Lord’s justice and mercy work together to bless all of His children. Possible Learning Activities The Lord is just, merciful, and long-suffering Consider displaying a picture of the Savior. Discuss the following question. What word would you use to describe the Savior’s character? Invite students to write their word on the board. Consider selecting a couple of examples and inviting the students who wrote the words to describe why they selected that attribute of the Savior. To help the children of Israel understand Him, the Lord revealed some essential elements of His character. Read Exodus 34:6–7 , looking for attributes of the Savior. What did you discover? Among the attributes students might identify, emphasize the truth that the Lord is just, merciful, and long-suffering . You might help students understand that “longsuffering” ( verse 6 ) describes the Lord’s patience with us. You could share with students that they will study how the children of Israel experienced the Lord’s justice, mercy, and long-suffering. They will also study why it is important for us to understand these truths about the Lord. The Israelites are the Lord’s covenant people The following scenario is used throughout the lesson to help students understand how the Israelites’ story could be relevant to youth today. The scenario uses the name “Kylie,” but you could invite students to select a name and to add or change the details of the story. Kylie, a young woman at your school, has been learning about the Savior’s gospel and has decided to make the changes necessary to be baptized into The Church of Jesus Christ of Latter-day Saints. She desires to make a covenant with God to keep His commandments. Help students recall that after their deliverance from Egypt, the Lord brought the children of Israel to Mount Sinai to make a covenant with Him. Read Exodus 24:3–8 , looking for how the Israelites might have felt similarly to Kylie. What stands out to you? It might be helpful to explain to students that the sprinkling of blood on the altar and on the people (see Exodus 24:6, 8 ) was a symbolic, physical representation that the Israelites were willing to be the Lord’s covenant people. The Lord desired to bless the children of Israel with the ordinances of the Melchizedek Priesthood (see Doctrine and Covenants 84:19–23 ). Moses returned to Mount Sinai to receive the Lord’s instructions for these ordinances and plans for the tabernacle. Breaking our covenants and the consequences Read Exodus 32:1–8 , looking for what the Israelites did while Moses was on the mountain receiving direction from God. What did you discover? Why do you think building and worshipping the golden calf was such a serious sin? (See Exodus 20:2–7 .) Make sure students understand that the Israelites broke the covenant they had just made with the Lord. You could share another portion of the scenario that parallels what happened with the children of Israel and is more relevant to youth. Students could provide examples of what Kylie might have done to break the covenant she made at baptism to obey God’s commandments. After her baptism, Kylie began spending time with her old friends, and it led to old habits. At first, the mistakes she made seem to be small. However, before long, she had returned to old, familiar ways. She broke the covenant she made at baptism. What might have influenced Kylie’s decision? The Lord’s law of justice Read Exodus 32:15–20 , looking for consequences Israel suffered because of their sin. What did you find? Help students understand that although we can use our agency to sin, the Lord is just. Therefore, we cannot escape the consequences of our sins. It might be helpful to explain that Moses broke the tablets that contained instructions for Melchizedek Priesthood ordinances (see Exodus 32:15–19 ; Joseph Smith Translation, Exodus 34:1–2 [in the Bible appendix]). Because of their decisions, the children of Israel were not worthy to receive these blessings from the Lord. Moses returned to the presence of the Lord. The Lord instructed Moses to institute the ordinances of the Aaronic Priesthood instead (see Doctrine and Covenants 84:24–26 ). You could also mention that Moses placed the tabernacle outside the camp (see Exodus 33:7 ), symbolizing Israel losing the presence of the Lord. What are some of the spiritual and temporal consequences Kylie might face for breaking her baptismal covenant? How do consequences demonstrate the Lord’s justice, mercy, and long-suffering? You might want to point out that, like the Israelites, Kylie might miss out on blessings that come from priesthood ordinances. She could also lose the constant companionship of the Lord’s Spirit. The Lord’s law of mercy Help students understand that the Lord reassured Israel that they were still His people (see Exodus 33:12–19 ). Review Exodus 34:6–7 , and think about why it might have been important for the Lord to remind the children of Israel that He is just, merciful, and long-suffering. How did the Lord demonstrate His mercy and long-suffering with the children of Israel? How might Kylie see the Lord’s mercy and long-suffering in her life? Elder Quentin L. Cook of the Quorum of the Twelve Apostles explained how the Savior’s mercy satisfies the law of justice: 13:53 Without the Savior’s Atonement, the eternal principle of justice would require punishment. Because of the Savior’s Atonement, mercy can prevail for those who have repented, and it can allow them to return to the presence of God. We would do well to ponder this wonderful doctrine. None can return to God by his or her own good works alone; we all need the benefit of the Savior’s sacrifice. All have sinned, and it is only through the Atonement of Jesus Christ that we can obtain mercy and live with God. (“ Be True to God and His Work ,” Liahona , Nov. 2022, 119) What parts of this statement might you share with Kylie? Asking questions that help students understand how the Lord demonstrates His love, power, and mercy in their lives can increase their connection to Him. One way to do this is to invite students to answer the following question. For additional training, see “ Help learners recognize the Lord’s love, power, and mercy in their lives ” in Teacher Development Skills. What evidence have you seen of the Savior’s justice, mercy, and long-suffering in your life or in the life of someone you know? Demonstrate understanding This activity can help students summarize what they have learned today. You could invite them to finish Kylie’s story. Consider displaying the following prompts for students to complete. Because of her experiences, Kylie may have learned that Heavenly Father and Jesus Christ . Because of what she learned about Heavenly Father and Jesus Christ, Kylie decides to . Consider inviting a few willing students to share how they might finish Kylie’s story with the class. After students have had a chance to share their responses, you could share how you have seen the Lord’s justice, mercy, and long-suffering in your life.\n\n--- SCRIPTURE: Exodus 19 ---\n1. In the third month, when the children of Israel were gone forth out of the land of Egypt, the same day came theyintothewildernessof Sinai.\n2. For they were departed from Rephidim, and were cometothe desert of Sinai, and hadpitchedin the wilderness; and there Israel camped before the mount.\n3. And Moses went up unto God, and theLordcalledunto him out of themountain, saying, Thus shalt thou say to the house of Jacob, and tell the children of Israel;\n4. Ye have seen what I did unto the Egyptians, andhowI bare you oneagleswings, and brought you unto myself.\n5. Now therefore, if ye willobeymy voice indeed, and keep mycovenant, then ye shall be apeculiartreasureunto me above all people: for all the earthismine:\n6. And ye shall be unto me akingdomofpriests, and anholynation. Thesearethe words which thou shalt speak unto the children of Israel.\n7. And Moses came and called for the elders of the people, and laid before their faces all these words which theLordcommandedhim.\n8. And all the people answered together, and said, All that theLordhath spoken we willdo. And Moses returned the words of the people unto theLord.\n9. And theLordsaid unto Moses, Lo, I come unto thee in thickcloud, that the people mayhearwhen I speak with thee, and believe thee for ever. And Moses told the words of the people unto theLord.\n10. And theLordsaid unto Moses, Go unto the people, andsanctifythem to day and to morrow, and let themwashtheir clothes,\n11. And be ready against the third day: for the third day theLordwill come down in thesightof all the people upon mount Sinai.\n12. And thou shalt setboundsunto the people round about, saying, Take heed to yourselves,that yegonotup into themount, or touch the border of it: whosoever toucheth the mount shall be surely put to death:\n13. There shall not an hand touch it, but he shall surely be stoned, or shot through; whetherit bebeast or man, it shall not live: when the trumpet soundeth long, they shall come up to the mount.\n14. And Moses went down from the mount unto the people, and sanctified the people; and they washed their clothes.\n15. And he said unto the people, Be ready against the third day:comenot atyourwives.\n16. And it came to pass on the third day in the morning, that there were thunders and lightnings, and thick cloud upon the mount, and the voice of the trumpet exceeding loud; so that all the people thatwasin the camp trembled.\n17. And Moses brought forth the people out of the camp tomeetwith God; and they stood at thenether part ofthe mount.\n18. And mountSinaiwasaltogetheron asmoke, because theLorddescendedupon it infire: and the smoke thereof ascended as the smoke of furnace, and the wholemountquaked greatly.\n19. And when the voice of thetrumpetsounded long, and waxed louder and louder, Moses spake, and God answered him by avoice.\n20. And theLordcame down upon mount Sinai, on the top of the mount: and theLordcalled Mosesupto thetopof the mount; and Moses went up.\n21. And theLordsaid unto Moses, Go down, charge the people, lest they break through unto theLordtogaze, and many of themperish.\n22. And let the priests also, which come near to theLord, sanctifythemselves, lest theLordbreak forth upon them.\n23. And Moses said unto theLord, The people cannot come up to mount Sinai: for thou chargedst us, saying, Set bounds about the mount, and sanctify it.\n24. And theLordsaid unto him, Away, get thee down, and thou shalt come up, thou, and Aaron with thee: but let not the priests and the people break through to come up unto theLord, lest he break forth upon them.\n25. So Moses went down unto the people, and spake unto them.\n\n--- SCRIPTURE: Exodus 20 ---\n1. And Godspakeall thesewords, saying,\n2. IamtheLordthyGod, which have brought thee out of the land ofEgypt, out of the house ofbondage.\n3. Thou shalt havenoothergodsbefore me.\n4. Thou shaltnotmake unto thee anygravenimage, or any likenessof any thingthatisin heaven above, or thatisin the earth beneath, or thatisin the water under the earth:\n5. Thou shalt notbowdown thyself to them, nor serve them: for I theLordthy GodamajealousGod,visitingtheiniquityof thefathersupon thechildrenunto the third and fourthgenerationof them thathateme;\n6. And shewingmercyunto thousands of them that love me, and keep mycommandments.\n7. Thou shalt not take thenameof theLordthy God invain; for theLordwill not hold himguiltlessthattakethhis name in vain.\n8. Remember thesabbathday, to keep itholy.\n9. Sixdays shalt thoulabour, and do all thy work:\n10. But the seventh dayisthe sabbath of theLordthy God:in itthou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thystrangerthatiswithin thy gates:\n11. Forinsixdays theLordmade heaven and earth, the sea, and all that in themis,and rested the seventh day: wherefore theLordblessedthe sabbath day, andhallowedit.\n12. Honourthyfatherand thymother: that thydaysmay belongupon thelandwhich theLordthy God giveth thee.\n13. Thou shalt notkill.\n14. Thou shalt not commitadultery.\n15. Thou shalt notsteal.\n16. Thou shalt not bearfalse witnessagainst thyneighbour.\n17. Thou shalt notcovetthy neighbours house, thou shalt not covet thy neighbourswife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing thatisthy neighbours.\n18. And all the peoplesawthe thunderings, and the lightnings, and the noise of the trumpet, and the mountain smoking: and when the peoplesawit,theyremoved, and stood afar off.\n19. And they said unto Moses, Speak thou with us, and we will hear: but let not Godspeakwith us, lest we die.\n20. And Moses said unto the people,Fear not: forGodiscometoproveyou, andthathis fear may be before your faces, that ye sin not.\n21. And the people stood afar off, and Moses drew near unto the thick darkness where Godwas.\n22. And theLordsaid unto Moses, Thus thou shalt say unto the children of Israel, Ye have seen that I havetalkedwith you from heaven.\n23. Ye shall not makewith megodsof silver, neither shall ye make unto you gods of gold.\n24. An altar of earth thou shalt make unto me, and shaltsacrificethereon thy burnt offerings, and thy peace offerings, thy sheep, and thine oxen: in all places where I record my name I will come unto thee, and I will bless thee.\n25. And if thou wilt make me an altar of stone, thou shalt not build it of hewnstone: for if thou lift up thytoolupon it, thou hast polluted it.\n26. Neither shalt thou go up bystepsunto mine altar, that thy nakedness be notdiscoveredthereon.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";24;31–34",
      "content": "Although the children of Israel had murmured and wavered in the past, when Moses read the law at the foot of Mount Sinai, they made this covenant: “All that the Lord hath said will we do, and be obedient” (\nExodus 24:7\n). God then called Moses onto the mountain, telling him to build a tabernacle so “that I may dwell among them” (\nExodus 25:8\n).\nBut while Moses was at the top of the mountain learning how the Israelites could have God’s presence among them, the Israelites were at the bottom of the mountain making a golden idol to worship instead. Soon after promising to “have no other gods,” they “turned aside quickly” from their promise (\nExodus 20:3\n;\n32:8\n; see also\nExodus 24:3\n). It was a surprising turn, but we know from experience that faith and commitment can sometimes be overcome by impatience, fear, or doubt. As we seek the Lord’s presence in our lives, it is encouraging to know the Lord did not give up on ancient Israel and He will not give up on us and the people we love—for He is “merciful and gracious, longsuffering, and abundant in goodness and truth” (\nExodus 34:6\n).\nIdeas for Learning at Home and at Church\nExodus 19:3–6\nThe Lord’s covenant people are a treasure to Him.\nPresident Russell M. Nelson taught: “In the Old Testament, the Hebrew term from which\npeculiar\nwas translated is\nsegullah\n, which means ‘valued property,’ or ‘treasure.’ … For us to be identified by servants of the Lord as his\npeculiar\npeople is a compliment of the highest order” (“\nChildren of the Covenant\n,”\nEnsign\n, May 1995, 34). How do President Nelson’s words affect the way you understand\nExodus 19:3–6\n? How has the Lord shown you that He treasures you?\nExodus 19:10–11, 17\nSacred experiences require preparation.\nThe Lord told Moses that the children of Israel needed to be prepared before they could “meet with God” (\nExodus 19:10–11, 17\n) and keep a covenant with Him (see\nExodus 19:5\n). How do you prepare for spiritual experiences, including the sacrament and temple ordinances? How can you help others prepare? What do you learn about preparation from\nLuke 6:12–13\n;\nEnos 1:2–6\n;\nAlma 17:2–3\n?\nThis mountain in Egypt is traditionally believed to be Mount Sinai.\nExodus 20:1–17\nObedience to God’s commandments brings blessings.\nWhile the Israelites were gathered at the base of Mount Sinai, they heard the voice of God give the Ten Commandments (see\nDeuteronomy 4:12–13\n). These, of course, aren’t God’s only commandments—there are many others in the scriptures. So as you read\nExodus 20:1–17\n, ask yourself why God emphasized these ten in particular. Here’s a sample table you could use as you ponder the importance of the Ten Commandments in your life:\nCommandment\nIn other words, the Lord is asking me to …\nBlessings that come from living this commandment\nHow does keeping these ten commandments help you keep the two great commandments Jesus gave in\nMatthew 22:34–40\n?\nWhat are things that you may be tempted to put before God? What blessings have you seen from putting God first?\nHow would you respond to someone who says the Ten Commandments were given a long time ago and do not apply today? What examples from your life would you share as part of your response? How might the hymn “\nHow Gentle God’s Commands\n” (\nHymns\n, no. 125) affect the way you explain God’s commandments to others?\nHow has the Lord fulfilled the promise in\nExodus 20:6\nin your life?\nSee also “\nThe Great Commandment—Love the Lord\n,” in\nTeachings of Presidents of the Church: Ezra Taft Benson\n(2014), 37–45; Dallin H. Oaks, “\nNo Other Gods\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 72–75; Topics and Questions, “\nCommandments\n,” Gospel Library.\nExodus 24:1–11\nMaking covenants shows my willingness to obey God’s law.\nAs you read\nExodus 24:3–8\n, consider the covenants you have made with God. While Israel’s covenant included rituals that are different from what God requires today, you may notice some similarities. For example,\nverses 4, 5, and 8\nmention an altar, animal sacrifices, and blood. What could these things represent, and how do they relate to your covenants?\nExodus 32–34\nSin is turning away from God; repentance is turning toward Him and away from evil.\nTry to put yourself in the Israelites’ place—you’re in the wilderness, Moses has been gone for 40 days, and a confrontation with the Canaanites over the promised land is in your future (see\nExodus 32:1–8\n). Why do you think the Israelites wanted a golden idol? What inspires you about Moses’s plea to the Lord in\nExodus 33:11–17\n?\nWhile the Israelites’ sin was serious, this story also includes a message of God’s mercy and forgiveness. What does\nExodus 34:1–10\nteach you about the Savior? (see\nExodus 32:30–32\n;\nMosiah 14:4–8\n;\n15:9\n;\nDoctrine and Covenants 45:3–5\n).\nExodus 31:13–16\nThe Sabbath is a sign.\nPresident Russell M. Nelson explained: “In my much younger years, I studied the work of others who had compiled lists of things to do and things\nnot\nto do on the Sabbath. It wasn’t until later that I learned from the scriptures that my conduct and my attitude on the Sabbath constituted a\nsign\nbetween me and my Heavenly Father [see\nExodus 31:13\n;\nEzekiel 20:12, 20\n]. With that understanding, I no longer needed lists of dos and don’ts. When I had to make a decision whether or not an activity was appropriate for the Sabbath, I simply asked myself, ‘What\nsign\ndo I want to give to God?’ That question made my choices about the Sabbath day crystal clear” (“\nThe Sabbath Is a Delight\n,”\nEnsign\nor\nLiahona\n, May 2015, 130). Ponder what sign you want to give God with your observance of the Sabbath.\nExodus 34:1–4\nWhat was the difference between the two sets of stone tables Moses made?\nWhen Moses came down from the mountain, he brought the law written on stone tables. After finding that the Israelites had broken their covenant, Moses broke the tables (see\nExodus 31:18\n;\n32:19\n). Later, God commanded Moses to make another set of stone tables and take them back to the mountain (see\nExodus 34:1–4\n). The\nJoseph Smith Translation of Exodus 34:1–2\n(in the Bible appendix) clarifies that the first set of stone tables included the ordinances of God’s “holy order,” or the Melchizedek Priesthood. The second set included “the law of a carnal commandment.” This was a lesser law administered by the “lesser priesthood” (see\nDoctrine and Covenants 84:17–27\n), which was meant to prepare the Israelites for the higher law and higher priesthood so they could enter into God’s presence.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat was significant about the Israelites’ unwillingness to have God speak directly to them?\nWhy did the Israelites create a golden calf to worship?\nWho can see God’s face and live?\nClick to see more.\nIdeas for Teaching Children\nExodus 20:3–17\nGod gives me commandments because He wants me to be happy.\nHow can you make learning about the Ten Commandments fun for your children? As you read\nExodus 20:3–17\ntogether, let your children help you find or draw a picture to represent each of the Ten Commandments. Then your children could take turns choosing a picture and talking about how they can live that commandment. Share with each other how living that commandment brings you happiness.\nYou could also sing a song like “\nKeep the Commandments\n” (\nChildren’s Songbook\n, 146–47). Help your children find words in the song that teach them why God wants us to keep His commandments.\nWhen children share spiritual experiences, their testimony grows.\nThe questions you ask can encourage your children to share how they feel about the Savior and how living the gospel has blessed them (see\nTeaching in the Savior’s Way\n,\n32\n). When they do this, they are bearing testimony. Consider how you can do this as you discuss the blessings that come from living the Ten Commandments.\nExodus 20:12\nThe Lord wants me to honor my parents.\nHelp your children learn the phrase “Honour thy father and thy mother” (\nExodus 20:12\n). You may want to explain that to “honor” someone can mean to show respect for them or to bring them happiness. What did Jesus do to honor His mortal mother and His Heavenly Father? (see\nLuke 2:48–51\n;\nJohn 19:26–27\n). Perhaps your children could take turns acting out things they can do to honor their parents, while the other children guess what they are doing.\nExodus 31:13, 16–17\nHonoring the Sabbath is a sign of my love for the Lord.\nYour children might enjoy looking at examples of signs—such as road signs or signs on a building. What are the purposes of signs? Your children could then find the word “sign” in\nExodus 31:13, 16–17\n. What did the Lord say is a sign between us and Him? Share with each other some of the ways you and your family try to show your love for the Lord on the Sabbath.\nIllustration of Moses holding the Ten Commandments, by Sam Lawlor (detail)\nExodus 32:1–8, 19–24\n;\n34:6–7\nI will not “turn aside” from God’s ways.\nConsider using “\nMoses on Mount Sinai\n” (in\nOld Testament Stories\n, 77–82) to help your children learn the story in\nExodus 32:1–8, 19–24\n. Why was it wrong for the Israelites to worship a statue instead of God?\n2:55\nMoses on Mount Sinai\nIt might be fun to create a path on the floor (or find one near your home) to illustrate these words from\nExodus 32:8\n: “They have turned aside quickly out of the way.” While walking on the path, your children could talk about temptations we face to turn away from God. What helps us remain on God’s path—and return to it if we have strayed? (see\nExodus 34:6–7\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 17: Lesson 48: Lesson 48—Exodus 19This lesson can help students feel in their hearts God’s desire to have a covenant relationship with them.; Lesson 49: Lesson 49—Exodus 20:1–11This lesson can help students love and honor God above everything else....",
      "content": "\n--- Lesson 48 ---\nHeavenly Father loves all His children and desires a covenant relationship with each of us. Learning how He felt about the Israelites can help us understand how He feels about us. After leading the children of Israel out of Egypt, the Lord brought them to Mount Sinai to make covenants with Him. This lesson can help students feel in their hearts God’s desire to have a covenant relationship with them. Student preparation: Invite students to reflect on what makes a relationship meaningful or important. They could think of someone whom they have a meaningful relationship with, and they could bring a picture of this person to share at the beginning of class. Possible Learning Activities Special relationships Consider displaying a picture of someone you have a meaningful relationship with, such as a family member or a mentor. Share why your relationship with this person is important to you. Invite students to think about someone meaningful in their lives. If students brought a picture to class, they could share it now. What makes your relationship with this person meaningful? Invite students to ponder the following questions prayerfully. Ask them to record their thoughts and feelings in their study journals. How meaningful to you is your relationship with Heavenly Father and Jesus Christ? What makes the connection that you have with Heavenly Father and Jesus Christ different from other relationships you have? In what ways do you think your life might change as you continually strengthen your relationship with Heavenly Father and Jesus Christ? Seek guidance from the Spirit to understand what you can do to strengthen your relationship with Heavenly Father and Jesus Christ. “A peculiar treasure unto me” After the children of Israel departed Egypt, the Lord led them to Mount Sinai (sometimes the scriptures refer to Mt. Sinai as Mt. Horeb; see Exodus 3:1 ), as He had promised (see Exodus 3:7–12 ; 19:1–4 ). For Moses and the children of Israel, Mount Sinai was like a temple: a place where they would make covenants with God. Read Exodus 19:3–6 , looking for words and phrases that teach about the kind of relationship Heavenly Father and Jesus Christ want with us. What did you find? President Russell M. Nelson explained what it means to be God’s “peculiar treasure” ( verse 5 ): In the Old Testament, the Hebrew term from which peculiar was translated is segullah , which means “valued property,” or “treasure.” … Thus, we see that the scriptural term peculiar signifies “valued treasure,” “made” or “selected by God.” For us to be identified by servants of the Lord as his peculiar people is a compliment of the highest order. (“ Children of the Covenant ,” Ensign , May 1995, 34) To help students identify a principle, you may want to point out the words if and then in verse 5 . What principles can you identify from these verses? Students may identify a variety of principles, including if we obey the Lord’s voice and keep our covenants with Him, we will become His holy people . President Russell M. Nelson taught about the covenant relationship we can have with God: Once you and I have made a covenant with God, our relationship with Him becomes much closer than before our covenant. Now we are bound together. Because of our covenant with God, He will never tire in His efforts to help us, and we will never exhaust His merciful patience with us. Each of us has a special place in God’s heart. He has high hopes for us. (Russell M. Nelson, “ The Everlasting Covenant ,” Liahona , Oct. 2022, 6) What stands out to you from this statement? Read the following scripture passages, looking for evidence that God wants a covenant relationship with you. You may want to link or cross-reference these verses with Exodus 19:5–6 . Matthew 11:28–30 Titus 2:11–14 1 Peter 1:15–16 Moroni 10:32–33 Invite students to share words and phrases from these verses that show that God wants a covenant relationship with us. Students may mention that the Savior invites us to come unto Him so He can help us and give us rest (see Matthew 11:28–30 ). They might mention that the Savior gave Himself to redeem and purify us as His peculiar people (see Titus 2:14 ) or that we can be holy because the Savior is holy (see 1 Peter 1:16 ). My relationship with God To prepare students to answer the following questions in their study journals, you could share ways you have felt that God wants a covenant relationship with you. Invite students to reflect on their own experiences as you share. You may also want to mention other evidence that God wants to have a covenant relationship with us. Examples might include feeling God’s love or receiving spiritual impressions that encourage us to do good and to become better. Reflect on any impressions you have received from the Spirit, and respond to one or more of the following questions in your study journal: What have you learned or felt that helps you want to make and keep covenants with God? How does knowing that God wants a close covenant relationship with you affect your desire to come closer to Him? How has God blessed you for striving to keep the covenants that you have made with Him? After enough time, invite willing students to share their thoughts and feelings with the class. Consider sharing ways God has blessed you for making and keeping covenants with Him. The Israelites prepare to make a covenant The following summary can help students understand what Israel did to prepare to make a covenant with God. You might want to mention that after this, the Lord revealed the Ten Commandments, which students will study in the next two lessons. As you conclude the lesson, you might also share your thoughts and feelings about how God wants to make covenants with us. The Israelites agreed to make a covenant with God to become His holy people. The Lord then indicated He would come and speak to the people (see Exodus 19:7–9 ). The Lord commanded Moses to sanctify the people, or make them holy, and for the people to cleanse their garments in preparation for when the Lord would “come down in the sight of all the people upon mount Sinai” ( Exodus 19:11 ). The people prepared themselves and gathered to Mount Sinai “to meet with God” ( Exodus 19:17 ). There, they saw evidence of the Lord’s presence on the mountain. The Lord called Moses up the mountain to speak with Him and to reveal His will for the people (see Exodus 19:18–25 ).\n\n\n--- Lesson 49 ---\nHeavenly Father and Jesus Christ love all of us and want us to choose Them first in our lives. After delivering the Israelites from Egypt, the Lord led them to Mount Sinai to make a covenant with Him. There He revealed the Ten Commandments to help them love Him more than anything else. This lesson can help students love and honor God above everything else. Student preparation: Invite students to list some of God’s commandments. Invite them to discuss with a family member or friend how the commandments they listed help them to show their love for God and to put Him first in their lives. Possible Learning Activities The greatest commandment Note: This lesson focuses on the first four commandments. Lesson 50: “ Exodus 20:12–17 ” will focus on the last six. You may want to begin class by asking students to think about what commandment, of all of God’s commandments they think is the most important. Then share the following summary. During His mortal ministry, the Savior was asked which of the commandments was the greatest, or most important (see Matthew 22:36 ). Read Matthew 22:37–39 (see also Leviticus 19:18 ; Deuteronomy 6:5 ), looking for the Savior’s response. Why do you think these are the two greatest commandments? As you study the Ten Commandments in this lesson and other lessons, look for how these commandments help us love God and our neighbors. During this lesson, you will study some of the Ten Commandments that help us love and honor God. Read Exodus 20:1–11 , looking for the first four commandments the Lord gave the Israelites. Exodus 20:3–17 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. What similarities do you see between these commandments and the first great commandment from Matthew 22:37–38 ? You may want to summarize on the board the truths that students share. They might look something like God commands us to love Him and put Him first in our lives . You could invite students to cross-reference or link Exodus 20:3–17 with Matthew 22:36–39 . What do you think it means to put God first in our lives? Help students think about how they are currently applying this truth in their lives. You could invite them to complete the following self-assessment. Ponder your responses to the following questions. You might want to record some of your thoughts in your study journal. Is my love for God the most important influence in my life? What might be holding me back from loving God and putting Him first in my life? Commandments that help us love God and put Him first The accompanying handout is designed to help students understand how the commandments in Exodus 20:3–11 can help us love God and put Him first in our lives. You could use the handout in a variety of ways. Open PDF Sharing can help students be more aware of what they are learning. Provide students with an opportunity to share what they learned from the handout. Students could share in small groups or with the class. As appropriate, consider responding to the following question with your own experience after willing students have responded. What blessings have you, or someone you know, experienced by putting God first? Putting God first The following activity can help students create a plan to love God and put Him first in their lives. Remind students that the number 1 refers to placing God first in our lives. In your study journal, or on a separate piece of paper, draw a large number 1. Make it large enough to write inside, or leave room to write next to it. Seek guidance from Heavenly Father through the Holy Ghost to decide what you can do to put God first in your life. Inside or next to the number 1 write what you will do. Write your answers to the following questions underneath: How might doing this help you love God and put Him first in your life? How might the Lord bless you for doing this? What challenges might you face as you do this? What can you do to overcome these challenges? Encourage students to act on the spiritual impressions they have had. Students will have an opportunity to follow up on their progress in Lesson 67: “ Assess Your Learning 4 .” Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Exodus 20:3–17 is “The Ten Commandments.” Ideas for memorization activities are in the appendix under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 50 ---\nWhen the children of Israel were camped at Mount Sinai, the Lord revealed the Ten Commandments. By keeping the Ten Commandments, we show our love for God and others. As we strive to love others as Heavenly Father and Jesus Christ do, our love for Them also increases. This lesson can help students understand ways to keep commandments that will help them love God and their neighbor. Student preparation: Invite students to test their knowledge of the Ten Commandments. They could work on listing them in order or reciting them from memory. Possible Learning Activities Survey about commandments Invite students to find and read the Ten Commandments in Exodus 20:3–17 or on page 39 in For the Strength of Youth: A Guide for Making Choices (2022). They can respond to the following questions, or they can rank the Ten Commandments from 1 (most obeyed) to 10 (most broken) based on what this survey might find. Which of the Ten Commandments do you feel people obey most often? Why? Which of the Ten Commandments do you feel people break most often? Why? How do you think our feelings for God are reflected in how we treat His commandments? The Ten Commandments help us love God and our neighbor Students might have studied the Ten Commandments in Lesson 49: “ Exodus 20:1–11 ”. You might want to have students read or review Matthew 22:36–40 , looking for the two great commandments that Jesus taught. Students could review how the Ten Commandments in Exodus 20:3–17 relate to these two great commandments. Help students notice how the last six commandments focus on loving our neighbor. Read Exodus 20:12–17 , the last six of the Ten Commandments. Look for how these verses teach that by living the Ten Commandments, we show our love for God and our neighbor . As you study, be open to impressions from the Holy Ghost. Ponder what you can do to love God and your neighbor by keeping the Ten Commandments. Commandments to love our neighbor Consider using the handout “Commandments That Help Us Love Our Neighbor” to help students take responsibility for their learning. Invite them to study one of the commandments and to prepare to share what they learn about it. Students could choose which commandment to study, or you could assign each student a commandment. They could study individually, in partnerships, or in small groups. Divide the handout among students according to the commandment they are studying. Give students a set amount of time to study. Leave enough time for the sharing activity later in the lesson. Open PDF Student sharing Thank students for their hard work, and praise them for their efforts. Think of a way for them to share what they learned. For example, you could arrange the seats so students are sitting across from one another in rows. Provide a set amount of time for them to share what they studied with the person sitting across from them. After both students share, invite students in one of the rows to move one seat over. Students will now be with a different partner. Repeat as many times as desired. Afterward, students could discuss the following questions as a class or with their current partner. Pick a specific commandment you studied, and answer the following questions: How can your love for God and your neighbor help you keep this commandment? What blessings have you experienced from living this commandment? Consider sharing your thoughts on how obedience to the Lord’s commandments can help us love God and others more. You might encourage students to continue striving to obey the Ten Commandments.\n\n\n--- Lesson 51 ---\nHow has the Savior’s justice, mercy, and long-suffering worked together to bless your life? When Moses returned from the presence of the Lord, he found that the Israelites had broken the covenants they had made and were worshipping a golden calf. The Israelites suffered the consequences of this sin, but the Lord demonstrates His justice, mercy, and long-suffering toward those who repent and return to Him. This lesson can help students understand that the Lord is just, merciful, and long-suffering. Student preparation: Invite students to ponder how they have seen the Lord’s justice, love, and long-suffering (patience) in their lives. You could invite them to visit with a family member or friend about how the Lord’s justice and mercy work together to bless all of His children. Possible Learning Activities The Lord is just, merciful, and long-suffering Consider displaying a picture of the Savior. Discuss the following question. What word would you use to describe the Savior’s character? Invite students to write their word on the board. Consider selecting a couple of examples and inviting the students who wrote the words to describe why they selected that attribute of the Savior. To help the children of Israel understand Him, the Lord revealed some essential elements of His character. Read Exodus 34:6–7 , looking for attributes of the Savior. What did you discover? Among the attributes students might identify, emphasize the truth that the Lord is just, merciful, and long-suffering . You might help students understand that “longsuffering” ( verse 6 ) describes the Lord’s patience with us. You could share with students that they will study how the children of Israel experienced the Lord’s justice, mercy, and long-suffering. They will also study why it is important for us to understand these truths about the Lord. The Israelites are the Lord’s covenant people The following scenario is used throughout the lesson to help students understand how the Israelites’ story could be relevant to youth today. The scenario uses the name “Kylie,” but you could invite students to select a name and to add or change the details of the story. Kylie, a young woman at your school, has been learning about the Savior’s gospel and has decided to make the changes necessary to be baptized into The Church of Jesus Christ of Latter-day Saints. She desires to make a covenant with God to keep His commandments. Help students recall that after their deliverance from Egypt, the Lord brought the children of Israel to Mount Sinai to make a covenant with Him. Read Exodus 24:3–8 , looking for how the Israelites might have felt similarly to Kylie. What stands out to you? It might be helpful to explain to students that the sprinkling of blood on the altar and on the people (see Exodus 24:6, 8 ) was a symbolic, physical representation that the Israelites were willing to be the Lord’s covenant people. The Lord desired to bless the children of Israel with the ordinances of the Melchizedek Priesthood (see Doctrine and Covenants 84:19–23 ). Moses returned to Mount Sinai to receive the Lord’s instructions for these ordinances and plans for the tabernacle. Breaking our covenants and the consequences Read Exodus 32:1–8 , looking for what the Israelites did while Moses was on the mountain receiving direction from God. What did you discover? Why do you think building and worshipping the golden calf was such a serious sin? (See Exodus 20:2–7 .) Make sure students understand that the Israelites broke the covenant they had just made with the Lord. You could share another portion of the scenario that parallels what happened with the children of Israel and is more relevant to youth. Students could provide examples of what Kylie might have done to break the covenant she made at baptism to obey God’s commandments. After her baptism, Kylie began spending time with her old friends, and it led to old habits. At first, the mistakes she made seem to be small. However, before long, she had returned to old, familiar ways. She broke the covenant she made at baptism. What might have influenced Kylie’s decision? The Lord’s law of justice Read Exodus 32:15–20 , looking for consequences Israel suffered because of their sin. What did you find? Help students understand that although we can use our agency to sin, the Lord is just. Therefore, we cannot escape the consequences of our sins. It might be helpful to explain that Moses broke the tablets that contained instructions for Melchizedek Priesthood ordinances (see Exodus 32:15–19 ; Joseph Smith Translation, Exodus 34:1–2 [in the Bible appendix]). Because of their decisions, the children of Israel were not worthy to receive these blessings from the Lord. Moses returned to the presence of the Lord. The Lord instructed Moses to institute the ordinances of the Aaronic Priesthood instead (see Doctrine and Covenants 84:24–26 ). You could also mention that Moses placed the tabernacle outside the camp (see Exodus 33:7 ), symbolizing Israel losing the presence of the Lord. What are some of the spiritual and temporal consequences Kylie might face for breaking her baptismal covenant? How do consequences demonstrate the Lord’s justice, mercy, and long-suffering? You might want to point out that, like the Israelites, Kylie might miss out on blessings that come from priesthood ordinances. She could also lose the constant companionship of the Lord’s Spirit. The Lord’s law of mercy Help students understand that the Lord reassured Israel that they were still His people (see Exodus 33:12–19 ). Review Exodus 34:6–7 , and think about why it might have been important for the Lord to remind the children of Israel that He is just, merciful, and long-suffering. How did the Lord demonstrate His mercy and long-suffering with the children of Israel? How might Kylie see the Lord’s mercy and long-suffering in her life? Elder Quentin L. Cook of the Quorum of the Twelve Apostles explained how the Savior’s mercy satisfies the law of justice: 13:53 Without the Savior’s Atonement, the eternal principle of justice would require punishment. Because of the Savior’s Atonement, mercy can prevail for those who have repented, and it can allow them to return to the presence of God. We would do well to ponder this wonderful doctrine. None can return to God by his or her own good works alone; we all need the benefit of the Savior’s sacrifice. All have sinned, and it is only through the Atonement of Jesus Christ that we can obtain mercy and live with God. (“ Be True to God and His Work ,” Liahona , Nov. 2022, 119) What parts of this statement might you share with Kylie? Asking questions that help students understand how the Lord demonstrates His love, power, and mercy in their lives can increase their connection to Him. One way to do this is to invite students to answer the following question. For additional training, see “ Help learners recognize the Lord’s love, power, and mercy in their lives ” in Teacher Development Skills. What evidence have you seen of the Savior’s justice, mercy, and long-suffering in your life or in the life of someone you know? Demonstrate understanding This activity can help students summarize what they have learned today. You could invite them to finish Kylie’s story. Consider displaying the following prompts for students to complete. Because of her experiences, Kylie may have learned that Heavenly Father and Jesus Christ . Because of what she learned about Heavenly Father and Jesus Christ, Kylie decides to . Consider inviting a few willing students to share how they might finish Kylie’s story with the class. After students have had a chance to share their responses, you could share how you have seen the Lord’s justice, mercy, and long-suffering in your life.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 19",
      "content": "1. In the third month, when the children of Israel were gone forth out of the land of Egypt, the same day came theyintothewildernessof Sinai.\n2. For they were departed from Rephidim, and were cometothe desert of Sinai, and hadpitchedin the wilderness; and there Israel camped before the mount.\n3. And Moses went up unto God, and theLordcalledunto him out of themountain, saying, Thus shalt thou say to the house of Jacob, and tell the children of Israel;\n4. Ye have seen what I did unto the Egyptians, andhowI bare you oneagleswings, and brought you unto myself.\n5. Now therefore, if ye willobeymy voice indeed, and keep mycovenant, then ye shall be apeculiartreasureunto me above all people: for all the earthismine:\n6. And ye shall be unto me akingdomofpriests, and anholynation. Thesearethe words which thou shalt speak unto the children of Israel.\n7. And Moses came and called for the elders of the people, and laid before their faces all these words which theLordcommandedhim.\n8. And all the people answered together, and said, All that theLordhath spoken we willdo. And Moses returned the words of the people unto theLord.\n9. And theLordsaid unto Moses, Lo, I come unto thee in thickcloud, that the people mayhearwhen I speak with thee, and believe thee for ever. And Moses told the words of the people unto theLord.\n10. And theLordsaid unto Moses, Go unto the people, andsanctifythem to day and to morrow, and let themwashtheir clothes,\n11. And be ready against the third day: for the third day theLordwill come down in thesightof all the people upon mount Sinai.\n12. And thou shalt setboundsunto the people round about, saying, Take heed to yourselves,that yegonotup into themount, or touch the border of it: whosoever toucheth the mount shall be surely put to death:\n13. There shall not an hand touch it, but he shall surely be stoned, or shot through; whetherit bebeast or man, it shall not live: when the trumpet soundeth long, they shall come up to the mount.\n14. And Moses went down from the mount unto the people, and sanctified the people; and they washed their clothes.\n15. And he said unto the people, Be ready against the third day:comenot atyourwives.\n16. And it came to pass on the third day in the morning, that there were thunders and lightnings, and thick cloud upon the mount, and the voice of the trumpet exceeding loud; so that all the people thatwasin the camp trembled.\n17. And Moses brought forth the people out of the camp tomeetwith God; and they stood at thenether part ofthe mount.\n18. And mountSinaiwasaltogetheron asmoke, because theLorddescendedupon it infire: and the smoke thereof ascended as the smoke of furnace, and the wholemountquaked greatly.\n19. And when the voice of thetrumpetsounded long, and waxed louder and louder, Moses spake, and God answered him by avoice.\n20. And theLordcame down upon mount Sinai, on the top of the mount: and theLordcalled Mosesupto thetopof the mount; and Moses went up.\n21. And theLordsaid unto Moses, Go down, charge the people, lest they break through unto theLordtogaze, and many of themperish.\n22. And let the priests also, which come near to theLord, sanctifythemselves, lest theLordbreak forth upon them.\n23. And Moses said unto theLord, The people cannot come up to mount Sinai: for thou chargedst us, saying, Set bounds about the mount, and sanctify it.\n24. And theLordsaid unto him, Away, get thee down, and thou shalt come up, thou, and Aaron with thee: but let not the priests and the people break through to come up unto theLord, lest he break forth upon them.\n25. So Moses went down unto the people, and spake unto them.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 20",
      "content": "1. And Godspakeall thesewords, saying,\n2. IamtheLordthyGod, which have brought thee out of the land ofEgypt, out of the house ofbondage.\n3. Thou shalt havenoothergodsbefore me.\n4. Thou shaltnotmake unto thee anygravenimage, or any likenessof any thingthatisin heaven above, or thatisin the earth beneath, or thatisin the water under the earth:\n5. Thou shalt notbowdown thyself to them, nor serve them: for I theLordthy GodamajealousGod,visitingtheiniquityof thefathersupon thechildrenunto the third and fourthgenerationof them thathateme;\n6. And shewingmercyunto thousands of them that love me, and keep mycommandments.\n7. Thou shalt not take thenameof theLordthy God invain; for theLordwill not hold himguiltlessthattakethhis name in vain.\n8. Remember thesabbathday, to keep itholy.\n9. Sixdays shalt thoulabour, and do all thy work:\n10. But the seventh dayisthe sabbath of theLordthy God:in itthou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thystrangerthatiswithin thy gates:\n11. Forinsixdays theLordmade heaven and earth, the sea, and all that in themis,and rested the seventh day: wherefore theLordblessedthe sabbath day, andhallowedit.\n12. Honourthyfatherand thymother: that thydaysmay belongupon thelandwhich theLordthy God giveth thee.\n13. Thou shalt notkill.\n14. Thou shalt not commitadultery.\n15. Thou shalt notsteal.\n16. Thou shalt not bearfalse witnessagainst thyneighbour.\n17. Thou shalt notcovetthy neighbours house, thou shalt not covet thy neighbourswife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing thatisthy neighbours.\n18. And all the peoplesawthe thunderings, and the lightnings, and the noise of the trumpet, and the mountain smoking: and when the peoplesawit,theyremoved, and stood afar off.\n19. And they said unto Moses, Speak thou with us, and we will hear: but let not Godspeakwith us, lest we die.\n20. And Moses said unto the people,Fear not: forGodiscometoproveyou, andthathis fear may be before your faces, that ye sin not.\n21. And the people stood afar off, and Moses drew near unto the thick darkness where Godwas.\n22. And theLordsaid unto Moses, Thus thou shalt say unto the children of Israel, Ye have seen that I havetalkedwith you from heaven.\n23. Ye shall not makewith megodsof silver, neither shall ye make unto you gods of gold.\n24. An altar of earth thou shalt make unto me, and shaltsacrificethereon thy burnt offerings, and thy peace offerings, thy sheep, and thine oxen: in all places where I record my name I will come unto thee, and I will bless thee.\n25. And if thou wilt make me an altar of stone, thou shalt not build it of hewnstone: for if thou lift up thytoolupon it, thou hast polluted it.\n26. Neither shalt thou go up bystepsunto mine altar, that thy nakedness be notdiscoveredthereon.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Exodus": {
      "19": {
        "verses": {
          "1": {
            "text": "In the third month, when the children of Israel were gone forth out of the land of Egypt, the same day came theyintothewildernessof Sinai.",
            "citation": "(Exodus 19:1)"
          },
          "2": {
            "text": "For they were departed from Rephidim, and were cometothe desert of Sinai, and hadpitchedin the wilderness; and there Israel camped before the mount.",
            "citation": "(Exodus 19:2)"
          },
          "3": {
            "text": "And Moses went up unto God, and theLordcalledunto him out of themountain, saying, Thus shalt thou say to the house of Jacob, and tell the children of Israel;",
            "citation": "(Exodus 19:3)"
          },
          "4": {
            "text": "Ye have seen what I did unto the Egyptians, andhowI bare you oneagleswings, and brought you unto myself.",
            "citation": "(Exodus 19:4)"
          },
          "5": {
            "text": "Now therefore, if ye willobeymy voice indeed, and keep mycovenant, then ye shall be apeculiartreasureunto me above all people: for all the earthismine:",
            "citation": "(Exodus 19:5)"
          },
          "6": {
            "text": "And ye shall be unto me akingdomofpriests, and anholynation. Thesearethe words which thou shalt speak unto the children of Israel.",
            "citation": "(Exodus 19:6)"
          },
          "7": {
            "text": "And Moses came and called for the elders of the people, and laid before their faces all these words which theLordcommandedhim.",
            "citation": "(Exodus 19:7)"
          },
          "8": {
            "text": "And all the people answered together, and said, All that theLordhath spoken we willdo. And Moses returned the words of the people unto theLord.",
            "citation": "(Exodus 19:8)"
          },
          "9": {
            "text": "And theLordsaid unto Moses, Lo, I come unto thee in thickcloud, that the people mayhearwhen I speak with thee, and believe thee for ever. And Moses told the words of the people unto theLord.",
            "citation": "(Exodus 19:9)"
          },
          "10": {
            "text": "And theLordsaid unto Moses, Go unto the people, andsanctifythem to day and to morrow, and let themwashtheir clothes,",
            "citation": "(Exodus 19:10)"
          },
          "11": {
            "text": "And be ready against the third day: for the third day theLordwill come down in thesightof all the people upon mount Sinai.",
            "citation": "(Exodus 19:11)"
          },
          "12": {
            "text": "And thou shalt setboundsunto the people round about, saying, Take heed to yourselves,that yegonotup into themount, or touch the border of it: whosoever toucheth the mount shall be surely put to death:",
            "citation": "(Exodus 19:12)"
          },
          "13": {
            "text": "There shall not an hand touch it, but he shall surely be stoned, or shot through; whetherit bebeast or man, it shall not live: when the trumpet soundeth long, they shall come up to the mount.",
            "citation": "(Exodus 19:13)"
          },
          "14": {
            "text": "And Moses went down from the mount unto the people, and sanctified the people; and they washed their clothes.",
            "citation": "(Exodus 19:14)"
          },
          "15": {
            "text": "And he said unto the people, Be ready against the third day:comenot atyourwives.",
            "citation": "(Exodus 19:15)"
          },
          "16": {
            "text": "And it came to pass on the third day in the morning, that there were thunders and lightnings, and thick cloud upon the mount, and the voice of the trumpet exceeding loud; so that all the people thatwasin the camp trembled.",
            "citation": "(Exodus 19:16)"
          },
          "17": {
            "text": "And Moses brought forth the people out of the camp tomeetwith God; and they stood at thenether part ofthe mount.",
            "citation": "(Exodus 19:17)"
          },
          "18": {
            "text": "And mountSinaiwasaltogetheron asmoke, because theLorddescendedupon it infire: and the smoke thereof ascended as the smoke of furnace, and the wholemountquaked greatly.",
            "citation": "(Exodus 19:18)"
          },
          "19": {
            "text": "And when the voice of thetrumpetsounded long, and waxed louder and louder, Moses spake, and God answered him by avoice.",
            "citation": "(Exodus 19:19)"
          },
          "20": {
            "text": "And theLordcame down upon mount Sinai, on the top of the mount: and theLordcalled Mosesupto thetopof the mount; and Moses went up.",
            "citation": "(Exodus 19:20)"
          },
          "21": {
            "text": "And theLordsaid unto Moses, Go down, charge the people, lest they break through unto theLordtogaze, and many of themperish.",
            "citation": "(Exodus 19:21)"
          },
          "22": {
            "text": "And let the priests also, which come near to theLord, sanctifythemselves, lest theLordbreak forth upon them.",
            "citation": "(Exodus 19:22)"
          },
          "23": {
            "text": "And Moses said unto theLord, The people cannot come up to mount Sinai: for thou chargedst us, saying, Set bounds about the mount, and sanctify it.",
            "citation": "(Exodus 19:23)"
          },
          "24": {
            "text": "And theLordsaid unto him, Away, get thee down, and thou shalt come up, thou, and Aaron with thee: but let not the priests and the people break through to come up unto theLord, lest he break forth upon them.",
            "citation": "(Exodus 19:24)"
          },
          "25": {
            "text": "So Moses went down unto the people, and spake unto them.",
            "citation": "(Exodus 19:25)"
          }
        }
      },
      "20": {
        "verses": {
          "1": {
            "text": "And Godspakeall thesewords, saying,",
            "citation": "(Exodus 20:1)"
          },
          "2": {
            "text": "IamtheLordthyGod, which have brought thee out of the land ofEgypt, out of the house ofbondage.",
            "citation": "(Exodus 20:2)"
          },
          "3": {
            "text": "Thou shalt havenoothergodsbefore me.",
            "citation": "(Exodus 20:3)"
          },
          "4": {
            "text": "Thou shaltnotmake unto thee anygravenimage, or any likenessof any thingthatisin heaven above, or thatisin the earth beneath, or thatisin the water under the earth:",
            "citation": "(Exodus 20:4)"
          },
          "5": {
            "text": "Thou shalt notbowdown thyself to them, nor serve them: for I theLordthy GodamajealousGod,visitingtheiniquityof thefathersupon thechildrenunto the third and fourthgenerationof them thathateme;",
            "citation": "(Exodus 20:5)"
          },
          "6": {
            "text": "And shewingmercyunto thousands of them that love me, and keep mycommandments.",
            "citation": "(Exodus 20:6)"
          },
          "7": {
            "text": "Thou shalt not take thenameof theLordthy God invain; for theLordwill not hold himguiltlessthattakethhis name in vain.",
            "citation": "(Exodus 20:7)"
          },
          "8": {
            "text": "Remember thesabbathday, to keep itholy.",
            "citation": "(Exodus 20:8)"
          },
          "9": {
            "text": "Sixdays shalt thoulabour, and do all thy work:",
            "citation": "(Exodus 20:9)"
          },
          "10": {
            "text": "But the seventh dayisthe sabbath of theLordthy God:in itthou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thystrangerthatiswithin thy gates:",
            "citation": "(Exodus 20:10)"
          },
          "11": {
            "text": "Forinsixdays theLordmade heaven and earth, the sea, and all that in themis,and rested the seventh day: wherefore theLordblessedthe sabbath day, andhallowedit.",
            "citation": "(Exodus 20:11)"
          },
          "12": {
            "text": "Honourthyfatherand thymother: that thydaysmay belongupon thelandwhich theLordthy God giveth thee.",
            "citation": "(Exodus 20:12)"
          },
          "13": {
            "text": "Thou shalt notkill.",
            "citation": "(Exodus 20:13)"
          },
          "14": {
            "text": "Thou shalt not commitadultery.",
            "citation": "(Exodus 20:14)"
          },
          "15": {
            "text": "Thou shalt notsteal.",
            "citation": "(Exodus 20:15)"
          },
          "16": {
            "text": "Thou shalt not bearfalse witnessagainst thyneighbour.",
            "citation": "(Exodus 20:16)"
          },
          "17": {
            "text": "Thou shalt notcovetthy neighbours house, thou shalt not covet thy neighbourswife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing thatisthy neighbours.",
            "citation": "(Exodus 20:17)"
          },
          "18": {
            "text": "And all the peoplesawthe thunderings, and the lightnings, and the noise of the trumpet, and the mountain smoking: and when the peoplesawit,theyremoved, and stood afar off.",
            "citation": "(Exodus 20:18)"
          },
          "19": {
            "text": "And they said unto Moses, Speak thou with us, and we will hear: but let not Godspeakwith us, lest we die.",
            "citation": "(Exodus 20:19)"
          },
          "20": {
            "text": "And Moses said unto the people,Fear not: forGodiscometoproveyou, andthathis fear may be before your faces, that ye sin not.",
            "citation": "(Exodus 20:20)"
          },
          "21": {
            "text": "And the people stood afar off, and Moses drew near unto the thick darkness where Godwas.",
            "citation": "(Exodus 20:21)"
          },
          "22": {
            "text": "And theLordsaid unto Moses, Thus thou shalt say unto the children of Israel, Ye have seen that I havetalkedwith you from heaven.",
            "citation": "(Exodus 20:22)"
          },
          "23": {
            "text": "Ye shall not makewith megodsof silver, neither shall ye make unto you gods of gold.",
            "citation": "(Exodus 20:23)"
          },
          "24": {
            "text": "An altar of earth thou shalt make unto me, and shaltsacrificethereon thy burnt offerings, and thy peace offerings, thy sheep, and thine oxen: in all places where I record my name I will come unto thee, and I will bless thee.",
            "citation": "(Exodus 20:24)"
          },
          "25": {
            "text": "And if thou wilt make me an altar of stone, thou shalt not build it of hewnstone: for if thou lift up thytoolupon it, thou hast polluted it.",
            "citation": "(Exodus 20:25)"
          },
          "26": {
            "text": "Neither shalt thou go up bystepsunto mine altar, that thy nakedness be notdiscoveredthereon.",
            "citation": "(Exodus 20:26)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 38743,
  "total_sources": 4,
  "generated_at": "2025-12-14T04:01:27.379460"
}