{
  "week_number": 21,
  "date_range": "Joshua 1–8",
  "title": ";23–24",
  "primary_scriptures": [
    {
      "book": "Joshua",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Joshua",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;23–24 ---\nIt had taken several generations, but the Lord’s promise was about to be fulfilled: the children of Israel were finally going to inherit the promised land. But in their way stood the Jordan River, the walls of Jericho, and a mighty people who had rejected the Lord (see\n1 Nephi 17:35\n). And they would have to face all of that without their beloved leader Moses. The situation may have made some Israelites feel weak and fearful, but the Lord said, “Be strong and of a good courage.” What reason did they have to be courageous? It wasn’t because of their own strength—or even Moses’s or Joshua’s—but because “the Lord thy God is with thee whithersoever thou goest” (\nJoshua 1:9\n). When we have our own rivers to cross and walls to bring down, wonderful things can happen in our lives because “the Lord will do wonders among [us]” (\nJoshua 3:5\n).\nFor an overview of the book of Joshua, see “\nJoshua, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nJoshua 1:1–9\nGod will be with me as I strive to be faithful to Him.\nImagine what it might have been like for Joshua to be called to replace Moses. Notice what the Lord said in\nJoshua 1:1–9\nto encourage him. Think about the difficult challenges you face; what in these verses gives you courage?\nThe name Joshua (\nYehoshua\nor\nYeshua\nin Hebrew) means “Jehovah saves.” And the name\nJesus\ncomes from\nYeshua\n. So as you read about Joshua, consider his role in leading the children of Israel across the Jordan River and into the promised land. How was his mission similar to what Christ does for us?\nJoshua 1:8\nThe word of God can make my way prosperous.\nAs He encouraged Joshua, the Lord gave counsel in\nJoshua 1:8\nabout the scriptures, or “the word of the law.” Considering Joshua’s heavy responsibility, why might this counsel have been especially helpful?\nWhen the Lord invites us to read the scriptures, He often uses words that go beyond just reading. He also promises great blessings. The table below can help you discover these invitations and promised blessings:\nInvitation\nPromised blessings\nJoshua 1:8\nInvitation\nMeditate day and night\nPromised blessings\n1 Nephi 15:23–24\nInvitation\nPromised blessings\n2 Nephi 32:3\nInvitation\nPromised blessings\nMosiah 1:7\nInvitation\nPromised blessings\nProsper in the land\nHelaman 3:29–30\nInvitation\nPromised blessings\nDoctrine and Covenants 84:85\nInvitation\nPromised blessings\nRussell M. Nelson, “Hear Him,”\nEnsign\nor\nLiahona\n, May 2020,\nlast paragraph on page 89\nInvitation\nPromised blessings\nHow has the Lord fulfilled these promises in your life? Now may be a good time to evaluate your scripture study habits. What’s going well? What do you feel inspired to do to have more meaningful experiences with the word of God?\nSee also “\nAs I Search the Holy Scriptures\n,”\nHymns\n, no. 277.\nJoshua 2\nBoth faith and works are necessary for salvation.\nNew Testament Christians saw Rahab as an example of the power of both faith and works (see\nHebrews 11:31\n;\nJames 2:25\n). As you read\nJoshua 2\n, consider the role of Rahab’s faith and works in saving herself, her family, and the Israelite spies. What does this teach you about how your faith in Christ and your works can influence yourself and others?\nRahab at her window.\nWaiting for the Promise\n, by Elspeth Young (detail)\nJoshua 3–4\nWith faith in Jesus Christ, I can experience God’s “wonders.”\nThe Lord worked wonders among His people as He led them into the promised land, and He can do the same for you. Here are some questions to guide your study of\nJoshua 3–4\n:\nWhy do you think the Israelites needed to sanctify themselves before they crossed the Jordan River? (see\nJoshua 3:5\n).\nNote that the river parted only after “the feet of the priests … were dipped in the brim of the water” (\nJoshua 3:13, 15\n). Why is that significant?\nSeveral other significant events happened at the Jordan River—see\n2 Kings 2:6–15\n;\n5:1–14\n; and\nMark 1:9–11\n. What connections do you see between these events?\nHow has the Lord done “wonders” in your life? (\nJoshua 3:5\n). How can you experience—or recognize—those wonders more often? (for example, see\nJoshua 3:17\n).\nJoshua 6–8\nObedience invites God’s power into my life.\nJoshua 6–8\ndeals with battles over the lands of Jericho and Ai. As you read these chapters, consider how you battle temptation (for example, see\nJoshua 7:10–13\n). What do you learn about how God can help you and what you need to do to access His power? For example, what impresses you about the Lord’s instructions for taking Jericho? (see\nJoshua 6:1–5\n). Perhaps the account in\nJoshua 7\nwill inspire you to determine if “there is an accursed thing” in your life that you need to remove (\nJoshua 7:13\n).\nJoshua 23–24\n“Choose you this day whom ye will serve.”\nJoshua’s final teachings to the Israelites in\nJoshua 23–24\ninclude important warnings, counsel, and promised blessings. Perhaps you could make a list of what you find. Considering everything the Israelites had been through, why do you think Joshua chose to tell them these things at the end of his life? What do you find that inspires you to “cleave unto the Lord”? (\nJoshua 23:8\n).\nSee also Dale G. Renlund, “\nChoose You This Day\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 104–6.\nStudy Helps\nWhat was the significance of the parting of the Jordan River?\nWhy was Achan’s sin so serious?\nWhat occurred on Mount Gerizim and Mount Ebal?\nClick to see more.\nIdeas for Teaching Children\nJoshua 1–4\n;\n6\n“Be strong and of a good courage.”\nHere is one way to help your children “be strong and of a good courage” (\nJoshua 1:6\n) through Jesus Christ. Invite them to find a phrase that is repeated in\nJoshua 1:6, 9\n, and\n18\n, and write it down or memorize it. Help your children think of situations where they might need this message, just as Joshua did. You could also review together some of the stories in\nJoshua 1–4\n;\n6\n(see also “\nJoshua the Prophet\n” and “\nRahab and the Spies\n” in\nOld Testament Stories\n, 85–91). How did the people in these stories show courage and strength in the Lord?\n2:59\nJoshua the Prophet\n1:39\nRahab and the Spies\nJoshua 1:8\nStudying the scriptures brings me blessings.\nReading\nJoshua 1:8\ncould inspire your children to read the scriptures on their own. Help them find words in this verse that teach them\nhow\nand\nwhy\nwe should read the scriptures. They could look for the same thing in\n1 Nephi 15:23–24\n;\n2 Nephi 31:20\n;\n32:3\n;\nJacob 4:6\n;\nHelaman 3:29–30\n. You could also help them make and carry out a plan to read the scriptures.\nJoshua 3–4\nI must be baptized to enter the kingdom of heaven.\nYou might use the story of the Israelites crossing the Jordan River as a symbol of baptism—giving up our old life in the wilderness and starting a new one in a covenant relationship with God. So as you read together\nJoshua 3–4\n(or “\nJoshua the Prophet\n” in\nOld Testament Stories\n, 85–89), you could also look at a picture of Jesus being baptized and explain that Jesus was baptized in the same river the Israelites crossed. You could then sing a song such as “\nBaptism\n” (\nChildren’s Songbook\n, 100–101). Share with each other how being baptized is like starting a new life in Jesus Christ’s kingdom.\n2:59\nJoshua the Prophet\nJoshua 24:15\nI can choose to serve Jesus Christ.\nWhat could you do to help your children learn to choose to follow Jesus Christ, as Joshua invited the Israelites to do? You might invite them to:\nMemorize a short phrase\nfrom\nJoshua 24:15\n. Try to make it fun for your children. The number of words they memorize may depend on their age.\nFind stories\nabout people who chose to serve Jesus Christ. They could look in the\nFriend\nmagazine, the\nGospel Art Book\n, or\nOld Testament Stories\nand other scripture stories books.\nRole-play situations\nin which they can choose to follow and serve the Savior.\nUse a variety of activities.\n“All children are different, and as they develop, their needs will change. Varying your teaching methods will help you meet their diverse needs” (\nTeaching in the Savior’s Way\n,\n31\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 21: Lesson 56: Lesson 56—Numbers 11–14This lesson can help students view their challenges with greater faith in Jesus Christ.; Lesson 57: Lesson 57—Numbers 21This lesson can help students look to Jesus Christ in faith. ---\n\n--- Lesson 56 ---\nSometimes it can be difficult to move forward with faith instead of fear. The children of Israel faced that challenge. After they journeyed in the wilderness, the Lord led the Israelites to the border of the promised land. The Lord instructed Moses to send 12 men into the land and have them bring back a report of the land and its inhabitants. Most of the 12 were afraid about the prospect of conquering the promised land, but Caleb and Joshua had faith that the Lord would help them. This lesson can help students view their challenges with greater faith in Jesus Christ. Student preparation: Invite students to think about obstacles or challenges they are currently facing. They could ponder how they are facing them with fear or with faith in the Lord. Possible Learning Activities Viewing challenges with faith Consider writing two headings on opposite sides of the board: Faith and Fear . Display the following experiences, or other relevant examples, one at a time. Invite students to ponder if they view each example with faith in Jesus Christ or with fear. A big test or school project Repentance The future Sharing the gospel How can we tell if we are viewing a situation with faith in Jesus Christ or with fear? What difference does it make if we view a situation with faith or fear? Why can it sometimes be difficult to see situations like these with faith in Jesus Christ? Continue to ponder these questions as you study today. Invite the Holy Ghost into your learning as you think about how to view your challenges with greater faith in Jesus Christ. The spies’ report of Canaan After the children of Israel traveled in the wilderness, the Lord brought them to the border of the promised land. It was the land of Canaan. The Lord told them they would need to conquer the land. The Lord instructed Moses to select one member from each of the twelve tribes. These men were commanded to inspect the land and bring back a report of what they found. After 40 days of investigating the land, the 12 men returned with their reports, along with fruit from the land (see Numbers 13:1–25 ). Consider dividing the class into thirds. Invite each group to read one of the following accounts. Ask students to imagine that they represent the people they read about. They can prepare answers to the questions that follow. Each group could then share their answers, or you could have a student or two come to the front and use the questions to interview each group. 1. Numbers 13:26–29, 31–33 : The 10 spies’ report of the land and the people How would you describe the land of Canaan and the people you saw? What feelings did you have when you saw the people? Why? 2. Numbers 14:1–4 : The Israelites’ response to the 10 spies’ report What feelings did you have when you listened to the 10 spies’ report? Why? What did you suggest the people do rather than follow Moses into the promised land? Why? 3. Numbers 13:30 ; 14:6–9 : Joshua and Caleb’s report of the land and the people How would you describe the land of Canaan and the people you saw? The other spies are convinced that Israel cannot overcome the people in Canaan. Why are you so sure that Israel can? After each group has answered their questions, thank them for their participation. Review Numbers 13:30 ; 14:8–9 , looking for words and phrases that show Caleb and Joshua’s faith in the Lord. What lessons do you learn from Caleb and Joshua? Among various answers students might give, help them identify the truth that trusting in the Lord can help us see our challenges with faith rather than fear . What do you think it means to act with faith in Heavenly Father and Jesus Christ when we face challenges? Faith versus fear Elder Kevin R. Duncan of the Seventy explained something we can learn from the experience of the children of Israel in Numbers 13–14 : Just like the children of Israel, we face formidable obstacles. … It isn’t wrong for us to recognize those obstacles. But it is important that we face them with faith. … … Each challenge and each obstacle we face is an opportunity to choose, as did Joshua and Caleb, to rely on the Lord. “Rebel not … , neither fear” ( Numbers 14:9 ) was good counsel for the children of Israel, and it is still good counsel for each of us today. (“ Rebel Not, Neither Fear ,” Liahona , Apr. 2022, 47) What experiences had the children of Israel previously had with the Lord? How could remembering these experiences have increased their faith in Him? Why do you think some people forget what they know about the Lord when facing a challenge? Despite the many miracles the Lord had provided and the testimony of Caleb and Joshua, the Israelites continued to murmur. As a result, the Lord declared that because of their murmuring and doubt, the great majority of the adult Israelites would not be allowed to enter the promised land (see Numbers 14:26–39 ). Read Numbers 14:24, 30 , looking for how the Lord blessed Caleb and Joshua because they placed their faith in Him. To help students face their challenges with faith, consider displaying the following chart on the board. Invite them to copy the chart into their study journals. Challenge: Fear-Based Statement Faith-Based Statement Fear-Based Statement Faith-Based Statement Invite students to share some modern-day challenges they may face and ways they could respond with fear or faith. You might provide an example such as: Challenge: Speaking in public settings Fear-based statement: “I can’t speak in front of others because I always nervously mix up my words.” Faith-based statement: “Public speaking is hard for me, but I believe the Lord can give me courage and strength to do it.” Students could use the situations from the beginning of the lesson. For the following activity, consider providing pieces of paper for the students. Ponder a challenge you face, or might face, in your life. Write the challenge in your chart along with a fear-based statement you might think or believe about that challenge. Reflect on what the Holy Ghost has taught you about Heavenly Father and Jesus Christ from the scriptures, the words of the prophets, and your own spiritual experiences. Think about how this knowledge can help you face challenges with faith in the Lord. Then write a faith-based statement in your journal. You might also want to write the faith-based statement on a piece of paper that you can take home and set it somewhere you will see often. Or take a picture of the statement on your phone. You could even set the picture as your wallpaper on your phone. Consider inviting a few willing students to share their thoughts and feelings about Heavenly Father and Jesus Christ. They can share how the Lord helps them face challenges with faith. Testify that the Lord will bless us as we faithfully face our challenges.\n\n\n--- Lesson 57 ---\nAs the children of Israel continued through the wilderness, they complained against the Lord. In response, He sent venomous serpents among them. He then instructed Moses to set a brass serpent upon a pole as a symbol of the Savior and promised that those who looked upon it would be healed. This lesson can help students look to Jesus Christ in faith. Student preparation: Invite students to read Numbers 21:7–9 and Alma 33:18–21 , looking for what we can learn from this account in the Old Testament. Encourage them to be prepared to share what they learned in class. Possible Learning Activities A snake bite Consider beginning class by showing a picture of a snake. What do you think it would be like to be bitten by a venomous snake? Help students understand that being bitten by a venomous snake can cause swelling, blistering, severe pain, and illness. In extreme cases, it can even be deadly. What are some of the different ways people may react after being bitten? Some possible answers are: panic, seek revenge on the snake and kill it, wait to see how their body reacts to the bite, or immediately get help. Next to the snake, write sin . Invite students to compare how sin and its consequences might be like a snake bite. What are some of the different ways people may react after sinning? Some possible answers are rationalizing their actions, looking to numb their feelings, hiding their actions because of shame or embarrassment, waiting to see what further consequences they face, or looking to the Lord for help. Take a moment to ponder how you react. Do you look to the Lord for help? Why or why not? As you study this lesson, seek the guidance of the Holy Ghost to help you look to the Savior for help in your life. You can also look for help with any questions or concerns you have about looking to the Savior. The fiery serpents As they had done many times before, the children of Israel complained against the Lord as they traveled through the wilderness. Read the following verses and answer their accompanying questions. It may be useful to know that fiery means “poisonous” (see footnote 6a ). Consider displaying or writing the following verses and questions on the board. You could invite students to study them together in small groups, or invite students to study the verses on their own, then share their answers with a partner or small group to confirm their answers. If useful, explain that because the children of Israel were not allowed to travel through the land of Edom, but had to travel around it (see Numbers 21:4 ), which means their journey would be longer and more difficult. Numbers 21:4–5 . Why did the children of Israel speak against the Lord and Moses? Numbers 21:6 . In response, what did the Lord send? Numbers 21:7–9 . What did the Lord instruct Moses and the children of Israel to do to be healed? 1 Nephi 17:41 ; Alma 33:18–21 . Why did some of the children of Israel not look? Consider inviting students to write the Book of Mormon verses as cross-references to Numbers 21:9 or highlight footnote 9a . What stood out to you from this account? How might we be similar at times to the children of Israel? A symbol for the Savior During His mortal ministry, the Savior helped us understand what the brass serpent on the pole symbolized. Read John 3:14–16 , looking for the answer. (You may want to mark this as a cross-reference to Numbers 21:7–9 .) After students share what they found, consider showing the following images. What can we learn from these accounts? Students may share a principle similar to the following: As we look to the Savior in faith , He will heal us spiritually . Consider writing this principle on the board. To better understand this principle, invite students to read the following statements. President Russell M. Nelson taught: I plead with you to come unto Him so that He can heal you! He will heal you from sin as you repent. He will heal you from sadness and fear. He will heal you from the wounds of this world. (“ The Answer Is Always Jesus Christ ,” Liahona , May 2023, 127) What did you like or learn from this statement? How might being healed from venom be like being healed by the Savior from the consequences of sin? Look to the Savior Invite students to take a minute to look at the picture of the Savior on the cross and ponder ways we can look to Him in faith today. Then invite them to do the following in small groups. List several ways we can look to the Savior in faith today. Discuss reasons we may struggle to do these things. (You might discuss why we, like the children of Israel, might be tempted to believe these ways to look to the Savior are too simple or will not help us.) Despite any struggles, discuss why it is worth it to look to the Savior. (This might include sharing scriptural examples of the Savior’s healings, your feelings or testimony about looking to the Savior, or experiences you have had when you looked to the Savior in faith and what happened.) If students need some ideas of ways we can look to the Savior, invite them to look for examples from the young man in “ Atonement: Not a One-Time Thing ” (3:00). 3:1 Ask students to share some of the highlights of their discussions. If students do not naturally share feelings, testimony, or experiences, consider giving them the following prompt: I believe it is worth it to look to the Savior in faith because . The activity above is an example of helping students consider their feelings about Jesus Christ. Helping students do this can allow the Holy Ghost to testify of Him. (For additional training see: “ Bear testimony often and invite learners to share their feelings, experiences, and testimonies ,” in Teacher Development Skills ). As students share, be sure it is clear that the Savior will help and heal us in the way and time that is best for us. What you believe Seek the help of the Holy Ghost as you write down one way you believe the Lord wants you to look to Him, or continue to look to Him, in your life. You also might write why it may be difficult but still worth it.\n\n--- SCRIPTURE: Joshua 1 ---\n1. Now after thedeathof Moses the servant of theLordit came to pass, that theLordspake unto Joshua the son of Nun, Moses minister, saying,\n2. Moses my servant is dead; now therefore arise, go over this Jordan,thou, and all this people, unto thelandwhich I do give to them,evento the children of Israel.\n3. Every place that the sole of your foot shall tread upon, that have I given unto you, as I said unto Moses.\n4. From the wilderness and thisLebanoneven unto the great river, the river Euphrates, all the land of the Hittites, and unto thegreat seatoward the going down of the sun, shall be yourcoast.\n5. There shall not any man be able to stand before thee all the days of thy life: as I was withMoses,soI will bewith thee: I will not fail thee, norforsakethee.\n6. Be strong and of goodcourage: for unto this people shalt thoudividefor aninheritancetheland, which I sware unto their fathers to give them.\n7. Only be thou strong and verycourageous, that thou mayest observe to do according to all the law, which Moses my servant commanded thee:turnnot from ittothe right hand ortothe left, that thou mayestprosperwhithersoever thou goest.\n8. This book of thelawshall not depart out of thy mouth; but thou shaltmeditatetherein day and night, that thou mayest observe to do according to all that is written therein: for then thou shalt make thy way prosperous, and then thou shalt have good success.\n9. Have not I commanded thee? Be strong and of good courage; be not afraid, neither be thou dismayed: for theLordthy Godiswith thee whithersoever thou goest.\n10. Then Joshua commandedtheofficers of the people, saying,\n11. Pass throughthe host, and command the people, saying, Prepare youvictuals; for within three days ye shall pass over this Jordan, to go in topossessthe land, which theLordyour God giveth you to possess it.\n12. And to the Reubenites, and to the Gadites, and to half the tribe of Manasseh, spake Joshua, saying,\n13. Remember thewordwhich Moses the servant of theLordcommanded you, saying, TheLordyour God hath given yourest, and hath given you this land.\n14. Your wives, your little ones, and your cattle, shall remain in the land which Moses gave you on this side Jordan; but ye shall pass before your brethren armed, all the mighty men of valour, and help them;\n15. Until theLordhave given your brethren rest, ashe hath givenyou, and they also have possessed the land which theLordyour God giveth them: then ye shall return unto the land of your possession, and enjoy it, which Moses theLords servant gave you on this side Jordan toward the sunrising.\n16. And they answered Joshua, saying, All that thou commandest us we will do, and whithersoever thou sendest us, we will go.\n17. According as we hearkened unto Moses in all things, so will we hearken unto thee: only theLordthy God be with thee, as he was with Moses.\n18. Whosoeverhe bethat dothrebelagainst thy commandment, and will not hearken unto thy words in all that thou commandest him, he shall be put todeath: only be strong and of good courage.\n\n--- SCRIPTURE: Joshua 2 ---\n1. And Joshua the son of Nun sent out of Shittim two men to spy secretly, saying, Go view the land, even Jericho. And they went, and came into an harlots house, namedRahab, and lodged there.\n2. And it was told the king of Jericho, saying, Behold, there came men in hither to night of the children of Israel to search out the country.\n3. And the king of Jericho sent unto Rahab, saying, Bring forth the men that are come to thee, which are entered into thine house: for they be come to search out all the country.\n4. And the woman took the two men, and hid them, and said thus, There came men unto me, but I wist not whence theywere:\n5. And it came to passabout the timeof shutting of the gate, when it was dark, that the men went out: whither the men went Iwotnot: pursue after them quickly; for ye shall overtake them.\n6. But she had brought them up to the roof of the house, and hid them with the stalks of flax, which she had laid in order upon the roof.\n7. And the men pursued after them the way to Jordan unto the fords: and as soon as they which pursued after them were gone out, they shut the gate.\n8. And before they were laid down, she came up unto them upon the roof;\n9. And she said unto the men, I know that theLordhath given you the land, and that yourterroris fallen upon us, and that all the inhabitants of the landfaintbecause of you.\n10. For we haveheardhow theLorddried up the water of theRed seafor you, when ye came out of Egypt; and what ye did unto the two kings of theAmorites, thatwereon the other side Jordan, Sihon and Og, whom ye utterly destroyed.\n11. And as soon as we hadheardthese things,ourheartsdid melt, neither did there remain any more courage in any man, because of you: for theLordyour God, heisGodinheavenabove, and in earth beneath.\n12. Now therefore, I pray you,swearunto me by theLord, since I have shewed youkindness, that ye will also shew kindness unto my fathers house, and give me true token:\n13. Andthatye will save alive my father, and my mother, and my brethren, and my sisters, and all that they have, and deliver our lives from death.\n14. And the men answered her, Our life for yours, if ye utter not this our business. And it shall be, when theLordhath given us the land, that we will deal kindly and truly with thee.\n15. Then she let them down by acordthrough the window: for her housewasupon the town wall, and she dwelt upon the wall.\n16. And she said unto them, Get you to the mountain, lest the pursuers meet you; and hide yourselves there three days, until the pursuers be returned: and afterward may ye go your way.\n17. And the men said unto her, Wewill beblamelessof this thine oath which thou hast made us swear.\n18. Behold,whenwe come into the land, thou shalt bind this line of scarlet thread in the window which thou didst let us down by: and thou shalt bring thyfather, and thy mother, and thy brethren, and all thy fathers household, home unto thee.\n19. And it shall be,thatwhosoever shall go out of the doors of thy house into the street, his bloodshall beupon his head, and wewill beguiltless: and whosoever shall be with thee in the house, his bloodshall beon our head, ifanyhand be upon him.\n20. And if thou utter this our business, then we will be quit of thine oath which thou hast made us to swear.\n21. And she said, According unto your words, sobeit. And she sent them away, and they departed: and she bound the scarlet line in the window.\n22. And they went, and came unto the mountain, and abode there three days, until the pursuers were returned: and the pursuers soughtthemthroughout all the way, but foundthemnot.\n23. So the two men returned, and descended from the mountain, and passed over, and came to Joshua the son of Nun, and told him allthingsthat befell them:\n24. And they said unto Joshua, Truly theLordhathdeliveredinto our hands all the land; for even all the inhabitants of the country do faint because of us.\n\n--- SCRIPTURE: Joshua 3 ---\n1. And Joshua rose early in the morning; and they removed from Shittim, and came to Jordan, he and all the children of Israel, and lodged there before they passed over.\n2. And it came to pass after three days, that the officers went through the host;\n3. And they commanded the people, saying, When ye see thearkof the covenant of theLordyour God, and the priests the Levites bearing it, then ye shall remove from your place, and go after it.\n4. Yet there shall be space between you and it, about two thousand cubits by measure: come not near unto it, that ye may know thewayby which ye must go: for ye have not passedthisway heretofore.\n5. And Joshua said unto the people,Sanctify yourselves: for to morrow theLordwill do wonders among you.\n6. And Joshua spake unto the priests, saying, Take up the ark of the covenant, and pass over before the people. And they took up the ark of the covenant, and went before the people.\n7. And theLordsaid unto Joshua, This day will I begin tomagnifythee in the sight of all Israel, that they may know that, as I was with Moses,soI will be with thee.\n8. And thou shalt command the priests that bear the ark of the covenant, saying, When ye are come to the brink of the water of Jordan, ye shall stand still in Jordan.\n9. And Joshua said unto the children of Israel, Come hither, and hear the words of theLordyour God.\n10. And Joshua said, Hereby ye shall know that theliving Godisamong you, andthathe will without fail drive out from before you theCanaanites, and the Hittites, and the Hivites, and the Perizzites, and the Girgashites, and the Amorites, and the Jebusites.\n11. Behold, the ark of the covenant of the Lord of all the earth passeth over before you into Jordan.\n12. Now therefore take you twelve men out of the tribes of Israel, out of every tribe man.\n13. And it shall come to pass, as soon as the soles of the feet of the priests that bear the ark of theLord, the Lord of all the earth, shall rest in the waters of Jordan,thatthe waters of Jordan shall be cut offfromthe waters that come down from above; and they shall stand upon anheap.\n14. And it came to pass, when the people removed from their tents, to pass over Jordan, and the priests bearing the ark of the covenant before the people;\n15. And as they that bare the ark were come unto Jordan, and the feet of the priests that bare the ark were dipped in the brim of the water, (for Jordan overfloweth all his banks all the time of harvest,)\n16. That thewaterswhich came down fromabovestoodandrose up upon anheapvery far from the city Adam, thatisbeside Zaretan: and those that came down toward the sea of the plain,eventhesalt sea, failed,andwere cut off: and the people passed over right against Jericho.\n17. And the priests that bare the ark of the covenant of theLordstood firm ondryground in the midst of Jordan, and all the Israelites passed over on dry ground, until all the people were passed clean over Jordan.\n\n--- SCRIPTURE: Joshua 4 ---\n1. And it came to pass, when all the people werecleanpassed over Jordan, that theLordspake unto Joshua, saying,\n2. Take you twelve men out of the people, out of every tribe man,\n3. And command ye them, saying, Take you hence out of the midst of Jordan, out of the place where the priests feet stood firm,twelvestones, and ye shall carry them over with you, and leave them in the lodging place, where ye shall lodge this night.\n4. Then Joshua called thetwelvemen, whom he had prepared of the children of Israel, out of every tribe man:\n5. And Joshua said unto them, Pass over before the ark of theLordyour God into the midst of Jordan, and take ye up every man of you stone upon his shoulder, according unto the number of the tribes of the children of Israel:\n6. That this may be sign among you,thatwhen yourchildrenasktheir fathersin time to come, saying, Whatmeanye by these stones?\n7. Then ye shall answer them, That the waters of Jordan were cut off before thearkof the covenant of theLord; when it passed over Jordan, the waters of Jordan were cut off: and these stones shall be for amemorialunto the children of Israel for ever.\n8. And the children of Israel did so as Joshua commanded, and took up twelve stones out of the midst ofJordan, as theLordspake unto Joshua, according to the number of the tribes of the children of Israel, and carried them over with them unto the place where they lodged, and laid them down there.\n9. And Joshua set up twelve stones in the midst of Jordan, in the place where the feet of the priests which bare the ark of the covenant stood: and they are there unto this day.\n10. For the priests which bare the ark stood in the midst of Jordan, until every thing was finished that theLordcommanded Joshua to speak unto the people, according to all that Moses commanded Joshua: and the people hasted and passed over.\n11. And it came to pass, when all the people were cleanpassedover, that the ark of theLordpassed over, and the priests, in the presence of the people.\n12. And the children of Reuben, and the children of Gad, and half the tribe of Manasseh, passed over armed before the children of Israel, as Moses spake unto them:\n13. About forty thousand prepared for war passed over before theLordunto battle, to the plains of Jericho.\n14. On that day theLordmagnifiedJoshua in the sight of all Israel; and they feared him, as they feared Moses, all the days of his life.\n15. And theLordspake unto Joshua, saying,\n16. Command the priests that bear the ark of thetestimony, that they come up out of Jordan.\n17. Joshua therefore commanded the priests, saying, Come ye up out of Jordan.\n18. And it came to pass, when the priests that bare the ark of the covenant of theLordwere come up out of the midst of Jordan,andthe soles of the priests feet were lifted up unto the dry land, that the waters of Jordan returned unto their place, and flowed over all his banks, asthey didbefore.\n19. And the people came up out of Jordan on the tenthdayof the first month, and encamped inGilgal, in the east border of Jericho.\n20. And those twelve stones, which they took out of Jordan, did Joshua pitch in Gilgal.\n21. And he spake unto the children of Israel, saying, When your children shall ask their fathers in time to come, saying, Whatmeanthese stones?\n22. Then ye shall let yourchildrenknow, saying, Israel came over this Jordan on dry land.\n23. For theLordyour God dried up the waters of Jordan from before you, until ye were passed over, as theLordyour God did to the Red sea, which hedriedup from before us, until we were gone over:\n24. That all the people of the earth mightknowthe hand of theLord, that itismighty: that ye mightfeartheLordyour God for ever.\n\n--- SCRIPTURE: Joshua 5 ---\n1. And it came to pass, when all the kings of the Amorites, whichwereon the side of Jordan westward, and all the kings of the Canaanites, whichwereby the sea,heardthat theLordhad dried up the waters of Jordan from before the children of Israel, until we were passed over, that theirheartmelted, neither was there spirit in them any more, because of the children of Israel.\n2. At that time theLordsaid unto Joshua, Make theesharp knives, andcircumciseagain the children of Israel the second time.\n3. And Joshua made him sharp knives, and circumcised the children of Israel at the hill of the foreskins.\n4. And thisisthe cause why Joshua did circumcise: All the people that came out of Egypt,that weremales,evenall the men of war, died in the wilderness by the way, after they came out of Egypt.\n5. Now all the people that came out were circumcised: but all the peoplethat wereborn in the wilderness by the way as they came forth out of Egypt,themthey had not circumcised.\n6. For the children of Israel walked forty years in the wilderness, till all the peoplethat weremen of war, which came out of Egypt, were consumed, because theyobeyed notthe voice of theLord: unto whom theLordsware that he would not shew them theland, which theLordswareunto their fathers that he would give us, land that floweth with milk and honey.\n7. And their children,whomhe raised upin their stead, them Joshua circumcised: for they were uncircumcised, because they had not circumcised them by the way.\n8. And it came to pass, when they had done circumcising all the people, that they abode in their places in the camp, till they werewhole.\n9. And theLordsaid unto Joshua, This day have I rolled away the reproach of Egypt from off you. Wherefore the name of the place is calledGilgalunto this day.\n10. And the children of Israel encamped in Gilgal, and kept thepassoveron the fourteenth day of the month at even in the plains of Jericho.\n11. And they did eat of theold cornof the land on the morrow after the passover,unleavenedcakes, and parchedcornin the selfsame day.\n12. And themannaceased on the morrow after they had eaten of the old corn of the land; neither had the children of Israel manna any more; but they did eat of the fruit of the land of Canaan that year.\n13. And it came to pass, when Joshua was by Jericho, that he lifted up his eyes and looked, and, behold, there stood amanover against him with his sword drawn in his hand: and Joshua went unto him, and said unto him,Artthou for us, or for our adversaries?\n14. And he said, Nay; butascaptain of thehostof theLordam I now come. And Joshua fell on his face to the earth, and did worship, and said unto him, What saith my lord unto his servant?\n15. And the captain of theLords host said unto Joshua, Loose thyshoefrom off thy foot; for the place whereon thou standestisholy. And Joshua did so.\n\n--- SCRIPTURE: Joshua 6 ---\n1. NowJerichowas straitly shut up because of the children of Israel: none went out, and none came in.\n2. And theLordsaid unto Joshua, See, I have given into thine hand Jericho, and the king thereof,andthe mighty men of valour.\n3. And ye shallcompassthe city, allyemen of war,andgo round about the city once. Thus shalt thou do six days.\n4. And seven priests shall bear before the ark seven trumpets of rams horns: and the seventh day ye shall compass the city seven times,and the priests shall blow with the trumpets.\n5. And it shall come to pass, that when they make longblastwith the rams horn,andwhen ye hear the sound of the trumpet, all the people shall shout with great shout; and the wall of the city shall fall down flat, and the people shall ascend up every man straight before him.\n6. And Joshua the son of Nun called the priests, and said unto them, Take up thearkof the covenant, and let seven priests bear seven trumpets of rams horns before the ark of theLord.\n7. And he said unto the people, Pass on, and compass the city, and let him that is armed pass on before the ark of theLord.\n8. And it came to pass, when Joshua had spoken unto the people, that the seven priests bearing the seven trumpets of rams horns passed on before theLord, and blew with the trumpets: and the ark of the covenant of theLordfollowed them.\n9. And the armed men went before the priests that blew with the trumpets, andthe rearwardcame after the ark,the priestsgoing on, and blowing with the trumpets.\n10. And Joshua had commanded the people, saying, Ye shall not shout, nor make any noise with your voice, neither shallanyword proceed out of your mouth, until the day I bid you shout; then shall ye shout.\n11. So the ark of theLordcompassed the city, going aboutitonce: and they came into the camp, and lodged in the camp.\n12. And Joshua rose early in the morning, and the priests took up the ark of theLord.\n13. And seven priests bearing seven trumpets of rams horns before the ark of theLordwent on continually, and blew with the trumpets: and the armed men went before them; but the rearward came after the ark of theLord,the priestsgoing on, and blowing with the trumpets.\n14. And the second day they compassed the city once, and returned into the camp: so they did six days.\n15. And it came to pass on the seventh day, that they rose early about the dawning of the day, and compassed the city after the same manner seven times: only on that day they compassed the city seven times.\n16. And it came to pass at the seventh time, when the priests blew with the trumpets, Joshua said unto the people, Shout; for theLordhath given you the city.\n17. And the city shall be accursed,evenit, and all thataretherein, to theLord: only Rahab the harlot shall live, she and all thatarewith her in the house, because she hid the messengers that we sent.\n18. And ye, in any wise keepyourselvesfromthe accursed thing, lest ye makeyourselvesaccursed, when ye take of the accursed thing, and make the camp of Israel curse, and trouble it.\n19. But all the silver, and gold, and vessels of brass and iron,areconsecrated unto theLord: they shall come into the treasury of theLord.\n20. So the people shouted whenthe priestsblew with the trumpets: and it came to pass, when the people heard the sound of the trumpet, and the people shouted with great shout, that thewallfell down flat, so that the people went up into the city, every man straight before him, and they took the city.\n21. And they utterlydestroyedall thatwasin the city, both man and woman, young and old, and ox, and sheep, and ass, with the edge of the sword.\n22. But Joshua had said unto the two men that had spied out thecountry, Go into the harlots house, and bring out thence the woman, and all that she hath, as ye sware unto her.\n23. And the young men that were spies went in, and brought outRahab, and her father, and her mother, and her brethren, and all that she had; and they brought out all her kindred, and left them without the camp of Israel.\n24. And they burnt the city with fire, and all thatwastherein: only the silver, and the gold, and the vessels of brass and of iron, they put into the treasury of the house of theLord.\n25. And Joshua saved Rahab the harlot alive, and her fathers household, and all that she had; and she dwelleth in Israelevenunto this day; because she hid the messengers, which Joshua sent to spy out Jericho.\n26. And Joshuaadjuredthemat that time, saying, Cursedbethe man before theLord, that riseth up and buildeth this cityJericho: he shall lay the foundation thereof in his firstborn, and in his youngestsonshall he set up the gates of it.\n27. So theLordwaswithJoshua; and his fame wasnoisedthroughout all the country.\n\n--- SCRIPTURE: Joshua 7 ---\n1. But the children of Israel committed trespass in the accursed thing: forAchan, the son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, took of theaccursedthing: and the anger of theLordwas kindled against the children of Israel.\n2. And Joshua sent men from Jericho to Ai, whichisbesideBeth-aven, on the east side of Beth-el, and spake unto them, saying, Go up and view the country. And the men went up and viewed Ai.\n3. And they returned to Joshua, and said unto him, Let not all the people go up; but let about two or three thousand men go up and smite Ai;andmake not all the people to labour thither; for theyare butfew.\n4. So there went up thither of the people about three thousand men: and theyfledbefore the men of Ai.\n5. And the men of Ai smote of them about thirty and six men: for they chased themfrombefore the gateevenuntoShebarim, and smote them in thegoing down: wherefore the hearts of the people melted, and became as water.\n6. And Joshuarenthis clothes, and fell to the earth upon his face before the ark of theLorduntil the eventide, he and the elders of Israel, and put dust upon their heads.\n7. And Joshua said, Alas, O LordGod, wherefore hast thou at all brought this people over Jordan, to deliver us into the hand of the Amorites, to destroy us? would to God we had been content, and dwelt on the other side Jordan!\n8. O Lord, what shall I say, when Israel turneth their backs before their enemies!\n9. For the Canaanites and all the inhabitants of the land shall hearof it,and shallenvironus round, and cut off our name from the earth: and what wilt thou do unto thy greatname?\n10. And theLordsaid unto Joshua, Get thee up; wherefore liest thou thus upon thy face?\n11. Israel hathsinned, and they have also transgressed my covenant which I commanded them: for they have even taken of the accursed thing, and have also stolen, anddissembledalso, and they have putiteven among their own stuff.\n12. Therefore the children of Israel could not stand before their enemies,butturnedtheirbacks before their enemies, because they were accursed: neither will I be with you any more, except ye destroy the accursed from among you.\n13. Up,sanctifythe people, and say,Sanctifyyourselves against to morrow: for thus saith theLordGod of Israel,There isan accursed thing in the midst of thee, O Israel: thou canst not stand before thine enemies, until ye take away the accursed thing from among you.\n14. In the morning therefore ye shall be brought according to your tribes: and it shall be,thatthe tribe which theLordtaketh shall come according to the familiesthereof;and thefamilywhich theLordshall take shall come by households; and the household which theLordshall take shall come man by man.\n15. And it shall be,thathe that is taken with the accursed thing shall be burnt with fire, he and all that he hath: because he hath transgressed the covenant of theLord, and because he hathwrought follyin Israel.\n16. So Joshua rose up early in the morning, and brought Israel by their tribes; and the tribe of Judah was taken:\n17. And he brought the family of Judah; and he took the family of the Zarhites: and he brought the family of the Zarhites man by man; and Zabdi was taken:\n18. And he brought his household man by man; and Achan, the son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, was taken.\n19. And Joshua said unto Achan, My son, give, I pray thee,gloryto theLordGod of Israel, and makeconfessionunto him; andtellme now what thou hast done; hideitnot from me.\n20. And Achan answered Joshua, and said, Indeed I have sinned against theLordGodof Israel, and thus and thus have I done:\n21. When I saw among the spoils goodlyBabylonishgarment, and two hundred shekels of silver, and wedge of gold of fifty shekels weight, then Icovetedthem, and took them; and, behold, theyarehid in the earth in the midst of my tent, and the silver under it.\n22. So Joshua sent messengers, and they ran unto the tent; and, behold,it washid in his tent, and the silver under it.\n23. And they took them out of the midst of the tent, and brought them unto Joshua, and unto all the children of Israel, and laid them out before theLord.\n24. And Joshua, and all Israel with him, took Achan the son of Zerah, and the silver, and the garment, and the wedge of gold, and his sons, and his daughters, and his oxen, and his asses, and his sheep, and his tent, and all that he had: and they brought them unto the valley of Achor.\n25. And Joshua said, Why hast thou troubled us? theLordshall trouble thee this day. And all Israel stoned him with stones, and burned them with fire, after they had stoned them with stones.\n26. And they raised over him great heap of stones unto this day. So theLordturned from the fierceness of his anger. Wherefore the name of that place was called, The valley ofAchor, unto this day.\n\n--- SCRIPTURE: Joshua 8 ---\n1. And theLordsaid unto Joshua, Fear not, neither be thou dismayed: take all the people of war with thee, and arise, go up to Ai: see, I have given into thy hand the king of Ai, and his people, and his city, and his land:\n2. And thou shalt do to Ai and her king as thou didst untoJerichoand her king: only the spoil thereof, and the cattle thereof, shall ye take for prey unto yourselves: lay thee an ambush for the city behind it.\n3. So Joshua arose, and all the people of war, to go up against Ai: and Joshua chose out thirty thousand mighty men of valour, and sent them away by night.\n4. And he commanded them, saying, Behold, ye shall lie in wait against the city,evenbehind the city: go not very far from the city, but be ye all ready:\n5. And I, and all the people thatarewith me, will approach unto the city: and it shall come to pass, when they come out against us, as at the first, that we will flee before them,\n6. (For they will come out after us) till we have drawn them from the city; for they will say, They flee before us, as at the first: therefore we will flee before them.\n7. Then ye shall rise up from the ambush, and seize upon the city: for theLordyour God will deliver it into your hand.\n8. And it shall be, when ye have taken the city,thatye shall set the city on fire: according to the commandment of theLordshall ye do. See, I have commanded you.\n9. Joshua therefore sent them forth: and they went to lie in ambush, and abode between Beth-el and Ai, on the west side of Ai: but Joshua lodged that night among the people.\n10. And Joshua rose up early in the morning, and numbered the people, and went up, he and the elders of Israel, before the people to Ai.\n11. And all the people,even the peopleof war thatwerewith him, went up, and drew nigh, and came before the city, andpitchedon the north side of Ai: nowthere wasa valley between them and Ai.\n12. And he took about five thousand men, and set them to lie in ambush between Beth-el and Ai, on the west side of the city.\n13. And when they had set the people,evenall the host thatwason the north of the city, andtheir liers in waiton the west of the city, Joshua went that night into the midst of the valley.\n14. And it came to pass, when the king of Ai sawit,that they hasted and rose up early, and the men of the city went out against Israel to battle, he and all his people, at time appointed, before the plain; but hewistnot thatthere wereliers in ambush against him behind the city.\n15. And Joshua and all Israel made as if they were beaten before them, and fled by the way of the wilderness.\n16. And all the people thatwerein Ai were called together to pursue after them: and they pursued after Joshua, and were drawn away from the city.\n17. And there was not man left in Ai orBeth-el, that went not out after Israel: and they left the city open, and pursued after Israel.\n18. And theLordsaid unto Joshua, Stretch out the spear thatisin thy hand toward Ai; for I will give it into thine hand. And Joshua stretched out the spear thathe hadin his hand toward the city.\n19. And the ambush arose quickly out of their place, and they ran as soon as he had stretched out his hand: and they entered into the city, and took it, and hasted and set the city on fire.\n20. And when the men of Ai looked behind them, they saw, and, behold, the smoke of the city ascended up to heaven, and they had no power to flee this way or that way: and the people that fled to the wilderness turned back upon the pursuers.\n21. And when Joshua and all Israel saw that the ambush had taken the city, and that the smoke of the city ascended, then they turned again, and slew the men of Ai.\n22. And the other issued out of the city against them; so they were in the midst of Israel, some on this side, and some on that side: and they smote them, so that they let none of them remain or escape.\n23. And the king of Ai they took alive, and brought him to Joshua.\n24. And it came to pass, when Israel had made an end of slaying all the inhabitants of Ai in the field, in the wilderness wherein they chased them, and when they were all fallen on the edge of the sword, until they were consumed, that all the Israelites returned unto Ai, and smote it with the edge of the sword.\n25. Andsoit was,thatall that fell that day, both of men and women,weretwelve thousand,evenall the men of Ai.\n26. For Joshua drew not his hand back, wherewith he stretched out the spear, until he had utterly destroyed all the inhabitants of Ai.\n27. Only the cattle and the spoil of that city Israel took fora preyunto themselves, according unto the word of theLordwhich he commanded Joshua.\n28. And Joshua burnt Ai, and made it an heap for ever,evena desolation unto this day.\n29. And the king of Ai he hanged on tree until eventide: and as soon as the sun was down, Joshua commanded that they should take his carcase down from the tree, and cast it at the entering of the gate of the city, and raise thereon great heap of stones,that remainethunto this day.\n30. Then Joshua built an altar unto theLordGod of Israel in mount Ebal,\n31. As Moses the servant of theLordcommanded the children of Israel, as it is written in the book of the law of Moses, analtarof wholestones, over which no man hath lift upanyiron: and they offered thereon burnt offerings unto theLord, and sacrificed peace offerings.\n32. And hewrotethere upon the stones copy of the law of Moses, which he wrote in the presence of the children of Israel.\n33. And all Israel, and their elders, and officers, and their judges, stood on this side the ark and on that side before the priests the Levites, which bare the ark of the covenant of theLord, as well the stranger, as he that was born among them; half of them over against mountGerizim, and half of them over against mount Ebal; as Moses the servant of theLordhad commanded before, that they should bless the people of Israel.\n34. And afterward hereadall the words of the law, the blessings andcursings, according to all that is written in the book of the law.\n35. There was not word of all that Moses commanded, which Joshua read not before all thecongregationof Israel, with the women, and the little ones, and the strangers thatwere conversantamong them.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";23–24",
      "content": "It had taken several generations, but the Lord’s promise was about to be fulfilled: the children of Israel were finally going to inherit the promised land. But in their way stood the Jordan River, the walls of Jericho, and a mighty people who had rejected the Lord (see\n1 Nephi 17:35\n). And they would have to face all of that without their beloved leader Moses. The situation may have made some Israelites feel weak and fearful, but the Lord said, “Be strong and of a good courage.” What reason did they have to be courageous? It wasn’t because of their own strength—or even Moses’s or Joshua’s—but because “the Lord thy God is with thee whithersoever thou goest” (\nJoshua 1:9\n). When we have our own rivers to cross and walls to bring down, wonderful things can happen in our lives because “the Lord will do wonders among [us]” (\nJoshua 3:5\n).\nFor an overview of the book of Joshua, see “\nJoshua, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nJoshua 1:1–9\nGod will be with me as I strive to be faithful to Him.\nImagine what it might have been like for Joshua to be called to replace Moses. Notice what the Lord said in\nJoshua 1:1–9\nto encourage him. Think about the difficult challenges you face; what in these verses gives you courage?\nThe name Joshua (\nYehoshua\nor\nYeshua\nin Hebrew) means “Jehovah saves.” And the name\nJesus\ncomes from\nYeshua\n. So as you read about Joshua, consider his role in leading the children of Israel across the Jordan River and into the promised land. How was his mission similar to what Christ does for us?\nJoshua 1:8\nThe word of God can make my way prosperous.\nAs He encouraged Joshua, the Lord gave counsel in\nJoshua 1:8\nabout the scriptures, or “the word of the law.” Considering Joshua’s heavy responsibility, why might this counsel have been especially helpful?\nWhen the Lord invites us to read the scriptures, He often uses words that go beyond just reading. He also promises great blessings. The table below can help you discover these invitations and promised blessings:\nInvitation\nPromised blessings\nJoshua 1:8\nInvitation\nMeditate day and night\nPromised blessings\n1 Nephi 15:23–24\nInvitation\nPromised blessings\n2 Nephi 32:3\nInvitation\nPromised blessings\nMosiah 1:7\nInvitation\nPromised blessings\nProsper in the land\nHelaman 3:29–30\nInvitation\nPromised blessings\nDoctrine and Covenants 84:85\nInvitation\nPromised blessings\nRussell M. Nelson, “Hear Him,”\nEnsign\nor\nLiahona\n, May 2020,\nlast paragraph on page 89\nInvitation\nPromised blessings\nHow has the Lord fulfilled these promises in your life? Now may be a good time to evaluate your scripture study habits. What’s going well? What do you feel inspired to do to have more meaningful experiences with the word of God?\nSee also “\nAs I Search the Holy Scriptures\n,”\nHymns\n, no. 277.\nJoshua 2\nBoth faith and works are necessary for salvation.\nNew Testament Christians saw Rahab as an example of the power of both faith and works (see\nHebrews 11:31\n;\nJames 2:25\n). As you read\nJoshua 2\n, consider the role of Rahab’s faith and works in saving herself, her family, and the Israelite spies. What does this teach you about how your faith in Christ and your works can influence yourself and others?\nRahab at her window.\nWaiting for the Promise\n, by Elspeth Young (detail)\nJoshua 3–4\nWith faith in Jesus Christ, I can experience God’s “wonders.”\nThe Lord worked wonders among His people as He led them into the promised land, and He can do the same for you. Here are some questions to guide your study of\nJoshua 3–4\n:\nWhy do you think the Israelites needed to sanctify themselves before they crossed the Jordan River? (see\nJoshua 3:5\n).\nNote that the river parted only after “the feet of the priests … were dipped in the brim of the water” (\nJoshua 3:13, 15\n). Why is that significant?\nSeveral other significant events happened at the Jordan River—see\n2 Kings 2:6–15\n;\n5:1–14\n; and\nMark 1:9–11\n. What connections do you see between these events?\nHow has the Lord done “wonders” in your life? (\nJoshua 3:5\n). How can you experience—or recognize—those wonders more often? (for example, see\nJoshua 3:17\n).\nJoshua 6–8\nObedience invites God’s power into my life.\nJoshua 6–8\ndeals with battles over the lands of Jericho and Ai. As you read these chapters, consider how you battle temptation (for example, see\nJoshua 7:10–13\n). What do you learn about how God can help you and what you need to do to access His power? For example, what impresses you about the Lord’s instructions for taking Jericho? (see\nJoshua 6:1–5\n). Perhaps the account in\nJoshua 7\nwill inspire you to determine if “there is an accursed thing” in your life that you need to remove (\nJoshua 7:13\n).\nJoshua 23–24\n“Choose you this day whom ye will serve.”\nJoshua’s final teachings to the Israelites in\nJoshua 23–24\ninclude important warnings, counsel, and promised blessings. Perhaps you could make a list of what you find. Considering everything the Israelites had been through, why do you think Joshua chose to tell them these things at the end of his life? What do you find that inspires you to “cleave unto the Lord”? (\nJoshua 23:8\n).\nSee also Dale G. Renlund, “\nChoose You This Day\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 104–6.\nStudy Helps\nWhat was the significance of the parting of the Jordan River?\nWhy was Achan’s sin so serious?\nWhat occurred on Mount Gerizim and Mount Ebal?\nClick to see more.\nIdeas for Teaching Children\nJoshua 1–4\n;\n6\n“Be strong and of a good courage.”\nHere is one way to help your children “be strong and of a good courage” (\nJoshua 1:6\n) through Jesus Christ. Invite them to find a phrase that is repeated in\nJoshua 1:6, 9\n, and\n18\n, and write it down or memorize it. Help your children think of situations where they might need this message, just as Joshua did. You could also review together some of the stories in\nJoshua 1–4\n;\n6\n(see also “\nJoshua the Prophet\n” and “\nRahab and the Spies\n” in\nOld Testament Stories\n, 85–91). How did the people in these stories show courage and strength in the Lord?\n2:59\nJoshua the Prophet\n1:39\nRahab and the Spies\nJoshua 1:8\nStudying the scriptures brings me blessings.\nReading\nJoshua 1:8\ncould inspire your children to read the scriptures on their own. Help them find words in this verse that teach them\nhow\nand\nwhy\nwe should read the scriptures. They could look for the same thing in\n1 Nephi 15:23–24\n;\n2 Nephi 31:20\n;\n32:3\n;\nJacob 4:6\n;\nHelaman 3:29–30\n. You could also help them make and carry out a plan to read the scriptures.\nJoshua 3–4\nI must be baptized to enter the kingdom of heaven.\nYou might use the story of the Israelites crossing the Jordan River as a symbol of baptism—giving up our old life in the wilderness and starting a new one in a covenant relationship with God. So as you read together\nJoshua 3–4\n(or “\nJoshua the Prophet\n” in\nOld Testament Stories\n, 85–89), you could also look at a picture of Jesus being baptized and explain that Jesus was baptized in the same river the Israelites crossed. You could then sing a song such as “\nBaptism\n” (\nChildren’s Songbook\n, 100–101). Share with each other how being baptized is like starting a new life in Jesus Christ’s kingdom.\n2:59\nJoshua the Prophet\nJoshua 24:15\nI can choose to serve Jesus Christ.\nWhat could you do to help your children learn to choose to follow Jesus Christ, as Joshua invited the Israelites to do? You might invite them to:\nMemorize a short phrase\nfrom\nJoshua 24:15\n. Try to make it fun for your children. The number of words they memorize may depend on their age.\nFind stories\nabout people who chose to serve Jesus Christ. They could look in the\nFriend\nmagazine, the\nGospel Art Book\n, or\nOld Testament Stories\nand other scripture stories books.\nRole-play situations\nin which they can choose to follow and serve the Savior.\nUse a variety of activities.\n“All children are different, and as they develop, their needs will change. Varying your teaching methods will help you meet their diverse needs” (\nTeaching in the Savior’s Way\n,\n31\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 21: Lesson 56: Lesson 56—Numbers 11–14This lesson can help students view their challenges with greater faith in Jesus Christ.; Lesson 57: Lesson 57—Numbers 21This lesson can help students look to Jesus Christ in faith.",
      "content": "\n--- Lesson 56 ---\nSometimes it can be difficult to move forward with faith instead of fear. The children of Israel faced that challenge. After they journeyed in the wilderness, the Lord led the Israelites to the border of the promised land. The Lord instructed Moses to send 12 men into the land and have them bring back a report of the land and its inhabitants. Most of the 12 were afraid about the prospect of conquering the promised land, but Caleb and Joshua had faith that the Lord would help them. This lesson can help students view their challenges with greater faith in Jesus Christ. Student preparation: Invite students to think about obstacles or challenges they are currently facing. They could ponder how they are facing them with fear or with faith in the Lord. Possible Learning Activities Viewing challenges with faith Consider writing two headings on opposite sides of the board: Faith and Fear . Display the following experiences, or other relevant examples, one at a time. Invite students to ponder if they view each example with faith in Jesus Christ or with fear. A big test or school project Repentance The future Sharing the gospel How can we tell if we are viewing a situation with faith in Jesus Christ or with fear? What difference does it make if we view a situation with faith or fear? Why can it sometimes be difficult to see situations like these with faith in Jesus Christ? Continue to ponder these questions as you study today. Invite the Holy Ghost into your learning as you think about how to view your challenges with greater faith in Jesus Christ. The spies’ report of Canaan After the children of Israel traveled in the wilderness, the Lord brought them to the border of the promised land. It was the land of Canaan. The Lord told them they would need to conquer the land. The Lord instructed Moses to select one member from each of the twelve tribes. These men were commanded to inspect the land and bring back a report of what they found. After 40 days of investigating the land, the 12 men returned with their reports, along with fruit from the land (see Numbers 13:1–25 ). Consider dividing the class into thirds. Invite each group to read one of the following accounts. Ask students to imagine that they represent the people they read about. They can prepare answers to the questions that follow. Each group could then share their answers, or you could have a student or two come to the front and use the questions to interview each group. 1. Numbers 13:26–29, 31–33 : The 10 spies’ report of the land and the people How would you describe the land of Canaan and the people you saw? What feelings did you have when you saw the people? Why? 2. Numbers 14:1–4 : The Israelites’ response to the 10 spies’ report What feelings did you have when you listened to the 10 spies’ report? Why? What did you suggest the people do rather than follow Moses into the promised land? Why? 3. Numbers 13:30 ; 14:6–9 : Joshua and Caleb’s report of the land and the people How would you describe the land of Canaan and the people you saw? The other spies are convinced that Israel cannot overcome the people in Canaan. Why are you so sure that Israel can? After each group has answered their questions, thank them for their participation. Review Numbers 13:30 ; 14:8–9 , looking for words and phrases that show Caleb and Joshua’s faith in the Lord. What lessons do you learn from Caleb and Joshua? Among various answers students might give, help them identify the truth that trusting in the Lord can help us see our challenges with faith rather than fear . What do you think it means to act with faith in Heavenly Father and Jesus Christ when we face challenges? Faith versus fear Elder Kevin R. Duncan of the Seventy explained something we can learn from the experience of the children of Israel in Numbers 13–14 : Just like the children of Israel, we face formidable obstacles. … It isn’t wrong for us to recognize those obstacles. But it is important that we face them with faith. … … Each challenge and each obstacle we face is an opportunity to choose, as did Joshua and Caleb, to rely on the Lord. “Rebel not … , neither fear” ( Numbers 14:9 ) was good counsel for the children of Israel, and it is still good counsel for each of us today. (“ Rebel Not, Neither Fear ,” Liahona , Apr. 2022, 47) What experiences had the children of Israel previously had with the Lord? How could remembering these experiences have increased their faith in Him? Why do you think some people forget what they know about the Lord when facing a challenge? Despite the many miracles the Lord had provided and the testimony of Caleb and Joshua, the Israelites continued to murmur. As a result, the Lord declared that because of their murmuring and doubt, the great majority of the adult Israelites would not be allowed to enter the promised land (see Numbers 14:26–39 ). Read Numbers 14:24, 30 , looking for how the Lord blessed Caleb and Joshua because they placed their faith in Him. To help students face their challenges with faith, consider displaying the following chart on the board. Invite them to copy the chart into their study journals. Challenge: Fear-Based Statement Faith-Based Statement Fear-Based Statement Faith-Based Statement Invite students to share some modern-day challenges they may face and ways they could respond with fear or faith. You might provide an example such as: Challenge: Speaking in public settings Fear-based statement: “I can’t speak in front of others because I always nervously mix up my words.” Faith-based statement: “Public speaking is hard for me, but I believe the Lord can give me courage and strength to do it.” Students could use the situations from the beginning of the lesson. For the following activity, consider providing pieces of paper for the students. Ponder a challenge you face, or might face, in your life. Write the challenge in your chart along with a fear-based statement you might think or believe about that challenge. Reflect on what the Holy Ghost has taught you about Heavenly Father and Jesus Christ from the scriptures, the words of the prophets, and your own spiritual experiences. Think about how this knowledge can help you face challenges with faith in the Lord. Then write a faith-based statement in your journal. You might also want to write the faith-based statement on a piece of paper that you can take home and set it somewhere you will see often. Or take a picture of the statement on your phone. You could even set the picture as your wallpaper on your phone. Consider inviting a few willing students to share their thoughts and feelings about Heavenly Father and Jesus Christ. They can share how the Lord helps them face challenges with faith. Testify that the Lord will bless us as we faithfully face our challenges.\n\n\n--- Lesson 57 ---\nAs the children of Israel continued through the wilderness, they complained against the Lord. In response, He sent venomous serpents among them. He then instructed Moses to set a brass serpent upon a pole as a symbol of the Savior and promised that those who looked upon it would be healed. This lesson can help students look to Jesus Christ in faith. Student preparation: Invite students to read Numbers 21:7–9 and Alma 33:18–21 , looking for what we can learn from this account in the Old Testament. Encourage them to be prepared to share what they learned in class. Possible Learning Activities A snake bite Consider beginning class by showing a picture of a snake. What do you think it would be like to be bitten by a venomous snake? Help students understand that being bitten by a venomous snake can cause swelling, blistering, severe pain, and illness. In extreme cases, it can even be deadly. What are some of the different ways people may react after being bitten? Some possible answers are: panic, seek revenge on the snake and kill it, wait to see how their body reacts to the bite, or immediately get help. Next to the snake, write sin . Invite students to compare how sin and its consequences might be like a snake bite. What are some of the different ways people may react after sinning? Some possible answers are rationalizing their actions, looking to numb their feelings, hiding their actions because of shame or embarrassment, waiting to see what further consequences they face, or looking to the Lord for help. Take a moment to ponder how you react. Do you look to the Lord for help? Why or why not? As you study this lesson, seek the guidance of the Holy Ghost to help you look to the Savior for help in your life. You can also look for help with any questions or concerns you have about looking to the Savior. The fiery serpents As they had done many times before, the children of Israel complained against the Lord as they traveled through the wilderness. Read the following verses and answer their accompanying questions. It may be useful to know that fiery means “poisonous” (see footnote 6a ). Consider displaying or writing the following verses and questions on the board. You could invite students to study them together in small groups, or invite students to study the verses on their own, then share their answers with a partner or small group to confirm their answers. If useful, explain that because the children of Israel were not allowed to travel through the land of Edom, but had to travel around it (see Numbers 21:4 ), which means their journey would be longer and more difficult. Numbers 21:4–5 . Why did the children of Israel speak against the Lord and Moses? Numbers 21:6 . In response, what did the Lord send? Numbers 21:7–9 . What did the Lord instruct Moses and the children of Israel to do to be healed? 1 Nephi 17:41 ; Alma 33:18–21 . Why did some of the children of Israel not look? Consider inviting students to write the Book of Mormon verses as cross-references to Numbers 21:9 or highlight footnote 9a . What stood out to you from this account? How might we be similar at times to the children of Israel? A symbol for the Savior During His mortal ministry, the Savior helped us understand what the brass serpent on the pole symbolized. Read John 3:14–16 , looking for the answer. (You may want to mark this as a cross-reference to Numbers 21:7–9 .) After students share what they found, consider showing the following images. What can we learn from these accounts? Students may share a principle similar to the following: As we look to the Savior in faith , He will heal us spiritually . Consider writing this principle on the board. To better understand this principle, invite students to read the following statements. President Russell M. Nelson taught: I plead with you to come unto Him so that He can heal you! He will heal you from sin as you repent. He will heal you from sadness and fear. He will heal you from the wounds of this world. (“ The Answer Is Always Jesus Christ ,” Liahona , May 2023, 127) What did you like or learn from this statement? How might being healed from venom be like being healed by the Savior from the consequences of sin? Look to the Savior Invite students to take a minute to look at the picture of the Savior on the cross and ponder ways we can look to Him in faith today. Then invite them to do the following in small groups. List several ways we can look to the Savior in faith today. Discuss reasons we may struggle to do these things. (You might discuss why we, like the children of Israel, might be tempted to believe these ways to look to the Savior are too simple or will not help us.) Despite any struggles, discuss why it is worth it to look to the Savior. (This might include sharing scriptural examples of the Savior’s healings, your feelings or testimony about looking to the Savior, or experiences you have had when you looked to the Savior in faith and what happened.) If students need some ideas of ways we can look to the Savior, invite them to look for examples from the young man in “ Atonement: Not a One-Time Thing ” (3:00). 3:1 Ask students to share some of the highlights of their discussions. If students do not naturally share feelings, testimony, or experiences, consider giving them the following prompt: I believe it is worth it to look to the Savior in faith because . The activity above is an example of helping students consider their feelings about Jesus Christ. Helping students do this can allow the Holy Ghost to testify of Him. (For additional training see: “ Bear testimony often and invite learners to share their feelings, experiences, and testimonies ,” in Teacher Development Skills ). As students share, be sure it is clear that the Savior will help and heal us in the way and time that is best for us. What you believe Seek the help of the Holy Ghost as you write down one way you believe the Lord wants you to look to Him, or continue to look to Him, in your life. You also might write why it may be difficult but still worth it.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Joshua 1",
      "content": "1. Now after thedeathof Moses the servant of theLordit came to pass, that theLordspake unto Joshua the son of Nun, Moses minister, saying,\n2. Moses my servant is dead; now therefore arise, go over this Jordan,thou, and all this people, unto thelandwhich I do give to them,evento the children of Israel.\n3. Every place that the sole of your foot shall tread upon, that have I given unto you, as I said unto Moses.\n4. From the wilderness and thisLebanoneven unto the great river, the river Euphrates, all the land of the Hittites, and unto thegreat seatoward the going down of the sun, shall be yourcoast.\n5. There shall not any man be able to stand before thee all the days of thy life: as I was withMoses,soI will bewith thee: I will not fail thee, norforsakethee.\n6. Be strong and of goodcourage: for unto this people shalt thoudividefor aninheritancetheland, which I sware unto their fathers to give them.\n7. Only be thou strong and verycourageous, that thou mayest observe to do according to all the law, which Moses my servant commanded thee:turnnot from ittothe right hand ortothe left, that thou mayestprosperwhithersoever thou goest.\n8. This book of thelawshall not depart out of thy mouth; but thou shaltmeditatetherein day and night, that thou mayest observe to do according to all that is written therein: for then thou shalt make thy way prosperous, and then thou shalt have good success.\n9. Have not I commanded thee? Be strong and of good courage; be not afraid, neither be thou dismayed: for theLordthy Godiswith thee whithersoever thou goest.\n10. Then Joshua commandedtheofficers of the people, saying,\n11. Pass throughthe host, and command the people, saying, Prepare youvictuals; for within three days ye shall pass over this Jordan, to go in topossessthe land, which theLordyour God giveth you to possess it.\n12. And to the Reubenites, and to the Gadites, and to half the tribe of Manasseh, spake Joshua, saying,\n13. Remember thewordwhich Moses the servant of theLordcommanded you, saying, TheLordyour God hath given yourest, and hath given you this land.\n14. Your wives, your little ones, and your cattle, shall remain in the land which Moses gave you on this side Jordan; but ye shall pass before your brethren armed, all the mighty men of valour, and help them;\n15. Until theLordhave given your brethren rest, ashe hath givenyou, and they also have possessed the land which theLordyour God giveth them: then ye shall return unto the land of your possession, and enjoy it, which Moses theLords servant gave you on this side Jordan toward the sunrising.\n16. And they answered Joshua, saying, All that thou commandest us we will do, and whithersoever thou sendest us, we will go.\n17. According as we hearkened unto Moses in all things, so will we hearken unto thee: only theLordthy God be with thee, as he was with Moses.\n18. Whosoeverhe bethat dothrebelagainst thy commandment, and will not hearken unto thy words in all that thou commandest him, he shall be put todeath: only be strong and of good courage.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Joshua 2",
      "content": "1. And Joshua the son of Nun sent out of Shittim two men to spy secretly, saying, Go view the land, even Jericho. And they went, and came into an harlots house, namedRahab, and lodged there.\n2. And it was told the king of Jericho, saying, Behold, there came men in hither to night of the children of Israel to search out the country.\n3. And the king of Jericho sent unto Rahab, saying, Bring forth the men that are come to thee, which are entered into thine house: for they be come to search out all the country.\n4. And the woman took the two men, and hid them, and said thus, There came men unto me, but I wist not whence theywere:\n5. And it came to passabout the timeof shutting of the gate, when it was dark, that the men went out: whither the men went Iwotnot: pursue after them quickly; for ye shall overtake them.\n6. But she had brought them up to the roof of the house, and hid them with the stalks of flax, which she had laid in order upon the roof.\n7. And the men pursued after them the way to Jordan unto the fords: and as soon as they which pursued after them were gone out, they shut the gate.\n8. And before they were laid down, she came up unto them upon the roof;\n9. And she said unto the men, I know that theLordhath given you the land, and that yourterroris fallen upon us, and that all the inhabitants of the landfaintbecause of you.\n10. For we haveheardhow theLorddried up the water of theRed seafor you, when ye came out of Egypt; and what ye did unto the two kings of theAmorites, thatwereon the other side Jordan, Sihon and Og, whom ye utterly destroyed.\n11. And as soon as we hadheardthese things,ourheartsdid melt, neither did there remain any more courage in any man, because of you: for theLordyour God, heisGodinheavenabove, and in earth beneath.\n12. Now therefore, I pray you,swearunto me by theLord, since I have shewed youkindness, that ye will also shew kindness unto my fathers house, and give me true token:\n13. Andthatye will save alive my father, and my mother, and my brethren, and my sisters, and all that they have, and deliver our lives from death.\n14. And the men answered her, Our life for yours, if ye utter not this our business. And it shall be, when theLordhath given us the land, that we will deal kindly and truly with thee.\n15. Then she let them down by acordthrough the window: for her housewasupon the town wall, and she dwelt upon the wall.\n16. And she said unto them, Get you to the mountain, lest the pursuers meet you; and hide yourselves there three days, until the pursuers be returned: and afterward may ye go your way.\n17. And the men said unto her, Wewill beblamelessof this thine oath which thou hast made us swear.\n18. Behold,whenwe come into the land, thou shalt bind this line of scarlet thread in the window which thou didst let us down by: and thou shalt bring thyfather, and thy mother, and thy brethren, and all thy fathers household, home unto thee.\n19. And it shall be,thatwhosoever shall go out of the doors of thy house into the street, his bloodshall beupon his head, and wewill beguiltless: and whosoever shall be with thee in the house, his bloodshall beon our head, ifanyhand be upon him.\n20. And if thou utter this our business, then we will be quit of thine oath which thou hast made us to swear.\n21. And she said, According unto your words, sobeit. And she sent them away, and they departed: and she bound the scarlet line in the window.\n22. And they went, and came unto the mountain, and abode there three days, until the pursuers were returned: and the pursuers soughtthemthroughout all the way, but foundthemnot.\n23. So the two men returned, and descended from the mountain, and passed over, and came to Joshua the son of Nun, and told him allthingsthat befell them:\n24. And they said unto Joshua, Truly theLordhathdeliveredinto our hands all the land; for even all the inhabitants of the country do faint because of us.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Joshua 3",
      "content": "1. And Joshua rose early in the morning; and they removed from Shittim, and came to Jordan, he and all the children of Israel, and lodged there before they passed over.\n2. And it came to pass after three days, that the officers went through the host;\n3. And they commanded the people, saying, When ye see thearkof the covenant of theLordyour God, and the priests the Levites bearing it, then ye shall remove from your place, and go after it.\n4. Yet there shall be space between you and it, about two thousand cubits by measure: come not near unto it, that ye may know thewayby which ye must go: for ye have not passedthisway heretofore.\n5. And Joshua said unto the people,Sanctify yourselves: for to morrow theLordwill do wonders among you.\n6. And Joshua spake unto the priests, saying, Take up the ark of the covenant, and pass over before the people. And they took up the ark of the covenant, and went before the people.\n7. And theLordsaid unto Joshua, This day will I begin tomagnifythee in the sight of all Israel, that they may know that, as I was with Moses,soI will be with thee.\n8. And thou shalt command the priests that bear the ark of the covenant, saying, When ye are come to the brink of the water of Jordan, ye shall stand still in Jordan.\n9. And Joshua said unto the children of Israel, Come hither, and hear the words of theLordyour God.\n10. And Joshua said, Hereby ye shall know that theliving Godisamong you, andthathe will without fail drive out from before you theCanaanites, and the Hittites, and the Hivites, and the Perizzites, and the Girgashites, and the Amorites, and the Jebusites.\n11. Behold, the ark of the covenant of the Lord of all the earth passeth over before you into Jordan.\n12. Now therefore take you twelve men out of the tribes of Israel, out of every tribe man.\n13. And it shall come to pass, as soon as the soles of the feet of the priests that bear the ark of theLord, the Lord of all the earth, shall rest in the waters of Jordan,thatthe waters of Jordan shall be cut offfromthe waters that come down from above; and they shall stand upon anheap.\n14. And it came to pass, when the people removed from their tents, to pass over Jordan, and the priests bearing the ark of the covenant before the people;\n15. And as they that bare the ark were come unto Jordan, and the feet of the priests that bare the ark were dipped in the brim of the water, (for Jordan overfloweth all his banks all the time of harvest,)\n16. That thewaterswhich came down fromabovestoodandrose up upon anheapvery far from the city Adam, thatisbeside Zaretan: and those that came down toward the sea of the plain,eventhesalt sea, failed,andwere cut off: and the people passed over right against Jericho.\n17. And the priests that bare the ark of the covenant of theLordstood firm ondryground in the midst of Jordan, and all the Israelites passed over on dry ground, until all the people were passed clean over Jordan.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Joshua 4",
      "content": "1. And it came to pass, when all the people werecleanpassed over Jordan, that theLordspake unto Joshua, saying,\n2. Take you twelve men out of the people, out of every tribe man,\n3. And command ye them, saying, Take you hence out of the midst of Jordan, out of the place where the priests feet stood firm,twelvestones, and ye shall carry them over with you, and leave them in the lodging place, where ye shall lodge this night.\n4. Then Joshua called thetwelvemen, whom he had prepared of the children of Israel, out of every tribe man:\n5. And Joshua said unto them, Pass over before the ark of theLordyour God into the midst of Jordan, and take ye up every man of you stone upon his shoulder, according unto the number of the tribes of the children of Israel:\n6. That this may be sign among you,thatwhen yourchildrenasktheir fathersin time to come, saying, Whatmeanye by these stones?\n7. Then ye shall answer them, That the waters of Jordan were cut off before thearkof the covenant of theLord; when it passed over Jordan, the waters of Jordan were cut off: and these stones shall be for amemorialunto the children of Israel for ever.\n8. And the children of Israel did so as Joshua commanded, and took up twelve stones out of the midst ofJordan, as theLordspake unto Joshua, according to the number of the tribes of the children of Israel, and carried them over with them unto the place where they lodged, and laid them down there.\n9. And Joshua set up twelve stones in the midst of Jordan, in the place where the feet of the priests which bare the ark of the covenant stood: and they are there unto this day.\n10. For the priests which bare the ark stood in the midst of Jordan, until every thing was finished that theLordcommanded Joshua to speak unto the people, according to all that Moses commanded Joshua: and the people hasted and passed over.\n11. And it came to pass, when all the people were cleanpassedover, that the ark of theLordpassed over, and the priests, in the presence of the people.\n12. And the children of Reuben, and the children of Gad, and half the tribe of Manasseh, passed over armed before the children of Israel, as Moses spake unto them:\n13. About forty thousand prepared for war passed over before theLordunto battle, to the plains of Jericho.\n14. On that day theLordmagnifiedJoshua in the sight of all Israel; and they feared him, as they feared Moses, all the days of his life.\n15. And theLordspake unto Joshua, saying,\n16. Command the priests that bear the ark of thetestimony, that they come up out of Jordan.\n17. Joshua therefore commanded the priests, saying, Come ye up out of Jordan.\n18. And it came to pass, when the priests that bare the ark of the covenant of theLordwere come up out of the midst of Jordan,andthe soles of the priests feet were lifted up unto the dry land, that the waters of Jordan returned unto their place, and flowed over all his banks, asthey didbefore.\n19. And the people came up out of Jordan on the tenthdayof the first month, and encamped inGilgal, in the east border of Jericho.\n20. And those twelve stones, which they took out of Jordan, did Joshua pitch in Gilgal.\n21. And he spake unto the children of Israel, saying, When your children shall ask their fathers in time to come, saying, Whatmeanthese stones?\n22. Then ye shall let yourchildrenknow, saying, Israel came over this Jordan on dry land.\n23. For theLordyour God dried up the waters of Jordan from before you, until ye were passed over, as theLordyour God did to the Red sea, which hedriedup from before us, until we were gone over:\n24. That all the people of the earth mightknowthe hand of theLord, that itismighty: that ye mightfeartheLordyour God for ever.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Joshua 5",
      "content": "1. And it came to pass, when all the kings of the Amorites, whichwereon the side of Jordan westward, and all the kings of the Canaanites, whichwereby the sea,heardthat theLordhad dried up the waters of Jordan from before the children of Israel, until we were passed over, that theirheartmelted, neither was there spirit in them any more, because of the children of Israel.\n2. At that time theLordsaid unto Joshua, Make theesharp knives, andcircumciseagain the children of Israel the second time.\n3. And Joshua made him sharp knives, and circumcised the children of Israel at the hill of the foreskins.\n4. And thisisthe cause why Joshua did circumcise: All the people that came out of Egypt,that weremales,evenall the men of war, died in the wilderness by the way, after they came out of Egypt.\n5. Now all the people that came out were circumcised: but all the peoplethat wereborn in the wilderness by the way as they came forth out of Egypt,themthey had not circumcised.\n6. For the children of Israel walked forty years in the wilderness, till all the peoplethat weremen of war, which came out of Egypt, were consumed, because theyobeyed notthe voice of theLord: unto whom theLordsware that he would not shew them theland, which theLordswareunto their fathers that he would give us, land that floweth with milk and honey.\n7. And their children,whomhe raised upin their stead, them Joshua circumcised: for they were uncircumcised, because they had not circumcised them by the way.\n8. And it came to pass, when they had done circumcising all the people, that they abode in their places in the camp, till they werewhole.\n9. And theLordsaid unto Joshua, This day have I rolled away the reproach of Egypt from off you. Wherefore the name of the place is calledGilgalunto this day.\n10. And the children of Israel encamped in Gilgal, and kept thepassoveron the fourteenth day of the month at even in the plains of Jericho.\n11. And they did eat of theold cornof the land on the morrow after the passover,unleavenedcakes, and parchedcornin the selfsame day.\n12. And themannaceased on the morrow after they had eaten of the old corn of the land; neither had the children of Israel manna any more; but they did eat of the fruit of the land of Canaan that year.\n13. And it came to pass, when Joshua was by Jericho, that he lifted up his eyes and looked, and, behold, there stood amanover against him with his sword drawn in his hand: and Joshua went unto him, and said unto him,Artthou for us, or for our adversaries?\n14. And he said, Nay; butascaptain of thehostof theLordam I now come. And Joshua fell on his face to the earth, and did worship, and said unto him, What saith my lord unto his servant?\n15. And the captain of theLords host said unto Joshua, Loose thyshoefrom off thy foot; for the place whereon thou standestisholy. And Joshua did so.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Joshua 6",
      "content": "1. NowJerichowas straitly shut up because of the children of Israel: none went out, and none came in.\n2. And theLordsaid unto Joshua, See, I have given into thine hand Jericho, and the king thereof,andthe mighty men of valour.\n3. And ye shallcompassthe city, allyemen of war,andgo round about the city once. Thus shalt thou do six days.\n4. And seven priests shall bear before the ark seven trumpets of rams horns: and the seventh day ye shall compass the city seven times,and the priests shall blow with the trumpets.\n5. And it shall come to pass, that when they make longblastwith the rams horn,andwhen ye hear the sound of the trumpet, all the people shall shout with great shout; and the wall of the city shall fall down flat, and the people shall ascend up every man straight before him.\n6. And Joshua the son of Nun called the priests, and said unto them, Take up thearkof the covenant, and let seven priests bear seven trumpets of rams horns before the ark of theLord.\n7. And he said unto the people, Pass on, and compass the city, and let him that is armed pass on before the ark of theLord.\n8. And it came to pass, when Joshua had spoken unto the people, that the seven priests bearing the seven trumpets of rams horns passed on before theLord, and blew with the trumpets: and the ark of the covenant of theLordfollowed them.\n9. And the armed men went before the priests that blew with the trumpets, andthe rearwardcame after the ark,the priestsgoing on, and blowing with the trumpets.\n10. And Joshua had commanded the people, saying, Ye shall not shout, nor make any noise with your voice, neither shallanyword proceed out of your mouth, until the day I bid you shout; then shall ye shout.\n11. So the ark of theLordcompassed the city, going aboutitonce: and they came into the camp, and lodged in the camp.\n12. And Joshua rose early in the morning, and the priests took up the ark of theLord.\n13. And seven priests bearing seven trumpets of rams horns before the ark of theLordwent on continually, and blew with the trumpets: and the armed men went before them; but the rearward came after the ark of theLord,the priestsgoing on, and blowing with the trumpets.\n14. And the second day they compassed the city once, and returned into the camp: so they did six days.\n15. And it came to pass on the seventh day, that they rose early about the dawning of the day, and compassed the city after the same manner seven times: only on that day they compassed the city seven times.\n16. And it came to pass at the seventh time, when the priests blew with the trumpets, Joshua said unto the people, Shout; for theLordhath given you the city.\n17. And the city shall be accursed,evenit, and all thataretherein, to theLord: only Rahab the harlot shall live, she and all thatarewith her in the house, because she hid the messengers that we sent.\n18. And ye, in any wise keepyourselvesfromthe accursed thing, lest ye makeyourselvesaccursed, when ye take of the accursed thing, and make the camp of Israel curse, and trouble it.\n19. But all the silver, and gold, and vessels of brass and iron,areconsecrated unto theLord: they shall come into the treasury of theLord.\n20. So the people shouted whenthe priestsblew with the trumpets: and it came to pass, when the people heard the sound of the trumpet, and the people shouted with great shout, that thewallfell down flat, so that the people went up into the city, every man straight before him, and they took the city.\n21. And they utterlydestroyedall thatwasin the city, both man and woman, young and old, and ox, and sheep, and ass, with the edge of the sword.\n22. But Joshua had said unto the two men that had spied out thecountry, Go into the harlots house, and bring out thence the woman, and all that she hath, as ye sware unto her.\n23. And the young men that were spies went in, and brought outRahab, and her father, and her mother, and her brethren, and all that she had; and they brought out all her kindred, and left them without the camp of Israel.\n24. And they burnt the city with fire, and all thatwastherein: only the silver, and the gold, and the vessels of brass and of iron, they put into the treasury of the house of theLord.\n25. And Joshua saved Rahab the harlot alive, and her fathers household, and all that she had; and she dwelleth in Israelevenunto this day; because she hid the messengers, which Joshua sent to spy out Jericho.\n26. And Joshuaadjuredthemat that time, saying, Cursedbethe man before theLord, that riseth up and buildeth this cityJericho: he shall lay the foundation thereof in his firstborn, and in his youngestsonshall he set up the gates of it.\n27. So theLordwaswithJoshua; and his fame wasnoisedthroughout all the country.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Joshua 7",
      "content": "1. But the children of Israel committed trespass in the accursed thing: forAchan, the son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, took of theaccursedthing: and the anger of theLordwas kindled against the children of Israel.\n2. And Joshua sent men from Jericho to Ai, whichisbesideBeth-aven, on the east side of Beth-el, and spake unto them, saying, Go up and view the country. And the men went up and viewed Ai.\n3. And they returned to Joshua, and said unto him, Let not all the people go up; but let about two or three thousand men go up and smite Ai;andmake not all the people to labour thither; for theyare butfew.\n4. So there went up thither of the people about three thousand men: and theyfledbefore the men of Ai.\n5. And the men of Ai smote of them about thirty and six men: for they chased themfrombefore the gateevenuntoShebarim, and smote them in thegoing down: wherefore the hearts of the people melted, and became as water.\n6. And Joshuarenthis clothes, and fell to the earth upon his face before the ark of theLorduntil the eventide, he and the elders of Israel, and put dust upon their heads.\n7. And Joshua said, Alas, O LordGod, wherefore hast thou at all brought this people over Jordan, to deliver us into the hand of the Amorites, to destroy us? would to God we had been content, and dwelt on the other side Jordan!\n8. O Lord, what shall I say, when Israel turneth their backs before their enemies!\n9. For the Canaanites and all the inhabitants of the land shall hearof it,and shallenvironus round, and cut off our name from the earth: and what wilt thou do unto thy greatname?\n10. And theLordsaid unto Joshua, Get thee up; wherefore liest thou thus upon thy face?\n11. Israel hathsinned, and they have also transgressed my covenant which I commanded them: for they have even taken of the accursed thing, and have also stolen, anddissembledalso, and they have putiteven among their own stuff.\n12. Therefore the children of Israel could not stand before their enemies,butturnedtheirbacks before their enemies, because they were accursed: neither will I be with you any more, except ye destroy the accursed from among you.\n13. Up,sanctifythe people, and say,Sanctifyyourselves against to morrow: for thus saith theLordGod of Israel,There isan accursed thing in the midst of thee, O Israel: thou canst not stand before thine enemies, until ye take away the accursed thing from among you.\n14. In the morning therefore ye shall be brought according to your tribes: and it shall be,thatthe tribe which theLordtaketh shall come according to the familiesthereof;and thefamilywhich theLordshall take shall come by households; and the household which theLordshall take shall come man by man.\n15. And it shall be,thathe that is taken with the accursed thing shall be burnt with fire, he and all that he hath: because he hath transgressed the covenant of theLord, and because he hathwrought follyin Israel.\n16. So Joshua rose up early in the morning, and brought Israel by their tribes; and the tribe of Judah was taken:\n17. And he brought the family of Judah; and he took the family of the Zarhites: and he brought the family of the Zarhites man by man; and Zabdi was taken:\n18. And he brought his household man by man; and Achan, the son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, was taken.\n19. And Joshua said unto Achan, My son, give, I pray thee,gloryto theLordGod of Israel, and makeconfessionunto him; andtellme now what thou hast done; hideitnot from me.\n20. And Achan answered Joshua, and said, Indeed I have sinned against theLordGodof Israel, and thus and thus have I done:\n21. When I saw among the spoils goodlyBabylonishgarment, and two hundred shekels of silver, and wedge of gold of fifty shekels weight, then Icovetedthem, and took them; and, behold, theyarehid in the earth in the midst of my tent, and the silver under it.\n22. So Joshua sent messengers, and they ran unto the tent; and, behold,it washid in his tent, and the silver under it.\n23. And they took them out of the midst of the tent, and brought them unto Joshua, and unto all the children of Israel, and laid them out before theLord.\n24. And Joshua, and all Israel with him, took Achan the son of Zerah, and the silver, and the garment, and the wedge of gold, and his sons, and his daughters, and his oxen, and his asses, and his sheep, and his tent, and all that he had: and they brought them unto the valley of Achor.\n25. And Joshua said, Why hast thou troubled us? theLordshall trouble thee this day. And all Israel stoned him with stones, and burned them with fire, after they had stoned them with stones.\n26. And they raised over him great heap of stones unto this day. So theLordturned from the fierceness of his anger. Wherefore the name of that place was called, The valley ofAchor, unto this day.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Joshua 8",
      "content": "1. And theLordsaid unto Joshua, Fear not, neither be thou dismayed: take all the people of war with thee, and arise, go up to Ai: see, I have given into thy hand the king of Ai, and his people, and his city, and his land:\n2. And thou shalt do to Ai and her king as thou didst untoJerichoand her king: only the spoil thereof, and the cattle thereof, shall ye take for prey unto yourselves: lay thee an ambush for the city behind it.\n3. So Joshua arose, and all the people of war, to go up against Ai: and Joshua chose out thirty thousand mighty men of valour, and sent them away by night.\n4. And he commanded them, saying, Behold, ye shall lie in wait against the city,evenbehind the city: go not very far from the city, but be ye all ready:\n5. And I, and all the people thatarewith me, will approach unto the city: and it shall come to pass, when they come out against us, as at the first, that we will flee before them,\n6. (For they will come out after us) till we have drawn them from the city; for they will say, They flee before us, as at the first: therefore we will flee before them.\n7. Then ye shall rise up from the ambush, and seize upon the city: for theLordyour God will deliver it into your hand.\n8. And it shall be, when ye have taken the city,thatye shall set the city on fire: according to the commandment of theLordshall ye do. See, I have commanded you.\n9. Joshua therefore sent them forth: and they went to lie in ambush, and abode between Beth-el and Ai, on the west side of Ai: but Joshua lodged that night among the people.\n10. And Joshua rose up early in the morning, and numbered the people, and went up, he and the elders of Israel, before the people to Ai.\n11. And all the people,even the peopleof war thatwerewith him, went up, and drew nigh, and came before the city, andpitchedon the north side of Ai: nowthere wasa valley between them and Ai.\n12. And he took about five thousand men, and set them to lie in ambush between Beth-el and Ai, on the west side of the city.\n13. And when they had set the people,evenall the host thatwason the north of the city, andtheir liers in waiton the west of the city, Joshua went that night into the midst of the valley.\n14. And it came to pass, when the king of Ai sawit,that they hasted and rose up early, and the men of the city went out against Israel to battle, he and all his people, at time appointed, before the plain; but hewistnot thatthere wereliers in ambush against him behind the city.\n15. And Joshua and all Israel made as if they were beaten before them, and fled by the way of the wilderness.\n16. And all the people thatwerein Ai were called together to pursue after them: and they pursued after Joshua, and were drawn away from the city.\n17. And there was not man left in Ai orBeth-el, that went not out after Israel: and they left the city open, and pursued after Israel.\n18. And theLordsaid unto Joshua, Stretch out the spear thatisin thy hand toward Ai; for I will give it into thine hand. And Joshua stretched out the spear thathe hadin his hand toward the city.\n19. And the ambush arose quickly out of their place, and they ran as soon as he had stretched out his hand: and they entered into the city, and took it, and hasted and set the city on fire.\n20. And when the men of Ai looked behind them, they saw, and, behold, the smoke of the city ascended up to heaven, and they had no power to flee this way or that way: and the people that fled to the wilderness turned back upon the pursuers.\n21. And when Joshua and all Israel saw that the ambush had taken the city, and that the smoke of the city ascended, then they turned again, and slew the men of Ai.\n22. And the other issued out of the city against them; so they were in the midst of Israel, some on this side, and some on that side: and they smote them, so that they let none of them remain or escape.\n23. And the king of Ai they took alive, and brought him to Joshua.\n24. And it came to pass, when Israel had made an end of slaying all the inhabitants of Ai in the field, in the wilderness wherein they chased them, and when they were all fallen on the edge of the sword, until they were consumed, that all the Israelites returned unto Ai, and smote it with the edge of the sword.\n25. Andsoit was,thatall that fell that day, both of men and women,weretwelve thousand,evenall the men of Ai.\n26. For Joshua drew not his hand back, wherewith he stretched out the spear, until he had utterly destroyed all the inhabitants of Ai.\n27. Only the cattle and the spoil of that city Israel took fora preyunto themselves, according unto the word of theLordwhich he commanded Joshua.\n28. And Joshua burnt Ai, and made it an heap for ever,evena desolation unto this day.\n29. And the king of Ai he hanged on tree until eventide: and as soon as the sun was down, Joshua commanded that they should take his carcase down from the tree, and cast it at the entering of the gate of the city, and raise thereon great heap of stones,that remainethunto this day.\n30. Then Joshua built an altar unto theLordGod of Israel in mount Ebal,\n31. As Moses the servant of theLordcommanded the children of Israel, as it is written in the book of the law of Moses, analtarof wholestones, over which no man hath lift upanyiron: and they offered thereon burnt offerings unto theLord, and sacrificed peace offerings.\n32. And hewrotethere upon the stones copy of the law of Moses, which he wrote in the presence of the children of Israel.\n33. And all Israel, and their elders, and officers, and their judges, stood on this side the ark and on that side before the priests the Levites, which bare the ark of the covenant of theLord, as well the stranger, as he that was born among them; half of them over against mountGerizim, and half of them over against mount Ebal; as Moses the servant of theLordhad commanded before, that they should bless the people of Israel.\n34. And afterward hereadall the words of the law, the blessings andcursings, according to all that is written in the book of the law.\n35. There was not word of all that Moses commanded, which Joshua read not before all thecongregationof Israel, with the women, and the little ones, and the strangers thatwere conversantamong them.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Joshua": {
      "1": {
        "verses": {
          "1": {
            "text": "Now after thedeathof Moses the servant of theLordit came to pass, that theLordspake unto Joshua the son of Nun, Moses minister, saying,",
            "citation": "(Joshua 1:1)"
          },
          "2": {
            "text": "Moses my servant is dead; now therefore arise, go over this Jordan,thou, and all this people, unto thelandwhich I do give to them,evento the children of Israel.",
            "citation": "(Joshua 1:2)"
          },
          "3": {
            "text": "Every place that the sole of your foot shall tread upon, that have I given unto you, as I said unto Moses.",
            "citation": "(Joshua 1:3)"
          },
          "4": {
            "text": "From the wilderness and thisLebanoneven unto the great river, the river Euphrates, all the land of the Hittites, and unto thegreat seatoward the going down of the sun, shall be yourcoast.",
            "citation": "(Joshua 1:4)"
          },
          "5": {
            "text": "There shall not any man be able to stand before thee all the days of thy life: as I was withMoses,soI will bewith thee: I will not fail thee, norforsakethee.",
            "citation": "(Joshua 1:5)"
          },
          "6": {
            "text": "Be strong and of goodcourage: for unto this people shalt thoudividefor aninheritancetheland, which I sware unto their fathers to give them.",
            "citation": "(Joshua 1:6)"
          },
          "7": {
            "text": "Only be thou strong and verycourageous, that thou mayest observe to do according to all the law, which Moses my servant commanded thee:turnnot from ittothe right hand ortothe left, that thou mayestprosperwhithersoever thou goest.",
            "citation": "(Joshua 1:7)"
          },
          "8": {
            "text": "This book of thelawshall not depart out of thy mouth; but thou shaltmeditatetherein day and night, that thou mayest observe to do according to all that is written therein: for then thou shalt make thy way prosperous, and then thou shalt have good success.",
            "citation": "(Joshua 1:8)"
          },
          "9": {
            "text": "Have not I commanded thee? Be strong and of good courage; be not afraid, neither be thou dismayed: for theLordthy Godiswith thee whithersoever thou goest.",
            "citation": "(Joshua 1:9)"
          },
          "10": {
            "text": "Then Joshua commandedtheofficers of the people, saying,",
            "citation": "(Joshua 1:10)"
          },
          "11": {
            "text": "Pass throughthe host, and command the people, saying, Prepare youvictuals; for within three days ye shall pass over this Jordan, to go in topossessthe land, which theLordyour God giveth you to possess it.",
            "citation": "(Joshua 1:11)"
          },
          "12": {
            "text": "And to the Reubenites, and to the Gadites, and to half the tribe of Manasseh, spake Joshua, saying,",
            "citation": "(Joshua 1:12)"
          },
          "13": {
            "text": "Remember thewordwhich Moses the servant of theLordcommanded you, saying, TheLordyour God hath given yourest, and hath given you this land.",
            "citation": "(Joshua 1:13)"
          },
          "14": {
            "text": "Your wives, your little ones, and your cattle, shall remain in the land which Moses gave you on this side Jordan; but ye shall pass before your brethren armed, all the mighty men of valour, and help them;",
            "citation": "(Joshua 1:14)"
          },
          "15": {
            "text": "Until theLordhave given your brethren rest, ashe hath givenyou, and they also have possessed the land which theLordyour God giveth them: then ye shall return unto the land of your possession, and enjoy it, which Moses theLords servant gave you on this side Jordan toward the sunrising.",
            "citation": "(Joshua 1:15)"
          },
          "16": {
            "text": "And they answered Joshua, saying, All that thou commandest us we will do, and whithersoever thou sendest us, we will go.",
            "citation": "(Joshua 1:16)"
          },
          "17": {
            "text": "According as we hearkened unto Moses in all things, so will we hearken unto thee: only theLordthy God be with thee, as he was with Moses.",
            "citation": "(Joshua 1:17)"
          },
          "18": {
            "text": "Whosoeverhe bethat dothrebelagainst thy commandment, and will not hearken unto thy words in all that thou commandest him, he shall be put todeath: only be strong and of good courage.",
            "citation": "(Joshua 1:18)"
          }
        }
      },
      "2": {
        "verses": {
          "1": {
            "text": "And Joshua the son of Nun sent out of Shittim two men to spy secretly, saying, Go view the land, even Jericho. And they went, and came into an harlots house, namedRahab, and lodged there.",
            "citation": "(Joshua 2:1)"
          },
          "2": {
            "text": "And it was told the king of Jericho, saying, Behold, there came men in hither to night of the children of Israel to search out the country.",
            "citation": "(Joshua 2:2)"
          },
          "3": {
            "text": "And the king of Jericho sent unto Rahab, saying, Bring forth the men that are come to thee, which are entered into thine house: for they be come to search out all the country.",
            "citation": "(Joshua 2:3)"
          },
          "4": {
            "text": "And the woman took the two men, and hid them, and said thus, There came men unto me, but I wist not whence theywere:",
            "citation": "(Joshua 2:4)"
          },
          "5": {
            "text": "And it came to passabout the timeof shutting of the gate, when it was dark, that the men went out: whither the men went Iwotnot: pursue after them quickly; for ye shall overtake them.",
            "citation": "(Joshua 2:5)"
          },
          "6": {
            "text": "But she had brought them up to the roof of the house, and hid them with the stalks of flax, which she had laid in order upon the roof.",
            "citation": "(Joshua 2:6)"
          },
          "7": {
            "text": "And the men pursued after them the way to Jordan unto the fords: and as soon as they which pursued after them were gone out, they shut the gate.",
            "citation": "(Joshua 2:7)"
          },
          "8": {
            "text": "And before they were laid down, she came up unto them upon the roof;",
            "citation": "(Joshua 2:8)"
          },
          "9": {
            "text": "And she said unto the men, I know that theLordhath given you the land, and that yourterroris fallen upon us, and that all the inhabitants of the landfaintbecause of you.",
            "citation": "(Joshua 2:9)"
          },
          "10": {
            "text": "For we haveheardhow theLorddried up the water of theRed seafor you, when ye came out of Egypt; and what ye did unto the two kings of theAmorites, thatwereon the other side Jordan, Sihon and Og, whom ye utterly destroyed.",
            "citation": "(Joshua 2:10)"
          },
          "11": {
            "text": "And as soon as we hadheardthese things,ourheartsdid melt, neither did there remain any more courage in any man, because of you: for theLordyour God, heisGodinheavenabove, and in earth beneath.",
            "citation": "(Joshua 2:11)"
          },
          "12": {
            "text": "Now therefore, I pray you,swearunto me by theLord, since I have shewed youkindness, that ye will also shew kindness unto my fathers house, and give me true token:",
            "citation": "(Joshua 2:12)"
          },
          "13": {
            "text": "Andthatye will save alive my father, and my mother, and my brethren, and my sisters, and all that they have, and deliver our lives from death.",
            "citation": "(Joshua 2:13)"
          },
          "14": {
            "text": "And the men answered her, Our life for yours, if ye utter not this our business. And it shall be, when theLordhath given us the land, that we will deal kindly and truly with thee.",
            "citation": "(Joshua 2:14)"
          },
          "15": {
            "text": "Then she let them down by acordthrough the window: for her housewasupon the town wall, and she dwelt upon the wall.",
            "citation": "(Joshua 2:15)"
          },
          "16": {
            "text": "And she said unto them, Get you to the mountain, lest the pursuers meet you; and hide yourselves there three days, until the pursuers be returned: and afterward may ye go your way.",
            "citation": "(Joshua 2:16)"
          },
          "17": {
            "text": "And the men said unto her, Wewill beblamelessof this thine oath which thou hast made us swear.",
            "citation": "(Joshua 2:17)"
          },
          "18": {
            "text": "Behold,whenwe come into the land, thou shalt bind this line of scarlet thread in the window which thou didst let us down by: and thou shalt bring thyfather, and thy mother, and thy brethren, and all thy fathers household, home unto thee.",
            "citation": "(Joshua 2:18)"
          },
          "19": {
            "text": "And it shall be,thatwhosoever shall go out of the doors of thy house into the street, his bloodshall beupon his head, and wewill beguiltless: and whosoever shall be with thee in the house, his bloodshall beon our head, ifanyhand be upon him.",
            "citation": "(Joshua 2:19)"
          },
          "20": {
            "text": "And if thou utter this our business, then we will be quit of thine oath which thou hast made us to swear.",
            "citation": "(Joshua 2:20)"
          },
          "21": {
            "text": "And she said, According unto your words, sobeit. And she sent them away, and they departed: and she bound the scarlet line in the window.",
            "citation": "(Joshua 2:21)"
          },
          "22": {
            "text": "And they went, and came unto the mountain, and abode there three days, until the pursuers were returned: and the pursuers soughtthemthroughout all the way, but foundthemnot.",
            "citation": "(Joshua 2:22)"
          },
          "23": {
            "text": "So the two men returned, and descended from the mountain, and passed over, and came to Joshua the son of Nun, and told him allthingsthat befell them:",
            "citation": "(Joshua 2:23)"
          },
          "24": {
            "text": "And they said unto Joshua, Truly theLordhathdeliveredinto our hands all the land; for even all the inhabitants of the country do faint because of us.",
            "citation": "(Joshua 2:24)"
          }
        }
      },
      "3": {
        "verses": {
          "1": {
            "text": "And Joshua rose early in the morning; and they removed from Shittim, and came to Jordan, he and all the children of Israel, and lodged there before they passed over.",
            "citation": "(Joshua 3:1)"
          },
          "2": {
            "text": "And it came to pass after three days, that the officers went through the host;",
            "citation": "(Joshua 3:2)"
          },
          "3": {
            "text": "And they commanded the people, saying, When ye see thearkof the covenant of theLordyour God, and the priests the Levites bearing it, then ye shall remove from your place, and go after it.",
            "citation": "(Joshua 3:3)"
          },
          "4": {
            "text": "Yet there shall be space between you and it, about two thousand cubits by measure: come not near unto it, that ye may know thewayby which ye must go: for ye have not passedthisway heretofore.",
            "citation": "(Joshua 3:4)"
          },
          "5": {
            "text": "And Joshua said unto the people,Sanctify yourselves: for to morrow theLordwill do wonders among you.",
            "citation": "(Joshua 3:5)"
          },
          "6": {
            "text": "And Joshua spake unto the priests, saying, Take up the ark of the covenant, and pass over before the people. And they took up the ark of the covenant, and went before the people.",
            "citation": "(Joshua 3:6)"
          },
          "7": {
            "text": "And theLordsaid unto Joshua, This day will I begin tomagnifythee in the sight of all Israel, that they may know that, as I was with Moses,soI will be with thee.",
            "citation": "(Joshua 3:7)"
          },
          "8": {
            "text": "And thou shalt command the priests that bear the ark of the covenant, saying, When ye are come to the brink of the water of Jordan, ye shall stand still in Jordan.",
            "citation": "(Joshua 3:8)"
          },
          "9": {
            "text": "And Joshua said unto the children of Israel, Come hither, and hear the words of theLordyour God.",
            "citation": "(Joshua 3:9)"
          },
          "10": {
            "text": "And Joshua said, Hereby ye shall know that theliving Godisamong you, andthathe will without fail drive out from before you theCanaanites, and the Hittites, and the Hivites, and the Perizzites, and the Girgashites, and the Amorites, and the Jebusites.",
            "citation": "(Joshua 3:10)"
          },
          "11": {
            "text": "Behold, the ark of the covenant of the Lord of all the earth passeth over before you into Jordan.",
            "citation": "(Joshua 3:11)"
          },
          "12": {
            "text": "Now therefore take you twelve men out of the tribes of Israel, out of every tribe man.",
            "citation": "(Joshua 3:12)"
          },
          "13": {
            "text": "And it shall come to pass, as soon as the soles of the feet of the priests that bear the ark of theLord, the Lord of all the earth, shall rest in the waters of Jordan,thatthe waters of Jordan shall be cut offfromthe waters that come down from above; and they shall stand upon anheap.",
            "citation": "(Joshua 3:13)"
          },
          "14": {
            "text": "And it came to pass, when the people removed from their tents, to pass over Jordan, and the priests bearing the ark of the covenant before the people;",
            "citation": "(Joshua 3:14)"
          },
          "15": {
            "text": "And as they that bare the ark were come unto Jordan, and the feet of the priests that bare the ark were dipped in the brim of the water, (for Jordan overfloweth all his banks all the time of harvest,)",
            "citation": "(Joshua 3:15)"
          },
          "16": {
            "text": "That thewaterswhich came down fromabovestoodandrose up upon anheapvery far from the city Adam, thatisbeside Zaretan: and those that came down toward the sea of the plain,eventhesalt sea, failed,andwere cut off: and the people passed over right against Jericho.",
            "citation": "(Joshua 3:16)"
          },
          "17": {
            "text": "And the priests that bare the ark of the covenant of theLordstood firm ondryground in the midst of Jordan, and all the Israelites passed over on dry ground, until all the people were passed clean over Jordan.",
            "citation": "(Joshua 3:17)"
          }
        }
      },
      "4": {
        "verses": {
          "1": {
            "text": "And it came to pass, when all the people werecleanpassed over Jordan, that theLordspake unto Joshua, saying,",
            "citation": "(Joshua 4:1)"
          },
          "2": {
            "text": "Take you twelve men out of the people, out of every tribe man,",
            "citation": "(Joshua 4:2)"
          },
          "3": {
            "text": "And command ye them, saying, Take you hence out of the midst of Jordan, out of the place where the priests feet stood firm,twelvestones, and ye shall carry them over with you, and leave them in the lodging place, where ye shall lodge this night.",
            "citation": "(Joshua 4:3)"
          },
          "4": {
            "text": "Then Joshua called thetwelvemen, whom he had prepared of the children of Israel, out of every tribe man:",
            "citation": "(Joshua 4:4)"
          },
          "5": {
            "text": "And Joshua said unto them, Pass over before the ark of theLordyour God into the midst of Jordan, and take ye up every man of you stone upon his shoulder, according unto the number of the tribes of the children of Israel:",
            "citation": "(Joshua 4:5)"
          },
          "6": {
            "text": "That this may be sign among you,thatwhen yourchildrenasktheir fathersin time to come, saying, Whatmeanye by these stones?",
            "citation": "(Joshua 4:6)"
          },
          "7": {
            "text": "Then ye shall answer them, That the waters of Jordan were cut off before thearkof the covenant of theLord; when it passed over Jordan, the waters of Jordan were cut off: and these stones shall be for amemorialunto the children of Israel for ever.",
            "citation": "(Joshua 4:7)"
          },
          "8": {
            "text": "And the children of Israel did so as Joshua commanded, and took up twelve stones out of the midst ofJordan, as theLordspake unto Joshua, according to the number of the tribes of the children of Israel, and carried them over with them unto the place where they lodged, and laid them down there.",
            "citation": "(Joshua 4:8)"
          },
          "9": {
            "text": "And Joshua set up twelve stones in the midst of Jordan, in the place where the feet of the priests which bare the ark of the covenant stood: and they are there unto this day.",
            "citation": "(Joshua 4:9)"
          },
          "10": {
            "text": "For the priests which bare the ark stood in the midst of Jordan, until every thing was finished that theLordcommanded Joshua to speak unto the people, according to all that Moses commanded Joshua: and the people hasted and passed over.",
            "citation": "(Joshua 4:10)"
          },
          "11": {
            "text": "And it came to pass, when all the people were cleanpassedover, that the ark of theLordpassed over, and the priests, in the presence of the people.",
            "citation": "(Joshua 4:11)"
          },
          "12": {
            "text": "And the children of Reuben, and the children of Gad, and half the tribe of Manasseh, passed over armed before the children of Israel, as Moses spake unto them:",
            "citation": "(Joshua 4:12)"
          },
          "13": {
            "text": "About forty thousand prepared for war passed over before theLordunto battle, to the plains of Jericho.",
            "citation": "(Joshua 4:13)"
          },
          "14": {
            "text": "On that day theLordmagnifiedJoshua in the sight of all Israel; and they feared him, as they feared Moses, all the days of his life.",
            "citation": "(Joshua 4:14)"
          },
          "15": {
            "text": "And theLordspake unto Joshua, saying,",
            "citation": "(Joshua 4:15)"
          },
          "16": {
            "text": "Command the priests that bear the ark of thetestimony, that they come up out of Jordan.",
            "citation": "(Joshua 4:16)"
          },
          "17": {
            "text": "Joshua therefore commanded the priests, saying, Come ye up out of Jordan.",
            "citation": "(Joshua 4:17)"
          },
          "18": {
            "text": "And it came to pass, when the priests that bare the ark of the covenant of theLordwere come up out of the midst of Jordan,andthe soles of the priests feet were lifted up unto the dry land, that the waters of Jordan returned unto their place, and flowed over all his banks, asthey didbefore.",
            "citation": "(Joshua 4:18)"
          },
          "19": {
            "text": "And the people came up out of Jordan on the tenthdayof the first month, and encamped inGilgal, in the east border of Jericho.",
            "citation": "(Joshua 4:19)"
          },
          "20": {
            "text": "And those twelve stones, which they took out of Jordan, did Joshua pitch in Gilgal.",
            "citation": "(Joshua 4:20)"
          },
          "21": {
            "text": "And he spake unto the children of Israel, saying, When your children shall ask their fathers in time to come, saying, Whatmeanthese stones?",
            "citation": "(Joshua 4:21)"
          },
          "22": {
            "text": "Then ye shall let yourchildrenknow, saying, Israel came over this Jordan on dry land.",
            "citation": "(Joshua 4:22)"
          },
          "23": {
            "text": "For theLordyour God dried up the waters of Jordan from before you, until ye were passed over, as theLordyour God did to the Red sea, which hedriedup from before us, until we were gone over:",
            "citation": "(Joshua 4:23)"
          },
          "24": {
            "text": "That all the people of the earth mightknowthe hand of theLord, that itismighty: that ye mightfeartheLordyour God for ever.",
            "citation": "(Joshua 4:24)"
          }
        }
      },
      "5": {
        "verses": {
          "1": {
            "text": "And it came to pass, when all the kings of the Amorites, whichwereon the side of Jordan westward, and all the kings of the Canaanites, whichwereby the sea,heardthat theLordhad dried up the waters of Jordan from before the children of Israel, until we were passed over, that theirheartmelted, neither was there spirit in them any more, because of the children of Israel.",
            "citation": "(Joshua 5:1)"
          },
          "2": {
            "text": "At that time theLordsaid unto Joshua, Make theesharp knives, andcircumciseagain the children of Israel the second time.",
            "citation": "(Joshua 5:2)"
          },
          "3": {
            "text": "And Joshua made him sharp knives, and circumcised the children of Israel at the hill of the foreskins.",
            "citation": "(Joshua 5:3)"
          },
          "4": {
            "text": "And thisisthe cause why Joshua did circumcise: All the people that came out of Egypt,that weremales,evenall the men of war, died in the wilderness by the way, after they came out of Egypt.",
            "citation": "(Joshua 5:4)"
          },
          "5": {
            "text": "Now all the people that came out were circumcised: but all the peoplethat wereborn in the wilderness by the way as they came forth out of Egypt,themthey had not circumcised.",
            "citation": "(Joshua 5:5)"
          },
          "6": {
            "text": "For the children of Israel walked forty years in the wilderness, till all the peoplethat weremen of war, which came out of Egypt, were consumed, because theyobeyed notthe voice of theLord: unto whom theLordsware that he would not shew them theland, which theLordswareunto their fathers that he would give us, land that floweth with milk and honey.",
            "citation": "(Joshua 5:6)"
          },
          "7": {
            "text": "And their children,whomhe raised upin their stead, them Joshua circumcised: for they were uncircumcised, because they had not circumcised them by the way.",
            "citation": "(Joshua 5:7)"
          },
          "8": {
            "text": "And it came to pass, when they had done circumcising all the people, that they abode in their places in the camp, till they werewhole.",
            "citation": "(Joshua 5:8)"
          },
          "9": {
            "text": "And theLordsaid unto Joshua, This day have I rolled away the reproach of Egypt from off you. Wherefore the name of the place is calledGilgalunto this day.",
            "citation": "(Joshua 5:9)"
          },
          "10": {
            "text": "And the children of Israel encamped in Gilgal, and kept thepassoveron the fourteenth day of the month at even in the plains of Jericho.",
            "citation": "(Joshua 5:10)"
          },
          "11": {
            "text": "And they did eat of theold cornof the land on the morrow after the passover,unleavenedcakes, and parchedcornin the selfsame day.",
            "citation": "(Joshua 5:11)"
          },
          "12": {
            "text": "And themannaceased on the morrow after they had eaten of the old corn of the land; neither had the children of Israel manna any more; but they did eat of the fruit of the land of Canaan that year.",
            "citation": "(Joshua 5:12)"
          },
          "13": {
            "text": "And it came to pass, when Joshua was by Jericho, that he lifted up his eyes and looked, and, behold, there stood amanover against him with his sword drawn in his hand: and Joshua went unto him, and said unto him,Artthou for us, or for our adversaries?",
            "citation": "(Joshua 5:13)"
          },
          "14": {
            "text": "And he said, Nay; butascaptain of thehostof theLordam I now come. And Joshua fell on his face to the earth, and did worship, and said unto him, What saith my lord unto his servant?",
            "citation": "(Joshua 5:14)"
          },
          "15": {
            "text": "And the captain of theLords host said unto Joshua, Loose thyshoefrom off thy foot; for the place whereon thou standestisholy. And Joshua did so.",
            "citation": "(Joshua 5:15)"
          }
        }
      },
      "6": {
        "verses": {
          "1": {
            "text": "NowJerichowas straitly shut up because of the children of Israel: none went out, and none came in.",
            "citation": "(Joshua 6:1)"
          },
          "2": {
            "text": "And theLordsaid unto Joshua, See, I have given into thine hand Jericho, and the king thereof,andthe mighty men of valour.",
            "citation": "(Joshua 6:2)"
          },
          "3": {
            "text": "And ye shallcompassthe city, allyemen of war,andgo round about the city once. Thus shalt thou do six days.",
            "citation": "(Joshua 6:3)"
          },
          "4": {
            "text": "And seven priests shall bear before the ark seven trumpets of rams horns: and the seventh day ye shall compass the city seven times,and the priests shall blow with the trumpets.",
            "citation": "(Joshua 6:4)"
          },
          "5": {
            "text": "And it shall come to pass, that when they make longblastwith the rams horn,andwhen ye hear the sound of the trumpet, all the people shall shout with great shout; and the wall of the city shall fall down flat, and the people shall ascend up every man straight before him.",
            "citation": "(Joshua 6:5)"
          },
          "6": {
            "text": "And Joshua the son of Nun called the priests, and said unto them, Take up thearkof the covenant, and let seven priests bear seven trumpets of rams horns before the ark of theLord.",
            "citation": "(Joshua 6:6)"
          },
          "7": {
            "text": "And he said unto the people, Pass on, and compass the city, and let him that is armed pass on before the ark of theLord.",
            "citation": "(Joshua 6:7)"
          },
          "8": {
            "text": "And it came to pass, when Joshua had spoken unto the people, that the seven priests bearing the seven trumpets of rams horns passed on before theLord, and blew with the trumpets: and the ark of the covenant of theLordfollowed them.",
            "citation": "(Joshua 6:8)"
          },
          "9": {
            "text": "And the armed men went before the priests that blew with the trumpets, andthe rearwardcame after the ark,the priestsgoing on, and blowing with the trumpets.",
            "citation": "(Joshua 6:9)"
          },
          "10": {
            "text": "And Joshua had commanded the people, saying, Ye shall not shout, nor make any noise with your voice, neither shallanyword proceed out of your mouth, until the day I bid you shout; then shall ye shout.",
            "citation": "(Joshua 6:10)"
          },
          "11": {
            "text": "So the ark of theLordcompassed the city, going aboutitonce: and they came into the camp, and lodged in the camp.",
            "citation": "(Joshua 6:11)"
          },
          "12": {
            "text": "And Joshua rose early in the morning, and the priests took up the ark of theLord.",
            "citation": "(Joshua 6:12)"
          },
          "13": {
            "text": "And seven priests bearing seven trumpets of rams horns before the ark of theLordwent on continually, and blew with the trumpets: and the armed men went before them; but the rearward came after the ark of theLord,the priestsgoing on, and blowing with the trumpets.",
            "citation": "(Joshua 6:13)"
          },
          "14": {
            "text": "And the second day they compassed the city once, and returned into the camp: so they did six days.",
            "citation": "(Joshua 6:14)"
          },
          "15": {
            "text": "And it came to pass on the seventh day, that they rose early about the dawning of the day, and compassed the city after the same manner seven times: only on that day they compassed the city seven times.",
            "citation": "(Joshua 6:15)"
          },
          "16": {
            "text": "And it came to pass at the seventh time, when the priests blew with the trumpets, Joshua said unto the people, Shout; for theLordhath given you the city.",
            "citation": "(Joshua 6:16)"
          },
          "17": {
            "text": "And the city shall be accursed,evenit, and all thataretherein, to theLord: only Rahab the harlot shall live, she and all thatarewith her in the house, because she hid the messengers that we sent.",
            "citation": "(Joshua 6:17)"
          },
          "18": {
            "text": "And ye, in any wise keepyourselvesfromthe accursed thing, lest ye makeyourselvesaccursed, when ye take of the accursed thing, and make the camp of Israel curse, and trouble it.",
            "citation": "(Joshua 6:18)"
          },
          "19": {
            "text": "But all the silver, and gold, and vessels of brass and iron,areconsecrated unto theLord: they shall come into the treasury of theLord.",
            "citation": "(Joshua 6:19)"
          },
          "20": {
            "text": "So the people shouted whenthe priestsblew with the trumpets: and it came to pass, when the people heard the sound of the trumpet, and the people shouted with great shout, that thewallfell down flat, so that the people went up into the city, every man straight before him, and they took the city.",
            "citation": "(Joshua 6:20)"
          },
          "21": {
            "text": "And they utterlydestroyedall thatwasin the city, both man and woman, young and old, and ox, and sheep, and ass, with the edge of the sword.",
            "citation": "(Joshua 6:21)"
          },
          "22": {
            "text": "But Joshua had said unto the two men that had spied out thecountry, Go into the harlots house, and bring out thence the woman, and all that she hath, as ye sware unto her.",
            "citation": "(Joshua 6:22)"
          },
          "23": {
            "text": "And the young men that were spies went in, and brought outRahab, and her father, and her mother, and her brethren, and all that she had; and they brought out all her kindred, and left them without the camp of Israel.",
            "citation": "(Joshua 6:23)"
          },
          "24": {
            "text": "And they burnt the city with fire, and all thatwastherein: only the silver, and the gold, and the vessels of brass and of iron, they put into the treasury of the house of theLord.",
            "citation": "(Joshua 6:24)"
          },
          "25": {
            "text": "And Joshua saved Rahab the harlot alive, and her fathers household, and all that she had; and she dwelleth in Israelevenunto this day; because she hid the messengers, which Joshua sent to spy out Jericho.",
            "citation": "(Joshua 6:25)"
          },
          "26": {
            "text": "And Joshuaadjuredthemat that time, saying, Cursedbethe man before theLord, that riseth up and buildeth this cityJericho: he shall lay the foundation thereof in his firstborn, and in his youngestsonshall he set up the gates of it.",
            "citation": "(Joshua 6:26)"
          },
          "27": {
            "text": "So theLordwaswithJoshua; and his fame wasnoisedthroughout all the country.",
            "citation": "(Joshua 6:27)"
          }
        }
      },
      "7": {
        "verses": {
          "1": {
            "text": "But the children of Israel committed trespass in the accursed thing: forAchan, the son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, took of theaccursedthing: and the anger of theLordwas kindled against the children of Israel.",
            "citation": "(Joshua 7:1)"
          },
          "2": {
            "text": "And Joshua sent men from Jericho to Ai, whichisbesideBeth-aven, on the east side of Beth-el, and spake unto them, saying, Go up and view the country. And the men went up and viewed Ai.",
            "citation": "(Joshua 7:2)"
          },
          "3": {
            "text": "And they returned to Joshua, and said unto him, Let not all the people go up; but let about two or three thousand men go up and smite Ai;andmake not all the people to labour thither; for theyare butfew.",
            "citation": "(Joshua 7:3)"
          },
          "4": {
            "text": "So there went up thither of the people about three thousand men: and theyfledbefore the men of Ai.",
            "citation": "(Joshua 7:4)"
          },
          "5": {
            "text": "And the men of Ai smote of them about thirty and six men: for they chased themfrombefore the gateevenuntoShebarim, and smote them in thegoing down: wherefore the hearts of the people melted, and became as water.",
            "citation": "(Joshua 7:5)"
          },
          "6": {
            "text": "And Joshuarenthis clothes, and fell to the earth upon his face before the ark of theLorduntil the eventide, he and the elders of Israel, and put dust upon their heads.",
            "citation": "(Joshua 7:6)"
          },
          "7": {
            "text": "And Joshua said, Alas, O LordGod, wherefore hast thou at all brought this people over Jordan, to deliver us into the hand of the Amorites, to destroy us? would to God we had been content, and dwelt on the other side Jordan!",
            "citation": "(Joshua 7:7)"
          },
          "8": {
            "text": "O Lord, what shall I say, when Israel turneth their backs before their enemies!",
            "citation": "(Joshua 7:8)"
          },
          "9": {
            "text": "For the Canaanites and all the inhabitants of the land shall hearof it,and shallenvironus round, and cut off our name from the earth: and what wilt thou do unto thy greatname?",
            "citation": "(Joshua 7:9)"
          },
          "10": {
            "text": "And theLordsaid unto Joshua, Get thee up; wherefore liest thou thus upon thy face?",
            "citation": "(Joshua 7:10)"
          },
          "11": {
            "text": "Israel hathsinned, and they have also transgressed my covenant which I commanded them: for they have even taken of the accursed thing, and have also stolen, anddissembledalso, and they have putiteven among their own stuff.",
            "citation": "(Joshua 7:11)"
          },
          "12": {
            "text": "Therefore the children of Israel could not stand before their enemies,butturnedtheirbacks before their enemies, because they were accursed: neither will I be with you any more, except ye destroy the accursed from among you.",
            "citation": "(Joshua 7:12)"
          },
          "13": {
            "text": "Up,sanctifythe people, and say,Sanctifyyourselves against to morrow: for thus saith theLordGod of Israel,There isan accursed thing in the midst of thee, O Israel: thou canst not stand before thine enemies, until ye take away the accursed thing from among you.",
            "citation": "(Joshua 7:13)"
          },
          "14": {
            "text": "In the morning therefore ye shall be brought according to your tribes: and it shall be,thatthe tribe which theLordtaketh shall come according to the familiesthereof;and thefamilywhich theLordshall take shall come by households; and the household which theLordshall take shall come man by man.",
            "citation": "(Joshua 7:14)"
          },
          "15": {
            "text": "And it shall be,thathe that is taken with the accursed thing shall be burnt with fire, he and all that he hath: because he hath transgressed the covenant of theLord, and because he hathwrought follyin Israel.",
            "citation": "(Joshua 7:15)"
          },
          "16": {
            "text": "So Joshua rose up early in the morning, and brought Israel by their tribes; and the tribe of Judah was taken:",
            "citation": "(Joshua 7:16)"
          },
          "17": {
            "text": "And he brought the family of Judah; and he took the family of the Zarhites: and he brought the family of the Zarhites man by man; and Zabdi was taken:",
            "citation": "(Joshua 7:17)"
          },
          "18": {
            "text": "And he brought his household man by man; and Achan, the son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, was taken.",
            "citation": "(Joshua 7:18)"
          },
          "19": {
            "text": "And Joshua said unto Achan, My son, give, I pray thee,gloryto theLordGod of Israel, and makeconfessionunto him; andtellme now what thou hast done; hideitnot from me.",
            "citation": "(Joshua 7:19)"
          },
          "20": {
            "text": "And Achan answered Joshua, and said, Indeed I have sinned against theLordGodof Israel, and thus and thus have I done:",
            "citation": "(Joshua 7:20)"
          },
          "21": {
            "text": "When I saw among the spoils goodlyBabylonishgarment, and two hundred shekels of silver, and wedge of gold of fifty shekels weight, then Icovetedthem, and took them; and, behold, theyarehid in the earth in the midst of my tent, and the silver under it.",
            "citation": "(Joshua 7:21)"
          },
          "22": {
            "text": "So Joshua sent messengers, and they ran unto the tent; and, behold,it washid in his tent, and the silver under it.",
            "citation": "(Joshua 7:22)"
          },
          "23": {
            "text": "And they took them out of the midst of the tent, and brought them unto Joshua, and unto all the children of Israel, and laid them out before theLord.",
            "citation": "(Joshua 7:23)"
          },
          "24": {
            "text": "And Joshua, and all Israel with him, took Achan the son of Zerah, and the silver, and the garment, and the wedge of gold, and his sons, and his daughters, and his oxen, and his asses, and his sheep, and his tent, and all that he had: and they brought them unto the valley of Achor.",
            "citation": "(Joshua 7:24)"
          },
          "25": {
            "text": "And Joshua said, Why hast thou troubled us? theLordshall trouble thee this day. And all Israel stoned him with stones, and burned them with fire, after they had stoned them with stones.",
            "citation": "(Joshua 7:25)"
          },
          "26": {
            "text": "And they raised over him great heap of stones unto this day. So theLordturned from the fierceness of his anger. Wherefore the name of that place was called, The valley ofAchor, unto this day.",
            "citation": "(Joshua 7:26)"
          }
        }
      },
      "8": {
        "verses": {
          "1": {
            "text": "And theLordsaid unto Joshua, Fear not, neither be thou dismayed: take all the people of war with thee, and arise, go up to Ai: see, I have given into thy hand the king of Ai, and his people, and his city, and his land:",
            "citation": "(Joshua 8:1)"
          },
          "2": {
            "text": "And thou shalt do to Ai and her king as thou didst untoJerichoand her king: only the spoil thereof, and the cattle thereof, shall ye take for prey unto yourselves: lay thee an ambush for the city behind it.",
            "citation": "(Joshua 8:2)"
          },
          "3": {
            "text": "So Joshua arose, and all the people of war, to go up against Ai: and Joshua chose out thirty thousand mighty men of valour, and sent them away by night.",
            "citation": "(Joshua 8:3)"
          },
          "4": {
            "text": "And he commanded them, saying, Behold, ye shall lie in wait against the city,evenbehind the city: go not very far from the city, but be ye all ready:",
            "citation": "(Joshua 8:4)"
          },
          "5": {
            "text": "And I, and all the people thatarewith me, will approach unto the city: and it shall come to pass, when they come out against us, as at the first, that we will flee before them,",
            "citation": "(Joshua 8:5)"
          },
          "6": {
            "text": "(For they will come out after us) till we have drawn them from the city; for they will say, They flee before us, as at the first: therefore we will flee before them.",
            "citation": "(Joshua 8:6)"
          },
          "7": {
            "text": "Then ye shall rise up from the ambush, and seize upon the city: for theLordyour God will deliver it into your hand.",
            "citation": "(Joshua 8:7)"
          },
          "8": {
            "text": "And it shall be, when ye have taken the city,thatye shall set the city on fire: according to the commandment of theLordshall ye do. See, I have commanded you.",
            "citation": "(Joshua 8:8)"
          },
          "9": {
            "text": "Joshua therefore sent them forth: and they went to lie in ambush, and abode between Beth-el and Ai, on the west side of Ai: but Joshua lodged that night among the people.",
            "citation": "(Joshua 8:9)"
          },
          "10": {
            "text": "And Joshua rose up early in the morning, and numbered the people, and went up, he and the elders of Israel, before the people to Ai.",
            "citation": "(Joshua 8:10)"
          },
          "11": {
            "text": "And all the people,even the peopleof war thatwerewith him, went up, and drew nigh, and came before the city, andpitchedon the north side of Ai: nowthere wasa valley between them and Ai.",
            "citation": "(Joshua 8:11)"
          },
          "12": {
            "text": "And he took about five thousand men, and set them to lie in ambush between Beth-el and Ai, on the west side of the city.",
            "citation": "(Joshua 8:12)"
          },
          "13": {
            "text": "And when they had set the people,evenall the host thatwason the north of the city, andtheir liers in waiton the west of the city, Joshua went that night into the midst of the valley.",
            "citation": "(Joshua 8:13)"
          },
          "14": {
            "text": "And it came to pass, when the king of Ai sawit,that they hasted and rose up early, and the men of the city went out against Israel to battle, he and all his people, at time appointed, before the plain; but hewistnot thatthere wereliers in ambush against him behind the city.",
            "citation": "(Joshua 8:14)"
          },
          "15": {
            "text": "And Joshua and all Israel made as if they were beaten before them, and fled by the way of the wilderness.",
            "citation": "(Joshua 8:15)"
          },
          "16": {
            "text": "And all the people thatwerein Ai were called together to pursue after them: and they pursued after Joshua, and were drawn away from the city.",
            "citation": "(Joshua 8:16)"
          },
          "17": {
            "text": "And there was not man left in Ai orBeth-el, that went not out after Israel: and they left the city open, and pursued after Israel.",
            "citation": "(Joshua 8:17)"
          },
          "18": {
            "text": "And theLordsaid unto Joshua, Stretch out the spear thatisin thy hand toward Ai; for I will give it into thine hand. And Joshua stretched out the spear thathe hadin his hand toward the city.",
            "citation": "(Joshua 8:18)"
          },
          "19": {
            "text": "And the ambush arose quickly out of their place, and they ran as soon as he had stretched out his hand: and they entered into the city, and took it, and hasted and set the city on fire.",
            "citation": "(Joshua 8:19)"
          },
          "20": {
            "text": "And when the men of Ai looked behind them, they saw, and, behold, the smoke of the city ascended up to heaven, and they had no power to flee this way or that way: and the people that fled to the wilderness turned back upon the pursuers.",
            "citation": "(Joshua 8:20)"
          },
          "21": {
            "text": "And when Joshua and all Israel saw that the ambush had taken the city, and that the smoke of the city ascended, then they turned again, and slew the men of Ai.",
            "citation": "(Joshua 8:21)"
          },
          "22": {
            "text": "And the other issued out of the city against them; so they were in the midst of Israel, some on this side, and some on that side: and they smote them, so that they let none of them remain or escape.",
            "citation": "(Joshua 8:22)"
          },
          "23": {
            "text": "And the king of Ai they took alive, and brought him to Joshua.",
            "citation": "(Joshua 8:23)"
          },
          "24": {
            "text": "And it came to pass, when Israel had made an end of slaying all the inhabitants of Ai in the field, in the wilderness wherein they chased them, and when they were all fallen on the edge of the sword, until they were consumed, that all the Israelites returned unto Ai, and smote it with the edge of the sword.",
            "citation": "(Joshua 8:24)"
          },
          "25": {
            "text": "Andsoit was,thatall that fell that day, both of men and women,weretwelve thousand,evenall the men of Ai.",
            "citation": "(Joshua 8:25)"
          },
          "26": {
            "text": "For Joshua drew not his hand back, wherewith he stretched out the spear, until he had utterly destroyed all the inhabitants of Ai.",
            "citation": "(Joshua 8:26)"
          },
          "27": {
            "text": "Only the cattle and the spoil of that city Israel took fora preyunto themselves, according unto the word of theLordwhich he commanded Joshua.",
            "citation": "(Joshua 8:27)"
          },
          "28": {
            "text": "And Joshua burnt Ai, and made it an heap for ever,evena desolation unto this day.",
            "citation": "(Joshua 8:28)"
          },
          "29": {
            "text": "And the king of Ai he hanged on tree until eventide: and as soon as the sun was down, Joshua commanded that they should take his carcase down from the tree, and cast it at the entering of the gate of the city, and raise thereon great heap of stones,that remainethunto this day.",
            "citation": "(Joshua 8:29)"
          },
          "30": {
            "text": "Then Joshua built an altar unto theLordGod of Israel in mount Ebal,",
            "citation": "(Joshua 8:30)"
          },
          "31": {
            "text": "As Moses the servant of theLordcommanded the children of Israel, as it is written in the book of the law of Moses, analtarof wholestones, over which no man hath lift upanyiron: and they offered thereon burnt offerings unto theLord, and sacrificed peace offerings.",
            "citation": "(Joshua 8:31)"
          },
          "32": {
            "text": "And hewrotethere upon the stones copy of the law of Moses, which he wrote in the presence of the children of Israel.",
            "citation": "(Joshua 8:32)"
          },
          "33": {
            "text": "And all Israel, and their elders, and officers, and their judges, stood on this side the ark and on that side before the priests the Levites, which bare the ark of the covenant of theLord, as well the stranger, as he that was born among them; half of them over against mountGerizim, and half of them over against mount Ebal; as Moses the servant of theLordhad commanded before, that they should bless the people of Israel.",
            "citation": "(Joshua 8:33)"
          },
          "34": {
            "text": "And afterward hereadall the words of the law, the blessings andcursings, according to all that is written in the book of the law.",
            "citation": "(Joshua 8:34)"
          },
          "35": {
            "text": "There was not word of all that Moses commanded, which Joshua read not before all thecongregationof Israel, with the women, and the little ones, and the strangers thatwere conversantamong them.",
            "citation": "(Joshua 8:35)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 53567,
  "total_sources": 10,
  "generated_at": "2025-12-14T04:01:27.381897"
}