{
  "week_number": 36,
  "date_range": "Psalms 102–103",
  "title": ";110;116–119;127–128;135–139;146–150",
  "primary_scriptures": [
    {
      "book": "Psalms",
      "chapters": [
        "102",
        "103"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Psalms",
      "chapters": [
        "102",
        "103"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;110;116–119;127–128;135–139;146–150 ---\nThe traditional Jewish name for the book of Psalms is\nTehillim\n, a Hebrew word that means “praises.” It’s related to the exclamation\nhallelujah\n(meaning “praise Jehovah” or “praise the Lord”). If you had to choose one word to sum up the main message of the Psalms,\npraise\nwould be a good choice. Some psalms contain the direct invitation to “praise ye the Lord” (see especially\nPsalms 146–50\n), and all of them can inspire worship and praise. The Psalms invite us to acknowledge the Lord’s power, His mercy, and the great things He has done. We can never repay Him for any of this, but we can praise Him. That praise might take different forms for different people—it might involve singing, praying, or bearing testimony. It often leads to a deeper commitment to the Lord and to following His teachings. Whatever “praise ye the Lord” means in your life, you can find inspiration to do it as you read and ponder the Psalms.\nIdeas for Learning at Home and at Church\nPsalms 102–3\n;\n116\nThe Lord can comfort me in my suffering.\nNote how\nPsalm 102:1–11\ndescribes feelings of anxiety and isolation that often come during challenges. Maybe you or others you know have experienced such feelings. As you read\nPsalms 102:12–28\n;\n103\n;\n116\n, look for phrases that give you confidence to “call upon the name of the Lord” in your trials (\nPsalm 116:13\n). You might want to mark, memorize, or share with others phrases that give you hope in Him.\nSee also\nIsaiah 25:8\n;\nHebrews 2:17–18\n;\nAlma 7:11–13\n; Camille N. Johnson, “\nChrist Is Relief\n,”\nLiahona\n, May 2023, 81–83; “\nWhere Can I Turn for Peace?\n” (\nHymns\n, no. 129).\nCarl Heinrich Bloch (1834-1890),\nChrist Healing the Sick at Bethesda\n, 1883, oil on canvas, 100 3/4 × 125 1/2 inches. Brigham Young University Museum of Art, purchased with funds provided by Jack R. and Mary Lois Wheatley, 2001.\nPsalms 110\n;\n118\nJesus Christ fulfilled prophecies from the Psalms.\nThe Psalms contain passages that point toward the life and ministry of Jesus Christ. Here are a few examples:\nPsalm 110:1–4\n(see\nMatthew 22:41–45\n;\nHebrews 5:4–10\n;\n6:20\n)\nPsalm 118:22\n(see\nMatthew 21:42\n;\nActs 4:10–11\n;\n1 Peter 2:7\n)\nPsalm 118:25–26\n(see\nMatthew 21:9\n)\nWhat do these verses teach you about Jesus Christ? Why is it important to know this about Him?\nPsalm 119\nGod’s word will keep me on His path.\nPsalm 119\ncontains many phrases that compare our lives to a journey back to Heavenly Father. As you read, look for words like “walk,” “path,” “way,” “feet,” and “wander.” Ponder your own life’s journey—where you have been, where you are now, and where you are heading. What do you learn from this psalm about your journey back home? What have you learned by watching the paths of others? According to this psalm, what has God provided to help you stay on His path?\nThink about a time when following a path or a map helped you travel somewhere successfully. What does that experience teach you about following God’s path?\nIn many other scriptures, the Lord and His prophets speak of a path. Below are some examples. Consider searching these verses and writing down or sharing with others what you learn.\nScripture\nWhat I learn about the path to God\nScripture\nProverbs 4:11–19\nScripture\nMatthew 7:13–14\nScripture\n1 Nephi 8:20–28\nScripture\n2 Nephi 31:17–21\nScripture\nAlma 7:9, 19–20\nScripture\nDoctrine and Covenants 25:2\nHow can these truths help you stay on God’s path?\nWhat additional insights can you learn from the following counsel from President Russell M. Nelson?\n“If our journey through life is to be successful, we need to follow divine direction. The Lord said, ‘Look unto me in every thought; doubt not, fear not’ [\nDoctrine and Covenants 6:36\n]. And the Psalmist wrote, ‘Thy word is a lamp unto my feet, and a light unto my path’ [\nPsalm 119:105\n]. …\n“In your journey through life, you meet many obstacles and make some mistakes. Scriptural guidance helps you to recognize error and make the necessary correction. You stop going in the wrong direction. You carefully study the scriptural road map. Then you proceed with repentance and restitution required to get on the ‘strait and narrow path which leads to eternal life’ [\n2 Nephi 31:18\n]” (“\nLiving by Scriptural Guidance\n,”\nEnsign\n, Nov. 2000, 17).\nSee also Dieter F. Uchtdorf, “\nThe Prodigal and the Road That Leads Home\n,”\nLiahona\n, Nov. 2023, 86–88.\nPsalms 134–36\nThe Lord is more powerful than any idol.\nNotice why, according to\nPsalm 135:15–18\n, it is foolish to trust in false gods. What might you be tempted to trust in that is similar to an idol? You might make a list of the things the Lord can do, as the psalmists did in\nPsalms 134–36\n. What powerful things has He done for you?\nPsalm 139\nThe Lord knows my heart.\nWhat do you find in\nPsalm 139\nthat helps you understand that the Lord is aware of you—your thoughts and actions, strengths and weaknesses? How does this truth influence your life and your choices?\nPsalms 146–50\n“Praise ye the Lord.”\nAs you read these final psalms of praise, think about reasons you have to praise the Lord. Why is it important to praise Him? What are some ways you can praise Him?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nPsalm 102:1–2\nThe Lord comforts me and gives me hope.\nYou or one of your children could read\nPsalm 102:1–2\n, looking for how the Lord helps us during our difficulties. How can we find His help? You could also share with each other times when you needed help and felt that God heard your prayers.\nPsalm 119:105\nGod’s word is like a light.\nYour children might have fun talking about what it feels like to be in the dark. Or they could discuss things that are hard to do in the dark. You might invite them to do something with their eyes closed, such as draw a picture. What do we learn from\nPsalm 119:105\nabout light and the word of God?\nLook for something Heavenly Father has given us to help us stay on His path in the following verses:\nPsalms 119:47–48\n;\n119:105\n;\n1 Nephi 11:25\n;\n2 Nephi 31:20\n. What can we do to stay on God’s path?\nYour children might enjoy looking at pictures of the things mentioned in\nPsalm 119:105\n. They could place the pictures in order as they read the verse. You could also sing a related song together, such as “\nTeach Me to Walk in the Light\n” (\nChildren’s Songbook\n, 177) or “\nI Will Walk with Jesus\n” (Gospel Library).\nPsalm 139:1–3, 23–24\nHeavenly Father and Jesus Christ know me and love me.\nConsider making short lists of things you know about each of your children. As you read the lists one at a time, ask the children to guess who you are describing. Then, after reading\nPsalm 139:1–3\ntogether, you could list things that Heavenly Father and Jesus know about us.\nWrite the words of\nPsalm 139:23–24\non a piece of paper or a board. Invite your children to underline words that describe things God can do for us. Why would we want God to do these things?\nPsalm 146:1, 5–9\nI can praise the Lord.\nMaybe your children could share experiences when someone praised them or told them they did a good job. Share some of the good things from\nPsalm 146:6–9\nthat the Lord has done (help your children understand unfamiliar words). Invite your children to talk about other things He does for us. How can we praise Him for those things?\nLearn at home; share with others.\nPresident Russell M. Nelson has taught that the home should be the “center of gospel learning” (“\nBecoming Exemplary Latter-day Saints\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 13). What can you do this week to deepen your personal or family study of Psalms? After your study, consider sharing with others what you learned and felt. You could do this in conversation, through text or social media, or at church.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 36: Lesson 109: Lesson 109—Introduction to ProverbsWisdom, example, advice, knowledge; Lesson 110: Lesson 110—Proverbs 3This lesson can help students choose to put their trust in God. ---\n\n--- Lesson 109 ---\nHow has wise counsel from trusted loved ones blessed your life? Studying the book of Proverbs can be like seeking wisdom from a caring friend, family member, and the Lord. Applying His wisdom in our lives can keep us on the strait and narrow covenant path. This lesson can help students identify truths that can help them follow the Lord’s path. Student preparation: Invite students to select a piece of valuable advice or helpful words of counsel they have received from parents, leaders, and trusted friends. Invite students to prepare to share the advice and how it has blessed their lives. Possible Learning Activities Trusted advice Consider beginning class by providing small pieces of paper for students. Ask them to write down a valuable piece of advice or counsel they have been given. After collecting the papers, you could read a few of the responses. Invite the student who wrote the response to share how that advice has helped them. Students could pass the remaining papers around the room, the reading the advice of other classmates. Then invite students to discuss the following questions. What makes someone’s advice meaningful to you? How do you determine whose advice you can trust? After students have shared their responses, you might invite them to prayerfully ponder the next questions. How frequently do you follow the wise counsel of others? How frequently do you seek and follow the counsel of the Lord? The wisdom of Proverbs The book of Proverbs is a collection of poetic wisdom written to the Israelites. Some passages in Proverbs are attributed to King Solomon (see Proverbs 1:1 ; 10:1 ; 25:1 ; see also 1 Kings 4:32 ), while other authors are unknown. As you study Proverbs, pay attention to how the Holy Ghost testifies of truth as you identify direction the Lord would like you to apply to your life. You could remind students that Proverbs (like Job and Ecclesiastes) uses elements of Hebrew poetry that can be challenging to readers. If needed, share that although many Proverbs are deeply spiritual, some are simply worldly advice. Read Proverbs 1:1–7 , looking for some of the purposes of the proverbs. Invite students to share what they found. If useful, you could ask why wisdom is important to learn today. Consider explaining that “the fear of the Lord” ( verse 7 ) refers to feeling and showing reverence and respect toward Him. Students might want to write this explanation in their scriptures. Why do you think reverencing or respecting the Lord might be “the beginning of knowledge”? ( verse 7 ). Read Proverbs 2:6–9 , looking for the source of true wisdom. ( Note: a buckler is a portable shield.) Consider linking or cross-referencing these verses with Mosiah 4:9 . How would you summarize what you learned as a statement of truth? Help students identify a truth such as the Lord gives us wisdom to help us follow His path . You could invite students to write this truth in their notes, scriptures, or study journals while you write it on the board. Students could share examples of times when the Lord’s wisdom helped them. They could discuss how His wisdom might be different from the wisdom of the world. Students might mention things like paying tithing leads to the Lord’s blessings ( Malachi 3:10 ) or following the Savior’s law of health brings us physical and spiritual blessings ( Doctrine and Covenants 89:18–21 ). How has following the Lord’s wise counsel helped you stay on His path? What are some examples of when the Savior sought wisdom from His Father rather than from other sources? If students need additional help thinking of moments when the Savior followed His Father’s wisdom, you could share examples like Matthew 14:23 ; 26:36–39 . Students can have an edifying learning experience as they think about how Jesus Christ was an example of the truths they identify. (For additional training on helping students see that the Savior is an example of a principle , see “ Emphasize the Example of Jesus Christ ” in Teacher Development Skills.) The Lord’s wisdom can help us follow His example Help students identify truths that invite them to follow the Savior and be more like Him. To do so, you could provide some or all of the following references from Proverbs. You might write the references you select on strips of paper. You could give one paper to each student. Invite them to read the reference and do the two steps below. Then students could pass their papers to another student and repeat the two steps. Repeat the rotation until students have studied several passages. Note: Lesson 110: “ Proverbs 3 ” will focus on the truths found in that chapter. Study one or more of the following passages from Proverbs, and do the following: Write what you learn as a statement of truth. Write a brief description of how this wisdom could help someone follow the example of Jesus Christ or become more like Him. Proverbs 1:8 Proverbs 4:14–15 Proverbs 4:26 Proverbs 6:23 Proverbs 11:17 Proverbs 15:1 Proverbs 16:16 Proverbs 16:18–19 Proverbs 17:22 Proverbs 23:17 Proverbs 28:13 Proverbs 29:18 Proverbs 30:5 The following activity can help students explain what they learned from their study of Proverbs. Students could do this activity individually, or you could organize them into groups. You could provide paper and art supplies to create a poster, or students could create something on their phones. To assist students, display the following instructions. Open PDF Imagine you were asked to create a visual that uses one of the Proverb passages to help teenagers become more like the Savior. Select a Proverb and create a poster like one you might find in the For the Strength of Youth magazine. Your visual could contain the following: A simple illustration—something creative and that could grab a teenager’s attention The Proverbs reference and the truth it teaches An explanation of how the verse from Proverbs could help a teenager follow the Savior’s example or become more like Him Share the wisdom of Proverbs Provide students an opportunity to share or display their visual. If students did this activity as groups, they could select someone to present their visual to the class. You could display the posters around the room, and students could review their classmates’ work. To conclude class, you might invite students to discuss the following questions or respond in their study journals. Pause and reflect on impressions you might have had throughout the lesson today. Then answer the following questions in your study journal: How have the truths you studied today affected your desire to follow the Lord? What have you felt impressed to do to become more like the Savior?\n\n\n--- Lesson 110 ---\nSometimes it can be hard to trust in the Lord. But as we come to know Him, we realize that “He doeth not anything save it be for the benefit of the world” ( 2 Nephi 26:24 ). We then can see the wisdom in trusting in Him instead of leaning “unto [our] own understanding” ( Proverbs 3:5 ). This lesson can help students choose to put their trust in the Lord. Student preparation: Invite students to consider marking in their scriptures the key scripture phrase for the doctrinal mastery passage Proverbs 3:5–6 : “Trust in the Lord with all thine heart … and he shall direct thy paths.” To prepare for class, students could practice reciting the phrase several times and ponder situations in their lives in which they will need to trust in the Lord. Possible Learning Activities Trust Consider beginning class by writing the word Trust on the board. Then ask the following question while displaying the accompanying situations one at a time. Consider adapting the situations to the needs of your students. Whom would you be willing to trust … to give you a ride home late at night? with your family’s money? to give you advice on whom you should date or marry? to teach you about Jesus Christ and how to follow Him? Consider listing students’ responses to the following question on the board under the word Trust . What qualities would someone need for you to trust them? Read Proverbs 3:5 , pondering what it means to you. Then answer the following questions in your study journal: Who do you trust more: the Lord or yourself? Why? What is a situation in your life right now where you feel you need to trust the Lord more than yourself? As you study the scriptures today, look for what you learn from the Holy Ghost that helps you put your trust in the Lord. “Trust in the Lord … and lean not” Proverbs 3:5–6 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Proverbs 3:5–6 , looking for how you would complete the following statement: “If we …, then the Lord will …” Invite students to share their completed statements. Seek to validate what they share. One of the truths they might share is if we trust in the Lord with all our heart, then He will direct our paths . What do you think it means to trust in the Lord “with all [our] heart” ( verse 5 )? What do you think it means to trust in the Lord over our “own understanding” ( verse 5 )? To help students better understand this passage, invite two students to stand about three feet away from something sturdy, such as a wall. Invite one student to lean toward the wall and use it for support. Invite the other student to lean away from the wall as far as they can before losing their balance. How can these examples help us better understand Proverbs 3:5–6 ? Consider organizing students into small groups. Invite students to list on a piece of paper situations where Latter-day Saint teenagers might feel tempted to use their own judgment instead of trusting the Lord’s counsel. Examples could include choosing entertainment, deciding whom or when to date, using certain language, or making educational or future goals. After enough time, you could display the following questions. Students could use their lists to discuss the questions in their groups. What might make it hard for someone to trust the Lord over leaning to their own understanding? What advice would you give someone to help them overcome these obstacles? “He shall direct thy paths” To help students increase their desire to trust in the Lord, they could study some or all of the passages below. Students could stay in their groups, and each student could read a different passage. Read the following scripture passages, looking for why we would want to trust in the Lord instead of our own understanding: Isaiah 55:8–9 2 Nephi 4:34–35 2 Nephi 26:24 Jacob 4:10 Mosiah 4:9 When students have finished reading their passages, invite them to share what they found with their group. A few students could then share with the class. If you listed trustworthy qualities on the board at the beginning of the lesson, consider asking students how the Lord demonstrates any of these qualities. Students could add to the board any further qualities of the Lord that they think of or that they found in the passages above. Which of the Lord’s qualities help you trust Him—even when His counsel might go against your own understanding? To prepare students to answer the question below, consider showing the video “ Trust in the Lord ” (3:30), available at ChurchofJesusChrist.org . In this video, young people share why they choose to trust in the Lord. Consider sharing your answer to the question below in addition to what students share. 3:30 When have you or someone you know trusted in the Lord instead of your own understanding? How did He help or guide you? Putting my trust in the Lord To help students apply what they learned, consider inviting them to individually do the following. Reflect on what you wrote in your study journal at the beginning of the lesson. Seek guidance from the Lord to respond to the following questions in your journal: What did you learn today about the Lord that encourages you to trust Him? What is one way you can trust the Lord with the situation that you wrote about? How can you do this “with all [your] heart” ( Proverbs 3:5 )? It might be helpful to share your feelings about the Lord and the ways He has guided you as you have trusted in Him. Consider testifying of His ability and willingness to bless your students as they trust Him. Memorize You might want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Proverbs 3:5–6 is “Trust in the Lord with all thine heart; … and he shall direct thy paths.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n--- SCRIPTURE: Psalms 102 ---\n1. Hear my prayer, OLord, and let my cry come unto thee.\n2. Hidenot thy face from me in the daywhenI am in trouble; incline thine ear unto me: in the daywhenI call answer me speedily.\n3. For my days are consumed like smoke, and my bones are burned as an hearth.\n4. My heart is smitten, and withered like grass; so that I forget to eat my bread.\n5. By reason of the voice of my groaning my bones cleave to my skin.\n6. I am like apelicanof the wilderness: I am like an owl of the desert.\n7. I watch, and am as sparrow alone upon the house top.\n8. Mine enemies reproach me all the day;andthey that are mad against me are sworn against me.\n9. For I have eaten ashes like bread, and mingled my drink with weeping,\n10. Because of thine indignation and thy wrath: for thou hast lifted me up, and cast me down.\n11. My daysarelike ashadowthat declineth; and I am withered likegrass.\n12. But thou, OLord, shalt endure forever; and thy remembrance unto all generations.\n13. Thou shalt arise,andhavemercyuponZion: for the time to favour her, yea, the set time, is come.\n14. For thy servants take pleasure in her stones, and favour the dust thereof.\n15. So the heathen shall fear the name of theLord, and all the kings of the earth thy glory.\n16. When theLordshall build up Zion, he shallappearin his glory.\n17. He will regard theprayerof the destitute, and not despise their prayer.\n18. This shall bewrittenfor thegenerationto come: and the people which shall be created shall praise theLord.\n19. For he hath looked down from the height of his sanctuary; from heaven did theLordbehold the earth;\n20. To hear the groaning of the prisoner; to loose those that are appointed to death;\n21. To declare the name of theLordin Zion, and his praise in Jerusalem;\n22. When the people are gathered together, and the kingdoms, to serve theLord.\n23. He weakened my strength in the way; he shortened my days.\n24. I said, O my God, take me not away in the midst of my days: thy yearsarethroughout all generations.\n25. Of old hast thou laid the foundation of theearth: and the heavensarethe work of thy hands.\n26. They shallperish, but thou shalt endure: yea, all of them shall wax old like garment; as vesture shalt thou change them, and they shall be changed:\n27. But thouartthesame, and thy years shall have noend.\n28. The children of thy servants shall continue, and theirseedshall be established before thee.\n\n--- SCRIPTURE: Psalms 103 ---\n1. Bless theLord, O my soul: and all that is within me,blesshis holy name.\n2. Bless theLord, O my soul, and forget not all his benefits:\n3. Whoforgivethall thine iniquities; who healeth all thydiseases;\n4. Whoredeemeththy life from destruction; who crowneth thee with lovingkindness and tender mercies;\n5. Who satisfieth thy mouth with goodthings; so thatthy youth is renewed like theeagles.\n6. TheLordexecuteth righteousness and judgment for all that are oppressed.\n7. He made known his ways unto Moses, his acts unto the children of Israel.\n8. TheLordismercifuland gracious, slow toanger, and plenteous in mercy.\n9. He will not always chide: neither will he keephisangerfor ever.\n10. He hath not dealt with us after our sins; nor rewarded us according to our iniquities.\n11. For as the heaven is high above the earth,sogreat is his mercy toward them that fear him.\n12. As far as the east is from the west,sofar hath he removed our transgressions from us.\n13. Like as fatherpitiethhischildren,sotheLordpitieth them that fear him.\n14. For he knoweth our frame; he remembereth that wearedust.\n15. As forman, his daysareas grass: as flower of the field, so he flourisheth.\n16. For the wind passeth over it, and it is gone; and the place thereof shall know it no more.\n17. But themercyof theLordisfrom everlasting to everlasting upon them that fear him, and his righteousness unto childrens children;\n18. To such as keep his covenant, and to those that remember his commandments to do them.\n19. TheLordhath prepared his throne in the heavens; and his kingdom ruleth over all.\n20. Bless theLord, ye his angels, that excel in strength, that do his commandments, hearkening unto the voice of his word.\n21. Bless ye theLord, allyehis hosts;yeministers of his, that do hispleasure.\n22. Bless theLord, all his works in all places of his dominion: bless theLord, O my soul.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";110;116–119;127–128;135–139;146–150",
      "content": "The traditional Jewish name for the book of Psalms is\nTehillim\n, a Hebrew word that means “praises.” It’s related to the exclamation\nhallelujah\n(meaning “praise Jehovah” or “praise the Lord”). If you had to choose one word to sum up the main message of the Psalms,\npraise\nwould be a good choice. Some psalms contain the direct invitation to “praise ye the Lord” (see especially\nPsalms 146–50\n), and all of them can inspire worship and praise. The Psalms invite us to acknowledge the Lord’s power, His mercy, and the great things He has done. We can never repay Him for any of this, but we can praise Him. That praise might take different forms for different people—it might involve singing, praying, or bearing testimony. It often leads to a deeper commitment to the Lord and to following His teachings. Whatever “praise ye the Lord” means in your life, you can find inspiration to do it as you read and ponder the Psalms.\nIdeas for Learning at Home and at Church\nPsalms 102–3\n;\n116\nThe Lord can comfort me in my suffering.\nNote how\nPsalm 102:1–11\ndescribes feelings of anxiety and isolation that often come during challenges. Maybe you or others you know have experienced such feelings. As you read\nPsalms 102:12–28\n;\n103\n;\n116\n, look for phrases that give you confidence to “call upon the name of the Lord” in your trials (\nPsalm 116:13\n). You might want to mark, memorize, or share with others phrases that give you hope in Him.\nSee also\nIsaiah 25:8\n;\nHebrews 2:17–18\n;\nAlma 7:11–13\n; Camille N. Johnson, “\nChrist Is Relief\n,”\nLiahona\n, May 2023, 81–83; “\nWhere Can I Turn for Peace?\n” (\nHymns\n, no. 129).\nCarl Heinrich Bloch (1834-1890),\nChrist Healing the Sick at Bethesda\n, 1883, oil on canvas, 100 3/4 × 125 1/2 inches. Brigham Young University Museum of Art, purchased with funds provided by Jack R. and Mary Lois Wheatley, 2001.\nPsalms 110\n;\n118\nJesus Christ fulfilled prophecies from the Psalms.\nThe Psalms contain passages that point toward the life and ministry of Jesus Christ. Here are a few examples:\nPsalm 110:1–4\n(see\nMatthew 22:41–45\n;\nHebrews 5:4–10\n;\n6:20\n)\nPsalm 118:22\n(see\nMatthew 21:42\n;\nActs 4:10–11\n;\n1 Peter 2:7\n)\nPsalm 118:25–26\n(see\nMatthew 21:9\n)\nWhat do these verses teach you about Jesus Christ? Why is it important to know this about Him?\nPsalm 119\nGod’s word will keep me on His path.\nPsalm 119\ncontains many phrases that compare our lives to a journey back to Heavenly Father. As you read, look for words like “walk,” “path,” “way,” “feet,” and “wander.” Ponder your own life’s journey—where you have been, where you are now, and where you are heading. What do you learn from this psalm about your journey back home? What have you learned by watching the paths of others? According to this psalm, what has God provided to help you stay on His path?\nThink about a time when following a path or a map helped you travel somewhere successfully. What does that experience teach you about following God’s path?\nIn many other scriptures, the Lord and His prophets speak of a path. Below are some examples. Consider searching these verses and writing down or sharing with others what you learn.\nScripture\nWhat I learn about the path to God\nScripture\nProverbs 4:11–19\nScripture\nMatthew 7:13–14\nScripture\n1 Nephi 8:20–28\nScripture\n2 Nephi 31:17–21\nScripture\nAlma 7:9, 19–20\nScripture\nDoctrine and Covenants 25:2\nHow can these truths help you stay on God’s path?\nWhat additional insights can you learn from the following counsel from President Russell M. Nelson?\n“If our journey through life is to be successful, we need to follow divine direction. The Lord said, ‘Look unto me in every thought; doubt not, fear not’ [\nDoctrine and Covenants 6:36\n]. And the Psalmist wrote, ‘Thy word is a lamp unto my feet, and a light unto my path’ [\nPsalm 119:105\n]. …\n“In your journey through life, you meet many obstacles and make some mistakes. Scriptural guidance helps you to recognize error and make the necessary correction. You stop going in the wrong direction. You carefully study the scriptural road map. Then you proceed with repentance and restitution required to get on the ‘strait and narrow path which leads to eternal life’ [\n2 Nephi 31:18\n]” (“\nLiving by Scriptural Guidance\n,”\nEnsign\n, Nov. 2000, 17).\nSee also Dieter F. Uchtdorf, “\nThe Prodigal and the Road That Leads Home\n,”\nLiahona\n, Nov. 2023, 86–88.\nPsalms 134–36\nThe Lord is more powerful than any idol.\nNotice why, according to\nPsalm 135:15–18\n, it is foolish to trust in false gods. What might you be tempted to trust in that is similar to an idol? You might make a list of the things the Lord can do, as the psalmists did in\nPsalms 134–36\n. What powerful things has He done for you?\nPsalm 139\nThe Lord knows my heart.\nWhat do you find in\nPsalm 139\nthat helps you understand that the Lord is aware of you—your thoughts and actions, strengths and weaknesses? How does this truth influence your life and your choices?\nPsalms 146–50\n“Praise ye the Lord.”\nAs you read these final psalms of praise, think about reasons you have to praise the Lord. Why is it important to praise Him? What are some ways you can praise Him?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nPsalm 102:1–2\nThe Lord comforts me and gives me hope.\nYou or one of your children could read\nPsalm 102:1–2\n, looking for how the Lord helps us during our difficulties. How can we find His help? You could also share with each other times when you needed help and felt that God heard your prayers.\nPsalm 119:105\nGod’s word is like a light.\nYour children might have fun talking about what it feels like to be in the dark. Or they could discuss things that are hard to do in the dark. You might invite them to do something with their eyes closed, such as draw a picture. What do we learn from\nPsalm 119:105\nabout light and the word of God?\nLook for something Heavenly Father has given us to help us stay on His path in the following verses:\nPsalms 119:47–48\n;\n119:105\n;\n1 Nephi 11:25\n;\n2 Nephi 31:20\n. What can we do to stay on God’s path?\nYour children might enjoy looking at pictures of the things mentioned in\nPsalm 119:105\n. They could place the pictures in order as they read the verse. You could also sing a related song together, such as “\nTeach Me to Walk in the Light\n” (\nChildren’s Songbook\n, 177) or “\nI Will Walk with Jesus\n” (Gospel Library).\nPsalm 139:1–3, 23–24\nHeavenly Father and Jesus Christ know me and love me.\nConsider making short lists of things you know about each of your children. As you read the lists one at a time, ask the children to guess who you are describing. Then, after reading\nPsalm 139:1–3\ntogether, you could list things that Heavenly Father and Jesus know about us.\nWrite the words of\nPsalm 139:23–24\non a piece of paper or a board. Invite your children to underline words that describe things God can do for us. Why would we want God to do these things?\nPsalm 146:1, 5–9\nI can praise the Lord.\nMaybe your children could share experiences when someone praised them or told them they did a good job. Share some of the good things from\nPsalm 146:6–9\nthat the Lord has done (help your children understand unfamiliar words). Invite your children to talk about other things He does for us. How can we praise Him for those things?\nLearn at home; share with others.\nPresident Russell M. Nelson has taught that the home should be the “center of gospel learning” (“\nBecoming Exemplary Latter-day Saints\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 13). What can you do this week to deepen your personal or family study of Psalms? After your study, consider sharing with others what you learned and felt. You could do this in conversation, through text or social media, or at church.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 36: Lesson 109: Lesson 109—Introduction to ProverbsWisdom, example, advice, knowledge; Lesson 110: Lesson 110—Proverbs 3This lesson can help students choose to put their trust in God.",
      "content": "\n--- Lesson 109 ---\nHow has wise counsel from trusted loved ones blessed your life? Studying the book of Proverbs can be like seeking wisdom from a caring friend, family member, and the Lord. Applying His wisdom in our lives can keep us on the strait and narrow covenant path. This lesson can help students identify truths that can help them follow the Lord’s path. Student preparation: Invite students to select a piece of valuable advice or helpful words of counsel they have received from parents, leaders, and trusted friends. Invite students to prepare to share the advice and how it has blessed their lives. Possible Learning Activities Trusted advice Consider beginning class by providing small pieces of paper for students. Ask them to write down a valuable piece of advice or counsel they have been given. After collecting the papers, you could read a few of the responses. Invite the student who wrote the response to share how that advice has helped them. Students could pass the remaining papers around the room, the reading the advice of other classmates. Then invite students to discuss the following questions. What makes someone’s advice meaningful to you? How do you determine whose advice you can trust? After students have shared their responses, you might invite them to prayerfully ponder the next questions. How frequently do you follow the wise counsel of others? How frequently do you seek and follow the counsel of the Lord? The wisdom of Proverbs The book of Proverbs is a collection of poetic wisdom written to the Israelites. Some passages in Proverbs are attributed to King Solomon (see Proverbs 1:1 ; 10:1 ; 25:1 ; see also 1 Kings 4:32 ), while other authors are unknown. As you study Proverbs, pay attention to how the Holy Ghost testifies of truth as you identify direction the Lord would like you to apply to your life. You could remind students that Proverbs (like Job and Ecclesiastes) uses elements of Hebrew poetry that can be challenging to readers. If needed, share that although many Proverbs are deeply spiritual, some are simply worldly advice. Read Proverbs 1:1–7 , looking for some of the purposes of the proverbs. Invite students to share what they found. If useful, you could ask why wisdom is important to learn today. Consider explaining that “the fear of the Lord” ( verse 7 ) refers to feeling and showing reverence and respect toward Him. Students might want to write this explanation in their scriptures. Why do you think reverencing or respecting the Lord might be “the beginning of knowledge”? ( verse 7 ). Read Proverbs 2:6–9 , looking for the source of true wisdom. ( Note: a buckler is a portable shield.) Consider linking or cross-referencing these verses with Mosiah 4:9 . How would you summarize what you learned as a statement of truth? Help students identify a truth such as the Lord gives us wisdom to help us follow His path . You could invite students to write this truth in their notes, scriptures, or study journals while you write it on the board. Students could share examples of times when the Lord’s wisdom helped them. They could discuss how His wisdom might be different from the wisdom of the world. Students might mention things like paying tithing leads to the Lord’s blessings ( Malachi 3:10 ) or following the Savior’s law of health brings us physical and spiritual blessings ( Doctrine and Covenants 89:18–21 ). How has following the Lord’s wise counsel helped you stay on His path? What are some examples of when the Savior sought wisdom from His Father rather than from other sources? If students need additional help thinking of moments when the Savior followed His Father’s wisdom, you could share examples like Matthew 14:23 ; 26:36–39 . Students can have an edifying learning experience as they think about how Jesus Christ was an example of the truths they identify. (For additional training on helping students see that the Savior is an example of a principle , see “ Emphasize the Example of Jesus Christ ” in Teacher Development Skills.) The Lord’s wisdom can help us follow His example Help students identify truths that invite them to follow the Savior and be more like Him. To do so, you could provide some or all of the following references from Proverbs. You might write the references you select on strips of paper. You could give one paper to each student. Invite them to read the reference and do the two steps below. Then students could pass their papers to another student and repeat the two steps. Repeat the rotation until students have studied several passages. Note: Lesson 110: “ Proverbs 3 ” will focus on the truths found in that chapter. Study one or more of the following passages from Proverbs, and do the following: Write what you learn as a statement of truth. Write a brief description of how this wisdom could help someone follow the example of Jesus Christ or become more like Him. Proverbs 1:8 Proverbs 4:14–15 Proverbs 4:26 Proverbs 6:23 Proverbs 11:17 Proverbs 15:1 Proverbs 16:16 Proverbs 16:18–19 Proverbs 17:22 Proverbs 23:17 Proverbs 28:13 Proverbs 29:18 Proverbs 30:5 The following activity can help students explain what they learned from their study of Proverbs. Students could do this activity individually, or you could organize them into groups. You could provide paper and art supplies to create a poster, or students could create something on their phones. To assist students, display the following instructions. Open PDF Imagine you were asked to create a visual that uses one of the Proverb passages to help teenagers become more like the Savior. Select a Proverb and create a poster like one you might find in the For the Strength of Youth magazine. Your visual could contain the following: A simple illustration—something creative and that could grab a teenager’s attention The Proverbs reference and the truth it teaches An explanation of how the verse from Proverbs could help a teenager follow the Savior’s example or become more like Him Share the wisdom of Proverbs Provide students an opportunity to share or display their visual. If students did this activity as groups, they could select someone to present their visual to the class. You could display the posters around the room, and students could review their classmates’ work. To conclude class, you might invite students to discuss the following questions or respond in their study journals. Pause and reflect on impressions you might have had throughout the lesson today. Then answer the following questions in your study journal: How have the truths you studied today affected your desire to follow the Lord? What have you felt impressed to do to become more like the Savior?\n\n\n--- Lesson 110 ---\nSometimes it can be hard to trust in the Lord. But as we come to know Him, we realize that “He doeth not anything save it be for the benefit of the world” ( 2 Nephi 26:24 ). We then can see the wisdom in trusting in Him instead of leaning “unto [our] own understanding” ( Proverbs 3:5 ). This lesson can help students choose to put their trust in the Lord. Student preparation: Invite students to consider marking in their scriptures the key scripture phrase for the doctrinal mastery passage Proverbs 3:5–6 : “Trust in the Lord with all thine heart … and he shall direct thy paths.” To prepare for class, students could practice reciting the phrase several times and ponder situations in their lives in which they will need to trust in the Lord. Possible Learning Activities Trust Consider beginning class by writing the word Trust on the board. Then ask the following question while displaying the accompanying situations one at a time. Consider adapting the situations to the needs of your students. Whom would you be willing to trust … to give you a ride home late at night? with your family’s money? to give you advice on whom you should date or marry? to teach you about Jesus Christ and how to follow Him? Consider listing students’ responses to the following question on the board under the word Trust . What qualities would someone need for you to trust them? Read Proverbs 3:5 , pondering what it means to you. Then answer the following questions in your study journal: Who do you trust more: the Lord or yourself? Why? What is a situation in your life right now where you feel you need to trust the Lord more than yourself? As you study the scriptures today, look for what you learn from the Holy Ghost that helps you put your trust in the Lord. “Trust in the Lord … and lean not” Proverbs 3:5–6 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Proverbs 3:5–6 , looking for how you would complete the following statement: “If we …, then the Lord will …” Invite students to share their completed statements. Seek to validate what they share. One of the truths they might share is if we trust in the Lord with all our heart, then He will direct our paths . What do you think it means to trust in the Lord “with all [our] heart” ( verse 5 )? What do you think it means to trust in the Lord over our “own understanding” ( verse 5 )? To help students better understand this passage, invite two students to stand about three feet away from something sturdy, such as a wall. Invite one student to lean toward the wall and use it for support. Invite the other student to lean away from the wall as far as they can before losing their balance. How can these examples help us better understand Proverbs 3:5–6 ? Consider organizing students into small groups. Invite students to list on a piece of paper situations where Latter-day Saint teenagers might feel tempted to use their own judgment instead of trusting the Lord’s counsel. Examples could include choosing entertainment, deciding whom or when to date, using certain language, or making educational or future goals. After enough time, you could display the following questions. Students could use their lists to discuss the questions in their groups. What might make it hard for someone to trust the Lord over leaning to their own understanding? What advice would you give someone to help them overcome these obstacles? “He shall direct thy paths” To help students increase their desire to trust in the Lord, they could study some or all of the passages below. Students could stay in their groups, and each student could read a different passage. Read the following scripture passages, looking for why we would want to trust in the Lord instead of our own understanding: Isaiah 55:8–9 2 Nephi 4:34–35 2 Nephi 26:24 Jacob 4:10 Mosiah 4:9 When students have finished reading their passages, invite them to share what they found with their group. A few students could then share with the class. If you listed trustworthy qualities on the board at the beginning of the lesson, consider asking students how the Lord demonstrates any of these qualities. Students could add to the board any further qualities of the Lord that they think of or that they found in the passages above. Which of the Lord’s qualities help you trust Him—even when His counsel might go against your own understanding? To prepare students to answer the question below, consider showing the video “ Trust in the Lord ” (3:30), available at ChurchofJesusChrist.org . In this video, young people share why they choose to trust in the Lord. Consider sharing your answer to the question below in addition to what students share. 3:30 When have you or someone you know trusted in the Lord instead of your own understanding? How did He help or guide you? Putting my trust in the Lord To help students apply what they learned, consider inviting them to individually do the following. Reflect on what you wrote in your study journal at the beginning of the lesson. Seek guidance from the Lord to respond to the following questions in your journal: What did you learn today about the Lord that encourages you to trust Him? What is one way you can trust the Lord with the situation that you wrote about? How can you do this “with all [your] heart” ( Proverbs 3:5 )? It might be helpful to share your feelings about the Lord and the ways He has guided you as you have trusted in Him. Consider testifying of His ability and willingness to bless your students as they trust Him. Memorize You might want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Proverbs 3:5–6 is “Trust in the Lord with all thine heart; … and he shall direct thy paths.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Psalms 102",
      "content": "1. Hear my prayer, OLord, and let my cry come unto thee.\n2. Hidenot thy face from me in the daywhenI am in trouble; incline thine ear unto me: in the daywhenI call answer me speedily.\n3. For my days are consumed like smoke, and my bones are burned as an hearth.\n4. My heart is smitten, and withered like grass; so that I forget to eat my bread.\n5. By reason of the voice of my groaning my bones cleave to my skin.\n6. I am like apelicanof the wilderness: I am like an owl of the desert.\n7. I watch, and am as sparrow alone upon the house top.\n8. Mine enemies reproach me all the day;andthey that are mad against me are sworn against me.\n9. For I have eaten ashes like bread, and mingled my drink with weeping,\n10. Because of thine indignation and thy wrath: for thou hast lifted me up, and cast me down.\n11. My daysarelike ashadowthat declineth; and I am withered likegrass.\n12. But thou, OLord, shalt endure forever; and thy remembrance unto all generations.\n13. Thou shalt arise,andhavemercyuponZion: for the time to favour her, yea, the set time, is come.\n14. For thy servants take pleasure in her stones, and favour the dust thereof.\n15. So the heathen shall fear the name of theLord, and all the kings of the earth thy glory.\n16. When theLordshall build up Zion, he shallappearin his glory.\n17. He will regard theprayerof the destitute, and not despise their prayer.\n18. This shall bewrittenfor thegenerationto come: and the people which shall be created shall praise theLord.\n19. For he hath looked down from the height of his sanctuary; from heaven did theLordbehold the earth;\n20. To hear the groaning of the prisoner; to loose those that are appointed to death;\n21. To declare the name of theLordin Zion, and his praise in Jerusalem;\n22. When the people are gathered together, and the kingdoms, to serve theLord.\n23. He weakened my strength in the way; he shortened my days.\n24. I said, O my God, take me not away in the midst of my days: thy yearsarethroughout all generations.\n25. Of old hast thou laid the foundation of theearth: and the heavensarethe work of thy hands.\n26. They shallperish, but thou shalt endure: yea, all of them shall wax old like garment; as vesture shalt thou change them, and they shall be changed:\n27. But thouartthesame, and thy years shall have noend.\n28. The children of thy servants shall continue, and theirseedshall be established before thee.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Psalms 103",
      "content": "1. Bless theLord, O my soul: and all that is within me,blesshis holy name.\n2. Bless theLord, O my soul, and forget not all his benefits:\n3. Whoforgivethall thine iniquities; who healeth all thydiseases;\n4. Whoredeemeththy life from destruction; who crowneth thee with lovingkindness and tender mercies;\n5. Who satisfieth thy mouth with goodthings; so thatthy youth is renewed like theeagles.\n6. TheLordexecuteth righteousness and judgment for all that are oppressed.\n7. He made known his ways unto Moses, his acts unto the children of Israel.\n8. TheLordismercifuland gracious, slow toanger, and plenteous in mercy.\n9. He will not always chide: neither will he keephisangerfor ever.\n10. He hath not dealt with us after our sins; nor rewarded us according to our iniquities.\n11. For as the heaven is high above the earth,sogreat is his mercy toward them that fear him.\n12. As far as the east is from the west,sofar hath he removed our transgressions from us.\n13. Like as fatherpitiethhischildren,sotheLordpitieth them that fear him.\n14. For he knoweth our frame; he remembereth that wearedust.\n15. As forman, his daysareas grass: as flower of the field, so he flourisheth.\n16. For the wind passeth over it, and it is gone; and the place thereof shall know it no more.\n17. But themercyof theLordisfrom everlasting to everlasting upon them that fear him, and his righteousness unto childrens children;\n18. To such as keep his covenant, and to those that remember his commandments to do them.\n19. TheLordhath prepared his throne in the heavens; and his kingdom ruleth over all.\n20. Bless theLord, ye his angels, that excel in strength, that do his commandments, hearkening unto the voice of his word.\n21. Bless ye theLord, allyehis hosts;yeministers of his, that do hispleasure.\n22. Bless theLord, all his works in all places of his dominion: bless theLord, O my soul.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Psalms": {
      "102": {
        "verses": {
          "1": {
            "text": "Hear my prayer, OLord, and let my cry come unto thee.",
            "citation": "(Psalms 102:1)"
          },
          "2": {
            "text": "Hidenot thy face from me in the daywhenI am in trouble; incline thine ear unto me: in the daywhenI call answer me speedily.",
            "citation": "(Psalms 102:2)"
          },
          "3": {
            "text": "For my days are consumed like smoke, and my bones are burned as an hearth.",
            "citation": "(Psalms 102:3)"
          },
          "4": {
            "text": "My heart is smitten, and withered like grass; so that I forget to eat my bread.",
            "citation": "(Psalms 102:4)"
          },
          "5": {
            "text": "By reason of the voice of my groaning my bones cleave to my skin.",
            "citation": "(Psalms 102:5)"
          },
          "6": {
            "text": "I am like apelicanof the wilderness: I am like an owl of the desert.",
            "citation": "(Psalms 102:6)"
          },
          "7": {
            "text": "I watch, and am as sparrow alone upon the house top.",
            "citation": "(Psalms 102:7)"
          },
          "8": {
            "text": "Mine enemies reproach me all the day;andthey that are mad against me are sworn against me.",
            "citation": "(Psalms 102:8)"
          },
          "9": {
            "text": "For I have eaten ashes like bread, and mingled my drink with weeping,",
            "citation": "(Psalms 102:9)"
          },
          "10": {
            "text": "Because of thine indignation and thy wrath: for thou hast lifted me up, and cast me down.",
            "citation": "(Psalms 102:10)"
          },
          "11": {
            "text": "My daysarelike ashadowthat declineth; and I am withered likegrass.",
            "citation": "(Psalms 102:11)"
          },
          "12": {
            "text": "But thou, OLord, shalt endure forever; and thy remembrance unto all generations.",
            "citation": "(Psalms 102:12)"
          },
          "13": {
            "text": "Thou shalt arise,andhavemercyuponZion: for the time to favour her, yea, the set time, is come.",
            "citation": "(Psalms 102:13)"
          },
          "14": {
            "text": "For thy servants take pleasure in her stones, and favour the dust thereof.",
            "citation": "(Psalms 102:14)"
          },
          "15": {
            "text": "So the heathen shall fear the name of theLord, and all the kings of the earth thy glory.",
            "citation": "(Psalms 102:15)"
          },
          "16": {
            "text": "When theLordshall build up Zion, he shallappearin his glory.",
            "citation": "(Psalms 102:16)"
          },
          "17": {
            "text": "He will regard theprayerof the destitute, and not despise their prayer.",
            "citation": "(Psalms 102:17)"
          },
          "18": {
            "text": "This shall bewrittenfor thegenerationto come: and the people which shall be created shall praise theLord.",
            "citation": "(Psalms 102:18)"
          },
          "19": {
            "text": "For he hath looked down from the height of his sanctuary; from heaven did theLordbehold the earth;",
            "citation": "(Psalms 102:19)"
          },
          "20": {
            "text": "To hear the groaning of the prisoner; to loose those that are appointed to death;",
            "citation": "(Psalms 102:20)"
          },
          "21": {
            "text": "To declare the name of theLordin Zion, and his praise in Jerusalem;",
            "citation": "(Psalms 102:21)"
          },
          "22": {
            "text": "When the people are gathered together, and the kingdoms, to serve theLord.",
            "citation": "(Psalms 102:22)"
          },
          "23": {
            "text": "He weakened my strength in the way; he shortened my days.",
            "citation": "(Psalms 102:23)"
          },
          "24": {
            "text": "I said, O my God, take me not away in the midst of my days: thy yearsarethroughout all generations.",
            "citation": "(Psalms 102:24)"
          },
          "25": {
            "text": "Of old hast thou laid the foundation of theearth: and the heavensarethe work of thy hands.",
            "citation": "(Psalms 102:25)"
          },
          "26": {
            "text": "They shallperish, but thou shalt endure: yea, all of them shall wax old like garment; as vesture shalt thou change them, and they shall be changed:",
            "citation": "(Psalms 102:26)"
          },
          "27": {
            "text": "But thouartthesame, and thy years shall have noend.",
            "citation": "(Psalms 102:27)"
          },
          "28": {
            "text": "The children of thy servants shall continue, and theirseedshall be established before thee.",
            "citation": "(Psalms 102:28)"
          }
        }
      },
      "103": {
        "verses": {
          "1": {
            "text": "Bless theLord, O my soul: and all that is within me,blesshis holy name.",
            "citation": "(Psalms 103:1)"
          },
          "2": {
            "text": "Bless theLord, O my soul, and forget not all his benefits:",
            "citation": "(Psalms 103:2)"
          },
          "3": {
            "text": "Whoforgivethall thine iniquities; who healeth all thydiseases;",
            "citation": "(Psalms 103:3)"
          },
          "4": {
            "text": "Whoredeemeththy life from destruction; who crowneth thee with lovingkindness and tender mercies;",
            "citation": "(Psalms 103:4)"
          },
          "5": {
            "text": "Who satisfieth thy mouth with goodthings; so thatthy youth is renewed like theeagles.",
            "citation": "(Psalms 103:5)"
          },
          "6": {
            "text": "TheLordexecuteth righteousness and judgment for all that are oppressed.",
            "citation": "(Psalms 103:6)"
          },
          "7": {
            "text": "He made known his ways unto Moses, his acts unto the children of Israel.",
            "citation": "(Psalms 103:7)"
          },
          "8": {
            "text": "TheLordismercifuland gracious, slow toanger, and plenteous in mercy.",
            "citation": "(Psalms 103:8)"
          },
          "9": {
            "text": "He will not always chide: neither will he keephisangerfor ever.",
            "citation": "(Psalms 103:9)"
          },
          "10": {
            "text": "He hath not dealt with us after our sins; nor rewarded us according to our iniquities.",
            "citation": "(Psalms 103:10)"
          },
          "11": {
            "text": "For as the heaven is high above the earth,sogreat is his mercy toward them that fear him.",
            "citation": "(Psalms 103:11)"
          },
          "12": {
            "text": "As far as the east is from the west,sofar hath he removed our transgressions from us.",
            "citation": "(Psalms 103:12)"
          },
          "13": {
            "text": "Like as fatherpitiethhischildren,sotheLordpitieth them that fear him.",
            "citation": "(Psalms 103:13)"
          },
          "14": {
            "text": "For he knoweth our frame; he remembereth that wearedust.",
            "citation": "(Psalms 103:14)"
          },
          "15": {
            "text": "As forman, his daysareas grass: as flower of the field, so he flourisheth.",
            "citation": "(Psalms 103:15)"
          },
          "16": {
            "text": "For the wind passeth over it, and it is gone; and the place thereof shall know it no more.",
            "citation": "(Psalms 103:16)"
          },
          "17": {
            "text": "But themercyof theLordisfrom everlasting to everlasting upon them that fear him, and his righteousness unto childrens children;",
            "citation": "(Psalms 103:17)"
          },
          "18": {
            "text": "To such as keep his covenant, and to those that remember his commandments to do them.",
            "citation": "(Psalms 103:18)"
          },
          "19": {
            "text": "TheLordhath prepared his throne in the heavens; and his kingdom ruleth over all.",
            "citation": "(Psalms 103:19)"
          },
          "20": {
            "text": "Bless theLord, ye his angels, that excel in strength, that do his commandments, hearkening unto the voice of his word.",
            "citation": "(Psalms 103:20)"
          },
          "21": {
            "text": "Bless ye theLord, allyehis hosts;yeministers of his, that do hispleasure.",
            "citation": "(Psalms 103:21)"
          },
          "22": {
            "text": "Bless theLord, all his works in all places of his dominion: bless theLord, O my soul.",
            "citation": "(Psalms 103:22)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 25061,
  "total_sources": 4,
  "generated_at": "2025-12-14T04:01:27.390590"
}