{
  "week_number": 6,
  "date_range": "",
  "title": "Moses 7",
  "primary_scriptures": [
    {
      "book": "Moses",
      "chapters": [
        "7"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    }
  ],
  "all_content": "\n\n--- CFM: Moses 7 ---\nThroughout history, people have tried to achieve what Enoch and his people accomplished: building an ideal society where there is no poverty or violence. As God’s people, we share this desire. We call it building Zion, and it includes—in addition to caring for people in need and promoting peace—making covenants, dwelling together in righteousness, and becoming one with each other and with Jesus Christ, “the King of Zion” (\nMoses 7:53\n). If the world, your community, or your family isn’t quite what you want it to be, it’s helpful to ask, How did Enoch and his people do it? How did they become “of one heart and one mind” (\nMoses 7:18\n) despite the contention around them? Among the many details\nMoses 7\ngives us about Zion, a particularly valuable one for Latter-day Saints might be this: Zion is not just a city—it is a condition of the heart and spirit. Zion, as the Lord has taught, is “the pure in heart” (\nDoctrine and Covenants 97:21\n). So perhaps the best way to build Zion is to start in our own hearts and homes.\nIdeas for Learning and Home and at Church\nMoses 7:16–21, 27, 53, 62–69\nI can help build Zion.\nWhen the Prophet Joseph Smith first learned about Enoch and his City of Holiness, he was inspired. He “knew the day had come when the Lord would again establish Zion on the earth” (\nSaints\n,\n1:108–9\n), and he started a lifelong quest to build Zion. Reading\nMoses 7\ncan inspire you to continue that effort today.\nYou might start by exploring the questions “What is Zion?” and “How is it different from the rest of the world?” Consider listing answers that come to you as you study\nMoses 7\n, in particular\nverses 16–21, 27, 53, 62–69\n.\nYour answers to these questions might make it clear that we still have a lot of work to do to build Zion. So how do we do it? It might help to think about times when you felt you were “of one heart and one mind” with someone (\nMoses 7:18\n). Maybe it was in a ward, family, or group at work or school. What did people do to create righteous unity?\nHere are some other resources that you could explore to find ideas and inspiration. Pick one or more to study, and then write down what you feel inspired to do to build Zion:\nPhilippians 2:1–4\n;\n4 Nephi 1:15–18\n;\nDoctrine and Covenants 97:21\n;\n105:5\n.\nUlisses Soares, “\nBrothers and Sisters in Christ\n,”\nLiahona\n, Nov. 2023, 70–73.\nD. Todd Christofferson, “\nOne in Christ\n,”\nLiahona\n, May 2023, 77–80.\n“We Come Together and Unite as One” (video), Gospel Library.\n6:21\nWe Come Together & Unite As One\nGod wants His people to be “of one heart and one mind” (\nMoses 7:18\n).\nMoses 7:53\nJesus Christ is “the King of Zion.”\nWhat does it mean to you to have Jesus Christ as your King? Note the other titles of Jesus Christ in this verse. What do they teach you about Him? What do you think it means to come “in at the gate and [climb] up by [Him]”?\nSee also “\nCome, O Thou King of Kings\n,”\nHymns\n, no. 59.\nMoses 7:28–69\nGod weeps—and rejoices—for His children.\nSome people see God as a distant being who isn’t emotionally affected by what happens to us. Enoch gained a different view of God in the vision recorded in\nMoses 7\n. What did he learn about God—and what do you learn—in\nverses 28–40\n? Why do you think Enoch was surprised to see God weep? Why is it important to you to know that He does?\nAs the vision continued, Enoch wept too. But God also shared with him reasons to rejoice. Look for them in\nMoses 7:41–69\n. What do you learn from Enoch’s vision that can help you “lift up your heart, and be glad,” despite the “bitterness” in your life (\nverse 44\n)?\nSee also Jeffrey R. Holland, “\nThe Grandeur of God\n,”\nEnsign\nor\nLiahona\n, Nov. 2003, 70–73.\nMoses 7:59–67\nJesus Christ will come again in the last days.\nEnoch’s vision, especially what’s recorded in\nMoses 7:59–67\n, is one of history’s first prophecies of the Savior’s Second Coming. What impresses you about the way these verses describe the last days? For example, consider how you feel the prophecies from\nverse 62\nare being fulfilled. What do these phrases teach you about God’s work in the latter days?\nSee also Henry B. Eyring, “\nSisters in Zion\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 67–69.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat does it mean that “seed of Cain were black”?\nWhat does it mean that the “Lamb is slain from the foundation of the world”?\nHow does the Joseph Smith Translation enhance our understanding of God’s covenant with Enoch and Noah?\nClick to see more.\nIdeas for Teaching Children\nMoses 7:18–21, 62–63, 68–69\nGod wants us to be “of one heart and one mind.”\nTo help your children learn about Enoch and Zion, you could use “\nEnoch the Prophet\n” in\nOld Testament Stories\n(19–21) or the second verse of “\nFollow the Prophet\n” (\nChildren’s Songbook\n, 110–11). Then you could ask your children to help you retell the story in their own words. The pictures of Enoch in this outline might help.\nHere’s one way to help your children understand what it means to be of “one heart and one mind” (\nMoses 7:18\n): Make a paper heart and cut it into pieces, enough for each child to have one. Let them write their name on their piece and work together to put the heart together. As they do, you might talk about things you love about each child.\nHelp your children count how many times the word “Zion” appears in\nMoses 7:18–21, 62–63, 68–69\n. Each time they find the word, help them discover what the verse says about Zion (see also Guide to the Scriptures, “\nZion\n,” Gospel Library). How can we be more like the people described in these verses?\nEncourage personal scripture study.\nWhether you’re teaching your family at home or a class on Sunday, one of the best ways you can help others build lasting faith in Jesus Christ is to help them establish a habit of seeking personal experiences with the scriptures. Share the experiences you’re having with the scriptures, and encourage family or class members to share their experiences. When we hear about how reading the scriptures is blessing others, we are often inspired to seek these same blessings from the Lord. (See\nTeaching in the Savior’s Way\n,\n25\n.)\nMoses 7:32–33\nHeavenly Father wants me to choose to follow Him.\nTo introduce\nMoses 7:32–33\nto your children, you might talk to them about a choice they had to make recently. Then you could read the verses together to find out what Heavenly Father wants us to choose. What choices can we make to show that we choose Him? Perhaps your children could take turns acting out one of these choices while the others guess what the action represents.\nMoses 7:59–67\nJesus will come back to earth.\nIn\nMoses 7:59\n, Enoch asks the Lord a question. Invite your children to find it, and then ask them to find the answer in\nverse 60\n. You might also talk with them about a time when they were expecting someone to return home. Ask them how they felt and what they did to get ready. How can we get ready for Jesus to return?\nConsider showing pictures of times when the Savior appeared to people (such as\nGospel Art Book\n,\nnos. 60\n,\n82\n,\n83\n, and\n84\n). What are the people doing in the pictures? How might the people have felt when they met Jesus? You could also sing a song about the Savior’s Second Coming, such as “\nWhen He Comes Again\n” (\nChildren’s Songbook\n, 82–83), and ask the children what they think it will be like when Jesus comes again. Let the children share how they feel about seeing Jesus when He comes again.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 6: Lesson 16: Lesson 16—Moses 7:1–21This lesson can help students develop the Christlike attributes that Enoch and his people had.; Lesson 17: Lesson 17—Moses 7:22–47This lesson can help students feel God’s mercy and love for all His children.... ---\n\n--- Lesson 16 ---\nGod called Enoch as a prophet to preach the message of the gospel. The people who chose to follow Enoch gathered together, and the Lord protected them from the wickedness around them. They eventually formed a joyful and holy city the Lord called “Zion” ( Moses 7:18 ). This lesson can help students develop the Christlike attributes that Enoch and his people had. Student preparation: Invite students to think about their previous day and the effect their actions might have had on other people. Possible Learning Activities Strength through interconnected roots Think of a way to begin the lesson by helping students recognize the strength that can come from unity with others. The following is one way you could do this. How tall do you think the tallest type of tree can grow? The tallest trees in the world are redwood trees. They can grow more than 300 feet (92 m) high. To support such a tall tree, what do you think the roots of a redwood are like? Surprisingly, the roots of redwoods are only about 3–6 feet (1–2 m) deep. However, these roots spread out several hundred feet (more than 100 m) and become intertwined with the roots of other trees. This interconnectedness enables redwoods to stand strong for hundreds of years amid winds and floods (see Richard H. Winkel, “ Web of Friendship ,” New Era , Aug. 2003, 10–11). What do you think we can learn from redwoods that could influence our families, schools, and wards or branches? Why do you think the Lord would want us to find strength with others around us as well as in Him? To help students assess how well-connected they feel to the people around them, invite the students to answer the following questions in their study journals: How do others help and support you, especially in your efforts to come closer to the Savior? (This could be in your family, ward or branch, friend groups, community, and so on.) How do you try to support others and help them feel closer to the Savior? As students study this lesson, invite them to be sensitive to impressions of the Holy Ghost. The Holy Ghost can teach them how they might increase the strength they feel with God and with the people around them. Strength in Zion In a vision, the Lord called the prophet Enoch to preach repentance and baptism to several cities. The people who followed Enoch gathered together. Read Moses 7:13, 16–17 , looking for the contrast between the people who were striving to follow the Lord and the people who fought against them. What impressed you about the blessings the Lord gave to the people who strove to follow Him? To better understand what distinguished the Lord’s people, read Moses 7:18–21 . (It may be helpful to point out that to be cursed means to have blessings withheld because of unrighteousness. See also “ Curse, Curses ” in Guide to the Scriptures.) Moses 7:18 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Help students understand what they studied. To do so, you could invite them to draw in their journals a simple representation of what they learned from verse 18 . Students could then share what they drew and why they drew it with partners, small groups, or the class. What do you learn about the Lord’s people from verse 18 ? What do you think it means to be “of one heart and one mind”? Help students identify a truth similar to the Lord’s people strive to be unified, live righteously, and care for the poor among them. You might point out that these are also characteristics of the Savior. Becoming the Lord’s people means becoming more like Him. Becoming the Lord’s people To help students better understand how to be unified, live righteously, and care for people in need, consider asking students to work through the following handout in small groups. They can strive to help and support each other throughout the activity. Below are two ways you might use the handout: Invite students to divide the sections of the handout between their group members and to study their section on their own. After completing their section, students could share what they learned. Tape copies of the sections of the handout on the walls and invite the small groups to move around the room completing each section together. Open PDF Invite multiple students to share what they learned or studied that was meaningful to them. You also might ask how working in groups increased students’ understanding. How did the Savior exemplify the characteristics of Zion during His life? To illustrate an example of the Christlike attributes of Zion, you might share the video “ Charity: An Example of the Believers ” (4:50), found on Gospel Library. Consider inviting students to look for how these young women exemplified Zion. 4:50 Make a plan Invite students to think about impressions they may have had during the lesson and to record answers to the following questions in their study journals: What is one Christlike attribute of Zion you feel you could improve in your life? (This could be at home, at church, or with others.) What is something you will begin to do this week to strengthen that Christlike attribute? (This could be a part of your goals for the Children and Youth program.) Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for “ Moses 7:18 ” is “The Lord called his people Zion, because they were of one heart and one mind.” Ideas for memorization activities are in the appendix under “Doctrinal Mastery Review Activities.”\n\n\n--- Lesson 17 ---\nWhen have you felt of God’s mercy in your life? The Lord showed Enoch a vision of the earth’s history from his own day to the Millennium. Enoch learned in a profound way about Heavenly Father’s personal love for His children. This lesson can help students feel God’s mercy and love for all His children. Student preparation: Invite students to think of experiences and scriptures that help them know what Heavenly Father is like. They could also ask parents or trusted leaders or friends to share experiences or scriptures with them. Invite students to come prepared to share. Possible Learning Activities Struggling to feel God’s mercy and love To prepare students to learn more about God and His character, read or display the following scenarios: Caleb wonders whether God only cares about people who are doing what’s right. Zoe worries God may be angry about the choices someone close to her is making. She worries He may want to punish them. Olivia doesn’t think she’s ever felt God’s love. Why might these people feel this way? Select one of these scenarios to ponder as you continue this lesson. To help students be receptive to the influence of the Holy Ghost throughout this lesson, encourage them to ponder the following questions: What do you know about Heavenly Father that could help you if you had similar concerns? What questions do you have about Heavenly Father? Seek help from the Lord to know and feel His love for you and for all His children. Enoch’s vision of those who were not taken into heaven Consider summarizing the following in your own words: Recall that through the help and guidance of the Lord, Enoch established the city of Zion. The people of Zion were unified in the Lord, lived in righteousness, and cared for one another (see Moses 7:16–19 ). In a vision, the Lord showed Enoch that He would take the people of Zion into heaven because of their faith and righteousness (see Moses 7:20–21 ). Enoch also “beheld the residue of the people” ( Moses 7:22 ), referring to those people who were left on the earth because they would not follow the Savior. Read Moses 7:23–26 , looking for what Enoch saw. What do you learn about Satan? Why do you think it is important to understand these things about Satan? Enoch sees how God reacts to wickedness Enoch then had a tender experience as he watched God look upon the people who had chosen not to obey Him. You may want to explain that Enoch saw Jehovah, or Jesus Christ. Ever since the Fall of Adam, Jehovah is who appears to and speaks with prophets. On these occasions, He often speaks as if He were the Father. The unity of the Father and Son is such that the Savior’s feelings also represent the Father. Therefore, what students will study of this vision between Enoch and Jehovah can also help them learn about Heavenly Father. As students read the following verses, you might encourage them to read slowly, pause to ponder what they read, and maybe read the verses more than once. Reading in this way can help students invite the Spirit to teach them more about their Heavenly Father. Read Moses 7:28–33 and mark words or phrases that help you know and understand Heavenly Father better. What do you learn about God from these verses? Consider writing “ God … ” on the board and ask students to finish this statement with what they learned. Encourage various responses. Some answers might include: loves us deeply ( verses 28–33 ). created the universe yet is available to us ( verse 30 ). is just, merciful, and kind ( verse 30 ). gave us agency ( verse 32 ). desires that we love one another ( verse 33 ). desires that we choose Him ( verse 33 ). As students share what they found, consider asking follow-up questions such as: Why is that truth about Heavenly Father meaningful to you? How can knowing that truth help the person in the situation you chose? How can it help you? Using Enoch’s experience, President Jeffrey R. Holland of the Quorum of the Twelve Apostles taught that the Savior shows us what Heavenly Father is like and how much He loves us. He shared the following insight about Heavenly Father: In the midst of a grand vision of humankind which heaven opened to his view, Enoch, observing both the blessings and challenges of mortality, turns his gaze toward the Father and is stunned to see Him weeping. He says in wonder and amazement to this most powerful Being in the universe: “How is it that thou canst weep?” … That single, riveting scene does more to teach the true nature of God than any theological treatise could ever convey. … What an indelible image of God’s engagement in our lives! What anguish in a parent when His children do not choose Him nor “the gospel of God” He sent! [ Romans 1:1 ]. How easy to love someone who so singularly loves us! … I bear personal witness this day of a personal, living God, who knows our names, hears and answers prayers, and cherishes us eternally as children of His spirit. (” The Grandeur of God ,” Ensign or Liahona , Nov. 2003, 72) Invite students to share what stood out to them from President Holland’s statement. Consider writing the following questions on the board. Invite students to discuss the questions in small groups. Also invite them to discuss how these ideas might apply to the scenarios they chose at the beginning of the lesson. As students answer, walk around the room and listen to some of their responses. Why do you think Heavenly Father weeps for us when we do not love one another? Why might He weep for us when we do not choose to follow and love Him? What are some lies that Satan would like us to believe about God’s feelings toward us? After students have discussed these questions, consider asking what they heard from another student that would be helpful to share with the whole class. This allows students to review answers while also complimenting each other for their responses. You may also point out helpful answers you heard. Enoch sees the life and mission of the Savior The Lord then showed Enoch that the people left on the earth who would not repent would perish in a flood (see Moses 7:34–44 ). In response, Enoch wept. The Lord then comforted Enoch, saying, “Lift up your heart, and be glad; and look” ( Moses 7:44 ). Read Moses 7:44–47 , looking for what the Lord showed Enoch to comfort him. It may be helpful to know that “the Righteous” ( verses 45 and 47 ) is a title for Jesus Christ. Why do you think seeing these things would cause Enoch’s soul to rejoice? ( verse 47 ). How does sending Jesus Christ show the Father’s mercy and love? If helpful, you can discuss how the Savior will help all of God’s children, even the people who were wicked and died in the Flood. Help students understand that although the wicked perished in the Flood and would have to suffer for their sins in the spirit world, they could still repent through the Savior (see Moses 7:38–39 ; 1 Peter 3:18–20 ). Feeling God’s love To conclude, invite students to seek help through the Holy Ghost as they do the following activity. Alternatively, students could write to someone in their lives who may need to feel Heavenly Father’s mercy and love. Write a letter to help the person in the scenario you chose at the beginning of the lesson. As part of your letter, include the following: What you learned from Moses 7 about Heavenly Father’s mercy and love. Include specific phrases or verses you feel would be especially meaningful. Other scriptures or experiences that have helped you feel God’s mercy and love. Additional ideas you think may help this person feel God’s love. Conclude by inviting students to share their thoughts, experiences, and feelings. Consider adding your own testimony of the Father’s love.\n\n\n--- Lesson 18 ---\nOne of the Savior’s titles is “the King of Zion” ( Moses 7:53 ). He watches over His people, and in the last days He will preserve them from the great tribulations that will occur. This lesson can help students recognize and appreciate what the Lord has done to help them overcome the trials of our time. Student preparation: Invite students to come prepared to share a passage from the Book of Mormon that has helped them when they have faced trials. Possible Learning Activities Great tribulations in the last days Invite students to imagine a large storm is coming to your city. If useful, you could display an image of a large storm. What are some of the great trials or difficulties of the last days? How could these trials and difficulties be compared to a storm? What are some ways to seek safety from these storms? Invite students to ponder their feelings about these storms and their efforts to find safety. The following self-assessment is one way you could do this: Ponder how true the following statements are of you: I know what the Lord has done to help me with the storms (trials and difficulties) that I face. I appreciate what the Lord has done and sincerely want His help. Invite students to seek inspiration from the Holy Ghost as they study. The Holy Ghost can teach about ways the Lord can help the students with the storms they face. The King of Zion Enoch and his people built “the City of Holiness, even Zion” ( Moses 7:19 ). The Lord promised they would “dwell in safety forever” ( Moses 7:20 ). Enoch then saw and wept over the destruction that would come during the Flood. Seeking comfort, Enoch asked if the Lord would have mercy on the people who came after the Flood. In response, the Lord taught about and showed Enoch the Savior and His Atonement (see Moses 7:42–57 ). Read Moses 7:53 , looking for how the Savior described Himself. How could the things the Lord shared in this verse comfort Enoch? Invite students to mark and discuss the various titles and roles of Jesus Christ in verse 53 . This lesson will focus on His title “King of Zion.” You might ask follow-up questions about this title such as: How is Jesus Christ like a powerful and loving king to us? What other phrases from this verse describe blessings you would want from following the King of Zion? Consider reminding students that Zion is made up of anyone who, like Enoch’s people, are “the pure in heart” ( Doctrine and Covenants 97:21 )—people who are like the Lord. The Lord will preserve His people Enoch asked the Lord if He would come again to the earth. The Lord showed Enoch the last days and the things He would do for the people who strive to follow Him. Read Moses 7:60–61 , looking for what the Lord promised to do. What do you think it means for the Lord to “preserve” the people that strive to follow Him? As students read Moses 7:62 as directed below, you may want to help them see how active God is in preserving His people. One way to do this is to invite students to pay attention to every use of the word I and to the verbs that follow it. You may also invite them to notice when the Lord uses my or mine and what words these are associated with. Though Enoch had seen in vision the devastating flood in the days of Noah, the Lord then showed Enoch ways He would gather people to Him and preserve them. Read Moses 7:62 , looking for what the Lord will do to preserve His people. What are some of the things the Lord will do to preserve His people? Write the following phrase on the board: To preserve His people in the last days, the Lord will … As students answer, write the following phrases on the board : send righteousness out of heaven. send truth out of the earth. gather His people to Zion (see also Doctrine and Covenants 115:6 ). What are some ways that the Lord is fulfilling this prophecy in our time? Righteousness out of heaven and truth out of the earth to gather us to Zion To help students understand the three different aspects of this truth, you might write “Righteousness out of heaven,” “Truth out of the earth,” and “Zion” each on the board in separate columns. The following are sentences and images connected to each aspect. Write each sentence on a separate sheet of paper or display the images. Students could then match the sentence or image to one of the headings on the board. Righteousness out of heaven Joseph Smith received the First Vision. John the Baptist gave the Aaronic Priesthood to Joseph Smith. Peter, James, and John gave the Melchizedek Priesthood to Joseph Smith. The Lord revealed the Doctrine and Covenants. The Lord reveals His word through modern-day prophets. Truth out of the earth Joseph Smith obtained and translated the gold plates. Zion We are all part of a ward or branch. Help students ponder the importance of what the Lord has done. One way you could do this is by inviting students to complete the following in their study journals. If you used the previous activity, students could select something from the list on the board. Identify two ways the Lord is preserving His people from the tribulations of our time and answer the following questions. If possible, think of a specific example. You might mention an experience with the priesthood, a passage from the Book of Mormon, an experience in your ward or branch, and so on. How has this example helped you come to know the Savior better? How has it or could it help with the difficulties of the last days? Invite several students to share their responses. Look for ways to help students recognize and appreciate all the Lord has done to help them with the trials and difficulties of the last days. One way you can do this is to listen carefully to what students say and state what it can teach us about the character and nature of the Lord. (For additional training on helping students know and feel the Lord’s love, see “ Help Learners Strengthen Their Relationship with Heavenly Father and Jesus Christ ” in Teacher Development Skills.)\n\n--- SCRIPTURE: Moses 7 ---\n1. And it came to pass that Enoch continued his speech, saying: Behold, our father Adam taught these things, and many have believed and become thesonsof God, and many have believed not, and have perished in their sins, and are looking forth withfear, in torment, for the fiery indignation of the wrath of God to be poured out upon them.\n2. And from that time forth Enoch began to prophesy, saying unto the people, that: As I was journeying, and stood upon the place Mahujah, and cried unto the Lord, there came voice out of heaven, sayingTurn ye, and get ye upon the mountSimeon.\n3. And it came to pass that I turned and went up on the mount; and as I stood upon the mount, I beheld the heavens open, and I was clothed upon withglory;\n4. And Isawthe Lord; and he stood before my face, and he talked with me, even as man talketh one with another,face to face; and hesaid unto me:Look, and I willshowunto thee the world for the space of many generations.\n5. And it came to pass that I beheld in the valley of Shum, and lo, great people which dwelt intents, which were the people of Shum.\n6. And again the Lord said unto me: Look; and I looked towards the north, and I beheld the people ofCanaan, which dwelt in tents.\n7. And the Lord said unto me: Prophesy; and I prophesied, saying: Behold the people of Canaan, which are numerous, shall go forth in battle array against the people of Shum, and shall slay them that they shall utterly be destroyed; and the people of Canaan shall divide themselves in the land, and the land shall be barren and unfruitful, and none other people shall dwell there but the people of Canaan;\n8. For behold, the Lord shallcursethe land with much heat, and thebarrennessthereof shall go forth forever; and there was ablacknesscame upon all the children of Canaan, that they were despised among all people.\n9. And it came to pass that the Lord said unto me: Look; and I looked, and I beheld the land of Sharon, and the land of Enoch, and the land of Omner, and the land of Heni, and the land of Shem, and the land of Haner, and the land of Hanannihah, and all the inhabitants thereof;\n10. And the Lord said unto me: Go to this people, and say unto themRepent, lest I come out and smite them with curse, and they die.\n11. And he gave unto me commandment that I shouldbaptizein the name of the Father, and of the Son, which is full ofgraceand truth, and of the Holy Ghost, which beareth record of the Father and the Son.\n12. And it came to pass that Enoch continued to call upon all the people, save it were the people of Canaan, to repent;\n13. And so great was thefaithof Enoch that he led the people of God, and their enemies came to battle against them; and hespakethe word of the Lord, and the earth trembled, and themountainsfled, even according to his command; and theriversof water were turned out of their course; and the roar of the lions was heard out of the wilderness; and all nations feared greatly, sopowerfulwas the word of Enoch, and so great was the power of the language which God had given him.\n14. There also cameupa land out of the depth of the sea, and so great was the fear of the enemies of the people of God, that they fled and stood afar off and went upon the land which came up out of the depth of the sea.\n15. And thegiantsof the land, also, stood afar off; and there went forth acurseupon all people that fought against God;\n16. And from that time forth there were wars and bloodshed among them; but the Lord came anddweltwith his people, and they dwelt in righteousness.\n17. Thefearof the Lord was upon all nations, so great was thegloryof the Lord, which was upon his people. And the Lord blessed theland, and they were blessed upon the mountains, and upon the high places, and did flourish.\n18. And the Lord called his peopleZion, because they were ofoneheart and one mind, and dwelt in righteousness; and there was no poor among them.\n19. And Enoch continued his preaching in righteousness unto the people of God. And it came to pass in his days, that he built city that was called the City of Holiness, evenZion.\n20. And it came to pass that Enoch talked with the Lord; and he said unto the Lord: SurelyZionshall dwell in safety forever. But the Lord said unto Enoch: Zion have I blessed, but theresidueof the people have I cursed.\n21. And it came to pass that the Lord showed unto Enoch all the inhabitants of the earth; and he beheld, and lo,Zion, in process of time, wastakenup into heaven. And the Lord said unto Enoch: Behold mine abode forever.\n22. And Enoch also beheld the residue of the people which were the sons of Adam; and they were mixture of all the seed of Adam save it was the seed of Cain, for the seed of Cain wereblack, and had not place among them.\n23. And after that Zion was taken up intoheaven, Enochbeheld, and lo,allthe nations of the earth were before him;\n24. And there came generation upon generation; and Enoch was high andlifted up, even in the bosom of the Father, and of the Son of Man; and behold, the power of Satan was upon all the face of the earth.\n25. And he saw angels descending out of heaven; and he heard loud voice saying: Wo, wo be unto the inhabitants of the earth.\n26. And he beheld Satan; and he had greatchainin his hand, and it veiled the whole face of the earth withdarkness; and he looked up andlaughed, and hisangelsrejoiced.\n27. And Enoch beheldangelsdescending out of heaven, bearingtestimonyof the Father and Son; and the Holy Ghost fell on many, and they were caught up by the powers of heaven into Zion.\n28. And it came to pass that the God of heaven looked upon theresidueof the people, and he wept; and Enoch bore record of it, saying: How is it that the heavens weep, and shed forth their tears as the rain upon the mountains?\n29. And Enoch said unto the Lord: How is it that thou canstweep, seeing thou art holy, and from all eternity to all eternity?\n30. And were it possible that man could number the particles of the earth, yea, millions ofearthslike this, it would not be beginning to the number of thycreations; and thy curtains are stretched out still; and yet thou art there, and thy bosom is there; and also thou art just; thou art merciful and kind forever;\n31. And thou hast takenZionto thine own bosom, from all thy creations, from all eternity to all eternity; and naught but peace,justice, and truth is the habitation of thy throne; and mercy shall go before thy face and have no end; how is it thou canstweep?\n32. The Lord said unto Enoch: Behold these thy brethren; they are the workmanship of mine ownhands, and I gave unto them theirknowledge, in the day I created them; and in the Garden of Eden, gave I unto man hisagency;\n33. And unto thy brethren have I said, and also given commandment, that they shouldloveone another, and that they should choose me, their Father; but behold, they are without affection, and theyhatetheir own blood;\n34. And thefireof mineindignationis kindled against them; and in my hot displeasure will I send in thefloodsupon them, for my fierce anger is kindled against them.\n35. Behold, I am God;Manof Holiness is my name; Man of Counsel is my name; and Endless and Eternal is myname, also.\n36. Wherefore, I can stretch forth mine hands and hold all thecreationswhich I have made; and mine eye can pierce them also, and among all the workmanship of mine hands there has not been so greatwickednessas among thy brethren.\n37. But behold, their sins shall be upon the heads of their fathers; Satan shall be their father, and misery shall be their doom; and the whole heavens shall weep over them, even all the workmanship of mine hands; wherefore should not the heavens weep, seeing these shall suffer?\n38. But behold, these which thine eyes are upon shall perish in the floods; and behold, I will shut them up; aprisonhave I prepared for them.\n39. Andthatwhich I have chosen hath pled before my face. Wherefore, hesufferethfor their sins; inasmuch as they will repent in the day that myChosenshall return unto me, and until that day they shall be intorment;\n40. Wherefore, for this shall the heavens weep, yea, and all the workmanship of mine hands.\n41. And it came to pass that the Lord spake unto Enoch, andtoldEnoch all the doings of the children of men; wherefore Enoch knew, and looked upon their wickedness, and their misery, and wept and stretched forth his arms, and hisheartswelled wide as eternity; and his bowels yearned; and all eternity shook.\n42. And Enoch also saw Noah, and hisfamily; that the posterity of all the sons of Noah should be saved with temporal salvation;\n43. Wherefore Enoch saw that Noah built anark; and that the Lord smiled upon it, and held it in his own hand; but upon the residue of the wicked thefloodscame and swallowed them up.\n44. And as Enoch saw this, he hadbitternessof soul, and wept over his brethren, and said unto the heavens: I will refuse to becomforted; but the Lord said unto Enoch: Lift up your heart, and be glad; and look.\n45. And it came to pass that Enoch looked; and from Noah, he beheld all the families of the earth; and he cried unto the Lord, saying: When shall the day of the Lord come? When shall the blood of the Righteous beshed, that all they that mourn may besanctifiedand have eternal life?\n46. And the Lord said: It shall be in themeridian of time, in the days of wickedness and vengeance.\n47. And behold, Enochsawthe day of the coming of the Son of Man, even in the flesh; and his soul rejoiced, saying: The Righteous is lifted up, and theLambis slain from the foundation of the world; and throughfaithI am in the bosom of the Father, and behold,Zionis with me.\n48. And it came to pass that Enoch looked upon theearth; and he heard voice from the bowels thereof, saying: Wo, wo is me, the mother of men; I ampained, I am weary, because of the wickedness of my children. When shall Irest, and becleansedfrom thefilthinesswhich is gone forth out of me? When will my Creator sanctify me, that I may rest, and righteousness for season abide upon my face?\n49. And when Enoch heard the earth mourn, he wept, and cried unto the Lord, saying: O Lord, wilt thou not have compassion upon the earth? Wilt thou not bless the children of Noah?\n50. And it came to pass that Enoch continued his cry unto the Lord, saying: I ask thee, O Lord, in the name of thine Only Begotten, even Jesus Christ, that thou wilt have mercy upon Noah and his seed, that the earth might never more be covered by thefloods.\n51. And the Lord could not withhold; and hecovenantedwith Enoch, and sware unto him with an oath, that he would stay thefloods; that he would call upon the children of Noah;\n52. And he sent forth an unalterable decree, that aremnantof his seed should always be found among all nations, while the earth should stand;\n53. And the Lord said: Blessed is he through whose seed Messiah shall come; for he saithI amMessiah, theKingof Zion, theRockof Heaven, which is broad aseternity; whoso cometh in at the gate andclimbethup by me shall never fall; wherefore, blessed are they of whom I have spoken, for they shall come forth withsongsof everlastingjoy.\n54. And it came to pass that Enoch cried unto the Lord, saying: When the Son of Man cometh in the flesh, shall the earth rest? I pray thee, show me these things.\n55. And the Lord said unto Enoch: Look, and he looked and beheld theSon of Manlifted up on thecross, after the manner of men;\n56. And he heard loud voice; and the heavens wereveiled; and all the creations of God mourned; and the earthgroaned; and the rocks were rent; and thesaintsarose, and werecrownedat theright handof the Son of Man, with crowns of glory;\n57. And as many of thespiritsas were inprisoncame forth, and stood on the right hand of God; andthe remainder were reserved in chains of darkness until the judgment of the great day.\n58. And again Enoch wept and cried unto the Lord, saying: When shall the earthrest?\n59. And Enoch beheld the Son of Man ascend up unto the Father; and he called unto the Lord, saying: Wilt thou not come again upon the earth? Forasmuch as thou art God, and I know thee, and thou hast sworn unto me, and commanded me that I should ask in the name of thine Only Begotten; thou hast made me, and given unto me right to thy throne, and not of myself, but through thine own grace; wherefore, I ask thee if thou wilt not come again on the earth.\n60. And the Lord said unto Enoch: As I live, even so will I come in thelast days, in the days of wickedness and vengeance, to fulfil theoathwhich I have made unto you concerning the children of Noah;\n61. And the day shall come that the earth shallrest, but before that day the heavens shall bedarkened, and aveilof darkness shall cover the earth; and the heavens shall shake, and also the earth; and great tribulations shall be among the children of men, but my people will Ipreserve;\n62. Andrighteousnesswill I send down out of heaven; and truth will I send forth out of the earth, to beartestimonyof mine Only Begotten; hisresurrectionfrom the dead; yea, and also the resurrection of all men; and righteousness and truth will I cause to sweep the earth as with flood, togatherout mine elect from the four quarters of the earth, unto place which I shall prepare, an Holy City, that my people may gird up their loins, and be looking forth for the time of my coming; for there shall be my tabernacle, and it shall be calledZion, aNew Jerusalem.\n63. And the Lord said unto Enoch: Then shalt thou and all thycitymeet them there, and we willreceivethem into our bosom, and they shall see us; and we will fall upon their necks, and they shall fall upon our necks, and we will kiss each other;\n64. And there shall be mine abode, and it shall be Zion, which shall come forth out of all the creations which I have made; and for the space of athousandyears theearthshallrest.\n65. And it came to pass that Enoch saw thedayof thecomingof the Son of Man, in the last days, to dwell on the earth in righteousness for the space of thousand years;\n66. But before that day he saw great tribulations among the wicked; and he also saw the sea, that it was troubled, and mens heartsfailingthem, looking forth with fear for thejudgmentsof the Almighty God, which should come upon the wicked.\n67. And the Lord showed Enoch all things, even unto the end of the world; and he saw the day of the righteous, the hour of their redemption, and received fulness ofjoy;\n68. And all the days ofZion, in the days of Enoch, were three hundred and sixty-five years.\n69. And Enoch and all his peoplewalkedwith God, and he dwelt in the midst of Zion; and it came topass that Zion was not, for God received it up into his own bosom; and from thence went forth the saying,Zion is Fled.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Moses 7",
      "content": "Throughout history, people have tried to achieve what Enoch and his people accomplished: building an ideal society where there is no poverty or violence. As God’s people, we share this desire. We call it building Zion, and it includes—in addition to caring for people in need and promoting peace—making covenants, dwelling together in righteousness, and becoming one with each other and with Jesus Christ, “the King of Zion” (\nMoses 7:53\n). If the world, your community, or your family isn’t quite what you want it to be, it’s helpful to ask, How did Enoch and his people do it? How did they become “of one heart and one mind” (\nMoses 7:18\n) despite the contention around them? Among the many details\nMoses 7\ngives us about Zion, a particularly valuable one for Latter-day Saints might be this: Zion is not just a city—it is a condition of the heart and spirit. Zion, as the Lord has taught, is “the pure in heart” (\nDoctrine and Covenants 97:21\n). So perhaps the best way to build Zion is to start in our own hearts and homes.\nIdeas for Learning and Home and at Church\nMoses 7:16–21, 27, 53, 62–69\nI can help build Zion.\nWhen the Prophet Joseph Smith first learned about Enoch and his City of Holiness, he was inspired. He “knew the day had come when the Lord would again establish Zion on the earth” (\nSaints\n,\n1:108–9\n), and he started a lifelong quest to build Zion. Reading\nMoses 7\ncan inspire you to continue that effort today.\nYou might start by exploring the questions “What is Zion?” and “How is it different from the rest of the world?” Consider listing answers that come to you as you study\nMoses 7\n, in particular\nverses 16–21, 27, 53, 62–69\n.\nYour answers to these questions might make it clear that we still have a lot of work to do to build Zion. So how do we do it? It might help to think about times when you felt you were “of one heart and one mind” with someone (\nMoses 7:18\n). Maybe it was in a ward, family, or group at work or school. What did people do to create righteous unity?\nHere are some other resources that you could explore to find ideas and inspiration. Pick one or more to study, and then write down what you feel inspired to do to build Zion:\nPhilippians 2:1–4\n;\n4 Nephi 1:15–18\n;\nDoctrine and Covenants 97:21\n;\n105:5\n.\nUlisses Soares, “\nBrothers and Sisters in Christ\n,”\nLiahona\n, Nov. 2023, 70–73.\nD. Todd Christofferson, “\nOne in Christ\n,”\nLiahona\n, May 2023, 77–80.\n“We Come Together and Unite as One” (video), Gospel Library.\n6:21\nWe Come Together & Unite As One\nGod wants His people to be “of one heart and one mind” (\nMoses 7:18\n).\nMoses 7:53\nJesus Christ is “the King of Zion.”\nWhat does it mean to you to have Jesus Christ as your King? Note the other titles of Jesus Christ in this verse. What do they teach you about Him? What do you think it means to come “in at the gate and [climb] up by [Him]”?\nSee also “\nCome, O Thou King of Kings\n,”\nHymns\n, no. 59.\nMoses 7:28–69\nGod weeps—and rejoices—for His children.\nSome people see God as a distant being who isn’t emotionally affected by what happens to us. Enoch gained a different view of God in the vision recorded in\nMoses 7\n. What did he learn about God—and what do you learn—in\nverses 28–40\n? Why do you think Enoch was surprised to see God weep? Why is it important to you to know that He does?\nAs the vision continued, Enoch wept too. But God also shared with him reasons to rejoice. Look for them in\nMoses 7:41–69\n. What do you learn from Enoch’s vision that can help you “lift up your heart, and be glad,” despite the “bitterness” in your life (\nverse 44\n)?\nSee also Jeffrey R. Holland, “\nThe Grandeur of God\n,”\nEnsign\nor\nLiahona\n, Nov. 2003, 70–73.\nMoses 7:59–67\nJesus Christ will come again in the last days.\nEnoch’s vision, especially what’s recorded in\nMoses 7:59–67\n, is one of history’s first prophecies of the Savior’s Second Coming. What impresses you about the way these verses describe the last days? For example, consider how you feel the prophecies from\nverse 62\nare being fulfilled. What do these phrases teach you about God’s work in the latter days?\nSee also Henry B. Eyring, “\nSisters in Zion\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 67–69.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat does it mean that “seed of Cain were black”?\nWhat does it mean that the “Lamb is slain from the foundation of the world”?\nHow does the Joseph Smith Translation enhance our understanding of God’s covenant with Enoch and Noah?\nClick to see more.\nIdeas for Teaching Children\nMoses 7:18–21, 62–63, 68–69\nGod wants us to be “of one heart and one mind.”\nTo help your children learn about Enoch and Zion, you could use “\nEnoch the Prophet\n” in\nOld Testament Stories\n(19–21) or the second verse of “\nFollow the Prophet\n” (\nChildren’s Songbook\n, 110–11). Then you could ask your children to help you retell the story in their own words. The pictures of Enoch in this outline might help.\nHere’s one way to help your children understand what it means to be of “one heart and one mind” (\nMoses 7:18\n): Make a paper heart and cut it into pieces, enough for each child to have one. Let them write their name on their piece and work together to put the heart together. As they do, you might talk about things you love about each child.\nHelp your children count how many times the word “Zion” appears in\nMoses 7:18–21, 62–63, 68–69\n. Each time they find the word, help them discover what the verse says about Zion (see also Guide to the Scriptures, “\nZion\n,” Gospel Library). How can we be more like the people described in these verses?\nEncourage personal scripture study.\nWhether you’re teaching your family at home or a class on Sunday, one of the best ways you can help others build lasting faith in Jesus Christ is to help them establish a habit of seeking personal experiences with the scriptures. Share the experiences you’re having with the scriptures, and encourage family or class members to share their experiences. When we hear about how reading the scriptures is blessing others, we are often inspired to seek these same blessings from the Lord. (See\nTeaching in the Savior’s Way\n,\n25\n.)\nMoses 7:32–33\nHeavenly Father wants me to choose to follow Him.\nTo introduce\nMoses 7:32–33\nto your children, you might talk to them about a choice they had to make recently. Then you could read the verses together to find out what Heavenly Father wants us to choose. What choices can we make to show that we choose Him? Perhaps your children could take turns acting out one of these choices while the others guess what the action represents.\nMoses 7:59–67\nJesus will come back to earth.\nIn\nMoses 7:59\n, Enoch asks the Lord a question. Invite your children to find it, and then ask them to find the answer in\nverse 60\n. You might also talk with them about a time when they were expecting someone to return home. Ask them how they felt and what they did to get ready. How can we get ready for Jesus to return?\nConsider showing pictures of times when the Savior appeared to people (such as\nGospel Art Book\n,\nnos. 60\n,\n82\n,\n83\n, and\n84\n). What are the people doing in the pictures? How might the people have felt when they met Jesus? You could also sing a song about the Savior’s Second Coming, such as “\nWhen He Comes Again\n” (\nChildren’s Songbook\n, 82–83), and ask the children what they think it will be like when Jesus comes again. Let the children share how they feel about seeing Jesus when He comes again.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 6: Lesson 16: Lesson 16—Moses 7:1–21This lesson can help students develop the Christlike attributes that Enoch and his people had.; Lesson 17: Lesson 17—Moses 7:22–47This lesson can help students feel God’s mercy and love for all His children....",
      "content": "\n--- Lesson 16 ---\nGod called Enoch as a prophet to preach the message of the gospel. The people who chose to follow Enoch gathered together, and the Lord protected them from the wickedness around them. They eventually formed a joyful and holy city the Lord called “Zion” ( Moses 7:18 ). This lesson can help students develop the Christlike attributes that Enoch and his people had. Student preparation: Invite students to think about their previous day and the effect their actions might have had on other people. Possible Learning Activities Strength through interconnected roots Think of a way to begin the lesson by helping students recognize the strength that can come from unity with others. The following is one way you could do this. How tall do you think the tallest type of tree can grow? The tallest trees in the world are redwood trees. They can grow more than 300 feet (92 m) high. To support such a tall tree, what do you think the roots of a redwood are like? Surprisingly, the roots of redwoods are only about 3–6 feet (1–2 m) deep. However, these roots spread out several hundred feet (more than 100 m) and become intertwined with the roots of other trees. This interconnectedness enables redwoods to stand strong for hundreds of years amid winds and floods (see Richard H. Winkel, “ Web of Friendship ,” New Era , Aug. 2003, 10–11). What do you think we can learn from redwoods that could influence our families, schools, and wards or branches? Why do you think the Lord would want us to find strength with others around us as well as in Him? To help students assess how well-connected they feel to the people around them, invite the students to answer the following questions in their study journals: How do others help and support you, especially in your efforts to come closer to the Savior? (This could be in your family, ward or branch, friend groups, community, and so on.) How do you try to support others and help them feel closer to the Savior? As students study this lesson, invite them to be sensitive to impressions of the Holy Ghost. The Holy Ghost can teach them how they might increase the strength they feel with God and with the people around them. Strength in Zion In a vision, the Lord called the prophet Enoch to preach repentance and baptism to several cities. The people who followed Enoch gathered together. Read Moses 7:13, 16–17 , looking for the contrast between the people who were striving to follow the Lord and the people who fought against them. What impressed you about the blessings the Lord gave to the people who strove to follow Him? To better understand what distinguished the Lord’s people, read Moses 7:18–21 . (It may be helpful to point out that to be cursed means to have blessings withheld because of unrighteousness. See also “ Curse, Curses ” in Guide to the Scriptures.) Moses 7:18 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Help students understand what they studied. To do so, you could invite them to draw in their journals a simple representation of what they learned from verse 18 . Students could then share what they drew and why they drew it with partners, small groups, or the class. What do you learn about the Lord’s people from verse 18 ? What do you think it means to be “of one heart and one mind”? Help students identify a truth similar to the Lord’s people strive to be unified, live righteously, and care for the poor among them. You might point out that these are also characteristics of the Savior. Becoming the Lord’s people means becoming more like Him. Becoming the Lord’s people To help students better understand how to be unified, live righteously, and care for people in need, consider asking students to work through the following handout in small groups. They can strive to help and support each other throughout the activity. Below are two ways you might use the handout: Invite students to divide the sections of the handout between their group members and to study their section on their own. After completing their section, students could share what they learned. Tape copies of the sections of the handout on the walls and invite the small groups to move around the room completing each section together. Open PDF Invite multiple students to share what they learned or studied that was meaningful to them. You also might ask how working in groups increased students’ understanding. How did the Savior exemplify the characteristics of Zion during His life? To illustrate an example of the Christlike attributes of Zion, you might share the video “ Charity: An Example of the Believers ” (4:50), found on Gospel Library. Consider inviting students to look for how these young women exemplified Zion. 4:50 Make a plan Invite students to think about impressions they may have had during the lesson and to record answers to the following questions in their study journals: What is one Christlike attribute of Zion you feel you could improve in your life? (This could be at home, at church, or with others.) What is something you will begin to do this week to strengthen that Christlike attribute? (This could be a part of your goals for the Children and Youth program.) Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for “ Moses 7:18 ” is “The Lord called his people Zion, because they were of one heart and one mind.” Ideas for memorization activities are in the appendix under “Doctrinal Mastery Review Activities.”\n\n\n--- Lesson 17 ---\nWhen have you felt of God’s mercy in your life? The Lord showed Enoch a vision of the earth’s history from his own day to the Millennium. Enoch learned in a profound way about Heavenly Father’s personal love for His children. This lesson can help students feel God’s mercy and love for all His children. Student preparation: Invite students to think of experiences and scriptures that help them know what Heavenly Father is like. They could also ask parents or trusted leaders or friends to share experiences or scriptures with them. Invite students to come prepared to share. Possible Learning Activities Struggling to feel God’s mercy and love To prepare students to learn more about God and His character, read or display the following scenarios: Caleb wonders whether God only cares about people who are doing what’s right. Zoe worries God may be angry about the choices someone close to her is making. She worries He may want to punish them. Olivia doesn’t think she’s ever felt God’s love. Why might these people feel this way? Select one of these scenarios to ponder as you continue this lesson. To help students be receptive to the influence of the Holy Ghost throughout this lesson, encourage them to ponder the following questions: What do you know about Heavenly Father that could help you if you had similar concerns? What questions do you have about Heavenly Father? Seek help from the Lord to know and feel His love for you and for all His children. Enoch’s vision of those who were not taken into heaven Consider summarizing the following in your own words: Recall that through the help and guidance of the Lord, Enoch established the city of Zion. The people of Zion were unified in the Lord, lived in righteousness, and cared for one another (see Moses 7:16–19 ). In a vision, the Lord showed Enoch that He would take the people of Zion into heaven because of their faith and righteousness (see Moses 7:20–21 ). Enoch also “beheld the residue of the people” ( Moses 7:22 ), referring to those people who were left on the earth because they would not follow the Savior. Read Moses 7:23–26 , looking for what Enoch saw. What do you learn about Satan? Why do you think it is important to understand these things about Satan? Enoch sees how God reacts to wickedness Enoch then had a tender experience as he watched God look upon the people who had chosen not to obey Him. You may want to explain that Enoch saw Jehovah, or Jesus Christ. Ever since the Fall of Adam, Jehovah is who appears to and speaks with prophets. On these occasions, He often speaks as if He were the Father. The unity of the Father and Son is such that the Savior’s feelings also represent the Father. Therefore, what students will study of this vision between Enoch and Jehovah can also help them learn about Heavenly Father. As students read the following verses, you might encourage them to read slowly, pause to ponder what they read, and maybe read the verses more than once. Reading in this way can help students invite the Spirit to teach them more about their Heavenly Father. Read Moses 7:28–33 and mark words or phrases that help you know and understand Heavenly Father better. What do you learn about God from these verses? Consider writing “ God … ” on the board and ask students to finish this statement with what they learned. Encourage various responses. Some answers might include: loves us deeply ( verses 28–33 ). created the universe yet is available to us ( verse 30 ). is just, merciful, and kind ( verse 30 ). gave us agency ( verse 32 ). desires that we love one another ( verse 33 ). desires that we choose Him ( verse 33 ). As students share what they found, consider asking follow-up questions such as: Why is that truth about Heavenly Father meaningful to you? How can knowing that truth help the person in the situation you chose? How can it help you? Using Enoch’s experience, President Jeffrey R. Holland of the Quorum of the Twelve Apostles taught that the Savior shows us what Heavenly Father is like and how much He loves us. He shared the following insight about Heavenly Father: In the midst of a grand vision of humankind which heaven opened to his view, Enoch, observing both the blessings and challenges of mortality, turns his gaze toward the Father and is stunned to see Him weeping. He says in wonder and amazement to this most powerful Being in the universe: “How is it that thou canst weep?” … That single, riveting scene does more to teach the true nature of God than any theological treatise could ever convey. … What an indelible image of God’s engagement in our lives! What anguish in a parent when His children do not choose Him nor “the gospel of God” He sent! [ Romans 1:1 ]. How easy to love someone who so singularly loves us! … I bear personal witness this day of a personal, living God, who knows our names, hears and answers prayers, and cherishes us eternally as children of His spirit. (” The Grandeur of God ,” Ensign or Liahona , Nov. 2003, 72) Invite students to share what stood out to them from President Holland’s statement. Consider writing the following questions on the board. Invite students to discuss the questions in small groups. Also invite them to discuss how these ideas might apply to the scenarios they chose at the beginning of the lesson. As students answer, walk around the room and listen to some of their responses. Why do you think Heavenly Father weeps for us when we do not love one another? Why might He weep for us when we do not choose to follow and love Him? What are some lies that Satan would like us to believe about God’s feelings toward us? After students have discussed these questions, consider asking what they heard from another student that would be helpful to share with the whole class. This allows students to review answers while also complimenting each other for their responses. You may also point out helpful answers you heard. Enoch sees the life and mission of the Savior The Lord then showed Enoch that the people left on the earth who would not repent would perish in a flood (see Moses 7:34–44 ). In response, Enoch wept. The Lord then comforted Enoch, saying, “Lift up your heart, and be glad; and look” ( Moses 7:44 ). Read Moses 7:44–47 , looking for what the Lord showed Enoch to comfort him. It may be helpful to know that “the Righteous” ( verses 45 and 47 ) is a title for Jesus Christ. Why do you think seeing these things would cause Enoch’s soul to rejoice? ( verse 47 ). How does sending Jesus Christ show the Father’s mercy and love? If helpful, you can discuss how the Savior will help all of God’s children, even the people who were wicked and died in the Flood. Help students understand that although the wicked perished in the Flood and would have to suffer for their sins in the spirit world, they could still repent through the Savior (see Moses 7:38–39 ; 1 Peter 3:18–20 ). Feeling God’s love To conclude, invite students to seek help through the Holy Ghost as they do the following activity. Alternatively, students could write to someone in their lives who may need to feel Heavenly Father’s mercy and love. Write a letter to help the person in the scenario you chose at the beginning of the lesson. As part of your letter, include the following: What you learned from Moses 7 about Heavenly Father’s mercy and love. Include specific phrases or verses you feel would be especially meaningful. Other scriptures or experiences that have helped you feel God’s mercy and love. Additional ideas you think may help this person feel God’s love. Conclude by inviting students to share their thoughts, experiences, and feelings. Consider adding your own testimony of the Father’s love.\n\n\n--- Lesson 18 ---\nOne of the Savior’s titles is “the King of Zion” ( Moses 7:53 ). He watches over His people, and in the last days He will preserve them from the great tribulations that will occur. This lesson can help students recognize and appreciate what the Lord has done to help them overcome the trials of our time. Student preparation: Invite students to come prepared to share a passage from the Book of Mormon that has helped them when they have faced trials. Possible Learning Activities Great tribulations in the last days Invite students to imagine a large storm is coming to your city. If useful, you could display an image of a large storm. What are some of the great trials or difficulties of the last days? How could these trials and difficulties be compared to a storm? What are some ways to seek safety from these storms? Invite students to ponder their feelings about these storms and their efforts to find safety. The following self-assessment is one way you could do this: Ponder how true the following statements are of you: I know what the Lord has done to help me with the storms (trials and difficulties) that I face. I appreciate what the Lord has done and sincerely want His help. Invite students to seek inspiration from the Holy Ghost as they study. The Holy Ghost can teach about ways the Lord can help the students with the storms they face. The King of Zion Enoch and his people built “the City of Holiness, even Zion” ( Moses 7:19 ). The Lord promised they would “dwell in safety forever” ( Moses 7:20 ). Enoch then saw and wept over the destruction that would come during the Flood. Seeking comfort, Enoch asked if the Lord would have mercy on the people who came after the Flood. In response, the Lord taught about and showed Enoch the Savior and His Atonement (see Moses 7:42–57 ). Read Moses 7:53 , looking for how the Savior described Himself. How could the things the Lord shared in this verse comfort Enoch? Invite students to mark and discuss the various titles and roles of Jesus Christ in verse 53 . This lesson will focus on His title “King of Zion.” You might ask follow-up questions about this title such as: How is Jesus Christ like a powerful and loving king to us? What other phrases from this verse describe blessings you would want from following the King of Zion? Consider reminding students that Zion is made up of anyone who, like Enoch’s people, are “the pure in heart” ( Doctrine and Covenants 97:21 )—people who are like the Lord. The Lord will preserve His people Enoch asked the Lord if He would come again to the earth. The Lord showed Enoch the last days and the things He would do for the people who strive to follow Him. Read Moses 7:60–61 , looking for what the Lord promised to do. What do you think it means for the Lord to “preserve” the people that strive to follow Him? As students read Moses 7:62 as directed below, you may want to help them see how active God is in preserving His people. One way to do this is to invite students to pay attention to every use of the word I and to the verbs that follow it. You may also invite them to notice when the Lord uses my or mine and what words these are associated with. Though Enoch had seen in vision the devastating flood in the days of Noah, the Lord then showed Enoch ways He would gather people to Him and preserve them. Read Moses 7:62 , looking for what the Lord will do to preserve His people. What are some of the things the Lord will do to preserve His people? Write the following phrase on the board: To preserve His people in the last days, the Lord will … As students answer, write the following phrases on the board : send righteousness out of heaven. send truth out of the earth. gather His people to Zion (see also Doctrine and Covenants 115:6 ). What are some ways that the Lord is fulfilling this prophecy in our time? Righteousness out of heaven and truth out of the earth to gather us to Zion To help students understand the three different aspects of this truth, you might write “Righteousness out of heaven,” “Truth out of the earth,” and “Zion” each on the board in separate columns. The following are sentences and images connected to each aspect. Write each sentence on a separate sheet of paper or display the images. Students could then match the sentence or image to one of the headings on the board. Righteousness out of heaven Joseph Smith received the First Vision. John the Baptist gave the Aaronic Priesthood to Joseph Smith. Peter, James, and John gave the Melchizedek Priesthood to Joseph Smith. The Lord revealed the Doctrine and Covenants. The Lord reveals His word through modern-day prophets. Truth out of the earth Joseph Smith obtained and translated the gold plates. Zion We are all part of a ward or branch. Help students ponder the importance of what the Lord has done. One way you could do this is by inviting students to complete the following in their study journals. If you used the previous activity, students could select something from the list on the board. Identify two ways the Lord is preserving His people from the tribulations of our time and answer the following questions. If possible, think of a specific example. You might mention an experience with the priesthood, a passage from the Book of Mormon, an experience in your ward or branch, and so on. How has this example helped you come to know the Savior better? How has it or could it help with the difficulties of the last days? Invite several students to share their responses. Look for ways to help students recognize and appreciate all the Lord has done to help them with the trials and difficulties of the last days. One way you can do this is to listen carefully to what students say and state what it can teach us about the character and nature of the Lord. (For additional training on helping students know and feel the Lord’s love, see “ Help Learners Strengthen Their Relationship with Heavenly Father and Jesus Christ ” in Teacher Development Skills.)",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Moses 7",
      "content": "1. And it came to pass that Enoch continued his speech, saying: Behold, our father Adam taught these things, and many have believed and become thesonsof God, and many have believed not, and have perished in their sins, and are looking forth withfear, in torment, for the fiery indignation of the wrath of God to be poured out upon them.\n2. And from that time forth Enoch began to prophesy, saying unto the people, that: As I was journeying, and stood upon the place Mahujah, and cried unto the Lord, there came voice out of heaven, sayingTurn ye, and get ye upon the mountSimeon.\n3. And it came to pass that I turned and went up on the mount; and as I stood upon the mount, I beheld the heavens open, and I was clothed upon withglory;\n4. And Isawthe Lord; and he stood before my face, and he talked with me, even as man talketh one with another,face to face; and hesaid unto me:Look, and I willshowunto thee the world for the space of many generations.\n5. And it came to pass that I beheld in the valley of Shum, and lo, great people which dwelt intents, which were the people of Shum.\n6. And again the Lord said unto me: Look; and I looked towards the north, and I beheld the people ofCanaan, which dwelt in tents.\n7. And the Lord said unto me: Prophesy; and I prophesied, saying: Behold the people of Canaan, which are numerous, shall go forth in battle array against the people of Shum, and shall slay them that they shall utterly be destroyed; and the people of Canaan shall divide themselves in the land, and the land shall be barren and unfruitful, and none other people shall dwell there but the people of Canaan;\n8. For behold, the Lord shallcursethe land with much heat, and thebarrennessthereof shall go forth forever; and there was ablacknesscame upon all the children of Canaan, that they were despised among all people.\n9. And it came to pass that the Lord said unto me: Look; and I looked, and I beheld the land of Sharon, and the land of Enoch, and the land of Omner, and the land of Heni, and the land of Shem, and the land of Haner, and the land of Hanannihah, and all the inhabitants thereof;\n10. And the Lord said unto me: Go to this people, and say unto themRepent, lest I come out and smite them with curse, and they die.\n11. And he gave unto me commandment that I shouldbaptizein the name of the Father, and of the Son, which is full ofgraceand truth, and of the Holy Ghost, which beareth record of the Father and the Son.\n12. And it came to pass that Enoch continued to call upon all the people, save it were the people of Canaan, to repent;\n13. And so great was thefaithof Enoch that he led the people of God, and their enemies came to battle against them; and hespakethe word of the Lord, and the earth trembled, and themountainsfled, even according to his command; and theriversof water were turned out of their course; and the roar of the lions was heard out of the wilderness; and all nations feared greatly, sopowerfulwas the word of Enoch, and so great was the power of the language which God had given him.\n14. There also cameupa land out of the depth of the sea, and so great was the fear of the enemies of the people of God, that they fled and stood afar off and went upon the land which came up out of the depth of the sea.\n15. And thegiantsof the land, also, stood afar off; and there went forth acurseupon all people that fought against God;\n16. And from that time forth there were wars and bloodshed among them; but the Lord came anddweltwith his people, and they dwelt in righteousness.\n17. Thefearof the Lord was upon all nations, so great was thegloryof the Lord, which was upon his people. And the Lord blessed theland, and they were blessed upon the mountains, and upon the high places, and did flourish.\n18. And the Lord called his peopleZion, because they were ofoneheart and one mind, and dwelt in righteousness; and there was no poor among them.\n19. And Enoch continued his preaching in righteousness unto the people of God. And it came to pass in his days, that he built city that was called the City of Holiness, evenZion.\n20. And it came to pass that Enoch talked with the Lord; and he said unto the Lord: SurelyZionshall dwell in safety forever. But the Lord said unto Enoch: Zion have I blessed, but theresidueof the people have I cursed.\n21. And it came to pass that the Lord showed unto Enoch all the inhabitants of the earth; and he beheld, and lo,Zion, in process of time, wastakenup into heaven. And the Lord said unto Enoch: Behold mine abode forever.\n22. And Enoch also beheld the residue of the people which were the sons of Adam; and they were mixture of all the seed of Adam save it was the seed of Cain, for the seed of Cain wereblack, and had not place among them.\n23. And after that Zion was taken up intoheaven, Enochbeheld, and lo,allthe nations of the earth were before him;\n24. And there came generation upon generation; and Enoch was high andlifted up, even in the bosom of the Father, and of the Son of Man; and behold, the power of Satan was upon all the face of the earth.\n25. And he saw angels descending out of heaven; and he heard loud voice saying: Wo, wo be unto the inhabitants of the earth.\n26. And he beheld Satan; and he had greatchainin his hand, and it veiled the whole face of the earth withdarkness; and he looked up andlaughed, and hisangelsrejoiced.\n27. And Enoch beheldangelsdescending out of heaven, bearingtestimonyof the Father and Son; and the Holy Ghost fell on many, and they were caught up by the powers of heaven into Zion.\n28. And it came to pass that the God of heaven looked upon theresidueof the people, and he wept; and Enoch bore record of it, saying: How is it that the heavens weep, and shed forth their tears as the rain upon the mountains?\n29. And Enoch said unto the Lord: How is it that thou canstweep, seeing thou art holy, and from all eternity to all eternity?\n30. And were it possible that man could number the particles of the earth, yea, millions ofearthslike this, it would not be beginning to the number of thycreations; and thy curtains are stretched out still; and yet thou art there, and thy bosom is there; and also thou art just; thou art merciful and kind forever;\n31. And thou hast takenZionto thine own bosom, from all thy creations, from all eternity to all eternity; and naught but peace,justice, and truth is the habitation of thy throne; and mercy shall go before thy face and have no end; how is it thou canstweep?\n32. The Lord said unto Enoch: Behold these thy brethren; they are the workmanship of mine ownhands, and I gave unto them theirknowledge, in the day I created them; and in the Garden of Eden, gave I unto man hisagency;\n33. And unto thy brethren have I said, and also given commandment, that they shouldloveone another, and that they should choose me, their Father; but behold, they are without affection, and theyhatetheir own blood;\n34. And thefireof mineindignationis kindled against them; and in my hot displeasure will I send in thefloodsupon them, for my fierce anger is kindled against them.\n35. Behold, I am God;Manof Holiness is my name; Man of Counsel is my name; and Endless and Eternal is myname, also.\n36. Wherefore, I can stretch forth mine hands and hold all thecreationswhich I have made; and mine eye can pierce them also, and among all the workmanship of mine hands there has not been so greatwickednessas among thy brethren.\n37. But behold, their sins shall be upon the heads of their fathers; Satan shall be their father, and misery shall be their doom; and the whole heavens shall weep over them, even all the workmanship of mine hands; wherefore should not the heavens weep, seeing these shall suffer?\n38. But behold, these which thine eyes are upon shall perish in the floods; and behold, I will shut them up; aprisonhave I prepared for them.\n39. Andthatwhich I have chosen hath pled before my face. Wherefore, hesufferethfor their sins; inasmuch as they will repent in the day that myChosenshall return unto me, and until that day they shall be intorment;\n40. Wherefore, for this shall the heavens weep, yea, and all the workmanship of mine hands.\n41. And it came to pass that the Lord spake unto Enoch, andtoldEnoch all the doings of the children of men; wherefore Enoch knew, and looked upon their wickedness, and their misery, and wept and stretched forth his arms, and hisheartswelled wide as eternity; and his bowels yearned; and all eternity shook.\n42. And Enoch also saw Noah, and hisfamily; that the posterity of all the sons of Noah should be saved with temporal salvation;\n43. Wherefore Enoch saw that Noah built anark; and that the Lord smiled upon it, and held it in his own hand; but upon the residue of the wicked thefloodscame and swallowed them up.\n44. And as Enoch saw this, he hadbitternessof soul, and wept over his brethren, and said unto the heavens: I will refuse to becomforted; but the Lord said unto Enoch: Lift up your heart, and be glad; and look.\n45. And it came to pass that Enoch looked; and from Noah, he beheld all the families of the earth; and he cried unto the Lord, saying: When shall the day of the Lord come? When shall the blood of the Righteous beshed, that all they that mourn may besanctifiedand have eternal life?\n46. And the Lord said: It shall be in themeridian of time, in the days of wickedness and vengeance.\n47. And behold, Enochsawthe day of the coming of the Son of Man, even in the flesh; and his soul rejoiced, saying: The Righteous is lifted up, and theLambis slain from the foundation of the world; and throughfaithI am in the bosom of the Father, and behold,Zionis with me.\n48. And it came to pass that Enoch looked upon theearth; and he heard voice from the bowels thereof, saying: Wo, wo is me, the mother of men; I ampained, I am weary, because of the wickedness of my children. When shall Irest, and becleansedfrom thefilthinesswhich is gone forth out of me? When will my Creator sanctify me, that I may rest, and righteousness for season abide upon my face?\n49. And when Enoch heard the earth mourn, he wept, and cried unto the Lord, saying: O Lord, wilt thou not have compassion upon the earth? Wilt thou not bless the children of Noah?\n50. And it came to pass that Enoch continued his cry unto the Lord, saying: I ask thee, O Lord, in the name of thine Only Begotten, even Jesus Christ, that thou wilt have mercy upon Noah and his seed, that the earth might never more be covered by thefloods.\n51. And the Lord could not withhold; and hecovenantedwith Enoch, and sware unto him with an oath, that he would stay thefloods; that he would call upon the children of Noah;\n52. And he sent forth an unalterable decree, that aremnantof his seed should always be found among all nations, while the earth should stand;\n53. And the Lord said: Blessed is he through whose seed Messiah shall come; for he saithI amMessiah, theKingof Zion, theRockof Heaven, which is broad aseternity; whoso cometh in at the gate andclimbethup by me shall never fall; wherefore, blessed are they of whom I have spoken, for they shall come forth withsongsof everlastingjoy.\n54. And it came to pass that Enoch cried unto the Lord, saying: When the Son of Man cometh in the flesh, shall the earth rest? I pray thee, show me these things.\n55. And the Lord said unto Enoch: Look, and he looked and beheld theSon of Manlifted up on thecross, after the manner of men;\n56. And he heard loud voice; and the heavens wereveiled; and all the creations of God mourned; and the earthgroaned; and the rocks were rent; and thesaintsarose, and werecrownedat theright handof the Son of Man, with crowns of glory;\n57. And as many of thespiritsas were inprisoncame forth, and stood on the right hand of God; andthe remainder were reserved in chains of darkness until the judgment of the great day.\n58. And again Enoch wept and cried unto the Lord, saying: When shall the earthrest?\n59. And Enoch beheld the Son of Man ascend up unto the Father; and he called unto the Lord, saying: Wilt thou not come again upon the earth? Forasmuch as thou art God, and I know thee, and thou hast sworn unto me, and commanded me that I should ask in the name of thine Only Begotten; thou hast made me, and given unto me right to thy throne, and not of myself, but through thine own grace; wherefore, I ask thee if thou wilt not come again on the earth.\n60. And the Lord said unto Enoch: As I live, even so will I come in thelast days, in the days of wickedness and vengeance, to fulfil theoathwhich I have made unto you concerning the children of Noah;\n61. And the day shall come that the earth shallrest, but before that day the heavens shall bedarkened, and aveilof darkness shall cover the earth; and the heavens shall shake, and also the earth; and great tribulations shall be among the children of men, but my people will Ipreserve;\n62. Andrighteousnesswill I send down out of heaven; and truth will I send forth out of the earth, to beartestimonyof mine Only Begotten; hisresurrectionfrom the dead; yea, and also the resurrection of all men; and righteousness and truth will I cause to sweep the earth as with flood, togatherout mine elect from the four quarters of the earth, unto place which I shall prepare, an Holy City, that my people may gird up their loins, and be looking forth for the time of my coming; for there shall be my tabernacle, and it shall be calledZion, aNew Jerusalem.\n63. And the Lord said unto Enoch: Then shalt thou and all thycitymeet them there, and we willreceivethem into our bosom, and they shall see us; and we will fall upon their necks, and they shall fall upon our necks, and we will kiss each other;\n64. And there shall be mine abode, and it shall be Zion, which shall come forth out of all the creations which I have made; and for the space of athousandyears theearthshallrest.\n65. And it came to pass that Enoch saw thedayof thecomingof the Son of Man, in the last days, to dwell on the earth in righteousness for the space of thousand years;\n66. But before that day he saw great tribulations among the wicked; and he also saw the sea, that it was troubled, and mens heartsfailingthem, looking forth with fear for thejudgmentsof the Almighty God, which should come upon the wicked.\n67. And the Lord showed Enoch all things, even unto the end of the world; and he saw the day of the righteous, the hour of their redemption, and received fulness ofjoy;\n68. And all the days ofZion, in the days of Enoch, were three hundred and sixty-five years.\n69. And Enoch and all his peoplewalkedwith God, and he dwelt in the midst of Zion; and it came topass that Zion was not, for God received it up into his own bosom; and from thence went forth the saying,Zion is Fled.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Moses": {
      "7": {
        "verses": {
          "1": {
            "text": "And it came to pass that Enoch continued his speech, saying: Behold, our father Adam taught these things, and many have believed and become thesonsof God, and many have believed not, and have perished in their sins, and are looking forth withfear, in torment, for the fiery indignation of the wrath of God to be poured out upon them.",
            "citation": "(Moses 7:1)"
          },
          "2": {
            "text": "And from that time forth Enoch began to prophesy, saying unto the people, that: As I was journeying, and stood upon the place Mahujah, and cried unto the Lord, there came voice out of heaven, sayingTurn ye, and get ye upon the mountSimeon.",
            "citation": "(Moses 7:2)"
          },
          "3": {
            "text": "And it came to pass that I turned and went up on the mount; and as I stood upon the mount, I beheld the heavens open, and I was clothed upon withglory;",
            "citation": "(Moses 7:3)"
          },
          "4": {
            "text": "And Isawthe Lord; and he stood before my face, and he talked with me, even as man talketh one with another,face to face; and hesaid unto me:Look, and I willshowunto thee the world for the space of many generations.",
            "citation": "(Moses 7:4)"
          },
          "5": {
            "text": "And it came to pass that I beheld in the valley of Shum, and lo, great people which dwelt intents, which were the people of Shum.",
            "citation": "(Moses 7:5)"
          },
          "6": {
            "text": "And again the Lord said unto me: Look; and I looked towards the north, and I beheld the people ofCanaan, which dwelt in tents.",
            "citation": "(Moses 7:6)"
          },
          "7": {
            "text": "And the Lord said unto me: Prophesy; and I prophesied, saying: Behold the people of Canaan, which are numerous, shall go forth in battle array against the people of Shum, and shall slay them that they shall utterly be destroyed; and the people of Canaan shall divide themselves in the land, and the land shall be barren and unfruitful, and none other people shall dwell there but the people of Canaan;",
            "citation": "(Moses 7:7)"
          },
          "8": {
            "text": "For behold, the Lord shallcursethe land with much heat, and thebarrennessthereof shall go forth forever; and there was ablacknesscame upon all the children of Canaan, that they were despised among all people.",
            "citation": "(Moses 7:8)"
          },
          "9": {
            "text": "And it came to pass that the Lord said unto me: Look; and I looked, and I beheld the land of Sharon, and the land of Enoch, and the land of Omner, and the land of Heni, and the land of Shem, and the land of Haner, and the land of Hanannihah, and all the inhabitants thereof;",
            "citation": "(Moses 7:9)"
          },
          "10": {
            "text": "And the Lord said unto me: Go to this people, and say unto themRepent, lest I come out and smite them with curse, and they die.",
            "citation": "(Moses 7:10)"
          },
          "11": {
            "text": "And he gave unto me commandment that I shouldbaptizein the name of the Father, and of the Son, which is full ofgraceand truth, and of the Holy Ghost, which beareth record of the Father and the Son.",
            "citation": "(Moses 7:11)"
          },
          "12": {
            "text": "And it came to pass that Enoch continued to call upon all the people, save it were the people of Canaan, to repent;",
            "citation": "(Moses 7:12)"
          },
          "13": {
            "text": "And so great was thefaithof Enoch that he led the people of God, and their enemies came to battle against them; and hespakethe word of the Lord, and the earth trembled, and themountainsfled, even according to his command; and theriversof water were turned out of their course; and the roar of the lions was heard out of the wilderness; and all nations feared greatly, sopowerfulwas the word of Enoch, and so great was the power of the language which God had given him.",
            "citation": "(Moses 7:13)"
          },
          "14": {
            "text": "There also cameupa land out of the depth of the sea, and so great was the fear of the enemies of the people of God, that they fled and stood afar off and went upon the land which came up out of the depth of the sea.",
            "citation": "(Moses 7:14)"
          },
          "15": {
            "text": "And thegiantsof the land, also, stood afar off; and there went forth acurseupon all people that fought against God;",
            "citation": "(Moses 7:15)"
          },
          "16": {
            "text": "And from that time forth there were wars and bloodshed among them; but the Lord came anddweltwith his people, and they dwelt in righteousness.",
            "citation": "(Moses 7:16)"
          },
          "17": {
            "text": "Thefearof the Lord was upon all nations, so great was thegloryof the Lord, which was upon his people. And the Lord blessed theland, and they were blessed upon the mountains, and upon the high places, and did flourish.",
            "citation": "(Moses 7:17)"
          },
          "18": {
            "text": "And the Lord called his peopleZion, because they were ofoneheart and one mind, and dwelt in righteousness; and there was no poor among them.",
            "citation": "(Moses 7:18)"
          },
          "19": {
            "text": "And Enoch continued his preaching in righteousness unto the people of God. And it came to pass in his days, that he built city that was called the City of Holiness, evenZion.",
            "citation": "(Moses 7:19)"
          },
          "20": {
            "text": "And it came to pass that Enoch talked with the Lord; and he said unto the Lord: SurelyZionshall dwell in safety forever. But the Lord said unto Enoch: Zion have I blessed, but theresidueof the people have I cursed.",
            "citation": "(Moses 7:20)"
          },
          "21": {
            "text": "And it came to pass that the Lord showed unto Enoch all the inhabitants of the earth; and he beheld, and lo,Zion, in process of time, wastakenup into heaven. And the Lord said unto Enoch: Behold mine abode forever.",
            "citation": "(Moses 7:21)"
          },
          "22": {
            "text": "And Enoch also beheld the residue of the people which were the sons of Adam; and they were mixture of all the seed of Adam save it was the seed of Cain, for the seed of Cain wereblack, and had not place among them.",
            "citation": "(Moses 7:22)"
          },
          "23": {
            "text": "And after that Zion was taken up intoheaven, Enochbeheld, and lo,allthe nations of the earth were before him;",
            "citation": "(Moses 7:23)"
          },
          "24": {
            "text": "And there came generation upon generation; and Enoch was high andlifted up, even in the bosom of the Father, and of the Son of Man; and behold, the power of Satan was upon all the face of the earth.",
            "citation": "(Moses 7:24)"
          },
          "25": {
            "text": "And he saw angels descending out of heaven; and he heard loud voice saying: Wo, wo be unto the inhabitants of the earth.",
            "citation": "(Moses 7:25)"
          },
          "26": {
            "text": "And he beheld Satan; and he had greatchainin his hand, and it veiled the whole face of the earth withdarkness; and he looked up andlaughed, and hisangelsrejoiced.",
            "citation": "(Moses 7:26)"
          },
          "27": {
            "text": "And Enoch beheldangelsdescending out of heaven, bearingtestimonyof the Father and Son; and the Holy Ghost fell on many, and they were caught up by the powers of heaven into Zion.",
            "citation": "(Moses 7:27)"
          },
          "28": {
            "text": "And it came to pass that the God of heaven looked upon theresidueof the people, and he wept; and Enoch bore record of it, saying: How is it that the heavens weep, and shed forth their tears as the rain upon the mountains?",
            "citation": "(Moses 7:28)"
          },
          "29": {
            "text": "And Enoch said unto the Lord: How is it that thou canstweep, seeing thou art holy, and from all eternity to all eternity?",
            "citation": "(Moses 7:29)"
          },
          "30": {
            "text": "And were it possible that man could number the particles of the earth, yea, millions ofearthslike this, it would not be beginning to the number of thycreations; and thy curtains are stretched out still; and yet thou art there, and thy bosom is there; and also thou art just; thou art merciful and kind forever;",
            "citation": "(Moses 7:30)"
          },
          "31": {
            "text": "And thou hast takenZionto thine own bosom, from all thy creations, from all eternity to all eternity; and naught but peace,justice, and truth is the habitation of thy throne; and mercy shall go before thy face and have no end; how is it thou canstweep?",
            "citation": "(Moses 7:31)"
          },
          "32": {
            "text": "The Lord said unto Enoch: Behold these thy brethren; they are the workmanship of mine ownhands, and I gave unto them theirknowledge, in the day I created them; and in the Garden of Eden, gave I unto man hisagency;",
            "citation": "(Moses 7:32)"
          },
          "33": {
            "text": "And unto thy brethren have I said, and also given commandment, that they shouldloveone another, and that they should choose me, their Father; but behold, they are without affection, and theyhatetheir own blood;",
            "citation": "(Moses 7:33)"
          },
          "34": {
            "text": "And thefireof mineindignationis kindled against them; and in my hot displeasure will I send in thefloodsupon them, for my fierce anger is kindled against them.",
            "citation": "(Moses 7:34)"
          },
          "35": {
            "text": "Behold, I am God;Manof Holiness is my name; Man of Counsel is my name; and Endless and Eternal is myname, also.",
            "citation": "(Moses 7:35)"
          },
          "36": {
            "text": "Wherefore, I can stretch forth mine hands and hold all thecreationswhich I have made; and mine eye can pierce them also, and among all the workmanship of mine hands there has not been so greatwickednessas among thy brethren.",
            "citation": "(Moses 7:36)"
          },
          "37": {
            "text": "But behold, their sins shall be upon the heads of their fathers; Satan shall be their father, and misery shall be their doom; and the whole heavens shall weep over them, even all the workmanship of mine hands; wherefore should not the heavens weep, seeing these shall suffer?",
            "citation": "(Moses 7:37)"
          },
          "38": {
            "text": "But behold, these which thine eyes are upon shall perish in the floods; and behold, I will shut them up; aprisonhave I prepared for them.",
            "citation": "(Moses 7:38)"
          },
          "39": {
            "text": "Andthatwhich I have chosen hath pled before my face. Wherefore, hesufferethfor their sins; inasmuch as they will repent in the day that myChosenshall return unto me, and until that day they shall be intorment;",
            "citation": "(Moses 7:39)"
          },
          "40": {
            "text": "Wherefore, for this shall the heavens weep, yea, and all the workmanship of mine hands.",
            "citation": "(Moses 7:40)"
          },
          "41": {
            "text": "And it came to pass that the Lord spake unto Enoch, andtoldEnoch all the doings of the children of men; wherefore Enoch knew, and looked upon their wickedness, and their misery, and wept and stretched forth his arms, and hisheartswelled wide as eternity; and his bowels yearned; and all eternity shook.",
            "citation": "(Moses 7:41)"
          },
          "42": {
            "text": "And Enoch also saw Noah, and hisfamily; that the posterity of all the sons of Noah should be saved with temporal salvation;",
            "citation": "(Moses 7:42)"
          },
          "43": {
            "text": "Wherefore Enoch saw that Noah built anark; and that the Lord smiled upon it, and held it in his own hand; but upon the residue of the wicked thefloodscame and swallowed them up.",
            "citation": "(Moses 7:43)"
          },
          "44": {
            "text": "And as Enoch saw this, he hadbitternessof soul, and wept over his brethren, and said unto the heavens: I will refuse to becomforted; but the Lord said unto Enoch: Lift up your heart, and be glad; and look.",
            "citation": "(Moses 7:44)"
          },
          "45": {
            "text": "And it came to pass that Enoch looked; and from Noah, he beheld all the families of the earth; and he cried unto the Lord, saying: When shall the day of the Lord come? When shall the blood of the Righteous beshed, that all they that mourn may besanctifiedand have eternal life?",
            "citation": "(Moses 7:45)"
          },
          "46": {
            "text": "And the Lord said: It shall be in themeridian of time, in the days of wickedness and vengeance.",
            "citation": "(Moses 7:46)"
          },
          "47": {
            "text": "And behold, Enochsawthe day of the coming of the Son of Man, even in the flesh; and his soul rejoiced, saying: The Righteous is lifted up, and theLambis slain from the foundation of the world; and throughfaithI am in the bosom of the Father, and behold,Zionis with me.",
            "citation": "(Moses 7:47)"
          },
          "48": {
            "text": "And it came to pass that Enoch looked upon theearth; and he heard voice from the bowels thereof, saying: Wo, wo is me, the mother of men; I ampained, I am weary, because of the wickedness of my children. When shall Irest, and becleansedfrom thefilthinesswhich is gone forth out of me? When will my Creator sanctify me, that I may rest, and righteousness for season abide upon my face?",
            "citation": "(Moses 7:48)"
          },
          "49": {
            "text": "And when Enoch heard the earth mourn, he wept, and cried unto the Lord, saying: O Lord, wilt thou not have compassion upon the earth? Wilt thou not bless the children of Noah?",
            "citation": "(Moses 7:49)"
          },
          "50": {
            "text": "And it came to pass that Enoch continued his cry unto the Lord, saying: I ask thee, O Lord, in the name of thine Only Begotten, even Jesus Christ, that thou wilt have mercy upon Noah and his seed, that the earth might never more be covered by thefloods.",
            "citation": "(Moses 7:50)"
          },
          "51": {
            "text": "And the Lord could not withhold; and hecovenantedwith Enoch, and sware unto him with an oath, that he would stay thefloods; that he would call upon the children of Noah;",
            "citation": "(Moses 7:51)"
          },
          "52": {
            "text": "And he sent forth an unalterable decree, that aremnantof his seed should always be found among all nations, while the earth should stand;",
            "citation": "(Moses 7:52)"
          },
          "53": {
            "text": "And the Lord said: Blessed is he through whose seed Messiah shall come; for he saithI amMessiah, theKingof Zion, theRockof Heaven, which is broad aseternity; whoso cometh in at the gate andclimbethup by me shall never fall; wherefore, blessed are they of whom I have spoken, for they shall come forth withsongsof everlastingjoy.",
            "citation": "(Moses 7:53)"
          },
          "54": {
            "text": "And it came to pass that Enoch cried unto the Lord, saying: When the Son of Man cometh in the flesh, shall the earth rest? I pray thee, show me these things.",
            "citation": "(Moses 7:54)"
          },
          "55": {
            "text": "And the Lord said unto Enoch: Look, and he looked and beheld theSon of Manlifted up on thecross, after the manner of men;",
            "citation": "(Moses 7:55)"
          },
          "56": {
            "text": "And he heard loud voice; and the heavens wereveiled; and all the creations of God mourned; and the earthgroaned; and the rocks were rent; and thesaintsarose, and werecrownedat theright handof the Son of Man, with crowns of glory;",
            "citation": "(Moses 7:56)"
          },
          "57": {
            "text": "And as many of thespiritsas were inprisoncame forth, and stood on the right hand of God; andthe remainder were reserved in chains of darkness until the judgment of the great day.",
            "citation": "(Moses 7:57)"
          },
          "58": {
            "text": "And again Enoch wept and cried unto the Lord, saying: When shall the earthrest?",
            "citation": "(Moses 7:58)"
          },
          "59": {
            "text": "And Enoch beheld the Son of Man ascend up unto the Father; and he called unto the Lord, saying: Wilt thou not come again upon the earth? Forasmuch as thou art God, and I know thee, and thou hast sworn unto me, and commanded me that I should ask in the name of thine Only Begotten; thou hast made me, and given unto me right to thy throne, and not of myself, but through thine own grace; wherefore, I ask thee if thou wilt not come again on the earth.",
            "citation": "(Moses 7:59)"
          },
          "60": {
            "text": "And the Lord said unto Enoch: As I live, even so will I come in thelast days, in the days of wickedness and vengeance, to fulfil theoathwhich I have made unto you concerning the children of Noah;",
            "citation": "(Moses 7:60)"
          },
          "61": {
            "text": "And the day shall come that the earth shallrest, but before that day the heavens shall bedarkened, and aveilof darkness shall cover the earth; and the heavens shall shake, and also the earth; and great tribulations shall be among the children of men, but my people will Ipreserve;",
            "citation": "(Moses 7:61)"
          },
          "62": {
            "text": "Andrighteousnesswill I send down out of heaven; and truth will I send forth out of the earth, to beartestimonyof mine Only Begotten; hisresurrectionfrom the dead; yea, and also the resurrection of all men; and righteousness and truth will I cause to sweep the earth as with flood, togatherout mine elect from the four quarters of the earth, unto place which I shall prepare, an Holy City, that my people may gird up their loins, and be looking forth for the time of my coming; for there shall be my tabernacle, and it shall be calledZion, aNew Jerusalem.",
            "citation": "(Moses 7:62)"
          },
          "63": {
            "text": "And the Lord said unto Enoch: Then shalt thou and all thycitymeet them there, and we willreceivethem into our bosom, and they shall see us; and we will fall upon their necks, and they shall fall upon our necks, and we will kiss each other;",
            "citation": "(Moses 7:63)"
          },
          "64": {
            "text": "And there shall be mine abode, and it shall be Zion, which shall come forth out of all the creations which I have made; and for the space of athousandyears theearthshallrest.",
            "citation": "(Moses 7:64)"
          },
          "65": {
            "text": "And it came to pass that Enoch saw thedayof thecomingof the Son of Man, in the last days, to dwell on the earth in righteousness for the space of thousand years;",
            "citation": "(Moses 7:65)"
          },
          "66": {
            "text": "But before that day he saw great tribulations among the wicked; and he also saw the sea, that it was troubled, and mens heartsfailingthem, looking forth with fear for thejudgmentsof the Almighty God, which should come upon the wicked.",
            "citation": "(Moses 7:66)"
          },
          "67": {
            "text": "And the Lord showed Enoch all things, even unto the end of the world; and he saw the day of the righteous, the hour of their redemption, and received fulness ofjoy;",
            "citation": "(Moses 7:67)"
          },
          "68": {
            "text": "And all the days ofZion, in the days of Enoch, were three hundred and sixty-five years.",
            "citation": "(Moses 7:68)"
          },
          "69": {
            "text": "And Enoch and all his peoplewalkedwith God, and he dwelt in the midst of Zion; and it came topass that Zion was not, for God received it up into his own bosom; and from thence went forth the saying,Zion is Fled.",
            "citation": "(Moses 7:69)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 41881,
  "total_sources": 3,
  "generated_at": "2025-12-14T04:01:27.366079"
}