{
  "week_number": 22,
  "date_range": "Judges 2–4",
  "title": ";6–8;13–16",
  "primary_scriptures": [
    {
      "book": "Judges",
      "chapters": [
        "2",
        "3",
        "4"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Judges",
      "chapters": [
        "2",
        "3",
        "4"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;6–8;13–16 ---\nWe all know what it’s like to sin, feel bad about it, and then repent and resolve to change our ways. But too often we forget our earlier resolve, and, when temptation comes, we find ourselves committing the same sin. This pattern appears frequently in the book of Judges. Influenced by the beliefs and worship practices of the Canaanites—whom they were supposed to drive out of the land—the Israelites broke their covenants with the Lord and turned away from worshipping Him. As a result, they lost His protection and fell into captivity. And yet each time this happened, the Lord gave His covenant people the chance to repent and raised up a deliverer, a military leader called a “judge.” Not all of the judges in the book of Judges were righteous, but some of them exercised great faith in delivering the children of Israel and restoring them to their covenant relationship with the Lord. These stories remind us that no matter what has led us away from Jesus Christ, He is the Redeemer of Israel and is always willing to deliver us and welcome us back as we return to Him.\nFor an overview of the book of Judges, see “\nJudges, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nJudges 2:1–19\n;\n3:5–12\nThe Lord forgives as often as I repent.\nThe book of Judges can be both a warning and an encouragement. Look for this warning and encouragement as you read\nJudges 2:1–19\n;\n3:5–12\n. How do you feel the warning and encouragement apply to you?\nFor example, if\nJudges 2:19\nwere about you and your temptations rather than about the ancient Israelites, what might it say? If\nJudges 3:9\nwere about what the Lord had done to deliver you, what might it say?\nConsider reading the question and answer on\npage 9\nof\nFor the Strength of Youth: A Guide for Making Choices\n. How do you feel this applies to the Israelites’ experience in the book of Judges? What does this teach you about Jesus Christ?\nJudges 4:1–15\nI can inspire others to have faith in the Lord.\nSometimes the faith of one person can inspire faith in many others. In\nJudges 4\n, that one person was Deborah. Read about her in\nJudges 4:1–15\n, and note the influence she had on people around her. Here are some questions to help you consider how her experience might apply to your life:\nHow would you describe the conditions the Israelites were in at the time? (see\nverses 1–3\n). What similarities do you see to conditions today—in individuals and society?\nWhat words or actions of Deborah show you that she had faith in the Lord? How did her faith influence others? What else impresses you about her?\nWhat do you think Deborah meant by her question in\nverse 14\n: “Is not the Lord gone out before thee?” How does the Lord “go out before” you? (see\nDoctrine and Covenants 84:87–88\n).\nPonder how your faith in Jesus Christ could bless others the way Deborah’s faith blessed Barak and the other Israelites. To help you think about this, you might study Elder Neil L. Andersen’s message “\nWe Talk of Christ\n” (\nEnsign\nor\nLiahona\n, Nov. 2020, 88–91). Search the message for (1) reasons to speak more openly about the Savior and (2) ways to do it.\nThen you might make a list of things you know about Jesus Christ—from the scriptures, from words of living prophets, and from your personal experience. Who needs to know this? How will you share it?\nSee also\nMatthew 5:14–16\n;\n1 Peter 3:15\n; “\nEach Life That Touches Ours for Good\n,”\nHymns\n, no. 293.\nInvite sharing.\nIf you are a teacher—at home or at church—“give learners opportunities to share with each other what they are learning about the Savior and His gospel. Doing this will help them internalize the truths they are taught and express them” (\nTeaching in the Savior’s Way\n,\n26\n). For example, when studying\nJudges 4\ntogether, you could give each learner something specific to look for in the chapter and then invite them to share with each other what they find.\nJudges 6–8\nThe Lord can work miracles when I trust in His ways.\nAs you read\nJudges 6–8\n, make note of instances where the Lord asked Gideon to believe something that might have seemed unlikely. Has He ever asked something similar of you?\nWhat do you feel the Lord is trying to teach you with this account? How have you seen the Lord do His work in ways that seemed unlikely?\nJudges 13–16\nGod strengthens me as I am faithful to my covenants.\nSamson lost both his physical strength and his spiritual strength because he violated his covenants with God, including those that applied specifically to Nazarites (for information about the Nazarites, see\nNumbers 6:1–6\n;\nJudges 13:7\n). As you read about Samson in\nJudges 13–16\n, note verses that show that the Lord was with Samson, as well as verses showing that Samson was not fully committed to the Lord.\nYou might also ponder the covenants you have made with the Lord. How have these covenants brought His power into your life? What do you learn from Samson’s experiences that inspires you to stay true to your covenants with God?\nSister Ann M. Dibb taught: “Samson was born with great potential. His mother was promised, ‘He shall begin to deliver Israel out of the hand of the Philistines’ [\nJudges 13:5\n]. But as Samson grew, he looked more to the world’s temptations than to God’s direction. He made choices because they ‘pleaseth [him] well’ [\nJudges 14:3\n] rather than because those choices were right. Repeatedly, the scriptures use the phrase ‘and he went down’ [\nJudges 14:7\n] as they tell of Samson’s journeys, actions, and choices. Instead of arising and shining forth to fulfill his great potential, Samson was overcome by the world, lost his God-given power, and died a tragic, early death” (“\nArise and Shine Forth\n,”\nEnsign\nor\nLiahona\n, May 2012, 118).\nSee also Dallin H. Oaks, “\nCovenants and Responsibilities\n,”\nLiahona\n, May 2024, 93–96; Ulisses Soares, “\nCovenant Confidence through Jesus Christ\n,”\nLiahona\n, May 2024, 17–21.\nStudy Helps\nWhat were some of the false gods of the Canaanites?\nWhat does it mean that Deborah was a prophetess?\nWas it appropriate for Gideon to ask God for a sign?\nClick to see more.\nIdeas for Teaching Children\nBecause this Sunday is the first Sunday of the month, Primary teachers are encouraged to use learning activities in “Appendix B: Preparing Children for a Lifetime on God’s Covenant Path.”\nJudges 3:7–9, 12–15\nJesus Christ is my Deliverer.\nJudges 3\ndescribes a pattern that teaches about the Savior’s power to deliver us from sin. To help your children identify this pattern, you could write down these phrases: “did evil,” “cried unto the Lord,” and “raised up a deliverer.” Then your children could look for these phrases in\nJudges 3:7–9\nand\nJudges 3:12–15\n. What do we learn about the Lord from this pattern?\nTo emphasize that Jesus Christ is our Deliverer, you could gather several pictures of people, including a picture of Jesus, and place them face down. Let your children take turns flipping over the pictures. When they find the picture of Jesus, sing a song about Him, such as “\nHe Sent His Son\n” (\nChildren’s Songbook\n, 34–35), and tell your children about how He has delivered you.\nJudges 4:1–15\nI can inspire others to have faith in the Lord.\nYou can use “\nDeborah the Prophetess\n” in\nOld Testament Stories\n, 92–95, to tell your children the story in\nJudges 4\n. Share with each other what you admire about Deborah. How did her faith in the Lord bless the people around her? What can we do to help others have more faith in Jesus Christ?\n2:9\nDeborah the Prophetess\nJudges 7:1–21\nThe Lord can use small things to do great work.\nUse\nJudges 7:4–7\n, this week’s activity page, or “\nThe Army of Gideon\n” in\nOld Testament Stories\n, 96–99, to teach your children about how the Lord made Israel’s army smaller. Why did the Lord want Gideon’s army to be so small? (see\nJudges 7:2\n).\n2:37\nThe Army of Gideon\nYour children could draw pictures of a sword, shield, trumpet, lamp, and pitcher and talk about which of these objects they would want in a battle. Then they could read\nJudges 7:16\nto learn what the Lord told Gideon’s army to use. As you read about the battle in\nJudges 7:19–21\n, share with each other what you learn about the Lord from this story.\nSamson Puts Down the Pillars\n, by James Tissot and others\nJudges 13:5\nKeeping covenants gives me strength.\nSamson’s covenants with the Lord gave him physical strength, just as our covenants give us spiritual strength. Your children might enjoy doing some physical exercises and discussing how those exercises can help make our bodies strong. How does keeping our covenants make our spirits strong? (see\nMosiah 18:8–10\n;\nDoctrine and Covenants 20:77, 79\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 22: Lesson 58: Lesson 58—Deuteronomy 6:1–6This lesson can help students understand how they can show their love for God.; Lesson 59: Lesson 59—Deuteronomy 6:6-25; 7:1–26; 8:1–20This lesson is intended to help students increase their desire to remember what God has done for them.... ---\n\n--- Lesson 58 ---\nAfter guiding the Israelites for 40 years in the wilderness, Moses shared his final counsel with them before the Lord commanded Joshua to lead them into the promised land. An important part of Moses’s prophetic message was to “love the Lord thy God with all thine heart” ( Deuteronomy 6:5 ). This lesson can help students understand how they can show their love for God. Student preparation: Invite students to ask a parent, guardian, or Church leader to share some of their favorite nonverbal ways of showing that they love someone. It may be helpful to tell students that the lesson will focus on ways we can show our love for God. Possible Learning Activities Showing love Consider using the following activity to help students brainstorm various ways they can show love. In your study journal, write the name of a family member you love. In 60 seconds, list under their name as many unique ways to show your love for them as you can. Ask a few volunteers to share the name they wrote and some ideas they had for showing love. When students are done sharing, invite them to read Deuteronomy 6:5 and share what they learn. (Students may share in their own words a truth such as: God commands us to love Him with all our heart, soul, and might .) You might suggest that students link or cross-reference this verse to the doctrinal mastery passage Matthew 22:36–39 , where Jesus Christ emphasized its importance. Consider writing Heavenly Father and Jesus Christ in the middle of the board. Give students two minutes to come to the board and list different ways we can express our love for Them. Then encourage students to share which of their classmates’ ideas stand out to them and why. Ponder the following questions. What are your true feelings for Heavenly Father and Jesus Christ? Why do you feel that way? What are some of the ways you show Them how you feel? As you study the book of Deuteronomy this week, pay attention to impressions from the Holy Ghost. His influence can deepen your love for Heavenly Father and Jesus Christ, and teach you ways you can express that love to Them. God loves us with all His heart To help students learn from God’s example, they could be invited to link or cross-reference Deuteronomy 6:5 to 1 John 4:19 . After reading verse 19, you might ask students to share ways God has shown His love for everyone or for them personally. The following statement can help students reflect on God’s perfect example of loving us with all His heart. Consider displaying it and inviting a student to read it aloud. Then continue to display it while students discuss their answers to the questions below. President Jeffrey R. Holland of the Quorum of the Twelve Apostles helped us better understand the true character of God. 19:24 The first great commandment of all eternity is to love God with all of our heart, might, mind, and strength—that’s the first great commandment. But the first great truth of all eternity is that God loves us with all of His heart, might, mind, and strength. That love is the foundation stone of eternity, and it should be the foundation stone of our daily life. Indeed it is only with that reassurance burning in our soul that we can have the confidence to keep trying to improve, keep seeking forgiveness for our sins, and keep extending that grace to our neighbor. (“ Tomorrow the Lord Will Do Wonders among You ,” Ensign or Liahona , May 2016, 127) What do you learn from President Holland’s statement that could motivate us to show our love for God? What are some steps someone could take toward loving God “with all [their] might” if they don’t feel strong enough to do it yet? Obedience is an expression of love To give students a brief context of the book of Deuteronomy, consider displaying the image of Moses from the beginning of the lesson as you summarize or invite a student to read aloud the following paragraph. After serving as a prophet of God for 40 years, Moses instructed the Israelites to make camp on the border of the promised land. Joshua would soon lead them across the border (see Deuteronomy 31:23 ). Moses was able to view the promised land from a mountaintop before the Lord translated him, or took Moses unto Himself without Moses dying (see Deuteronomy 34:1–6 ; Alma 45:18–19 ). The book of Deuteronomy contains Moses’s final counsel to the people, including inspired counsel about loving God and obeying His commandments. Read the following passages, looking for similarities between what Moses taught his people and what Jesus taught His disciples about how to show our love for God. Deuteronomy 6:1–6 ; 30:16 John 14:15, 21–24 What did you learn about showing our love for God? If a student already listed “keeping the commandments” on the board earlier as one way to show our love for God, consider pointing it out. If they didn’t, consider adding it to the board. Why do you think keeping the commandments is a meaningful way to show Heavenly Father and Jesus Christ that we love Them? Loving God in our everyday lives It may be helpful for students to discuss realistic ways they can express their love for God in their lives. One way to do this is to show the video “ If We Love Him ” (3:57) ( ChurchofJesusChrist.org ). Invite students to pay attention to both the lyrics of the song and what they see youth in the video doing to show their love for God. Then invite students to share what they learned about ways to show our love for God. 3:57 Another option could be to give small groups of students a piece of paper with one of the common settings listed below written on it. Display the following instructions and questions for groups to complete and discuss. (Depending on available time, groups could exchange papers with other groups and repeat the activity multiple times.) Select one of these common settings: at work, at school, at seminary, at church, at home, at practice, with friends, on social media . How would you answer the following questions from your experience with this setting in mind? In this setting, how have you seen someone show their love for God? What are some appropriate ways to express your love for God in this setting? Is there anything that might make expressing love for God difficult in this setting? If so, how could we overcome it? Conclusion To conclude, you may want to express your love for Heavenly Father and Jesus Christ. In addition to your testimony, you may also want to share the following statement and invite students to express their feelings for Heavenly Father and Jesus Christ in their study journal. Encourage them to act on any impressions they may have received from the Spirit during the lesson. Elder K. Brett Nattress of the Seventy asked some important questions for us to ponder personally. I testify that our Heavenly Father always remembers us and that He loves us perfectly. My question is this: Do we remember Him? And do we love Him? (“ Have I Truly Been Forgiven? ,” Liahona , May 2023, 68–69)\n\n\n--- Lesson 59 ---\nAfter years of being guided and protected by God through the wilderness, the Israelites were about to settle in their promised land. Though arriving at their new home would be a welcomed change, comfort could also tempt them to forget God. Through Moses, the Lord taught the Israelites how important it would be for them to remember what He had done for them. This lesson is intended to help students increase their desire to remember what God has done for them. Student preparation: Invite students to think of five things they feel the Lord has done for them in the past week. Invite them to reflect on how noticing what the Lord is doing for them can bless their life. Possible Learning Activities It can be easy to “forget the Lord” Consider beginning class by discussing the temptation to forget God when things are going well in our lives. One way to do this is to show pictures such as the following and ask the questions below. In which of these situations might people be more likely to remember and rely on God? Why? Why might it be more difficult to remember God and rely on Him when life is going well for us? Why is it important to remember God in all circumstances? Invite students to finish the following sentences in their study journal. Thinking specifically about your relationship with Heavenly Father and Jesus Christ, complete the following statements: When things are going well in my life, I tend to . When things are going poorly in my life, I tend to . Encourage students to seek the Spirit to help them better understand the value of remembering Heavenly Father and Jesus Christ and what They have done for them. Remembering the Lord Consider reading or summarizing the following paragraph to help students understand what was happening in the Israelites’ lives in the book of Deuteronomy. After leading the children of Israel for 40 years in the wilderness, the Lord was ready to bring them over the Jordan River into the promised land. Since leaving Egypt, the Israelites had depended on the Lord for food, water, and protection. The Israelites had now become a mighty army, and the promised land had many natural resources that would make their lives much more comfortable. Consider inviting students to read the following verses and discuss the questions below with partners or in small groups. Read Deuteronomy 4:7–9 ; 6:10–13 ; and 8:7–14 , looking for a repeated warning Moses gave the Israelites. Why do you think Moses was worried about this? Why do you think Moses’s counsel is still needed by members of the Savior’s Church today? If needed, help students see that Moses was worried that prosperity would cause the Israelites to forget God. Display the following statement for students to refer to as they identify bolded truths. Elder Dale G. Renlund of the Quorum of the Twelve Apostles explained why Heavenly Father wants us to remember Him and His Son. Our Heavenly Father wants us to recall His and His Beloved Son’s goodness, not for Their own gratification but for the influence such remembrance has on us. By considering Their kindness, our perspective and understanding are enlarged. By reflecting on Their compassion, we become more humble, prayerful, and steadfast. … Every time we use, benefit from, or even think of these gifts, we ought to consider the sacrifice, generosity, and compassion of the givers. Reverence for the givers does more than just make us grateful. Reflecting on Their gifts can and should transform us. (“ Consider the Goodness and Greatness of God ,” Ensign or Liahona , May 2020, 41–42) What stands out to you from Elder Renlund’s statement? Based on what stands out to them, invite students to complete the following statement in their journals: By remembering the goodness of Heavenly Father and Jesus Christ, … Students might come up with several ways to complete the statement. Some examples include: … our perspective and understanding are enlarged. … we become more humble, prayerful, and steadfast. … we can be transformed (or changed). You may want to list students’ answers on the board. Make sure students understand the meaning of these blessings. One way to do this is to ask what it looks like to receive these blessings. For example, what might it look like to be prayerful or to be more steadfast? Why do you think remembering the Lord leads to such significant blessings? How have you experienced any of the truths that Elder Renlund shared? Remembering the Lord can help us face challenges To obtain the promised land, the Israelites faced a challenge. The Lord told them they would have to defeat mightier nations ( Deuteronomy 7:1 ). Knowing that the nations were mightier than they were might have made many of the Israelites nervous. To help students relate the scriptures to their own lives, consider asking them to list on the board situations that they are facing or will face that they know they need the Lord’s help with. Read Deuteronomy 7:17–21 ; 8:2–4, 15 to see what the Lord wanted the Israelites to remember as they dealt with future challenges. How could remembering what the Lord has done in the past be helpful when facing challenges in the future? You might invite students to list situations when they know the Lord helped them or others in the past. If you invited students to do the student preparation, this could be a good opportunity to ask them what the Lord has done for them in the past week. Ask students to share how remembering what the Lord has done in the past can help them as they face current and future difficulties. How we can remember the Lord To help students feel the value of remembering Heavenly Father and Jesus Christ and to see one way to help us remember Them, consider showing the video “ O Remember, Remember ” (1:28) found on Gospel Library. You could invite students to look for what President Henry B. Eyring of the First Presidency did to see the Lord’s hand and the results that followed. 1:28 What effect might it have on you to see God’s hand in your daily life? To conclude, consider inviting students to write one or two ways they could better remember Heavenly Father and Jesus Christ and invite Their blessings into their lives.\n\n\n--- Lesson 60 ---\nThe Savior’s commandments to the Israelites in Deuteronomy include forgiving debtors, releasing people in servitude, and relieving the burden of the poor. As His people, we too have a covenant responsibility to freely share what the Savior has given us to relieve the burden of the poor. This lesson can help students feel a greater desire to follow the Savior’s commandment to share what He has given them. Student preparation: Invite students to prayerfully sing or study the words to the hymn “ Because I Have Been Given Much ” ( Hymns , no. 219) or Matthew 25:31–40 . Students could ask Heavenly Father to help them see ways they can share with others what He has given them. Possible Learning Activities True followers of Jesus Christ To begin class, consider displaying a favorite picture of Jesus Christ. You could write the following incomplete statement from President Nelson on the board. You may want to point out that there could be many correct ways to finish the statement. President Russell M. Nelson taught: One of the easiest ways to identify a true follower of Jesus Christ is . (“ Peacemakers Needed ,” Liahona , May 2023, 98) What are some ways we could complete President Nelson’s statement? After students respond, invite them to share why they feel their response completes the statement. You could compliment and validate what students share. Then display President Nelson’s completed statement. One of the easiest ways to identify a true follower of Jesus Christ is how compassionately that person treats other people. (“ Peacemakers Needed ,” Liahona , May 2023, 98) Why is this a good way to identify true followers of Jesus Christ? What are some ways disciples of Jesus Christ could treat people compassionately? To help students assess how well they currently treat others, you might share some or all of the following statements and invite students to ponder how well each statement applies to them. The way I treat others shows that I am a follower of Jesus Christ. I have compassion for others and want to do what I can to help them. I feel willing to share what the Lord has given me with others. As you study today, seek the guidance of the Holy Ghost to help you feel the importance of following the Savior’s commandment in the way you treat other people. Caring for people in need Before students read the following passage, you might explain that as part of the instructions given in Deuteronomy, the Lord commanded that all debts were to be forgiven every seventh year. Read Deuteronomy 15:7–11 , looking for how the Lord wants us to treat people around us. What did you discover? As students share, help them recognize a truth such as the Lord commands us to share the blessings He has given us. It might be helpful to use a simple object lesson to help students understand what it means to “open thine hand wide” to others ( verses 8 and 11 ). To do this you might have a bowl of dry cereal, beans, or small candy at the front of the room. Invite two students to demonstrate this phrase. One student could grab a handful of the item and hold it over the other student’s hands. Ask the student to open their hand “a little,” then “a little more,” allowing small amounts of food to fall into the other student’s hands. Finally, invite students to read verse 8 again and have the student demonstrating the object lesson “open thine hand wide.” What do you think it means that we are to open our hands wide in caring for the poor? What could we learn about the Savior from His commandment? How does He open His hand wide to us? In what circumstances might we be tempted to shut our hand from the poor? Before students read the following passage, you might explain that the Lord also commanded that every seventh year any servant who desired freedom was to be released from bondage. Read Deuteronomy 15:12–15 , looking for how the Lord told the Israelites they should treat a servant who desired to be freed from bondage. From what you’ve learned about the Israelites, how had they been in bondage physically and spiritually? How might someone be in spiritual bondage today? How could remembering how the Savior has delivered us from spiritual and physical bondage affect how we treat others? “Are we not all beggars?” Invite students to consider what it might look like for a teenager to be “poor” not only financially but also spiritually, physically, emotionally, and socially. How could we open our hand wide to someone in need in each of these ways? Use the scripture study tools to find a scripture passage or statement from a Church leader that could help someone follow the Savior’s commandment to care for the poor If students need additional assistance, you might suggest passages such as Luke 6:30–38 ; Mosiah 4:16–27 ; Doctrine and Covenants 104:15–18 ; Moses 7:18 . Students could also search Gospel Library for words like “poor.” After students have had time to find a scripture or statement, invite them to share what they found with a partner or in a small group. Students could also discuss the following questions. How could this scripture or statement apply to how we care for someone who is “poor” financially, spiritually, physically, emotionally, or socially? When have you had an experience being blessed by the generosity of others? To help students increase their desire to give generously to others, you could show the video “ The Coat ” (2:07) from Gospel Library. You might explain to students that this story depicts a childhood experience of President Heber J. Grant. Consider pausing the video after young Heber first sees the little boy with no coat. Invite students to review Deuteronomy 15:7–8 and share things Heber might do if he were to “open his hand wide” and how the Lord might bless him for his generosity. Then watch the remainder of the video. 2:8 Increase our desire to share with others Read Matthew 25:31–40 , looking for how the Savior feels about our efforts to care for people in need. Consider inviting students to read the words or sing the hymn “ Because I Have Been Given Much ” ( Hymns , no. 219). Invite them to look for words and phrases in the lyrics that help them feel the importance of the Savior’s commandment to share generously with others. Before sharing the following questions, you might remind students of the statement from President Nelson from the beginning of the lesson. Reminding students of this statement could help them connect the truths they have learned and felt today to the words of prophets. (For additional training on invitations that help connect students to the words of prophets, see “ Teach from the scriptures and the words of latter-day prophets ” in Teacher Development Skills .) Students could answer the following questions in their study journals. What have you learned or felt today that has helped increase your desire to be a true follower of Jesus Christ by giving generously to others? What have you felt impressed to do? Consider sharing a time when your life has been blessed by the generosity of others who sought to be true followers of Jesus Christ. You might invite students to seek Heavenly Father’s guidance to find someone to serve and how to do it.\n\n--- SCRIPTURE: Judges 2 ---\n1. And an angel of theLordcame up from Gilgal to Bochim, and said, I made you to go up out of Egypt, and have brought you unto the land which I sware unto your fathers; and I said, I will neverbreakmycovenantwith you.\n2. And ye shall make noleaguewith the inhabitants of this land; ye shall throw down their altars: but ye have notobeyedmy voice: why have ye done this?\n3. Wherefore I also said, I will not drive them out from before you; but they shall beas thornsin your sides, and their gods shall be asnareunto you.\n4. And it came to pass, when the angel of theLordspake these words unto all the children of Israel, that the people lifted up their voice, and wept.\n5. And they called the name of that place Bochim: and they sacrificed there unto theLord.\n6. And when Joshua had let the people go, the children of Israel went every man unto his inheritance to possess the land.\n7. And the peopleservedtheLordall the days of Joshua, and all the days of the elders that outlived Joshua, who had seen all the great works of theLord, that he did for Israel.\n8. And Joshua the son ofNun, the servant of theLord, died,beingan hundred and ten years old.\n9. And they buried him in the border of his inheritance in Timnath-heres, in the mount of Ephraim, on the north side of the hill Gaash.\n10. And also all that generation were gathered unto their fathers: and there arose another generation after them, whichknew nottheLord, nor yet the works which he had done for Israel.\n11. And the children of Israel did evil in the sight of theLord, and served Baalim:\n12. And they forsook theLordGod of their fathers, which brought them out of the land of Egypt, and followed other gods, of the gods of the people thatwereround about them, and bowed themselves unto them, and provoked theLordtoanger.\n13. And they forsook theLord, and servedBaaland Ashtaroth.\n14. And theangerof theLordwas hot against Israel, and he delivered them into the hands ofspoilersthat spoiled them, and he sold them into the hands of their enemies round about, so that they could not any longer stand before their enemies.\n15. Whithersoever they went out, thehandof theLordwas against them for evil, as theLordhad said, and as theLordhad sworn unto them: and they were greatly distressed.\n16. Nevertheless theLordraised upjudges, whichdeliveredthem out of the hand of those that spoiled them.\n17. And yet they would not hearken unto their judges, but they went awhoringafter othergods, and bowed themselves unto them: they turnedquicklyout of the way which their fathers walked in, obeying the commandments of theLord;butthey did not so.\n18. And when theLordraised them up judges, then theLordwas with the judge, and delivered them out of the hand of their enemies all the days of the judge:for it repentedtheLordbecause of their groanings by reason of them that oppressed them andvexedthem.\n19. And it came to pass, when the judge was dead,thatthey returned, and corruptedthemselvesmore than theirfathers, in following other gods to serve them, and to bow down unto them; they ceased not from their own doings, nor from theirstubbornway.\n20. And the anger of theLordwas hot against Israel; and he said, Because that this people hath transgressed my covenant which I commanded their fathers, and have not hearkened unto my voice;\n21. I also will not henceforth drive out any from before them of the nations which Joshua left when he died:\n22. That through them I mayproveIsrael, whether they will keep the way of theLordtowalktherein, as their fathers did keepit,or not.\n23. Therefore theLordleft those nations, without driving them out hastily; neither delivered he them into the hand of Joshua.\n\n--- SCRIPTURE: Judges 3 ---\n1. Now thesearethe nations which theLordleft, to prove Israel by them,evenas manyof Israelas had not known all the wars of Canaan;\n2. Only that the generations of the children of Israel might know, to teach them war, at the least such as before knew nothing thereof;\n3. Namely,fivelords of the Philistines, and all the Canaanites, and the Sidonians, and the Hivites that dwelt in mount Lebanon, frommount Baal-hermon unto the entering in of Hamath.\n4. And they were to prove Israel by them, to know whether they would hearken unto the commandments of theLord, which he commanded their fathers by the hand of Moses.\n5. And the children of Israeldweltamong the Canaanites, Hittites, and Amorites, and Perizzites, and Hivites, and Jebusites:\n6. And they took their daughters to be their wives, andgavetheir daughters to their sons, and served their gods.\n7. And the children of Israel didevilin the sight of theLord, and forgat theLordtheir God, andservedBaalimand thegroves.\n8. Therefore the anger of theLordwas hot against Israel, and he sold them into the hand of Chushan-rishathaim king of Mesopotamia: and the children of Israel served Chushan-rishathaim eight years.\n9. And when the children of Israel cried unto theLord, theLordraised up adelivererto the children of Israel, who delivered them,evenOthniel the son of Kenaz, Calebs younger brother.\n10. And theSpiritof theLordcame upon him, and he judged Israel, and went out to war: and theLorddelivered Chushan-rishathaim king of Mesopotamia into his hand; and his hand prevailed againstChushan-rishathaim.\n11. And the land had rest forty years. And Othniel the son of Kenaz died.\n12. And the children of Israel did evil again in the sight of theLord: and theLordstrengthened Eglon the king of Moab against Israel, because they had done evil in the sight of theLord.\n13. And he gathered unto him the children of Ammon and Amalek, and went and smote Israel, and possessed the city of palm trees.\n14. So the children of Israel served Eglon the king of Moab eighteen years.\n15. But when the children of Israel cried unto theLord, theLordraised them up deliverer, Ehud the son of Gera, Benjamite, man lefthanded: and by him the children of Israel sent present unto Eglon the king of Moab.\n16. But Ehud made him dagger which had two edges, of cubit length; and he did gird it under his raiment upon his right thigh.\n17. And he brought the present unto Eglon king of Moab: and Eglonwasa very fat man.\n18. And when he had made an end to offer the present, he sent away the people that bare the present.\n19. But he himself turned again from the quarries thatwereby Gilgal, and said, I have secreterrandunto thee, O king: who said, Keep silence. And all that stood by him went out from him.\n20. And Ehud came unto him; and he was sitting in summer parlour, which he had for himself alone. And Ehud said, I have message from God unto thee. And he arose out ofhisseat.\n21. And Ehud put forth his left hand, and took the dagger from his right thigh, and thrust it into his belly:\n22. And thehaftalso went in after the blade; and the fat closed upon the blade, so that he could not draw the dagger out of his belly; and the dirt came out.\n23. Then Ehud went forth through the porch, and shut the doors of theparlourupon him, and locked them.\n24. When he was gone out, his servants came; and when they saw that, behold, the doors of the parlourwerelocked, they said, Surely he covereth his feet in his summer chamber.\n25. And they tarried till they were ashamed: and, behold, he opened not the doors of the parlour; therefore they took key, and openedthem:and, behold, their lordwasfallen down dead on the earth.\n26. And Ehud escaped while they tarried, and passed beyond the quarries, and escaped unto Seirath.\n27. And it came to pass, when he was come, that he blew trumpet in the mountain of Ephraim, and the children of Israel went down with him from the mount, and he before them.\n28. And he said unto them, Follow after me: for theLordhath delivered your enemies the Moabites into your hand. And they went down after him, and took the fords of Jordan toward Moab, and suffered not man to pass over.\n29. And they slew of Moab at that time about ten thousand men, alllusty, and all men of valour; and there escaped not man.\n30. SoMoabwassubduedthat day under the hand of Israel. And the land had restfourscoreyears.\n31. And after him was Shamgar the son of Anath, which slew of the Philistines six hundred men with an ox goad: and he also delivered Israel.\n\n--- SCRIPTURE: Judges 4 ---\n1. And the children of Israel again didevilin the sight of theLord, when Ehud was dead.\n2. And theLordsoldthem into the hand of Jabin king of Canaan, that reigned in Hazor; the captain of whose hostwasSisera, which dwelt in Harosheth of the Gentiles.\n3. And the children of Israel cried unto theLord: for he had nine hundredchariotsof iron; and twenty years hemightilyoppressedthe children of Israel.\n4. And Deborah, aprophetess, the wife of Lapidoth, she judged Israel at that time.\n5. And shedweltunder the palm tree of Deborah between Ramah and Beth-el in mount Ephraim: and the children of Israel came up to her for judgment.\n6. And she sent and calledBarakthe son of Abinoam out of Kedesh-naphtali, and said unto him, Hath not theLordGod of Israel commanded,saying,Go and draw toward mount Tabor, and take with thee ten thousand men of the children of Naphtali and of the children of Zebulun?\n7. And I will draw unto thee to the river Kishon Sisera, the captain of Jabins army, with his chariots and his multitude; and I will deliver him into thine hand.\n8. And Barak said unto her, If thou wilt go with me, then I will go: but if thou wilt not go with me,thenI will not go.\n9. And she said, I will surely go with thee: notwithstanding the journey that thou takest shall not be for thine honour; for theLordshall sell Sisera into the hand of woman. And Deborah arose, and went with Barak to Kedesh.\n10. And Barak called Zebulun and Naphtali to Kedesh; and he went up with ten thousand men at his feet: and Deborah went up with him.\n11. Now Heber the Kenite,which wasof the children of Hobab the father in law of Moses, had severed himself from the Kenites, and pitchedhis tent unto the plain of Zaanaim, whichisby Kedesh.\n12. And they shewed Sisera that Barak the son of Abinoam was gone up to mount Tabor.\n13. And Sisera gathered together all his chariots,evennine hundred chariots of iron, and all the people thatwerewith him, from Harosheth of the Gentiles unto the river of Kishon.\n14. And Deborah said unto Barak, Up; for thisisthe day in which theLordhath delivered Sisera into thine hand: is not theLordgone outbeforethee? So Barak went down from mount Tabor, and ten thousand men after him.\n15. And theLorddiscomfitedSisera, and allhischariots, and allhishost, with the edge of the sword before Barak; so that Sisera lighted down offhischariot, and fled away on his feet.\n16. But Barak pursued after the chariots, and after the host, unto Harosheth of the Gentiles: and all the host of Sisera fell upon the edge of the sword;andthere was not man left.\n17. Howbeit Sisera fled away on his feet to the tent of Jael the wife of Heber the Kenite: forthere waspeace between Jabin the king of Hazor and the house of Heber the Kenite.\n18. And Jael went out to meet Sisera, and said unto him, Turn in, my lord, turn in to me; fear not. And when he had turned in unto her into the tent, she covered him with amantle.\n19. And he said unto her, Give me, I pray thee, little water to drink; for I am thirsty. And she opened bottle of milk, and gave him drink, and covered him.\n20. Again he said unto her, Stand in the door of the tent, and it shall be, when any man doth come and inquire of thee, and say, Is there any man here? that thou shalt say, No.\n21. Then Jael Hebers wife took nail of the tent, and took an hammer in her hand, and went softly unto him, and smote thenailinto histemples, and fastened it into the ground: for he was fast asleep and weary. So he died.\n22. And, behold, as Barak pursued Sisera, Jael came out to meet him, and said unto him, Come, and I will shew thee the man whom thou seekest. And when he came into hertent,behold, Sisera lay dead, and the nailwasin his temples.\n23. So God subdued on that day Jabin the king of Canaan before the children of Israel.\n24. And the hand of the children of Israel prospered, and prevailed against Jabin the king of Canaan, until they had destroyed Jabin king of Canaan.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";6–8;13–16",
      "content": "We all know what it’s like to sin, feel bad about it, and then repent and resolve to change our ways. But too often we forget our earlier resolve, and, when temptation comes, we find ourselves committing the same sin. This pattern appears frequently in the book of Judges. Influenced by the beliefs and worship practices of the Canaanites—whom they were supposed to drive out of the land—the Israelites broke their covenants with the Lord and turned away from worshipping Him. As a result, they lost His protection and fell into captivity. And yet each time this happened, the Lord gave His covenant people the chance to repent and raised up a deliverer, a military leader called a “judge.” Not all of the judges in the book of Judges were righteous, but some of them exercised great faith in delivering the children of Israel and restoring them to their covenant relationship with the Lord. These stories remind us that no matter what has led us away from Jesus Christ, He is the Redeemer of Israel and is always willing to deliver us and welcome us back as we return to Him.\nFor an overview of the book of Judges, see “\nJudges, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nJudges 2:1–19\n;\n3:5–12\nThe Lord forgives as often as I repent.\nThe book of Judges can be both a warning and an encouragement. Look for this warning and encouragement as you read\nJudges 2:1–19\n;\n3:5–12\n. How do you feel the warning and encouragement apply to you?\nFor example, if\nJudges 2:19\nwere about you and your temptations rather than about the ancient Israelites, what might it say? If\nJudges 3:9\nwere about what the Lord had done to deliver you, what might it say?\nConsider reading the question and answer on\npage 9\nof\nFor the Strength of Youth: A Guide for Making Choices\n. How do you feel this applies to the Israelites’ experience in the book of Judges? What does this teach you about Jesus Christ?\nJudges 4:1–15\nI can inspire others to have faith in the Lord.\nSometimes the faith of one person can inspire faith in many others. In\nJudges 4\n, that one person was Deborah. Read about her in\nJudges 4:1–15\n, and note the influence she had on people around her. Here are some questions to help you consider how her experience might apply to your life:\nHow would you describe the conditions the Israelites were in at the time? (see\nverses 1–3\n). What similarities do you see to conditions today—in individuals and society?\nWhat words or actions of Deborah show you that she had faith in the Lord? How did her faith influence others? What else impresses you about her?\nWhat do you think Deborah meant by her question in\nverse 14\n: “Is not the Lord gone out before thee?” How does the Lord “go out before” you? (see\nDoctrine and Covenants 84:87–88\n).\nPonder how your faith in Jesus Christ could bless others the way Deborah’s faith blessed Barak and the other Israelites. To help you think about this, you might study Elder Neil L. Andersen’s message “\nWe Talk of Christ\n” (\nEnsign\nor\nLiahona\n, Nov. 2020, 88–91). Search the message for (1) reasons to speak more openly about the Savior and (2) ways to do it.\nThen you might make a list of things you know about Jesus Christ—from the scriptures, from words of living prophets, and from your personal experience. Who needs to know this? How will you share it?\nSee also\nMatthew 5:14–16\n;\n1 Peter 3:15\n; “\nEach Life That Touches Ours for Good\n,”\nHymns\n, no. 293.\nInvite sharing.\nIf you are a teacher—at home or at church—“give learners opportunities to share with each other what they are learning about the Savior and His gospel. Doing this will help them internalize the truths they are taught and express them” (\nTeaching in the Savior’s Way\n,\n26\n). For example, when studying\nJudges 4\ntogether, you could give each learner something specific to look for in the chapter and then invite them to share with each other what they find.\nJudges 6–8\nThe Lord can work miracles when I trust in His ways.\nAs you read\nJudges 6–8\n, make note of instances where the Lord asked Gideon to believe something that might have seemed unlikely. Has He ever asked something similar of you?\nWhat do you feel the Lord is trying to teach you with this account? How have you seen the Lord do His work in ways that seemed unlikely?\nJudges 13–16\nGod strengthens me as I am faithful to my covenants.\nSamson lost both his physical strength and his spiritual strength because he violated his covenants with God, including those that applied specifically to Nazarites (for information about the Nazarites, see\nNumbers 6:1–6\n;\nJudges 13:7\n). As you read about Samson in\nJudges 13–16\n, note verses that show that the Lord was with Samson, as well as verses showing that Samson was not fully committed to the Lord.\nYou might also ponder the covenants you have made with the Lord. How have these covenants brought His power into your life? What do you learn from Samson’s experiences that inspires you to stay true to your covenants with God?\nSister Ann M. Dibb taught: “Samson was born with great potential. His mother was promised, ‘He shall begin to deliver Israel out of the hand of the Philistines’ [\nJudges 13:5\n]. But as Samson grew, he looked more to the world’s temptations than to God’s direction. He made choices because they ‘pleaseth [him] well’ [\nJudges 14:3\n] rather than because those choices were right. Repeatedly, the scriptures use the phrase ‘and he went down’ [\nJudges 14:7\n] as they tell of Samson’s journeys, actions, and choices. Instead of arising and shining forth to fulfill his great potential, Samson was overcome by the world, lost his God-given power, and died a tragic, early death” (“\nArise and Shine Forth\n,”\nEnsign\nor\nLiahona\n, May 2012, 118).\nSee also Dallin H. Oaks, “\nCovenants and Responsibilities\n,”\nLiahona\n, May 2024, 93–96; Ulisses Soares, “\nCovenant Confidence through Jesus Christ\n,”\nLiahona\n, May 2024, 17–21.\nStudy Helps\nWhat were some of the false gods of the Canaanites?\nWhat does it mean that Deborah was a prophetess?\nWas it appropriate for Gideon to ask God for a sign?\nClick to see more.\nIdeas for Teaching Children\nBecause this Sunday is the first Sunday of the month, Primary teachers are encouraged to use learning activities in “Appendix B: Preparing Children for a Lifetime on God’s Covenant Path.”\nJudges 3:7–9, 12–15\nJesus Christ is my Deliverer.\nJudges 3\ndescribes a pattern that teaches about the Savior’s power to deliver us from sin. To help your children identify this pattern, you could write down these phrases: “did evil,” “cried unto the Lord,” and “raised up a deliverer.” Then your children could look for these phrases in\nJudges 3:7–9\nand\nJudges 3:12–15\n. What do we learn about the Lord from this pattern?\nTo emphasize that Jesus Christ is our Deliverer, you could gather several pictures of people, including a picture of Jesus, and place them face down. Let your children take turns flipping over the pictures. When they find the picture of Jesus, sing a song about Him, such as “\nHe Sent His Son\n” (\nChildren’s Songbook\n, 34–35), and tell your children about how He has delivered you.\nJudges 4:1–15\nI can inspire others to have faith in the Lord.\nYou can use “\nDeborah the Prophetess\n” in\nOld Testament Stories\n, 92–95, to tell your children the story in\nJudges 4\n. Share with each other what you admire about Deborah. How did her faith in the Lord bless the people around her? What can we do to help others have more faith in Jesus Christ?\n2:9\nDeborah the Prophetess\nJudges 7:1–21\nThe Lord can use small things to do great work.\nUse\nJudges 7:4–7\n, this week’s activity page, or “\nThe Army of Gideon\n” in\nOld Testament Stories\n, 96–99, to teach your children about how the Lord made Israel’s army smaller. Why did the Lord want Gideon’s army to be so small? (see\nJudges 7:2\n).\n2:37\nThe Army of Gideon\nYour children could draw pictures of a sword, shield, trumpet, lamp, and pitcher and talk about which of these objects they would want in a battle. Then they could read\nJudges 7:16\nto learn what the Lord told Gideon’s army to use. As you read about the battle in\nJudges 7:19–21\n, share with each other what you learn about the Lord from this story.\nSamson Puts Down the Pillars\n, by James Tissot and others\nJudges 13:5\nKeeping covenants gives me strength.\nSamson’s covenants with the Lord gave him physical strength, just as our covenants give us spiritual strength. Your children might enjoy doing some physical exercises and discussing how those exercises can help make our bodies strong. How does keeping our covenants make our spirits strong? (see\nMosiah 18:8–10\n;\nDoctrine and Covenants 20:77, 79\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 22: Lesson 58: Lesson 58—Deuteronomy 6:1–6This lesson can help students understand how they can show their love for God.; Lesson 59: Lesson 59—Deuteronomy 6:6-25; 7:1–26; 8:1–20This lesson is intended to help students increase their desire to remember what God has done for them....",
      "content": "\n--- Lesson 58 ---\nAfter guiding the Israelites for 40 years in the wilderness, Moses shared his final counsel with them before the Lord commanded Joshua to lead them into the promised land. An important part of Moses’s prophetic message was to “love the Lord thy God with all thine heart” ( Deuteronomy 6:5 ). This lesson can help students understand how they can show their love for God. Student preparation: Invite students to ask a parent, guardian, or Church leader to share some of their favorite nonverbal ways of showing that they love someone. It may be helpful to tell students that the lesson will focus on ways we can show our love for God. Possible Learning Activities Showing love Consider using the following activity to help students brainstorm various ways they can show love. In your study journal, write the name of a family member you love. In 60 seconds, list under their name as many unique ways to show your love for them as you can. Ask a few volunteers to share the name they wrote and some ideas they had for showing love. When students are done sharing, invite them to read Deuteronomy 6:5 and share what they learn. (Students may share in their own words a truth such as: God commands us to love Him with all our heart, soul, and might .) You might suggest that students link or cross-reference this verse to the doctrinal mastery passage Matthew 22:36–39 , where Jesus Christ emphasized its importance. Consider writing Heavenly Father and Jesus Christ in the middle of the board. Give students two minutes to come to the board and list different ways we can express our love for Them. Then encourage students to share which of their classmates’ ideas stand out to them and why. Ponder the following questions. What are your true feelings for Heavenly Father and Jesus Christ? Why do you feel that way? What are some of the ways you show Them how you feel? As you study the book of Deuteronomy this week, pay attention to impressions from the Holy Ghost. His influence can deepen your love for Heavenly Father and Jesus Christ, and teach you ways you can express that love to Them. God loves us with all His heart To help students learn from God’s example, they could be invited to link or cross-reference Deuteronomy 6:5 to 1 John 4:19 . After reading verse 19, you might ask students to share ways God has shown His love for everyone or for them personally. The following statement can help students reflect on God’s perfect example of loving us with all His heart. Consider displaying it and inviting a student to read it aloud. Then continue to display it while students discuss their answers to the questions below. President Jeffrey R. Holland of the Quorum of the Twelve Apostles helped us better understand the true character of God. 19:24 The first great commandment of all eternity is to love God with all of our heart, might, mind, and strength—that’s the first great commandment. But the first great truth of all eternity is that God loves us with all of His heart, might, mind, and strength. That love is the foundation stone of eternity, and it should be the foundation stone of our daily life. Indeed it is only with that reassurance burning in our soul that we can have the confidence to keep trying to improve, keep seeking forgiveness for our sins, and keep extending that grace to our neighbor. (“ Tomorrow the Lord Will Do Wonders among You ,” Ensign or Liahona , May 2016, 127) What do you learn from President Holland’s statement that could motivate us to show our love for God? What are some steps someone could take toward loving God “with all [their] might” if they don’t feel strong enough to do it yet? Obedience is an expression of love To give students a brief context of the book of Deuteronomy, consider displaying the image of Moses from the beginning of the lesson as you summarize or invite a student to read aloud the following paragraph. After serving as a prophet of God for 40 years, Moses instructed the Israelites to make camp on the border of the promised land. Joshua would soon lead them across the border (see Deuteronomy 31:23 ). Moses was able to view the promised land from a mountaintop before the Lord translated him, or took Moses unto Himself without Moses dying (see Deuteronomy 34:1–6 ; Alma 45:18–19 ). The book of Deuteronomy contains Moses’s final counsel to the people, including inspired counsel about loving God and obeying His commandments. Read the following passages, looking for similarities between what Moses taught his people and what Jesus taught His disciples about how to show our love for God. Deuteronomy 6:1–6 ; 30:16 John 14:15, 21–24 What did you learn about showing our love for God? If a student already listed “keeping the commandments” on the board earlier as one way to show our love for God, consider pointing it out. If they didn’t, consider adding it to the board. Why do you think keeping the commandments is a meaningful way to show Heavenly Father and Jesus Christ that we love Them? Loving God in our everyday lives It may be helpful for students to discuss realistic ways they can express their love for God in their lives. One way to do this is to show the video “ If We Love Him ” (3:57) ( ChurchofJesusChrist.org ). Invite students to pay attention to both the lyrics of the song and what they see youth in the video doing to show their love for God. Then invite students to share what they learned about ways to show our love for God. 3:57 Another option could be to give small groups of students a piece of paper with one of the common settings listed below written on it. Display the following instructions and questions for groups to complete and discuss. (Depending on available time, groups could exchange papers with other groups and repeat the activity multiple times.) Select one of these common settings: at work, at school, at seminary, at church, at home, at practice, with friends, on social media . How would you answer the following questions from your experience with this setting in mind? In this setting, how have you seen someone show their love for God? What are some appropriate ways to express your love for God in this setting? Is there anything that might make expressing love for God difficult in this setting? If so, how could we overcome it? Conclusion To conclude, you may want to express your love for Heavenly Father and Jesus Christ. In addition to your testimony, you may also want to share the following statement and invite students to express their feelings for Heavenly Father and Jesus Christ in their study journal. Encourage them to act on any impressions they may have received from the Spirit during the lesson. Elder K. Brett Nattress of the Seventy asked some important questions for us to ponder personally. I testify that our Heavenly Father always remembers us and that He loves us perfectly. My question is this: Do we remember Him? And do we love Him? (“ Have I Truly Been Forgiven? ,” Liahona , May 2023, 68–69)\n\n\n--- Lesson 59 ---\nAfter years of being guided and protected by God through the wilderness, the Israelites were about to settle in their promised land. Though arriving at their new home would be a welcomed change, comfort could also tempt them to forget God. Through Moses, the Lord taught the Israelites how important it would be for them to remember what He had done for them. This lesson is intended to help students increase their desire to remember what God has done for them. Student preparation: Invite students to think of five things they feel the Lord has done for them in the past week. Invite them to reflect on how noticing what the Lord is doing for them can bless their life. Possible Learning Activities It can be easy to “forget the Lord” Consider beginning class by discussing the temptation to forget God when things are going well in our lives. One way to do this is to show pictures such as the following and ask the questions below. In which of these situations might people be more likely to remember and rely on God? Why? Why might it be more difficult to remember God and rely on Him when life is going well for us? Why is it important to remember God in all circumstances? Invite students to finish the following sentences in their study journal. Thinking specifically about your relationship with Heavenly Father and Jesus Christ, complete the following statements: When things are going well in my life, I tend to . When things are going poorly in my life, I tend to . Encourage students to seek the Spirit to help them better understand the value of remembering Heavenly Father and Jesus Christ and what They have done for them. Remembering the Lord Consider reading or summarizing the following paragraph to help students understand what was happening in the Israelites’ lives in the book of Deuteronomy. After leading the children of Israel for 40 years in the wilderness, the Lord was ready to bring them over the Jordan River into the promised land. Since leaving Egypt, the Israelites had depended on the Lord for food, water, and protection. The Israelites had now become a mighty army, and the promised land had many natural resources that would make their lives much more comfortable. Consider inviting students to read the following verses and discuss the questions below with partners or in small groups. Read Deuteronomy 4:7–9 ; 6:10–13 ; and 8:7–14 , looking for a repeated warning Moses gave the Israelites. Why do you think Moses was worried about this? Why do you think Moses’s counsel is still needed by members of the Savior’s Church today? If needed, help students see that Moses was worried that prosperity would cause the Israelites to forget God. Display the following statement for students to refer to as they identify bolded truths. Elder Dale G. Renlund of the Quorum of the Twelve Apostles explained why Heavenly Father wants us to remember Him and His Son. Our Heavenly Father wants us to recall His and His Beloved Son’s goodness, not for Their own gratification but for the influence such remembrance has on us. By considering Their kindness, our perspective and understanding are enlarged. By reflecting on Their compassion, we become more humble, prayerful, and steadfast. … Every time we use, benefit from, or even think of these gifts, we ought to consider the sacrifice, generosity, and compassion of the givers. Reverence for the givers does more than just make us grateful. Reflecting on Their gifts can and should transform us. (“ Consider the Goodness and Greatness of God ,” Ensign or Liahona , May 2020, 41–42) What stands out to you from Elder Renlund’s statement? Based on what stands out to them, invite students to complete the following statement in their journals: By remembering the goodness of Heavenly Father and Jesus Christ, … Students might come up with several ways to complete the statement. Some examples include: … our perspective and understanding are enlarged. … we become more humble, prayerful, and steadfast. … we can be transformed (or changed). You may want to list students’ answers on the board. Make sure students understand the meaning of these blessings. One way to do this is to ask what it looks like to receive these blessings. For example, what might it look like to be prayerful or to be more steadfast? Why do you think remembering the Lord leads to such significant blessings? How have you experienced any of the truths that Elder Renlund shared? Remembering the Lord can help us face challenges To obtain the promised land, the Israelites faced a challenge. The Lord told them they would have to defeat mightier nations ( Deuteronomy 7:1 ). Knowing that the nations were mightier than they were might have made many of the Israelites nervous. To help students relate the scriptures to their own lives, consider asking them to list on the board situations that they are facing or will face that they know they need the Lord’s help with. Read Deuteronomy 7:17–21 ; 8:2–4, 15 to see what the Lord wanted the Israelites to remember as they dealt with future challenges. How could remembering what the Lord has done in the past be helpful when facing challenges in the future? You might invite students to list situations when they know the Lord helped them or others in the past. If you invited students to do the student preparation, this could be a good opportunity to ask them what the Lord has done for them in the past week. Ask students to share how remembering what the Lord has done in the past can help them as they face current and future difficulties. How we can remember the Lord To help students feel the value of remembering Heavenly Father and Jesus Christ and to see one way to help us remember Them, consider showing the video “ O Remember, Remember ” (1:28) found on Gospel Library. You could invite students to look for what President Henry B. Eyring of the First Presidency did to see the Lord’s hand and the results that followed. 1:28 What effect might it have on you to see God’s hand in your daily life? To conclude, consider inviting students to write one or two ways they could better remember Heavenly Father and Jesus Christ and invite Their blessings into their lives.\n\n\n--- Lesson 60 ---\nThe Savior’s commandments to the Israelites in Deuteronomy include forgiving debtors, releasing people in servitude, and relieving the burden of the poor. As His people, we too have a covenant responsibility to freely share what the Savior has given us to relieve the burden of the poor. This lesson can help students feel a greater desire to follow the Savior’s commandment to share what He has given them. Student preparation: Invite students to prayerfully sing or study the words to the hymn “ Because I Have Been Given Much ” ( Hymns , no. 219) or Matthew 25:31–40 . Students could ask Heavenly Father to help them see ways they can share with others what He has given them. Possible Learning Activities True followers of Jesus Christ To begin class, consider displaying a favorite picture of Jesus Christ. You could write the following incomplete statement from President Nelson on the board. You may want to point out that there could be many correct ways to finish the statement. President Russell M. Nelson taught: One of the easiest ways to identify a true follower of Jesus Christ is . (“ Peacemakers Needed ,” Liahona , May 2023, 98) What are some ways we could complete President Nelson’s statement? After students respond, invite them to share why they feel their response completes the statement. You could compliment and validate what students share. Then display President Nelson’s completed statement. One of the easiest ways to identify a true follower of Jesus Christ is how compassionately that person treats other people. (“ Peacemakers Needed ,” Liahona , May 2023, 98) Why is this a good way to identify true followers of Jesus Christ? What are some ways disciples of Jesus Christ could treat people compassionately? To help students assess how well they currently treat others, you might share some or all of the following statements and invite students to ponder how well each statement applies to them. The way I treat others shows that I am a follower of Jesus Christ. I have compassion for others and want to do what I can to help them. I feel willing to share what the Lord has given me with others. As you study today, seek the guidance of the Holy Ghost to help you feel the importance of following the Savior’s commandment in the way you treat other people. Caring for people in need Before students read the following passage, you might explain that as part of the instructions given in Deuteronomy, the Lord commanded that all debts were to be forgiven every seventh year. Read Deuteronomy 15:7–11 , looking for how the Lord wants us to treat people around us. What did you discover? As students share, help them recognize a truth such as the Lord commands us to share the blessings He has given us. It might be helpful to use a simple object lesson to help students understand what it means to “open thine hand wide” to others ( verses 8 and 11 ). To do this you might have a bowl of dry cereal, beans, or small candy at the front of the room. Invite two students to demonstrate this phrase. One student could grab a handful of the item and hold it over the other student’s hands. Ask the student to open their hand “a little,” then “a little more,” allowing small amounts of food to fall into the other student’s hands. Finally, invite students to read verse 8 again and have the student demonstrating the object lesson “open thine hand wide.” What do you think it means that we are to open our hands wide in caring for the poor? What could we learn about the Savior from His commandment? How does He open His hand wide to us? In what circumstances might we be tempted to shut our hand from the poor? Before students read the following passage, you might explain that the Lord also commanded that every seventh year any servant who desired freedom was to be released from bondage. Read Deuteronomy 15:12–15 , looking for how the Lord told the Israelites they should treat a servant who desired to be freed from bondage. From what you’ve learned about the Israelites, how had they been in bondage physically and spiritually? How might someone be in spiritual bondage today? How could remembering how the Savior has delivered us from spiritual and physical bondage affect how we treat others? “Are we not all beggars?” Invite students to consider what it might look like for a teenager to be “poor” not only financially but also spiritually, physically, emotionally, and socially. How could we open our hand wide to someone in need in each of these ways? Use the scripture study tools to find a scripture passage or statement from a Church leader that could help someone follow the Savior’s commandment to care for the poor If students need additional assistance, you might suggest passages such as Luke 6:30–38 ; Mosiah 4:16–27 ; Doctrine and Covenants 104:15–18 ; Moses 7:18 . Students could also search Gospel Library for words like “poor.” After students have had time to find a scripture or statement, invite them to share what they found with a partner or in a small group. Students could also discuss the following questions. How could this scripture or statement apply to how we care for someone who is “poor” financially, spiritually, physically, emotionally, or socially? When have you had an experience being blessed by the generosity of others? To help students increase their desire to give generously to others, you could show the video “ The Coat ” (2:07) from Gospel Library. You might explain to students that this story depicts a childhood experience of President Heber J. Grant. Consider pausing the video after young Heber first sees the little boy with no coat. Invite students to review Deuteronomy 15:7–8 and share things Heber might do if he were to “open his hand wide” and how the Lord might bless him for his generosity. Then watch the remainder of the video. 2:8 Increase our desire to share with others Read Matthew 25:31–40 , looking for how the Savior feels about our efforts to care for people in need. Consider inviting students to read the words or sing the hymn “ Because I Have Been Given Much ” ( Hymns , no. 219). Invite them to look for words and phrases in the lyrics that help them feel the importance of the Savior’s commandment to share generously with others. Before sharing the following questions, you might remind students of the statement from President Nelson from the beginning of the lesson. Reminding students of this statement could help them connect the truths they have learned and felt today to the words of prophets. (For additional training on invitations that help connect students to the words of prophets, see “ Teach from the scriptures and the words of latter-day prophets ” in Teacher Development Skills .) Students could answer the following questions in their study journals. What have you learned or felt today that has helped increase your desire to be a true follower of Jesus Christ by giving generously to others? What have you felt impressed to do? Consider sharing a time when your life has been blessed by the generosity of others who sought to be true followers of Jesus Christ. You might invite students to seek Heavenly Father’s guidance to find someone to serve and how to do it.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Judges 2",
      "content": "1. And an angel of theLordcame up from Gilgal to Bochim, and said, I made you to go up out of Egypt, and have brought you unto the land which I sware unto your fathers; and I said, I will neverbreakmycovenantwith you.\n2. And ye shall make noleaguewith the inhabitants of this land; ye shall throw down their altars: but ye have notobeyedmy voice: why have ye done this?\n3. Wherefore I also said, I will not drive them out from before you; but they shall beas thornsin your sides, and their gods shall be asnareunto you.\n4. And it came to pass, when the angel of theLordspake these words unto all the children of Israel, that the people lifted up their voice, and wept.\n5. And they called the name of that place Bochim: and they sacrificed there unto theLord.\n6. And when Joshua had let the people go, the children of Israel went every man unto his inheritance to possess the land.\n7. And the peopleservedtheLordall the days of Joshua, and all the days of the elders that outlived Joshua, who had seen all the great works of theLord, that he did for Israel.\n8. And Joshua the son ofNun, the servant of theLord, died,beingan hundred and ten years old.\n9. And they buried him in the border of his inheritance in Timnath-heres, in the mount of Ephraim, on the north side of the hill Gaash.\n10. And also all that generation were gathered unto their fathers: and there arose another generation after them, whichknew nottheLord, nor yet the works which he had done for Israel.\n11. And the children of Israel did evil in the sight of theLord, and served Baalim:\n12. And they forsook theLordGod of their fathers, which brought them out of the land of Egypt, and followed other gods, of the gods of the people thatwereround about them, and bowed themselves unto them, and provoked theLordtoanger.\n13. And they forsook theLord, and servedBaaland Ashtaroth.\n14. And theangerof theLordwas hot against Israel, and he delivered them into the hands ofspoilersthat spoiled them, and he sold them into the hands of their enemies round about, so that they could not any longer stand before their enemies.\n15. Whithersoever they went out, thehandof theLordwas against them for evil, as theLordhad said, and as theLordhad sworn unto them: and they were greatly distressed.\n16. Nevertheless theLordraised upjudges, whichdeliveredthem out of the hand of those that spoiled them.\n17. And yet they would not hearken unto their judges, but they went awhoringafter othergods, and bowed themselves unto them: they turnedquicklyout of the way which their fathers walked in, obeying the commandments of theLord;butthey did not so.\n18. And when theLordraised them up judges, then theLordwas with the judge, and delivered them out of the hand of their enemies all the days of the judge:for it repentedtheLordbecause of their groanings by reason of them that oppressed them andvexedthem.\n19. And it came to pass, when the judge was dead,thatthey returned, and corruptedthemselvesmore than theirfathers, in following other gods to serve them, and to bow down unto them; they ceased not from their own doings, nor from theirstubbornway.\n20. And the anger of theLordwas hot against Israel; and he said, Because that this people hath transgressed my covenant which I commanded their fathers, and have not hearkened unto my voice;\n21. I also will not henceforth drive out any from before them of the nations which Joshua left when he died:\n22. That through them I mayproveIsrael, whether they will keep the way of theLordtowalktherein, as their fathers did keepit,or not.\n23. Therefore theLordleft those nations, without driving them out hastily; neither delivered he them into the hand of Joshua.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Judges 3",
      "content": "1. Now thesearethe nations which theLordleft, to prove Israel by them,evenas manyof Israelas had not known all the wars of Canaan;\n2. Only that the generations of the children of Israel might know, to teach them war, at the least such as before knew nothing thereof;\n3. Namely,fivelords of the Philistines, and all the Canaanites, and the Sidonians, and the Hivites that dwelt in mount Lebanon, frommount Baal-hermon unto the entering in of Hamath.\n4. And they were to prove Israel by them, to know whether they would hearken unto the commandments of theLord, which he commanded their fathers by the hand of Moses.\n5. And the children of Israeldweltamong the Canaanites, Hittites, and Amorites, and Perizzites, and Hivites, and Jebusites:\n6. And they took their daughters to be their wives, andgavetheir daughters to their sons, and served their gods.\n7. And the children of Israel didevilin the sight of theLord, and forgat theLordtheir God, andservedBaalimand thegroves.\n8. Therefore the anger of theLordwas hot against Israel, and he sold them into the hand of Chushan-rishathaim king of Mesopotamia: and the children of Israel served Chushan-rishathaim eight years.\n9. And when the children of Israel cried unto theLord, theLordraised up adelivererto the children of Israel, who delivered them,evenOthniel the son of Kenaz, Calebs younger brother.\n10. And theSpiritof theLordcame upon him, and he judged Israel, and went out to war: and theLorddelivered Chushan-rishathaim king of Mesopotamia into his hand; and his hand prevailed againstChushan-rishathaim.\n11. And the land had rest forty years. And Othniel the son of Kenaz died.\n12. And the children of Israel did evil again in the sight of theLord: and theLordstrengthened Eglon the king of Moab against Israel, because they had done evil in the sight of theLord.\n13. And he gathered unto him the children of Ammon and Amalek, and went and smote Israel, and possessed the city of palm trees.\n14. So the children of Israel served Eglon the king of Moab eighteen years.\n15. But when the children of Israel cried unto theLord, theLordraised them up deliverer, Ehud the son of Gera, Benjamite, man lefthanded: and by him the children of Israel sent present unto Eglon the king of Moab.\n16. But Ehud made him dagger which had two edges, of cubit length; and he did gird it under his raiment upon his right thigh.\n17. And he brought the present unto Eglon king of Moab: and Eglonwasa very fat man.\n18. And when he had made an end to offer the present, he sent away the people that bare the present.\n19. But he himself turned again from the quarries thatwereby Gilgal, and said, I have secreterrandunto thee, O king: who said, Keep silence. And all that stood by him went out from him.\n20. And Ehud came unto him; and he was sitting in summer parlour, which he had for himself alone. And Ehud said, I have message from God unto thee. And he arose out ofhisseat.\n21. And Ehud put forth his left hand, and took the dagger from his right thigh, and thrust it into his belly:\n22. And thehaftalso went in after the blade; and the fat closed upon the blade, so that he could not draw the dagger out of his belly; and the dirt came out.\n23. Then Ehud went forth through the porch, and shut the doors of theparlourupon him, and locked them.\n24. When he was gone out, his servants came; and when they saw that, behold, the doors of the parlourwerelocked, they said, Surely he covereth his feet in his summer chamber.\n25. And they tarried till they were ashamed: and, behold, he opened not the doors of the parlour; therefore they took key, and openedthem:and, behold, their lordwasfallen down dead on the earth.\n26. And Ehud escaped while they tarried, and passed beyond the quarries, and escaped unto Seirath.\n27. And it came to pass, when he was come, that he blew trumpet in the mountain of Ephraim, and the children of Israel went down with him from the mount, and he before them.\n28. And he said unto them, Follow after me: for theLordhath delivered your enemies the Moabites into your hand. And they went down after him, and took the fords of Jordan toward Moab, and suffered not man to pass over.\n29. And they slew of Moab at that time about ten thousand men, alllusty, and all men of valour; and there escaped not man.\n30. SoMoabwassubduedthat day under the hand of Israel. And the land had restfourscoreyears.\n31. And after him was Shamgar the son of Anath, which slew of the Philistines six hundred men with an ox goad: and he also delivered Israel.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Judges 4",
      "content": "1. And the children of Israel again didevilin the sight of theLord, when Ehud was dead.\n2. And theLordsoldthem into the hand of Jabin king of Canaan, that reigned in Hazor; the captain of whose hostwasSisera, which dwelt in Harosheth of the Gentiles.\n3. And the children of Israel cried unto theLord: for he had nine hundredchariotsof iron; and twenty years hemightilyoppressedthe children of Israel.\n4. And Deborah, aprophetess, the wife of Lapidoth, she judged Israel at that time.\n5. And shedweltunder the palm tree of Deborah between Ramah and Beth-el in mount Ephraim: and the children of Israel came up to her for judgment.\n6. And she sent and calledBarakthe son of Abinoam out of Kedesh-naphtali, and said unto him, Hath not theLordGod of Israel commanded,saying,Go and draw toward mount Tabor, and take with thee ten thousand men of the children of Naphtali and of the children of Zebulun?\n7. And I will draw unto thee to the river Kishon Sisera, the captain of Jabins army, with his chariots and his multitude; and I will deliver him into thine hand.\n8. And Barak said unto her, If thou wilt go with me, then I will go: but if thou wilt not go with me,thenI will not go.\n9. And she said, I will surely go with thee: notwithstanding the journey that thou takest shall not be for thine honour; for theLordshall sell Sisera into the hand of woman. And Deborah arose, and went with Barak to Kedesh.\n10. And Barak called Zebulun and Naphtali to Kedesh; and he went up with ten thousand men at his feet: and Deborah went up with him.\n11. Now Heber the Kenite,which wasof the children of Hobab the father in law of Moses, had severed himself from the Kenites, and pitchedhis tent unto the plain of Zaanaim, whichisby Kedesh.\n12. And they shewed Sisera that Barak the son of Abinoam was gone up to mount Tabor.\n13. And Sisera gathered together all his chariots,evennine hundred chariots of iron, and all the people thatwerewith him, from Harosheth of the Gentiles unto the river of Kishon.\n14. And Deborah said unto Barak, Up; for thisisthe day in which theLordhath delivered Sisera into thine hand: is not theLordgone outbeforethee? So Barak went down from mount Tabor, and ten thousand men after him.\n15. And theLorddiscomfitedSisera, and allhischariots, and allhishost, with the edge of the sword before Barak; so that Sisera lighted down offhischariot, and fled away on his feet.\n16. But Barak pursued after the chariots, and after the host, unto Harosheth of the Gentiles: and all the host of Sisera fell upon the edge of the sword;andthere was not man left.\n17. Howbeit Sisera fled away on his feet to the tent of Jael the wife of Heber the Kenite: forthere waspeace between Jabin the king of Hazor and the house of Heber the Kenite.\n18. And Jael went out to meet Sisera, and said unto him, Turn in, my lord, turn in to me; fear not. And when he had turned in unto her into the tent, she covered him with amantle.\n19. And he said unto her, Give me, I pray thee, little water to drink; for I am thirsty. And she opened bottle of milk, and gave him drink, and covered him.\n20. Again he said unto her, Stand in the door of the tent, and it shall be, when any man doth come and inquire of thee, and say, Is there any man here? that thou shalt say, No.\n21. Then Jael Hebers wife took nail of the tent, and took an hammer in her hand, and went softly unto him, and smote thenailinto histemples, and fastened it into the ground: for he was fast asleep and weary. So he died.\n22. And, behold, as Barak pursued Sisera, Jael came out to meet him, and said unto him, Come, and I will shew thee the man whom thou seekest. And when he came into hertent,behold, Sisera lay dead, and the nailwasin his temples.\n23. So God subdued on that day Jabin the king of Canaan before the children of Israel.\n24. And the hand of the children of Israel prospered, and prevailed against Jabin the king of Canaan, until they had destroyed Jabin king of Canaan.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Judges": {
      "2": {
        "verses": {
          "1": {
            "text": "And an angel of theLordcame up from Gilgal to Bochim, and said, I made you to go up out of Egypt, and have brought you unto the land which I sware unto your fathers; and I said, I will neverbreakmycovenantwith you.",
            "citation": "(Judges 2:1)"
          },
          "2": {
            "text": "And ye shall make noleaguewith the inhabitants of this land; ye shall throw down their altars: but ye have notobeyedmy voice: why have ye done this?",
            "citation": "(Judges 2:2)"
          },
          "3": {
            "text": "Wherefore I also said, I will not drive them out from before you; but they shall beas thornsin your sides, and their gods shall be asnareunto you.",
            "citation": "(Judges 2:3)"
          },
          "4": {
            "text": "And it came to pass, when the angel of theLordspake these words unto all the children of Israel, that the people lifted up their voice, and wept.",
            "citation": "(Judges 2:4)"
          },
          "5": {
            "text": "And they called the name of that place Bochim: and they sacrificed there unto theLord.",
            "citation": "(Judges 2:5)"
          },
          "6": {
            "text": "And when Joshua had let the people go, the children of Israel went every man unto his inheritance to possess the land.",
            "citation": "(Judges 2:6)"
          },
          "7": {
            "text": "And the peopleservedtheLordall the days of Joshua, and all the days of the elders that outlived Joshua, who had seen all the great works of theLord, that he did for Israel.",
            "citation": "(Judges 2:7)"
          },
          "8": {
            "text": "And Joshua the son ofNun, the servant of theLord, died,beingan hundred and ten years old.",
            "citation": "(Judges 2:8)"
          },
          "9": {
            "text": "And they buried him in the border of his inheritance in Timnath-heres, in the mount of Ephraim, on the north side of the hill Gaash.",
            "citation": "(Judges 2:9)"
          },
          "10": {
            "text": "And also all that generation were gathered unto their fathers: and there arose another generation after them, whichknew nottheLord, nor yet the works which he had done for Israel.",
            "citation": "(Judges 2:10)"
          },
          "11": {
            "text": "And the children of Israel did evil in the sight of theLord, and served Baalim:",
            "citation": "(Judges 2:11)"
          },
          "12": {
            "text": "And they forsook theLordGod of their fathers, which brought them out of the land of Egypt, and followed other gods, of the gods of the people thatwereround about them, and bowed themselves unto them, and provoked theLordtoanger.",
            "citation": "(Judges 2:12)"
          },
          "13": {
            "text": "And they forsook theLord, and servedBaaland Ashtaroth.",
            "citation": "(Judges 2:13)"
          },
          "14": {
            "text": "And theangerof theLordwas hot against Israel, and he delivered them into the hands ofspoilersthat spoiled them, and he sold them into the hands of their enemies round about, so that they could not any longer stand before their enemies.",
            "citation": "(Judges 2:14)"
          },
          "15": {
            "text": "Whithersoever they went out, thehandof theLordwas against them for evil, as theLordhad said, and as theLordhad sworn unto them: and they were greatly distressed.",
            "citation": "(Judges 2:15)"
          },
          "16": {
            "text": "Nevertheless theLordraised upjudges, whichdeliveredthem out of the hand of those that spoiled them.",
            "citation": "(Judges 2:16)"
          },
          "17": {
            "text": "And yet they would not hearken unto their judges, but they went awhoringafter othergods, and bowed themselves unto them: they turnedquicklyout of the way which their fathers walked in, obeying the commandments of theLord;butthey did not so.",
            "citation": "(Judges 2:17)"
          },
          "18": {
            "text": "And when theLordraised them up judges, then theLordwas with the judge, and delivered them out of the hand of their enemies all the days of the judge:for it repentedtheLordbecause of their groanings by reason of them that oppressed them andvexedthem.",
            "citation": "(Judges 2:18)"
          },
          "19": {
            "text": "And it came to pass, when the judge was dead,thatthey returned, and corruptedthemselvesmore than theirfathers, in following other gods to serve them, and to bow down unto them; they ceased not from their own doings, nor from theirstubbornway.",
            "citation": "(Judges 2:19)"
          },
          "20": {
            "text": "And the anger of theLordwas hot against Israel; and he said, Because that this people hath transgressed my covenant which I commanded their fathers, and have not hearkened unto my voice;",
            "citation": "(Judges 2:20)"
          },
          "21": {
            "text": "I also will not henceforth drive out any from before them of the nations which Joshua left when he died:",
            "citation": "(Judges 2:21)"
          },
          "22": {
            "text": "That through them I mayproveIsrael, whether they will keep the way of theLordtowalktherein, as their fathers did keepit,or not.",
            "citation": "(Judges 2:22)"
          },
          "23": {
            "text": "Therefore theLordleft those nations, without driving them out hastily; neither delivered he them into the hand of Joshua.",
            "citation": "(Judges 2:23)"
          }
        }
      },
      "3": {
        "verses": {
          "1": {
            "text": "Now thesearethe nations which theLordleft, to prove Israel by them,evenas manyof Israelas had not known all the wars of Canaan;",
            "citation": "(Judges 3:1)"
          },
          "2": {
            "text": "Only that the generations of the children of Israel might know, to teach them war, at the least such as before knew nothing thereof;",
            "citation": "(Judges 3:2)"
          },
          "3": {
            "text": "Namely,fivelords of the Philistines, and all the Canaanites, and the Sidonians, and the Hivites that dwelt in mount Lebanon, frommount Baal-hermon unto the entering in of Hamath.",
            "citation": "(Judges 3:3)"
          },
          "4": {
            "text": "And they were to prove Israel by them, to know whether they would hearken unto the commandments of theLord, which he commanded their fathers by the hand of Moses.",
            "citation": "(Judges 3:4)"
          },
          "5": {
            "text": "And the children of Israeldweltamong the Canaanites, Hittites, and Amorites, and Perizzites, and Hivites, and Jebusites:",
            "citation": "(Judges 3:5)"
          },
          "6": {
            "text": "And they took their daughters to be their wives, andgavetheir daughters to their sons, and served their gods.",
            "citation": "(Judges 3:6)"
          },
          "7": {
            "text": "And the children of Israel didevilin the sight of theLord, and forgat theLordtheir God, andservedBaalimand thegroves.",
            "citation": "(Judges 3:7)"
          },
          "8": {
            "text": "Therefore the anger of theLordwas hot against Israel, and he sold them into the hand of Chushan-rishathaim king of Mesopotamia: and the children of Israel served Chushan-rishathaim eight years.",
            "citation": "(Judges 3:8)"
          },
          "9": {
            "text": "And when the children of Israel cried unto theLord, theLordraised up adelivererto the children of Israel, who delivered them,evenOthniel the son of Kenaz, Calebs younger brother.",
            "citation": "(Judges 3:9)"
          },
          "10": {
            "text": "And theSpiritof theLordcame upon him, and he judged Israel, and went out to war: and theLorddelivered Chushan-rishathaim king of Mesopotamia into his hand; and his hand prevailed againstChushan-rishathaim.",
            "citation": "(Judges 3:10)"
          },
          "11": {
            "text": "And the land had rest forty years. And Othniel the son of Kenaz died.",
            "citation": "(Judges 3:11)"
          },
          "12": {
            "text": "And the children of Israel did evil again in the sight of theLord: and theLordstrengthened Eglon the king of Moab against Israel, because they had done evil in the sight of theLord.",
            "citation": "(Judges 3:12)"
          },
          "13": {
            "text": "And he gathered unto him the children of Ammon and Amalek, and went and smote Israel, and possessed the city of palm trees.",
            "citation": "(Judges 3:13)"
          },
          "14": {
            "text": "So the children of Israel served Eglon the king of Moab eighteen years.",
            "citation": "(Judges 3:14)"
          },
          "15": {
            "text": "But when the children of Israel cried unto theLord, theLordraised them up deliverer, Ehud the son of Gera, Benjamite, man lefthanded: and by him the children of Israel sent present unto Eglon the king of Moab.",
            "citation": "(Judges 3:15)"
          },
          "16": {
            "text": "But Ehud made him dagger which had two edges, of cubit length; and he did gird it under his raiment upon his right thigh.",
            "citation": "(Judges 3:16)"
          },
          "17": {
            "text": "And he brought the present unto Eglon king of Moab: and Eglonwasa very fat man.",
            "citation": "(Judges 3:17)"
          },
          "18": {
            "text": "And when he had made an end to offer the present, he sent away the people that bare the present.",
            "citation": "(Judges 3:18)"
          },
          "19": {
            "text": "But he himself turned again from the quarries thatwereby Gilgal, and said, I have secreterrandunto thee, O king: who said, Keep silence. And all that stood by him went out from him.",
            "citation": "(Judges 3:19)"
          },
          "20": {
            "text": "And Ehud came unto him; and he was sitting in summer parlour, which he had for himself alone. And Ehud said, I have message from God unto thee. And he arose out ofhisseat.",
            "citation": "(Judges 3:20)"
          },
          "21": {
            "text": "And Ehud put forth his left hand, and took the dagger from his right thigh, and thrust it into his belly:",
            "citation": "(Judges 3:21)"
          },
          "22": {
            "text": "And thehaftalso went in after the blade; and the fat closed upon the blade, so that he could not draw the dagger out of his belly; and the dirt came out.",
            "citation": "(Judges 3:22)"
          },
          "23": {
            "text": "Then Ehud went forth through the porch, and shut the doors of theparlourupon him, and locked them.",
            "citation": "(Judges 3:23)"
          },
          "24": {
            "text": "When he was gone out, his servants came; and when they saw that, behold, the doors of the parlourwerelocked, they said, Surely he covereth his feet in his summer chamber.",
            "citation": "(Judges 3:24)"
          },
          "25": {
            "text": "And they tarried till they were ashamed: and, behold, he opened not the doors of the parlour; therefore they took key, and openedthem:and, behold, their lordwasfallen down dead on the earth.",
            "citation": "(Judges 3:25)"
          },
          "26": {
            "text": "And Ehud escaped while they tarried, and passed beyond the quarries, and escaped unto Seirath.",
            "citation": "(Judges 3:26)"
          },
          "27": {
            "text": "And it came to pass, when he was come, that he blew trumpet in the mountain of Ephraim, and the children of Israel went down with him from the mount, and he before them.",
            "citation": "(Judges 3:27)"
          },
          "28": {
            "text": "And he said unto them, Follow after me: for theLordhath delivered your enemies the Moabites into your hand. And they went down after him, and took the fords of Jordan toward Moab, and suffered not man to pass over.",
            "citation": "(Judges 3:28)"
          },
          "29": {
            "text": "And they slew of Moab at that time about ten thousand men, alllusty, and all men of valour; and there escaped not man.",
            "citation": "(Judges 3:29)"
          },
          "30": {
            "text": "SoMoabwassubduedthat day under the hand of Israel. And the land had restfourscoreyears.",
            "citation": "(Judges 3:30)"
          },
          "31": {
            "text": "And after him was Shamgar the son of Anath, which slew of the Philistines six hundred men with an ox goad: and he also delivered Israel.",
            "citation": "(Judges 3:31)"
          }
        }
      },
      "4": {
        "verses": {
          "1": {
            "text": "And the children of Israel again didevilin the sight of theLord, when Ehud was dead.",
            "citation": "(Judges 4:1)"
          },
          "2": {
            "text": "And theLordsoldthem into the hand of Jabin king of Canaan, that reigned in Hazor; the captain of whose hostwasSisera, which dwelt in Harosheth of the Gentiles.",
            "citation": "(Judges 4:2)"
          },
          "3": {
            "text": "And the children of Israel cried unto theLord: for he had nine hundredchariotsof iron; and twenty years hemightilyoppressedthe children of Israel.",
            "citation": "(Judges 4:3)"
          },
          "4": {
            "text": "And Deborah, aprophetess, the wife of Lapidoth, she judged Israel at that time.",
            "citation": "(Judges 4:4)"
          },
          "5": {
            "text": "And shedweltunder the palm tree of Deborah between Ramah and Beth-el in mount Ephraim: and the children of Israel came up to her for judgment.",
            "citation": "(Judges 4:5)"
          },
          "6": {
            "text": "And she sent and calledBarakthe son of Abinoam out of Kedesh-naphtali, and said unto him, Hath not theLordGod of Israel commanded,saying,Go and draw toward mount Tabor, and take with thee ten thousand men of the children of Naphtali and of the children of Zebulun?",
            "citation": "(Judges 4:6)"
          },
          "7": {
            "text": "And I will draw unto thee to the river Kishon Sisera, the captain of Jabins army, with his chariots and his multitude; and I will deliver him into thine hand.",
            "citation": "(Judges 4:7)"
          },
          "8": {
            "text": "And Barak said unto her, If thou wilt go with me, then I will go: but if thou wilt not go with me,thenI will not go.",
            "citation": "(Judges 4:8)"
          },
          "9": {
            "text": "And she said, I will surely go with thee: notwithstanding the journey that thou takest shall not be for thine honour; for theLordshall sell Sisera into the hand of woman. And Deborah arose, and went with Barak to Kedesh.",
            "citation": "(Judges 4:9)"
          },
          "10": {
            "text": "And Barak called Zebulun and Naphtali to Kedesh; and he went up with ten thousand men at his feet: and Deborah went up with him.",
            "citation": "(Judges 4:10)"
          },
          "11": {
            "text": "Now Heber the Kenite,which wasof the children of Hobab the father in law of Moses, had severed himself from the Kenites, and pitchedhis tent unto the plain of Zaanaim, whichisby Kedesh.",
            "citation": "(Judges 4:11)"
          },
          "12": {
            "text": "And they shewed Sisera that Barak the son of Abinoam was gone up to mount Tabor.",
            "citation": "(Judges 4:12)"
          },
          "13": {
            "text": "And Sisera gathered together all his chariots,evennine hundred chariots of iron, and all the people thatwerewith him, from Harosheth of the Gentiles unto the river of Kishon.",
            "citation": "(Judges 4:13)"
          },
          "14": {
            "text": "And Deborah said unto Barak, Up; for thisisthe day in which theLordhath delivered Sisera into thine hand: is not theLordgone outbeforethee? So Barak went down from mount Tabor, and ten thousand men after him.",
            "citation": "(Judges 4:14)"
          },
          "15": {
            "text": "And theLorddiscomfitedSisera, and allhischariots, and allhishost, with the edge of the sword before Barak; so that Sisera lighted down offhischariot, and fled away on his feet.",
            "citation": "(Judges 4:15)"
          },
          "16": {
            "text": "But Barak pursued after the chariots, and after the host, unto Harosheth of the Gentiles: and all the host of Sisera fell upon the edge of the sword;andthere was not man left.",
            "citation": "(Judges 4:16)"
          },
          "17": {
            "text": "Howbeit Sisera fled away on his feet to the tent of Jael the wife of Heber the Kenite: forthere waspeace between Jabin the king of Hazor and the house of Heber the Kenite.",
            "citation": "(Judges 4:17)"
          },
          "18": {
            "text": "And Jael went out to meet Sisera, and said unto him, Turn in, my lord, turn in to me; fear not. And when he had turned in unto her into the tent, she covered him with amantle.",
            "citation": "(Judges 4:18)"
          },
          "19": {
            "text": "And he said unto her, Give me, I pray thee, little water to drink; for I am thirsty. And she opened bottle of milk, and gave him drink, and covered him.",
            "citation": "(Judges 4:19)"
          },
          "20": {
            "text": "Again he said unto her, Stand in the door of the tent, and it shall be, when any man doth come and inquire of thee, and say, Is there any man here? that thou shalt say, No.",
            "citation": "(Judges 4:20)"
          },
          "21": {
            "text": "Then Jael Hebers wife took nail of the tent, and took an hammer in her hand, and went softly unto him, and smote thenailinto histemples, and fastened it into the ground: for he was fast asleep and weary. So he died.",
            "citation": "(Judges 4:21)"
          },
          "22": {
            "text": "And, behold, as Barak pursued Sisera, Jael came out to meet him, and said unto him, Come, and I will shew thee the man whom thou seekest. And when he came into hertent,behold, Sisera lay dead, and the nailwasin his temples.",
            "citation": "(Judges 4:22)"
          },
          "23": {
            "text": "So God subdued on that day Jabin the king of Canaan before the children of Israel.",
            "citation": "(Judges 4:23)"
          },
          "24": {
            "text": "And the hand of the children of Israel prospered, and prevailed against Jabin the king of Canaan, until they had destroyed Jabin king of Canaan.",
            "citation": "(Judges 4:24)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 41605,
  "total_sources": 5,
  "generated_at": "2025-12-14T04:01:27.383464"
}