{
  "week_number": 46,
  "date_range": "Daniel 1–7",
  "title": "",
  "primary_scriptures": [
    {
      "book": "Daniel",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Daniel",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM:  ---\nMost likely no one will threaten to throw you into a fiery furnace or a den of lions because of your faith in Jesus Christ. But none of us get through this life without a trial of faith. So we can all benefit from the examples of people like Daniel, Shadrach, Meshach, and Abed-nego, who were taken captive as young men by the mighty Babylonian Empire (see\n2 Kings 24:10–16\n). Surrounded by an unfamiliar culture with different values, they faced great temptations to abandon their beliefs and righteous traditions. Yet they remained true to their covenants. How did they do it? By doing those small and simple things God asks of all of us—praying, fasting, choosing good friends, trusting in Him, and being a light to others. Like Joseph in Egypt and Esther in Persia, Daniel and his friends in Babylon kept their faith in God, and God worked miracles that still inspire believers to this day.\nFor an overview of the book of Daniel, see “\nDaniel\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nDaniel 1\n;\n3\n;\n6\nI can trust in the Lord when my faith is tried.\nIn a sense, we all live in Babylon. We often face temptations to compromise our standards and turn away from faith in Christ. As you read\nDaniel 1\n,\n3\n, and\n6\n, note the ways in which Daniel, Shadrach, Meshach, and Abed-nego were pressured to do things they knew were wrong. How did they respond to these situations? (see\nDaniel 1:10–13\n;\n3:15–18\n;\n6:10\n). What were the results of their faith? What do you learn from these experiences that can help you trust in the Lord when you face opposition? Also consider the following questions:\nWhen have you felt pressured to do something you knew was wrong? How has the Lord blessed you for keeping His commandments?\nWhat if your faith doesn’t lead to the miracles you seek? (for an example, see\nAlma 14:8–13\n). Based on what you read in\nDaniel 3:13–18\n, how do you think Shadrach, Meshach, and Abed-nego would have answered this question? How can their example affect how you approach your trials?\nHow can your righteous choices lead others to greater faith in the Lord? (see\nDaniel 2:47\n;\n3:28–29\n). Ponder the effects that your choices may be having on others.\nSee also Dieter F. Uchtdorf, “\nBe Not Afraid, Only Believe\n,”\nEnsign\nor\nLiahona\n, Nov. 2015, 76–79.\nTry to involve everyone.\nThe Savior “inviteth … all to come unto him and partake of his goodness” (\n2 Nephi 26:33\n). If you are teaching your family or a class, ponder ways you can give everyone an opportunity to participate in some way. For example, you could give each person a passage of scripture, a section of a conference message, or a verse from a hymn to ponder and comment on. Don’t pressure anyone to participate, but give them opportunities.\nShadrach, Meshach, and Abednego in the Fiery Furnace\n, by William Maughan\nDaniel 2\nThe Church of Jesus Christ of Latter-day Saints is the kingdom of God on earth.\nThrough revelation, Daniel saw that Nebuchadnezzar’s dream foretold future worldly kingdoms, as well as the future kingdom of God, which “shall never be destroyed” (\nDaniel 2:44\n). “The Church is that prophesied latter-day kingdom,” Elder D. Todd Christofferson taught, “not created by man but set up by the God of heaven and rolling forth as a stone ‘cut out of the mountain without hands’ to fill the earth” (“\nWhy the Church\n,”\nEnsign\nor\nLiahona\n, Nov. 2015, 111). Think about God’s latter-day kingdom as you read the descriptions of the stone in\nDaniel 2:34–35, 44–45\n. What is your role in helping this prophecy come to pass?\nSee also “\nHark, All Ye Nations!\n,”\nHymns\n, no. 264; “God Gave Them Knowledge” (video),\nChurchofJesusChrist.org\n.\n13:49\nGod Gave Them Knowledge\nDaniel 2:1–30\nReceiving revelation requires spiritual preparation.\nAs you review\nDaniel 2:1–15\n, consider how you would feel if you found yourself in Daniel’s position. What did Daniel do? (see\nDaniel 2:16–18\n). What can you learn from\nDaniel 1:17\nabout how God prepared Daniel? What can you learn from Daniel’s words and actions after he received the Lord’s help? (see\nDaniel 2:19–30\n).\nDaniel 7:13–14\nJesus Christ is the Son of the Eternal Father.\nDuring the Savior’s earthly ministry, many Jews considered the title “Son of man” from\nDaniel 7:13\nto refer to the coming Messiah. What do you learn about the Messiah from\nDaniel 7:13–14\n? (see also\nMoses 6:57\n).\nThe Savior often referred to himself as “the Son of man.” Consider reviewing some examples:\nMatthew 25:31\n;\nMark 9:31\n;\n10:45\n. What is He teaching about Himself in these verses? In\nMark 14:61–64\n, Jesus used this title on the last day of His mortal life. Note the reaction from the people who heard His declaration. How does Daniel’s prophecy about the Son of Man affect your feelings about what happened to Him in\nMark 15\n?\nJust as Jesus was hated for declaring that He was “the Son of man,” you might also face persecution for declaring the truth. Compare the prophecy in\nDaniel 7:13–14\nwith the promises in\nDoctrine and Covenants 121:29, 46\n.\nSee also\nDoctrine and Covenants 49:6\n; Guide to the Scriptures, “\nSon of Man\n,” Gospel Library.\nIdeas for Teaching Children\nDaniel 1\n;\n3\n;\n6\nJesus will help me do what is right even when it’s hard.\nTo help your children learn from the inspiring stories in the book of Daniel, you could find pictures of the events in\nDaniel 1\n,\n3\n, and\n6\n(see this week’s activity page or the\nGospel Art Book\n,\nnos. 23\n,\n25\n,\n26\n). Then you could place the pictures face down and invite a child to turn one over and talk about the story it represents. (For help, see “\nDaniel and His Friends\n,” “\nShadrach, Meshach, and Abed-nego\n,” and “\nDaniel and the Lions’ Den\n” in\nOld Testament Stories\n, 154–56, 160–62, 163–65.)\n1:39\nDaniel and His Friends\n1:39\nShadrach, Meshach, and Abed-nego\n1:45\nDaniel and the Lions’ Den\nHelp your children think of situations when they might be pressured to make a wrong choice, like Daniel and his friends were in\nDaniel 1\n,\n3\n, and\n6\n. Share with each other how you have been blessed for making the right choice even when it was hard. You could also sing together a song related to this topic, such as “\nChoose the Right\n” (\nHymns\n, no. 239).\nTrusting the Wisdom of the Word\nDaniel 1:1–17\nHeavenly Father wants me to take care of my body.\nReading the story about Daniel and his friends refusing the king’s meat and wine may inspire a conversation about the law of health Heavenly Father has given us today (see\nDoctrine and Covenants 89\n). Maybe you could look for the blessings Daniel and his friends received and compare them to the blessings promised in the Word of Wisdom (see\nDaniel 1:15–17\nand\nDoctrine and Covenants 89:18–21\n).\nDaniel 2\nThe Church of Jesus Christ of Latter-day Saints is the kingdom of God on earth.\nAs you read\nDaniel 2:31–35, 44–45\nwith your children, you could invite them to draw a picture of Nebuchadnezzar’s dream. Help them understand the stone in the dream represents The Church of Jesus Christ of Latter-day Saints. What do we learn about the Church from this dream? Your children could name some things Heavenly Father did to set up His Church in the latter days. If they need help, you could show pictures of events from the Restoration of the Church (see\nGospel Art Book\n,\nnos. 90–95\n).\nDaniel 6\nHeavenly Father wants me to pray often.\nWhy was praying to Heavenly Father so important to Daniel? Perhaps you and your children could talk about that question as you read\nDaniel 6\ntogether. Then you could tell each other why praying is important to you. Your children might enjoy drawing pictures of themselves praying in various situations. They could use their drawings to teach each other that we can pray to Heavenly Father no matter where we are or what we need.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 46: Lesson 142: Lesson 142—Daniel 1This lesson can encourage students strengthen their commitment to obey the Lord’s Word of Wisdom.; Lesson 143: Lesson 143—Daniel 2This lesson can help students strengthen their testimony of the divine Restoration of The Church of Jesus Christ of Latter-day Saints.... ---\n\n--- Lesson 142 ---\nWhen we encounter situations that test our resolve to obey the Lord’s commandments, do we give in or stand firm? As servants in King Nebuchadnezzar’s court, Daniel and his friends were instructed to break the Lord’s revealed health laws, but they stood firm. This lesson can help students strengthen their commitment to obey the Lord’s Word of Wisdom. Student preparation: Invite students to study the overview for “ Word of Wisdom ” in Topics and Questions in Gospel Library. Encourage them to discuss how they or others have been blessed by keeping the Lord’s Word of Wisdom. Possible Learning Activities What would you do? Consider beginning class by describing a young person who loves to accept challenges to try new things, like the following example. You might change the name and activities to make them more relatable to your students. Mateo is an active member of The Church of Jesus Christ of Latter-day Saints. He has a reputation for trying new things, so his friends often give him challenges such as the following: Once a friend challenged him to run a marathon. Mateo took the challenge. Once a friend challenged him to dive into an ice-cold lake. Mateo took the challenge. Once a friend challenged him to introduce himself to a new girl at school. Mateo took the challenge. After reading the next challenge, pause and ask the question below. One day Mateo’s friends challenge him to drink alcohol at a party. How do you think Mateo might respond? Why? You might ask students if pressure to break the Word of Wisdom is common in your area. They could also describe situations where they might feel pressure to break it. Consider encouraging students who might have broken this commandment to remember that the Lord will help them as they turn to Him and repent. Reassure students that the Lord loves them and invites them to keep trying. To evaluate their own commitment to obey the Word of Wisdom, students could answer the following in their study journals. How do you think you would respond in a similar situation? Why? How do you think you would respond if you were offered something more common like coffee or tea? As you study Daniel 1 today, listen for thoughts and feelings Heavenly Father might give you through the Holy Ghost. Look for ways to strengthen your commitment to obey the Lord’s Word of Wisdom. Daniel obeyed the Lord Around 606 BC, Nebuchadnezzar, king of Babylon, attacked Jerusalem and took certain Israelites captive into Babylon. The king commanded that some of the Israelite youth be trained for service in his household. Among these youth were four young men named Daniel, Hananiah, Mishael, and Azariah. In Babylon, their names were changed to Belteshazzar, Shadrach, Meshach, and Abed-nego (see Daniel 1:1–7 ). As students read the following verses, consider pausing after verse 10 to ask the questions below. Alternately, you could invite students to follow along in their scriptures as you show the video “ God Gave Them Knowledge” (available at ChurchofJesusChrist.org ) from time code 0:52 to 5:15, pausing at time code 4:18 to discuss the questions. 13:49 Read Daniel 1:5, 8–14 , looking for what the king instructed Daniel and his friends to do. Why might this request have been challenging for Daniel and his friends? Why do you think not eating and drinking certain things would be worth risking the king’s anger? You might remind students that in Daniel’s time, Israelites followed the law of Moses, which included certain dietary restrictions (see Deuteronomy 14 ). You might also explain that “pulse” refers to “foods made of seeds, grains, etc.” ( Daniel 1:12 , footnote a ). Blessings of obeying the Lord To help students discover how the Lord blessed Daniel and his friends, you could organize students into partnerships. As they read the following verses, invite one partner to look for how the Lord blessed Daniel and his friends physically, and invite the other partner to look for how the Lord blessed them spiritually. Then invite partnerships to share what they found. Have them mark the physical and spiritual blessings in two distinct ways (such as highlighting with different colors or underlining one and highlighting the other). Read Daniel 1:15–20 , looking for how the Lord blessed Daniel and his friends for their obedience. When students identify attributes and characteristics of Jesus Christ, they can increase their desire to trust and obey Him. One way to help students do this is by creating search questions, like the following, for students to ponder. (For additional training on creating search questions to help students identify attributes and characteristics of Jesus Christ, see “ Create Search Questions to help students identify roles, titles, symbols, and attributes of Jesus Christ ” in Teacher Development Skills .) Read verses 15–20 one more time, but this time ponder what you learn about Heavenly Father and Jesus Christ. What do these verses teach you about God? How could this understanding strengthen your desire to trust and obey Him? You might explain that like in Daniel’s day, the Lord has revealed a health law for His children today. It is known as the Word of Wisdom (see Doctrine and Covenants 89 ). The following activity could help students study the Word of Wisdom. Consider providing paper and art supplies as well as copies of For the Strength of Youth: A Guide for Making Choices for students without access to Gospel Library. You might limit time spent on this activity to allow time for the experience at the end of the lesson. Imagine that you have been asked to create a poster that describes something unique about your religion. You decide to create your poster about the Word of Wisdom. Use some or all of the following sources to determine what to include: Doctrine and Covenants 89:18–21 Daniel 1:15–20 “Word of Wisdom” in the Guide to the Scriptures or Topics and Questions (Gospel Library) or in the “ What about … ? ” section of For the Strength of Youth: A Guide for Making Choices (2022) “ The Word of Wisdom: What It Is, What It Isn’t ,” New Era , Aug. 2019, 26–28 Be sure to include a statement of truth about the Word of Wisdom on your poster. This truth can be from Daniel’s experience or from other sources. Invite students to share their posters and statements of truth with the class. Among the truths they might share, emphasize the following: As we keep the Lord’s commandment to obey the Word of Wisdom, He will bless us physically and spiritually. ( Note: In Lesson 160: “ Assess Your Learning 10 ,” students will look back on the posters they created. It might help to collect the posters or to display them until you teach that lesson so that students will have access to them.) People who don’t yet understand the purpose of the Word of Wisdom might view it as unnecessary restrictions that the Church imposes. Take a minute to ponder blessings that come from keeping the Word of Wisdom and the results of breaking it for individuals, families, and society. How do you think the Word of Wisdom shows God’s love for His children? Commit now to obey the Lord To help students strengthen their commitment to obey the Lord’s Word of Wisdom, you could invite them to complete the following sentences in their study journals. As they prepare to write, ask them to consider how their commitment to obey the Word of Wisdom can strengthen their relationship with Heavenly Father and Jesus Christ. I want to obey the Word of Wisdom because … One thing I can do that will help me obey the Word of Wisdom is … You might conclude by sharing your testimony of Jesus Christ and the blessings you’ve seen from obeying His Word of Wisdom.\n\n\n--- Lesson 143 ---\nThe Lord showed Daniel a vision of the latter days, when the Lord would set up His kingdom upon the earth. The Lord’s kingdom, The Church of Jesus Christ of Latter-day Saints, will fill the earth and stand forever. This lesson can help students strengthen their testimony of the divine Restoration of The Church of Jesus Christ of Latter-day Saints. Student preparation: Invite students to choose one of the following ideas to prepare for this lesson: Possible Learning Activities Testimony of the Restoration Consider inviting students to share any questions they remember that are asked during a temple recommend interview. If helpful, you could point to the temple recommend questions in the appendix of For the Strength of Youth: A Guide for Making Choices . After students have shared a few questions they remember, you could write the following question on the board. Think about how you would respond to the following temple recommend question: Do you have a testimony of the Restoration of the gospel of Jesus Christ? As needed, explain that the Restoration is “God’s reestablishment of the truths and ordinances of His gospel among men on earth” (Guide to the Scriptures, “ Restoration of the Gospel ,” Gospel Library). Consider writing Why or why not? after the question on the board. Invite students to ponder their answers to both questions. As you study Daniel 2 today, invite the Holy Ghost to help you recognize truths that can strengthen your testimony that Heavenly Father and Jesus Christ restored The Church of Jesus Christ of Latter-day Saints to the earth. King Nebuchadnezzar’s dream To help students understand the context of Daniel 2 , a student could read or summarize the following information. Alternatively, you could watch “ God Gave Them Knowledge ,” available at ChurchofJesusChrist.org , from time code 6:17 to 13:00. 13:49 King Nebuchadnezzar of Babylon had a dream that troubled him. None of his wise men could tell him what the dream was or how to interpret it. As a result, the king commanded that all his wise men, including Daniel, be killed. Before that could happen, God revealed the dream and its interpretation to Daniel (see Daniel 2:1–26 ). Before sharing what God had revealed about the dream, Daniel taught the king that God was the source of the interpretation. Daniel also revealed that the dream was about “what shall be in the latter days” ( Daniel 2:28 ). Consider placing students in small groups. Give each group a copy of the handout titled “ King Nebuchadnezzar’s Dream .” Then display the instructions below, giving students time to complete step one before displaying step two. Read Daniel 2:31–43 and label the elements of King Nebuchadnezzar’s dream on the handout with the interpretations you discover. Include the verses where you found the interpretations. Help students identify that King Nebuchadnezzar’s Babylonian kingdom was the head of gold ( verse 38 ). The other parts of the image (or statue) represent other kingdoms that would come after Babylon. Daniel 2:44–45 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Daniel 2:44–45 , looking for words and phrases that describe the stone. Write these words around the stone on your handout. As students read the following statement, invite them to write what the stone represents inside the stone on their handout. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles explained what the stone represents: The Church [of Jesus Christ of Latter-day Saints] is that prophesied latter-day kingdom, not created by man but set up by the God of heaven and rolling forth as a stone “cut out of the mountain without hands” to fill the earth [ Daniel 2:45 ; see also verse 35 ]. (“ Why the Church ,” Ensign or Liahona , Nov. 2015, 111) What can we learn about God’s restored Church from this statement and from the Lord’s revelation to Daniel? Using students’ words, help them identify that God established The Church of Jesus Christ of Latter-day Saints, which will fill the whole earth and stand forever . Consider sharing that the Lord Himself declared that His gospel would fill the whole earth (see Doctrine and Covenants 65:2 ). Students could cross-reference or link Doctrine and Covenants 65:2 to Daniel 2:35 . You might explain that “filled the whole earth” ( Daniel 2:35 ) does not mean that everyone will join the Lord’s Church, but that it will spread throughout the earth (see 1 Nephi 14:12–14 ). How do the phrases in Daniel 2:44–45 help us understand this truth? The stone rolls forth After interpreting King Nebuchadnezzar’s dream, Daniel shared his testimony that it was “certain, and the interpretation thereof sure” ( Daniel 2:45 ). As we develop our personal testimonies, the truths of the Savior’s restored Church can become certain and sure to us through the power of the Holy Ghost. President Russell M. Nelson shared what we need to do to develop sure testimonies for ourselves: Now, as President of His Church, I plead with you. … Do the spiritual work to find out for yourselves [that the Savior’s Church has been restored], and please do it now. Time is running out. (“ Come, Follow Me ,” Ensign or Liahona , May 2019, 91) The following activity can help students consider what spiritual work they need to do to strengthen their testimony of the divine Restoration of The Church of Jesus Christ of Latter-day Saints. Consider placing students in small groups to do the activity. Help students find the Restoration proclamation . It can be found in Gospel Library and in some study journals. You might provide paper copies for students who don’t have access to it. As an alternative to the proclamation, you could show “ Hear Him ,” available at ChurchofJesusChrist.org , from time code 17:05 to 22:55. 24:24 Read “ The Restoration of the Fulness of the Gospel of Jesus Christ: A Bicentennial Proclamation to the World .” Look for truths the Savior has revealed and events He has brought forth in restoring His Church. Discuss why these truths and events are important to the Restoration of the Savior’s Church. Discuss the spiritual work someone could do to strengthen their testimony that Jesus Christ restored His Church. After sufficient time, have each group share one truth or event that stood out to them. Invite them to share why it’s important to have a testimony of this truth or event and the spiritual work someone could do to gain or strengthen their testimony of it. After each group has had the opportunity to share, invite students to answer the following questions in their study journals. What truth or event of the Savior’s restored Church would you like to strengthen your testimony of? What spiritual work can you do to strengthen your testimony of the Savior’s divine Restoration of His Church? Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Daniel 2:44–45 is “God shall ‘set up a kingdom, which shall never be destroyed.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 144 ---\nSometimes the Lord might miraculously deliver us from our trials. Other times He might not deliver us in the way or with the timing we hope. Either way, we can strive to be like Shadrach, Meshach, and Abed-nego and trust in the Lord, regardless of how and when He chooses to bless us. This lesson can help students feel a desire to trust in Jesus Christ regardless of the outcome. Student preparation: Invite students to think of faithful disciples of Christ who were miraculously delivered from their trials. Then have them think of other faithful disciples who were not delivered. They could ponder what these accounts teach them about trusting in the Lord. Possible Learning Activities Exercising faith in Jesus Christ Consider beginning class by sharing the following story about Elder Bowen’s son, Tyson. Note: The video version of the statement includes additional information that is not included in the written statement. Elder Shayne M. Bowen of the Seventy shared the following personal experience: 11:26 When [my son] Tyson was eight months old, he aspirated [or inhaled] a piece of chalk that he had found on the carpet. The chalk lodged in Tyson’s throat, and he quit breathing. His older brother brought Tyson upstairs, frantically calling, “The baby won’t breathe. The baby won’t breathe.” We began to administer CPR and called 911. The paramedics arrived and rushed Tyson to the hospital. In the waiting room we continued in fervent prayer as we pled to God for a miracle. (“ Because I Live, Ye Shall Live Also ,” Ensign or Liahona , Nov. 2012, 16) How might different potential outcomes of this situation affect the family’s faith in God? Elder Bowen continued: 11:26 After what seemed a lifetime, the doctor came into the room and said, “I am so sorry. There is nothing more we can do. Take all the time you need.” She then left. As we entered the room where Tyson lay, we saw our lifeless little bundle of joy. … At that moment it felt as if our world had come to an end. (“ Because I Live, Ye Shall Live Also ,” Ensign or Liahona , Nov. 2012, 16) Like the Bowens, you might have experiences where God does not bless you in the way that you had hoped. Ponder experiences you or your family have had where you felt the Lord either blessed you or did not bless you with the outcome you wanted. It might help to display the following questions. Ask yourself the following questions: How have your experiences influenced your faith in Heavenly Father and Jesus Christ? Do you feel you can trust in Them, regardless of the blessings you do or do not receive? Why or why not? As you study Daniel 3 today, pay attention to any impressions from the Holy Ghost that can help strengthen your faith in Heavenly Father and Jesus Christ no matter the outcome. A difficult decision Consider writing the following names on the board: Shadrach , Meshach , and Abed-nego . Display the image of a golden idol and invite students to share what they know about this account. You might want to summarize the context below in your own words. The king of Babylon, Nebuchadnezzar, made a large golden image, or statue. It was approximately 90 feet (27.4 meters) high and 9 feet (2.74 meters) wide (see Daniel 3:1 ). The king commanded everyone to fall down and worship the image when certain music was played (see Daniel 3:4–5 ). People who did not worship the golden image would be thrown into “a burning fiery furnace” ( Daniel 3:6 ). Considering the consequences for not worshipping this image, ponder what you think you would have done if you were there. Shadrach, Meshach, and Abed-nego chose to honor God by not worshipping the image (see Daniel 3:12 ). To help students study the following verses, you could invite five willing students to read the roles of Nebuchadnezzar, Shadrach, Meshach, Abed-nego, and a narrator. The students who read for Shadrach, Meshach, and Abed-nego could each read one verse in Daniel 3:16–18 . Read Daniel 3:13–18 , looking for what you learn from these men about faith in Jesus Christ. What lessons do you learn about faith in Jesus Christ? Help students see that we can show our faith in Jesus Christ by trusting in Him, regardless of the outcome . Consider inviting students to mark the phrase “is able to deliver us” ( verse 17 ). Point out that knowing God can bless us with what we hope for shows faith in Him. Then invite students to mark the phrase “but if not” ( verse 18 ). Ask students what they learn about faith in God from these men’s willingness to accept that God might not choose to bless them with what they hoped for. What is the difference between having faith in Jesus Christ versus faith in an outcome? What are modern situations where someone would need to show faith in Jesus Christ rather than faith in an outcome? The outcome of our faith Consider displaying the picture of the fiery furnace from the beginning of the lesson. Students could study the following verses and discuss the questions below in pairs or small groups. Read Daniel 3:19–28 , marking words or phrases that impress you from what Shadrach, Meshach, and Abed-nego experienced. To help students visualize these verses, you could show the video “ Shadrach, Meshach, and Abed-nego ” (1:39), available at ChurchofJesusChrist.org . 1:39 What impressed you from this story? What do you learn about God from this account? It might help to explain that even though God delivered Shadrach, Meshach, and Abed-nego, He might not always deliver us from negative outcomes. To demonstrate this, students could complete the following activity. Think of scriptural accounts where people exercised faith in Jesus Christ and still experienced negative outcomes. Consider writing But if not … on the board. Students could then list underneath this phrase the people they thought of. If time allows, they could search the accounts of these people in the scriptures, looking for evidence that these people trusted in God. The following are examples you could refer students to as needed: Nephi (see 1 Nephi 18:10–16 ), Abinadi (see Mosiah 17:9–20 ), Joseph and Hyrum Smith (see Doctrine and Covenants 135:1 ), or various righteous individuals (see Hebrews 11:36–40 ). How do these accounts help you trust in the Lord regardless of the outcome? What do you know about Heavenly Father and Jesus Christ that helps you want to trust in Them regardless of the outcome? Depending on Christ Consider reminding students of Elder Bowen’s experience. The following statement can help them see how he trusted in the Lord despite the outcome he experienced. Elder Bowen continued sharing his experience: As I felt the guilt, anger, and self-pity trying to consume me, I prayed that my heart could change. Through very personal sacred experiences, the Lord gave me a new heart, and even though it was still lonely and painful, my whole outlook changed. I was given to know that I had not been robbed but rather that there was a great blessing awaiting me if I would prove faithful. My life started to change, and I was able to look forward with hope, rather than look backward with despair. … I testify that because of Him, even our Savior, Jesus Christ, those feelings of sorrow, loneliness, and despair will one day be swallowed up in a fulness of joy. I testify that we can depend on Him. (“ Because I Live, Ye Shall Live Also ,” Ensign or Liahona , Nov. 2012, 17) How can Elder Bowen’s experience help you? When have you or someone you know shown faith in Heavenly Father and Jesus Christ by trusting in Them regardless of the outcome? In your study journal, write what helps you want to trust in Heavenly Father and Jesus Christ regardless of the outcome. You could include how the lessons you learned from Daniel 3 can help you in the trials you face or what you hope to remember in the future. You could invite willing students to share. Consider concluding with your own testimony or feelings about trusting in the Lord.\n\n\n--- Lesson 145 ---\nWhat story from the Old Testament has taught you a meaningful gospel principle? Jesus Christ Himself used the Old Testament to help His disciples understand His teachings (for example, see Luke 4:24–27 ). One powerful story that illustrates many gospel truths is the account of Daniel’s faith and trust in the Lord, even when facing the lions’ den. This lesson can help students identify and share gospel truths from Daniel 6 . Student preparation: Invite students to reflect on the scripture stories they have learned from the Old Testament in their study this year. They could select a story that has been meaningful to them and prepare to share a gospel truth that story helped them understand. Possible Learning Activities The moral of the story To help students practice identifying the moral of a story, select a local fable or popular folktale. For example, you could use a story like “The Ugly Duckling.” As an alternative, you could show the video “Things That Matter Most” from time code 0:00 to 0:22, available at ChurchofJesusChrist.org . Then ask the following questions: 0:33 What message could this story teach? How could that message illustrate a truth about Jesus Christ or His gospel? Just as we can find truths in common fables and stories, we can learn to find important gospel truths in the inspired scripture accounts that Heavenly Father and Jesus Christ have preserved for us. To help us understand how scripture stories teach gospel truths, Elder Jay E. Jensen of the Seventy taught: As you read and study [scripture] stories, you will see a word, a phrase, or a principle that seems as applicable today as it was in the past. As you continue your prayerful study, other principles will become apparent. As you put the principles together, you will begin to bridge the gap between the prophets and people who lived in the past— they-there-then —and us in our day— I-here-now . (“ Scripture Stories as Patterns for Our Lives ,” Ensign , July 2009, 21) What stands out to you from Elder Jensen’s message? What Old Testament story helped you understand Jesus Christ or His gospel better? The following self-assessment could help students select the part of the identifying truths in scripture stories skill they could practice today. On a scale of 1 to 5, rate your confidence in using the following scripture study skills: I can identify gospel truths in a scripture story. I can easily see how a scripture story teaches about Jesus Christ. I can apply scripture stories to my life. I can effectively share what I learn from scripture stories with others. Today you will study a story in the book of Daniel and explain what you learn from it. You might focus your efforts on the skill you feel the least confident about. Invite the Holy Ghost to help increase your ability to identify truths in scripture stories and to teach others what you learn about Jesus Christ, His life, and His gospel. Daniel cast into the lions’ den Many years after Daniel and his friends were taken captive into Babylon, the nation was conquered by the Medes and the Persians. Darius, a Mede, was made king of Babylon (see Daniel 5:30–31 ). The following activity can help students practice identifying gospel truths in scripture stories by studying the account of Daniel being cast into the lions’ den (see Daniel 6 ). It might be helpful for students to have a brief overview of the story before they search for gospel truths in it. The following are some ways you could summarize the story: You could have students share the story, organizing them into groups to read a section. Each group could then summarize their part of the story for the class. One way to divide the reading would be: Daniel 6:1–5 Daniel 6:6–11 Daniel 6:12–17 Daniel 6:18–23 Daniel 6:24–28 You could summarize the entire story for the class. If available, you could use the images found in the article “ Daniel and the Lions ” (Friend, Nov. 2018, FJ4–FJ6) or the video “ Daniel and the Lions’ Den ” (1:46), available at ChurchofJesusChrist.org , to help you summarize the story. 1:45 To help students practice identifying gospel principles from scripture stories, use the handout “ Scripture Stories Teach Gospel Truths .” Because students will present what they learn to the class, it might be best to have them work with a partner or in small groups. Consider pairing students who might feel more anxious about presenting with students who might feel more comfortable. Open PDF As students use the handout to prepare their lessons, you might walk around the room to see what gospel truths they are finding. If they are struggling, consider how you could help them learn to identify truths in the account. Examples of truths they might identify are: As disciples of Christ, we will face opposition because of our beliefs ( Daniel 6:1–5 ). The Lord will bless our efforts when we stand up to worldly pressure. ( Daniel 6:6–16 ). As we do what is right and trust the Lord, our righteous example can influence others ( Daniel 6:16–28 ). Share what you have learned After students have completed the handout, invite them to share the lesson they prepared with another group or with the class. If students don’t share parts of the story that remind them of Jesus Christ, you might point out some comparisons such as the following: Daniel and Jesus both did Heavenly Father’s will, even when facing death (see Daniel 6:7, 10 ; John 6:38 ). Daniel and Jesus both miraculously emerged alive from a pit that was covered by a stone (see Daniel 6:17, 23 ; Mark 15:46 ; 16:4–6 ). You could encourage students to take the lessons they prepared home and share them with a family member or friend. To conclude class, consider sharing how you have been blessed by messages of Jesus Christ or His gospel from scripture stories. Invite students to continue to look for impressions from the Holy Ghost to help them see gospel truths in their personal scripture study.\n\n--- SCRIPTURE: Daniel 1 ---\n1. In the third year of the reign ofJehoiakimking of Judah cameNebuchadnezzarking of Babylon unto Jerusalem, and besieged it.\n2. And the Lord gave Jehoiakim king of Judah into his hand, withpart of thevesselsof the house of God: which he carried into the land ofShinarto the house of his god; and he brought thevesselsinto the treasure house of his god.\n3. And the king spake unto Ashpenazthemaster of his eunuchs, that he should bringcertainof the children of Israel, and of the kingsseed, and of the princes;\n4. Children in whomwasno blemish, butwell favoured, and skilful in all wisdom, and cunning in knowledge, and understanding science, and such ashadability in them to stand in the kings palace, and whom they might teach the learning and the tongue of the Chaldeans.\n5. And the king appointed them dailyprovisionof the kingsmeat, and of the wine which he drank: so nourishing them three years, that at the end thereof they mightstandbefore the king.\n6. Now among these were of the children of Judah,Daniel,Hananiah, Mishael, and Azariah:\n7. Unto whom the prince of the eunuchs gavenames: for he gave unto Danielthenameof Belteshazzar; and to Hananiah, of Shadrach; and to Mishael, of Meshach; and to Azariah, of Abed-nego.\n8. But Danielpurposedin his heart that he would notdefilehimself with the portion of the kings meat, nor with thewinewhich he drank: therefore he requested of the prince of the eunuchs that he might not defile himself.\n9. Now God had brought Daniel intofavourandtender lovewith the prince of the eunuchs.\n10. And the prince of the eunuchs said unto Daniel, Ifearmy lord the king, who hath appointed your meat and your drink: for why should he see your facesworse likingthan the children whichareof yoursort? then shall ye makemeendanger my head to the king.\n11. Then said Daniel toMelzar, whom the prince of the eunuchs had set over Daniel, Hananiah, Mishael, and Azariah,\n12. Prove thy servants, I beseech thee, ten days; and let them give uspulseto eat, and water to drink.\n13. Then let ourcountenancesbe looked upon before thee, and the countenance of the children that eat of the portion of the kings meat: and as thou seest, deal with thy servants.\n14. So he consented to them in this matter, and proved them ten days.\n15. And at the end of ten days their countenances appeared fairer and fatter in flesh than all the children which did eat the portion of the kings meat.\n16. Thus Melzar took away the portion of their meat, and the wine that they should drink; and gave them pulse.\n17. As for these four children, God gave themknowledgeand skill in alllearningand wisdom: and Daniel hadunderstandingin allvisionsand dreams.\n18. Now at the end of the days that the king had said he should bring them in, then the prince of the eunuchs brought them in before Nebuchadnezzar.\n19. And the king communed withthem; and among them all was found none like Daniel, Hananiah, Mishael, and Azariah: therefore stood they before the king.\n20. And in all matters of wisdomandunderstanding, that the king inquired of them, he found them ten times better than all themagiciansandastrologers thatwerein all his realm.\n21. And Daniel continuedevenunto the first year of king Cyrus.\n\n--- SCRIPTURE: Daniel 2 ---\n1. And in the second year of the reign of Nebuchadnezzar Nebuchadnezzar dreameddreams, wherewith his spirit wastroubled, and his sleep brake from him.\n2. Then the king commanded to call themagicians, and the astrologers, and the sorcerers, and the Chaldeans, for to shew the king his dreams. So they came and stood before the king.\n3. And the king said unto them, I have dreamed dream, and my spirit was troubled to know the dream.\n4. Then spake the Chaldeans to the king inSyriack, O king, live for ever: tell thy servants the dream, and we willshewthe interpretation.\n5. The king answered and said to the Chaldeans, The thing isgone from me: if ye will not make known unto me the dream, with the interpretation thereof, ye shall becutin pieces, and your houses shall be made dunghill.\n6. But if ye shew the dream, and the interpretation thereof, ye shall receive of me gifts and rewards and great honour: therefore shew me the dream, and the interpretation thereof.\n7. They answered again and said, Let the king tell his servants the dream, and we will shew the interpretation of it.\n8. The king answered and said, I know of certainty that ye would gain the time, because ye see the thing is gone from me.\n9. But if ye will not make known unto me the dream,there is butone decree for you: for ye have prepared lying and corrupt words to speak before me,tillthe time be changed: therefore tell me the dream, and I shall know that ye can shew me the interpretation thereof.\n10. The Chaldeans answered before the king, and said, There is not man upon the earth that can shew the kings matter: thereforethere isno king, lord, nor ruler,thatasked such things at any magician, or astrologer, or Chaldean.\n11. Andit isa rare thing that the king requireth, and there is none other that can shew it before the king, except thegods, whose dwelling is not with flesh.\n12. For this cause the king was angry and very furious, and commanded to destroy all the wisemenof Babylon.\n13. And the decree went forth that the wisemenshould be slain; and they sought Daniel and his fellows to be slain.\n14. Then Daniel answered with counsel and wisdom to Arioch the captain of the kings guard, which was gone forth to slay the wisemenof Babylon:\n15. He answered and said to Arioch the kings captain, Whyisthe decreesohastyfrom the king? ThenArioch made the thing known to Daniel.\n16. Then Daniel went in, and desired of the king that he would give him time, and that he would shew the king the interpretation.\n17. Then Daniel went to his house, and made the thing known toHananiah, Mishael, and Azariah, his companions:\n18. That they would desire mercies of the God of heaven concerning this secret; that Daniel and his fellows should not perish with the rest of the wisemenof Babylon.\n19. Then was thesecretrevealed unto Daniel in nightvision. Then Daniel blessed the God of heaven.\n20. Daniel answered and said, Blessed be the name of God for ever and ever: forwisdomand might are his:\n21. And he changeth thetimesand theseasons: heremovethkings, and setteth up kings: he givethwisdomunto the wise, andknowledgeto them that know understanding:\n22. Herevealeththe deep and secret things: heknowethwhatisin the darkness, and thelightdwelleth with him.\n23. I thank thee, and praise thee, O thou God of my fathers, who hast given me wisdom and might, and hast made known unto me now what we desired of thee: for thou hastnowmade known unto us the kings matter.\n24. Therefore Daniel went in unto Arioch, whom the king had ordained to destroy the wisemenof Babylon: he went and said thus unto him; Destroy not the wisemenof Babylon: bring me in before the king, and I will shew unto the king the interpretation.\n25. Then Arioch brought in Daniel before the king in haste, and said thus unto him, I have found man of the captives of Judah, that will make known unto the king the interpretation.\n26. The king answered and said to Daniel, whosenamewasBelteshazzar, Art thou able to makeknownunto me the dream which I have seen, and the interpretation thereof?\n27. Daniel answered in the presence of the king, and said, The secret which the king hath demanded cannot the wisemen,theastrologers, the magicians, the soothsayers, shew unto the king;\n28. But there is God in heaven thatrevealethsecrets, and maketh known to the king Nebuchadnezzar what shall be in the latter days. Thydream, and the visions of thy head upon thy bed, are these;\n29. As for thee, O king, thy thoughts cameinto thy mindupon thy bed, what should come to pass hereafter: and he thatrevealethsecrets maketh known to thee what shall come to pass.\n30. But as for me, this secret is not revealed to me foranywisdomthat I have more than any living, butfortheirsakes that shall make known the interpretation to the king, and that thou mightest know the thoughts of thy heart.\n31. Thou, O king, sawest, and behold greatimage. This great image, whose brightnesswasexcellent,stood before thee; andtheform thereofwasterrible.\n32. This images headwasof fine gold, his breast and his arms of silver, his belly and his thighs of brass,\n33. His legs of iron, his feet part of iron and part of clay.\n34. Thou sawest till that astonewas cut outwithouthands, which smote the image upon his feetthat wereof iron and clay, and brake them to pieces.\n35. Then was the iron, the clay, the brass, the silver, and the gold, broken to pieces together, and became like the chaff of the summer threshingfloors; and the wind carried them away, that noplacewas found for them: and thestonethat smote the image became great mountain, and filled the whole earth.\n36. Thisisthe dream; and we will tell the interpretation thereof before the king.\n37. Thou, O king,arta king of kings: for the God of heaven hath given thee akingdom, power, and strength, and glory.\n38. And wheresoever the children of men dwell, the beasts of the field and the fowls of the heaven hath he given into thine hand, and hath made thee ruler over them all. Thouartthisheadof gold.\n39. And after thee shall arise anotherkingdominferior to thee, and another third kingdom of brass, which shall bearruleover all the earth.\n40. And the fourthkingdomshall be strong as iron: forasmuch as iron breaketh in pieces and subdueth allthings:and as iron that breaketh all these, shall it break in pieces and bruise.\n41. And whereas thou sawest the feet and toes, part of potters clay, and part of iron, the kingdom shall be divided; but there shall be in it of the strength of theiron, forasmuch as thou sawest the iron mixed with miry clay.\n42. Andasthe toes of the feetwerepart of iron, and part of clay,sothe kingdom shall be partly strong, and partly broken.\n43. And whereas thou sawest iron mixed with miry clay, they shall mingle themselves with the seed of men: but they shall not cleave one to another, even as iron is not mixed with clay.\n44. And in thedaysof thesekingsshall the God of heavensetup akingdom, which shall never bedestroyed: and thekingdomshall not be left to other people,butit shallbreakin pieces andconsumeall thesekingdoms, and it shall stand for ever.\n45. Forasmuch as thou sawest that thestonewas cut out of the mountain without hands, and that it brake in pieces the iron, the brass, the clay, the silver, and the gold; the great God hath madeknownto the king what shall come to pass hereafter: and the dreamiscertain, and the interpretation thereof sure.\n46. Then the king Nebuchadnezzar fell upon his face, andworshippedDaniel, and commanded that they should offer an oblation and sweet odours unto him.\n47. The king answered unto Daniel, and said, Of truthit is,that yourGodisaGodof gods, and aLordofkings, and revealer of secrets, seeing thou couldest reveal this secret.\n48. Then the king made Daniel agreatman, and gave him many great gifts, and made him ruler over the whole province of Babylon, and chief of the governors over all the wisemenof Babylon.\n49. Then Daniel requested of the king, and hesetShadrach, Meshach, and Abed-nego, over the affairs of the province of Babylon: but Danielsatin the gate of the king.\n\n--- SCRIPTURE: Daniel 3 ---\n1. Nebuchadnezzar the king made an image of gold, whose heightwasthreescore cubits,andthe breadth thereof six cubits: he set it up in the plain of Dura, in the province of Babylon.\n2. Then Nebuchadnezzar the king sent to gather together the princes, the governors, and the captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, to come to the dedication of the image which Nebuchadnezzar the king had set up.\n3. Then the princes, the governors, and captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, were gathered together unto the dedication of the image that Nebuchadnezzar the king had set up; and they stood before the image that Nebuchadnezzar had set up.\n4. Then an herald cried aloud, To you it is commanded, O people, nations, andlanguages,\n5. Thatat what time ye hear the sound of the cornet, flute,harp,sackbut, psaltery,dulcimer, and all kinds of musick, ye fall down and worship the golden image that Nebuchadnezzar the king hath set up:\n6. And whoso falleth not down and worshippeth shall the same hour becastinto the midst of aburningfiery furnace.\n7. Therefore at that time, when all the people heard the sound of the cornet, flute, harp, sackbut, psaltery, and all kinds of musick, all the people, the nations, and the languages, fell downandworshipped the golden image that Nebuchadnezzar the king had set up.\n8. Wherefore at that time certain Chaldeans came near, and accused the Jews.\n9. They spake and said to the king Nebuchadnezzar, O king, live for ever.\n10. Thou, O king, hast made decree, that every man that shall hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, shall fall down and worship the golden image:\n11. And whoso falleth not down and worshippeth,thathe should be cast into the midst of burning fiery furnace.\n12. There are certain Jews whom thou hastsetover the affairs of the province of Babylon, Shadrach, Meshach, and Abed-nego; these men, O king, have not regarded thee: they serve not thy gods, nor worship the golden image which thou hast set up.\n13. Then Nebuchadnezzar inhisrage and fury commanded to bring Shadrach, Meshach, and Abed-nego. Then they brought these men before the king.\n14. Nebuchadnezzar spake and said unto them,Is ittrue, O Shadrach, Meshach, and Abed-nego, do not yeserve my gods, nor worship the golden image which I have set up?\n15. Now if ye be ready that at what time ye hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, ye fall down and worship the image which I have made;well:but if ye worship not, ye shall be cast the same hour into the midst of burning fiery furnace; and whoisthat God that shall deliver you out of my hands?\n16. Shadrach, Meshach, and Abed-nego, answered and said to the king, O Nebuchadnezzar, wearenotcarefulto answer thee in this matter.\n17. If it beso,our God whom we serve is able todeliverus from the burning fiery furnace, and he will deliverusout of thine hand, O king.\n18. But if not, be it known unto thee, O king, that we will notservethy gods, nor worship the golden image which thou hast set up.\n19. Then was Nebuchadnezzar full of fury, and theform of his visagewas changed against Shadrach, Meshach, and Abed-nego:thereforehe spake, and commanded that they should heat the furnace one seven times more than it was wont to be heated.\n20. And he commanded the most mighty men thatwerein his army to bind Shadrach, Meshach, and Abed-nego,andto casttheminto the burning fiery furnace.\n21. Then these men were bound in their coats, their hosen, and their hats, and theirothergarments, and were cast into the midst of the burning fiery furnace.\n22. Therefore because the kings commandment was urgent, and the furnace exceeding hot, the flame of the fire slew those men that took up Shadrach, Meshach, and Abed-nego.\n23. And these three men, Shadrach, Meshach, and Abed-nego, fell down bound into the midst of the burning fiery furnace.\n24. Then Nebuchadnezzar the king was astonied, and rose up in haste,andspake, and said unto his counsellors, Did not we cast three men bound into the midst of the fire? They answered and said unto the king, True, O king.\n25. He answered and said, Lo, I see four men loose, walking in the midst of the fire, and they have nohurt; and the form of the fourth is like the Son of God.\n26. Then Nebuchadnezzar came near to the mouth of the burning fiery furnace,andspake, and said, Shadrach, Meshach, and Abed-nego, ye servants of the most high God, come forth, and comehither.Then Shadrach, Meshach, and Abed-nego, came forth of the midst of the fire.\n27. And the princes, governors, and captains, and the kings counsellors, being gathered together, saw these men, upon whose bodies thefirehad no power, nor was an hair of their head singed, neither were their coatschanged, nor the smell of fire had passed on them.\n28. ThenNebuchadnezzar spake, and said, Blessedbethe God of Shadrach, Meshach, and Abed-nego, who hath sent hisangel, and delivered his servants thattrustedin him, andhavechanged the kings word, and yielded their bodies, that they might not serve nor worship any god, except their own God.\n29. Therefore I make decree, That every people, nation, and language, which speak any thing amiss against the God of Shadrach, Meshach, and Abed-nego, shall becutin pieces, and their houses shall be made dunghill: because there is no other God that candeliverafter this sort.\n30. Then the kingpromotedShadrach, Meshach, and Abed-nego, in the province of Babylon.\n\n--- SCRIPTURE: Daniel 4 ---\n1. Nebuchadnezzar the king, unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.\n2. I thought it good to shew the signs and wonders that the high God hath wrought toward me.\n3. How greatarehis signs! and how mightyarehis wonders! hiskingdomisan everlasting kingdom, and his dominionisfrom generation to generation.\n4. I Nebuchadnezzar was at rest in mine house, andflourishingin my palace:\n5. I saw dream which made me afraid, and the thoughts upon my bed and the visions of my head troubled me.\n6. Therefore made I decree to bring in all thewisemenof Babylon before me, that they might make known unto me the interpretation of the dream.\n7. Then came in themagicians, the astrologers, the Chaldeans, and the soothsayers: and I told the dream before them; but they did not make known unto me the interpretation thereof.\n8. But at the last Daniel came in before me, whose namewasBelteshazzar, according to the name of my god, and in whomisthe spirit of the holygods: and before him I told the dream,saying,\n9. O Belteshazzar, master of the magicians, because I know that the spirit of the holy godsisin thee, and no secret troubleth thee, tell me the visions of my dream that I have seen, and the interpretation thereof.\n10. Thuswerethe visions of mine head in my bed; I saw, and behold tree in the midst of the earth, and the height thereofwasgreat.\n11. The tree grew, and was strong, and the height thereof reached unto heaven, and the sight thereof to the end of all the earth:\n12. The leaves thereofwerefair, and the fruit thereof much, and in itwasmeat for all: the beasts of the field had shadow under it, and the fowls of the heaven dwelt in the boughs thereof, and all flesh was fed of it.\n13. I saw in the visions of my head upon my bed, and, behold, watcher and an holy one came down from heaven;\n14. He cried aloud, and said thus, Hew down the tree, and cut off his branches, shake off his leaves, and scatter his fruit: let the beasts get away from under it, and the fowls from his branches:\n15. Nevertheless leave the stump of his roots in the earth, even with band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts in the grass of the earth:\n16. Let his heart be changed from mans, and let beasts heart be given unto him; and let seventimespass over him.\n17. This matterisby the decree of the watchers, and the demand by the word of the holy ones: to the intent that the living may know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will, and setteth up over it thebasestof men.\n18. This dream I king Nebuchadnezzar have seen. Now thou, O Belteshazzar, declare the interpretation thereof, forasmuch as all the wisemenof my kingdom are not able to make known unto me theinterpretation: but thouartable; for thespiritof theholygodsisin thee.\n19. Then Daniel, whose namewasBelteshazzar, was astonied for one hour, and his thoughts troubled him. The king spake, and said, Belteshazzar, let not the dream, or the interpretation thereof, trouble thee. Belteshazzar answered and said, My lord, the dreambeto them that hate thee, and the interpretation thereof to thine enemies.\n20. The tree that thou sawest, which grew, and was strong, whose height reached unto the heaven, and the sight thereof to all the earth;\n21. Whose leaveswerefair, and the fruit thereof much, and in itwasmeat for all; under which the beasts of the field dwelt, and upon whose branches the fowls of the heaven had their habitation:\n22. Itisthou, O king, that art grown and become strong: for thy greatness is grown, and reacheth unto heaven, and thydominionto the end of the earth.\n23. And whereas the king saw watcher and an holy one coming down from heaven, and saying, Hew the tree down, and destroy it; yet leave the stump of the roots thereof in the earth, even with band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts of the field, till seven times pass over him;\n24. Thisisthe interpretation, O king, and thisisthe decree of the most High, which is come upon my lord the king:\n25. That they shall drive thee from men, and thy dwelling shall be with the beasts of the field, and they shall make thee to eat grass as oxen, and they shall wet thee with the dew of heaven, and seven times shall pass over thee, till thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.\n26. And whereas they commanded to leave the stump of the tree roots; thy kingdom shall be sure unto thee, after that thou shalt have known that the heavens do rule.\n27. Wherefore, O king, let my counsel be acceptable unto thee, and break off thy sins by righteousness, and thine iniquities by shewingmercyto the poor;ifit may be lengthening of thy tranquillity.\n28. All this came upon the king Nebuchadnezzar.\n29. At the end of twelve months he walked in the palace of the kingdom of Babylon.\n30. The king spake, and said, Is not this great Babylon, that I have builtforthe house of the kingdom by the might of my power, and for the honour of my majesty?\n31. While the wordwasin the kings mouth, there fell voice from heaven,saying,O king Nebuchadnezzar, to thee it is spoken; The kingdom isdepartedfrom thee.\n32. And they shall drive thee from men, and thy dwellingshall bewith the beasts of the field: they shall make thee to eat grass as oxen, and seven times shall pass over thee, until thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.\n33. The same hour was the thing fulfilled upon Nebuchadnezzar: and he was driven from men, and did eat grass as oxen, and his body was wet with the dew of heaven, till his hairs were grown like eaglesfeathers,and his nails like birdsclaws.\n34. And at the end ofthe daysI Nebuchadnezzar lifted up mine eyes unto heaven, and mine understanding returned unto me, and I blessed the most High, and I praised and honoured him that liveth for ever, whose dominionisan everlasting dominion, and hiskingdomisfrom generation to generation:\n35. And all the inhabitants of the eartharereputed asnothing: and he doeth according to hiswillin the army of heaven, andamongthe inhabitants of the earth: and none canstayhis hand, or say unto him, What doest thou?\n36. At the same time my reason returned unto me; and for the glory of my kingdom, mine honour and brightness returned unto me; and my counsellors and my lords sought unto me; and I was established in my kingdom, and excellent majesty was added unto me.\n37. Now I Nebuchadnezzar praise and extol and honour the King of heaven, all whose worksaretruth, and his waysjudgment: and those thatwalkin pride he is able toabase.\n\n--- SCRIPTURE: Daniel 5 ---\n1. Belshazzar the king made great feast to thousand of his lords, and drank wine before the thousand.\n2. Belshazzar, whiles he tasted the wine, commanded to bring the golden and silvervesselswhich his father Nebuchadnezzar had taken out of the temple whichwasin Jerusalem; that the king, and his princes, his wives, and his concubines, might drink therein.\n3. Then they brought the golden vessels that were taken out of the temple of the house of God whichwasat Jerusalem; and the king, and his princes, his wives, and his concubines, drank in them.\n4. They drank wine, and praised the gods of gold, and of silver, of brass, of iron, of wood, and of stone.\n5. In the same hour came forth fingers of mans hand, and wroteover against the candlestickupon the plaster of the wall of the kings palace: and the king saw the part of thehandthat wrote.\n6. Then the kingscountenancewas changed, and his thoughtstroubledhim, so thatthe jointsof his loins were loosed, and his knees smote one against another.\n7. The king cried aloud to bring in theastrologers, the Chaldeans, and the soothsayers.Andthe king spake, and said to the wisemenof Babylon, Whosoever shall read this writing, and shew me the interpretation thereof, shall be clothed with scarlet, andhavea chain of gold about his neck, and shall be the third ruler in the kingdom.\n8. Then came in all the kings wisemen:but they could not read the writing, nor make known to the king the interpretation thereof.\n9. Then was king Belshazzar greatly troubled, and his countenance was changed in him, and his lords were astonied.\n10. Nowthe queen, by reason of the words of the king and his lords, came into the banquet house:andthe queen spake and said, O king, live for ever: let not thy thoughts trouble thee, nor let thy countenance be changed:\n11. There is man in thy kingdom, in whomisthespiritof the holy gods; and in the days of thy father light and understanding and wisdom, like the wisdom of the gods, was found in him; whom the king Nebuchadnezzar thy father, the king,I say,thy father, made master of the magicians, astrologers, Chaldeans,andsoothsayers;\n12. Forasmuch as an excellent spirit, and knowledge, and understanding, interpreting of dreams, and shewing of hard sentences, and dissolving of doubts, were found in the same Daniel, whom the kingnamedBelteshazzar: now let Daniel be called, and he will shew the interpretation.\n13. Then was Daniel brought in before the king.Andthe king spake and said unto Daniel,Artthou that Daniel, whichartof the children of the captivity of Judah, whom the king my father brought out of Jewry?\n14. I have even heard of thee, that the spirit of thegodsisin thee, andthatlight and understanding and excellent wisdom is found in thee.\n15. And now the wisemen,theastrologers, have been brought in before me, that they should read this writing, and make known unto me the interpretation thereof: but they could not shew the interpretation of the thing:\n16. And I have heard of thee, that thou canst make interpretations, and dissolve doubts: now if thou canst read thewriting, and makeknownto me the interpretation thereof, thou shalt be clothed with scarlet, andhavea chain of gold about thy neck, and shalt be the third ruler in the kingdom.\n17. Then Daniel answered and said before the king, Let thygiftsbe to thyself, and give thy rewards to another; yet I will read the writing unto the king, and make known to him the interpretation.\n18. O thou king, the most high God gave Nebuchadnezzar thy father kingdom, and majesty, and glory, and honour:\n19. And for the majesty that he gave him, all people, nations, and languages, trembled and feared before him: whom he would he slew; and whom he would he kept alive; and whom he would he set up; and whom he would he put down.\n20. But when hisheartwas lifted up, and hismindhardened in pride, he wasdeposedfrom his kingly throne, and they took his glory from him:\n21. And he was drivenfromthe sons of men; and his heart was made like the beasts, and his dwellingwaswith the wild asses: they fed him with grass like oxen, and his body was wet with the dew of heaven; till he knew that the most high God ruled in the kingdom of men, andthathe appointeth over it whomsoever he will.\n22. And thou his son, O Belshazzar, hast not humbled thine heart, though thou knewest all this;\n23. But hast lifted up thyself against the Lord of heaven; and they have brought the vessels of his house before thee, and thou, and thy lords, thy wives, and thy concubines, have drunk wine in them; and thou hast praised thegodsof silver, and gold, of brass, iron, wood, and stone, which see not, nor hear, nor know: and the God in whose hand thy breathis,and whoseareall thy ways, hast thou not glorified:\n24. Then was the part of the hand sent from him; and this writing was written.\n25. And thisisthe writing that was written,Mene, Mene, Tekel, Upharsin.\n26. Thisisthe interpretation of the thing:Mene; God hathnumberedthy kingdom, and finished it.\n27. Tekel; Thou artweighedin the balances, and art found wanting.\n28. Peres; Thy kingdom is divided, and given to the Medes andPersians.\n29. Then commanded Belshazzar, and theyclothedDaniel with scarlet, andputa chain of gold about his neck, and made proclamation concerning him, that he should be the third ruler in the kingdom.\n30. In that night was Belshazzar the king of theChaldeansslain.\n31. AndDariusthe Median took the kingdom,beingabout threescore and two years old.\n\n--- SCRIPTURE: Daniel 6 ---\n1. It pleased Darius to set over the kingdom an hundred and twenty princes, which should be over the whole kingdom;\n2. And over these three presidents; of whom Danielwasfirst: that the princes might give accounts unto them, and the king should have no damage.\n3. Then this Daniel was preferred above the presidents and princes, because an excellentspiritwasin him; and the king thought to set himoverthe whole realm.\n4. Then the presidents and princes sought to findoccasionagainst Daniel concerning the kingdom; but they could find none occasion nor fault; forasmuch as hewasfaithful, neither was there any error or fault found in him.\n5. Then said these men, We shall not find any occasion against this Daniel, except we finditagainst him concerning the law of his God.\n6. Then these presidents and princes assembled together to the king, and said thus unto him, King Darius, live for ever.\n7. All the presidents of the kingdom, the governors, and the princes, the counsellors, and the captains, have consulted together to establish royal statute, and to make firm decree, that whosoever shall ask petition of any God or man for thirty days, save of thee, O king, he shall becastinto the den of lions.\n8. Now, O king, establish the decree, and sign the writing, that it be not changed, according to the law of the Medes and Persians, whichaltereth not.\n9. Wherefore king Darius signed the writing and the decree.\n10. Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber towardJerusalem, he kneeled upon his kneesthreetimes day, andprayed, and gavethanksbefore his God, as he did aforetime.\n11. Then these men assembled, and found Daniel praying and making supplication before his God.\n12. Then they came near, and spake before the king concerning the kings decree; Hast thou not signed decree, that every man that shall aska petitionof any God or man within thirty days, save of thee, O king, shall be cast into the den of lions? The king answered and said, The thingistrue, according to the law of the Medes and Persians, which altereth not.\n13. Then answered they and said before the king, ThatDaniel, whichisof the children of the captivity of Judah, regardeth not thee, O king, nor the decree that thou hast signed, but maketh his petition three times day.\n14. Then the king, when he heardthesewords, was sore displeased with himself, and sethisheart onDaniel to deliver him: and he laboured till the going down of the sun to deliver him.\n15. Then these men assembled unto the king, and said unto the king, Know, O king, that the law of the Medes and Persiansis,That no decree nor statute which the king establisheth may be changed.\n16. Then the king commanded, and they brought Daniel, and casthiminto the den of lions.Nowthe king spake and said unto Daniel, Thy God whom thou servest continually, he will deliver thee.\n17. And stone was brought, and laid upon the mouth of the den; and the kingsealedit with his own signet, and with the signet of his lords; that the purpose might not be changed concerning Daniel.\n18. Then the king went to his palace, and passed the night fasting: neither were instruments of musick brought before him: and his sleep went from him.\n19. Then the king arose very early in the morning, and went in haste unto the den of lions.\n20. And when he came to the den, he cried with lamentable voice unto Daniel:andthe king spake and said to Daniel, O Daniel,servantof the living God, is thy God, whom thou servest continually, able to deliver thee from the lions?\n21. Then said Daniel unto the king, O king, live for ever.\n22. My God hath sent hisangel, and hath shut thelionsmouths, that they have not hurt me: forasmuch as before him innocency was found in me; and also before thee, O king, have I done no hurt.\n23. Then was the king exceeding glad for him, and commanded that they should take Daniel up out of the den. So Daniel was taken up out of the den, and no manner of hurt was found upon him, because hebelievedin his God.\n24. And the king commanded, and they brought those men which had accused Daniel, and they casttheminto the den of lions, them, their children, and their wives; and the lionshadthe mastery of them, and brake all their bones in pieces or ever they came at the bottom of the den.\n25. Then king Darius wrote unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.\n26. I make decree, That in every dominion of my kingdom men tremble and fear before the God of Daniel: for heistheliving God, andsteadfastfor ever, and his kingdomthatwhich shall not bedestroyed, and his dominionshall be evenunto the end.\n27. Hedeliverethand rescueth, and he worketh signs and wonders in heaven and in earth, who hathdeliveredDaniel from the power of the lions.\n28. So this Daniel prospered in the reign ofDarius, and in the reign ofCyrusthe Persian.\n\n--- SCRIPTURE: Daniel 7 ---\n1. In the first year of Belshazzar king of Babylon Daniel had adreamand visions of his head upon his bed: then he wrote the dream,andtold the sum of the matters.\n2. Daniel spake and said, I saw in my vision by night, and, behold, the four winds of the heaven strove upon the great sea.\n3. And four greatbeastscame upfrom thesea, diverse one from another.\n4. Thefirstwaslike lion, and had eagles wings: I beheld till the wings thereof were plucked, and it was lifted up from the earth, and made stand upon the feet as man, and mans heart was given to it.\n5. And behold anotherbeast, second, like to bear, and it raised up itself on one side, andit hadthree ribs in the mouth of it between the teeth of it: and they said thus unto it, Arise, devour much flesh.\n6. After this I beheld, and lo another, like leopard, which had upon the back of it four wings of fowl; the beast had also fourheads; and dominion was given to it.\n7. After this I saw in the night visions, and behold fourthbeast, dreadful and terrible, and strong exceedingly; and it had greatironteeth: it devoured and brake in pieces, and stamped the residue with the feet of it: and itwasdiverse from all the beasts thatwerebefore it; and it hadtenhorns.\n8. I considered the horns, and, behold, there came up among them another littlehorn, before whom there were three of the first horns plucked up by the roots: and, behold, in this hornwereeyes like the eyes of man, and amouthspeaking great things.\n9. I beheld till thethroneswerecast down, and theAncient of daysdid sit, whosegarmentwaswhite as snow, and the hair of his head like the pure wool: his thronewas likethe fiery flame,andhiswheelsasburning fire.\n10. A fiery stream issued and came forth from before him:thousandthousands ministered unto him, and ten thousand times ten thousand stood before him: thejudgmentwas set, and thebookswere opened.\n11. I beheld then because of the voice of the great words which the horn spake: I beheldeventill thebeastwas slain, and his body destroyed, and given to the burningflame.\n12. As concerning the rest of the beasts, they had their dominion taken away: yet their lives were prolonged for season and time.\n13. I saw in the night visions, and, behold,onelike theSon of mancame with thecloudsof heaven, and came to the Ancient of days, and they brought him near before him.\n14. And there was given himdominion, and glory, and akingdom, that all people, nations, and languages, should serve him: his dominionisaneverlastingdominion, which shall not pass away, and his kingdomthatwhich shall not be destroyed.\n15. I Daniel was grieved in my spirit in the midst ofmybody, and the visions of my head troubled me.\n16. I came near unto one of them that stood by, and asked him the truth of all this. So he told me, and made me know the interpretation of the things.\n17. These great beasts, which are four,arefourkings,whichshall arise out of the earth.\n18. But thesaintsof the most High shall take the kingdom, and possessthe kingdom for ever, even for ever and ever.\n19. Then I would know the truth of the fourth beast, which was diverse from all the others, exceeding dreadful, whose teethwere ofiron, and his nailsofbrass;whichdevoured, brake in pieces, and stamped the residue with his feet;\n20. And of the ten horns thatwerein his head, andofthe other which came up, and before whom three fell; evenofthat horn that had eyes, and mouth that spake very great things, whose lookwasmore stout than his fellows.\n21. I beheld, and the same horn madewarwith the saints, and prevailed against them;\n22. Until theAncient of dayscame, andjudgmentwas given to thesaintsof the most High; and the time came that the saints possessed the kingdom.\n23. Thus he said, The fourth beast shall be the fourth kingdom upon earth, which shall be diverse from all kingdoms, and shall devour the whole earth, and shall tread it down, and break it in pieces.\n24. And the tenhornsout of this kingdomaretenkingsthatshall arise: and another shall rise after them; and he shall be diverse from the first, and he shall subdue three kings.\n25. And he shall speakgreatwords against the most High, and shallwearout the saints of the most High, and think to change times and laws: and they shall be given into his hand until time and times and the dividing of time.\n26. But thejudgmentshall sit, and they shall take away his dominion, to consume and to destroyitunto the end.\n27. And thekingdomand dominion, and the greatness of the kingdom under the whole heaven, shall begivento the people of the saints of the most High, whose kingdomisaneverlastingkingdom, and all dominions shall serve and obey him.\n28. Hithertoisthe end of the matter. As for me Daniel, mycogitationsmuch troubled me, and my countenance changed in me: but I kept the matter in my heart.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "",
      "content": "Most likely no one will threaten to throw you into a fiery furnace or a den of lions because of your faith in Jesus Christ. But none of us get through this life without a trial of faith. So we can all benefit from the examples of people like Daniel, Shadrach, Meshach, and Abed-nego, who were taken captive as young men by the mighty Babylonian Empire (see\n2 Kings 24:10–16\n). Surrounded by an unfamiliar culture with different values, they faced great temptations to abandon their beliefs and righteous traditions. Yet they remained true to their covenants. How did they do it? By doing those small and simple things God asks of all of us—praying, fasting, choosing good friends, trusting in Him, and being a light to others. Like Joseph in Egypt and Esther in Persia, Daniel and his friends in Babylon kept their faith in God, and God worked miracles that still inspire believers to this day.\nFor an overview of the book of Daniel, see “\nDaniel\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nDaniel 1\n;\n3\n;\n6\nI can trust in the Lord when my faith is tried.\nIn a sense, we all live in Babylon. We often face temptations to compromise our standards and turn away from faith in Christ. As you read\nDaniel 1\n,\n3\n, and\n6\n, note the ways in which Daniel, Shadrach, Meshach, and Abed-nego were pressured to do things they knew were wrong. How did they respond to these situations? (see\nDaniel 1:10–13\n;\n3:15–18\n;\n6:10\n). What were the results of their faith? What do you learn from these experiences that can help you trust in the Lord when you face opposition? Also consider the following questions:\nWhen have you felt pressured to do something you knew was wrong? How has the Lord blessed you for keeping His commandments?\nWhat if your faith doesn’t lead to the miracles you seek? (for an example, see\nAlma 14:8–13\n). Based on what you read in\nDaniel 3:13–18\n, how do you think Shadrach, Meshach, and Abed-nego would have answered this question? How can their example affect how you approach your trials?\nHow can your righteous choices lead others to greater faith in the Lord? (see\nDaniel 2:47\n;\n3:28–29\n). Ponder the effects that your choices may be having on others.\nSee also Dieter F. Uchtdorf, “\nBe Not Afraid, Only Believe\n,”\nEnsign\nor\nLiahona\n, Nov. 2015, 76–79.\nTry to involve everyone.\nThe Savior “inviteth … all to come unto him and partake of his goodness” (\n2 Nephi 26:33\n). If you are teaching your family or a class, ponder ways you can give everyone an opportunity to participate in some way. For example, you could give each person a passage of scripture, a section of a conference message, or a verse from a hymn to ponder and comment on. Don’t pressure anyone to participate, but give them opportunities.\nShadrach, Meshach, and Abednego in the Fiery Furnace\n, by William Maughan\nDaniel 2\nThe Church of Jesus Christ of Latter-day Saints is the kingdom of God on earth.\nThrough revelation, Daniel saw that Nebuchadnezzar’s dream foretold future worldly kingdoms, as well as the future kingdom of God, which “shall never be destroyed” (\nDaniel 2:44\n). “The Church is that prophesied latter-day kingdom,” Elder D. Todd Christofferson taught, “not created by man but set up by the God of heaven and rolling forth as a stone ‘cut out of the mountain without hands’ to fill the earth” (“\nWhy the Church\n,”\nEnsign\nor\nLiahona\n, Nov. 2015, 111). Think about God’s latter-day kingdom as you read the descriptions of the stone in\nDaniel 2:34–35, 44–45\n. What is your role in helping this prophecy come to pass?\nSee also “\nHark, All Ye Nations!\n,”\nHymns\n, no. 264; “God Gave Them Knowledge” (video),\nChurchofJesusChrist.org\n.\n13:49\nGod Gave Them Knowledge\nDaniel 2:1–30\nReceiving revelation requires spiritual preparation.\nAs you review\nDaniel 2:1–15\n, consider how you would feel if you found yourself in Daniel’s position. What did Daniel do? (see\nDaniel 2:16–18\n). What can you learn from\nDaniel 1:17\nabout how God prepared Daniel? What can you learn from Daniel’s words and actions after he received the Lord’s help? (see\nDaniel 2:19–30\n).\nDaniel 7:13–14\nJesus Christ is the Son of the Eternal Father.\nDuring the Savior’s earthly ministry, many Jews considered the title “Son of man” from\nDaniel 7:13\nto refer to the coming Messiah. What do you learn about the Messiah from\nDaniel 7:13–14\n? (see also\nMoses 6:57\n).\nThe Savior often referred to himself as “the Son of man.” Consider reviewing some examples:\nMatthew 25:31\n;\nMark 9:31\n;\n10:45\n. What is He teaching about Himself in these verses? In\nMark 14:61–64\n, Jesus used this title on the last day of His mortal life. Note the reaction from the people who heard His declaration. How does Daniel’s prophecy about the Son of Man affect your feelings about what happened to Him in\nMark 15\n?\nJust as Jesus was hated for declaring that He was “the Son of man,” you might also face persecution for declaring the truth. Compare the prophecy in\nDaniel 7:13–14\nwith the promises in\nDoctrine and Covenants 121:29, 46\n.\nSee also\nDoctrine and Covenants 49:6\n; Guide to the Scriptures, “\nSon of Man\n,” Gospel Library.\nIdeas for Teaching Children\nDaniel 1\n;\n3\n;\n6\nJesus will help me do what is right even when it’s hard.\nTo help your children learn from the inspiring stories in the book of Daniel, you could find pictures of the events in\nDaniel 1\n,\n3\n, and\n6\n(see this week’s activity page or the\nGospel Art Book\n,\nnos. 23\n,\n25\n,\n26\n). Then you could place the pictures face down and invite a child to turn one over and talk about the story it represents. (For help, see “\nDaniel and His Friends\n,” “\nShadrach, Meshach, and Abed-nego\n,” and “\nDaniel and the Lions’ Den\n” in\nOld Testament Stories\n, 154–56, 160–62, 163–65.)\n1:39\nDaniel and His Friends\n1:39\nShadrach, Meshach, and Abed-nego\n1:45\nDaniel and the Lions’ Den\nHelp your children think of situations when they might be pressured to make a wrong choice, like Daniel and his friends were in\nDaniel 1\n,\n3\n, and\n6\n. Share with each other how you have been blessed for making the right choice even when it was hard. You could also sing together a song related to this topic, such as “\nChoose the Right\n” (\nHymns\n, no. 239).\nTrusting the Wisdom of the Word\nDaniel 1:1–17\nHeavenly Father wants me to take care of my body.\nReading the story about Daniel and his friends refusing the king’s meat and wine may inspire a conversation about the law of health Heavenly Father has given us today (see\nDoctrine and Covenants 89\n). Maybe you could look for the blessings Daniel and his friends received and compare them to the blessings promised in the Word of Wisdom (see\nDaniel 1:15–17\nand\nDoctrine and Covenants 89:18–21\n).\nDaniel 2\nThe Church of Jesus Christ of Latter-day Saints is the kingdom of God on earth.\nAs you read\nDaniel 2:31–35, 44–45\nwith your children, you could invite them to draw a picture of Nebuchadnezzar’s dream. Help them understand the stone in the dream represents The Church of Jesus Christ of Latter-day Saints. What do we learn about the Church from this dream? Your children could name some things Heavenly Father did to set up His Church in the latter days. If they need help, you could show pictures of events from the Restoration of the Church (see\nGospel Art Book\n,\nnos. 90–95\n).\nDaniel 6\nHeavenly Father wants me to pray often.\nWhy was praying to Heavenly Father so important to Daniel? Perhaps you and your children could talk about that question as you read\nDaniel 6\ntogether. Then you could tell each other why praying is important to you. Your children might enjoy drawing pictures of themselves praying in various situations. They could use their drawings to teach each other that we can pray to Heavenly Father no matter where we are or what we need.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 46: Lesson 142: Lesson 142—Daniel 1This lesson can encourage students strengthen their commitment to obey the Lord’s Word of Wisdom.; Lesson 143: Lesson 143—Daniel 2This lesson can help students strengthen their testimony of the divine Restoration of The Church of Jesus Christ of Latter-day Saints....",
      "content": "\n--- Lesson 142 ---\nWhen we encounter situations that test our resolve to obey the Lord’s commandments, do we give in or stand firm? As servants in King Nebuchadnezzar’s court, Daniel and his friends were instructed to break the Lord’s revealed health laws, but they stood firm. This lesson can help students strengthen their commitment to obey the Lord’s Word of Wisdom. Student preparation: Invite students to study the overview for “ Word of Wisdom ” in Topics and Questions in Gospel Library. Encourage them to discuss how they or others have been blessed by keeping the Lord’s Word of Wisdom. Possible Learning Activities What would you do? Consider beginning class by describing a young person who loves to accept challenges to try new things, like the following example. You might change the name and activities to make them more relatable to your students. Mateo is an active member of The Church of Jesus Christ of Latter-day Saints. He has a reputation for trying new things, so his friends often give him challenges such as the following: Once a friend challenged him to run a marathon. Mateo took the challenge. Once a friend challenged him to dive into an ice-cold lake. Mateo took the challenge. Once a friend challenged him to introduce himself to a new girl at school. Mateo took the challenge. After reading the next challenge, pause and ask the question below. One day Mateo’s friends challenge him to drink alcohol at a party. How do you think Mateo might respond? Why? You might ask students if pressure to break the Word of Wisdom is common in your area. They could also describe situations where they might feel pressure to break it. Consider encouraging students who might have broken this commandment to remember that the Lord will help them as they turn to Him and repent. Reassure students that the Lord loves them and invites them to keep trying. To evaluate their own commitment to obey the Word of Wisdom, students could answer the following in their study journals. How do you think you would respond in a similar situation? Why? How do you think you would respond if you were offered something more common like coffee or tea? As you study Daniel 1 today, listen for thoughts and feelings Heavenly Father might give you through the Holy Ghost. Look for ways to strengthen your commitment to obey the Lord’s Word of Wisdom. Daniel obeyed the Lord Around 606 BC, Nebuchadnezzar, king of Babylon, attacked Jerusalem and took certain Israelites captive into Babylon. The king commanded that some of the Israelite youth be trained for service in his household. Among these youth were four young men named Daniel, Hananiah, Mishael, and Azariah. In Babylon, their names were changed to Belteshazzar, Shadrach, Meshach, and Abed-nego (see Daniel 1:1–7 ). As students read the following verses, consider pausing after verse 10 to ask the questions below. Alternately, you could invite students to follow along in their scriptures as you show the video “ God Gave Them Knowledge” (available at ChurchofJesusChrist.org ) from time code 0:52 to 5:15, pausing at time code 4:18 to discuss the questions. 13:49 Read Daniel 1:5, 8–14 , looking for what the king instructed Daniel and his friends to do. Why might this request have been challenging for Daniel and his friends? Why do you think not eating and drinking certain things would be worth risking the king’s anger? You might remind students that in Daniel’s time, Israelites followed the law of Moses, which included certain dietary restrictions (see Deuteronomy 14 ). You might also explain that “pulse” refers to “foods made of seeds, grains, etc.” ( Daniel 1:12 , footnote a ). Blessings of obeying the Lord To help students discover how the Lord blessed Daniel and his friends, you could organize students into partnerships. As they read the following verses, invite one partner to look for how the Lord blessed Daniel and his friends physically, and invite the other partner to look for how the Lord blessed them spiritually. Then invite partnerships to share what they found. Have them mark the physical and spiritual blessings in two distinct ways (such as highlighting with different colors or underlining one and highlighting the other). Read Daniel 1:15–20 , looking for how the Lord blessed Daniel and his friends for their obedience. When students identify attributes and characteristics of Jesus Christ, they can increase their desire to trust and obey Him. One way to help students do this is by creating search questions, like the following, for students to ponder. (For additional training on creating search questions to help students identify attributes and characteristics of Jesus Christ, see “ Create Search Questions to help students identify roles, titles, symbols, and attributes of Jesus Christ ” in Teacher Development Skills .) Read verses 15–20 one more time, but this time ponder what you learn about Heavenly Father and Jesus Christ. What do these verses teach you about God? How could this understanding strengthen your desire to trust and obey Him? You might explain that like in Daniel’s day, the Lord has revealed a health law for His children today. It is known as the Word of Wisdom (see Doctrine and Covenants 89 ). The following activity could help students study the Word of Wisdom. Consider providing paper and art supplies as well as copies of For the Strength of Youth: A Guide for Making Choices for students without access to Gospel Library. You might limit time spent on this activity to allow time for the experience at the end of the lesson. Imagine that you have been asked to create a poster that describes something unique about your religion. You decide to create your poster about the Word of Wisdom. Use some or all of the following sources to determine what to include: Doctrine and Covenants 89:18–21 Daniel 1:15–20 “Word of Wisdom” in the Guide to the Scriptures or Topics and Questions (Gospel Library) or in the “ What about … ? ” section of For the Strength of Youth: A Guide for Making Choices (2022) “ The Word of Wisdom: What It Is, What It Isn’t ,” New Era , Aug. 2019, 26–28 Be sure to include a statement of truth about the Word of Wisdom on your poster. This truth can be from Daniel’s experience or from other sources. Invite students to share their posters and statements of truth with the class. Among the truths they might share, emphasize the following: As we keep the Lord’s commandment to obey the Word of Wisdom, He will bless us physically and spiritually. ( Note: In Lesson 160: “ Assess Your Learning 10 ,” students will look back on the posters they created. It might help to collect the posters or to display them until you teach that lesson so that students will have access to them.) People who don’t yet understand the purpose of the Word of Wisdom might view it as unnecessary restrictions that the Church imposes. Take a minute to ponder blessings that come from keeping the Word of Wisdom and the results of breaking it for individuals, families, and society. How do you think the Word of Wisdom shows God’s love for His children? Commit now to obey the Lord To help students strengthen their commitment to obey the Lord’s Word of Wisdom, you could invite them to complete the following sentences in their study journals. As they prepare to write, ask them to consider how their commitment to obey the Word of Wisdom can strengthen their relationship with Heavenly Father and Jesus Christ. I want to obey the Word of Wisdom because … One thing I can do that will help me obey the Word of Wisdom is … You might conclude by sharing your testimony of Jesus Christ and the blessings you’ve seen from obeying His Word of Wisdom.\n\n\n--- Lesson 143 ---\nThe Lord showed Daniel a vision of the latter days, when the Lord would set up His kingdom upon the earth. The Lord’s kingdom, The Church of Jesus Christ of Latter-day Saints, will fill the earth and stand forever. This lesson can help students strengthen their testimony of the divine Restoration of The Church of Jesus Christ of Latter-day Saints. Student preparation: Invite students to choose one of the following ideas to prepare for this lesson: Possible Learning Activities Testimony of the Restoration Consider inviting students to share any questions they remember that are asked during a temple recommend interview. If helpful, you could point to the temple recommend questions in the appendix of For the Strength of Youth: A Guide for Making Choices . After students have shared a few questions they remember, you could write the following question on the board. Think about how you would respond to the following temple recommend question: Do you have a testimony of the Restoration of the gospel of Jesus Christ? As needed, explain that the Restoration is “God’s reestablishment of the truths and ordinances of His gospel among men on earth” (Guide to the Scriptures, “ Restoration of the Gospel ,” Gospel Library). Consider writing Why or why not? after the question on the board. Invite students to ponder their answers to both questions. As you study Daniel 2 today, invite the Holy Ghost to help you recognize truths that can strengthen your testimony that Heavenly Father and Jesus Christ restored The Church of Jesus Christ of Latter-day Saints to the earth. King Nebuchadnezzar’s dream To help students understand the context of Daniel 2 , a student could read or summarize the following information. Alternatively, you could watch “ God Gave Them Knowledge ,” available at ChurchofJesusChrist.org , from time code 6:17 to 13:00. 13:49 King Nebuchadnezzar of Babylon had a dream that troubled him. None of his wise men could tell him what the dream was or how to interpret it. As a result, the king commanded that all his wise men, including Daniel, be killed. Before that could happen, God revealed the dream and its interpretation to Daniel (see Daniel 2:1–26 ). Before sharing what God had revealed about the dream, Daniel taught the king that God was the source of the interpretation. Daniel also revealed that the dream was about “what shall be in the latter days” ( Daniel 2:28 ). Consider placing students in small groups. Give each group a copy of the handout titled “ King Nebuchadnezzar’s Dream .” Then display the instructions below, giving students time to complete step one before displaying step two. Read Daniel 2:31–43 and label the elements of King Nebuchadnezzar’s dream on the handout with the interpretations you discover. Include the verses where you found the interpretations. Help students identify that King Nebuchadnezzar’s Babylonian kingdom was the head of gold ( verse 38 ). The other parts of the image (or statue) represent other kingdoms that would come after Babylon. Daniel 2:44–45 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Daniel 2:44–45 , looking for words and phrases that describe the stone. Write these words around the stone on your handout. As students read the following statement, invite them to write what the stone represents inside the stone on their handout. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles explained what the stone represents: The Church [of Jesus Christ of Latter-day Saints] is that prophesied latter-day kingdom, not created by man but set up by the God of heaven and rolling forth as a stone “cut out of the mountain without hands” to fill the earth [ Daniel 2:45 ; see also verse 35 ]. (“ Why the Church ,” Ensign or Liahona , Nov. 2015, 111) What can we learn about God’s restored Church from this statement and from the Lord’s revelation to Daniel? Using students’ words, help them identify that God established The Church of Jesus Christ of Latter-day Saints, which will fill the whole earth and stand forever . Consider sharing that the Lord Himself declared that His gospel would fill the whole earth (see Doctrine and Covenants 65:2 ). Students could cross-reference or link Doctrine and Covenants 65:2 to Daniel 2:35 . You might explain that “filled the whole earth” ( Daniel 2:35 ) does not mean that everyone will join the Lord’s Church, but that it will spread throughout the earth (see 1 Nephi 14:12–14 ). How do the phrases in Daniel 2:44–45 help us understand this truth? The stone rolls forth After interpreting King Nebuchadnezzar’s dream, Daniel shared his testimony that it was “certain, and the interpretation thereof sure” ( Daniel 2:45 ). As we develop our personal testimonies, the truths of the Savior’s restored Church can become certain and sure to us through the power of the Holy Ghost. President Russell M. Nelson shared what we need to do to develop sure testimonies for ourselves: Now, as President of His Church, I plead with you. … Do the spiritual work to find out for yourselves [that the Savior’s Church has been restored], and please do it now. Time is running out. (“ Come, Follow Me ,” Ensign or Liahona , May 2019, 91) The following activity can help students consider what spiritual work they need to do to strengthen their testimony of the divine Restoration of The Church of Jesus Christ of Latter-day Saints. Consider placing students in small groups to do the activity. Help students find the Restoration proclamation . It can be found in Gospel Library and in some study journals. You might provide paper copies for students who don’t have access to it. As an alternative to the proclamation, you could show “ Hear Him ,” available at ChurchofJesusChrist.org , from time code 17:05 to 22:55. 24:24 Read “ The Restoration of the Fulness of the Gospel of Jesus Christ: A Bicentennial Proclamation to the World .” Look for truths the Savior has revealed and events He has brought forth in restoring His Church. Discuss why these truths and events are important to the Restoration of the Savior’s Church. Discuss the spiritual work someone could do to strengthen their testimony that Jesus Christ restored His Church. After sufficient time, have each group share one truth or event that stood out to them. Invite them to share why it’s important to have a testimony of this truth or event and the spiritual work someone could do to gain or strengthen their testimony of it. After each group has had the opportunity to share, invite students to answer the following questions in their study journals. What truth or event of the Savior’s restored Church would you like to strengthen your testimony of? What spiritual work can you do to strengthen your testimony of the Savior’s divine Restoration of His Church? Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Daniel 2:44–45 is “God shall ‘set up a kingdom, which shall never be destroyed.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 144 ---\nSometimes the Lord might miraculously deliver us from our trials. Other times He might not deliver us in the way or with the timing we hope. Either way, we can strive to be like Shadrach, Meshach, and Abed-nego and trust in the Lord, regardless of how and when He chooses to bless us. This lesson can help students feel a desire to trust in Jesus Christ regardless of the outcome. Student preparation: Invite students to think of faithful disciples of Christ who were miraculously delivered from their trials. Then have them think of other faithful disciples who were not delivered. They could ponder what these accounts teach them about trusting in the Lord. Possible Learning Activities Exercising faith in Jesus Christ Consider beginning class by sharing the following story about Elder Bowen’s son, Tyson. Note: The video version of the statement includes additional information that is not included in the written statement. Elder Shayne M. Bowen of the Seventy shared the following personal experience: 11:26 When [my son] Tyson was eight months old, he aspirated [or inhaled] a piece of chalk that he had found on the carpet. The chalk lodged in Tyson’s throat, and he quit breathing. His older brother brought Tyson upstairs, frantically calling, “The baby won’t breathe. The baby won’t breathe.” We began to administer CPR and called 911. The paramedics arrived and rushed Tyson to the hospital. In the waiting room we continued in fervent prayer as we pled to God for a miracle. (“ Because I Live, Ye Shall Live Also ,” Ensign or Liahona , Nov. 2012, 16) How might different potential outcomes of this situation affect the family’s faith in God? Elder Bowen continued: 11:26 After what seemed a lifetime, the doctor came into the room and said, “I am so sorry. There is nothing more we can do. Take all the time you need.” She then left. As we entered the room where Tyson lay, we saw our lifeless little bundle of joy. … At that moment it felt as if our world had come to an end. (“ Because I Live, Ye Shall Live Also ,” Ensign or Liahona , Nov. 2012, 16) Like the Bowens, you might have experiences where God does not bless you in the way that you had hoped. Ponder experiences you or your family have had where you felt the Lord either blessed you or did not bless you with the outcome you wanted. It might help to display the following questions. Ask yourself the following questions: How have your experiences influenced your faith in Heavenly Father and Jesus Christ? Do you feel you can trust in Them, regardless of the blessings you do or do not receive? Why or why not? As you study Daniel 3 today, pay attention to any impressions from the Holy Ghost that can help strengthen your faith in Heavenly Father and Jesus Christ no matter the outcome. A difficult decision Consider writing the following names on the board: Shadrach , Meshach , and Abed-nego . Display the image of a golden idol and invite students to share what they know about this account. You might want to summarize the context below in your own words. The king of Babylon, Nebuchadnezzar, made a large golden image, or statue. It was approximately 90 feet (27.4 meters) high and 9 feet (2.74 meters) wide (see Daniel 3:1 ). The king commanded everyone to fall down and worship the image when certain music was played (see Daniel 3:4–5 ). People who did not worship the golden image would be thrown into “a burning fiery furnace” ( Daniel 3:6 ). Considering the consequences for not worshipping this image, ponder what you think you would have done if you were there. Shadrach, Meshach, and Abed-nego chose to honor God by not worshipping the image (see Daniel 3:12 ). To help students study the following verses, you could invite five willing students to read the roles of Nebuchadnezzar, Shadrach, Meshach, Abed-nego, and a narrator. The students who read for Shadrach, Meshach, and Abed-nego could each read one verse in Daniel 3:16–18 . Read Daniel 3:13–18 , looking for what you learn from these men about faith in Jesus Christ. What lessons do you learn about faith in Jesus Christ? Help students see that we can show our faith in Jesus Christ by trusting in Him, regardless of the outcome . Consider inviting students to mark the phrase “is able to deliver us” ( verse 17 ). Point out that knowing God can bless us with what we hope for shows faith in Him. Then invite students to mark the phrase “but if not” ( verse 18 ). Ask students what they learn about faith in God from these men’s willingness to accept that God might not choose to bless them with what they hoped for. What is the difference between having faith in Jesus Christ versus faith in an outcome? What are modern situations where someone would need to show faith in Jesus Christ rather than faith in an outcome? The outcome of our faith Consider displaying the picture of the fiery furnace from the beginning of the lesson. Students could study the following verses and discuss the questions below in pairs or small groups. Read Daniel 3:19–28 , marking words or phrases that impress you from what Shadrach, Meshach, and Abed-nego experienced. To help students visualize these verses, you could show the video “ Shadrach, Meshach, and Abed-nego ” (1:39), available at ChurchofJesusChrist.org . 1:39 What impressed you from this story? What do you learn about God from this account? It might help to explain that even though God delivered Shadrach, Meshach, and Abed-nego, He might not always deliver us from negative outcomes. To demonstrate this, students could complete the following activity. Think of scriptural accounts where people exercised faith in Jesus Christ and still experienced negative outcomes. Consider writing But if not … on the board. Students could then list underneath this phrase the people they thought of. If time allows, they could search the accounts of these people in the scriptures, looking for evidence that these people trusted in God. The following are examples you could refer students to as needed: Nephi (see 1 Nephi 18:10–16 ), Abinadi (see Mosiah 17:9–20 ), Joseph and Hyrum Smith (see Doctrine and Covenants 135:1 ), or various righteous individuals (see Hebrews 11:36–40 ). How do these accounts help you trust in the Lord regardless of the outcome? What do you know about Heavenly Father and Jesus Christ that helps you want to trust in Them regardless of the outcome? Depending on Christ Consider reminding students of Elder Bowen’s experience. The following statement can help them see how he trusted in the Lord despite the outcome he experienced. Elder Bowen continued sharing his experience: As I felt the guilt, anger, and self-pity trying to consume me, I prayed that my heart could change. Through very personal sacred experiences, the Lord gave me a new heart, and even though it was still lonely and painful, my whole outlook changed. I was given to know that I had not been robbed but rather that there was a great blessing awaiting me if I would prove faithful. My life started to change, and I was able to look forward with hope, rather than look backward with despair. … I testify that because of Him, even our Savior, Jesus Christ, those feelings of sorrow, loneliness, and despair will one day be swallowed up in a fulness of joy. I testify that we can depend on Him. (“ Because I Live, Ye Shall Live Also ,” Ensign or Liahona , Nov. 2012, 17) How can Elder Bowen’s experience help you? When have you or someone you know shown faith in Heavenly Father and Jesus Christ by trusting in Them regardless of the outcome? In your study journal, write what helps you want to trust in Heavenly Father and Jesus Christ regardless of the outcome. You could include how the lessons you learned from Daniel 3 can help you in the trials you face or what you hope to remember in the future. You could invite willing students to share. Consider concluding with your own testimony or feelings about trusting in the Lord.\n\n\n--- Lesson 145 ---\nWhat story from the Old Testament has taught you a meaningful gospel principle? Jesus Christ Himself used the Old Testament to help His disciples understand His teachings (for example, see Luke 4:24–27 ). One powerful story that illustrates many gospel truths is the account of Daniel’s faith and trust in the Lord, even when facing the lions’ den. This lesson can help students identify and share gospel truths from Daniel 6 . Student preparation: Invite students to reflect on the scripture stories they have learned from the Old Testament in their study this year. They could select a story that has been meaningful to them and prepare to share a gospel truth that story helped them understand. Possible Learning Activities The moral of the story To help students practice identifying the moral of a story, select a local fable or popular folktale. For example, you could use a story like “The Ugly Duckling.” As an alternative, you could show the video “Things That Matter Most” from time code 0:00 to 0:22, available at ChurchofJesusChrist.org . Then ask the following questions: 0:33 What message could this story teach? How could that message illustrate a truth about Jesus Christ or His gospel? Just as we can find truths in common fables and stories, we can learn to find important gospel truths in the inspired scripture accounts that Heavenly Father and Jesus Christ have preserved for us. To help us understand how scripture stories teach gospel truths, Elder Jay E. Jensen of the Seventy taught: As you read and study [scripture] stories, you will see a word, a phrase, or a principle that seems as applicable today as it was in the past. As you continue your prayerful study, other principles will become apparent. As you put the principles together, you will begin to bridge the gap between the prophets and people who lived in the past— they-there-then —and us in our day— I-here-now . (“ Scripture Stories as Patterns for Our Lives ,” Ensign , July 2009, 21) What stands out to you from Elder Jensen’s message? What Old Testament story helped you understand Jesus Christ or His gospel better? The following self-assessment could help students select the part of the identifying truths in scripture stories skill they could practice today. On a scale of 1 to 5, rate your confidence in using the following scripture study skills: I can identify gospel truths in a scripture story. I can easily see how a scripture story teaches about Jesus Christ. I can apply scripture stories to my life. I can effectively share what I learn from scripture stories with others. Today you will study a story in the book of Daniel and explain what you learn from it. You might focus your efforts on the skill you feel the least confident about. Invite the Holy Ghost to help increase your ability to identify truths in scripture stories and to teach others what you learn about Jesus Christ, His life, and His gospel. Daniel cast into the lions’ den Many years after Daniel and his friends were taken captive into Babylon, the nation was conquered by the Medes and the Persians. Darius, a Mede, was made king of Babylon (see Daniel 5:30–31 ). The following activity can help students practice identifying gospel truths in scripture stories by studying the account of Daniel being cast into the lions’ den (see Daniel 6 ). It might be helpful for students to have a brief overview of the story before they search for gospel truths in it. The following are some ways you could summarize the story: You could have students share the story, organizing them into groups to read a section. Each group could then summarize their part of the story for the class. One way to divide the reading would be: Daniel 6:1–5 Daniel 6:6–11 Daniel 6:12–17 Daniel 6:18–23 Daniel 6:24–28 You could summarize the entire story for the class. If available, you could use the images found in the article “ Daniel and the Lions ” (Friend, Nov. 2018, FJ4–FJ6) or the video “ Daniel and the Lions’ Den ” (1:46), available at ChurchofJesusChrist.org , to help you summarize the story. 1:45 To help students practice identifying gospel principles from scripture stories, use the handout “ Scripture Stories Teach Gospel Truths .” Because students will present what they learn to the class, it might be best to have them work with a partner or in small groups. Consider pairing students who might feel more anxious about presenting with students who might feel more comfortable. Open PDF As students use the handout to prepare their lessons, you might walk around the room to see what gospel truths they are finding. If they are struggling, consider how you could help them learn to identify truths in the account. Examples of truths they might identify are: As disciples of Christ, we will face opposition because of our beliefs ( Daniel 6:1–5 ). The Lord will bless our efforts when we stand up to worldly pressure. ( Daniel 6:6–16 ). As we do what is right and trust the Lord, our righteous example can influence others ( Daniel 6:16–28 ). Share what you have learned After students have completed the handout, invite them to share the lesson they prepared with another group or with the class. If students don’t share parts of the story that remind them of Jesus Christ, you might point out some comparisons such as the following: Daniel and Jesus both did Heavenly Father’s will, even when facing death (see Daniel 6:7, 10 ; John 6:38 ). Daniel and Jesus both miraculously emerged alive from a pit that was covered by a stone (see Daniel 6:17, 23 ; Mark 15:46 ; 16:4–6 ). You could encourage students to take the lessons they prepared home and share them with a family member or friend. To conclude class, consider sharing how you have been blessed by messages of Jesus Christ or His gospel from scripture stories. Invite students to continue to look for impressions from the Holy Ghost to help them see gospel truths in their personal scripture study.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Daniel 1",
      "content": "1. In the third year of the reign ofJehoiakimking of Judah cameNebuchadnezzarking of Babylon unto Jerusalem, and besieged it.\n2. And the Lord gave Jehoiakim king of Judah into his hand, withpart of thevesselsof the house of God: which he carried into the land ofShinarto the house of his god; and he brought thevesselsinto the treasure house of his god.\n3. And the king spake unto Ashpenazthemaster of his eunuchs, that he should bringcertainof the children of Israel, and of the kingsseed, and of the princes;\n4. Children in whomwasno blemish, butwell favoured, and skilful in all wisdom, and cunning in knowledge, and understanding science, and such ashadability in them to stand in the kings palace, and whom they might teach the learning and the tongue of the Chaldeans.\n5. And the king appointed them dailyprovisionof the kingsmeat, and of the wine which he drank: so nourishing them three years, that at the end thereof they mightstandbefore the king.\n6. Now among these were of the children of Judah,Daniel,Hananiah, Mishael, and Azariah:\n7. Unto whom the prince of the eunuchs gavenames: for he gave unto Danielthenameof Belteshazzar; and to Hananiah, of Shadrach; and to Mishael, of Meshach; and to Azariah, of Abed-nego.\n8. But Danielpurposedin his heart that he would notdefilehimself with the portion of the kings meat, nor with thewinewhich he drank: therefore he requested of the prince of the eunuchs that he might not defile himself.\n9. Now God had brought Daniel intofavourandtender lovewith the prince of the eunuchs.\n10. And the prince of the eunuchs said unto Daniel, Ifearmy lord the king, who hath appointed your meat and your drink: for why should he see your facesworse likingthan the children whichareof yoursort? then shall ye makemeendanger my head to the king.\n11. Then said Daniel toMelzar, whom the prince of the eunuchs had set over Daniel, Hananiah, Mishael, and Azariah,\n12. Prove thy servants, I beseech thee, ten days; and let them give uspulseto eat, and water to drink.\n13. Then let ourcountenancesbe looked upon before thee, and the countenance of the children that eat of the portion of the kings meat: and as thou seest, deal with thy servants.\n14. So he consented to them in this matter, and proved them ten days.\n15. And at the end of ten days their countenances appeared fairer and fatter in flesh than all the children which did eat the portion of the kings meat.\n16. Thus Melzar took away the portion of their meat, and the wine that they should drink; and gave them pulse.\n17. As for these four children, God gave themknowledgeand skill in alllearningand wisdom: and Daniel hadunderstandingin allvisionsand dreams.\n18. Now at the end of the days that the king had said he should bring them in, then the prince of the eunuchs brought them in before Nebuchadnezzar.\n19. And the king communed withthem; and among them all was found none like Daniel, Hananiah, Mishael, and Azariah: therefore stood they before the king.\n20. And in all matters of wisdomandunderstanding, that the king inquired of them, he found them ten times better than all themagiciansandastrologers thatwerein all his realm.\n21. And Daniel continuedevenunto the first year of king Cyrus.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Daniel 2",
      "content": "1. And in the second year of the reign of Nebuchadnezzar Nebuchadnezzar dreameddreams, wherewith his spirit wastroubled, and his sleep brake from him.\n2. Then the king commanded to call themagicians, and the astrologers, and the sorcerers, and the Chaldeans, for to shew the king his dreams. So they came and stood before the king.\n3. And the king said unto them, I have dreamed dream, and my spirit was troubled to know the dream.\n4. Then spake the Chaldeans to the king inSyriack, O king, live for ever: tell thy servants the dream, and we willshewthe interpretation.\n5. The king answered and said to the Chaldeans, The thing isgone from me: if ye will not make known unto me the dream, with the interpretation thereof, ye shall becutin pieces, and your houses shall be made dunghill.\n6. But if ye shew the dream, and the interpretation thereof, ye shall receive of me gifts and rewards and great honour: therefore shew me the dream, and the interpretation thereof.\n7. They answered again and said, Let the king tell his servants the dream, and we will shew the interpretation of it.\n8. The king answered and said, I know of certainty that ye would gain the time, because ye see the thing is gone from me.\n9. But if ye will not make known unto me the dream,there is butone decree for you: for ye have prepared lying and corrupt words to speak before me,tillthe time be changed: therefore tell me the dream, and I shall know that ye can shew me the interpretation thereof.\n10. The Chaldeans answered before the king, and said, There is not man upon the earth that can shew the kings matter: thereforethere isno king, lord, nor ruler,thatasked such things at any magician, or astrologer, or Chaldean.\n11. Andit isa rare thing that the king requireth, and there is none other that can shew it before the king, except thegods, whose dwelling is not with flesh.\n12. For this cause the king was angry and very furious, and commanded to destroy all the wisemenof Babylon.\n13. And the decree went forth that the wisemenshould be slain; and they sought Daniel and his fellows to be slain.\n14. Then Daniel answered with counsel and wisdom to Arioch the captain of the kings guard, which was gone forth to slay the wisemenof Babylon:\n15. He answered and said to Arioch the kings captain, Whyisthe decreesohastyfrom the king? ThenArioch made the thing known to Daniel.\n16. Then Daniel went in, and desired of the king that he would give him time, and that he would shew the king the interpretation.\n17. Then Daniel went to his house, and made the thing known toHananiah, Mishael, and Azariah, his companions:\n18. That they would desire mercies of the God of heaven concerning this secret; that Daniel and his fellows should not perish with the rest of the wisemenof Babylon.\n19. Then was thesecretrevealed unto Daniel in nightvision. Then Daniel blessed the God of heaven.\n20. Daniel answered and said, Blessed be the name of God for ever and ever: forwisdomand might are his:\n21. And he changeth thetimesand theseasons: heremovethkings, and setteth up kings: he givethwisdomunto the wise, andknowledgeto them that know understanding:\n22. Herevealeththe deep and secret things: heknowethwhatisin the darkness, and thelightdwelleth with him.\n23. I thank thee, and praise thee, O thou God of my fathers, who hast given me wisdom and might, and hast made known unto me now what we desired of thee: for thou hastnowmade known unto us the kings matter.\n24. Therefore Daniel went in unto Arioch, whom the king had ordained to destroy the wisemenof Babylon: he went and said thus unto him; Destroy not the wisemenof Babylon: bring me in before the king, and I will shew unto the king the interpretation.\n25. Then Arioch brought in Daniel before the king in haste, and said thus unto him, I have found man of the captives of Judah, that will make known unto the king the interpretation.\n26. The king answered and said to Daniel, whosenamewasBelteshazzar, Art thou able to makeknownunto me the dream which I have seen, and the interpretation thereof?\n27. Daniel answered in the presence of the king, and said, The secret which the king hath demanded cannot the wisemen,theastrologers, the magicians, the soothsayers, shew unto the king;\n28. But there is God in heaven thatrevealethsecrets, and maketh known to the king Nebuchadnezzar what shall be in the latter days. Thydream, and the visions of thy head upon thy bed, are these;\n29. As for thee, O king, thy thoughts cameinto thy mindupon thy bed, what should come to pass hereafter: and he thatrevealethsecrets maketh known to thee what shall come to pass.\n30. But as for me, this secret is not revealed to me foranywisdomthat I have more than any living, butfortheirsakes that shall make known the interpretation to the king, and that thou mightest know the thoughts of thy heart.\n31. Thou, O king, sawest, and behold greatimage. This great image, whose brightnesswasexcellent,stood before thee; andtheform thereofwasterrible.\n32. This images headwasof fine gold, his breast and his arms of silver, his belly and his thighs of brass,\n33. His legs of iron, his feet part of iron and part of clay.\n34. Thou sawest till that astonewas cut outwithouthands, which smote the image upon his feetthat wereof iron and clay, and brake them to pieces.\n35. Then was the iron, the clay, the brass, the silver, and the gold, broken to pieces together, and became like the chaff of the summer threshingfloors; and the wind carried them away, that noplacewas found for them: and thestonethat smote the image became great mountain, and filled the whole earth.\n36. Thisisthe dream; and we will tell the interpretation thereof before the king.\n37. Thou, O king,arta king of kings: for the God of heaven hath given thee akingdom, power, and strength, and glory.\n38. And wheresoever the children of men dwell, the beasts of the field and the fowls of the heaven hath he given into thine hand, and hath made thee ruler over them all. Thouartthisheadof gold.\n39. And after thee shall arise anotherkingdominferior to thee, and another third kingdom of brass, which shall bearruleover all the earth.\n40. And the fourthkingdomshall be strong as iron: forasmuch as iron breaketh in pieces and subdueth allthings:and as iron that breaketh all these, shall it break in pieces and bruise.\n41. And whereas thou sawest the feet and toes, part of potters clay, and part of iron, the kingdom shall be divided; but there shall be in it of the strength of theiron, forasmuch as thou sawest the iron mixed with miry clay.\n42. Andasthe toes of the feetwerepart of iron, and part of clay,sothe kingdom shall be partly strong, and partly broken.\n43. And whereas thou sawest iron mixed with miry clay, they shall mingle themselves with the seed of men: but they shall not cleave one to another, even as iron is not mixed with clay.\n44. And in thedaysof thesekingsshall the God of heavensetup akingdom, which shall never bedestroyed: and thekingdomshall not be left to other people,butit shallbreakin pieces andconsumeall thesekingdoms, and it shall stand for ever.\n45. Forasmuch as thou sawest that thestonewas cut out of the mountain without hands, and that it brake in pieces the iron, the brass, the clay, the silver, and the gold; the great God hath madeknownto the king what shall come to pass hereafter: and the dreamiscertain, and the interpretation thereof sure.\n46. Then the king Nebuchadnezzar fell upon his face, andworshippedDaniel, and commanded that they should offer an oblation and sweet odours unto him.\n47. The king answered unto Daniel, and said, Of truthit is,that yourGodisaGodof gods, and aLordofkings, and revealer of secrets, seeing thou couldest reveal this secret.\n48. Then the king made Daniel agreatman, and gave him many great gifts, and made him ruler over the whole province of Babylon, and chief of the governors over all the wisemenof Babylon.\n49. Then Daniel requested of the king, and hesetShadrach, Meshach, and Abed-nego, over the affairs of the province of Babylon: but Danielsatin the gate of the king.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Daniel 3",
      "content": "1. Nebuchadnezzar the king made an image of gold, whose heightwasthreescore cubits,andthe breadth thereof six cubits: he set it up in the plain of Dura, in the province of Babylon.\n2. Then Nebuchadnezzar the king sent to gather together the princes, the governors, and the captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, to come to the dedication of the image which Nebuchadnezzar the king had set up.\n3. Then the princes, the governors, and captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, were gathered together unto the dedication of the image that Nebuchadnezzar the king had set up; and they stood before the image that Nebuchadnezzar had set up.\n4. Then an herald cried aloud, To you it is commanded, O people, nations, andlanguages,\n5. Thatat what time ye hear the sound of the cornet, flute,harp,sackbut, psaltery,dulcimer, and all kinds of musick, ye fall down and worship the golden image that Nebuchadnezzar the king hath set up:\n6. And whoso falleth not down and worshippeth shall the same hour becastinto the midst of aburningfiery furnace.\n7. Therefore at that time, when all the people heard the sound of the cornet, flute, harp, sackbut, psaltery, and all kinds of musick, all the people, the nations, and the languages, fell downandworshipped the golden image that Nebuchadnezzar the king had set up.\n8. Wherefore at that time certain Chaldeans came near, and accused the Jews.\n9. They spake and said to the king Nebuchadnezzar, O king, live for ever.\n10. Thou, O king, hast made decree, that every man that shall hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, shall fall down and worship the golden image:\n11. And whoso falleth not down and worshippeth,thathe should be cast into the midst of burning fiery furnace.\n12. There are certain Jews whom thou hastsetover the affairs of the province of Babylon, Shadrach, Meshach, and Abed-nego; these men, O king, have not regarded thee: they serve not thy gods, nor worship the golden image which thou hast set up.\n13. Then Nebuchadnezzar inhisrage and fury commanded to bring Shadrach, Meshach, and Abed-nego. Then they brought these men before the king.\n14. Nebuchadnezzar spake and said unto them,Is ittrue, O Shadrach, Meshach, and Abed-nego, do not yeserve my gods, nor worship the golden image which I have set up?\n15. Now if ye be ready that at what time ye hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, ye fall down and worship the image which I have made;well:but if ye worship not, ye shall be cast the same hour into the midst of burning fiery furnace; and whoisthat God that shall deliver you out of my hands?\n16. Shadrach, Meshach, and Abed-nego, answered and said to the king, O Nebuchadnezzar, wearenotcarefulto answer thee in this matter.\n17. If it beso,our God whom we serve is able todeliverus from the burning fiery furnace, and he will deliverusout of thine hand, O king.\n18. But if not, be it known unto thee, O king, that we will notservethy gods, nor worship the golden image which thou hast set up.\n19. Then was Nebuchadnezzar full of fury, and theform of his visagewas changed against Shadrach, Meshach, and Abed-nego:thereforehe spake, and commanded that they should heat the furnace one seven times more than it was wont to be heated.\n20. And he commanded the most mighty men thatwerein his army to bind Shadrach, Meshach, and Abed-nego,andto casttheminto the burning fiery furnace.\n21. Then these men were bound in their coats, their hosen, and their hats, and theirothergarments, and were cast into the midst of the burning fiery furnace.\n22. Therefore because the kings commandment was urgent, and the furnace exceeding hot, the flame of the fire slew those men that took up Shadrach, Meshach, and Abed-nego.\n23. And these three men, Shadrach, Meshach, and Abed-nego, fell down bound into the midst of the burning fiery furnace.\n24. Then Nebuchadnezzar the king was astonied, and rose up in haste,andspake, and said unto his counsellors, Did not we cast three men bound into the midst of the fire? They answered and said unto the king, True, O king.\n25. He answered and said, Lo, I see four men loose, walking in the midst of the fire, and they have nohurt; and the form of the fourth is like the Son of God.\n26. Then Nebuchadnezzar came near to the mouth of the burning fiery furnace,andspake, and said, Shadrach, Meshach, and Abed-nego, ye servants of the most high God, come forth, and comehither.Then Shadrach, Meshach, and Abed-nego, came forth of the midst of the fire.\n27. And the princes, governors, and captains, and the kings counsellors, being gathered together, saw these men, upon whose bodies thefirehad no power, nor was an hair of their head singed, neither were their coatschanged, nor the smell of fire had passed on them.\n28. ThenNebuchadnezzar spake, and said, Blessedbethe God of Shadrach, Meshach, and Abed-nego, who hath sent hisangel, and delivered his servants thattrustedin him, andhavechanged the kings word, and yielded their bodies, that they might not serve nor worship any god, except their own God.\n29. Therefore I make decree, That every people, nation, and language, which speak any thing amiss against the God of Shadrach, Meshach, and Abed-nego, shall becutin pieces, and their houses shall be made dunghill: because there is no other God that candeliverafter this sort.\n30. Then the kingpromotedShadrach, Meshach, and Abed-nego, in the province of Babylon.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Daniel 4",
      "content": "1. Nebuchadnezzar the king, unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.\n2. I thought it good to shew the signs and wonders that the high God hath wrought toward me.\n3. How greatarehis signs! and how mightyarehis wonders! hiskingdomisan everlasting kingdom, and his dominionisfrom generation to generation.\n4. I Nebuchadnezzar was at rest in mine house, andflourishingin my palace:\n5. I saw dream which made me afraid, and the thoughts upon my bed and the visions of my head troubled me.\n6. Therefore made I decree to bring in all thewisemenof Babylon before me, that they might make known unto me the interpretation of the dream.\n7. Then came in themagicians, the astrologers, the Chaldeans, and the soothsayers: and I told the dream before them; but they did not make known unto me the interpretation thereof.\n8. But at the last Daniel came in before me, whose namewasBelteshazzar, according to the name of my god, and in whomisthe spirit of the holygods: and before him I told the dream,saying,\n9. O Belteshazzar, master of the magicians, because I know that the spirit of the holy godsisin thee, and no secret troubleth thee, tell me the visions of my dream that I have seen, and the interpretation thereof.\n10. Thuswerethe visions of mine head in my bed; I saw, and behold tree in the midst of the earth, and the height thereofwasgreat.\n11. The tree grew, and was strong, and the height thereof reached unto heaven, and the sight thereof to the end of all the earth:\n12. The leaves thereofwerefair, and the fruit thereof much, and in itwasmeat for all: the beasts of the field had shadow under it, and the fowls of the heaven dwelt in the boughs thereof, and all flesh was fed of it.\n13. I saw in the visions of my head upon my bed, and, behold, watcher and an holy one came down from heaven;\n14. He cried aloud, and said thus, Hew down the tree, and cut off his branches, shake off his leaves, and scatter his fruit: let the beasts get away from under it, and the fowls from his branches:\n15. Nevertheless leave the stump of his roots in the earth, even with band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts in the grass of the earth:\n16. Let his heart be changed from mans, and let beasts heart be given unto him; and let seventimespass over him.\n17. This matterisby the decree of the watchers, and the demand by the word of the holy ones: to the intent that the living may know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will, and setteth up over it thebasestof men.\n18. This dream I king Nebuchadnezzar have seen. Now thou, O Belteshazzar, declare the interpretation thereof, forasmuch as all the wisemenof my kingdom are not able to make known unto me theinterpretation: but thouartable; for thespiritof theholygodsisin thee.\n19. Then Daniel, whose namewasBelteshazzar, was astonied for one hour, and his thoughts troubled him. The king spake, and said, Belteshazzar, let not the dream, or the interpretation thereof, trouble thee. Belteshazzar answered and said, My lord, the dreambeto them that hate thee, and the interpretation thereof to thine enemies.\n20. The tree that thou sawest, which grew, and was strong, whose height reached unto the heaven, and the sight thereof to all the earth;\n21. Whose leaveswerefair, and the fruit thereof much, and in itwasmeat for all; under which the beasts of the field dwelt, and upon whose branches the fowls of the heaven had their habitation:\n22. Itisthou, O king, that art grown and become strong: for thy greatness is grown, and reacheth unto heaven, and thydominionto the end of the earth.\n23. And whereas the king saw watcher and an holy one coming down from heaven, and saying, Hew the tree down, and destroy it; yet leave the stump of the roots thereof in the earth, even with band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts of the field, till seven times pass over him;\n24. Thisisthe interpretation, O king, and thisisthe decree of the most High, which is come upon my lord the king:\n25. That they shall drive thee from men, and thy dwelling shall be with the beasts of the field, and they shall make thee to eat grass as oxen, and they shall wet thee with the dew of heaven, and seven times shall pass over thee, till thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.\n26. And whereas they commanded to leave the stump of the tree roots; thy kingdom shall be sure unto thee, after that thou shalt have known that the heavens do rule.\n27. Wherefore, O king, let my counsel be acceptable unto thee, and break off thy sins by righteousness, and thine iniquities by shewingmercyto the poor;ifit may be lengthening of thy tranquillity.\n28. All this came upon the king Nebuchadnezzar.\n29. At the end of twelve months he walked in the palace of the kingdom of Babylon.\n30. The king spake, and said, Is not this great Babylon, that I have builtforthe house of the kingdom by the might of my power, and for the honour of my majesty?\n31. While the wordwasin the kings mouth, there fell voice from heaven,saying,O king Nebuchadnezzar, to thee it is spoken; The kingdom isdepartedfrom thee.\n32. And they shall drive thee from men, and thy dwellingshall bewith the beasts of the field: they shall make thee to eat grass as oxen, and seven times shall pass over thee, until thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.\n33. The same hour was the thing fulfilled upon Nebuchadnezzar: and he was driven from men, and did eat grass as oxen, and his body was wet with the dew of heaven, till his hairs were grown like eaglesfeathers,and his nails like birdsclaws.\n34. And at the end ofthe daysI Nebuchadnezzar lifted up mine eyes unto heaven, and mine understanding returned unto me, and I blessed the most High, and I praised and honoured him that liveth for ever, whose dominionisan everlasting dominion, and hiskingdomisfrom generation to generation:\n35. And all the inhabitants of the eartharereputed asnothing: and he doeth according to hiswillin the army of heaven, andamongthe inhabitants of the earth: and none canstayhis hand, or say unto him, What doest thou?\n36. At the same time my reason returned unto me; and for the glory of my kingdom, mine honour and brightness returned unto me; and my counsellors and my lords sought unto me; and I was established in my kingdom, and excellent majesty was added unto me.\n37. Now I Nebuchadnezzar praise and extol and honour the King of heaven, all whose worksaretruth, and his waysjudgment: and those thatwalkin pride he is able toabase.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Daniel 5",
      "content": "1. Belshazzar the king made great feast to thousand of his lords, and drank wine before the thousand.\n2. Belshazzar, whiles he tasted the wine, commanded to bring the golden and silvervesselswhich his father Nebuchadnezzar had taken out of the temple whichwasin Jerusalem; that the king, and his princes, his wives, and his concubines, might drink therein.\n3. Then they brought the golden vessels that were taken out of the temple of the house of God whichwasat Jerusalem; and the king, and his princes, his wives, and his concubines, drank in them.\n4. They drank wine, and praised the gods of gold, and of silver, of brass, of iron, of wood, and of stone.\n5. In the same hour came forth fingers of mans hand, and wroteover against the candlestickupon the plaster of the wall of the kings palace: and the king saw the part of thehandthat wrote.\n6. Then the kingscountenancewas changed, and his thoughtstroubledhim, so thatthe jointsof his loins were loosed, and his knees smote one against another.\n7. The king cried aloud to bring in theastrologers, the Chaldeans, and the soothsayers.Andthe king spake, and said to the wisemenof Babylon, Whosoever shall read this writing, and shew me the interpretation thereof, shall be clothed with scarlet, andhavea chain of gold about his neck, and shall be the third ruler in the kingdom.\n8. Then came in all the kings wisemen:but they could not read the writing, nor make known to the king the interpretation thereof.\n9. Then was king Belshazzar greatly troubled, and his countenance was changed in him, and his lords were astonied.\n10. Nowthe queen, by reason of the words of the king and his lords, came into the banquet house:andthe queen spake and said, O king, live for ever: let not thy thoughts trouble thee, nor let thy countenance be changed:\n11. There is man in thy kingdom, in whomisthespiritof the holy gods; and in the days of thy father light and understanding and wisdom, like the wisdom of the gods, was found in him; whom the king Nebuchadnezzar thy father, the king,I say,thy father, made master of the magicians, astrologers, Chaldeans,andsoothsayers;\n12. Forasmuch as an excellent spirit, and knowledge, and understanding, interpreting of dreams, and shewing of hard sentences, and dissolving of doubts, were found in the same Daniel, whom the kingnamedBelteshazzar: now let Daniel be called, and he will shew the interpretation.\n13. Then was Daniel brought in before the king.Andthe king spake and said unto Daniel,Artthou that Daniel, whichartof the children of the captivity of Judah, whom the king my father brought out of Jewry?\n14. I have even heard of thee, that the spirit of thegodsisin thee, andthatlight and understanding and excellent wisdom is found in thee.\n15. And now the wisemen,theastrologers, have been brought in before me, that they should read this writing, and make known unto me the interpretation thereof: but they could not shew the interpretation of the thing:\n16. And I have heard of thee, that thou canst make interpretations, and dissolve doubts: now if thou canst read thewriting, and makeknownto me the interpretation thereof, thou shalt be clothed with scarlet, andhavea chain of gold about thy neck, and shalt be the third ruler in the kingdom.\n17. Then Daniel answered and said before the king, Let thygiftsbe to thyself, and give thy rewards to another; yet I will read the writing unto the king, and make known to him the interpretation.\n18. O thou king, the most high God gave Nebuchadnezzar thy father kingdom, and majesty, and glory, and honour:\n19. And for the majesty that he gave him, all people, nations, and languages, trembled and feared before him: whom he would he slew; and whom he would he kept alive; and whom he would he set up; and whom he would he put down.\n20. But when hisheartwas lifted up, and hismindhardened in pride, he wasdeposedfrom his kingly throne, and they took his glory from him:\n21. And he was drivenfromthe sons of men; and his heart was made like the beasts, and his dwellingwaswith the wild asses: they fed him with grass like oxen, and his body was wet with the dew of heaven; till he knew that the most high God ruled in the kingdom of men, andthathe appointeth over it whomsoever he will.\n22. And thou his son, O Belshazzar, hast not humbled thine heart, though thou knewest all this;\n23. But hast lifted up thyself against the Lord of heaven; and they have brought the vessels of his house before thee, and thou, and thy lords, thy wives, and thy concubines, have drunk wine in them; and thou hast praised thegodsof silver, and gold, of brass, iron, wood, and stone, which see not, nor hear, nor know: and the God in whose hand thy breathis,and whoseareall thy ways, hast thou not glorified:\n24. Then was the part of the hand sent from him; and this writing was written.\n25. And thisisthe writing that was written,Mene, Mene, Tekel, Upharsin.\n26. Thisisthe interpretation of the thing:Mene; God hathnumberedthy kingdom, and finished it.\n27. Tekel; Thou artweighedin the balances, and art found wanting.\n28. Peres; Thy kingdom is divided, and given to the Medes andPersians.\n29. Then commanded Belshazzar, and theyclothedDaniel with scarlet, andputa chain of gold about his neck, and made proclamation concerning him, that he should be the third ruler in the kingdom.\n30. In that night was Belshazzar the king of theChaldeansslain.\n31. AndDariusthe Median took the kingdom,beingabout threescore and two years old.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Daniel 6",
      "content": "1. It pleased Darius to set over the kingdom an hundred and twenty princes, which should be over the whole kingdom;\n2. And over these three presidents; of whom Danielwasfirst: that the princes might give accounts unto them, and the king should have no damage.\n3. Then this Daniel was preferred above the presidents and princes, because an excellentspiritwasin him; and the king thought to set himoverthe whole realm.\n4. Then the presidents and princes sought to findoccasionagainst Daniel concerning the kingdom; but they could find none occasion nor fault; forasmuch as hewasfaithful, neither was there any error or fault found in him.\n5. Then said these men, We shall not find any occasion against this Daniel, except we finditagainst him concerning the law of his God.\n6. Then these presidents and princes assembled together to the king, and said thus unto him, King Darius, live for ever.\n7. All the presidents of the kingdom, the governors, and the princes, the counsellors, and the captains, have consulted together to establish royal statute, and to make firm decree, that whosoever shall ask petition of any God or man for thirty days, save of thee, O king, he shall becastinto the den of lions.\n8. Now, O king, establish the decree, and sign the writing, that it be not changed, according to the law of the Medes and Persians, whichaltereth not.\n9. Wherefore king Darius signed the writing and the decree.\n10. Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber towardJerusalem, he kneeled upon his kneesthreetimes day, andprayed, and gavethanksbefore his God, as he did aforetime.\n11. Then these men assembled, and found Daniel praying and making supplication before his God.\n12. Then they came near, and spake before the king concerning the kings decree; Hast thou not signed decree, that every man that shall aska petitionof any God or man within thirty days, save of thee, O king, shall be cast into the den of lions? The king answered and said, The thingistrue, according to the law of the Medes and Persians, which altereth not.\n13. Then answered they and said before the king, ThatDaniel, whichisof the children of the captivity of Judah, regardeth not thee, O king, nor the decree that thou hast signed, but maketh his petition three times day.\n14. Then the king, when he heardthesewords, was sore displeased with himself, and sethisheart onDaniel to deliver him: and he laboured till the going down of the sun to deliver him.\n15. Then these men assembled unto the king, and said unto the king, Know, O king, that the law of the Medes and Persiansis,That no decree nor statute which the king establisheth may be changed.\n16. Then the king commanded, and they brought Daniel, and casthiminto the den of lions.Nowthe king spake and said unto Daniel, Thy God whom thou servest continually, he will deliver thee.\n17. And stone was brought, and laid upon the mouth of the den; and the kingsealedit with his own signet, and with the signet of his lords; that the purpose might not be changed concerning Daniel.\n18. Then the king went to his palace, and passed the night fasting: neither were instruments of musick brought before him: and his sleep went from him.\n19. Then the king arose very early in the morning, and went in haste unto the den of lions.\n20. And when he came to the den, he cried with lamentable voice unto Daniel:andthe king spake and said to Daniel, O Daniel,servantof the living God, is thy God, whom thou servest continually, able to deliver thee from the lions?\n21. Then said Daniel unto the king, O king, live for ever.\n22. My God hath sent hisangel, and hath shut thelionsmouths, that they have not hurt me: forasmuch as before him innocency was found in me; and also before thee, O king, have I done no hurt.\n23. Then was the king exceeding glad for him, and commanded that they should take Daniel up out of the den. So Daniel was taken up out of the den, and no manner of hurt was found upon him, because hebelievedin his God.\n24. And the king commanded, and they brought those men which had accused Daniel, and they casttheminto the den of lions, them, their children, and their wives; and the lionshadthe mastery of them, and brake all their bones in pieces or ever they came at the bottom of the den.\n25. Then king Darius wrote unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.\n26. I make decree, That in every dominion of my kingdom men tremble and fear before the God of Daniel: for heistheliving God, andsteadfastfor ever, and his kingdomthatwhich shall not bedestroyed, and his dominionshall be evenunto the end.\n27. Hedeliverethand rescueth, and he worketh signs and wonders in heaven and in earth, who hathdeliveredDaniel from the power of the lions.\n28. So this Daniel prospered in the reign ofDarius, and in the reign ofCyrusthe Persian.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Daniel 7",
      "content": "1. In the first year of Belshazzar king of Babylon Daniel had adreamand visions of his head upon his bed: then he wrote the dream,andtold the sum of the matters.\n2. Daniel spake and said, I saw in my vision by night, and, behold, the four winds of the heaven strove upon the great sea.\n3. And four greatbeastscame upfrom thesea, diverse one from another.\n4. Thefirstwaslike lion, and had eagles wings: I beheld till the wings thereof were plucked, and it was lifted up from the earth, and made stand upon the feet as man, and mans heart was given to it.\n5. And behold anotherbeast, second, like to bear, and it raised up itself on one side, andit hadthree ribs in the mouth of it between the teeth of it: and they said thus unto it, Arise, devour much flesh.\n6. After this I beheld, and lo another, like leopard, which had upon the back of it four wings of fowl; the beast had also fourheads; and dominion was given to it.\n7. After this I saw in the night visions, and behold fourthbeast, dreadful and terrible, and strong exceedingly; and it had greatironteeth: it devoured and brake in pieces, and stamped the residue with the feet of it: and itwasdiverse from all the beasts thatwerebefore it; and it hadtenhorns.\n8. I considered the horns, and, behold, there came up among them another littlehorn, before whom there were three of the first horns plucked up by the roots: and, behold, in this hornwereeyes like the eyes of man, and amouthspeaking great things.\n9. I beheld till thethroneswerecast down, and theAncient of daysdid sit, whosegarmentwaswhite as snow, and the hair of his head like the pure wool: his thronewas likethe fiery flame,andhiswheelsasburning fire.\n10. A fiery stream issued and came forth from before him:thousandthousands ministered unto him, and ten thousand times ten thousand stood before him: thejudgmentwas set, and thebookswere opened.\n11. I beheld then because of the voice of the great words which the horn spake: I beheldeventill thebeastwas slain, and his body destroyed, and given to the burningflame.\n12. As concerning the rest of the beasts, they had their dominion taken away: yet their lives were prolonged for season and time.\n13. I saw in the night visions, and, behold,onelike theSon of mancame with thecloudsof heaven, and came to the Ancient of days, and they brought him near before him.\n14. And there was given himdominion, and glory, and akingdom, that all people, nations, and languages, should serve him: his dominionisaneverlastingdominion, which shall not pass away, and his kingdomthatwhich shall not be destroyed.\n15. I Daniel was grieved in my spirit in the midst ofmybody, and the visions of my head troubled me.\n16. I came near unto one of them that stood by, and asked him the truth of all this. So he told me, and made me know the interpretation of the things.\n17. These great beasts, which are four,arefourkings,whichshall arise out of the earth.\n18. But thesaintsof the most High shall take the kingdom, and possessthe kingdom for ever, even for ever and ever.\n19. Then I would know the truth of the fourth beast, which was diverse from all the others, exceeding dreadful, whose teethwere ofiron, and his nailsofbrass;whichdevoured, brake in pieces, and stamped the residue with his feet;\n20. And of the ten horns thatwerein his head, andofthe other which came up, and before whom three fell; evenofthat horn that had eyes, and mouth that spake very great things, whose lookwasmore stout than his fellows.\n21. I beheld, and the same horn madewarwith the saints, and prevailed against them;\n22. Until theAncient of dayscame, andjudgmentwas given to thesaintsof the most High; and the time came that the saints possessed the kingdom.\n23. Thus he said, The fourth beast shall be the fourth kingdom upon earth, which shall be diverse from all kingdoms, and shall devour the whole earth, and shall tread it down, and break it in pieces.\n24. And the tenhornsout of this kingdomaretenkingsthatshall arise: and another shall rise after them; and he shall be diverse from the first, and he shall subdue three kings.\n25. And he shall speakgreatwords against the most High, and shallwearout the saints of the most High, and think to change times and laws: and they shall be given into his hand until time and times and the dividing of time.\n26. But thejudgmentshall sit, and they shall take away his dominion, to consume and to destroyitunto the end.\n27. And thekingdomand dominion, and the greatness of the kingdom under the whole heaven, shall begivento the people of the saints of the most High, whose kingdomisaneverlastingkingdom, and all dominions shall serve and obey him.\n28. Hithertoisthe end of the matter. As for me Daniel, mycogitationsmuch troubled me, and my countenance changed in me: but I kept the matter in my heart.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Daniel": {
      "1": {
        "verses": {
          "1": {
            "text": "In the third year of the reign ofJehoiakimking of Judah cameNebuchadnezzarking of Babylon unto Jerusalem, and besieged it.",
            "citation": "(Daniel 1:1)"
          },
          "2": {
            "text": "And the Lord gave Jehoiakim king of Judah into his hand, withpart of thevesselsof the house of God: which he carried into the land ofShinarto the house of his god; and he brought thevesselsinto the treasure house of his god.",
            "citation": "(Daniel 1:2)"
          },
          "3": {
            "text": "And the king spake unto Ashpenazthemaster of his eunuchs, that he should bringcertainof the children of Israel, and of the kingsseed, and of the princes;",
            "citation": "(Daniel 1:3)"
          },
          "4": {
            "text": "Children in whomwasno blemish, butwell favoured, and skilful in all wisdom, and cunning in knowledge, and understanding science, and such ashadability in them to stand in the kings palace, and whom they might teach the learning and the tongue of the Chaldeans.",
            "citation": "(Daniel 1:4)"
          },
          "5": {
            "text": "And the king appointed them dailyprovisionof the kingsmeat, and of the wine which he drank: so nourishing them three years, that at the end thereof they mightstandbefore the king.",
            "citation": "(Daniel 1:5)"
          },
          "6": {
            "text": "Now among these were of the children of Judah,Daniel,Hananiah, Mishael, and Azariah:",
            "citation": "(Daniel 1:6)"
          },
          "7": {
            "text": "Unto whom the prince of the eunuchs gavenames: for he gave unto Danielthenameof Belteshazzar; and to Hananiah, of Shadrach; and to Mishael, of Meshach; and to Azariah, of Abed-nego.",
            "citation": "(Daniel 1:7)"
          },
          "8": {
            "text": "But Danielpurposedin his heart that he would notdefilehimself with the portion of the kings meat, nor with thewinewhich he drank: therefore he requested of the prince of the eunuchs that he might not defile himself.",
            "citation": "(Daniel 1:8)"
          },
          "9": {
            "text": "Now God had brought Daniel intofavourandtender lovewith the prince of the eunuchs.",
            "citation": "(Daniel 1:9)"
          },
          "10": {
            "text": "And the prince of the eunuchs said unto Daniel, Ifearmy lord the king, who hath appointed your meat and your drink: for why should he see your facesworse likingthan the children whichareof yoursort? then shall ye makemeendanger my head to the king.",
            "citation": "(Daniel 1:10)"
          },
          "11": {
            "text": "Then said Daniel toMelzar, whom the prince of the eunuchs had set over Daniel, Hananiah, Mishael, and Azariah,",
            "citation": "(Daniel 1:11)"
          },
          "12": {
            "text": "Prove thy servants, I beseech thee, ten days; and let them give uspulseto eat, and water to drink.",
            "citation": "(Daniel 1:12)"
          },
          "13": {
            "text": "Then let ourcountenancesbe looked upon before thee, and the countenance of the children that eat of the portion of the kings meat: and as thou seest, deal with thy servants.",
            "citation": "(Daniel 1:13)"
          },
          "14": {
            "text": "So he consented to them in this matter, and proved them ten days.",
            "citation": "(Daniel 1:14)"
          },
          "15": {
            "text": "And at the end of ten days their countenances appeared fairer and fatter in flesh than all the children which did eat the portion of the kings meat.",
            "citation": "(Daniel 1:15)"
          },
          "16": {
            "text": "Thus Melzar took away the portion of their meat, and the wine that they should drink; and gave them pulse.",
            "citation": "(Daniel 1:16)"
          },
          "17": {
            "text": "As for these four children, God gave themknowledgeand skill in alllearningand wisdom: and Daniel hadunderstandingin allvisionsand dreams.",
            "citation": "(Daniel 1:17)"
          },
          "18": {
            "text": "Now at the end of the days that the king had said he should bring them in, then the prince of the eunuchs brought them in before Nebuchadnezzar.",
            "citation": "(Daniel 1:18)"
          },
          "19": {
            "text": "And the king communed withthem; and among them all was found none like Daniel, Hananiah, Mishael, and Azariah: therefore stood they before the king.",
            "citation": "(Daniel 1:19)"
          },
          "20": {
            "text": "And in all matters of wisdomandunderstanding, that the king inquired of them, he found them ten times better than all themagiciansandastrologers thatwerein all his realm.",
            "citation": "(Daniel 1:20)"
          },
          "21": {
            "text": "And Daniel continuedevenunto the first year of king Cyrus.",
            "citation": "(Daniel 1:21)"
          }
        }
      },
      "2": {
        "verses": {
          "1": {
            "text": "And in the second year of the reign of Nebuchadnezzar Nebuchadnezzar dreameddreams, wherewith his spirit wastroubled, and his sleep brake from him.",
            "citation": "(Daniel 2:1)"
          },
          "2": {
            "text": "Then the king commanded to call themagicians, and the astrologers, and the sorcerers, and the Chaldeans, for to shew the king his dreams. So they came and stood before the king.",
            "citation": "(Daniel 2:2)"
          },
          "3": {
            "text": "And the king said unto them, I have dreamed dream, and my spirit was troubled to know the dream.",
            "citation": "(Daniel 2:3)"
          },
          "4": {
            "text": "Then spake the Chaldeans to the king inSyriack, O king, live for ever: tell thy servants the dream, and we willshewthe interpretation.",
            "citation": "(Daniel 2:4)"
          },
          "5": {
            "text": "The king answered and said to the Chaldeans, The thing isgone from me: if ye will not make known unto me the dream, with the interpretation thereof, ye shall becutin pieces, and your houses shall be made dunghill.",
            "citation": "(Daniel 2:5)"
          },
          "6": {
            "text": "But if ye shew the dream, and the interpretation thereof, ye shall receive of me gifts and rewards and great honour: therefore shew me the dream, and the interpretation thereof.",
            "citation": "(Daniel 2:6)"
          },
          "7": {
            "text": "They answered again and said, Let the king tell his servants the dream, and we will shew the interpretation of it.",
            "citation": "(Daniel 2:7)"
          },
          "8": {
            "text": "The king answered and said, I know of certainty that ye would gain the time, because ye see the thing is gone from me.",
            "citation": "(Daniel 2:8)"
          },
          "9": {
            "text": "But if ye will not make known unto me the dream,there is butone decree for you: for ye have prepared lying and corrupt words to speak before me,tillthe time be changed: therefore tell me the dream, and I shall know that ye can shew me the interpretation thereof.",
            "citation": "(Daniel 2:9)"
          },
          "10": {
            "text": "The Chaldeans answered before the king, and said, There is not man upon the earth that can shew the kings matter: thereforethere isno king, lord, nor ruler,thatasked such things at any magician, or astrologer, or Chaldean.",
            "citation": "(Daniel 2:10)"
          },
          "11": {
            "text": "Andit isa rare thing that the king requireth, and there is none other that can shew it before the king, except thegods, whose dwelling is not with flesh.",
            "citation": "(Daniel 2:11)"
          },
          "12": {
            "text": "For this cause the king was angry and very furious, and commanded to destroy all the wisemenof Babylon.",
            "citation": "(Daniel 2:12)"
          },
          "13": {
            "text": "And the decree went forth that the wisemenshould be slain; and they sought Daniel and his fellows to be slain.",
            "citation": "(Daniel 2:13)"
          },
          "14": {
            "text": "Then Daniel answered with counsel and wisdom to Arioch the captain of the kings guard, which was gone forth to slay the wisemenof Babylon:",
            "citation": "(Daniel 2:14)"
          },
          "15": {
            "text": "He answered and said to Arioch the kings captain, Whyisthe decreesohastyfrom the king? ThenArioch made the thing known to Daniel.",
            "citation": "(Daniel 2:15)"
          },
          "16": {
            "text": "Then Daniel went in, and desired of the king that he would give him time, and that he would shew the king the interpretation.",
            "citation": "(Daniel 2:16)"
          },
          "17": {
            "text": "Then Daniel went to his house, and made the thing known toHananiah, Mishael, and Azariah, his companions:",
            "citation": "(Daniel 2:17)"
          },
          "18": {
            "text": "That they would desire mercies of the God of heaven concerning this secret; that Daniel and his fellows should not perish with the rest of the wisemenof Babylon.",
            "citation": "(Daniel 2:18)"
          },
          "19": {
            "text": "Then was thesecretrevealed unto Daniel in nightvision. Then Daniel blessed the God of heaven.",
            "citation": "(Daniel 2:19)"
          },
          "20": {
            "text": "Daniel answered and said, Blessed be the name of God for ever and ever: forwisdomand might are his:",
            "citation": "(Daniel 2:20)"
          },
          "21": {
            "text": "And he changeth thetimesand theseasons: heremovethkings, and setteth up kings: he givethwisdomunto the wise, andknowledgeto them that know understanding:",
            "citation": "(Daniel 2:21)"
          },
          "22": {
            "text": "Herevealeththe deep and secret things: heknowethwhatisin the darkness, and thelightdwelleth with him.",
            "citation": "(Daniel 2:22)"
          },
          "23": {
            "text": "I thank thee, and praise thee, O thou God of my fathers, who hast given me wisdom and might, and hast made known unto me now what we desired of thee: for thou hastnowmade known unto us the kings matter.",
            "citation": "(Daniel 2:23)"
          },
          "24": {
            "text": "Therefore Daniel went in unto Arioch, whom the king had ordained to destroy the wisemenof Babylon: he went and said thus unto him; Destroy not the wisemenof Babylon: bring me in before the king, and I will shew unto the king the interpretation.",
            "citation": "(Daniel 2:24)"
          },
          "25": {
            "text": "Then Arioch brought in Daniel before the king in haste, and said thus unto him, I have found man of the captives of Judah, that will make known unto the king the interpretation.",
            "citation": "(Daniel 2:25)"
          },
          "26": {
            "text": "The king answered and said to Daniel, whosenamewasBelteshazzar, Art thou able to makeknownunto me the dream which I have seen, and the interpretation thereof?",
            "citation": "(Daniel 2:26)"
          },
          "27": {
            "text": "Daniel answered in the presence of the king, and said, The secret which the king hath demanded cannot the wisemen,theastrologers, the magicians, the soothsayers, shew unto the king;",
            "citation": "(Daniel 2:27)"
          },
          "28": {
            "text": "But there is God in heaven thatrevealethsecrets, and maketh known to the king Nebuchadnezzar what shall be in the latter days. Thydream, and the visions of thy head upon thy bed, are these;",
            "citation": "(Daniel 2:28)"
          },
          "29": {
            "text": "As for thee, O king, thy thoughts cameinto thy mindupon thy bed, what should come to pass hereafter: and he thatrevealethsecrets maketh known to thee what shall come to pass.",
            "citation": "(Daniel 2:29)"
          },
          "30": {
            "text": "But as for me, this secret is not revealed to me foranywisdomthat I have more than any living, butfortheirsakes that shall make known the interpretation to the king, and that thou mightest know the thoughts of thy heart.",
            "citation": "(Daniel 2:30)"
          },
          "31": {
            "text": "Thou, O king, sawest, and behold greatimage. This great image, whose brightnesswasexcellent,stood before thee; andtheform thereofwasterrible.",
            "citation": "(Daniel 2:31)"
          },
          "32": {
            "text": "This images headwasof fine gold, his breast and his arms of silver, his belly and his thighs of brass,",
            "citation": "(Daniel 2:32)"
          },
          "33": {
            "text": "His legs of iron, his feet part of iron and part of clay.",
            "citation": "(Daniel 2:33)"
          },
          "34": {
            "text": "Thou sawest till that astonewas cut outwithouthands, which smote the image upon his feetthat wereof iron and clay, and brake them to pieces.",
            "citation": "(Daniel 2:34)"
          },
          "35": {
            "text": "Then was the iron, the clay, the brass, the silver, and the gold, broken to pieces together, and became like the chaff of the summer threshingfloors; and the wind carried them away, that noplacewas found for them: and thestonethat smote the image became great mountain, and filled the whole earth.",
            "citation": "(Daniel 2:35)"
          },
          "36": {
            "text": "Thisisthe dream; and we will tell the interpretation thereof before the king.",
            "citation": "(Daniel 2:36)"
          },
          "37": {
            "text": "Thou, O king,arta king of kings: for the God of heaven hath given thee akingdom, power, and strength, and glory.",
            "citation": "(Daniel 2:37)"
          },
          "38": {
            "text": "And wheresoever the children of men dwell, the beasts of the field and the fowls of the heaven hath he given into thine hand, and hath made thee ruler over them all. Thouartthisheadof gold.",
            "citation": "(Daniel 2:38)"
          },
          "39": {
            "text": "And after thee shall arise anotherkingdominferior to thee, and another third kingdom of brass, which shall bearruleover all the earth.",
            "citation": "(Daniel 2:39)"
          },
          "40": {
            "text": "And the fourthkingdomshall be strong as iron: forasmuch as iron breaketh in pieces and subdueth allthings:and as iron that breaketh all these, shall it break in pieces and bruise.",
            "citation": "(Daniel 2:40)"
          },
          "41": {
            "text": "And whereas thou sawest the feet and toes, part of potters clay, and part of iron, the kingdom shall be divided; but there shall be in it of the strength of theiron, forasmuch as thou sawest the iron mixed with miry clay.",
            "citation": "(Daniel 2:41)"
          },
          "42": {
            "text": "Andasthe toes of the feetwerepart of iron, and part of clay,sothe kingdom shall be partly strong, and partly broken.",
            "citation": "(Daniel 2:42)"
          },
          "43": {
            "text": "And whereas thou sawest iron mixed with miry clay, they shall mingle themselves with the seed of men: but they shall not cleave one to another, even as iron is not mixed with clay.",
            "citation": "(Daniel 2:43)"
          },
          "44": {
            "text": "And in thedaysof thesekingsshall the God of heavensetup akingdom, which shall never bedestroyed: and thekingdomshall not be left to other people,butit shallbreakin pieces andconsumeall thesekingdoms, and it shall stand for ever.",
            "citation": "(Daniel 2:44)"
          },
          "45": {
            "text": "Forasmuch as thou sawest that thestonewas cut out of the mountain without hands, and that it brake in pieces the iron, the brass, the clay, the silver, and the gold; the great God hath madeknownto the king what shall come to pass hereafter: and the dreamiscertain, and the interpretation thereof sure.",
            "citation": "(Daniel 2:45)"
          },
          "46": {
            "text": "Then the king Nebuchadnezzar fell upon his face, andworshippedDaniel, and commanded that they should offer an oblation and sweet odours unto him.",
            "citation": "(Daniel 2:46)"
          },
          "47": {
            "text": "The king answered unto Daniel, and said, Of truthit is,that yourGodisaGodof gods, and aLordofkings, and revealer of secrets, seeing thou couldest reveal this secret.",
            "citation": "(Daniel 2:47)"
          },
          "48": {
            "text": "Then the king made Daniel agreatman, and gave him many great gifts, and made him ruler over the whole province of Babylon, and chief of the governors over all the wisemenof Babylon.",
            "citation": "(Daniel 2:48)"
          },
          "49": {
            "text": "Then Daniel requested of the king, and hesetShadrach, Meshach, and Abed-nego, over the affairs of the province of Babylon: but Danielsatin the gate of the king.",
            "citation": "(Daniel 2:49)"
          }
        }
      },
      "3": {
        "verses": {
          "1": {
            "text": "Nebuchadnezzar the king made an image of gold, whose heightwasthreescore cubits,andthe breadth thereof six cubits: he set it up in the plain of Dura, in the province of Babylon.",
            "citation": "(Daniel 3:1)"
          },
          "2": {
            "text": "Then Nebuchadnezzar the king sent to gather together the princes, the governors, and the captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, to come to the dedication of the image which Nebuchadnezzar the king had set up.",
            "citation": "(Daniel 3:2)"
          },
          "3": {
            "text": "Then the princes, the governors, and captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, were gathered together unto the dedication of the image that Nebuchadnezzar the king had set up; and they stood before the image that Nebuchadnezzar had set up.",
            "citation": "(Daniel 3:3)"
          },
          "4": {
            "text": "Then an herald cried aloud, To you it is commanded, O people, nations, andlanguages,",
            "citation": "(Daniel 3:4)"
          },
          "5": {
            "text": "Thatat what time ye hear the sound of the cornet, flute,harp,sackbut, psaltery,dulcimer, and all kinds of musick, ye fall down and worship the golden image that Nebuchadnezzar the king hath set up:",
            "citation": "(Daniel 3:5)"
          },
          "6": {
            "text": "And whoso falleth not down and worshippeth shall the same hour becastinto the midst of aburningfiery furnace.",
            "citation": "(Daniel 3:6)"
          },
          "7": {
            "text": "Therefore at that time, when all the people heard the sound of the cornet, flute, harp, sackbut, psaltery, and all kinds of musick, all the people, the nations, and the languages, fell downandworshipped the golden image that Nebuchadnezzar the king had set up.",
            "citation": "(Daniel 3:7)"
          },
          "8": {
            "text": "Wherefore at that time certain Chaldeans came near, and accused the Jews.",
            "citation": "(Daniel 3:8)"
          },
          "9": {
            "text": "They spake and said to the king Nebuchadnezzar, O king, live for ever.",
            "citation": "(Daniel 3:9)"
          },
          "10": {
            "text": "Thou, O king, hast made decree, that every man that shall hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, shall fall down and worship the golden image:",
            "citation": "(Daniel 3:10)"
          },
          "11": {
            "text": "And whoso falleth not down and worshippeth,thathe should be cast into the midst of burning fiery furnace.",
            "citation": "(Daniel 3:11)"
          },
          "12": {
            "text": "There are certain Jews whom thou hastsetover the affairs of the province of Babylon, Shadrach, Meshach, and Abed-nego; these men, O king, have not regarded thee: they serve not thy gods, nor worship the golden image which thou hast set up.",
            "citation": "(Daniel 3:12)"
          },
          "13": {
            "text": "Then Nebuchadnezzar inhisrage and fury commanded to bring Shadrach, Meshach, and Abed-nego. Then they brought these men before the king.",
            "citation": "(Daniel 3:13)"
          },
          "14": {
            "text": "Nebuchadnezzar spake and said unto them,Is ittrue, O Shadrach, Meshach, and Abed-nego, do not yeserve my gods, nor worship the golden image which I have set up?",
            "citation": "(Daniel 3:14)"
          },
          "15": {
            "text": "Now if ye be ready that at what time ye hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, ye fall down and worship the image which I have made;well:but if ye worship not, ye shall be cast the same hour into the midst of burning fiery furnace; and whoisthat God that shall deliver you out of my hands?",
            "citation": "(Daniel 3:15)"
          },
          "16": {
            "text": "Shadrach, Meshach, and Abed-nego, answered and said to the king, O Nebuchadnezzar, wearenotcarefulto answer thee in this matter.",
            "citation": "(Daniel 3:16)"
          },
          "17": {
            "text": "If it beso,our God whom we serve is able todeliverus from the burning fiery furnace, and he will deliverusout of thine hand, O king.",
            "citation": "(Daniel 3:17)"
          },
          "18": {
            "text": "But if not, be it known unto thee, O king, that we will notservethy gods, nor worship the golden image which thou hast set up.",
            "citation": "(Daniel 3:18)"
          },
          "19": {
            "text": "Then was Nebuchadnezzar full of fury, and theform of his visagewas changed against Shadrach, Meshach, and Abed-nego:thereforehe spake, and commanded that they should heat the furnace one seven times more than it was wont to be heated.",
            "citation": "(Daniel 3:19)"
          },
          "20": {
            "text": "And he commanded the most mighty men thatwerein his army to bind Shadrach, Meshach, and Abed-nego,andto casttheminto the burning fiery furnace.",
            "citation": "(Daniel 3:20)"
          },
          "21": {
            "text": "Then these men were bound in their coats, their hosen, and their hats, and theirothergarments, and were cast into the midst of the burning fiery furnace.",
            "citation": "(Daniel 3:21)"
          },
          "22": {
            "text": "Therefore because the kings commandment was urgent, and the furnace exceeding hot, the flame of the fire slew those men that took up Shadrach, Meshach, and Abed-nego.",
            "citation": "(Daniel 3:22)"
          },
          "23": {
            "text": "And these three men, Shadrach, Meshach, and Abed-nego, fell down bound into the midst of the burning fiery furnace.",
            "citation": "(Daniel 3:23)"
          },
          "24": {
            "text": "Then Nebuchadnezzar the king was astonied, and rose up in haste,andspake, and said unto his counsellors, Did not we cast three men bound into the midst of the fire? They answered and said unto the king, True, O king.",
            "citation": "(Daniel 3:24)"
          },
          "25": {
            "text": "He answered and said, Lo, I see four men loose, walking in the midst of the fire, and they have nohurt; and the form of the fourth is like the Son of God.",
            "citation": "(Daniel 3:25)"
          },
          "26": {
            "text": "Then Nebuchadnezzar came near to the mouth of the burning fiery furnace,andspake, and said, Shadrach, Meshach, and Abed-nego, ye servants of the most high God, come forth, and comehither.Then Shadrach, Meshach, and Abed-nego, came forth of the midst of the fire.",
            "citation": "(Daniel 3:26)"
          },
          "27": {
            "text": "And the princes, governors, and captains, and the kings counsellors, being gathered together, saw these men, upon whose bodies thefirehad no power, nor was an hair of their head singed, neither were their coatschanged, nor the smell of fire had passed on them.",
            "citation": "(Daniel 3:27)"
          },
          "28": {
            "text": "ThenNebuchadnezzar spake, and said, Blessedbethe God of Shadrach, Meshach, and Abed-nego, who hath sent hisangel, and delivered his servants thattrustedin him, andhavechanged the kings word, and yielded their bodies, that they might not serve nor worship any god, except their own God.",
            "citation": "(Daniel 3:28)"
          },
          "29": {
            "text": "Therefore I make decree, That every people, nation, and language, which speak any thing amiss against the God of Shadrach, Meshach, and Abed-nego, shall becutin pieces, and their houses shall be made dunghill: because there is no other God that candeliverafter this sort.",
            "citation": "(Daniel 3:29)"
          },
          "30": {
            "text": "Then the kingpromotedShadrach, Meshach, and Abed-nego, in the province of Babylon.",
            "citation": "(Daniel 3:30)"
          }
        }
      },
      "4": {
        "verses": {
          "1": {
            "text": "Nebuchadnezzar the king, unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.",
            "citation": "(Daniel 4:1)"
          },
          "2": {
            "text": "I thought it good to shew the signs and wonders that the high God hath wrought toward me.",
            "citation": "(Daniel 4:2)"
          },
          "3": {
            "text": "How greatarehis signs! and how mightyarehis wonders! hiskingdomisan everlasting kingdom, and his dominionisfrom generation to generation.",
            "citation": "(Daniel 4:3)"
          },
          "4": {
            "text": "I Nebuchadnezzar was at rest in mine house, andflourishingin my palace:",
            "citation": "(Daniel 4:4)"
          },
          "5": {
            "text": "I saw dream which made me afraid, and the thoughts upon my bed and the visions of my head troubled me.",
            "citation": "(Daniel 4:5)"
          },
          "6": {
            "text": "Therefore made I decree to bring in all thewisemenof Babylon before me, that they might make known unto me the interpretation of the dream.",
            "citation": "(Daniel 4:6)"
          },
          "7": {
            "text": "Then came in themagicians, the astrologers, the Chaldeans, and the soothsayers: and I told the dream before them; but they did not make known unto me the interpretation thereof.",
            "citation": "(Daniel 4:7)"
          },
          "8": {
            "text": "But at the last Daniel came in before me, whose namewasBelteshazzar, according to the name of my god, and in whomisthe spirit of the holygods: and before him I told the dream,saying,",
            "citation": "(Daniel 4:8)"
          },
          "9": {
            "text": "O Belteshazzar, master of the magicians, because I know that the spirit of the holy godsisin thee, and no secret troubleth thee, tell me the visions of my dream that I have seen, and the interpretation thereof.",
            "citation": "(Daniel 4:9)"
          },
          "10": {
            "text": "Thuswerethe visions of mine head in my bed; I saw, and behold tree in the midst of the earth, and the height thereofwasgreat.",
            "citation": "(Daniel 4:10)"
          },
          "11": {
            "text": "The tree grew, and was strong, and the height thereof reached unto heaven, and the sight thereof to the end of all the earth:",
            "citation": "(Daniel 4:11)"
          },
          "12": {
            "text": "The leaves thereofwerefair, and the fruit thereof much, and in itwasmeat for all: the beasts of the field had shadow under it, and the fowls of the heaven dwelt in the boughs thereof, and all flesh was fed of it.",
            "citation": "(Daniel 4:12)"
          },
          "13": {
            "text": "I saw in the visions of my head upon my bed, and, behold, watcher and an holy one came down from heaven;",
            "citation": "(Daniel 4:13)"
          },
          "14": {
            "text": "He cried aloud, and said thus, Hew down the tree, and cut off his branches, shake off his leaves, and scatter his fruit: let the beasts get away from under it, and the fowls from his branches:",
            "citation": "(Daniel 4:14)"
          },
          "15": {
            "text": "Nevertheless leave the stump of his roots in the earth, even with band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts in the grass of the earth:",
            "citation": "(Daniel 4:15)"
          },
          "16": {
            "text": "Let his heart be changed from mans, and let beasts heart be given unto him; and let seventimespass over him.",
            "citation": "(Daniel 4:16)"
          },
          "17": {
            "text": "This matterisby the decree of the watchers, and the demand by the word of the holy ones: to the intent that the living may know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will, and setteth up over it thebasestof men.",
            "citation": "(Daniel 4:17)"
          },
          "18": {
            "text": "This dream I king Nebuchadnezzar have seen. Now thou, O Belteshazzar, declare the interpretation thereof, forasmuch as all the wisemenof my kingdom are not able to make known unto me theinterpretation: but thouartable; for thespiritof theholygodsisin thee.",
            "citation": "(Daniel 4:18)"
          },
          "19": {
            "text": "Then Daniel, whose namewasBelteshazzar, was astonied for one hour, and his thoughts troubled him. The king spake, and said, Belteshazzar, let not the dream, or the interpretation thereof, trouble thee. Belteshazzar answered and said, My lord, the dreambeto them that hate thee, and the interpretation thereof to thine enemies.",
            "citation": "(Daniel 4:19)"
          },
          "20": {
            "text": "The tree that thou sawest, which grew, and was strong, whose height reached unto the heaven, and the sight thereof to all the earth;",
            "citation": "(Daniel 4:20)"
          },
          "21": {
            "text": "Whose leaveswerefair, and the fruit thereof much, and in itwasmeat for all; under which the beasts of the field dwelt, and upon whose branches the fowls of the heaven had their habitation:",
            "citation": "(Daniel 4:21)"
          },
          "22": {
            "text": "Itisthou, O king, that art grown and become strong: for thy greatness is grown, and reacheth unto heaven, and thydominionto the end of the earth.",
            "citation": "(Daniel 4:22)"
          },
          "23": {
            "text": "And whereas the king saw watcher and an holy one coming down from heaven, and saying, Hew the tree down, and destroy it; yet leave the stump of the roots thereof in the earth, even with band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts of the field, till seven times pass over him;",
            "citation": "(Daniel 4:23)"
          },
          "24": {
            "text": "Thisisthe interpretation, O king, and thisisthe decree of the most High, which is come upon my lord the king:",
            "citation": "(Daniel 4:24)"
          },
          "25": {
            "text": "That they shall drive thee from men, and thy dwelling shall be with the beasts of the field, and they shall make thee to eat grass as oxen, and they shall wet thee with the dew of heaven, and seven times shall pass over thee, till thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.",
            "citation": "(Daniel 4:25)"
          },
          "26": {
            "text": "And whereas they commanded to leave the stump of the tree roots; thy kingdom shall be sure unto thee, after that thou shalt have known that the heavens do rule.",
            "citation": "(Daniel 4:26)"
          },
          "27": {
            "text": "Wherefore, O king, let my counsel be acceptable unto thee, and break off thy sins by righteousness, and thine iniquities by shewingmercyto the poor;ifit may be lengthening of thy tranquillity.",
            "citation": "(Daniel 4:27)"
          },
          "28": {
            "text": "All this came upon the king Nebuchadnezzar.",
            "citation": "(Daniel 4:28)"
          },
          "29": {
            "text": "At the end of twelve months he walked in the palace of the kingdom of Babylon.",
            "citation": "(Daniel 4:29)"
          },
          "30": {
            "text": "The king spake, and said, Is not this great Babylon, that I have builtforthe house of the kingdom by the might of my power, and for the honour of my majesty?",
            "citation": "(Daniel 4:30)"
          },
          "31": {
            "text": "While the wordwasin the kings mouth, there fell voice from heaven,saying,O king Nebuchadnezzar, to thee it is spoken; The kingdom isdepartedfrom thee.",
            "citation": "(Daniel 4:31)"
          },
          "32": {
            "text": "And they shall drive thee from men, and thy dwellingshall bewith the beasts of the field: they shall make thee to eat grass as oxen, and seven times shall pass over thee, until thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.",
            "citation": "(Daniel 4:32)"
          },
          "33": {
            "text": "The same hour was the thing fulfilled upon Nebuchadnezzar: and he was driven from men, and did eat grass as oxen, and his body was wet with the dew of heaven, till his hairs were grown like eaglesfeathers,and his nails like birdsclaws.",
            "citation": "(Daniel 4:33)"
          },
          "34": {
            "text": "And at the end ofthe daysI Nebuchadnezzar lifted up mine eyes unto heaven, and mine understanding returned unto me, and I blessed the most High, and I praised and honoured him that liveth for ever, whose dominionisan everlasting dominion, and hiskingdomisfrom generation to generation:",
            "citation": "(Daniel 4:34)"
          },
          "35": {
            "text": "And all the inhabitants of the eartharereputed asnothing: and he doeth according to hiswillin the army of heaven, andamongthe inhabitants of the earth: and none canstayhis hand, or say unto him, What doest thou?",
            "citation": "(Daniel 4:35)"
          },
          "36": {
            "text": "At the same time my reason returned unto me; and for the glory of my kingdom, mine honour and brightness returned unto me; and my counsellors and my lords sought unto me; and I was established in my kingdom, and excellent majesty was added unto me.",
            "citation": "(Daniel 4:36)"
          },
          "37": {
            "text": "Now I Nebuchadnezzar praise and extol and honour the King of heaven, all whose worksaretruth, and his waysjudgment: and those thatwalkin pride he is able toabase.",
            "citation": "(Daniel 4:37)"
          }
        }
      },
      "5": {
        "verses": {
          "1": {
            "text": "Belshazzar the king made great feast to thousand of his lords, and drank wine before the thousand.",
            "citation": "(Daniel 5:1)"
          },
          "2": {
            "text": "Belshazzar, whiles he tasted the wine, commanded to bring the golden and silvervesselswhich his father Nebuchadnezzar had taken out of the temple whichwasin Jerusalem; that the king, and his princes, his wives, and his concubines, might drink therein.",
            "citation": "(Daniel 5:2)"
          },
          "3": {
            "text": "Then they brought the golden vessels that were taken out of the temple of the house of God whichwasat Jerusalem; and the king, and his princes, his wives, and his concubines, drank in them.",
            "citation": "(Daniel 5:3)"
          },
          "4": {
            "text": "They drank wine, and praised the gods of gold, and of silver, of brass, of iron, of wood, and of stone.",
            "citation": "(Daniel 5:4)"
          },
          "5": {
            "text": "In the same hour came forth fingers of mans hand, and wroteover against the candlestickupon the plaster of the wall of the kings palace: and the king saw the part of thehandthat wrote.",
            "citation": "(Daniel 5:5)"
          },
          "6": {
            "text": "Then the kingscountenancewas changed, and his thoughtstroubledhim, so thatthe jointsof his loins were loosed, and his knees smote one against another.",
            "citation": "(Daniel 5:6)"
          },
          "7": {
            "text": "The king cried aloud to bring in theastrologers, the Chaldeans, and the soothsayers.Andthe king spake, and said to the wisemenof Babylon, Whosoever shall read this writing, and shew me the interpretation thereof, shall be clothed with scarlet, andhavea chain of gold about his neck, and shall be the third ruler in the kingdom.",
            "citation": "(Daniel 5:7)"
          },
          "8": {
            "text": "Then came in all the kings wisemen:but they could not read the writing, nor make known to the king the interpretation thereof.",
            "citation": "(Daniel 5:8)"
          },
          "9": {
            "text": "Then was king Belshazzar greatly troubled, and his countenance was changed in him, and his lords were astonied.",
            "citation": "(Daniel 5:9)"
          },
          "10": {
            "text": "Nowthe queen, by reason of the words of the king and his lords, came into the banquet house:andthe queen spake and said, O king, live for ever: let not thy thoughts trouble thee, nor let thy countenance be changed:",
            "citation": "(Daniel 5:10)"
          },
          "11": {
            "text": "There is man in thy kingdom, in whomisthespiritof the holy gods; and in the days of thy father light and understanding and wisdom, like the wisdom of the gods, was found in him; whom the king Nebuchadnezzar thy father, the king,I say,thy father, made master of the magicians, astrologers, Chaldeans,andsoothsayers;",
            "citation": "(Daniel 5:11)"
          },
          "12": {
            "text": "Forasmuch as an excellent spirit, and knowledge, and understanding, interpreting of dreams, and shewing of hard sentences, and dissolving of doubts, were found in the same Daniel, whom the kingnamedBelteshazzar: now let Daniel be called, and he will shew the interpretation.",
            "citation": "(Daniel 5:12)"
          },
          "13": {
            "text": "Then was Daniel brought in before the king.Andthe king spake and said unto Daniel,Artthou that Daniel, whichartof the children of the captivity of Judah, whom the king my father brought out of Jewry?",
            "citation": "(Daniel 5:13)"
          },
          "14": {
            "text": "I have even heard of thee, that the spirit of thegodsisin thee, andthatlight and understanding and excellent wisdom is found in thee.",
            "citation": "(Daniel 5:14)"
          },
          "15": {
            "text": "And now the wisemen,theastrologers, have been brought in before me, that they should read this writing, and make known unto me the interpretation thereof: but they could not shew the interpretation of the thing:",
            "citation": "(Daniel 5:15)"
          },
          "16": {
            "text": "And I have heard of thee, that thou canst make interpretations, and dissolve doubts: now if thou canst read thewriting, and makeknownto me the interpretation thereof, thou shalt be clothed with scarlet, andhavea chain of gold about thy neck, and shalt be the third ruler in the kingdom.",
            "citation": "(Daniel 5:16)"
          },
          "17": {
            "text": "Then Daniel answered and said before the king, Let thygiftsbe to thyself, and give thy rewards to another; yet I will read the writing unto the king, and make known to him the interpretation.",
            "citation": "(Daniel 5:17)"
          },
          "18": {
            "text": "O thou king, the most high God gave Nebuchadnezzar thy father kingdom, and majesty, and glory, and honour:",
            "citation": "(Daniel 5:18)"
          },
          "19": {
            "text": "And for the majesty that he gave him, all people, nations, and languages, trembled and feared before him: whom he would he slew; and whom he would he kept alive; and whom he would he set up; and whom he would he put down.",
            "citation": "(Daniel 5:19)"
          },
          "20": {
            "text": "But when hisheartwas lifted up, and hismindhardened in pride, he wasdeposedfrom his kingly throne, and they took his glory from him:",
            "citation": "(Daniel 5:20)"
          },
          "21": {
            "text": "And he was drivenfromthe sons of men; and his heart was made like the beasts, and his dwellingwaswith the wild asses: they fed him with grass like oxen, and his body was wet with the dew of heaven; till he knew that the most high God ruled in the kingdom of men, andthathe appointeth over it whomsoever he will.",
            "citation": "(Daniel 5:21)"
          },
          "22": {
            "text": "And thou his son, O Belshazzar, hast not humbled thine heart, though thou knewest all this;",
            "citation": "(Daniel 5:22)"
          },
          "23": {
            "text": "But hast lifted up thyself against the Lord of heaven; and they have brought the vessels of his house before thee, and thou, and thy lords, thy wives, and thy concubines, have drunk wine in them; and thou hast praised thegodsof silver, and gold, of brass, iron, wood, and stone, which see not, nor hear, nor know: and the God in whose hand thy breathis,and whoseareall thy ways, hast thou not glorified:",
            "citation": "(Daniel 5:23)"
          },
          "24": {
            "text": "Then was the part of the hand sent from him; and this writing was written.",
            "citation": "(Daniel 5:24)"
          },
          "25": {
            "text": "And thisisthe writing that was written,Mene, Mene, Tekel, Upharsin.",
            "citation": "(Daniel 5:25)"
          },
          "26": {
            "text": "Thisisthe interpretation of the thing:Mene; God hathnumberedthy kingdom, and finished it.",
            "citation": "(Daniel 5:26)"
          },
          "27": {
            "text": "Tekel; Thou artweighedin the balances, and art found wanting.",
            "citation": "(Daniel 5:27)"
          },
          "28": {
            "text": "Peres; Thy kingdom is divided, and given to the Medes andPersians.",
            "citation": "(Daniel 5:28)"
          },
          "29": {
            "text": "Then commanded Belshazzar, and theyclothedDaniel with scarlet, andputa chain of gold about his neck, and made proclamation concerning him, that he should be the third ruler in the kingdom.",
            "citation": "(Daniel 5:29)"
          },
          "30": {
            "text": "In that night was Belshazzar the king of theChaldeansslain.",
            "citation": "(Daniel 5:30)"
          },
          "31": {
            "text": "AndDariusthe Median took the kingdom,beingabout threescore and two years old.",
            "citation": "(Daniel 5:31)"
          }
        }
      },
      "6": {
        "verses": {
          "1": {
            "text": "It pleased Darius to set over the kingdom an hundred and twenty princes, which should be over the whole kingdom;",
            "citation": "(Daniel 6:1)"
          },
          "2": {
            "text": "And over these three presidents; of whom Danielwasfirst: that the princes might give accounts unto them, and the king should have no damage.",
            "citation": "(Daniel 6:2)"
          },
          "3": {
            "text": "Then this Daniel was preferred above the presidents and princes, because an excellentspiritwasin him; and the king thought to set himoverthe whole realm.",
            "citation": "(Daniel 6:3)"
          },
          "4": {
            "text": "Then the presidents and princes sought to findoccasionagainst Daniel concerning the kingdom; but they could find none occasion nor fault; forasmuch as hewasfaithful, neither was there any error or fault found in him.",
            "citation": "(Daniel 6:4)"
          },
          "5": {
            "text": "Then said these men, We shall not find any occasion against this Daniel, except we finditagainst him concerning the law of his God.",
            "citation": "(Daniel 6:5)"
          },
          "6": {
            "text": "Then these presidents and princes assembled together to the king, and said thus unto him, King Darius, live for ever.",
            "citation": "(Daniel 6:6)"
          },
          "7": {
            "text": "All the presidents of the kingdom, the governors, and the princes, the counsellors, and the captains, have consulted together to establish royal statute, and to make firm decree, that whosoever shall ask petition of any God or man for thirty days, save of thee, O king, he shall becastinto the den of lions.",
            "citation": "(Daniel 6:7)"
          },
          "8": {
            "text": "Now, O king, establish the decree, and sign the writing, that it be not changed, according to the law of the Medes and Persians, whichaltereth not.",
            "citation": "(Daniel 6:8)"
          },
          "9": {
            "text": "Wherefore king Darius signed the writing and the decree.",
            "citation": "(Daniel 6:9)"
          },
          "10": {
            "text": "Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber towardJerusalem, he kneeled upon his kneesthreetimes day, andprayed, and gavethanksbefore his God, as he did aforetime.",
            "citation": "(Daniel 6:10)"
          },
          "11": {
            "text": "Then these men assembled, and found Daniel praying and making supplication before his God.",
            "citation": "(Daniel 6:11)"
          },
          "12": {
            "text": "Then they came near, and spake before the king concerning the kings decree; Hast thou not signed decree, that every man that shall aska petitionof any God or man within thirty days, save of thee, O king, shall be cast into the den of lions? The king answered and said, The thingistrue, according to the law of the Medes and Persians, which altereth not.",
            "citation": "(Daniel 6:12)"
          },
          "13": {
            "text": "Then answered they and said before the king, ThatDaniel, whichisof the children of the captivity of Judah, regardeth not thee, O king, nor the decree that thou hast signed, but maketh his petition three times day.",
            "citation": "(Daniel 6:13)"
          },
          "14": {
            "text": "Then the king, when he heardthesewords, was sore displeased with himself, and sethisheart onDaniel to deliver him: and he laboured till the going down of the sun to deliver him.",
            "citation": "(Daniel 6:14)"
          },
          "15": {
            "text": "Then these men assembled unto the king, and said unto the king, Know, O king, that the law of the Medes and Persiansis,That no decree nor statute which the king establisheth may be changed.",
            "citation": "(Daniel 6:15)"
          },
          "16": {
            "text": "Then the king commanded, and they brought Daniel, and casthiminto the den of lions.Nowthe king spake and said unto Daniel, Thy God whom thou servest continually, he will deliver thee.",
            "citation": "(Daniel 6:16)"
          },
          "17": {
            "text": "And stone was brought, and laid upon the mouth of the den; and the kingsealedit with his own signet, and with the signet of his lords; that the purpose might not be changed concerning Daniel.",
            "citation": "(Daniel 6:17)"
          },
          "18": {
            "text": "Then the king went to his palace, and passed the night fasting: neither were instruments of musick brought before him: and his sleep went from him.",
            "citation": "(Daniel 6:18)"
          },
          "19": {
            "text": "Then the king arose very early in the morning, and went in haste unto the den of lions.",
            "citation": "(Daniel 6:19)"
          },
          "20": {
            "text": "And when he came to the den, he cried with lamentable voice unto Daniel:andthe king spake and said to Daniel, O Daniel,servantof the living God, is thy God, whom thou servest continually, able to deliver thee from the lions?",
            "citation": "(Daniel 6:20)"
          },
          "21": {
            "text": "Then said Daniel unto the king, O king, live for ever.",
            "citation": "(Daniel 6:21)"
          },
          "22": {
            "text": "My God hath sent hisangel, and hath shut thelionsmouths, that they have not hurt me: forasmuch as before him innocency was found in me; and also before thee, O king, have I done no hurt.",
            "citation": "(Daniel 6:22)"
          },
          "23": {
            "text": "Then was the king exceeding glad for him, and commanded that they should take Daniel up out of the den. So Daniel was taken up out of the den, and no manner of hurt was found upon him, because hebelievedin his God.",
            "citation": "(Daniel 6:23)"
          },
          "24": {
            "text": "And the king commanded, and they brought those men which had accused Daniel, and they casttheminto the den of lions, them, their children, and their wives; and the lionshadthe mastery of them, and brake all their bones in pieces or ever they came at the bottom of the den.",
            "citation": "(Daniel 6:24)"
          },
          "25": {
            "text": "Then king Darius wrote unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.",
            "citation": "(Daniel 6:25)"
          },
          "26": {
            "text": "I make decree, That in every dominion of my kingdom men tremble and fear before the God of Daniel: for heistheliving God, andsteadfastfor ever, and his kingdomthatwhich shall not bedestroyed, and his dominionshall be evenunto the end.",
            "citation": "(Daniel 6:26)"
          },
          "27": {
            "text": "Hedeliverethand rescueth, and he worketh signs and wonders in heaven and in earth, who hathdeliveredDaniel from the power of the lions.",
            "citation": "(Daniel 6:27)"
          },
          "28": {
            "text": "So this Daniel prospered in the reign ofDarius, and in the reign ofCyrusthe Persian.",
            "citation": "(Daniel 6:28)"
          }
        }
      },
      "7": {
        "verses": {
          "1": {
            "text": "In the first year of Belshazzar king of Babylon Daniel had adreamand visions of his head upon his bed: then he wrote the dream,andtold the sum of the matters.",
            "citation": "(Daniel 7:1)"
          },
          "2": {
            "text": "Daniel spake and said, I saw in my vision by night, and, behold, the four winds of the heaven strove upon the great sea.",
            "citation": "(Daniel 7:2)"
          },
          "3": {
            "text": "And four greatbeastscame upfrom thesea, diverse one from another.",
            "citation": "(Daniel 7:3)"
          },
          "4": {
            "text": "Thefirstwaslike lion, and had eagles wings: I beheld till the wings thereof were plucked, and it was lifted up from the earth, and made stand upon the feet as man, and mans heart was given to it.",
            "citation": "(Daniel 7:4)"
          },
          "5": {
            "text": "And behold anotherbeast, second, like to bear, and it raised up itself on one side, andit hadthree ribs in the mouth of it between the teeth of it: and they said thus unto it, Arise, devour much flesh.",
            "citation": "(Daniel 7:5)"
          },
          "6": {
            "text": "After this I beheld, and lo another, like leopard, which had upon the back of it four wings of fowl; the beast had also fourheads; and dominion was given to it.",
            "citation": "(Daniel 7:6)"
          },
          "7": {
            "text": "After this I saw in the night visions, and behold fourthbeast, dreadful and terrible, and strong exceedingly; and it had greatironteeth: it devoured and brake in pieces, and stamped the residue with the feet of it: and itwasdiverse from all the beasts thatwerebefore it; and it hadtenhorns.",
            "citation": "(Daniel 7:7)"
          },
          "8": {
            "text": "I considered the horns, and, behold, there came up among them another littlehorn, before whom there were three of the first horns plucked up by the roots: and, behold, in this hornwereeyes like the eyes of man, and amouthspeaking great things.",
            "citation": "(Daniel 7:8)"
          },
          "9": {
            "text": "I beheld till thethroneswerecast down, and theAncient of daysdid sit, whosegarmentwaswhite as snow, and the hair of his head like the pure wool: his thronewas likethe fiery flame,andhiswheelsasburning fire.",
            "citation": "(Daniel 7:9)"
          },
          "10": {
            "text": "A fiery stream issued and came forth from before him:thousandthousands ministered unto him, and ten thousand times ten thousand stood before him: thejudgmentwas set, and thebookswere opened.",
            "citation": "(Daniel 7:10)"
          },
          "11": {
            "text": "I beheld then because of the voice of the great words which the horn spake: I beheldeventill thebeastwas slain, and his body destroyed, and given to the burningflame.",
            "citation": "(Daniel 7:11)"
          },
          "12": {
            "text": "As concerning the rest of the beasts, they had their dominion taken away: yet their lives were prolonged for season and time.",
            "citation": "(Daniel 7:12)"
          },
          "13": {
            "text": "I saw in the night visions, and, behold,onelike theSon of mancame with thecloudsof heaven, and came to the Ancient of days, and they brought him near before him.",
            "citation": "(Daniel 7:13)"
          },
          "14": {
            "text": "And there was given himdominion, and glory, and akingdom, that all people, nations, and languages, should serve him: his dominionisaneverlastingdominion, which shall not pass away, and his kingdomthatwhich shall not be destroyed.",
            "citation": "(Daniel 7:14)"
          },
          "15": {
            "text": "I Daniel was grieved in my spirit in the midst ofmybody, and the visions of my head troubled me.",
            "citation": "(Daniel 7:15)"
          },
          "16": {
            "text": "I came near unto one of them that stood by, and asked him the truth of all this. So he told me, and made me know the interpretation of the things.",
            "citation": "(Daniel 7:16)"
          },
          "17": {
            "text": "These great beasts, which are four,arefourkings,whichshall arise out of the earth.",
            "citation": "(Daniel 7:17)"
          },
          "18": {
            "text": "But thesaintsof the most High shall take the kingdom, and possessthe kingdom for ever, even for ever and ever.",
            "citation": "(Daniel 7:18)"
          },
          "19": {
            "text": "Then I would know the truth of the fourth beast, which was diverse from all the others, exceeding dreadful, whose teethwere ofiron, and his nailsofbrass;whichdevoured, brake in pieces, and stamped the residue with his feet;",
            "citation": "(Daniel 7:19)"
          },
          "20": {
            "text": "And of the ten horns thatwerein his head, andofthe other which came up, and before whom three fell; evenofthat horn that had eyes, and mouth that spake very great things, whose lookwasmore stout than his fellows.",
            "citation": "(Daniel 7:20)"
          },
          "21": {
            "text": "I beheld, and the same horn madewarwith the saints, and prevailed against them;",
            "citation": "(Daniel 7:21)"
          },
          "22": {
            "text": "Until theAncient of dayscame, andjudgmentwas given to thesaintsof the most High; and the time came that the saints possessed the kingdom.",
            "citation": "(Daniel 7:22)"
          },
          "23": {
            "text": "Thus he said, The fourth beast shall be the fourth kingdom upon earth, which shall be diverse from all kingdoms, and shall devour the whole earth, and shall tread it down, and break it in pieces.",
            "citation": "(Daniel 7:23)"
          },
          "24": {
            "text": "And the tenhornsout of this kingdomaretenkingsthatshall arise: and another shall rise after them; and he shall be diverse from the first, and he shall subdue three kings.",
            "citation": "(Daniel 7:24)"
          },
          "25": {
            "text": "And he shall speakgreatwords against the most High, and shallwearout the saints of the most High, and think to change times and laws: and they shall be given into his hand until time and times and the dividing of time.",
            "citation": "(Daniel 7:25)"
          },
          "26": {
            "text": "But thejudgmentshall sit, and they shall take away his dominion, to consume and to destroyitunto the end.",
            "citation": "(Daniel 7:26)"
          },
          "27": {
            "text": "And thekingdomand dominion, and the greatness of the kingdom under the whole heaven, shall begivento the people of the saints of the most High, whose kingdomisaneverlastingkingdom, and all dominions shall serve and obey him.",
            "citation": "(Daniel 7:27)"
          },
          "28": {
            "text": "Hithertoisthe end of the matter. As for me Daniel, mycogitationsmuch troubled me, and my countenance changed in me: but I kept the matter in my heart.",
            "citation": "(Daniel 7:28)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 75956,
  "total_sources": 9,
  "generated_at": "2025-12-14T04:01:27.399784"
}