{
  "week_number": 31,
  "date_range": "Ezra 1",
  "title": "Ezra 1;3–7;Nehemiah 2;4–6;8",
  "primary_scriptures": [
    {
      "book": "Ezra",
      "chapters": [
        "1"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Nehemiah",
      "chapters": [
        "2"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: Ezra 1;3–7;Nehemiah 2;4–6;8 ---\nThe Jewish people had been captives in Babylonia for about 70 years. They had lost Jerusalem and the temple, and many had forgotten their commitment to God’s law. But God had not forgotten them. In fact, He had declared through His prophet, “I will visit you, and perform my good word toward you, in causing you to return” (\nJeremiah 29:10\n). True to this prophecy, the Lord made a way for His people to return—both to Jerusalem and, more importantly, to their covenants. And He raised up servants who accomplished “a great work” (\nNehemiah 6:3\n): A governor named Zerubbabel oversaw the rebuilding of the house of the Lord. Ezra, a priest and scribe, helped the people turn their hearts back to the Lord’s law. And Nehemiah led the rebuilding of the protective walls around Jerusalem. They met opposition, but they also got help from unexpected sources. Their experiences can inform and inspire ours because we too are doing a great work. And like theirs, our work has much to do with the house of the Lord, the law of the Lord, and the spiritual protection we find in Him.\nFor an overview of the books of Ezra and Nehemiah, see “\nEzra\n” and “\nNehemiah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nEzra 1\nThe Lord inspires people to accomplish His purposes.\nAfter Persia conquered Babylonia, the Lord inspired the Persian king, Cyrus, to send a group of Jews to Jerusalem to rebuild the temple. As you read\nEzra 1\n, note what Cyrus did to support the Jews in this important work. How do you see the Lord working through men and women around you, including people who are not members of His Church? What does this suggest to you about the Lord and His work?\nSee also\nIsaiah 44:24–28\n.\nEzra 3:8–13\n;\n6:16–22\nThe house of the Lord is a place of joy.\nWhen the Babylonians invaded Jerusalem, they plundered the temple and burned it to the ground (see\n2 Kings 25:1–10\n;\n2 Chronicles 36:17–19\n). How do you think you might have felt if you had been one of the Jews who witnessed this? (see\nPsalm 137\n). Notice how the Jews felt, decades later, when they were allowed to return and rebuild the temple (see\nEzra 3:8–13\n;\n6:16–22\n). That might prompt you to ponder your own feelings about the Lord and His house. Why is the building of a temple a reason to celebrate?\nThe temple of Zerubbabel; illustration by Sam Lawlor\nEzra 4–7\n;\nNehemiah 2\n;\n4\n;\n6\nGod has an important work for me to do.\nThe Lord’s work rarely goes unopposed. This was true of the efforts led by Zerubbabel and Nehemiah. Here’s a simple approach that can help you learn from these stories and consider how you can do the Lord’s work despite opposition:\nGod’s work for Zerubbabel (\nEzra 4:3\n):\nCreate a Note\nGod’s work for Nehemiah (\nNehemiah 2:17–18\n):\nCreate a Note\nGod’s work for me:\nCreate a Note\nOpposition Zerubbabel faced (\nEzra 4:4–24\n):\nCreate a Note\nOpposition Nehemiah faced (\nNehemiah 2:19\n;\n4:1–3, 7–8\n;\n6:1–13\n):\nCreate a Note\nOpposition I face:\nCreate a Note\nHow Zerubbabel responded (\nEzra 5:1–2\n):\nCreate a Note\nHow Nehemiah responded (\nNehemiah 2:20\n;\n4:6, 9\n;\n6:3–15\n):\nCreate a Note\nHow I can respond:\nCreate a Note\nFor help comparing Nehemiah’s experience to your life, you might study President Dieter F. Uchtdorf’s message “\nWe Are Doing a Great Work and Cannot Come Down\n” (\nEnsign\nor\nLiahona\n, May 2009, 59–62), especially\nthe last two sections\n. As you think about the work God has given you, you might study the “\nYoung Women Theme\n” or the “\nAaronic Priesthood Quorum Theme\n” (Gospel Library). Or you could look in a hymn like “\nAs Sisters in Zion\n” (\nHymns\n, no. 309) or “\nYe Elders of Israel\n” (\nHymns\n, no. 319).\nWhat do you think it means to have “a mind to work” in the service of the Savior? (\nNehemiah 4:6\n). What might it mean to have “the good hand of … God upon [you]” as you do His work? (\nNehemiah 2:8\n; see also\nNehemiah 2:18\n;\nEzra 7:6, 9, 27–28\n). How have you seen His hand in your efforts to serve Him?\nNehemiah 8\nI am blessed when I study the scriptures.\nFor generations in captivity, the Jews had limited access to “the book of the law of Moses” (\nNehemiah 8:1\n). In\nNehemiah 8\n, Ezra read the law to the people. What do you find in this chapter that shows how Ezra and his people felt about God and His word? (see especially\nverses 1–12\n). What in your life shows how you feel about God and His word?\nSee also\nTeachings of Presidents of the Church: Ezra Taft Benson\n(2014),\n115–24\n.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nEzra 3:8–13\n;\n6:16–22\nThe house of the Lord is a place of joy.\nTo teach your children about the joy the Jews felt when their temple was rebuilt, you could show them a picture like the one below. Talk about why these people might be happy to be at the house of the Lord. You could also tell your children why the temple is a place of joy for you. How has the temple helped you feel closer to Heavenly Father and the Savior?\nAs you read\nEzra 3:10–13\nwith your children, help them find words that show how the Jews felt when the temple was being rebuilt. When you get to the end of\nverse 13\n, maybe you could shout for joy together. Help your children think of reasons to be joyful that the Lord has given us temples. How can we show that joy?\nConsider singing a song about the temple with your children, such as the second verse of “Welcome Home” (Gospel Library). After each line, you could pause to ask a child to share something he or she loves about the temple. You might also look at\npictures of temples\nwhile you sing.\nNehemiah 2:17–20\n;\n6:1–9\nThe Lord will help me do His “great work.”\nShare with your children the story of Nehemiah (see\nNehemiah 2:17–20\n;\n6:1–9\n; or “\nNehemiah\n” in\nOld Testament Stories\n, 173–74). As you read\nNehemiah 2:20\n, you and your children could “arise” and pretend to help build the walls of Jerusalem. Or your children might enjoy building a wall with blocks or other objects. As they do, you could help them think of important things Heavenly Father wants us to do.\n1:38\nNehemiah\nAs you read\nNehemiah 6:9\n, invite your children to raise their hands when they hear you say “strengthen my hands.” Tell the children about a time when you felt God strengthen your hands to do His work.\nNehemiah 8:1–12\nThe scriptures are a blessing.\nRead aloud some phrases from\nNehemiah 8:2–3, 5–6, 8–9, 12\nthat describe what the people did when they heard Ezra read the scriptures. As you read, your children could act out these phrases. Then you could share with each other how you feel when you read or hear the scriptures.\nAs you read together\nNehemiah 8:8\n, you could ask your children what helps them understand the scriptures. Show them how to use scripture study aids like the\nGuide to the Scriptures\nand\nTopics and Questions\n(Gospel Library). Invite your children to share something they have learned about the Savior from the scriptures.\nLook for eternal truth in the scriptures.\n“The scriptures … are filled with gospel truths, but sometimes it takes conscious effort to find them. As you are learning together from the scriptures, stop and ask those you teach what gospel truths they notice. Help them see how these truths relate to Heavenly Father’s plan of salvation. Sometimes eternal truths are stated in the scriptures, and sometimes they are illustrated in the stories and lives of the people we read about. It can also be helpful to explore together the historical background of the verses you are reading, as well as the meaning of the verses and how they apply to us today” (\nTeaching in the Savior’s Way\n,\n22\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 31: Lesson 90: Lesson 90—2 Chronicles 14–16This lesson can help students make a plan to seek the Lord.; Lesson 91: Lesson 91—2 Chronicles 17–20This lesson can help students learn to identify gospel principles from the scriptures.... ---\n\n--- Lesson 90 ---\nSome people might seek Heavenly Father and Jesus Christ only when things are going well. Others might cry out for Their help only in times of trouble. Like Asa, the king of Judah, we can seek the Lord during both peaceful and difficult times. This lesson can help students make a plan to seek the Lord. Student preparation: Invite students to make a list of ways they could seek the Lord in their lives. Possible Learning Activities Seeking to find Consider beginning the lesson by inviting students to think about how we look for things that are lost. You could list or display a few things that vary in value, such as a pencil, an important homework assignment, a cell phone, a gift from a loved one, and so on. Ask students what efforts they would put into finding each item if it were lost. Why do your efforts to find something differ depending on what you are looking for? Consider writing Seek the Lord at the top of the board. What do you think it means to seek the Lord? If students struggle to answer, you might ask how they get to know someone and develop a good relationship. Then ask how they might seek to know and develop a relationship with the Lord. You might explain that the Hebrew word for seek in the verses they will study today ( 2 Chronicles 14:4 ; 15:2, 12 ; 16:12 ) is darash and means to search for, ask, visit, pursue, consult, or apply oneself to. In your study journal, respond to the following questions: What are some things that you or others you know have done to seek the Lord? How much effort do you give to seek the Lord? As you study today, look for ways you can seek the Lord. Write any thoughts or feelings that come to you from the Holy Ghost. An example of seeking the Lord Consider sharing or summarizing the following paragraph. The books of Chronicles and Kings cover roughly the same time period. In 2 Chronicles 14–16 and 1 Kings 15 , we read an account of King Asa, the third king of Judah. You could create the following chart on the board to help students with the next activity. Students could also create the chart in their study journals. How Asa and his people sought the Lord How the Lord blessed them How Asa and his people sought the Lord How the Lord blessed them Consider separating students into four different groups. Ask each group to read a different set of the following verses. A student from each group could write what they learned on the board. If students need help understanding “groves” in 2 Chronicles 14:3 , explain that they were places where people worshipped false gods. Read one of the following sets of verses, looking for what Asa and his people did and how God blessed them: 2 Chronicles 14:3–7 . During a time of peace 2 Chronicles 14:9–13 . When the Ethiopians attacked 2 Chronicles 15:1–9 . During a time of peace 2 Chronicles 15:10–12, 15 . During a time of peace Ask the following question to help students identify a truth from what they have studied. As students share, add their responses to the chart on the board. What did you learn from the experiences of Asa and his people? Using the students’ words, help them identify truths such as the following: As I seek the Lord with all my heart, He will give me rest ( 2 Chronicles 14:7 ; 15:15 ) If I seek the Lord, I will find Him ( 2 Chronicles 15:2 ) As students share, consider asking follow-up questions to help them think about what some of the words or phrases might mean. For example, you might ask, “What do you think it means to find the Lord?” or “What might it look like for the Lord to give us rest?” For teachings that might help with these or other questions, see the Additional Resources section. Seeking and finding the Lord Help students make connections between Asa’s life and their own lives. You might relabel the existing chart on the board with How I can seek the Lord in the left column and How the Lord might bless me in the right column. Then invite students to do the following in groups or on their own. In addition to what Asa and his people did, add to the left-hand column of your list ways you can seek the Lord. These ways might come from your own experience, examples in scriptures or Church history, or talks from Church leaders. Students could add their examples to the left-hand column on the board. If you feel the following activities would help students identify meaningful ways to seek the Lord, you could do either or both: Direct students to the “Invitations” portion of each of the major sections in For the Strength of Youth: A Guide for Making Choices (2022). Major sections include “Jesus Christ will help you,” “Love God, love your neighbor,” and so on. Watch “ Make Time for the Lord ” from time code 1:00 to 3:29 (available at ChurchofJesusChrist.org ). As students listen to President Russell M. Nelson, invite them to identify ways that we can seek the Lord. 5:49 You might want to help students think about obstacles they might face while striving to do the actions they just shared. To do so, consider asking the following questions. What can distract us from seeking the Lord? What helps you seek the Lord despite distractions? Consider inviting them to mark the phrase “he will be found of you” in 2 Chronicles 15:2 . To help students think of ways we can find the Lord, ask the following. How has the Lord blessed you or someone you know as you have sought Him? After students share, encourage them to write their thoughts in the right hand column of the chart. You might want to testify that the blessings students shared could be evidence that they have found Him. Making a plan Help students act on something they have felt or learned during the lesson. To do so, encourage them to consider the impressions they might have received from the Spirit throughout class. Also, in lesson 87 , students revisited their scripture study goals as a way to come closer to the Lord. If useful, they could evaluate how their goals are going and decide if they would like to use their goals in this plan as well. Pick one thing you can do to seek the Lord. Answer the following questions in your study journal. Plan how you can include this action in your life. Why do you think this action might help you find the Lord more in your life? What challenges might you face as you strive to do this? What specific steps can you take to do it despite these challenges? Consider ending class with your own testimony of the blessings of seeking the Lord.\n\n\n--- Lesson 91 ---\nDo you ever wonder what you can do to draw closer to Jesus Christ? The Old Testament king Jehoshaphat was a great example of doing just that. His people had fallen away from God and engaged in idol worship. Jehoshaphat chose to follow Jehovah and helped his people do the same. This lesson can help students learn to identify gospel principles from the scriptures. Student preparation: Consider inviting students to reflect on what they are learning in their personal and family study of the scriptures. They could come to class ready to share a principle they found and how it helps them. Possible Learning Activities Anchors of safety Show the following picture of someone rock climbing. If you were to climb a cliff, what equipment would you need? Why is this equipment necessary? If we compare our lives to climbing a cliff, what has the Lord given you to help you safely succeed? Students might share a variety of answers. As they do, thank them for their responses, and ask why these things would help. The following answer is the focus of this lesson. Elder Richard G. Scott (1928–2015) of the Quorum of the Twelve Apostles taught: You and I can be assured of reaching worthy objectives in life by understanding and consistently following correct principles rooted in revealed truth. Principles are anchors of safety. They are like the steel anchors a mountaineer uses to conquer otherwise impossible cliffs. They will help you have confidence in new and unfamiliar circumstances. They will provide you protection in life’s storms of adversity. (“ The Power of Correct Principles ,” Ensign , May 1993, 32) One of the ways that Heavenly Father has lovingly provided us with true principles is through the scriptures. As we study the scriptures, we seek to identify these principles or statements of truth that can help us in our lives. It might be helpful to have students reflect on their current ability to identify principles in the scriptures. Here is one way to do this. Take a moment to ponder the following questions: How confident am I in my ability to identify principles? How well do I understand how principles can help me in my life? As you study this lesson on the life of Jehoshaphat, seek the help of the Holy Ghost to identify true principles that can help you. Principles from the life of Jehoshaphat Following the death of his father, Jehoshaphat became king of Judah. Israel and Judah had both fallen away from the Lord Jesus Christ. They worshipped false gods. Read 2 Chronicles 17:3–4 ; 19:4 , and see what you learn about Jehoshaphat. (Note: Baalim refers to false gods.) What impresses you about Jehoshaphat? When Jehoshaphat came into power, his people were in apostasy. Jehoshaphat made many efforts throughout his kingdom to help his people follow Jehovah (Jesus Christ). During this time, the enemies of Jehoshaphat came up to battle against his people. What happened in these circumstances illustrates a variety of principles. Consider explaining the following study skill to identify principles. One way to identify a principle is to look for how two things relate. For example: because of A, B happens. Or because a person does A, the Lord promises or gives B. Read through the following verses as a class to give students an opportunity to practice using the skill. Read 2 Chronicles 17:6 and 19:3 , looking for principles in the life of Jehoshaphat. (Note: high places and groves were places to worship false gods.) Some principles students might identify are: As we focus our lives on God, we can more easily remove evil from our lives (see 2 Chronicles 17:6 ). As we remove evil from our lives, we are more prepared to seek God (see 2 Chronicles 19:3 ). Why are these principles helpful? After identifying principles from the previous verses as a class, invite students to practice identifying principles in small groups or on their own. Have them use the following verses. Read 2 Chronicles 20:1–9, 14–17, 20–22 , looking for additional true principles. Some principles students might identify are: As we fast and pray for deliverance, the Lord will be with us in our challenges (see 2 Chronicles 20:1–4, 14–17 ). As we seek the Lord in His temple, He will hear and help us (see 2 Chronicles 20:9 ). As we believe in the Lord and his prophets, we will prosper (see 2 Chronicles 20:20 ). As we praise the Lord through music, He will bless us (see 2 Chronicles 20:21–22 ). If students struggle to identify principles, consider writing some or all of the principles above on the board. Invite students to identify which of the verses studied teach each principle. Understanding principles For the following activity, students can use any of the principles above, or they can use a principle that they learned recently in their personal or family study. Choose a principle you would like to learn more about. Prepare a two-minute talk on this truth that includes the following: A verse or verses you read in 2 Chronicles about this principle, and why you selected it Other scriptures or words of the prophets that help you understand this principle A time when the Savior or someone else in scriptures or Church history exemplified this principle Ways you feel this principle from the Lord can help us or keep us safe An experience when you or someone you know acted according to this principle, and any blessings from the Lord that came as a result Students could share their talks with a partner or small group. Or you might invite a few willing students who studied different principles to share their talks with the class. Between each student’s talk, you could invite the class to share any comments or questions they have about the principle the student shared. Make sure to provide enough time for students to prepare and share their two-minute talks. From what you learned today, why is it useful to strive to find the principles that the Lord has given us in scripture? How might you use what you learned today in your family and personal study? Encourage students to come to know the Savior better by making personal connections to their lives from the scriptures. The previous question is an example of encouraging students to connect what they are learning in seminary with their study at home. You might want to look for other ways to do this. You can also ask how what they are learning at home connects to what they are learning in seminary. (For additional training on this, see “ Develop and ask questions that help learners connect what they have learned in their personal and family scripture study to the classroom experience ” in Teacher Development Skills .)\n\n\n--- Lesson 92 ---\nOur level of preparation for important events in our lives can greatly affect the experience we have. Many Israelites were able to experience deep joy after years of physical and spiritual preparation to rebuild and worship in a temple of God. Our Heavenly Father and Savior have also blessed us with opportunities to experience joy by worshipping in the house of the Lord. Our efforts to prepare for that blessing can affect our experience. This lesson can help students feel a greater desire to prepare to worship the Lord in His holy temple. Student preparation: Invite students to make a list of both short- and long-term things they could do to prepare to worship the Lord in the temple. They could then consider how their preparation can affect their temple experience. Possible Learning Activities Looking forward to the temple You might begin class by inviting students to write on the board some future events they are excited to experience. Examples could include graduation, marriage, and careers. Students could then pick one event from the board and share with a partner one or two things someone could do to prepare for that event. Consider displaying the following image of the Salt Lake temple when it was nearly ready to be dedicated in the 1890s. Read the following statement from President Wilford Woodruff (1807–98), looking for something that he had been preparing for and looking forward to for many years. [At the dedication of the Salt Lake temple] President Wilford Woodruff then arose to address the Saints. “I have looked forward to this day for the last fifty years of my life,” he said. ( Saints: The Story of the Church of Jesus Christ in the Latter Days , vol. 2, No Unhallowed Hand, 1846–1893 [2020], 663–64) What do you know about temples that may have caused Wilford Woodruff to look forward to the completion of the Salt Lake temple? If students did not mention God as they answered the previous question, you could help them make that connection by asking a question like, “What connection do you see between attending the temple and our relationship with Heavenly Father and Jesus Christ?” Invite students to write their thoughts about the following questions in their study journal. You may want to explain that taking time to reflect on our current feelings and experiences can help prepare us to learn from the Holy Ghost. What are my feelings as I look ahead to attending the temple in the future? What am I doing to prepare myself to worship the Lord in His house? Joy in temple service Around 605 BC Babylonians conquered Jerusalem and began deporting captive Jews to Babylon. In 587 BC, they destroyed the temple, and the deportations escalated. About 50 years later, Persia conquered Babylon under the command of King Cyrus. If your students remember a temple being announced in their area, you might remind them of that experience as they read the following verses. Or you might ask students to try to imagine how they will feel if a temple were to be announced in their area. Read Ezra 1:1–3 , looking for what God inspired King Cyrus to do. What thoughts and feelings do you think the Jews might have had? Why? Eventually, around 50,000 Jews returned to Jerusalem to rebuild the temple under the direction of Zerubbabel (see Ezra 2:1–2, 64–65 ). As a fulfillment of prophecy (see Isaiah 44:28 ; Jeremiah 29:10 ), the temple was rebuilt 70 years after it had been destroyed. Read Ezra 6:15–16, 22 and mark how the Jews felt when the temple was finally dedicated after many years of hard work and spiritual preparation. As students continue to study the account of the people in Ezra, invite them to watch for evidence of this truth: As we prepare to worship the Lord in the temple, He will bless us with joy You may want to write this truth on the board. Help students understand what this truth could look like in a teenager’s life. One way to do this is to invite the class to briefly describe two teenagers: one who simply attends the temple and one who prepares to worship the Lord in the temple. Before asking the following question, you might invite students to ponder experiences they have had preparing for, or attending, the temple. How can worshipping the Lord in the temple bring us joy? To give students an example of how worshipping the Lord in the temple can bring joy, consider watching the experience of Elder Kevin R. Duncan of the Seventy in “Hearts, Love, and the Temple,” available at byui.edu/devotionals from time code 21:46 to 24:05. After the video, you could invite students to share how our relationship with Heavenly Father and Jesus Christ can be strengthened through temple worship. Preparing to attend the temple The following statement can help students transition from learning about the Jews building the temple in Jerusalem to their own preparation to worship in the temple. Students could write or link the statement in their scriptures next to Ezra 6:15–16 . President Russell M. Nelson taught: In some respects, it is easier to build a temple than it is to build a people prepared for a temple. (“ Closing Remarks ,” Ensign or Liahona , Nov. 2019, 122–23) Invite students to share reasons why it might be easier to build a temple than to be prepared to worship the Lord in the temple. We can learn about preparing to worship the Lord in the temple by studying the Jews’ experience rebuilding the temple in Jerusalem. The accompanying handout can help students find greater relevance in the book of Ezra to their lives by comparing the Jews’ efforts to build the temple to our preparations to worship the Lord in His temples. Students could complete the handout in small groups. To do this, each member of the group could complete one or two sections of the handout. They could then share what they learned with their group. Alternatively, you could cut the handout into sections and place them throughout the classroom. Groups of students could rotate through the classroom and complete each section of the handout, answering the questions in their study journals. Open PDF After students have completed the handout, ensure that they have time to discuss insights that stood out to them. Consider displaying the following questions. Make three columns on the board titled “1,” “2,” and “3.” Invite students to write their name in the column under the question number that they would be willing to answer. Invite volunteers from each column to share their answers with the class. How do you think preparing to attend the Lord’s house can help us experience joy as we attend the temple? How has the Lord blessed you with joy as you have attended the temple? What do you know about Heavenly Father and Jesus Christ that would motivate you to prepare to attend Their holy house? Consider sharing your witness of the joy we receive from the Lord when we prepare ourselves to worship Him in the temple.\n\n\n--- Lesson 93 ---\nGod inspired Nehemiah to protect his people by rebuilding the walls around Jerusalem. Nehemiah’s people had to overcome constant threats and distractions to accomplish this work. We too have been given important work from God, and we too may face difficulties in accomplishing it. This lesson is meant to encourage students to remain focused on the work Heavenly Father has given them to do. Student preparation: Invite students to come to class with a list of three things that they feel Heavenly Father would have them focus on: one thing for this week, one for the next few years, and one for later in life. You might suggest that students who already have their patriarchal blessing read it again before creating their list. Possible Learning Activities Distraction Consider beginning class by helping students recognize things that could draw their attention away from doing God’s work. To do this, you could show the video “ Doing What Matters Most ” (1:42), available at ChurchofJesusChrist.org . Or you could share the information in the following paragraph and display the statement below from President Dieter F. Uchtdorf, then of the First Presidency. 1:42 Years ago, as pilots prepared to land a plane, a tiny light in the cockpit failed to illuminate. The crew became so focused on the lightbulb that they failed to notice the plane was descending into a swamp. The plane crashed, killing over 100 people. President Dieter F. Uchtdorf, then of the First Presidency, taught an important lesson from this tragedy: The plane was in perfect mechanical condition. Everything was working properly—all except one thing: a single burned-out lightbulb. That tiny bulb—worth about 20 cents—started the chain of events that ultimately led to the tragic death of over 100 people. Of course, the malfunctioning lightbulb didn’t cause the accident; it happened because the crew placed its focus on something that seemed to matter at the moment while losing sight of what mattered most. The tendency to focus on the insignificant at the expense of the profound happens not only to pilots but to everyone. We are all at risk. (“ We Are Doing a Great Work and Cannot Come Down ,” Ensign or Liahona , May 2009, 59) Invite students to share how they think President Uchtdorf’s message can apply to us as disciples of Jesus Christ. Then you might display the following statement and ask students to silently read it. Encourage them to ask Heavenly Father to guide them through the Spirit to understand how this message applies to them personally. They could record their thoughts in their study journals. President Uchtdorf continued: Pause for a moment and check where your own heart and thoughts are. Are you focused on the things that matter most? How you spend your quiet time may provide a valuable clue. Where do your thoughts go when the pressure of deadlines is gone? Are your thoughts and heart focused on those short-lived fleeting things that matter only in the moment or on things that matter most? (“ We Are Doing a Great Work and Cannot Come Down ,” Ensign or Liahona , May 2009, 60) Nehemiah’s work Explain to students that an Israelite named Nehemiah was a servant of Artaxerxes, king of Persia. Many Israelites had returned to Jerusalem years earlier to rebuild the temple. Nehemiah learned that they were in danger of attack because the protective walls and gates around Jerusalem were broken down. Consider inviting students to complete the following activity in small groups. Encourage groups to not rush through the steps, but to take their time and learn from Nehemiah’s experience. To help groups stay on the same schedule, you may want to display only one step of the instructions at a time. Give groups enough time to complete that step before displaying the subsequent step. Read Nehemiah 1:1–4 ; 2:1–6, 11–12, 17–18 . Look for and discuss evidence that Nehemiah’s desires to rebuild the walls of Jerusalem were inspired of God. Write on a blank piece of paper three things God has asked Latter-day Saint teenagers to focus on through His prophets. One way to do this is to briefly review talks from the most recent general conference. Then, exchange papers with another group and discuss with your group what they wrote. ( Note : Keep the other group’s paper. In step four of this activity, you will add things to it.) Read Nehemiah 2:19 ; 4:1, 7–8 , looking for how the Jews’ enemies reacted to the work God gave them. Discuss ways that Satan uses similar tactics today to get us to lose focus on what God asks us to do. Next to each of the three things listed on the other group’s paper, write a distraction or difficulty that could make it hard for a teenager to stay focused on the work God has given them through His prophets. Read Nehemiah 4:9, 14–20 and discuss what you learn from Nehemiah’s people about overcoming distractions and difficulties in accomplishing the work Heavenly Father gives us. Return the paper to the original group. Read and discuss the distractions and difficulties the other group added to your paper. Discuss ideas of how someone could overcome them and stay focused on the work God has given teenagers through His prophets. Summarize in one sentence what you learned or felt about doing the work Heavenly Father has given us. Write this truth on the board. After the activity, encourage volunteers to share what they learned or felt with the class. You might invite students to point out a truth on the board that another group wrote and share what they learned from it. As students share truths, help them focus on Jesus Christ by asking questions such as, “What teachings or examples from the Savior’s life help us better understand this truth?” Examples of truths groups might have written are: Through prayer, we can receive protection and strength from God to accomplish His work. ( Nehemiah 1:4 ; 4:9 ) God will help His servants overcome opposition to doing His work . ( Nehemiah 4:20 ) How can what you learned in this activity help you remain focused on the work God has given you to do? The video “ The Soul’s Sincere Desire ” (3:28), available at ChurchofJesusChrist.org , could help students notice and discuss how even good things can become distractions from focusing on the more important work God has given us. 3:29 Personal application Explain to students that Nehemiah was individually targeted by his enemies. They tried many tactics to stop him from doing God’s work of rebuilding Jerusalem’s walls. One tactic was to try to lure him out of the city to where they could more easily harm him. Invite students to silently complete the following. You may want to give them plenty of time and encourage them to think about how they feel God would have them complete the statements. Read Nehemiah 6:1–4, 15–16 and ponder what you learn from Nehemiah’s response to his enemies’ attempts to pull him away from God’s work. (You may want to mark and ponder what verse 3 could mean in your life.) Complete the following statements based on your life. Record your thoughts in your study journal or in the margin of your scriptures next to verse 3 . I believe Heavenly Father would like me to focus on . Some potential distractions or difficulties I might face are . Some ways I can remain focused on Heavenly Father’s work are .",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Ezra 1;3–7;Nehemiah 2;4–6;8",
      "content": "The Jewish people had been captives in Babylonia for about 70 years. They had lost Jerusalem and the temple, and many had forgotten their commitment to God’s law. But God had not forgotten them. In fact, He had declared through His prophet, “I will visit you, and perform my good word toward you, in causing you to return” (\nJeremiah 29:10\n). True to this prophecy, the Lord made a way for His people to return—both to Jerusalem and, more importantly, to their covenants. And He raised up servants who accomplished “a great work” (\nNehemiah 6:3\n): A governor named Zerubbabel oversaw the rebuilding of the house of the Lord. Ezra, a priest and scribe, helped the people turn their hearts back to the Lord’s law. And Nehemiah led the rebuilding of the protective walls around Jerusalem. They met opposition, but they also got help from unexpected sources. Their experiences can inform and inspire ours because we too are doing a great work. And like theirs, our work has much to do with the house of the Lord, the law of the Lord, and the spiritual protection we find in Him.\nFor an overview of the books of Ezra and Nehemiah, see “\nEzra\n” and “\nNehemiah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nEzra 1\nThe Lord inspires people to accomplish His purposes.\nAfter Persia conquered Babylonia, the Lord inspired the Persian king, Cyrus, to send a group of Jews to Jerusalem to rebuild the temple. As you read\nEzra 1\n, note what Cyrus did to support the Jews in this important work. How do you see the Lord working through men and women around you, including people who are not members of His Church? What does this suggest to you about the Lord and His work?\nSee also\nIsaiah 44:24–28\n.\nEzra 3:8–13\n;\n6:16–22\nThe house of the Lord is a place of joy.\nWhen the Babylonians invaded Jerusalem, they plundered the temple and burned it to the ground (see\n2 Kings 25:1–10\n;\n2 Chronicles 36:17–19\n). How do you think you might have felt if you had been one of the Jews who witnessed this? (see\nPsalm 137\n). Notice how the Jews felt, decades later, when they were allowed to return and rebuild the temple (see\nEzra 3:8–13\n;\n6:16–22\n). That might prompt you to ponder your own feelings about the Lord and His house. Why is the building of a temple a reason to celebrate?\nThe temple of Zerubbabel; illustration by Sam Lawlor\nEzra 4–7\n;\nNehemiah 2\n;\n4\n;\n6\nGod has an important work for me to do.\nThe Lord’s work rarely goes unopposed. This was true of the efforts led by Zerubbabel and Nehemiah. Here’s a simple approach that can help you learn from these stories and consider how you can do the Lord’s work despite opposition:\nGod’s work for Zerubbabel (\nEzra 4:3\n):\nCreate a Note\nGod’s work for Nehemiah (\nNehemiah 2:17–18\n):\nCreate a Note\nGod’s work for me:\nCreate a Note\nOpposition Zerubbabel faced (\nEzra 4:4–24\n):\nCreate a Note\nOpposition Nehemiah faced (\nNehemiah 2:19\n;\n4:1–3, 7–8\n;\n6:1–13\n):\nCreate a Note\nOpposition I face:\nCreate a Note\nHow Zerubbabel responded (\nEzra 5:1–2\n):\nCreate a Note\nHow Nehemiah responded (\nNehemiah 2:20\n;\n4:6, 9\n;\n6:3–15\n):\nCreate a Note\nHow I can respond:\nCreate a Note\nFor help comparing Nehemiah’s experience to your life, you might study President Dieter F. Uchtdorf’s message “\nWe Are Doing a Great Work and Cannot Come Down\n” (\nEnsign\nor\nLiahona\n, May 2009, 59–62), especially\nthe last two sections\n. As you think about the work God has given you, you might study the “\nYoung Women Theme\n” or the “\nAaronic Priesthood Quorum Theme\n” (Gospel Library). Or you could look in a hymn like “\nAs Sisters in Zion\n” (\nHymns\n, no. 309) or “\nYe Elders of Israel\n” (\nHymns\n, no. 319).\nWhat do you think it means to have “a mind to work” in the service of the Savior? (\nNehemiah 4:6\n). What might it mean to have “the good hand of … God upon [you]” as you do His work? (\nNehemiah 2:8\n; see also\nNehemiah 2:18\n;\nEzra 7:6, 9, 27–28\n). How have you seen His hand in your efforts to serve Him?\nNehemiah 8\nI am blessed when I study the scriptures.\nFor generations in captivity, the Jews had limited access to “the book of the law of Moses” (\nNehemiah 8:1\n). In\nNehemiah 8\n, Ezra read the law to the people. What do you find in this chapter that shows how Ezra and his people felt about God and His word? (see especially\nverses 1–12\n). What in your life shows how you feel about God and His word?\nSee also\nTeachings of Presidents of the Church: Ezra Taft Benson\n(2014),\n115–24\n.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nEzra 3:8–13\n;\n6:16–22\nThe house of the Lord is a place of joy.\nTo teach your children about the joy the Jews felt when their temple was rebuilt, you could show them a picture like the one below. Talk about why these people might be happy to be at the house of the Lord. You could also tell your children why the temple is a place of joy for you. How has the temple helped you feel closer to Heavenly Father and the Savior?\nAs you read\nEzra 3:10–13\nwith your children, help them find words that show how the Jews felt when the temple was being rebuilt. When you get to the end of\nverse 13\n, maybe you could shout for joy together. Help your children think of reasons to be joyful that the Lord has given us temples. How can we show that joy?\nConsider singing a song about the temple with your children, such as the second verse of “Welcome Home” (Gospel Library). After each line, you could pause to ask a child to share something he or she loves about the temple. You might also look at\npictures of temples\nwhile you sing.\nNehemiah 2:17–20\n;\n6:1–9\nThe Lord will help me do His “great work.”\nShare with your children the story of Nehemiah (see\nNehemiah 2:17–20\n;\n6:1–9\n; or “\nNehemiah\n” in\nOld Testament Stories\n, 173–74). As you read\nNehemiah 2:20\n, you and your children could “arise” and pretend to help build the walls of Jerusalem. Or your children might enjoy building a wall with blocks or other objects. As they do, you could help them think of important things Heavenly Father wants us to do.\n1:38\nNehemiah\nAs you read\nNehemiah 6:9\n, invite your children to raise their hands when they hear you say “strengthen my hands.” Tell the children about a time when you felt God strengthen your hands to do His work.\nNehemiah 8:1–12\nThe scriptures are a blessing.\nRead aloud some phrases from\nNehemiah 8:2–3, 5–6, 8–9, 12\nthat describe what the people did when they heard Ezra read the scriptures. As you read, your children could act out these phrases. Then you could share with each other how you feel when you read or hear the scriptures.\nAs you read together\nNehemiah 8:8\n, you could ask your children what helps them understand the scriptures. Show them how to use scripture study aids like the\nGuide to the Scriptures\nand\nTopics and Questions\n(Gospel Library). Invite your children to share something they have learned about the Savior from the scriptures.\nLook for eternal truth in the scriptures.\n“The scriptures … are filled with gospel truths, but sometimes it takes conscious effort to find them. As you are learning together from the scriptures, stop and ask those you teach what gospel truths they notice. Help them see how these truths relate to Heavenly Father’s plan of salvation. Sometimes eternal truths are stated in the scriptures, and sometimes they are illustrated in the stories and lives of the people we read about. It can also be helpful to explore together the historical background of the verses you are reading, as well as the meaning of the verses and how they apply to us today” (\nTeaching in the Savior’s Way\n,\n22\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 31: Lesson 90: Lesson 90—2 Chronicles 14–16This lesson can help students make a plan to seek the Lord.; Lesson 91: Lesson 91—2 Chronicles 17–20This lesson can help students learn to identify gospel principles from the scriptures....",
      "content": "\n--- Lesson 90 ---\nSome people might seek Heavenly Father and Jesus Christ only when things are going well. Others might cry out for Their help only in times of trouble. Like Asa, the king of Judah, we can seek the Lord during both peaceful and difficult times. This lesson can help students make a plan to seek the Lord. Student preparation: Invite students to make a list of ways they could seek the Lord in their lives. Possible Learning Activities Seeking to find Consider beginning the lesson by inviting students to think about how we look for things that are lost. You could list or display a few things that vary in value, such as a pencil, an important homework assignment, a cell phone, a gift from a loved one, and so on. Ask students what efforts they would put into finding each item if it were lost. Why do your efforts to find something differ depending on what you are looking for? Consider writing Seek the Lord at the top of the board. What do you think it means to seek the Lord? If students struggle to answer, you might ask how they get to know someone and develop a good relationship. Then ask how they might seek to know and develop a relationship with the Lord. You might explain that the Hebrew word for seek in the verses they will study today ( 2 Chronicles 14:4 ; 15:2, 12 ; 16:12 ) is darash and means to search for, ask, visit, pursue, consult, or apply oneself to. In your study journal, respond to the following questions: What are some things that you or others you know have done to seek the Lord? How much effort do you give to seek the Lord? As you study today, look for ways you can seek the Lord. Write any thoughts or feelings that come to you from the Holy Ghost. An example of seeking the Lord Consider sharing or summarizing the following paragraph. The books of Chronicles and Kings cover roughly the same time period. In 2 Chronicles 14–16 and 1 Kings 15 , we read an account of King Asa, the third king of Judah. You could create the following chart on the board to help students with the next activity. Students could also create the chart in their study journals. How Asa and his people sought the Lord How the Lord blessed them How Asa and his people sought the Lord How the Lord blessed them Consider separating students into four different groups. Ask each group to read a different set of the following verses. A student from each group could write what they learned on the board. If students need help understanding “groves” in 2 Chronicles 14:3 , explain that they were places where people worshipped false gods. Read one of the following sets of verses, looking for what Asa and his people did and how God blessed them: 2 Chronicles 14:3–7 . During a time of peace 2 Chronicles 14:9–13 . When the Ethiopians attacked 2 Chronicles 15:1–9 . During a time of peace 2 Chronicles 15:10–12, 15 . During a time of peace Ask the following question to help students identify a truth from what they have studied. As students share, add their responses to the chart on the board. What did you learn from the experiences of Asa and his people? Using the students’ words, help them identify truths such as the following: As I seek the Lord with all my heart, He will give me rest ( 2 Chronicles 14:7 ; 15:15 ) If I seek the Lord, I will find Him ( 2 Chronicles 15:2 ) As students share, consider asking follow-up questions to help them think about what some of the words or phrases might mean. For example, you might ask, “What do you think it means to find the Lord?” or “What might it look like for the Lord to give us rest?” For teachings that might help with these or other questions, see the Additional Resources section. Seeking and finding the Lord Help students make connections between Asa’s life and their own lives. You might relabel the existing chart on the board with How I can seek the Lord in the left column and How the Lord might bless me in the right column. Then invite students to do the following in groups or on their own. In addition to what Asa and his people did, add to the left-hand column of your list ways you can seek the Lord. These ways might come from your own experience, examples in scriptures or Church history, or talks from Church leaders. Students could add their examples to the left-hand column on the board. If you feel the following activities would help students identify meaningful ways to seek the Lord, you could do either or both: Direct students to the “Invitations” portion of each of the major sections in For the Strength of Youth: A Guide for Making Choices (2022). Major sections include “Jesus Christ will help you,” “Love God, love your neighbor,” and so on. Watch “ Make Time for the Lord ” from time code 1:00 to 3:29 (available at ChurchofJesusChrist.org ). As students listen to President Russell M. Nelson, invite them to identify ways that we can seek the Lord. 5:49 You might want to help students think about obstacles they might face while striving to do the actions they just shared. To do so, consider asking the following questions. What can distract us from seeking the Lord? What helps you seek the Lord despite distractions? Consider inviting them to mark the phrase “he will be found of you” in 2 Chronicles 15:2 . To help students think of ways we can find the Lord, ask the following. How has the Lord blessed you or someone you know as you have sought Him? After students share, encourage them to write their thoughts in the right hand column of the chart. You might want to testify that the blessings students shared could be evidence that they have found Him. Making a plan Help students act on something they have felt or learned during the lesson. To do so, encourage them to consider the impressions they might have received from the Spirit throughout class. Also, in lesson 87 , students revisited their scripture study goals as a way to come closer to the Lord. If useful, they could evaluate how their goals are going and decide if they would like to use their goals in this plan as well. Pick one thing you can do to seek the Lord. Answer the following questions in your study journal. Plan how you can include this action in your life. Why do you think this action might help you find the Lord more in your life? What challenges might you face as you strive to do this? What specific steps can you take to do it despite these challenges? Consider ending class with your own testimony of the blessings of seeking the Lord.\n\n\n--- Lesson 91 ---\nDo you ever wonder what you can do to draw closer to Jesus Christ? The Old Testament king Jehoshaphat was a great example of doing just that. His people had fallen away from God and engaged in idol worship. Jehoshaphat chose to follow Jehovah and helped his people do the same. This lesson can help students learn to identify gospel principles from the scriptures. Student preparation: Consider inviting students to reflect on what they are learning in their personal and family study of the scriptures. They could come to class ready to share a principle they found and how it helps them. Possible Learning Activities Anchors of safety Show the following picture of someone rock climbing. If you were to climb a cliff, what equipment would you need? Why is this equipment necessary? If we compare our lives to climbing a cliff, what has the Lord given you to help you safely succeed? Students might share a variety of answers. As they do, thank them for their responses, and ask why these things would help. The following answer is the focus of this lesson. Elder Richard G. Scott (1928–2015) of the Quorum of the Twelve Apostles taught: You and I can be assured of reaching worthy objectives in life by understanding and consistently following correct principles rooted in revealed truth. Principles are anchors of safety. They are like the steel anchors a mountaineer uses to conquer otherwise impossible cliffs. They will help you have confidence in new and unfamiliar circumstances. They will provide you protection in life’s storms of adversity. (“ The Power of Correct Principles ,” Ensign , May 1993, 32) One of the ways that Heavenly Father has lovingly provided us with true principles is through the scriptures. As we study the scriptures, we seek to identify these principles or statements of truth that can help us in our lives. It might be helpful to have students reflect on their current ability to identify principles in the scriptures. Here is one way to do this. Take a moment to ponder the following questions: How confident am I in my ability to identify principles? How well do I understand how principles can help me in my life? As you study this lesson on the life of Jehoshaphat, seek the help of the Holy Ghost to identify true principles that can help you. Principles from the life of Jehoshaphat Following the death of his father, Jehoshaphat became king of Judah. Israel and Judah had both fallen away from the Lord Jesus Christ. They worshipped false gods. Read 2 Chronicles 17:3–4 ; 19:4 , and see what you learn about Jehoshaphat. (Note: Baalim refers to false gods.) What impresses you about Jehoshaphat? When Jehoshaphat came into power, his people were in apostasy. Jehoshaphat made many efforts throughout his kingdom to help his people follow Jehovah (Jesus Christ). During this time, the enemies of Jehoshaphat came up to battle against his people. What happened in these circumstances illustrates a variety of principles. Consider explaining the following study skill to identify principles. One way to identify a principle is to look for how two things relate. For example: because of A, B happens. Or because a person does A, the Lord promises or gives B. Read through the following verses as a class to give students an opportunity to practice using the skill. Read 2 Chronicles 17:6 and 19:3 , looking for principles in the life of Jehoshaphat. (Note: high places and groves were places to worship false gods.) Some principles students might identify are: As we focus our lives on God, we can more easily remove evil from our lives (see 2 Chronicles 17:6 ). As we remove evil from our lives, we are more prepared to seek God (see 2 Chronicles 19:3 ). Why are these principles helpful? After identifying principles from the previous verses as a class, invite students to practice identifying principles in small groups or on their own. Have them use the following verses. Read 2 Chronicles 20:1–9, 14–17, 20–22 , looking for additional true principles. Some principles students might identify are: As we fast and pray for deliverance, the Lord will be with us in our challenges (see 2 Chronicles 20:1–4, 14–17 ). As we seek the Lord in His temple, He will hear and help us (see 2 Chronicles 20:9 ). As we believe in the Lord and his prophets, we will prosper (see 2 Chronicles 20:20 ). As we praise the Lord through music, He will bless us (see 2 Chronicles 20:21–22 ). If students struggle to identify principles, consider writing some or all of the principles above on the board. Invite students to identify which of the verses studied teach each principle. Understanding principles For the following activity, students can use any of the principles above, or they can use a principle that they learned recently in their personal or family study. Choose a principle you would like to learn more about. Prepare a two-minute talk on this truth that includes the following: A verse or verses you read in 2 Chronicles about this principle, and why you selected it Other scriptures or words of the prophets that help you understand this principle A time when the Savior or someone else in scriptures or Church history exemplified this principle Ways you feel this principle from the Lord can help us or keep us safe An experience when you or someone you know acted according to this principle, and any blessings from the Lord that came as a result Students could share their talks with a partner or small group. Or you might invite a few willing students who studied different principles to share their talks with the class. Between each student’s talk, you could invite the class to share any comments or questions they have about the principle the student shared. Make sure to provide enough time for students to prepare and share their two-minute talks. From what you learned today, why is it useful to strive to find the principles that the Lord has given us in scripture? How might you use what you learned today in your family and personal study? Encourage students to come to know the Savior better by making personal connections to their lives from the scriptures. The previous question is an example of encouraging students to connect what they are learning in seminary with their study at home. You might want to look for other ways to do this. You can also ask how what they are learning at home connects to what they are learning in seminary. (For additional training on this, see “ Develop and ask questions that help learners connect what they have learned in their personal and family scripture study to the classroom experience ” in Teacher Development Skills .)\n\n\n--- Lesson 92 ---\nOur level of preparation for important events in our lives can greatly affect the experience we have. Many Israelites were able to experience deep joy after years of physical and spiritual preparation to rebuild and worship in a temple of God. Our Heavenly Father and Savior have also blessed us with opportunities to experience joy by worshipping in the house of the Lord. Our efforts to prepare for that blessing can affect our experience. This lesson can help students feel a greater desire to prepare to worship the Lord in His holy temple. Student preparation: Invite students to make a list of both short- and long-term things they could do to prepare to worship the Lord in the temple. They could then consider how their preparation can affect their temple experience. Possible Learning Activities Looking forward to the temple You might begin class by inviting students to write on the board some future events they are excited to experience. Examples could include graduation, marriage, and careers. Students could then pick one event from the board and share with a partner one or two things someone could do to prepare for that event. Consider displaying the following image of the Salt Lake temple when it was nearly ready to be dedicated in the 1890s. Read the following statement from President Wilford Woodruff (1807–98), looking for something that he had been preparing for and looking forward to for many years. [At the dedication of the Salt Lake temple] President Wilford Woodruff then arose to address the Saints. “I have looked forward to this day for the last fifty years of my life,” he said. ( Saints: The Story of the Church of Jesus Christ in the Latter Days , vol. 2, No Unhallowed Hand, 1846–1893 [2020], 663–64) What do you know about temples that may have caused Wilford Woodruff to look forward to the completion of the Salt Lake temple? If students did not mention God as they answered the previous question, you could help them make that connection by asking a question like, “What connection do you see between attending the temple and our relationship with Heavenly Father and Jesus Christ?” Invite students to write their thoughts about the following questions in their study journal. You may want to explain that taking time to reflect on our current feelings and experiences can help prepare us to learn from the Holy Ghost. What are my feelings as I look ahead to attending the temple in the future? What am I doing to prepare myself to worship the Lord in His house? Joy in temple service Around 605 BC Babylonians conquered Jerusalem and began deporting captive Jews to Babylon. In 587 BC, they destroyed the temple, and the deportations escalated. About 50 years later, Persia conquered Babylon under the command of King Cyrus. If your students remember a temple being announced in their area, you might remind them of that experience as they read the following verses. Or you might ask students to try to imagine how they will feel if a temple were to be announced in their area. Read Ezra 1:1–3 , looking for what God inspired King Cyrus to do. What thoughts and feelings do you think the Jews might have had? Why? Eventually, around 50,000 Jews returned to Jerusalem to rebuild the temple under the direction of Zerubbabel (see Ezra 2:1–2, 64–65 ). As a fulfillment of prophecy (see Isaiah 44:28 ; Jeremiah 29:10 ), the temple was rebuilt 70 years after it had been destroyed. Read Ezra 6:15–16, 22 and mark how the Jews felt when the temple was finally dedicated after many years of hard work and spiritual preparation. As students continue to study the account of the people in Ezra, invite them to watch for evidence of this truth: As we prepare to worship the Lord in the temple, He will bless us with joy You may want to write this truth on the board. Help students understand what this truth could look like in a teenager’s life. One way to do this is to invite the class to briefly describe two teenagers: one who simply attends the temple and one who prepares to worship the Lord in the temple. Before asking the following question, you might invite students to ponder experiences they have had preparing for, or attending, the temple. How can worshipping the Lord in the temple bring us joy? To give students an example of how worshipping the Lord in the temple can bring joy, consider watching the experience of Elder Kevin R. Duncan of the Seventy in “Hearts, Love, and the Temple,” available at byui.edu/devotionals from time code 21:46 to 24:05. After the video, you could invite students to share how our relationship with Heavenly Father and Jesus Christ can be strengthened through temple worship. Preparing to attend the temple The following statement can help students transition from learning about the Jews building the temple in Jerusalem to their own preparation to worship in the temple. Students could write or link the statement in their scriptures next to Ezra 6:15–16 . President Russell M. Nelson taught: In some respects, it is easier to build a temple than it is to build a people prepared for a temple. (“ Closing Remarks ,” Ensign or Liahona , Nov. 2019, 122–23) Invite students to share reasons why it might be easier to build a temple than to be prepared to worship the Lord in the temple. We can learn about preparing to worship the Lord in the temple by studying the Jews’ experience rebuilding the temple in Jerusalem. The accompanying handout can help students find greater relevance in the book of Ezra to their lives by comparing the Jews’ efforts to build the temple to our preparations to worship the Lord in His temples. Students could complete the handout in small groups. To do this, each member of the group could complete one or two sections of the handout. They could then share what they learned with their group. Alternatively, you could cut the handout into sections and place them throughout the classroom. Groups of students could rotate through the classroom and complete each section of the handout, answering the questions in their study journals. Open PDF After students have completed the handout, ensure that they have time to discuss insights that stood out to them. Consider displaying the following questions. Make three columns on the board titled “1,” “2,” and “3.” Invite students to write their name in the column under the question number that they would be willing to answer. Invite volunteers from each column to share their answers with the class. How do you think preparing to attend the Lord’s house can help us experience joy as we attend the temple? How has the Lord blessed you with joy as you have attended the temple? What do you know about Heavenly Father and Jesus Christ that would motivate you to prepare to attend Their holy house? Consider sharing your witness of the joy we receive from the Lord when we prepare ourselves to worship Him in the temple.\n\n\n--- Lesson 93 ---\nGod inspired Nehemiah to protect his people by rebuilding the walls around Jerusalem. Nehemiah’s people had to overcome constant threats and distractions to accomplish this work. We too have been given important work from God, and we too may face difficulties in accomplishing it. This lesson is meant to encourage students to remain focused on the work Heavenly Father has given them to do. Student preparation: Invite students to come to class with a list of three things that they feel Heavenly Father would have them focus on: one thing for this week, one for the next few years, and one for later in life. You might suggest that students who already have their patriarchal blessing read it again before creating their list. Possible Learning Activities Distraction Consider beginning class by helping students recognize things that could draw their attention away from doing God’s work. To do this, you could show the video “ Doing What Matters Most ” (1:42), available at ChurchofJesusChrist.org . Or you could share the information in the following paragraph and display the statement below from President Dieter F. Uchtdorf, then of the First Presidency. 1:42 Years ago, as pilots prepared to land a plane, a tiny light in the cockpit failed to illuminate. The crew became so focused on the lightbulb that they failed to notice the plane was descending into a swamp. The plane crashed, killing over 100 people. President Dieter F. Uchtdorf, then of the First Presidency, taught an important lesson from this tragedy: The plane was in perfect mechanical condition. Everything was working properly—all except one thing: a single burned-out lightbulb. That tiny bulb—worth about 20 cents—started the chain of events that ultimately led to the tragic death of over 100 people. Of course, the malfunctioning lightbulb didn’t cause the accident; it happened because the crew placed its focus on something that seemed to matter at the moment while losing sight of what mattered most. The tendency to focus on the insignificant at the expense of the profound happens not only to pilots but to everyone. We are all at risk. (“ We Are Doing a Great Work and Cannot Come Down ,” Ensign or Liahona , May 2009, 59) Invite students to share how they think President Uchtdorf’s message can apply to us as disciples of Jesus Christ. Then you might display the following statement and ask students to silently read it. Encourage them to ask Heavenly Father to guide them through the Spirit to understand how this message applies to them personally. They could record their thoughts in their study journals. President Uchtdorf continued: Pause for a moment and check where your own heart and thoughts are. Are you focused on the things that matter most? How you spend your quiet time may provide a valuable clue. Where do your thoughts go when the pressure of deadlines is gone? Are your thoughts and heart focused on those short-lived fleeting things that matter only in the moment or on things that matter most? (“ We Are Doing a Great Work and Cannot Come Down ,” Ensign or Liahona , May 2009, 60) Nehemiah’s work Explain to students that an Israelite named Nehemiah was a servant of Artaxerxes, king of Persia. Many Israelites had returned to Jerusalem years earlier to rebuild the temple. Nehemiah learned that they were in danger of attack because the protective walls and gates around Jerusalem were broken down. Consider inviting students to complete the following activity in small groups. Encourage groups to not rush through the steps, but to take their time and learn from Nehemiah’s experience. To help groups stay on the same schedule, you may want to display only one step of the instructions at a time. Give groups enough time to complete that step before displaying the subsequent step. Read Nehemiah 1:1–4 ; 2:1–6, 11–12, 17–18 . Look for and discuss evidence that Nehemiah’s desires to rebuild the walls of Jerusalem were inspired of God. Write on a blank piece of paper three things God has asked Latter-day Saint teenagers to focus on through His prophets. One way to do this is to briefly review talks from the most recent general conference. Then, exchange papers with another group and discuss with your group what they wrote. ( Note : Keep the other group’s paper. In step four of this activity, you will add things to it.) Read Nehemiah 2:19 ; 4:1, 7–8 , looking for how the Jews’ enemies reacted to the work God gave them. Discuss ways that Satan uses similar tactics today to get us to lose focus on what God asks us to do. Next to each of the three things listed on the other group’s paper, write a distraction or difficulty that could make it hard for a teenager to stay focused on the work God has given them through His prophets. Read Nehemiah 4:9, 14–20 and discuss what you learn from Nehemiah’s people about overcoming distractions and difficulties in accomplishing the work Heavenly Father gives us. Return the paper to the original group. Read and discuss the distractions and difficulties the other group added to your paper. Discuss ideas of how someone could overcome them and stay focused on the work God has given teenagers through His prophets. Summarize in one sentence what you learned or felt about doing the work Heavenly Father has given us. Write this truth on the board. After the activity, encourage volunteers to share what they learned or felt with the class. You might invite students to point out a truth on the board that another group wrote and share what they learned from it. As students share truths, help them focus on Jesus Christ by asking questions such as, “What teachings or examples from the Savior’s life help us better understand this truth?” Examples of truths groups might have written are: Through prayer, we can receive protection and strength from God to accomplish His work. ( Nehemiah 1:4 ; 4:9 ) God will help His servants overcome opposition to doing His work . ( Nehemiah 4:20 ) How can what you learned in this activity help you remain focused on the work God has given you to do? The video “ The Soul’s Sincere Desire ” (3:28), available at ChurchofJesusChrist.org , could help students notice and discuss how even good things can become distractions from focusing on the more important work God has given us. 3:29 Personal application Explain to students that Nehemiah was individually targeted by his enemies. They tried many tactics to stop him from doing God’s work of rebuilding Jerusalem’s walls. One tactic was to try to lure him out of the city to where they could more easily harm him. Invite students to silently complete the following. You may want to give them plenty of time and encourage them to think about how they feel God would have them complete the statements. Read Nehemiah 6:1–4, 15–16 and ponder what you learn from Nehemiah’s response to his enemies’ attempts to pull him away from God’s work. (You may want to mark and ponder what verse 3 could mean in your life.) Complete the following statements based on your life. Record your thoughts in your study journal or in the margin of your scriptures next to verse 3 . I believe Heavenly Father would like me to focus on . Some potential distractions or difficulties I might face are . Some ways I can remain focused on Heavenly Father’s work are .",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 35264,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.387866"
}