{
  "week_number": 27,
  "date_range": "Kings 12–131 ",
  "title": "1 ;17–22",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: 1 ;17–22 ---\nThe house of Israel was in disarray. The kingdom had divided, with ten tribes forming the Northern Kingdom of Israel and two tribes forming the Southern Kingdom of Judah. But worse than their separation from each other was both kingdoms’ separation from their covenants. Wicked kings led the people away from the Lord, and many people wavered in their faith.\nIn this setting, the Lord called Elijah to be a prophet. His life shows that a person can have great faith in the Lord even in bad circumstances. Sometimes the Lord responds to such faith with impressive, public miracles, like fire falling from heaven. But He also works quiet, private miracles, like feeding a faithful widow and her son. And most often the Lord’s miracles are so individual that they are known only to one person—for example, when the Lord reveals Himself to you through “a still small voice” (\n1 Kings 19:12\n).\nFor more about Elijah, see “\nElijah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n1 Kings 12:1–20\nChristlike leaders serve the people they lead.\nHow would you describe the mistake King Rehoboam, the son of Solomon, made in\n1 Kings 12:1–14\n? What Christlike attributes could have helped Rehoboam save his kingdom? (see\nverse 7\n;\nMatthew 20:25–28\n;\nMosiah 2:10–21\n). How can you use these attributes as a leader—whether in a Church calling or as a leader of your own life?\n1 Kings 17:8–16\n;\n19:19–21\nAn invitation to sacrifice is an opportunity to exercise my faith in Jesus Christ.\nThe prophet Elijah asked a widow to give him food and water before feeding herself and her starving son. Why would he do that? Elijah’s request could be seen as a blessing for this small family. They needed the Lord’s blessings, and sacrifice brings blessings—including the blessing of stronger faith.\nAs you read\n1 Kings 17:8–16\n, imagine you were this widow. What impresses you about her? You could also make a list of choices that require faith in Jesus Christ (for examples, see\nFor the Strength of Youth: A Guide to Making Choices\n[2022]). What do you learn from this widow about exercising faith?\nHow are Elisha’s actions in\n1 Kings 19:19–21\nsimilar to the widow’s actions?\nThink about sacrifices you’ve made to follow the Savior. What does\n1 Kings 17:8–16\n;\n19:19–21\nteach you about these sacrifices? How does your knowledge of the Savior help you when He asks you to make sacrifices? How has He blessed you?\nSee also\nMatthew 4:18–22\n;\n6:25–33\n;\nLuke 4:24–26\n; “Elijah and the Widow of Zarephath” (video), Gospel Library; “\nWhen Faith Endures\n,”\nHymns\n, no. 128.\n10:13\nElijah and the Widow of Zarephath\n1 Kings 18\n“If the Lord be God, follow him.”\nThe Israelites might have felt they had good reasons to worship Baal, who was known as the god of storms and rain. After three years of drought, they desperately needed rain. And worshipping Baal was socially accepted and promoted by the king and queen. As you read\n1 Kings 18\n, think about why someone in our day might be indecisive about following the Lord. In this chapter, what do you think the Lord was trying to teach about Himself? What experiences have helped you commit to following the Savior?\nSee also D. Todd Christofferson, “\nChoice and Commitment\n” (worldwide devotional for young adults, Jan. 12, 2020), Gospel Library.\nIllustration of Elijah, by Wilson Ong\n1 Kings 19:1–18\nThe Lord often speaks in quiet, simple ways.\nSadly, the miracle on Mount Carmel didn’t make Elijah’s mission any easier. In fact, his life was in danger, and he had to hide in a cave in the wilderness. There, struggling with loneliness and discouragement, he had an experience with the Lord that was very different from the experience on Mount Carmel. What does Elijah’s experience in\n1 Kings 19:1–18\nteach you about how the Lord communicates with you in your times of need?\nPonder times when you feel the Lord has spoken to you. How would you describe the way He communicates with you? Why are the words “still” and “small” good ways to describe the voice of the Spirit? What other words do you find in\nHelaman 5:30\n;\nDoctrine and Covenants 6:22–23\n;\n11:12–14\n? What do you need to do to receive the Lord’s guidance more often?\nSee also\nPsalm 46:10\n.\nUse multiple senses to enhance learning.\nWe all learn about the world through our five senses. Using those senses can also enhance gospel learning. For example, think of images or sounds you could use to illustrate the words “still” and “small” as you learn or teach about the Lord’s voice in\n1 Kings 19\n.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n1 Kings 17\nThe Lord blesses me as I have faith in Him.\nTo help your children learn the stories of faith in\n1 Kings 17\n, you could show them pictures or objects to illustrate the stories, such as birds, bread, or a boy. As you tell your children these stories, invite them to find the picture or object that goes with each story. “\nElijah the Prophet\n” (in\nOld Testament Stories\n, 121–24) can help you tell these stories. What does each story teach us about showing faith in Jesus Christ?\n1:58\nElijah the Prophet\nHelp your children think of ways they can show their faith in Jesus Christ. Sing with them a song about faith, such as “I Have Faith in the Lord, Jesus Christ” (Gospel Library), and share with each other what you learn about faith from the song.\nIllustration of Elijah and the healing of the widow’s son, by Charles Edmund Brock\n1 Kings 17:8–16\nWhen the Lord asks me to sacrifice, I can obey in faith.\nPerhaps your children could draw a picture of what the Lord asked the widow to give Elijah (see\n1 Kings 17:12–13\n) and what the widow received in return (see\n1 Kings 17:15–16\n). (See also this week’s activity page.) They could also look for pictures of other people who gave up something they wanted for something better. Invite your children to find pictures in the\nGospel Art Book\nor\nCome, Follow Me\n. What does the Lord ask us to sacrifice? How does He bless us?\n1 Kings 18:17–39\nI can choose to follow Jesus Christ.\nAs you read\n1 Kings 18:17–39\ntogether, your children could pick a verse and draw a picture of what it describes. They could use their pictures to tell the story in their own words. (See also “\nElijah and the Priests of Baal\n,” in\nOld Testament Stories\n, 125–28.)\n2:17\nElijah and the Priests of Baal\nHelp your children think of situations when they might need to decide whether or not to follow Jesus Christ. Maybe they could draw pictures of themselves making the right choice. Share with each other why you choose to follow Jesus.\n1 Kings 19:9–12\nThe Lord speaks to me through the still, small voice of the Holy Ghost.\nAs you summarize\n1 Kings 19:9–12\n, invite your children to do actions to represent the strong wind, the earthquake, and the fire. Then invite them to sit still as you say together, in a quiet voice, “after the fire a still small voice” (\nverse 12\n). (See also “\nThe Lord Speaks to Elijah\n,” in\nOld Testament Stories\n, 129–31.) Tell your children about times when you have experienced the still, small voice of the Holy Ghost.\n1:48\nThe Lord Speaks to Elijah\nQuietly sing a song about the Spirit, such as “\nThe Still Small Voice\n” (\nChildren’s Songbook\n, 106–7). What can distract us from recognizing the Spirit? What can help us hear Him?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 27: Lesson 77: Lesson 77—2 Samuel 11–12This lesson can help students recognize that they cannot hide their sins from the Lord, but they can turn to Him to overcome temptation. ---\n\n--- Lesson 77 ---\nWith the Lord by his side, David defeated Goliath, conquered in battle, and became king of Israel. However, in his lustful pursuit of Bathsheba, David turned away from Heavenly Father and Jesus Christ and fell from his exaltation (see Doctrine and Covenants 132:39 ). This lesson can help students recognize that they cannot hide their sins from the Lord, but they can turn to Him to overcome temptation. Student preparation: Invite students to make a list of some of the lies Satan uses to tempt us to sin (for example, students could review 2 Nephi 28:6–9, 20–22 ). Then invite them to ponder how truths taught in the gospel of Jesus Christ help us turn to the Lord when we face temptation. Possible Learning Activities Decisions that turn us toward or away from the Lord Display a picture of the Savior with arrows going toward and away from the image. Invite students to answer the following questions. Students could write their answers under the appropriate arrows on the board. What are some things the Lord invites us to do to turn to Him? What lies might Satan use to convince us to turn away from the Lord? Students might share a variety of phrases such as these: “It’s not a big deal”; “You can repent later”; and “I’m not hurting anyone.” If students do not mention it, write No one will know on the board. The following paragraph is an invitation for students to involve the Spirit as they consider thoughts they have when they make mistakes. Take a moment to invite the Holy Ghost to help you recognize thoughts or actions in your life that turn you toward or away from Heavenly Father and Jesus Christ. As you study, look for impressions of the Spirit that can help you choose to turn to Them. David’s decisions to turn from the Lord Invite students to recall the stories they have studied that showed that the Lord was guiding and directing David. You could share that the story they will study today demonstrates what happened when David made a series of decisions that turned him away from Heavenly Father and Jesus Christ. As a student reads each verse of the following passage, others in the class could hold up the word Stop or gesture when they see David making a decision that turned him away from the Lord. Each time they stop, students could discuss the question below. Carefully read 2 Samuel 11:1–5 , looking for the decisions David made that led him in the wrong direction. What decisions did you discover? Invite students to create a list on the board of the decisions David made in these verses and to mark them in their scriptures. The left column of the chart in this lesson includes examples of what students might find. We all face temptations that we need to resist. Knowing this, the Lord gave a powerful reassurance in 1 Corinthians 10:13 . Read this verse looking for the help the Lord has promised us. What did you discover? The following activity is one way to help students see that even with temptations like those David faced, the Lord has provided teachings that can help us avoid temptation and escape sin. You could display the following instructions for students to follow in small groups or individually. Depending on the abilities of your students, you may want to display the scriptures in the second column and adjust the second step to have students read the scripture or scriptures instead of finding them. Complete the following instructions: Select one or more of the decisions David made that led him away from the Lord. Find a scripture that includes or illustrates one of the Savior’s teachings that can help us avoid temptation and escape a similar choice. Prepare to share what you found. David’s decision Teachings of the Savior and His prophets David’s decision 2 Samuel 11:1 —David remained in Jerusalem when kings went to the battlefield with their army. Teachings of the Savior and His prophets Alma 7:22 ; Doctrine and Covenants 42:42 David’s decision 2 Samuel 11:2 —David saw Bathsheba washing herself and continued to look upon her. Teachings of the Savior and His prophets Mosiah 4:30 ; 3 Nephi 12:28–29 David’s decision 2 Samuel 11:3 —David pursued her. Teachings of the Savior and His prophets Doctrine and Covenants 63:16 David’s decision 2 Samuel 11:4 —Knowing Bathsheba was married, David had her brought to his palace. Teachings of the Savior and His prophets Genesis 39:9 David’s decision 2 Samuel 11:4 —David broke the law of chastity. Teachings of the Savior and His prophets Doctrine and Covenants 42:23–25 What stood out to you? What did you learn about the Lord from this study activity? To summarize 2 Samuel 11:6–13 , you could explain that when he found out Bathsheba was pregnant, David summoned her husband, Uriah, home from battle. David commanded Uriah to spend the night with Bathsheba so it would appear that Uriah was responsible for her pregnancy. Read 2 Samuel 11:14–17, 26–27 , looking for what David did when his plan to hide his adultery was unsuccessful. What thoughts or feelings did you have as you read these verses? Refer to the list of David’s decisions on the board and add David tried to hide his sins . Explain to students that after the death of Uriah, the Lord sent His prophet Nathan to King David. As they read the following parable, students could illustrate the story on the board or in their study journals. Read 2 Samuel 12:1–10 , looking for what Nathan said to David. What stands out to you from this parable? What truths might someone learn from David’s story? In addition to other truths students might identify, emphasize that we cannot hide our sins from God. You might invite students to cross–reference or link 2 Samuel 12:7–9 with 2 Nephi 9:20 and Alma 39:8 . How is it a blessing that we cannot hide our sins from our loving Heavenly Father? How might understanding this truth help us turn to Heavenly Father and Jesus Christ and repent? If needed, you could refer to Doctrine and Covenants 132:39 , sharing that having Uriah killed was David’s final attempt to hide his sins. With this decision, David lost his exaltation. Reassure students that the Lord still loved David, but there were blessings David could not receive as a consequence of his decisions. We can turn back to the Lord Invite students to quietly ponder what they learned and felt from David’s story. Help students understand that because Heavenly Father and Jesus Christ know us perfectly, They understand our circumstances, why we made the choices we did, and how to help us turn back to Them. Some students may feel discouraged by the mistakes they have made. To help them focus on the Lord’s desire to forgive, you could show the video “ The Savior Wants to Forgive ” (5:50) or “ I Stand All Amazed ” (5:15). Both are available from ChurchofJesusChrist.org. 5:50 5:16 Share what you have learned To help students share their understanding of the truths taught, consider using the image from the beginning of class. You could invite students to draw something similar in their study journals. Then display the following instructions for students to complete. In your study journal, select one of the decisions David made or a temptation a teenager might face today. Imagine you were giving counsel to someone thinking about making that decision. Choose at least two options from the following list to share what you have learned. A summary of what you have learned today about not hiding sins and instead, turning to the Heavenly Father and Jesus Christ. A scripture passage that illustrates what the Savior and His prophets have taught about overcoming the temptation you selected. An experience you or someone you know has had that has helped you turn to Heavenly Father and Jesus Christ when you face temptation. A brief testimony of the Savior’s power to help us overcome temptation and repent when we sin. Consider concluding class with your witness that Heavenly Father and Jesus Christ know and love the students perfectly. You could reassure students that no matter what struggles we face, Heavenly Father and Jesus Christ love us and are eager to help us repent.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "1 ;17–22",
      "content": "The house of Israel was in disarray. The kingdom had divided, with ten tribes forming the Northern Kingdom of Israel and two tribes forming the Southern Kingdom of Judah. But worse than their separation from each other was both kingdoms’ separation from their covenants. Wicked kings led the people away from the Lord, and many people wavered in their faith.\nIn this setting, the Lord called Elijah to be a prophet. His life shows that a person can have great faith in the Lord even in bad circumstances. Sometimes the Lord responds to such faith with impressive, public miracles, like fire falling from heaven. But He also works quiet, private miracles, like feeding a faithful widow and her son. And most often the Lord’s miracles are so individual that they are known only to one person—for example, when the Lord reveals Himself to you through “a still small voice” (\n1 Kings 19:12\n).\nFor more about Elijah, see “\nElijah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n1 Kings 12:1–20\nChristlike leaders serve the people they lead.\nHow would you describe the mistake King Rehoboam, the son of Solomon, made in\n1 Kings 12:1–14\n? What Christlike attributes could have helped Rehoboam save his kingdom? (see\nverse 7\n;\nMatthew 20:25–28\n;\nMosiah 2:10–21\n). How can you use these attributes as a leader—whether in a Church calling or as a leader of your own life?\n1 Kings 17:8–16\n;\n19:19–21\nAn invitation to sacrifice is an opportunity to exercise my faith in Jesus Christ.\nThe prophet Elijah asked a widow to give him food and water before feeding herself and her starving son. Why would he do that? Elijah’s request could be seen as a blessing for this small family. They needed the Lord’s blessings, and sacrifice brings blessings—including the blessing of stronger faith.\nAs you read\n1 Kings 17:8–16\n, imagine you were this widow. What impresses you about her? You could also make a list of choices that require faith in Jesus Christ (for examples, see\nFor the Strength of Youth: A Guide to Making Choices\n[2022]). What do you learn from this widow about exercising faith?\nHow are Elisha’s actions in\n1 Kings 19:19–21\nsimilar to the widow’s actions?\nThink about sacrifices you’ve made to follow the Savior. What does\n1 Kings 17:8–16\n;\n19:19–21\nteach you about these sacrifices? How does your knowledge of the Savior help you when He asks you to make sacrifices? How has He blessed you?\nSee also\nMatthew 4:18–22\n;\n6:25–33\n;\nLuke 4:24–26\n; “Elijah and the Widow of Zarephath” (video), Gospel Library; “\nWhen Faith Endures\n,”\nHymns\n, no. 128.\n10:13\nElijah and the Widow of Zarephath\n1 Kings 18\n“If the Lord be God, follow him.”\nThe Israelites might have felt they had good reasons to worship Baal, who was known as the god of storms and rain. After three years of drought, they desperately needed rain. And worshipping Baal was socially accepted and promoted by the king and queen. As you read\n1 Kings 18\n, think about why someone in our day might be indecisive about following the Lord. In this chapter, what do you think the Lord was trying to teach about Himself? What experiences have helped you commit to following the Savior?\nSee also D. Todd Christofferson, “\nChoice and Commitment\n” (worldwide devotional for young adults, Jan. 12, 2020), Gospel Library.\nIllustration of Elijah, by Wilson Ong\n1 Kings 19:1–18\nThe Lord often speaks in quiet, simple ways.\nSadly, the miracle on Mount Carmel didn’t make Elijah’s mission any easier. In fact, his life was in danger, and he had to hide in a cave in the wilderness. There, struggling with loneliness and discouragement, he had an experience with the Lord that was very different from the experience on Mount Carmel. What does Elijah’s experience in\n1 Kings 19:1–18\nteach you about how the Lord communicates with you in your times of need?\nPonder times when you feel the Lord has spoken to you. How would you describe the way He communicates with you? Why are the words “still” and “small” good ways to describe the voice of the Spirit? What other words do you find in\nHelaman 5:30\n;\nDoctrine and Covenants 6:22–23\n;\n11:12–14\n? What do you need to do to receive the Lord’s guidance more often?\nSee also\nPsalm 46:10\n.\nUse multiple senses to enhance learning.\nWe all learn about the world through our five senses. Using those senses can also enhance gospel learning. For example, think of images or sounds you could use to illustrate the words “still” and “small” as you learn or teach about the Lord’s voice in\n1 Kings 19\n.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n1 Kings 17\nThe Lord blesses me as I have faith in Him.\nTo help your children learn the stories of faith in\n1 Kings 17\n, you could show them pictures or objects to illustrate the stories, such as birds, bread, or a boy. As you tell your children these stories, invite them to find the picture or object that goes with each story. “\nElijah the Prophet\n” (in\nOld Testament Stories\n, 121–24) can help you tell these stories. What does each story teach us about showing faith in Jesus Christ?\n1:58\nElijah the Prophet\nHelp your children think of ways they can show their faith in Jesus Christ. Sing with them a song about faith, such as “I Have Faith in the Lord, Jesus Christ” (Gospel Library), and share with each other what you learn about faith from the song.\nIllustration of Elijah and the healing of the widow’s son, by Charles Edmund Brock\n1 Kings 17:8–16\nWhen the Lord asks me to sacrifice, I can obey in faith.\nPerhaps your children could draw a picture of what the Lord asked the widow to give Elijah (see\n1 Kings 17:12–13\n) and what the widow received in return (see\n1 Kings 17:15–16\n). (See also this week’s activity page.) They could also look for pictures of other people who gave up something they wanted for something better. Invite your children to find pictures in the\nGospel Art Book\nor\nCome, Follow Me\n. What does the Lord ask us to sacrifice? How does He bless us?\n1 Kings 18:17–39\nI can choose to follow Jesus Christ.\nAs you read\n1 Kings 18:17–39\ntogether, your children could pick a verse and draw a picture of what it describes. They could use their pictures to tell the story in their own words. (See also “\nElijah and the Priests of Baal\n,” in\nOld Testament Stories\n, 125–28.)\n2:17\nElijah and the Priests of Baal\nHelp your children think of situations when they might need to decide whether or not to follow Jesus Christ. Maybe they could draw pictures of themselves making the right choice. Share with each other why you choose to follow Jesus.\n1 Kings 19:9–12\nThe Lord speaks to me through the still, small voice of the Holy Ghost.\nAs you summarize\n1 Kings 19:9–12\n, invite your children to do actions to represent the strong wind, the earthquake, and the fire. Then invite them to sit still as you say together, in a quiet voice, “after the fire a still small voice” (\nverse 12\n). (See also “\nThe Lord Speaks to Elijah\n,” in\nOld Testament Stories\n, 129–31.) Tell your children about times when you have experienced the still, small voice of the Holy Ghost.\n1:48\nThe Lord Speaks to Elijah\nQuietly sing a song about the Spirit, such as “\nThe Still Small Voice\n” (\nChildren’s Songbook\n, 106–7). What can distract us from recognizing the Spirit? What can help us hear Him?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 27: Lesson 77: Lesson 77—2 Samuel 11–12This lesson can help students recognize that they cannot hide their sins from the Lord, but they can turn to Him to overcome temptation.",
      "content": "\n--- Lesson 77 ---\nWith the Lord by his side, David defeated Goliath, conquered in battle, and became king of Israel. However, in his lustful pursuit of Bathsheba, David turned away from Heavenly Father and Jesus Christ and fell from his exaltation (see Doctrine and Covenants 132:39 ). This lesson can help students recognize that they cannot hide their sins from the Lord, but they can turn to Him to overcome temptation. Student preparation: Invite students to make a list of some of the lies Satan uses to tempt us to sin (for example, students could review 2 Nephi 28:6–9, 20–22 ). Then invite them to ponder how truths taught in the gospel of Jesus Christ help us turn to the Lord when we face temptation. Possible Learning Activities Decisions that turn us toward or away from the Lord Display a picture of the Savior with arrows going toward and away from the image. Invite students to answer the following questions. Students could write their answers under the appropriate arrows on the board. What are some things the Lord invites us to do to turn to Him? What lies might Satan use to convince us to turn away from the Lord? Students might share a variety of phrases such as these: “It’s not a big deal”; “You can repent later”; and “I’m not hurting anyone.” If students do not mention it, write No one will know on the board. The following paragraph is an invitation for students to involve the Spirit as they consider thoughts they have when they make mistakes. Take a moment to invite the Holy Ghost to help you recognize thoughts or actions in your life that turn you toward or away from Heavenly Father and Jesus Christ. As you study, look for impressions of the Spirit that can help you choose to turn to Them. David’s decisions to turn from the Lord Invite students to recall the stories they have studied that showed that the Lord was guiding and directing David. You could share that the story they will study today demonstrates what happened when David made a series of decisions that turned him away from Heavenly Father and Jesus Christ. As a student reads each verse of the following passage, others in the class could hold up the word Stop or gesture when they see David making a decision that turned him away from the Lord. Each time they stop, students could discuss the question below. Carefully read 2 Samuel 11:1–5 , looking for the decisions David made that led him in the wrong direction. What decisions did you discover? Invite students to create a list on the board of the decisions David made in these verses and to mark them in their scriptures. The left column of the chart in this lesson includes examples of what students might find. We all face temptations that we need to resist. Knowing this, the Lord gave a powerful reassurance in 1 Corinthians 10:13 . Read this verse looking for the help the Lord has promised us. What did you discover? The following activity is one way to help students see that even with temptations like those David faced, the Lord has provided teachings that can help us avoid temptation and escape sin. You could display the following instructions for students to follow in small groups or individually. Depending on the abilities of your students, you may want to display the scriptures in the second column and adjust the second step to have students read the scripture or scriptures instead of finding them. Complete the following instructions: Select one or more of the decisions David made that led him away from the Lord. Find a scripture that includes or illustrates one of the Savior’s teachings that can help us avoid temptation and escape a similar choice. Prepare to share what you found. David’s decision Teachings of the Savior and His prophets David’s decision 2 Samuel 11:1 —David remained in Jerusalem when kings went to the battlefield with their army. Teachings of the Savior and His prophets Alma 7:22 ; Doctrine and Covenants 42:42 David’s decision 2 Samuel 11:2 —David saw Bathsheba washing herself and continued to look upon her. Teachings of the Savior and His prophets Mosiah 4:30 ; 3 Nephi 12:28–29 David’s decision 2 Samuel 11:3 —David pursued her. Teachings of the Savior and His prophets Doctrine and Covenants 63:16 David’s decision 2 Samuel 11:4 —Knowing Bathsheba was married, David had her brought to his palace. Teachings of the Savior and His prophets Genesis 39:9 David’s decision 2 Samuel 11:4 —David broke the law of chastity. Teachings of the Savior and His prophets Doctrine and Covenants 42:23–25 What stood out to you? What did you learn about the Lord from this study activity? To summarize 2 Samuel 11:6–13 , you could explain that when he found out Bathsheba was pregnant, David summoned her husband, Uriah, home from battle. David commanded Uriah to spend the night with Bathsheba so it would appear that Uriah was responsible for her pregnancy. Read 2 Samuel 11:14–17, 26–27 , looking for what David did when his plan to hide his adultery was unsuccessful. What thoughts or feelings did you have as you read these verses? Refer to the list of David’s decisions on the board and add David tried to hide his sins . Explain to students that after the death of Uriah, the Lord sent His prophet Nathan to King David. As they read the following parable, students could illustrate the story on the board or in their study journals. Read 2 Samuel 12:1–10 , looking for what Nathan said to David. What stands out to you from this parable? What truths might someone learn from David’s story? In addition to other truths students might identify, emphasize that we cannot hide our sins from God. You might invite students to cross–reference or link 2 Samuel 12:7–9 with 2 Nephi 9:20 and Alma 39:8 . How is it a blessing that we cannot hide our sins from our loving Heavenly Father? How might understanding this truth help us turn to Heavenly Father and Jesus Christ and repent? If needed, you could refer to Doctrine and Covenants 132:39 , sharing that having Uriah killed was David’s final attempt to hide his sins. With this decision, David lost his exaltation. Reassure students that the Lord still loved David, but there were blessings David could not receive as a consequence of his decisions. We can turn back to the Lord Invite students to quietly ponder what they learned and felt from David’s story. Help students understand that because Heavenly Father and Jesus Christ know us perfectly, They understand our circumstances, why we made the choices we did, and how to help us turn back to Them. Some students may feel discouraged by the mistakes they have made. To help them focus on the Lord’s desire to forgive, you could show the video “ The Savior Wants to Forgive ” (5:50) or “ I Stand All Amazed ” (5:15). Both are available from ChurchofJesusChrist.org. 5:50 5:16 Share what you have learned To help students share their understanding of the truths taught, consider using the image from the beginning of class. You could invite students to draw something similar in their study journals. Then display the following instructions for students to complete. In your study journal, select one of the decisions David made or a temptation a teenager might face today. Imagine you were giving counsel to someone thinking about making that decision. Choose at least two options from the following list to share what you have learned. A summary of what you have learned today about not hiding sins and instead, turning to the Heavenly Father and Jesus Christ. A scripture passage that illustrates what the Savior and His prophets have taught about overcoming the temptation you selected. An experience you or someone you know has had that has helped you turn to Heavenly Father and Jesus Christ when you face temptation. A brief testimony of the Savior’s power to help us overcome temptation and repent when we sin. Consider concluding class with your witness that Heavenly Father and Jesus Christ know and love the students perfectly. You could reassure students that no matter what struggles we face, Heavenly Father and Jesus Christ love us and are eager to help us repent.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 15696,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.386237"
}