{
  "week_number": 43,
  "date_range": "Jeremiah 1–3",
  "title": ";7;16–18;20",
  "primary_scriptures": [
    {
      "book": "Jeremiah",
      "chapters": [
        "1",
        "2",
        "3"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Jeremiah",
      "chapters": [
        "1",
        "2",
        "3"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;7;16–18;20 ---\nAt first, Jeremiah didn’t think he would make a good prophet. “Behold, I cannot speak,” he protested (\nJeremiah 1:6\n). But the Lord reassured him, “I have put my words in thy mouth” (\nverse 9\n). Jeremiah felt that he was an inexperienced “child” (\nverse 6\n), but the Lord explained that he was actually more prepared than he realized—he had been ordained to this calling even before he was born (see\nverse 5\n). So Jeremiah set aside his fears and accepted the call. He warned Jerusalem’s kings and priests that their pretended holiness would not save them. The “child” who thought he could not speak came to feel God’s word “in [his] heart as a burning fire” and could not be silent (\nJeremiah 20:9\n).\nJeremiah’s story is also your story. God knew you, too, before you were born and prepared you for your mission in life. Among other things, that mission includes something Jeremiah foresaw: gathering God’s people, one by one, to “bring [them] to Zion” (\nJeremiah 3:14\n). And even if you don’t know exactly what to do or say, you can “be not afraid … ; for I am with thee, saith the Lord” (\nJeremiah 1:8, 19\n).\nFor an overview of the book of Jeremiah, see “\nJeremiah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nJeremiah 1:4–19\n;\n7:1–7\n;\n20:8–9\nProphets are called to speak God’s word.\nImagine you’re talking to a friend who has never heard of prophets, and you decide to explain the concept using Jeremiah’s call to be a prophet in\nJeremiah 1:4–19\n. What do you find in these verses that teaches something about prophets of God? You could also look in\nJeremiah 7:1–7\n;\n20:8–9\nand a hymn like “\nWe Listen to a Prophet’s Voice\n” (\nHymns\n, no. 22).\nYou might also want to teach your friend about today’s living prophet. Is there anything in these verses that might help? For example, what do prophets in our day “root out” or “pull down”? What do they “build” and “plant”? (\nJeremiah 1:10\n). How have you come to know that our living prophet is called of God?\nSee also\nArticles of Faith 1:6, 9\n; “Why Do We Have Prophets?” (video),\nChurchofJesusChrist.org\n.\n1:37\nWhy Do We Have Prophets?\nJeremiah 1:5\nGod knew me before I was born.\nWhat did Jeremiah learn about himself in\nJeremiah 1:5\n? As a newly called prophet, why would that information be important for him to know?\nMuch of what Jeremiah learned about himself in\nJeremiah 1:5\nis also true about you. God also knew you before you were born and prepared you for specific responsibilities. To learn more about your life before you were born, read\nAlma 13:1–4\n;\nDoctrine and Covenants 138:53–56\n; and\nAbraham 3:22–23\n. You might make a list of truths you discover. Why is this information important for you to know?\nTo learn about how these truths affected the life of Elder Ahmad S. Corbitt, study his message “\nYou Can Gather Israel!\n” (\nLiahona\n, May 2021, 61–63). How does knowing about your premortal life affect the way you live your mortal life?\nHere is what President Russell M. Nelson said about your premortal life:\n“Your Heavenly Father has known you for a very long time. You, as His son or daughter, were chosen by Him to come to earth at this precise time, to be a leader in His great work on earth. You were chosen\nnot\nfor your bodily characteristics but for your\nspiritual\nattributes, such as bravery, courage, integrity of heart, a thirst for truth, a hunger for wisdom, and a desire to serve others.\n“You developed some of these attributes premortally. Others you can develop here on earth as you persistently seek them” (“\nDecisions for Eternity\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 107).\nThink of some situations you might face in which it would be important to remember these truths about your premortal life. What can you do to remind yourself of these truths?\nSee also Russell M. Nelson, “\nDecisions for Eternity\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 106–9; Topics and Questions, “\nForeordination\n,” “\nPremortal Life\n,” Gospel Library.\nIn\nJeremiah 2:13\n, the Lord compared the people’s spiritual state to “broken cisterns” and compared Himself to the “fountain of living waters.”\nJeremiah 2\n;\n7\n“They have forsaken me the fountain of living waters.”\nIn the dry region where the Israelites lived, people stored precious water in underground reservoirs called cisterns. What do you think the “broken cisterns” mentioned in\nJeremiah 2:13\nmight symbolize? Why would receiving water from a fountain be better than relying on a cistern? What does it mean to forsake “the fountain of living waters”? As you read\nJeremiah 2\nand\n7\n, notice how the people were forsaking the Lord’s living waters (see, for example,\nJeremiah 2:26–28\n;\n7:2–11\n). Why is “living water” a good symbol for what the Savior gives you? Think about how you are receiving living water.\nJeremiah 7\nis addressed to people who were entering “the Lord’s house … to worship the Lord,” but their actions didn’t match their outward devotion (see\nverses 2–11\n). What messages do you feel the Lord might have for you in\nverses 21–23\n?\nUse object lessons.\nThe Lord’s prophets often compare spiritual truths to familiar objects. Consider doing the same as you learn and teach the gospel. For example, to visualize\nJeremiah 2:13\n, you could put water in a cracked or broken container or drink from a drinking fountain. How is Jesus like a “fountain of living waters”? (\nJeremiah 2:13\n). How do we drink from His living water?\nJeremiah 3:14–18\n;\n16:14–21\nThe Lord will gather His people.\nIn\nJeremiah 16:14–15\n, Jeremiah compared the gathering of Israel in the latter days with the Exodus of Israel from Egypt. In your opinion, why would the gathering be even more important to God’s people than the Exodus?\nWhat do\nJeremiah 3:14–18\n;\n16:14–21\nsuggest about how the gathering happens?\nIn his message “\nHope of Israel\n,” President Russell M. Nelson, like Jeremiah, taught that the gathering of Israel “is the most important thing taking place on earth today” (worldwide youth devotional, June 3, 2018, Gospel Library). Read or listen to his message, and see if you can discover (a) how President Nelson defines the gathering of Israel, (b) how he describes its importance, and (c) how you can be part of the gathering.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nJeremiah 1:5\nHeavenly Father knew me before I was born.\nTo introduce the important truth taught in\nJeremiah 1:5\n, you could show your children a picture of a baby (or, if possible, you could look at pictures of your children when they were babies). Ask your children if they know where they lived before they were born. You could also sing together a song that teaches about our premortal life, such as “\nI Lived in Heaven\n” (\nChildren’s Songbook\n, 4).\nIf your children would like to learn more, you could help them find “\nPremortal Life\n” in the Guide to the Scriptures. They could look for answers to “who,” “when,” and “what” questions about the premortal life.\nJeremiah 1:4–19\nProphets are called to speak the words of the Lord.\nConsider showing pictures of the living prophet or prophets from the scriptures (you can find some in\nChurch magazines\n, the\nGospel Art Book\n, and\nCome, Follow Me\n). Ask your children what they know about these prophets.\nTo teach about what prophets do, you might select some helpful verses from\nJeremiah 1\n, such as\nverses 5, 7, 10\n, and\n19\n. Your children could each pick one of the verses, read it, and share something they learn about prophets.\nJeremiah 16:14–16\nI can help Heavenly Father’s children come back to Him.\nWhile you read\nJeremiah 16:16\n, your children could pretend to “fish” or “hunt” for objects around the room. President Russell M. Nelson has compared the fishers and hunters in this verse to missionaries (see “\nThe Gathering of Scattered Israel\n,”\nEnsign\nor\nLiahona\n, Nov. 2006, 81). What do missionaries do? How can we help “fish” and “hunt” for scattered Israel? (see “A Message for Children from President Russell M. Nelson” [video],\nChurchofJesusChrist.org\n).\n3:30\nVideo: A Message for Children from President Russell M. Nelson\nJeremiah 18:1–6\nI can let the Lord guide my life, like a potter shapes clay.\nTo explore these verses, you might discuss or show how pottery is made (see the picture at the end of this outline). What message does the Lord have for us in\nJeremiah 18:1–6\n? What does it mean to be clay in the Lord’s hands? (see also\nIsaiah 64:8\n). For another story that compares us to potter’s clay, see Elder Richard J. Maynes’s message “\nThe Joy of Living a Christ-Centered Life\n” (\nEnsign\nor\nLiahona\n, Nov. 2015, 27–30).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 43: Lesson 130: Lesson 130—Jeremiah 1This lesson can help students feel a desire to fulfill their divine purpose.; Lesson 131: Lesson 131—Jeremiah 2–3This lesson can help students increase their desire to turn to the Savior for mercy and healing.... ---\n\n--- Lesson 130 ---\nHave you ever wondered what happened in the premortal life that prepared you for your responsibilities in mortality? In the premortal life, Heavenly Father gave divine responsibilities to His children to perform in mortality. Examples of this include Jesus Christ (see 1 Peter 1:19–20 ) and Jeremiah (see Jeremiah 1:5 ). This lesson can help students feel a desire to fulfill their divine purpose. Student preparation: Invite students to imagine holding a newborn infant and to think about these two questions: Possible Learning Activities Prepare to learn To help students prepare to learn that Heavenly Father knows them and that He has a divine purpose for them, invite them to imagine the following situation. (You could adjust the situation to better fit your students. For example, it could be a teacher who challenges them to get a certain grade in a difficult class.) Imagine that a coach challenges you to work toward a difficult goal, such as running a mile under a certain time by a specific date. How would the following situations affect your desire to accomplish it and your confidence that you could achieve it? The coach, who knows you well, has worked with you for years and tailored the challenge specifically for you. A new coach who doesn’t know you has given the same challenge to the entire team. Display the following self-assessment to help students reflect on how perfectly Heavenly Father and Jesus Christ know them and their divine purpose. ( Note : Students will be invited to refer back to this self-assessment in Lesson 148: “ Assess Your Learning 9 .”) How would you evaluate yourself (1 – true of me; 10 – not true of me) on the following statements? Record in your study journal why you rated each statement how you did. I believe Heavenly Father and Jesus Christ know me better than anyone else knows me. I believe They have given me a divine purpose I can accomplish with Their help. I want to know and fulfill the divine mission Heavenly Father and Jesus Christ have given me. Invite students to pay attention to thoughts and feelings from the Holy Ghost as they learn more about their divine purpose. “Before thou camest forth out of the womb … I ordained thee” To help students relate to Jeremiah, you could ask them how they might feel if the Lord asked them to do something difficult, such as speaking in church, teaching a lesson, serving a mission, and so on. Jeremiah may have felt similarly when the Lord called him to serve as a prophet to the kingdom of Judah. Students may be interested to know that Jeremiah prophesied in Jerusalem around the same time as Lehi (see 1 Nephi 7:14 ). Jeremiah 1:4–5 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Jeremiah 1:4–5 and the following statement from President Russell M. Nelson. Then, summarize what you learn about our relationship with the Lord. 14:25 Your spirit is an eternal entity. The Lord said to His prophet Abraham: “Thou wast chosen before thou wast born” ( Abraham 3:23 ). The Lord said something similar about Jeremiah and many others. He even said it about you. Your Heavenly Father has known you for a very long time. You, as His son or daughter, were chosen by Him to come to earth at this precise time, to be a leader in His great work on earth. You were chosen not for your bodily characteristics but for your spiritual attributes. … (“ Decisions for Eternity ,” Ensign or Liahona , Nov. 2013, 107) What truths can we learn from Jeremiah 1:4–5 and President Nelson’s statement? As students share, help them identify that before we were born, the Lord knew us and gave us specific responsibilities to perform in mortality. Consider inviting students to ask any questions they may have about this truth. If they ask questions that the Lord has not yet clearly answered, thank them for their thoughtful questions, but be careful not to speculate about answers. Statements in Additional Resources may help to answer student questions. For examples of others who were called to perform specific responsibilities in mortality, students could read one or more of the following: Luke 1:13–17 , 1 Nephi 11:14–20 , Mosiah 3:5–10 , Doctrine and Covenants 138:53–56 . Based on your students’ questions and needs, select one or more of the following three sections of the lesson you feel would best help them. Option 1: The Lord’s promises For the following scripture study, you might invite half the class to mark counsel the Lord gave and the other half to mark promises the Lord made. Then, have students find a partner who marked different things to share with. Then, discuss the questions below as a class. Read Jeremiah 1:6–9, 17–19 and mark the counsel and promises the Lord gave in response to Jeremiah’s feelings of inadequacy. How might the Lord’s promises to Jeremiah have helped him see his calling from an eternal perspective? What did the Lord tell Jeremiah that could help youth today with the responsibilities the Lord has given you? Option 2: Knowing my divine purpose matters To help students feel a desire to learn and fulfill their divine purpose, you could watch “ The Choice Generation ,” available at ChurchofJesusChrist.org , from time code 5:43 to 7:14. It shows how one young man was blessed by knowing his divine purpose. 11:24 How would it help you to know what divine responsibilities the Lord has given you? Option 3: Learning my divine purpose Invite students to brainstorm in small groups as many different responses to the following question as they can in two minutes. Then, invite them to make a list on the board of the ideas they came up with. Students may share answers such as reading patriarchal blessings, prayer, personal revelation, counseling with loved ones, and magnifying callings. How can I learn about divine responsibilities the Lord has given me? Consider displaying the following statement. Invite each group to choose one of Elder Pingree’s four suggestions and discuss how following that suggestion could help a teenager understand the divine responsibilities that Heavenly Father has given them. Elder John C. Pingree Jr. of the Seventy shared four things we can do to understand what responsibilities the Lord has given to us: First, focus on others. … Second, discover and develop spiritual gifts. … Third, make use of adversity. … And fourth, rely on God. When we ask Him in faith with real intent, He will reveal our divine assignments to us. (“ I Have a Work for Thee ,” Ensign or Liahona , Nov. 2017, 33–34) The Lord knows me To help students share what they have learned and felt today, invite them to do the following. Encourage students to follow any promptings they may receive from the Holy Ghost as they do this. Using what you have learned today, write a message to your future self in your study journal. Write what you would want to remember about Heavenly Father and Jesus Christ’s knowledge of you and the divine responsibilities They have given you. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Jeremiah 1:4–5 is, “Before I formed thee in the belly …I ordained thee a prophet unto the nations.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 131 ---\nSimilar to today, worldly influences in Jeremiah’s time were strong. Many of the Lord’s people had fallen away from His teachings and would soon be conquered by their enemies. Despite their wickedness, Jeremiah was sent to teach that God still invited them to turn to Him and be healed. This lesson can help students increase their desire to turn to the Savior for mercy and healing. Student preparation: Invite students to find a scripture that teaches about the blessings of repentance. They could prepare to share why those blessings are meaningful to them. Possible Learning Activities Cisterns that hold no water To help students understand the condition of the people in Jeremiah’s time, explain that the Lord often helps us see spiritual truths by comparing them to things we are familiar with. Consider bringing to class a pitcher of water, a basin or large bowl, and a cup with a few small holes in the bottom. Hold up the pitcher of water as students read the following verse. Read Jeremiah 2:13 , looking for a title of the Savior that the water could represent. (A “cistern” is an area below ground created to store water.) What can the title “fountain (or spring) of living waters” teach us about Jesus Christ? Students might share such things as Jesus is a continual source of cleansing and spiritual replenishment. Invite a student to hold the cup over the basin (to ensure the water doesn’t spill) and pour some water from the pitcher into the cup. It might be helpful for students to look through verse 13 again before asking one or both of the following questions. What might pouring the water into the cup represent from the verse? What can the holes in the cisterns teach us about the spiritual condition of the people in Jeremiah’s day? Share with students that the people of Jeremiah’s time were turning to things of the world, such as false gods rather than the Lord, for purpose and strength in their lives. Reflect for a moment about how deliberate you are in turning to Jesus Christ for purpose and strength in your life. As you study today, be open to impressions or feelings from the Holy Ghost about turning to the Savior rather than other sources for blessings and healing. Feeling distant from Heavenly Father and Jesus Christ To help students connect with the following scenario, consider displaying an image of a youth like the one shown. Invite students to come up with a name and a few details about him. Imagine there is a young man in your seminary class who feels his life is like a broken cistern because of poor choices he has made in the past. He feels distant from Heavenly Father and Jesus Christ and is not hopeful for things to get any better. Read Jeremiah 3:12–15, 22 , looking for descriptions of Jesus Christ that this youth would benefit from understanding. (It might be helpful to know that “backsliding” in these verses means faithless or wayward.) Consider writing the following incomplete statement on the board. Invite students to share ways to complete the statement using words or phrases from the verses. For those who repent and turn to the Lord, He will …” Answers might include “be merciful,” “not be angry,” ( verse 12 ), “bring you to Zion,” ( verse 14 ), “give you pastors (leaders) which shall feed you with knowledge and understanding,” ( verse 15 ), “heal your backsliding,” ( verse 22 ), and so on. It might be helpful to spend some time discussing any phrases from these verses that students have questions about. Invite students to record in their journals one or two phrases they think would be helpful for the young man in the scenario to understand about Jesus Christ. Students will have the chance to share what they choose later on. Heavenly Father and Jesus Christ’s mercy To help students increase their confidence in the Lord’s desire to bless and heal those who turn to Him, you could share the following statement. Elder Dieter F. Uchtdorf of the Quorum of the Twelve Apostles taught the following about Heavenly Father and Jesus Christ’s desire to heal those who repent: Who among us has not departed from the path of holiness, foolishly thinking we could find more happiness going our own self-centered way? Who among us has not felt humbled, brokenhearted, and desperate for forgiveness and mercy? Perhaps some may even have wondered, “Is it even possible to go back? Will I be labeled forever, rejected, and avoided by my former friends? Is it better to just stay lost? How will God react if I try to return?”… Our Heavenly Father will run to us, His heart overflowing with love and compassion. … I bear witness that the moment you decide to return and walk in the way of our Savior and Redeemer, His power will enter your life and transform it. (“ The Prodigal and the Road That Leads Home ,” Liahona , Nov. 2023, 88) Write in your journal insights you have gained from this statement that could bless the young man in the scenario. You will have a chance to share these later on. If you didn’t use the video, “ The Savior Wants to Forgive ” in Lesson 77: “ 2 Samuel 11–12 ,” it could be shown here as an example of the Lord’s love and desire to bless and heal all who turn to Him. 5:50 Alternatively, you could show “ The Miracle of the Atonement ” by Elder C. Scott Grow of the Seventy, from time code 0:20 to 2:12 ( Ensign or Liahona , May, 2011, 108). 10:26 Invite students to respond to the following questions in small groups. What did you see in this person’s life that could be compared to the cup with holes in it and the pitcher of water from the beginning of class? What did you learn about Heavenly Father and Jesus Christ from this person’s life? Students could add in their journals any thoughts they think would be helpful to the young man in the scenario. Conclusion The following activity could be a good opportunity for students to feel the Holy Ghost testify of what they say and what they hear from other students. Consider displaying the following instructions. (The first point below gives students a chance to share what they did for their student preparation before class.) Prepare to share what you would say to the young man in the scenario by reviewing what you wrote in your journal. Consider including the following as well: Something from another scripture or scripture story that shows the blessings of repentance (You might look up repentance in the Topical Guide or Guide to the Scriptures .) Your feelings about the Savior’s love and desire to help all who turn to Him After students have had time to prepare, invite them to share their thoughts with a partner or small group. Once students have had the chance to share, you might conclude the lesson by inviting a few volunteers to share their responses to the following question. What have you learned or felt today that could influence your desire to turn to the Savior for His mercy and healing?\n\n\n--- Lesson 132 ---\nThe Savior asks us to participate in the greatest work on earth today: the gathering of Israel, which includes sharing His gospel. The gathering of Israel is so important that the Savior inspired ancient prophets such as Jeremiah to prophesy of it thousands of years ago. This lesson can help students participate in the gathering of Israel by sharing the gospel of Jesus Christ. Student preparation: Invite students to ponder possible concerns Latter-day Saint teens might have with sharing the Savior’s gospel and ways to overcome those concerns. They can prepare to share their thoughts with the class. Possible Learning Activities The Savior’s power Consider beginning class by having students discuss the following question. If they need help, you could remind them of miracles they have studied in the Old Testament. (You might want to keep this discussion brief so you have enough time for the lesson.) What do you think are some of God’s greatest miracles or manifestations of power? If students didn’t mention parting the Red Sea, consider displaying a picture of Moses and the Red Sea. Explain that this event was so miraculous that for centuries people referred to it when teaching about the Savior’s mighty power (see Hebrews 11:29 ; 1 Nephi 4:2 ; Helaman 8:11 ). Think about the amazing miracles God has done in the past as you read the following statement from President Russell M. Nelson: So many wonderful things are ahead. In coming days, we will see the greatest manifestations of the Savior’s power that the world has ever seen. (“ Overcome the World and Find Rest ,” Liahona , Nov. 2022, 95) Read Jeremiah 16:14–15 , looking for something the Savior will do in the last days that will be even more monumental than His deliverance of Israel from Egypt. What did you discover? If students need help, you could explain that in these verses, Jeremiah prophesied of the latter-day gathering of Israel. As needed, explain that President Nelson taught that the gathering of Israel refers to “offering the gospel of Jesus Christ to God’s children on both sides of the veil” (in Russell M. Nelson and Wendy W. Nelson, “ Hope of Israel ” [worldwide youth devotional, June 3, 2018], Gospel Library). This lesson will focus on gathering Israel on this side of the veil. When you think about God’s plan for His children, why might gathering Israel be an even greater miracle than delivering Israel out of Egypt? Ponder your thoughts about the following questions: Is the gathering of Israel important to you? Why or why not? How do you feel about participating in it? Like He did through Moses, the Savior can manifest His miraculous power through you as you participate in the gathering of Israel. As you study Jeremiah 16 today, pay attention to any impressions you receive from the Holy Ghost. Ponder how the Savior can use you in this great gathering. Scattering and gathering In Jeremiah 16:10–18 , the Lord inspired Jeremiah to prophesy of the Israelites’ destruction, which came because of their rebelliousness. The Lord taught them that “their iniquity [was not] hid from [His] eyes” ( verse 17 ) and that He would send them a just punishment if they continued to rebel. Read Jeremiah 16:13 , looking for consequences the Israelites would experience because of their wickedness. Help students understand that Jeremiah prophesied that God would scatter the Israelites in Jerusalem into different lands because of their rebellion. This was fulfilled when many Israelites were taken captive into Babylon. During this time, the Lord also scattered righteous individuals, such as Lehi and his family, who were led to the American continent to preserve their lives from wicked people (see 2 Nephi 10:20–21 ). In Jeremiah 16:14–15 , Jeremiah then prophesied that in the latter days, the Savior would show His power to gather Israel back to Him and His Church. Consider inviting students to discuss the following with a partner or small group. Read Jeremiah 16:16 , looking for comparisons the Lord made about people who help gather Israel. Why might fishing and hunting be good comparisons for people who help gather Israel? What do you learn about our role in gathering Israel? Along with other truths students might share, help them see that Jesus Christ calls us to find scattered Israel and bring them back to Him. Elder Ronald A. Rasband of the Quorum of the Twelve Apostles taught the following about this great gathering: 13:48 The gathering is the ultimate recognition that “the worth of souls is great in the sight of God” [ Doctrine and Covenants 18:10 ]. It is as simple as that. We are gathering God’s children in these last days that they might have “blessings poured out upon their heads” [ 3 Nephi 10:18 ] and the promises of “the riches of eternity” [ Doctrine and Covenants 78:18 ]. It follows that to gather Israel we need missionaries. (“ How Great Will Be Your Joy ,” Liahona , Nov. 2023, 52) What does Elder Rasband’s statement teach you about Heavenly Father and Jesus Christ? Participating in the gathering Students could provide answers to the following question. Consider inviting a student to list these answers on the board. What concerns might Latter-day Saint teenagers have about sharing the Savior’s gospel and gathering Israel? To help students address these concerns, consider displaying the instructions below. You could organize students into small groups, with each student working on a different study option. Once they finish, they could teach each other what they learned. Choose one of the following study options. Prepare to share which concern or concerns you feel the scripture passage best addresses and why. Read Jeremiah 1:6–9 , looking for what the Lord said when He called Jeremiah to share the gospel. Read Doctrine and Covenants 123:12, 16–17 , looking for what Joseph Smith taught the early Latter-day Saints that relates to sharing the gospel. Read Moses 6:32–34 , looking for what the Lord said when He called Enoch to share the gospel. Find a different scripture that you feel helps with any of the concerns on the board. Students could discuss the following questions as a class or in pairs or small groups. As you studied and tried to resolve a concern on the board, what did you learn about the Savior? How could what you learned about Him affect your desire to share His gospel with others? Make a plan Prepare students to make a plan for sharing the gospel. For example, you might show a video such as “ Simple Ways to Love, Share, and Invite for Youth ” (2:50), available at ChurchofJesusChrist.org . Students could look for ways they can share the gospel. They could then share additional ways they can think of. 2:52 What experiences have you or people you know had with sharing the Savior’s gospel with others? You might want to share any experiences you have had. Then display the following statement so students can refer to it as they make their plan. President Russell M. Nelson extended the following invitation: There is nothing happening on this earth more important than gathering Israel for Him . Let your Heavenly Father know that you want to help. Ask Him to put you to work in this glorious cause. (“ Choices for Eternity ” [worldwide devotional for young adults, May 15, 2022], Gospel Library) In your study journal, make a personal plan for sharing the Savior’s gospel with others. Before making this plan, you might follow President Nelson’s invitation by prayerfully expressing your desires to help gather Israel for Heavenly Father. Consider including in your plan any impressions from the Holy Ghost that you might have received. For example, you might include who you would like to share the gospel with, such as individuals who are not members of the Church or who are not actively participating in the Church. Consider also including how and when you could share with them. Consider concluding with your feelings about the Savior and about helping bring souls to Him.\n\n\n--- Lesson 134 ---\nHow might someone act if they knew the gospel of Jesus Christ in their mind but didn’t feel it in their heart? Is it possible that they would act without feeling the power of the Savior’s love? How do our actions change when we feel Heavenly Father and Jesus Christ’s love in our hearts? Jeremiah 31 promises us that when we turn to the Lord, He will write His law in our hearts (see Jeremiah 31:18, 33 ). This lesson can help students understand what it means to have the Savior’s gospel written in their hearts. Student preparation: Invite students to ask family members and friends this question: “What is the difference between knowing a gospel truth in your mind and feeling it in your heart?” They could prepare to share what they discussed. Possible Learning Activities Knowing something in our minds and feeling it in our hearts To begin class, invite students to respond to the following question. What are some situations where we might know we should do something but struggle to actually do it? Students might share examples like getting to bed on time, making healthy eating choices, or completing homework before it is due. Help students understand that it is normal to struggle to align our actions with what we know is right. The same can be true when it comes to knowing and then acting upon what we know about the gospel of Jesus Christ. We might know what the Savior’s gospel requires, but we do not always live it. Nevertheless, we can strive to have the Savior and His gospel influence all we do. What we know about following the Savior is not always reflected in our actions. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles asked a question we might sometimes have in these situations: How can you make the gospel of Jesus Christ not just an influence in your life but the controlling influence and, indeed, the very core of what you are? (“ When Thou Art Converted ,” Ensign or Liahona , May 2004, 11) As you study Jeremiah 31 , invite the Holy Ghost to help you look for ways you can make the Savior’s gospel “the very core of what you are.” Jeremiah foretells the Savior’s blessings to Israel For this study activity, you could organize students into groups of three. Invite each group member to read one of the following passages and to share their answers to the questions with the others in the group. After warning of the consequences that the wicked would suffer in the last days (see Jeremiah 30:23–24 ), Jeremiah prophesied that the Lord would again gather His covenant people to Him. Read the following passages, looking for what the Lord will do for His people: Jeremiah 31:1–3 Jeremiah 31:6–10 Jeremiah 31:17–20 What are some of the promises you found? What do these invitations teach about the Lord? Read Jeremiah 31:31–33 , looking for how the Lord will demonstrate His loving-kindness to His covenant people. How would you summarize this teaching as a statement of truth? Help students identify that the Lord promises to gather us to Him as His covenant people and to write His law in our hearts. What do you think it means to have the Lord’s law written in our hearts? Students might share a variety of ideas. Help students understand that the phrase written in our hearts (see verse 33 ) can refer to being converted, experiencing a change, and desiring to accomplish the will of Heavenly Father and Jesus Christ with all their heart. You may want to point out that Paul used a similar metaphor when he described the Saints in Corinth as an “epistle of Christ … written not with ink … or in tables of stone, but in the fleshy tables of the heart” ( 2 Corinthians 3:3 ). Is the Savior’s gospel written in your heart? Display the following two questions. Invite students to select one they feel could increase their understanding of what it means to have the Lord write His law in their hearts. How do I know that the Savior’s law is written in my heart? What are some things I can do to invite the Savior to write His law in my heart? Organize students into small groups with others who selected the same question. Ask students to imagine they have a friend who has asked the question they selected. Invite students to prepare a response they could share with this friend. To help students prepare a response you could provide each student with a copy of the handout “The Savior Will Write His Law in Your Heart.” Open PDF Demonstrate understanding Consider giving students a chance to practice answering the question they selected. You could organize students with those who studied the other question. You might invite students to share how what they learned could help someone more consistently do what they know is right. To help students demonstrate what they have learned and felt, consider displaying the following instructions. In your study journal, answer one or more of the following questions: What evidence will you look for that the Lord is writing His law in your heart? What is something you feel prompted to do to invite the Savior to write His gospel in your heart? You might also ask willing students to share experiences they have had recognizing that the Savior has written His law in their hearts. You could share how you have seen the Lord writing His law in your heart. Encourage students to ask the Lord for help and to act on the impressions they receive.\n\n\n--- Lesson 135 ---\nThe scriptures are an essential part of our connection to Jesus Christ. Learning from the scriptures points our thoughts and hearts toward Him, which invites His power into our lives. During a time of apostasy, the Lord instructed the prophet Jeremiah to write and send the Lord’s words to the people of Judah so they might turn toward Him and be forgiven. This lesson can help students understand how the scriptures turn them to Jesus Christ to be forgiven of sin. Student preparation: Consider inviting students to review their personal scripture study goals and progress on the required reading for the year. You could also invite students to reflect on how their scripture study is helping them turn to the Lord. Possible Learning Activities Speaking up Think of a way to help students prepare to learn about how the Lord uses scriptures to lovingly correct us and bring us to Him. One way to do this is to have students think of situations where it might be uncomfortable to speak up. As needed, you could use the following situations. How might someone who cares about you respond in the following situations? After eating lunch, your friend notices you have some food in your teeth. You are invited to a party that will have inappropriate activities. Your friend is aware of the activities but knows you are looking forward to going. What might motivate someone to speak up in these situations? What might be the result of saying something or remaining silent? Heavenly Father and Jesus Christ know and see things we do not. They desire the best for us, and they speak to us through the scriptures (see 2 Nephi 32:3 ; Doctrine and Covenants 1:37–38 ). As you learn today, ponder ways the scriptures can bless your life. Consider how these ideas could influence your personal study. A purpose of scripture Read Jeremiah 36:1–3 , looking for why the Lord commanded Jeremiah to record His words for the people of Judah. What did the Lord want for the people of Judah? What do these verses teach us about some purposes of scripture? Students might identify a truth like the scriptures help us turn to the Lord and receive His forgiveness. You might want to invite students to mark the phrases “that they may return every man from his evil way” and “that I may forgive their iniquity and their sin” ( verse 3 ). They could write the truth they discovered near these phrases in their scriptures. How do the scriptures help us turn to the Lord and receive His forgiveness? Consider listing student’s responses on the board. As students share, they might refer to ideas found in the following scriptures. You might want to become familiar with these scriptures so you can go to them as students share. Alternatively, after students share a few responses to the previous question, you could provide the following instructions and have them add to the ideas on the board. Read the following scripture passages, looking for additional ways the scriptures help us turn to the Lord and be forgiven of our sins. 2 Timothy 3:16 Alma 37:8 Helaman 15:7 Questions that help students assess what they are learning can help you identify when they are ready to move on to the next portion of the lesson. For example, you could ask questions such as the following: What are you learning? What questions do you have about what you read? Student responses could invite the Holy Ghost to help you discern how to respond to their needs. For additional training on asking questions to assess learning, see “ Always be ready to respond to spiritual promptings about the needs of learners ” in Teacher Development Skills . The king and the scroll You might summarize or read the following paragraph. Jeremiah did what the Lord commanded and asked a man named Baruch to write the Lord’s words on a scroll. Because Jeremiah was imprisoned, he asked Baruch to read the Lord’s words to the people of Judah, including several princes. After doing so, Baruch gave the scroll to the princes to read to Jehoiakim, the king of Judah (see Jeremiah 36:4–10, 14–15, 20–21 ). Read Jeremiah 36:20–24 , looking for how King Jehoiakim reacted to hearing the words on the scroll. In verse 23 , “he” refers to King Jehoiakim. Why do you think the king reacted this way? Read Jeremiah 36:25 , looking for how certain princes tried to influence the king. Invite students to imagine that they were the princes in verse 25 . Using what they have learned in class today, ask students to prepare a response to the king that would help him understand how the scriptures could bless his life. One way to do this activity is to organize the class into groups of three. Each student could represent one of the princes, with groups preparing their responses together. Then you could invite a group to come to the front of the class and role-play their interaction with the king. You might invite another student to act in the role of king or you as the teacher could play that role. You might suggest that students role-play an alternative ending to the story where the king is persuaded not to burn the scroll. What is a modern situation where the teachings from your response might help a youth? Reflect on what you have learned You could share the following statement to help students reflect on what they learned from their study of Jeremiah 36 . Elder D. Todd Christofferson of the Quorum of the Twelve Apostles taught: Through the scriptures, God does indeed “show forth his power” [see Alma 37:14 ] to save and exalt His children. By His word … He enlarges our memory, sheds light on falsehood and error, and brings us to repentance and to rejoice in Jesus Christ, our Redeemer. (“ The Blessing of Scripture ,” Ensign or Liahona , May 2010, 33) It might help to give students time to ponder or record their response to the following question before they share with the class. How might it affect your personal study to know the scriptures can help you turn to the Lord and receive His forgiveness and guidance? This could be a good opportunity for students to reflect on their personal study goals and the required reading for seminary credit. Consider inviting students to review their goals and to think about how they might focus more on turning to Jesus Christ as part of their personal scripture study.\n\n--- SCRIPTURE: Jeremiah 1 ---\n1. The words of Jeremiah the son of Hilkiah, of the priests thatwereinAnathothin the land of Benjamin:\n2. To whom the word of theLordcame in the days of Josiah the son of Amon king of Judah, in the thirteenthyearof his reign.\n3. It came also in the days of Jehoiakim the son of Josiah king of Judah, unto the end of the eleventh year of Zedekiah the son of Josiah king of Judah, unto thecarryingaway of Jerusalem captive in the fifth month.\n4. Then the word of theLordcame unto me, saying,\n5. Before Iformedthee in the belly Iknewthee; and before thou camest forth out of the womb Isanctifiedthee,andIordainedthee prophet unto thenations.\n6. Then said I, Ah, LordGod! behold, I cannotspeak: for Iamachild.\n7. But theLordsaid unto me, Say not, Iama child: for thou shalt go to all that I shallsendthee, and whatsoever Icommandthee thou shaltspeak.\n8. Be notafraidof their faces: for Iamwith thee to deliver thee, saith theLord.\n9. Then theLordput forth his hand, and touched mymouth. And theLordsaid unto me, Behold, I have put mywordsin thymouth.\n10. See, I have this daysetthee over the nations and over the kingdoms, to root out, and topulldown, and to destroy, and tothrowdown, tobuild, and to plant.\n11. Moreover the word of theLordcame unto me, saying, Jeremiah, whatseestthou? And I said, I see rod of an almond tree.\n12. Then said theLordunto me, Thou hast well seen: for I will hasten my word to perform it.\n13. And the word of theLordcame unto me the second time, saying, What seest thou? And I said, I see aseethingpot; and the face thereofistoward the north.\n14. Then theLordsaid unto me, Out of thenorthan evil shall break forth upon all the inhabitants of the land.\n15. For, lo, I will call all the families of the kingdoms of the north, saith theLord; and they shall come, andthey shall set every one his throne at the entering of thegatesof Jerusalem, and against all the walls thereof round about, and against all the cities of Judah.\n16. And I will utter my judgments against them touching all their wickedness, who haveforsakenme, and have burned incense unto othergods, and worshipped the works of their own hands.\n17. Thou therefore gird up thy loins, and arise, and speak unto them all that I command thee: be not dismayed at their faces, lest I confound thee before them.\n18. For, behold, I have made thee this day defenced city, and an iron pillar, and brasen walls against the whole land, against the kings of Judah, against theprincesthereof, against the priests thereof, and against the people of the land.\n19. And they shallfightagainst thee; but they shall notprevailagainst thee; for Iamwith thee, saith theLord, to deliver thee.\n\n--- SCRIPTURE: Jeremiah 2 ---\n1. Moreover the word of theLordcame to me, saying,\n2. Go and cry in the ears of Jerusalem, saying, Thus saith theLord; I remember thee, the kindness of thy youth, the love of thine espousals,whenthou wentest after me in the wilderness, in landthat wasnot sown.\n3. Israelwasholinessunto theLord,andthe firstfruits of his increase: all that devour him shall offend; evil shall come upon them, saith theLord.\n4. Hear ye the word of theLord, O house of Jacob, and all the families of the house of Israel:\n5. Thus saith theLord, What iniquity have your fathers found in me, that they are gone far from me, and have walked after vanity, and are become vain?\n6. Neither said they, WhereistheLordthat brought us up out of the land of Egypt, thatledus through the wilderness, through land of deserts and of pits, through land of drought, and of the shadow of death, through land that no man passed through, and where no man dwelt?\n7. And I brought you into plentiful country, to eat the fruit thereof and the goodness thereof; but when ye entered, yedefiledmyland, and made mine heritage an abomination.\n8. The priests said not, WhereistheLord? and they that handle the law knew me not: thepastorsalso transgressed against me, and theprophetsprophesied by Baal, and walked afterthings thatdo not profit.\n9. Wherefore I will yet plead with you, saith theLord, and with your childrens children will I plead.\n10. For passoverthe isles of Chittim, and see; and send unto Kedar, and consider diligently, and see if there be such thing.\n11. Hath nation changedtheirgods, whichareyet no gods? but my people have changed their glory forthat whichdoth not profit.\n12. Be astonished, O ye heavens, at this, and be horribly afraid, be ye very desolate, saith theLord.\n13. For my people have committed twoevils; they have forsaken me the fountain ofliving waters,andhewed them out cisterns, broken cisterns, that can hold no water.\n14. IsIsrael aservant?ishe homebornslave?why is he spoiled?\n15. The young lions roared upon him,andyelled, and they made his land waste: his cities are burned without inhabitant.\n16. Also the children of Noph andTahapaneshave broken the crown of thy head.\n17. Hast thou not procured this unto thyself, in that thou hastforsakentheLordthy God, when he led thee by the way?\n18. And now what hast thou to do in the way ofEgypt, to drink the waters of Sihor? or what hast thou to do in the way of Assyria, to drink the waters ofthe river?\n19. Thine own wickedness shall correct thee, and thy backslidings shallreprovethee: know therefore and see thatit isan evilthingand bitter, that thou hast forsaken theLordthy God, and that my fearisnot in thee, saith the LordGodof hosts.\n20. For of old time I have broken thy yoke,andburst thy bands; and thou saidst, I will not transgress; when upon every high hill and under every green tree thou wanderest, playing theharlot.\n21. Yet I had planted thee noblevine, wholly right seed: how then art thou turned into the degenerate plant of strange vine unto me?\n22. For though thouwashthee withnitre, and take thee much soap,yetthine iniquity is marked before me, saith the LordGod.\n23. How canst thou say, I am not polluted, I have not gone after Baalim? see thy way in the valley, know what thou hast done:thou arta swift dromedary traversing her ways;\n24. A wild ass used to the wilderness,thatsnuffeth up the wind at her pleasure; in her occasion who can turn her away? all they that seek her will not weary themselves; in her month theyshall find her.\n25. Withhold thy foot from being unshod, and thy throat from thirst: but thou saidst, There is nohope: no; for I have loved strangers, and after them will I go.\n26. As the thief isashamedwhen he is found, so is the house of Israel ashamed; they, their kings, their princes, and their priests, and their prophets,\n27. Saying toa stock, Thouartmy father; and to stone, Thou hast brought me forth: for they have turnedtheirbackunto me, and nottheirface: but in thetimeof their trouble they will say, Arise, and save us.\n28. But wherearethygodsthat thou hast made thee? let them arise, if they can save thee in the time of thy trouble: foraccording tothe number of thy cities are thy gods, O Judah.\n29. Wherefore will yepleadwith me? ye all have transgressed against me, saith theLord.\n30. In vain have I smitten your children; they received nocorrection: your own sword hath devoured your prophets, like destroying lion.\n31. O generation, see ye the word of theLord. Have I been wilderness unto Israel? land of darkness? wherefore say my people, We are lords; we will come no more unto thee?\n32. Can maid forget her ornaments,ora bride her attire? yet my people haveforgottenme days without number.\n33. Why trimmest thou thy way toseek love? therefore hast thou also taught the wickedonesthy ways.\n34. Also in thy skirts is found thebloodof the souls of the poor innocents: I have not found it by secret search, but upon allthese.\n35. Yet thou sayest, Because I aminnocent, surely his anger shall turn from me. Behold, I will plead with thee, because thou sayest, I have not sinned.\n36. Why gaddest thou about so much to change thy way? thou also shalt beashamedof Egypt, as thou wast ashamed of Assyria.\n37. Yea, thou shalt go forth from him, and thine hands upon thine head: for theLordhath rejected thy confidences, and thou shalt not prosper in them.\n\n--- SCRIPTURE: Jeremiah 3 ---\n1. They say, If manput awayhis wife, and she go from him, and become another mans, shall he return unto her again? shall not that land be greatlypolluted? but thou hast played the harlot with many lovers; yet return again to me, saith theLord.\n2. Lift up thine eyes unto the high places, and see where thou hast not been lien with. In the ways hast thou sat for them, as the Arabian in the wilderness; and thou hast polluted the land with thywhoredomsand with thy wickedness.\n3. Therefore theshowershave been withholden, and there hath been nolatterrain; and thou hadst whores forehead, thou refusedst to be ashamed.\n4. Wilt thou not from this time cry unto me, My father, thouartthe guide of my youth?\n5. Will he reservehisangerfor ever? will he keepitto the end? Behold, thou hast spoken and done evil things as thou couldest.\n6. TheLordsaid also unto me in the days of Josiah the king, Hast thou seenthatwhich backsliding Israel hath done? she is gone up upon every high mountain and under every green tree, and there hath played the harlot.\n7. And I said after she had done all thesethings,Turn thou unto me. But she returned not. And her treacheroussisterJudah sawit.\n8. And I saw, when for all the causes whereby backsliding Israel committedadulteryI had put her away, and given her bill ofdivorce; yet her treacherous sister Judah feared not, but went and played the harlot also.\n9. And it came to pass through the lightness of her whoredom, that she defiled the land, andcommittedadultery withstonesand withstocks.\n10. And yet for all this her treacherous sister Judah hath not turned unto me with her whole heart, butfeignedly, saith theLord.\n11. And theLordsaid unto me, The backsliding Israel hathjustifiedherself more than treacherous Judah.\n12. Go andproclaimthese words toward thenorth, and say,Return, thou backsliding Israel, saith theLord;andI will not cause mine anger to fall upon you: for Iammerciful, saith theLord,andI will not keepangerfor ever.\n13. Only acknowledge thine iniquity, that thou hast transgressed against theLordthy God, and hast scattered thy ways to the strangers under every green tree, and ye have notobeyedmy voice, saith theLord.\n14. Turn, O backsliding children, saith theLord; for I ammarriedunto you: and I will take you one of city, and two of family, and I willbringyou toZion:\n15. And I will give youpastorsaccording to mine heart, which shall feed you withknowledgeand understanding.\n16. And it shall come to pass, when ye be multiplied and increased in the land, in those days, saith theLord, they shall say no more, Thearkof the covenant of theLord: neither shall it come to mind: neither shall they remember it; neither shall they visitit;neither shallthatbe done any more.\n17. At that time they shall callJerusalemthe throne of theLord; and all thenationsshall begatheredunto it, to the name of theLord, to Jerusalem: neither shall they walk any more after theimaginationof their evil heart.\n18. In those days thehouseof Judah shall walk with the house of Israel, and they shall come together out of thelandof thenorthto the land that I have given for an inheritance unto your fathers.\n19. But I said, How shall I put thee among the children, and give thee pleasant land, goodly heritage of the hosts of nations? and I said, Thou shalt call me, My father; and shalt not turn away from me.\n20. Surelyasa wife treacherouslydepartethfrom her husband, so have ye dealt treacherously with me, O house of Israel, saith theLord.\n21. A voice was heard upon the high places, weepingandsupplications of the children of Israel: for they have perverted their way,andthey have forgotten theLordtheir God.\n22. Return, ye backsliding children,andI willhealyour backslidings. Behold, we come unto thee; for thouarttheLordour God.\n23. Truly in vainis salvation hoped forfrom the hills,and fromthe multitude of mountains: truly in theLordour Godisthe salvation of Israel.\n24. For shame hath devoured the labour of our fathers from our youth; their flocks and their herds, their sons and their daughters.\n25. We lie down in ourshame, and our confusion covereth us: for we havesinnedagainst theLordour God, we and our fathers, from our youth even unto this day, and have not obeyed the voice of theLordour God.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";7;16–18;20",
      "content": "At first, Jeremiah didn’t think he would make a good prophet. “Behold, I cannot speak,” he protested (\nJeremiah 1:6\n). But the Lord reassured him, “I have put my words in thy mouth” (\nverse 9\n). Jeremiah felt that he was an inexperienced “child” (\nverse 6\n), but the Lord explained that he was actually more prepared than he realized—he had been ordained to this calling even before he was born (see\nverse 5\n). So Jeremiah set aside his fears and accepted the call. He warned Jerusalem’s kings and priests that their pretended holiness would not save them. The “child” who thought he could not speak came to feel God’s word “in [his] heart as a burning fire” and could not be silent (\nJeremiah 20:9\n).\nJeremiah’s story is also your story. God knew you, too, before you were born and prepared you for your mission in life. Among other things, that mission includes something Jeremiah foresaw: gathering God’s people, one by one, to “bring [them] to Zion” (\nJeremiah 3:14\n). And even if you don’t know exactly what to do or say, you can “be not afraid … ; for I am with thee, saith the Lord” (\nJeremiah 1:8, 19\n).\nFor an overview of the book of Jeremiah, see “\nJeremiah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nJeremiah 1:4–19\n;\n7:1–7\n;\n20:8–9\nProphets are called to speak God’s word.\nImagine you’re talking to a friend who has never heard of prophets, and you decide to explain the concept using Jeremiah’s call to be a prophet in\nJeremiah 1:4–19\n. What do you find in these verses that teaches something about prophets of God? You could also look in\nJeremiah 7:1–7\n;\n20:8–9\nand a hymn like “\nWe Listen to a Prophet’s Voice\n” (\nHymns\n, no. 22).\nYou might also want to teach your friend about today’s living prophet. Is there anything in these verses that might help? For example, what do prophets in our day “root out” or “pull down”? What do they “build” and “plant”? (\nJeremiah 1:10\n). How have you come to know that our living prophet is called of God?\nSee also\nArticles of Faith 1:6, 9\n; “Why Do We Have Prophets?” (video),\nChurchofJesusChrist.org\n.\n1:37\nWhy Do We Have Prophets?\nJeremiah 1:5\nGod knew me before I was born.\nWhat did Jeremiah learn about himself in\nJeremiah 1:5\n? As a newly called prophet, why would that information be important for him to know?\nMuch of what Jeremiah learned about himself in\nJeremiah 1:5\nis also true about you. God also knew you before you were born and prepared you for specific responsibilities. To learn more about your life before you were born, read\nAlma 13:1–4\n;\nDoctrine and Covenants 138:53–56\n; and\nAbraham 3:22–23\n. You might make a list of truths you discover. Why is this information important for you to know?\nTo learn about how these truths affected the life of Elder Ahmad S. Corbitt, study his message “\nYou Can Gather Israel!\n” (\nLiahona\n, May 2021, 61–63). How does knowing about your premortal life affect the way you live your mortal life?\nHere is what President Russell M. Nelson said about your premortal life:\n“Your Heavenly Father has known you for a very long time. You, as His son or daughter, were chosen by Him to come to earth at this precise time, to be a leader in His great work on earth. You were chosen\nnot\nfor your bodily characteristics but for your\nspiritual\nattributes, such as bravery, courage, integrity of heart, a thirst for truth, a hunger for wisdom, and a desire to serve others.\n“You developed some of these attributes premortally. Others you can develop here on earth as you persistently seek them” (“\nDecisions for Eternity\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 107).\nThink of some situations you might face in which it would be important to remember these truths about your premortal life. What can you do to remind yourself of these truths?\nSee also Russell M. Nelson, “\nDecisions for Eternity\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 106–9; Topics and Questions, “\nForeordination\n,” “\nPremortal Life\n,” Gospel Library.\nIn\nJeremiah 2:13\n, the Lord compared the people’s spiritual state to “broken cisterns” and compared Himself to the “fountain of living waters.”\nJeremiah 2\n;\n7\n“They have forsaken me the fountain of living waters.”\nIn the dry region where the Israelites lived, people stored precious water in underground reservoirs called cisterns. What do you think the “broken cisterns” mentioned in\nJeremiah 2:13\nmight symbolize? Why would receiving water from a fountain be better than relying on a cistern? What does it mean to forsake “the fountain of living waters”? As you read\nJeremiah 2\nand\n7\n, notice how the people were forsaking the Lord’s living waters (see, for example,\nJeremiah 2:26–28\n;\n7:2–11\n). Why is “living water” a good symbol for what the Savior gives you? Think about how you are receiving living water.\nJeremiah 7\nis addressed to people who were entering “the Lord’s house … to worship the Lord,” but their actions didn’t match their outward devotion (see\nverses 2–11\n). What messages do you feel the Lord might have for you in\nverses 21–23\n?\nUse object lessons.\nThe Lord’s prophets often compare spiritual truths to familiar objects. Consider doing the same as you learn and teach the gospel. For example, to visualize\nJeremiah 2:13\n, you could put water in a cracked or broken container or drink from a drinking fountain. How is Jesus like a “fountain of living waters”? (\nJeremiah 2:13\n). How do we drink from His living water?\nJeremiah 3:14–18\n;\n16:14–21\nThe Lord will gather His people.\nIn\nJeremiah 16:14–15\n, Jeremiah compared the gathering of Israel in the latter days with the Exodus of Israel from Egypt. In your opinion, why would the gathering be even more important to God’s people than the Exodus?\nWhat do\nJeremiah 3:14–18\n;\n16:14–21\nsuggest about how the gathering happens?\nIn his message “\nHope of Israel\n,” President Russell M. Nelson, like Jeremiah, taught that the gathering of Israel “is the most important thing taking place on earth today” (worldwide youth devotional, June 3, 2018, Gospel Library). Read or listen to his message, and see if you can discover (a) how President Nelson defines the gathering of Israel, (b) how he describes its importance, and (c) how you can be part of the gathering.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nJeremiah 1:5\nHeavenly Father knew me before I was born.\nTo introduce the important truth taught in\nJeremiah 1:5\n, you could show your children a picture of a baby (or, if possible, you could look at pictures of your children when they were babies). Ask your children if they know where they lived before they were born. You could also sing together a song that teaches about our premortal life, such as “\nI Lived in Heaven\n” (\nChildren’s Songbook\n, 4).\nIf your children would like to learn more, you could help them find “\nPremortal Life\n” in the Guide to the Scriptures. They could look for answers to “who,” “when,” and “what” questions about the premortal life.\nJeremiah 1:4–19\nProphets are called to speak the words of the Lord.\nConsider showing pictures of the living prophet or prophets from the scriptures (you can find some in\nChurch magazines\n, the\nGospel Art Book\n, and\nCome, Follow Me\n). Ask your children what they know about these prophets.\nTo teach about what prophets do, you might select some helpful verses from\nJeremiah 1\n, such as\nverses 5, 7, 10\n, and\n19\n. Your children could each pick one of the verses, read it, and share something they learn about prophets.\nJeremiah 16:14–16\nI can help Heavenly Father’s children come back to Him.\nWhile you read\nJeremiah 16:16\n, your children could pretend to “fish” or “hunt” for objects around the room. President Russell M. Nelson has compared the fishers and hunters in this verse to missionaries (see “\nThe Gathering of Scattered Israel\n,”\nEnsign\nor\nLiahona\n, Nov. 2006, 81). What do missionaries do? How can we help “fish” and “hunt” for scattered Israel? (see “A Message for Children from President Russell M. Nelson” [video],\nChurchofJesusChrist.org\n).\n3:30\nVideo: A Message for Children from President Russell M. Nelson\nJeremiah 18:1–6\nI can let the Lord guide my life, like a potter shapes clay.\nTo explore these verses, you might discuss or show how pottery is made (see the picture at the end of this outline). What message does the Lord have for us in\nJeremiah 18:1–6\n? What does it mean to be clay in the Lord’s hands? (see also\nIsaiah 64:8\n). For another story that compares us to potter’s clay, see Elder Richard J. Maynes’s message “\nThe Joy of Living a Christ-Centered Life\n” (\nEnsign\nor\nLiahona\n, Nov. 2015, 27–30).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 43: Lesson 130: Lesson 130—Jeremiah 1This lesson can help students feel a desire to fulfill their divine purpose.; Lesson 131: Lesson 131—Jeremiah 2–3This lesson can help students increase their desire to turn to the Savior for mercy and healing....",
      "content": "\n--- Lesson 130 ---\nHave you ever wondered what happened in the premortal life that prepared you for your responsibilities in mortality? In the premortal life, Heavenly Father gave divine responsibilities to His children to perform in mortality. Examples of this include Jesus Christ (see 1 Peter 1:19–20 ) and Jeremiah (see Jeremiah 1:5 ). This lesson can help students feel a desire to fulfill their divine purpose. Student preparation: Invite students to imagine holding a newborn infant and to think about these two questions: Possible Learning Activities Prepare to learn To help students prepare to learn that Heavenly Father knows them and that He has a divine purpose for them, invite them to imagine the following situation. (You could adjust the situation to better fit your students. For example, it could be a teacher who challenges them to get a certain grade in a difficult class.) Imagine that a coach challenges you to work toward a difficult goal, such as running a mile under a certain time by a specific date. How would the following situations affect your desire to accomplish it and your confidence that you could achieve it? The coach, who knows you well, has worked with you for years and tailored the challenge specifically for you. A new coach who doesn’t know you has given the same challenge to the entire team. Display the following self-assessment to help students reflect on how perfectly Heavenly Father and Jesus Christ know them and their divine purpose. ( Note : Students will be invited to refer back to this self-assessment in Lesson 148: “ Assess Your Learning 9 .”) How would you evaluate yourself (1 – true of me; 10 – not true of me) on the following statements? Record in your study journal why you rated each statement how you did. I believe Heavenly Father and Jesus Christ know me better than anyone else knows me. I believe They have given me a divine purpose I can accomplish with Their help. I want to know and fulfill the divine mission Heavenly Father and Jesus Christ have given me. Invite students to pay attention to thoughts and feelings from the Holy Ghost as they learn more about their divine purpose. “Before thou camest forth out of the womb … I ordained thee” To help students relate to Jeremiah, you could ask them how they might feel if the Lord asked them to do something difficult, such as speaking in church, teaching a lesson, serving a mission, and so on. Jeremiah may have felt similarly when the Lord called him to serve as a prophet to the kingdom of Judah. Students may be interested to know that Jeremiah prophesied in Jerusalem around the same time as Lehi (see 1 Nephi 7:14 ). Jeremiah 1:4–5 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Jeremiah 1:4–5 and the following statement from President Russell M. Nelson. Then, summarize what you learn about our relationship with the Lord. 14:25 Your spirit is an eternal entity. The Lord said to His prophet Abraham: “Thou wast chosen before thou wast born” ( Abraham 3:23 ). The Lord said something similar about Jeremiah and many others. He even said it about you. Your Heavenly Father has known you for a very long time. You, as His son or daughter, were chosen by Him to come to earth at this precise time, to be a leader in His great work on earth. You were chosen not for your bodily characteristics but for your spiritual attributes. … (“ Decisions for Eternity ,” Ensign or Liahona , Nov. 2013, 107) What truths can we learn from Jeremiah 1:4–5 and President Nelson’s statement? As students share, help them identify that before we were born, the Lord knew us and gave us specific responsibilities to perform in mortality. Consider inviting students to ask any questions they may have about this truth. If they ask questions that the Lord has not yet clearly answered, thank them for their thoughtful questions, but be careful not to speculate about answers. Statements in Additional Resources may help to answer student questions. For examples of others who were called to perform specific responsibilities in mortality, students could read one or more of the following: Luke 1:13–17 , 1 Nephi 11:14–20 , Mosiah 3:5–10 , Doctrine and Covenants 138:53–56 . Based on your students’ questions and needs, select one or more of the following three sections of the lesson you feel would best help them. Option 1: The Lord’s promises For the following scripture study, you might invite half the class to mark counsel the Lord gave and the other half to mark promises the Lord made. Then, have students find a partner who marked different things to share with. Then, discuss the questions below as a class. Read Jeremiah 1:6–9, 17–19 and mark the counsel and promises the Lord gave in response to Jeremiah’s feelings of inadequacy. How might the Lord’s promises to Jeremiah have helped him see his calling from an eternal perspective? What did the Lord tell Jeremiah that could help youth today with the responsibilities the Lord has given you? Option 2: Knowing my divine purpose matters To help students feel a desire to learn and fulfill their divine purpose, you could watch “ The Choice Generation ,” available at ChurchofJesusChrist.org , from time code 5:43 to 7:14. It shows how one young man was blessed by knowing his divine purpose. 11:24 How would it help you to know what divine responsibilities the Lord has given you? Option 3: Learning my divine purpose Invite students to brainstorm in small groups as many different responses to the following question as they can in two minutes. Then, invite them to make a list on the board of the ideas they came up with. Students may share answers such as reading patriarchal blessings, prayer, personal revelation, counseling with loved ones, and magnifying callings. How can I learn about divine responsibilities the Lord has given me? Consider displaying the following statement. Invite each group to choose one of Elder Pingree’s four suggestions and discuss how following that suggestion could help a teenager understand the divine responsibilities that Heavenly Father has given them. Elder John C. Pingree Jr. of the Seventy shared four things we can do to understand what responsibilities the Lord has given to us: First, focus on others. … Second, discover and develop spiritual gifts. … Third, make use of adversity. … And fourth, rely on God. When we ask Him in faith with real intent, He will reveal our divine assignments to us. (“ I Have a Work for Thee ,” Ensign or Liahona , Nov. 2017, 33–34) The Lord knows me To help students share what they have learned and felt today, invite them to do the following. Encourage students to follow any promptings they may receive from the Holy Ghost as they do this. Using what you have learned today, write a message to your future self in your study journal. Write what you would want to remember about Heavenly Father and Jesus Christ’s knowledge of you and the divine responsibilities They have given you. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Jeremiah 1:4–5 is, “Before I formed thee in the belly …I ordained thee a prophet unto the nations.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 131 ---\nSimilar to today, worldly influences in Jeremiah’s time were strong. Many of the Lord’s people had fallen away from His teachings and would soon be conquered by their enemies. Despite their wickedness, Jeremiah was sent to teach that God still invited them to turn to Him and be healed. This lesson can help students increase their desire to turn to the Savior for mercy and healing. Student preparation: Invite students to find a scripture that teaches about the blessings of repentance. They could prepare to share why those blessings are meaningful to them. Possible Learning Activities Cisterns that hold no water To help students understand the condition of the people in Jeremiah’s time, explain that the Lord often helps us see spiritual truths by comparing them to things we are familiar with. Consider bringing to class a pitcher of water, a basin or large bowl, and a cup with a few small holes in the bottom. Hold up the pitcher of water as students read the following verse. Read Jeremiah 2:13 , looking for a title of the Savior that the water could represent. (A “cistern” is an area below ground created to store water.) What can the title “fountain (or spring) of living waters” teach us about Jesus Christ? Students might share such things as Jesus is a continual source of cleansing and spiritual replenishment. Invite a student to hold the cup over the basin (to ensure the water doesn’t spill) and pour some water from the pitcher into the cup. It might be helpful for students to look through verse 13 again before asking one or both of the following questions. What might pouring the water into the cup represent from the verse? What can the holes in the cisterns teach us about the spiritual condition of the people in Jeremiah’s day? Share with students that the people of Jeremiah’s time were turning to things of the world, such as false gods rather than the Lord, for purpose and strength in their lives. Reflect for a moment about how deliberate you are in turning to Jesus Christ for purpose and strength in your life. As you study today, be open to impressions or feelings from the Holy Ghost about turning to the Savior rather than other sources for blessings and healing. Feeling distant from Heavenly Father and Jesus Christ To help students connect with the following scenario, consider displaying an image of a youth like the one shown. Invite students to come up with a name and a few details about him. Imagine there is a young man in your seminary class who feels his life is like a broken cistern because of poor choices he has made in the past. He feels distant from Heavenly Father and Jesus Christ and is not hopeful for things to get any better. Read Jeremiah 3:12–15, 22 , looking for descriptions of Jesus Christ that this youth would benefit from understanding. (It might be helpful to know that “backsliding” in these verses means faithless or wayward.) Consider writing the following incomplete statement on the board. Invite students to share ways to complete the statement using words or phrases from the verses. For those who repent and turn to the Lord, He will …” Answers might include “be merciful,” “not be angry,” ( verse 12 ), “bring you to Zion,” ( verse 14 ), “give you pastors (leaders) which shall feed you with knowledge and understanding,” ( verse 15 ), “heal your backsliding,” ( verse 22 ), and so on. It might be helpful to spend some time discussing any phrases from these verses that students have questions about. Invite students to record in their journals one or two phrases they think would be helpful for the young man in the scenario to understand about Jesus Christ. Students will have the chance to share what they choose later on. Heavenly Father and Jesus Christ’s mercy To help students increase their confidence in the Lord’s desire to bless and heal those who turn to Him, you could share the following statement. Elder Dieter F. Uchtdorf of the Quorum of the Twelve Apostles taught the following about Heavenly Father and Jesus Christ’s desire to heal those who repent: Who among us has not departed from the path of holiness, foolishly thinking we could find more happiness going our own self-centered way? Who among us has not felt humbled, brokenhearted, and desperate for forgiveness and mercy? Perhaps some may even have wondered, “Is it even possible to go back? Will I be labeled forever, rejected, and avoided by my former friends? Is it better to just stay lost? How will God react if I try to return?”… Our Heavenly Father will run to us, His heart overflowing with love and compassion. … I bear witness that the moment you decide to return and walk in the way of our Savior and Redeemer, His power will enter your life and transform it. (“ The Prodigal and the Road That Leads Home ,” Liahona , Nov. 2023, 88) Write in your journal insights you have gained from this statement that could bless the young man in the scenario. You will have a chance to share these later on. If you didn’t use the video, “ The Savior Wants to Forgive ” in Lesson 77: “ 2 Samuel 11–12 ,” it could be shown here as an example of the Lord’s love and desire to bless and heal all who turn to Him. 5:50 Alternatively, you could show “ The Miracle of the Atonement ” by Elder C. Scott Grow of the Seventy, from time code 0:20 to 2:12 ( Ensign or Liahona , May, 2011, 108). 10:26 Invite students to respond to the following questions in small groups. What did you see in this person’s life that could be compared to the cup with holes in it and the pitcher of water from the beginning of class? What did you learn about Heavenly Father and Jesus Christ from this person’s life? Students could add in their journals any thoughts they think would be helpful to the young man in the scenario. Conclusion The following activity could be a good opportunity for students to feel the Holy Ghost testify of what they say and what they hear from other students. Consider displaying the following instructions. (The first point below gives students a chance to share what they did for their student preparation before class.) Prepare to share what you would say to the young man in the scenario by reviewing what you wrote in your journal. Consider including the following as well: Something from another scripture or scripture story that shows the blessings of repentance (You might look up repentance in the Topical Guide or Guide to the Scriptures .) Your feelings about the Savior’s love and desire to help all who turn to Him After students have had time to prepare, invite them to share their thoughts with a partner or small group. Once students have had the chance to share, you might conclude the lesson by inviting a few volunteers to share their responses to the following question. What have you learned or felt today that could influence your desire to turn to the Savior for His mercy and healing?\n\n\n--- Lesson 132 ---\nThe Savior asks us to participate in the greatest work on earth today: the gathering of Israel, which includes sharing His gospel. The gathering of Israel is so important that the Savior inspired ancient prophets such as Jeremiah to prophesy of it thousands of years ago. This lesson can help students participate in the gathering of Israel by sharing the gospel of Jesus Christ. Student preparation: Invite students to ponder possible concerns Latter-day Saint teens might have with sharing the Savior’s gospel and ways to overcome those concerns. They can prepare to share their thoughts with the class. Possible Learning Activities The Savior’s power Consider beginning class by having students discuss the following question. If they need help, you could remind them of miracles they have studied in the Old Testament. (You might want to keep this discussion brief so you have enough time for the lesson.) What do you think are some of God’s greatest miracles or manifestations of power? If students didn’t mention parting the Red Sea, consider displaying a picture of Moses and the Red Sea. Explain that this event was so miraculous that for centuries people referred to it when teaching about the Savior’s mighty power (see Hebrews 11:29 ; 1 Nephi 4:2 ; Helaman 8:11 ). Think about the amazing miracles God has done in the past as you read the following statement from President Russell M. Nelson: So many wonderful things are ahead. In coming days, we will see the greatest manifestations of the Savior’s power that the world has ever seen. (“ Overcome the World and Find Rest ,” Liahona , Nov. 2022, 95) Read Jeremiah 16:14–15 , looking for something the Savior will do in the last days that will be even more monumental than His deliverance of Israel from Egypt. What did you discover? If students need help, you could explain that in these verses, Jeremiah prophesied of the latter-day gathering of Israel. As needed, explain that President Nelson taught that the gathering of Israel refers to “offering the gospel of Jesus Christ to God’s children on both sides of the veil” (in Russell M. Nelson and Wendy W. Nelson, “ Hope of Israel ” [worldwide youth devotional, June 3, 2018], Gospel Library). This lesson will focus on gathering Israel on this side of the veil. When you think about God’s plan for His children, why might gathering Israel be an even greater miracle than delivering Israel out of Egypt? Ponder your thoughts about the following questions: Is the gathering of Israel important to you? Why or why not? How do you feel about participating in it? Like He did through Moses, the Savior can manifest His miraculous power through you as you participate in the gathering of Israel. As you study Jeremiah 16 today, pay attention to any impressions you receive from the Holy Ghost. Ponder how the Savior can use you in this great gathering. Scattering and gathering In Jeremiah 16:10–18 , the Lord inspired Jeremiah to prophesy of the Israelites’ destruction, which came because of their rebelliousness. The Lord taught them that “their iniquity [was not] hid from [His] eyes” ( verse 17 ) and that He would send them a just punishment if they continued to rebel. Read Jeremiah 16:13 , looking for consequences the Israelites would experience because of their wickedness. Help students understand that Jeremiah prophesied that God would scatter the Israelites in Jerusalem into different lands because of their rebellion. This was fulfilled when many Israelites were taken captive into Babylon. During this time, the Lord also scattered righteous individuals, such as Lehi and his family, who were led to the American continent to preserve their lives from wicked people (see 2 Nephi 10:20–21 ). In Jeremiah 16:14–15 , Jeremiah then prophesied that in the latter days, the Savior would show His power to gather Israel back to Him and His Church. Consider inviting students to discuss the following with a partner or small group. Read Jeremiah 16:16 , looking for comparisons the Lord made about people who help gather Israel. Why might fishing and hunting be good comparisons for people who help gather Israel? What do you learn about our role in gathering Israel? Along with other truths students might share, help them see that Jesus Christ calls us to find scattered Israel and bring them back to Him. Elder Ronald A. Rasband of the Quorum of the Twelve Apostles taught the following about this great gathering: 13:48 The gathering is the ultimate recognition that “the worth of souls is great in the sight of God” [ Doctrine and Covenants 18:10 ]. It is as simple as that. We are gathering God’s children in these last days that they might have “blessings poured out upon their heads” [ 3 Nephi 10:18 ] and the promises of “the riches of eternity” [ Doctrine and Covenants 78:18 ]. It follows that to gather Israel we need missionaries. (“ How Great Will Be Your Joy ,” Liahona , Nov. 2023, 52) What does Elder Rasband’s statement teach you about Heavenly Father and Jesus Christ? Participating in the gathering Students could provide answers to the following question. Consider inviting a student to list these answers on the board. What concerns might Latter-day Saint teenagers have about sharing the Savior’s gospel and gathering Israel? To help students address these concerns, consider displaying the instructions below. You could organize students into small groups, with each student working on a different study option. Once they finish, they could teach each other what they learned. Choose one of the following study options. Prepare to share which concern or concerns you feel the scripture passage best addresses and why. Read Jeremiah 1:6–9 , looking for what the Lord said when He called Jeremiah to share the gospel. Read Doctrine and Covenants 123:12, 16–17 , looking for what Joseph Smith taught the early Latter-day Saints that relates to sharing the gospel. Read Moses 6:32–34 , looking for what the Lord said when He called Enoch to share the gospel. Find a different scripture that you feel helps with any of the concerns on the board. Students could discuss the following questions as a class or in pairs or small groups. As you studied and tried to resolve a concern on the board, what did you learn about the Savior? How could what you learned about Him affect your desire to share His gospel with others? Make a plan Prepare students to make a plan for sharing the gospel. For example, you might show a video such as “ Simple Ways to Love, Share, and Invite for Youth ” (2:50), available at ChurchofJesusChrist.org . Students could look for ways they can share the gospel. They could then share additional ways they can think of. 2:52 What experiences have you or people you know had with sharing the Savior’s gospel with others? You might want to share any experiences you have had. Then display the following statement so students can refer to it as they make their plan. President Russell M. Nelson extended the following invitation: There is nothing happening on this earth more important than gathering Israel for Him . Let your Heavenly Father know that you want to help. Ask Him to put you to work in this glorious cause. (“ Choices for Eternity ” [worldwide devotional for young adults, May 15, 2022], Gospel Library) In your study journal, make a personal plan for sharing the Savior’s gospel with others. Before making this plan, you might follow President Nelson’s invitation by prayerfully expressing your desires to help gather Israel for Heavenly Father. Consider including in your plan any impressions from the Holy Ghost that you might have received. For example, you might include who you would like to share the gospel with, such as individuals who are not members of the Church or who are not actively participating in the Church. Consider also including how and when you could share with them. Consider concluding with your feelings about the Savior and about helping bring souls to Him.\n\n\n--- Lesson 134 ---\nHow might someone act if they knew the gospel of Jesus Christ in their mind but didn’t feel it in their heart? Is it possible that they would act without feeling the power of the Savior’s love? How do our actions change when we feel Heavenly Father and Jesus Christ’s love in our hearts? Jeremiah 31 promises us that when we turn to the Lord, He will write His law in our hearts (see Jeremiah 31:18, 33 ). This lesson can help students understand what it means to have the Savior’s gospel written in their hearts. Student preparation: Invite students to ask family members and friends this question: “What is the difference between knowing a gospel truth in your mind and feeling it in your heart?” They could prepare to share what they discussed. Possible Learning Activities Knowing something in our minds and feeling it in our hearts To begin class, invite students to respond to the following question. What are some situations where we might know we should do something but struggle to actually do it? Students might share examples like getting to bed on time, making healthy eating choices, or completing homework before it is due. Help students understand that it is normal to struggle to align our actions with what we know is right. The same can be true when it comes to knowing and then acting upon what we know about the gospel of Jesus Christ. We might know what the Savior’s gospel requires, but we do not always live it. Nevertheless, we can strive to have the Savior and His gospel influence all we do. What we know about following the Savior is not always reflected in our actions. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles asked a question we might sometimes have in these situations: How can you make the gospel of Jesus Christ not just an influence in your life but the controlling influence and, indeed, the very core of what you are? (“ When Thou Art Converted ,” Ensign or Liahona , May 2004, 11) As you study Jeremiah 31 , invite the Holy Ghost to help you look for ways you can make the Savior’s gospel “the very core of what you are.” Jeremiah foretells the Savior’s blessings to Israel For this study activity, you could organize students into groups of three. Invite each group member to read one of the following passages and to share their answers to the questions with the others in the group. After warning of the consequences that the wicked would suffer in the last days (see Jeremiah 30:23–24 ), Jeremiah prophesied that the Lord would again gather His covenant people to Him. Read the following passages, looking for what the Lord will do for His people: Jeremiah 31:1–3 Jeremiah 31:6–10 Jeremiah 31:17–20 What are some of the promises you found? What do these invitations teach about the Lord? Read Jeremiah 31:31–33 , looking for how the Lord will demonstrate His loving-kindness to His covenant people. How would you summarize this teaching as a statement of truth? Help students identify that the Lord promises to gather us to Him as His covenant people and to write His law in our hearts. What do you think it means to have the Lord’s law written in our hearts? Students might share a variety of ideas. Help students understand that the phrase written in our hearts (see verse 33 ) can refer to being converted, experiencing a change, and desiring to accomplish the will of Heavenly Father and Jesus Christ with all their heart. You may want to point out that Paul used a similar metaphor when he described the Saints in Corinth as an “epistle of Christ … written not with ink … or in tables of stone, but in the fleshy tables of the heart” ( 2 Corinthians 3:3 ). Is the Savior’s gospel written in your heart? Display the following two questions. Invite students to select one they feel could increase their understanding of what it means to have the Lord write His law in their hearts. How do I know that the Savior’s law is written in my heart? What are some things I can do to invite the Savior to write His law in my heart? Organize students into small groups with others who selected the same question. Ask students to imagine they have a friend who has asked the question they selected. Invite students to prepare a response they could share with this friend. To help students prepare a response you could provide each student with a copy of the handout “The Savior Will Write His Law in Your Heart.” Open PDF Demonstrate understanding Consider giving students a chance to practice answering the question they selected. You could organize students with those who studied the other question. You might invite students to share how what they learned could help someone more consistently do what they know is right. To help students demonstrate what they have learned and felt, consider displaying the following instructions. In your study journal, answer one or more of the following questions: What evidence will you look for that the Lord is writing His law in your heart? What is something you feel prompted to do to invite the Savior to write His gospel in your heart? You might also ask willing students to share experiences they have had recognizing that the Savior has written His law in their hearts. You could share how you have seen the Lord writing His law in your heart. Encourage students to ask the Lord for help and to act on the impressions they receive.\n\n\n--- Lesson 135 ---\nThe scriptures are an essential part of our connection to Jesus Christ. Learning from the scriptures points our thoughts and hearts toward Him, which invites His power into our lives. During a time of apostasy, the Lord instructed the prophet Jeremiah to write and send the Lord’s words to the people of Judah so they might turn toward Him and be forgiven. This lesson can help students understand how the scriptures turn them to Jesus Christ to be forgiven of sin. Student preparation: Consider inviting students to review their personal scripture study goals and progress on the required reading for the year. You could also invite students to reflect on how their scripture study is helping them turn to the Lord. Possible Learning Activities Speaking up Think of a way to help students prepare to learn about how the Lord uses scriptures to lovingly correct us and bring us to Him. One way to do this is to have students think of situations where it might be uncomfortable to speak up. As needed, you could use the following situations. How might someone who cares about you respond in the following situations? After eating lunch, your friend notices you have some food in your teeth. You are invited to a party that will have inappropriate activities. Your friend is aware of the activities but knows you are looking forward to going. What might motivate someone to speak up in these situations? What might be the result of saying something or remaining silent? Heavenly Father and Jesus Christ know and see things we do not. They desire the best for us, and they speak to us through the scriptures (see 2 Nephi 32:3 ; Doctrine and Covenants 1:37–38 ). As you learn today, ponder ways the scriptures can bless your life. Consider how these ideas could influence your personal study. A purpose of scripture Read Jeremiah 36:1–3 , looking for why the Lord commanded Jeremiah to record His words for the people of Judah. What did the Lord want for the people of Judah? What do these verses teach us about some purposes of scripture? Students might identify a truth like the scriptures help us turn to the Lord and receive His forgiveness. You might want to invite students to mark the phrases “that they may return every man from his evil way” and “that I may forgive their iniquity and their sin” ( verse 3 ). They could write the truth they discovered near these phrases in their scriptures. How do the scriptures help us turn to the Lord and receive His forgiveness? Consider listing student’s responses on the board. As students share, they might refer to ideas found in the following scriptures. You might want to become familiar with these scriptures so you can go to them as students share. Alternatively, after students share a few responses to the previous question, you could provide the following instructions and have them add to the ideas on the board. Read the following scripture passages, looking for additional ways the scriptures help us turn to the Lord and be forgiven of our sins. 2 Timothy 3:16 Alma 37:8 Helaman 15:7 Questions that help students assess what they are learning can help you identify when they are ready to move on to the next portion of the lesson. For example, you could ask questions such as the following: What are you learning? What questions do you have about what you read? Student responses could invite the Holy Ghost to help you discern how to respond to their needs. For additional training on asking questions to assess learning, see “ Always be ready to respond to spiritual promptings about the needs of learners ” in Teacher Development Skills . The king and the scroll You might summarize or read the following paragraph. Jeremiah did what the Lord commanded and asked a man named Baruch to write the Lord’s words on a scroll. Because Jeremiah was imprisoned, he asked Baruch to read the Lord’s words to the people of Judah, including several princes. After doing so, Baruch gave the scroll to the princes to read to Jehoiakim, the king of Judah (see Jeremiah 36:4–10, 14–15, 20–21 ). Read Jeremiah 36:20–24 , looking for how King Jehoiakim reacted to hearing the words on the scroll. In verse 23 , “he” refers to King Jehoiakim. Why do you think the king reacted this way? Read Jeremiah 36:25 , looking for how certain princes tried to influence the king. Invite students to imagine that they were the princes in verse 25 . Using what they have learned in class today, ask students to prepare a response to the king that would help him understand how the scriptures could bless his life. One way to do this activity is to organize the class into groups of three. Each student could represent one of the princes, with groups preparing their responses together. Then you could invite a group to come to the front of the class and role-play their interaction with the king. You might invite another student to act in the role of king or you as the teacher could play that role. You might suggest that students role-play an alternative ending to the story where the king is persuaded not to burn the scroll. What is a modern situation where the teachings from your response might help a youth? Reflect on what you have learned You could share the following statement to help students reflect on what they learned from their study of Jeremiah 36 . Elder D. Todd Christofferson of the Quorum of the Twelve Apostles taught: Through the scriptures, God does indeed “show forth his power” [see Alma 37:14 ] to save and exalt His children. By His word … He enlarges our memory, sheds light on falsehood and error, and brings us to repentance and to rejoice in Jesus Christ, our Redeemer. (“ The Blessing of Scripture ,” Ensign or Liahona , May 2010, 33) It might help to give students time to ponder or record their response to the following question before they share with the class. How might it affect your personal study to know the scriptures can help you turn to the Lord and receive His forgiveness and guidance? This could be a good opportunity for students to reflect on their personal study goals and the required reading for seminary credit. Consider inviting students to review their goals and to think about how they might focus more on turning to Jesus Christ as part of their personal scripture study.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Jeremiah 1",
      "content": "1. The words of Jeremiah the son of Hilkiah, of the priests thatwereinAnathothin the land of Benjamin:\n2. To whom the word of theLordcame in the days of Josiah the son of Amon king of Judah, in the thirteenthyearof his reign.\n3. It came also in the days of Jehoiakim the son of Josiah king of Judah, unto the end of the eleventh year of Zedekiah the son of Josiah king of Judah, unto thecarryingaway of Jerusalem captive in the fifth month.\n4. Then the word of theLordcame unto me, saying,\n5. Before Iformedthee in the belly Iknewthee; and before thou camest forth out of the womb Isanctifiedthee,andIordainedthee prophet unto thenations.\n6. Then said I, Ah, LordGod! behold, I cannotspeak: for Iamachild.\n7. But theLordsaid unto me, Say not, Iama child: for thou shalt go to all that I shallsendthee, and whatsoever Icommandthee thou shaltspeak.\n8. Be notafraidof their faces: for Iamwith thee to deliver thee, saith theLord.\n9. Then theLordput forth his hand, and touched mymouth. And theLordsaid unto me, Behold, I have put mywordsin thymouth.\n10. See, I have this daysetthee over the nations and over the kingdoms, to root out, and topulldown, and to destroy, and tothrowdown, tobuild, and to plant.\n11. Moreover the word of theLordcame unto me, saying, Jeremiah, whatseestthou? And I said, I see rod of an almond tree.\n12. Then said theLordunto me, Thou hast well seen: for I will hasten my word to perform it.\n13. And the word of theLordcame unto me the second time, saying, What seest thou? And I said, I see aseethingpot; and the face thereofistoward the north.\n14. Then theLordsaid unto me, Out of thenorthan evil shall break forth upon all the inhabitants of the land.\n15. For, lo, I will call all the families of the kingdoms of the north, saith theLord; and they shall come, andthey shall set every one his throne at the entering of thegatesof Jerusalem, and against all the walls thereof round about, and against all the cities of Judah.\n16. And I will utter my judgments against them touching all their wickedness, who haveforsakenme, and have burned incense unto othergods, and worshipped the works of their own hands.\n17. Thou therefore gird up thy loins, and arise, and speak unto them all that I command thee: be not dismayed at their faces, lest I confound thee before them.\n18. For, behold, I have made thee this day defenced city, and an iron pillar, and brasen walls against the whole land, against the kings of Judah, against theprincesthereof, against the priests thereof, and against the people of the land.\n19. And they shallfightagainst thee; but they shall notprevailagainst thee; for Iamwith thee, saith theLord, to deliver thee.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Jeremiah 2",
      "content": "1. Moreover the word of theLordcame to me, saying,\n2. Go and cry in the ears of Jerusalem, saying, Thus saith theLord; I remember thee, the kindness of thy youth, the love of thine espousals,whenthou wentest after me in the wilderness, in landthat wasnot sown.\n3. Israelwasholinessunto theLord,andthe firstfruits of his increase: all that devour him shall offend; evil shall come upon them, saith theLord.\n4. Hear ye the word of theLord, O house of Jacob, and all the families of the house of Israel:\n5. Thus saith theLord, What iniquity have your fathers found in me, that they are gone far from me, and have walked after vanity, and are become vain?\n6. Neither said they, WhereistheLordthat brought us up out of the land of Egypt, thatledus through the wilderness, through land of deserts and of pits, through land of drought, and of the shadow of death, through land that no man passed through, and where no man dwelt?\n7. And I brought you into plentiful country, to eat the fruit thereof and the goodness thereof; but when ye entered, yedefiledmyland, and made mine heritage an abomination.\n8. The priests said not, WhereistheLord? and they that handle the law knew me not: thepastorsalso transgressed against me, and theprophetsprophesied by Baal, and walked afterthings thatdo not profit.\n9. Wherefore I will yet plead with you, saith theLord, and with your childrens children will I plead.\n10. For passoverthe isles of Chittim, and see; and send unto Kedar, and consider diligently, and see if there be such thing.\n11. Hath nation changedtheirgods, whichareyet no gods? but my people have changed their glory forthat whichdoth not profit.\n12. Be astonished, O ye heavens, at this, and be horribly afraid, be ye very desolate, saith theLord.\n13. For my people have committed twoevils; they have forsaken me the fountain ofliving waters,andhewed them out cisterns, broken cisterns, that can hold no water.\n14. IsIsrael aservant?ishe homebornslave?why is he spoiled?\n15. The young lions roared upon him,andyelled, and they made his land waste: his cities are burned without inhabitant.\n16. Also the children of Noph andTahapaneshave broken the crown of thy head.\n17. Hast thou not procured this unto thyself, in that thou hastforsakentheLordthy God, when he led thee by the way?\n18. And now what hast thou to do in the way ofEgypt, to drink the waters of Sihor? or what hast thou to do in the way of Assyria, to drink the waters ofthe river?\n19. Thine own wickedness shall correct thee, and thy backslidings shallreprovethee: know therefore and see thatit isan evilthingand bitter, that thou hast forsaken theLordthy God, and that my fearisnot in thee, saith the LordGodof hosts.\n20. For of old time I have broken thy yoke,andburst thy bands; and thou saidst, I will not transgress; when upon every high hill and under every green tree thou wanderest, playing theharlot.\n21. Yet I had planted thee noblevine, wholly right seed: how then art thou turned into the degenerate plant of strange vine unto me?\n22. For though thouwashthee withnitre, and take thee much soap,yetthine iniquity is marked before me, saith the LordGod.\n23. How canst thou say, I am not polluted, I have not gone after Baalim? see thy way in the valley, know what thou hast done:thou arta swift dromedary traversing her ways;\n24. A wild ass used to the wilderness,thatsnuffeth up the wind at her pleasure; in her occasion who can turn her away? all they that seek her will not weary themselves; in her month theyshall find her.\n25. Withhold thy foot from being unshod, and thy throat from thirst: but thou saidst, There is nohope: no; for I have loved strangers, and after them will I go.\n26. As the thief isashamedwhen he is found, so is the house of Israel ashamed; they, their kings, their princes, and their priests, and their prophets,\n27. Saying toa stock, Thouartmy father; and to stone, Thou hast brought me forth: for they have turnedtheirbackunto me, and nottheirface: but in thetimeof their trouble they will say, Arise, and save us.\n28. But wherearethygodsthat thou hast made thee? let them arise, if they can save thee in the time of thy trouble: foraccording tothe number of thy cities are thy gods, O Judah.\n29. Wherefore will yepleadwith me? ye all have transgressed against me, saith theLord.\n30. In vain have I smitten your children; they received nocorrection: your own sword hath devoured your prophets, like destroying lion.\n31. O generation, see ye the word of theLord. Have I been wilderness unto Israel? land of darkness? wherefore say my people, We are lords; we will come no more unto thee?\n32. Can maid forget her ornaments,ora bride her attire? yet my people haveforgottenme days without number.\n33. Why trimmest thou thy way toseek love? therefore hast thou also taught the wickedonesthy ways.\n34. Also in thy skirts is found thebloodof the souls of the poor innocents: I have not found it by secret search, but upon allthese.\n35. Yet thou sayest, Because I aminnocent, surely his anger shall turn from me. Behold, I will plead with thee, because thou sayest, I have not sinned.\n36. Why gaddest thou about so much to change thy way? thou also shalt beashamedof Egypt, as thou wast ashamed of Assyria.\n37. Yea, thou shalt go forth from him, and thine hands upon thine head: for theLordhath rejected thy confidences, and thou shalt not prosper in them.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Jeremiah 3",
      "content": "1. They say, If manput awayhis wife, and she go from him, and become another mans, shall he return unto her again? shall not that land be greatlypolluted? but thou hast played the harlot with many lovers; yet return again to me, saith theLord.\n2. Lift up thine eyes unto the high places, and see where thou hast not been lien with. In the ways hast thou sat for them, as the Arabian in the wilderness; and thou hast polluted the land with thywhoredomsand with thy wickedness.\n3. Therefore theshowershave been withholden, and there hath been nolatterrain; and thou hadst whores forehead, thou refusedst to be ashamed.\n4. Wilt thou not from this time cry unto me, My father, thouartthe guide of my youth?\n5. Will he reservehisangerfor ever? will he keepitto the end? Behold, thou hast spoken and done evil things as thou couldest.\n6. TheLordsaid also unto me in the days of Josiah the king, Hast thou seenthatwhich backsliding Israel hath done? she is gone up upon every high mountain and under every green tree, and there hath played the harlot.\n7. And I said after she had done all thesethings,Turn thou unto me. But she returned not. And her treacheroussisterJudah sawit.\n8. And I saw, when for all the causes whereby backsliding Israel committedadulteryI had put her away, and given her bill ofdivorce; yet her treacherous sister Judah feared not, but went and played the harlot also.\n9. And it came to pass through the lightness of her whoredom, that she defiled the land, andcommittedadultery withstonesand withstocks.\n10. And yet for all this her treacherous sister Judah hath not turned unto me with her whole heart, butfeignedly, saith theLord.\n11. And theLordsaid unto me, The backsliding Israel hathjustifiedherself more than treacherous Judah.\n12. Go andproclaimthese words toward thenorth, and say,Return, thou backsliding Israel, saith theLord;andI will not cause mine anger to fall upon you: for Iammerciful, saith theLord,andI will not keepangerfor ever.\n13. Only acknowledge thine iniquity, that thou hast transgressed against theLordthy God, and hast scattered thy ways to the strangers under every green tree, and ye have notobeyedmy voice, saith theLord.\n14. Turn, O backsliding children, saith theLord; for I ammarriedunto you: and I will take you one of city, and two of family, and I willbringyou toZion:\n15. And I will give youpastorsaccording to mine heart, which shall feed you withknowledgeand understanding.\n16. And it shall come to pass, when ye be multiplied and increased in the land, in those days, saith theLord, they shall say no more, Thearkof the covenant of theLord: neither shall it come to mind: neither shall they remember it; neither shall they visitit;neither shallthatbe done any more.\n17. At that time they shall callJerusalemthe throne of theLord; and all thenationsshall begatheredunto it, to the name of theLord, to Jerusalem: neither shall they walk any more after theimaginationof their evil heart.\n18. In those days thehouseof Judah shall walk with the house of Israel, and they shall come together out of thelandof thenorthto the land that I have given for an inheritance unto your fathers.\n19. But I said, How shall I put thee among the children, and give thee pleasant land, goodly heritage of the hosts of nations? and I said, Thou shalt call me, My father; and shalt not turn away from me.\n20. Surelyasa wife treacherouslydepartethfrom her husband, so have ye dealt treacherously with me, O house of Israel, saith theLord.\n21. A voice was heard upon the high places, weepingandsupplications of the children of Israel: for they have perverted their way,andthey have forgotten theLordtheir God.\n22. Return, ye backsliding children,andI willhealyour backslidings. Behold, we come unto thee; for thouarttheLordour God.\n23. Truly in vainis salvation hoped forfrom the hills,and fromthe multitude of mountains: truly in theLordour Godisthe salvation of Israel.\n24. For shame hath devoured the labour of our fathers from our youth; their flocks and their herds, their sons and their daughters.\n25. We lie down in ourshame, and our confusion covereth us: for we havesinnedagainst theLordour God, we and our fathers, from our youth even unto this day, and have not obeyed the voice of theLordour God.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Jeremiah": {
      "1": {
        "verses": {
          "1": {
            "text": "The words of Jeremiah the son of Hilkiah, of the priests thatwereinAnathothin the land of Benjamin:",
            "citation": "(Jeremiah 1:1)"
          },
          "2": {
            "text": "To whom the word of theLordcame in the days of Josiah the son of Amon king of Judah, in the thirteenthyearof his reign.",
            "citation": "(Jeremiah 1:2)"
          },
          "3": {
            "text": "It came also in the days of Jehoiakim the son of Josiah king of Judah, unto the end of the eleventh year of Zedekiah the son of Josiah king of Judah, unto thecarryingaway of Jerusalem captive in the fifth month.",
            "citation": "(Jeremiah 1:3)"
          },
          "4": {
            "text": "Then the word of theLordcame unto me, saying,",
            "citation": "(Jeremiah 1:4)"
          },
          "5": {
            "text": "Before Iformedthee in the belly Iknewthee; and before thou camest forth out of the womb Isanctifiedthee,andIordainedthee prophet unto thenations.",
            "citation": "(Jeremiah 1:5)"
          },
          "6": {
            "text": "Then said I, Ah, LordGod! behold, I cannotspeak: for Iamachild.",
            "citation": "(Jeremiah 1:6)"
          },
          "7": {
            "text": "But theLordsaid unto me, Say not, Iama child: for thou shalt go to all that I shallsendthee, and whatsoever Icommandthee thou shaltspeak.",
            "citation": "(Jeremiah 1:7)"
          },
          "8": {
            "text": "Be notafraidof their faces: for Iamwith thee to deliver thee, saith theLord.",
            "citation": "(Jeremiah 1:8)"
          },
          "9": {
            "text": "Then theLordput forth his hand, and touched mymouth. And theLordsaid unto me, Behold, I have put mywordsin thymouth.",
            "citation": "(Jeremiah 1:9)"
          },
          "10": {
            "text": "See, I have this daysetthee over the nations and over the kingdoms, to root out, and topulldown, and to destroy, and tothrowdown, tobuild, and to plant.",
            "citation": "(Jeremiah 1:10)"
          },
          "11": {
            "text": "Moreover the word of theLordcame unto me, saying, Jeremiah, whatseestthou? And I said, I see rod of an almond tree.",
            "citation": "(Jeremiah 1:11)"
          },
          "12": {
            "text": "Then said theLordunto me, Thou hast well seen: for I will hasten my word to perform it.",
            "citation": "(Jeremiah 1:12)"
          },
          "13": {
            "text": "And the word of theLordcame unto me the second time, saying, What seest thou? And I said, I see aseethingpot; and the face thereofistoward the north.",
            "citation": "(Jeremiah 1:13)"
          },
          "14": {
            "text": "Then theLordsaid unto me, Out of thenorthan evil shall break forth upon all the inhabitants of the land.",
            "citation": "(Jeremiah 1:14)"
          },
          "15": {
            "text": "For, lo, I will call all the families of the kingdoms of the north, saith theLord; and they shall come, andthey shall set every one his throne at the entering of thegatesof Jerusalem, and against all the walls thereof round about, and against all the cities of Judah.",
            "citation": "(Jeremiah 1:15)"
          },
          "16": {
            "text": "And I will utter my judgments against them touching all their wickedness, who haveforsakenme, and have burned incense unto othergods, and worshipped the works of their own hands.",
            "citation": "(Jeremiah 1:16)"
          },
          "17": {
            "text": "Thou therefore gird up thy loins, and arise, and speak unto them all that I command thee: be not dismayed at their faces, lest I confound thee before them.",
            "citation": "(Jeremiah 1:17)"
          },
          "18": {
            "text": "For, behold, I have made thee this day defenced city, and an iron pillar, and brasen walls against the whole land, against the kings of Judah, against theprincesthereof, against the priests thereof, and against the people of the land.",
            "citation": "(Jeremiah 1:18)"
          },
          "19": {
            "text": "And they shallfightagainst thee; but they shall notprevailagainst thee; for Iamwith thee, saith theLord, to deliver thee.",
            "citation": "(Jeremiah 1:19)"
          }
        }
      },
      "2": {
        "verses": {
          "1": {
            "text": "Moreover the word of theLordcame to me, saying,",
            "citation": "(Jeremiah 2:1)"
          },
          "2": {
            "text": "Go and cry in the ears of Jerusalem, saying, Thus saith theLord; I remember thee, the kindness of thy youth, the love of thine espousals,whenthou wentest after me in the wilderness, in landthat wasnot sown.",
            "citation": "(Jeremiah 2:2)"
          },
          "3": {
            "text": "Israelwasholinessunto theLord,andthe firstfruits of his increase: all that devour him shall offend; evil shall come upon them, saith theLord.",
            "citation": "(Jeremiah 2:3)"
          },
          "4": {
            "text": "Hear ye the word of theLord, O house of Jacob, and all the families of the house of Israel:",
            "citation": "(Jeremiah 2:4)"
          },
          "5": {
            "text": "Thus saith theLord, What iniquity have your fathers found in me, that they are gone far from me, and have walked after vanity, and are become vain?",
            "citation": "(Jeremiah 2:5)"
          },
          "6": {
            "text": "Neither said they, WhereistheLordthat brought us up out of the land of Egypt, thatledus through the wilderness, through land of deserts and of pits, through land of drought, and of the shadow of death, through land that no man passed through, and where no man dwelt?",
            "citation": "(Jeremiah 2:6)"
          },
          "7": {
            "text": "And I brought you into plentiful country, to eat the fruit thereof and the goodness thereof; but when ye entered, yedefiledmyland, and made mine heritage an abomination.",
            "citation": "(Jeremiah 2:7)"
          },
          "8": {
            "text": "The priests said not, WhereistheLord? and they that handle the law knew me not: thepastorsalso transgressed against me, and theprophetsprophesied by Baal, and walked afterthings thatdo not profit.",
            "citation": "(Jeremiah 2:8)"
          },
          "9": {
            "text": "Wherefore I will yet plead with you, saith theLord, and with your childrens children will I plead.",
            "citation": "(Jeremiah 2:9)"
          },
          "10": {
            "text": "For passoverthe isles of Chittim, and see; and send unto Kedar, and consider diligently, and see if there be such thing.",
            "citation": "(Jeremiah 2:10)"
          },
          "11": {
            "text": "Hath nation changedtheirgods, whichareyet no gods? but my people have changed their glory forthat whichdoth not profit.",
            "citation": "(Jeremiah 2:11)"
          },
          "12": {
            "text": "Be astonished, O ye heavens, at this, and be horribly afraid, be ye very desolate, saith theLord.",
            "citation": "(Jeremiah 2:12)"
          },
          "13": {
            "text": "For my people have committed twoevils; they have forsaken me the fountain ofliving waters,andhewed them out cisterns, broken cisterns, that can hold no water.",
            "citation": "(Jeremiah 2:13)"
          },
          "14": {
            "text": "IsIsrael aservant?ishe homebornslave?why is he spoiled?",
            "citation": "(Jeremiah 2:14)"
          },
          "15": {
            "text": "The young lions roared upon him,andyelled, and they made his land waste: his cities are burned without inhabitant.",
            "citation": "(Jeremiah 2:15)"
          },
          "16": {
            "text": "Also the children of Noph andTahapaneshave broken the crown of thy head.",
            "citation": "(Jeremiah 2:16)"
          },
          "17": {
            "text": "Hast thou not procured this unto thyself, in that thou hastforsakentheLordthy God, when he led thee by the way?",
            "citation": "(Jeremiah 2:17)"
          },
          "18": {
            "text": "And now what hast thou to do in the way ofEgypt, to drink the waters of Sihor? or what hast thou to do in the way of Assyria, to drink the waters ofthe river?",
            "citation": "(Jeremiah 2:18)"
          },
          "19": {
            "text": "Thine own wickedness shall correct thee, and thy backslidings shallreprovethee: know therefore and see thatit isan evilthingand bitter, that thou hast forsaken theLordthy God, and that my fearisnot in thee, saith the LordGodof hosts.",
            "citation": "(Jeremiah 2:19)"
          },
          "20": {
            "text": "For of old time I have broken thy yoke,andburst thy bands; and thou saidst, I will not transgress; when upon every high hill and under every green tree thou wanderest, playing theharlot.",
            "citation": "(Jeremiah 2:20)"
          },
          "21": {
            "text": "Yet I had planted thee noblevine, wholly right seed: how then art thou turned into the degenerate plant of strange vine unto me?",
            "citation": "(Jeremiah 2:21)"
          },
          "22": {
            "text": "For though thouwashthee withnitre, and take thee much soap,yetthine iniquity is marked before me, saith the LordGod.",
            "citation": "(Jeremiah 2:22)"
          },
          "23": {
            "text": "How canst thou say, I am not polluted, I have not gone after Baalim? see thy way in the valley, know what thou hast done:thou arta swift dromedary traversing her ways;",
            "citation": "(Jeremiah 2:23)"
          },
          "24": {
            "text": "A wild ass used to the wilderness,thatsnuffeth up the wind at her pleasure; in her occasion who can turn her away? all they that seek her will not weary themselves; in her month theyshall find her.",
            "citation": "(Jeremiah 2:24)"
          },
          "25": {
            "text": "Withhold thy foot from being unshod, and thy throat from thirst: but thou saidst, There is nohope: no; for I have loved strangers, and after them will I go.",
            "citation": "(Jeremiah 2:25)"
          },
          "26": {
            "text": "As the thief isashamedwhen he is found, so is the house of Israel ashamed; they, their kings, their princes, and their priests, and their prophets,",
            "citation": "(Jeremiah 2:26)"
          },
          "27": {
            "text": "Saying toa stock, Thouartmy father; and to stone, Thou hast brought me forth: for they have turnedtheirbackunto me, and nottheirface: but in thetimeof their trouble they will say, Arise, and save us.",
            "citation": "(Jeremiah 2:27)"
          },
          "28": {
            "text": "But wherearethygodsthat thou hast made thee? let them arise, if they can save thee in the time of thy trouble: foraccording tothe number of thy cities are thy gods, O Judah.",
            "citation": "(Jeremiah 2:28)"
          },
          "29": {
            "text": "Wherefore will yepleadwith me? ye all have transgressed against me, saith theLord.",
            "citation": "(Jeremiah 2:29)"
          },
          "30": {
            "text": "In vain have I smitten your children; they received nocorrection: your own sword hath devoured your prophets, like destroying lion.",
            "citation": "(Jeremiah 2:30)"
          },
          "31": {
            "text": "O generation, see ye the word of theLord. Have I been wilderness unto Israel? land of darkness? wherefore say my people, We are lords; we will come no more unto thee?",
            "citation": "(Jeremiah 2:31)"
          },
          "32": {
            "text": "Can maid forget her ornaments,ora bride her attire? yet my people haveforgottenme days without number.",
            "citation": "(Jeremiah 2:32)"
          },
          "33": {
            "text": "Why trimmest thou thy way toseek love? therefore hast thou also taught the wickedonesthy ways.",
            "citation": "(Jeremiah 2:33)"
          },
          "34": {
            "text": "Also in thy skirts is found thebloodof the souls of the poor innocents: I have not found it by secret search, but upon allthese.",
            "citation": "(Jeremiah 2:34)"
          },
          "35": {
            "text": "Yet thou sayest, Because I aminnocent, surely his anger shall turn from me. Behold, I will plead with thee, because thou sayest, I have not sinned.",
            "citation": "(Jeremiah 2:35)"
          },
          "36": {
            "text": "Why gaddest thou about so much to change thy way? thou also shalt beashamedof Egypt, as thou wast ashamed of Assyria.",
            "citation": "(Jeremiah 2:36)"
          },
          "37": {
            "text": "Yea, thou shalt go forth from him, and thine hands upon thine head: for theLordhath rejected thy confidences, and thou shalt not prosper in them.",
            "citation": "(Jeremiah 2:37)"
          }
        }
      },
      "3": {
        "verses": {
          "1": {
            "text": "They say, If manput awayhis wife, and she go from him, and become another mans, shall he return unto her again? shall not that land be greatlypolluted? but thou hast played the harlot with many lovers; yet return again to me, saith theLord.",
            "citation": "(Jeremiah 3:1)"
          },
          "2": {
            "text": "Lift up thine eyes unto the high places, and see where thou hast not been lien with. In the ways hast thou sat for them, as the Arabian in the wilderness; and thou hast polluted the land with thywhoredomsand with thy wickedness.",
            "citation": "(Jeremiah 3:2)"
          },
          "3": {
            "text": "Therefore theshowershave been withholden, and there hath been nolatterrain; and thou hadst whores forehead, thou refusedst to be ashamed.",
            "citation": "(Jeremiah 3:3)"
          },
          "4": {
            "text": "Wilt thou not from this time cry unto me, My father, thouartthe guide of my youth?",
            "citation": "(Jeremiah 3:4)"
          },
          "5": {
            "text": "Will he reservehisangerfor ever? will he keepitto the end? Behold, thou hast spoken and done evil things as thou couldest.",
            "citation": "(Jeremiah 3:5)"
          },
          "6": {
            "text": "TheLordsaid also unto me in the days of Josiah the king, Hast thou seenthatwhich backsliding Israel hath done? she is gone up upon every high mountain and under every green tree, and there hath played the harlot.",
            "citation": "(Jeremiah 3:6)"
          },
          "7": {
            "text": "And I said after she had done all thesethings,Turn thou unto me. But she returned not. And her treacheroussisterJudah sawit.",
            "citation": "(Jeremiah 3:7)"
          },
          "8": {
            "text": "And I saw, when for all the causes whereby backsliding Israel committedadulteryI had put her away, and given her bill ofdivorce; yet her treacherous sister Judah feared not, but went and played the harlot also.",
            "citation": "(Jeremiah 3:8)"
          },
          "9": {
            "text": "And it came to pass through the lightness of her whoredom, that she defiled the land, andcommittedadultery withstonesand withstocks.",
            "citation": "(Jeremiah 3:9)"
          },
          "10": {
            "text": "And yet for all this her treacherous sister Judah hath not turned unto me with her whole heart, butfeignedly, saith theLord.",
            "citation": "(Jeremiah 3:10)"
          },
          "11": {
            "text": "And theLordsaid unto me, The backsliding Israel hathjustifiedherself more than treacherous Judah.",
            "citation": "(Jeremiah 3:11)"
          },
          "12": {
            "text": "Go andproclaimthese words toward thenorth, and say,Return, thou backsliding Israel, saith theLord;andI will not cause mine anger to fall upon you: for Iammerciful, saith theLord,andI will not keepangerfor ever.",
            "citation": "(Jeremiah 3:12)"
          },
          "13": {
            "text": "Only acknowledge thine iniquity, that thou hast transgressed against theLordthy God, and hast scattered thy ways to the strangers under every green tree, and ye have notobeyedmy voice, saith theLord.",
            "citation": "(Jeremiah 3:13)"
          },
          "14": {
            "text": "Turn, O backsliding children, saith theLord; for I ammarriedunto you: and I will take you one of city, and two of family, and I willbringyou toZion:",
            "citation": "(Jeremiah 3:14)"
          },
          "15": {
            "text": "And I will give youpastorsaccording to mine heart, which shall feed you withknowledgeand understanding.",
            "citation": "(Jeremiah 3:15)"
          },
          "16": {
            "text": "And it shall come to pass, when ye be multiplied and increased in the land, in those days, saith theLord, they shall say no more, Thearkof the covenant of theLord: neither shall it come to mind: neither shall they remember it; neither shall they visitit;neither shallthatbe done any more.",
            "citation": "(Jeremiah 3:16)"
          },
          "17": {
            "text": "At that time they shall callJerusalemthe throne of theLord; and all thenationsshall begatheredunto it, to the name of theLord, to Jerusalem: neither shall they walk any more after theimaginationof their evil heart.",
            "citation": "(Jeremiah 3:17)"
          },
          "18": {
            "text": "In those days thehouseof Judah shall walk with the house of Israel, and they shall come together out of thelandof thenorthto the land that I have given for an inheritance unto your fathers.",
            "citation": "(Jeremiah 3:18)"
          },
          "19": {
            "text": "But I said, How shall I put thee among the children, and give thee pleasant land, goodly heritage of the hosts of nations? and I said, Thou shalt call me, My father; and shalt not turn away from me.",
            "citation": "(Jeremiah 3:19)"
          },
          "20": {
            "text": "Surelyasa wife treacherouslydepartethfrom her husband, so have ye dealt treacherously with me, O house of Israel, saith theLord.",
            "citation": "(Jeremiah 3:20)"
          },
          "21": {
            "text": "A voice was heard upon the high places, weepingandsupplications of the children of Israel: for they have perverted their way,andthey have forgotten theLordtheir God.",
            "citation": "(Jeremiah 3:21)"
          },
          "22": {
            "text": "Return, ye backsliding children,andI willhealyour backslidings. Behold, we come unto thee; for thouarttheLordour God.",
            "citation": "(Jeremiah 3:22)"
          },
          "23": {
            "text": "Truly in vainis salvation hoped forfrom the hills,and fromthe multitude of mountains: truly in theLordour Godisthe salvation of Israel.",
            "citation": "(Jeremiah 3:23)"
          },
          "24": {
            "text": "For shame hath devoured the labour of our fathers from our youth; their flocks and their herds, their sons and their daughters.",
            "citation": "(Jeremiah 3:24)"
          },
          "25": {
            "text": "We lie down in ourshame, and our confusion covereth us: for we havesinnedagainst theLordour God, we and our fathers, from our youth even unto this day, and have not obeyed the voice of theLordour God.",
            "citation": "(Jeremiah 3:25)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 55263,
  "total_sources": 5,
  "generated_at": "2025-12-14T04:01:27.397917"
}