{
  "week_number": 4,
  "date_range": "Genesis 3–4",
  "title": ";Moses 4–5",
  "primary_scriptures": [
    {
      "book": "Moses",
      "chapters": [
        "4",
        "5"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    }
  ],
  "all_content": "\n\n--- CFM: ;Moses 4–5 ---\nAt first, the story of the Fall of Adam and Eve might seem like a tragedy. Adam and Eve were cast out of the beautiful Garden of Eden. They were sent into a world of pain, sorrow, and death (see\nGenesis 3:16–19\n). And they were separated from their Heavenly Father. But the truths restored through the Prophet Joseph Smith in the book of Moses give us a unique perspective on the Fall.\nYes, the Garden of Eden was beautiful. But Adam and Eve needed more than beautiful surroundings. They needed—and we all need—an opportunity to grow. Leaving the Garden of Eden was the necessary first step toward returning to God and eventually becoming like Him. That meant facing opposition, making choices, making mistakes, learning to repent, and trusting the Savior, whose Atonement makes possible progression and “the joy of our redemption” (\nMoses 5:11\n). So when you read about the Fall of Adam and Eve, focus not on the seeming tragedy but on the possibilities—not on the paradise Adam and Eve lost but on the glory their choice allows us to receive.\nIdeas for Learning at Home and at Church\nGenesis 3\n;\nMoses 4\nThe Fall was a necessary part of God’s plan.\nIt’s true that Adam and Eve’s choice led to many of the difficulties we experience in mortality. But that doesn’t mean we regret their choice. As you read\nGenesis 3\nand\nMoses 4\n, you might ask yourself, why was the Fall important to God’s plan?\nAccording to\nMoses 5:9–12\n, how did Adam and Eve feel about the Fall? How can you apply their words to your experiences in this fallen world? What else do you learn from\n2 Nephi 2:19–25\n?\nSee also\nMosiah 3:19\n;\nAlma 12:21–37\n; and\nDoctrine and Covenants 29:39–43\n.\nLeaving Eden\n, by Annie Henrie Nader\nGenesis 3:1–7\n;\nMoses 4:22–31\n;\n5:4–15\nJesus Christ offers hope and redemption.\nAdam and Eve’s story is one of hope and redemption through Jesus Christ. To see why, you might start by searching for the results of the Fall in\nGenesis 3:1–7\n;\nMoses 4:22–31\nand marking or listing what you find. How do these results affect you? Then you could search\nMoses 5:4–15\n, looking for God’s plan to redeem us from these effects. Why were Adam and Eve “glad” after the angel visited them? What do you learn from them about Heavenly Father’s plan?\nSee also “Because of Him” (video), Gospel Library.\n2:44\nBecause of Him\nGenesis 3:16\n;\nMoses 4:22\nWhat does it mean that Adam was to “rule over” Eve?\nThis passage of scripture has sometimes been misunderstood to mean that a husband is justified in treating his wife unkindly. In our day, the Lord’s prophets have taught that a husband and wife should see each other as equal partners in fulfilling their divine responsibilities in the family (see “\nThe Family: A Proclamation to the World\n” [Gospel Library]). Elder Dale G. Renlund and Sister Ruth Lybbert Renlund explained that a righteous husband “will seek to minister; he will acknowledge error and seek forgiveness; he will be quick to offer praise; he will be considerate of family members’ preferences; he will feel the great weight of responsibility to provide ‘the necessities of life and protection’ for his family; he will treat his wife with the utmost respect and deference. … He will bless his family” (\nThe Melchizedek Priesthood: Understanding the Doctrine, Living the Principles\n[2018], 23).\nTo learn more about how the Lord views the relationship between husbands and wives, ponder the counsel of Elder Ulisses Soares in the following video. How would you explain, in your own words, what it means for husband wife to be “equal partners”?\n3:33\nEqual Partnership in Marriage\nMoses 4:1–4\nI need agency and opposition to grow.\nElder Dale G. Renlund taught, “Our Heavenly Father’s goal in parenting is not to have His children\ndo\nwhat is right; it is to have His children\nchoose\nto do what is right and ultimately become like Him” (“\nChoose You This Day\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 104). Why is it so important in Heavenly Father’s plan that we\nchoose\nto do what is right?\nAs you read\nMoses 4:1–4\n, look for what Heavenly Father and Jesus Christ did to protect your right to choose—your agency. How can you access their protecting power? For ideas, consider studying the section “\nMake inspired choices\n” in\nFor the Strength of Youth: A Guide for Making Choices\n(4–5).\nConsider also reading what Lehi taught about agency in\n2 Nephi 2:11–20, 25–30\n. Why is opposition necessary for agency? How can you show your appreciation to Jesus Christ for making you “free to choose”? (\n2 Nephi 2:27\n).\nSee also Dallin H. Oaks, “\nOpposition in All Things\n,”\nEnsign\nor\nLiahona\n, May 2016, 114–17; Topics and Questions, “\nAgency\n,” Gospel Library; “\nChoose the Right\n,”\nHymns\n, no. 239.\nIncrease participation.\nMany learning activities can be done as an individual, family, or class; in small groups; or in pairs. Use a variety of methods to allow people to participate who might not otherwise have a chance. For this activity, you could invite one person or group to read\nMoses 4\nand the\nFor the Strength of Youth\nguide while another group studies the verses in\n2 Nephi 2\n. They could then teach each other what they learned in their respective section.\nMoses 4:4–12\n;\n5:13–33\nSatan seeks “to deceive and to blind” me.\nAs you read\nMoses 4:4–12\n;\n5:13–33\n, consider listing ways that Satan tried to tempt Adam and Eve and their children. How does he attempt these same things today? How does Heavenly Father help you resist Satan’s deceptions?\nMoses 4:13–16, 27\n“I, the Lord God … clothed them.”\nAfter partaking of the forbidden fruit, Adam and Eve tried to cover their own nakedness. Later, the Lord offered to clothe them. As you read\nMoses 4:13–16, 27\n, consider the following:\nPonder what nakedness and clothing can represent in the scriptures (see, for example,\nRevelation 7:9, 13–15\n;\n2 Nephi 9:14\n;\nDoctrine and Covenants 109:22–26, 76\n). What do you learn from Adam and Eve’s experience with nakedness and clothing?\nIf you have been endowed in the temple, consider what Adam and Eve might say to you about the significance of your temple garment and what it represents.\nSee also “Sacred Temple Clothing” (video), Gospel Library.\n4:12\nSacred Temple Clothing\nMoses 5:4–9, 16–26\nGod will accept my sacrifices if I offer them with a willing and obedient heart.\nAs you study\nMoses 5:4–9, 16–26\n, consider the attitudes of Adam and Eve and their sons Cain and Abel toward sacrifice. Why did the Lord accept Abel’s sacrifice but not Cain’s?\nWhat does the Lord ask you to sacrifice? Is there anything in these verses that shapes the way you think about those sacrifices?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nDid God give Adam and Eve conflicting commandments in the Garden of Eden?\nWas it a sin for Adam and Eve to partake of the forbidden fruit?\nWhat do we know about the curse and mark placed upon Cain?\nClick to see more.\nIdeas for Teaching Children\nGenesis 3\n;\nMoses 4\n;\n5:8–15\nJesus Christ saves us from the Fall.\nTo help your children better understand the Fall of Adam and Eve, you could copy the pictures from “\nAdam and Eve\n” (in\nOld Testament Stories\n, 13–16) and cut them out. Then you could work together to put the pictures in order as you discuss the experiences of Adam and Eve. As you do, talk about why it was important, in Heavenly Father’s plan, for Adam and Eve to leave the Garden of Eden.\nYour children can feel gratitude for the Atonement of Jesus Christ as they understand how He overcomes the effects of the Fall. As you read together\nMoses 4:25\n;\n6:48\n;\nRomans 5:12\n;\n2 Nephi 2:22–23\n, help your children find ways to complete this sentence: “Because of the Fall, I …” Then, as you read together\nMoses 5:8–11, 14–15\n;\n6:59\n;\nAlma 11:42\n, they could complete this sentence: “Because of Jesus Christ, I …” Share with each other your gratitude for Jesus Christ.\nMoses 4:1–4\nI can choose the right.\nConsider a simple object lesson to introduce the principle of agency: invite your children to color this week’s activity page, but give them only one color to use. Why would it be better to have choices? You could then read together\nMoses 4:1–4\nand talk about why God wants us to be able to choose between right and wrong. How do Heavenly Father and Jesus Christ help us make good choices?\nHelp your children think of and draw pictures of good choices they can make to follow Jesus Christ. Or you could sing together a song about making good choices, such as “\nChoose the Right Way\n” (\nChildren’s Songbook\n, 160–61). You might tell each other about a time when you made a good choice and talk about how you felt afterward.\nThe Fall\n, by Robert T. Barrett\nMoses 5:4, 8\nI can pray to Heavenly Father.\nWhen Adam and Eve had to leave the Garden of Eden, they couldn’t be with Heavenly Father anymore. Read\nMoses 5:4, 8\nwith your children, and help them find what Adam and Eve did to feel near to Him and hear Him. What are some things we can say to Heavenly Father in our prayers?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 4: Lesson 10: Lesson 10—Moses 4:1–4This lesson can help students desire to follow Jesus Christ’s example of obeying Heavenly Father.; Lesson 11: Lesson 11—Moses 4:5–32; 5:1–15 Part 1This lesson is intended to help students understand the effects of the Fall in Heavenly Father’s plan and in their own lives.... ---\n\n--- Lesson 10 ---\nIn the premortal life, Heavenly Father chose Jesus Christ to be the Savior in His plan. Jesus Christ consistently obeys Heavenly Father’s will, even when it is hard. This lesson can help students desire to follow Jesus Christ’s example of obeying Heavenly Father. Student preparation: Invite students to think about people they know whose examples inspire them to be more obedient to Heavenly Father. Ask them to come prepared to share. Possible Learning Activities Doing Heavenly Father’s will To begin class, consider sharing a time when a teenager was asked by Heavenly Father to do something difficult. This could be a personal experience or one you’ve heard about. The following story is one example that you could use. Encourage students to think about times when they may have had similar feelings. Brother M. Joseph Brough, formerly of the Young Men General Presidency, shared the following story about his daughter: 9:52 Young people, God requires hard things of you. One 14-year-old young woman participated in competitive basketball. She dreamed of playing high school basketball like her older sister. She then learned that her parents had been called to preside over a mission in Guatemala. Upon arrival, she discovered that a couple of her classes would be in Spanish, a language she did not yet speak. There was not a single girls’ sports team at her school. She lived on the 14th floor of a building with tight security. And to top it all off, she could not go outside alone for safety reasons. Her parents listened to her cry herself to sleep every night for months. (“ Lift Up Your Head and Rejoice ,” Ensign or Liahona , Nov. 2018, 14) If you were in this young woman’s situation, what would have been most difficult for you? Reflect on the following questions: What is a hard thing that God has required or may require of you? How willing are you to do this hard thing? Why? What do you want to learn or feel in this lesson that could help you be more willing to do what God asks? As students study Moses 4:1–4 , they will learn about Jesus Christ and His willingness to do the hard things Heavenly Father asks. Encourage students to seek the help of the Holy Ghost to know how the Savior’s example can help them with hard things God may ask them to do. The character of Christ You may want to explain the information in the following paragraph to help students understand the context of the passage they will be studying today. We lived in the premortal life with our Heavenly Father. While there, we were taught His plan to help us become like Him. Moses 4:1–4 contains an account of the Council in Heaven when Jesus Christ was chosen to be our Savior. In these verses, we see the character of Jesus Christ and Satan as they each respond to Heavenly Father’s will in different ways. You might consider making a simple chart like the following on the board to help students clearly see differences between Jesus Christ and Satan. Jesus Christ Satan Read Moses 4:1–4 , looking for what you can learn about the motives and attitudes of Jesus Christ and Satan. Invite students to write their insights on the board and discuss what they have learned. (Students might mention how many times Satan uses the word “I” and his desire to receive honor. In contrast, they might notice the Savior’s use of the word “thy” and His desire for the glory to be the Father’s. Students might notice how Satan “rebelled against” the Father and “sought to destroy the agency of man.” In contrast, they might point out the Savior’s desire to obey the Father’s will and accept the Father’s plan.) What do these verses teach you about the relationship between Jesus Christ and His Father? One truth that students might identify during the discussion is Jesus Christ humbly obeys our Father in Heaven . The following accounts about the Savior can help students learn from His example. Help students understand that learning more about the Savior’s obedience to the Father, even when it was hard, can increase our desire to follow His example. Read the following accounts, looking for Jesus Christ’s constant desire to obey Heavenly Father, even when it was hard. Luke 2:49 (as a 12-year-old) John 8:28–29 (as an adult) Matthew 26:36–39 (in the Garden of Gethsemane) 3 Nephi 11:10–11 (as a resurrected being) Discuss with the students what they are learning about Jesus Christ from these examples. Then invite them to share other examples from the Savior’s life when He humbly obeyed the Father’s will. Invite students to recall the hard thing in their lives they thought about at the beginning of class. To help them connect what they are learning about Jesus Christ to their lives, ask questions like the following: What did Jesus Christ say or do that could inspire someone to choose to obey Heavenly Father, even when it is difficult? Who do you know who is a good example of obeying Heavenly Father’s will? What have you learned from their example? What motivates you to obey Heavenly Father’s will, even when it is hard? Following Christ’s example The young woman from the story at the beginning of the lesson is Brother Brough’s daughter. If you shared his daughter’s story, tell students that she valiantly faced the three years her parents served as mission leaders in Guatemala. Share the following continuation of her story, inviting students to look for Christlike attributes they see in her example. If you shared a different story at the beginning of class, consider sharing a follow-up, such as the story’s conclusion or another experience in the same person’s life. Invite students to look for Christlike attributes in that person. Brother Brough continued: 9:52 At the conclusion of our mission, I asked my daughter if she was going to serve a full-time mission. Her answer was “No, Dad, I have already served.” I was just fine with that! But about six months later, the Spirit awoke me in the night with this thought: “I have called your daughter to serve a mission.” My reaction was “Heavenly Father, she has given so much.” I was quickly corrected by the Spirit and came to understand that her missionary service was required of the Lord. I soon took my daughter to lunch. From across the table, I said, “Ganzie, do you know why we are here?” She said, “Yes, Dad. You know I have to serve a mission. I do not want to go, but I am going.” Because she gave her will to Heavenly Father, she served Him with all of her heart, might, mind, and strength. She has taught her father how to do a hard thing. (“ Lift Up Your Head and Rejoice ,” Ensign or Liahona , Nov. 2018, 14) Think about the verses you read about Jesus Christ today. How did this young woman follow His example? Asking open-ended questions can help your students discover and apply gospel truths to their personal circumstances. Consider using questions like the following to allow students to express what they learned and how they can apply it to their lives. (For additional training on this, see “ Learn the doctrine of Jesus Christ for yourself ” in Teacher Development Skills .) In your study journal, write a response to the following two questions, paying attention to thoughts or impressions from the Spirit: What have you learned today about Jesus Christ that can help you obey Heavenly Father, even when He asks you to do hard things? What do you feel impressed to do because of what you have learned or felt today? Testify of Jesus Christ’s example and His ability to help us do what God has asked.\n\n\n--- Lesson 11 ---\nWhether we realize it or not, the Fall of Adam and Eve directly affects all of us each day. In fact, without it, we would not have even been born. This lesson is intended to help students understand the effects of the Fall in Heavenly Father’s plan and in their own lives. Student preparation: Invite students to memorize the doctrinal mastery passage 2 Nephi 2:25 and to ask a parent or Church leader what it means to them. Possible Learning Activities Good or bad? To begin the lesson, help students think of how some difficult things can be blessings in God’s plan. One way to do this is to use the following scale. You might choose to show pictures that depict the words students will be ranking. On a scale of 1–10 (1 = bad, 10 = good), how do you think most people would rank the following things? Hard work Trials Sorrow Death Viewing these from the eternal perspective of Heavenly Father’s plan, would you rank any of these differently? If so, why? Consider displaying an image of Adam and Eve like the one at the beginning of this lesson. You may want to leave it up for the remainder of the lesson. Many of the hardships we face in life come as a result of a choice made by our first parents, Adam and Eve. How do you think many people would rank the Fall of Adam and Eve on the scale of 1–10? Why? Ponder how well you understand the Fall of Adam and Eve and its significance in your life. Answer the following questions in your study journal: Do you feel the Fall was good or bad? How can your understanding of the Atonement of Jesus Christ affect your answer? As you study Moses 4–5 today, seek inspiration from the Holy Ghost to help you better understand the Fall of Adam and Eve. The Holy Ghost can help you see that the Fall was part of Heavenly Father’s plan to help us progress and become more like Him. The effects of the Fall Invite students to summarize what they know about the Garden of Eden and the Fall of Adam and Eve. If they need help, invite them to search 2 Nephi 2:22–23 ; Moses 3:16–17 ; 4:6–12 , looking for details. You could also summarize by showing the Old Testament Scripture Stories video “ Adam and Eve ” (1:53), located on ChurchofJesusChrist.org . 1:53 Then help students learn about the effects of the Fall on Adam, Eve, and their posterity. To help students organize what they learn, provide them with paper and display the following instructions. You could invite students to work together in pairs to complete this activity. ( Note : Lesson 21: “ Assess Your Learning 1 ” suggests that students refer to the pamphlets they create in this activity to help them explain the effects of the Fall.) Consider limiting the amount of time students take in creating their pamphlets so they will have time to experience the rest of the lesson. To help you organize what you learn about the Fall, create a pamphlet using the following instructions. Imagine you will use this pamphlet to teach others about the Fall and why it was essential in Heavenly Father’s plan. Be creative in personalizing your pamphlet. Fold the paper in half. Create a cover page with a title such as “The Fall in Heavenly Father’s Plan.” Add a drawing or picture that reminds you of the Fall, such as a fruit tree or a piece of fruit. Inside the pamphlet, title the left page “Effects of the Fall.” Study Moses 4:13–16, 22–25, 28–29 ; 5:1–4 . List or draw pictures of the effects of the Fall on God’s children. Include in your pamphlet the verses where you learned about each effect. After sufficient time, invite a few students to share their pamphlets with the class. Invite students to add to their pamphlets anything they missed. Be sure students list that Adam and Eve and their posterity would now: Feel unprepared to be in God’s presence ( Moses 4:13–16 ). Be able to have children ( Moses 4:22 ; 5:2–3 ). Experience sorrow, pain, and difficulty ( Moses 4:22–24 ). Need to work hard to live ( Moses 4:25 ; 5:1–3 ). Know good from evil ( Moses 4:28 ). Physically die ( Moses 4:25 ). Be separated from God’s presence (spiritual death) ( Moses 5:4 ). Explain that separation from God is called “spiritual death”—something we all experience. Ponder how specific effects of the Fall can help us progress toward “immortality and eternal life” ( Moses 1:39 ). How does God allowing Adam and Eve to fall show His wisdom and love for His children? Ponder which effects of the Fall you find most difficult in your life. Explain to students that they will finish their pamphlets during the next lesson as they study about the Savior’s role in overcoming the negative effects of the Fall. The essential role of the Fall The Book of Mormon prophet Lehi explained the significance of the Fall. Study 2 Nephi 2:22–25 , looking for why the Fall was a good thing. What did you learn about the Fall? Students may mention a number of truths, but make sure they understand that the Fall was essential to our progression in Heavenly Father’s plan . You may also want to help your students see that Heavenly Father enabled Adam and Eve and their posterity to experience joy through the Fall. Invite them to write “joy” on their pamphlet under “Effects of the Fall.” Consider asking if any of your students can recite 2 Nephi 2:25 from memory. President Jeffrey R. Holland of the Quorum of the Twelve Apostles explained why the Fall is essential in our lives: The Fall was an essential part of Heavenly Father’s divine plan. Without it no mortal children would have been born to Adam and Eve, and there would have been no human family to experience opposition and growth, moral agency, and the joy of resurrection, redemption, and eternal life. ( Christ and the New Covenant: The Messianic Message of the Book of Mormon [1997], 207) Look back at the “Effects of the Fall” page in your pamphlet. How has your eternal progress been positively influenced because of the Fall? Which of the effects of the Fall do we need to be rescued from? Help students understand that, among other things, we cannot rescue ourselves from physical death or spiritual death. Read the first sentence in 2 Nephi 2:26 , looking for good news for all of God’s children. What did you find? Inform students that the next lesson will focus on the role of the Messiah in redeeming us from the negative effects of the Fall. Invite students to recall the ranking activity from the beginning of the lesson. Ask them how they would now rank the Fall of Adam and Eve on a scale of 1–10. Students could then explain to their neighbor why the Fall was a good thing and how it affects their lives and their progress in Heavenly Father’s plan. Consider closing with your testimony of Heavenly Father’s wisdom and love for us, which He demonstrated by sending His Son to redeem us from the Fall. (Remind students to keep their pamphlets—or turn them in to you—so they can finish creating them in the next lesson.)\n\n\n--- Lesson 12 ---\nThe Fall of Adam and Eve introduced challenges that they had not experienced in the Garden of Eden. They were separated from the presence of God and would now experience sin, physical death, and other mortal difficulties. However, our loving Father in Heaven provided a Savior to overcome the effects of the Fall. This lesson can help students feel the joy of redemption from the Fall through the Atonement of Jesus Christ. Student preparation: Invite students to look for the effects of the Fall of Adam and Eve all around them. These could include birth, death, physical bodies, sin, hunger, sickness, and so on. Ask students to ponder how Jesus Christ can help with each effect they identify. Possible Learning Activities Our need for a Redeemer Begin class by helping students understand our need for the Atonement of Jesus Christ. One way you could do this is by using the following idea, adapted from the talk “ The Atonement of Jesus Christ ” (Tad R. Callister, Ensign or Liahona , May 2019, 85). Display a picture of someone falling out of an airplane, and invite students to discuss the following: Imagine you fell out of an airplane, thousands of feet in the air, without a parachute or any other equipment. What might you do to try to slow your fall? What hope would you have of survival? In contrast, imagine that before you fell out of the plane, a friend was able to put a parachute on you. How would you feel differently about your fall? How would you feel about your friend? To help students connect the previous discussion to our need for the Atonement of Jesus Christ, they could discuss the following questions with a partner. If students created pamphlets about the effects of the Fall in the previous lesson , you could first invite them to briefly review these pamphlets. If students did not create pamphlets, you might modify the activities that reference them. How could we compare this analogy to the Fall of Adam and Eve and the role of Jesus Christ’s Atonement in Heavenly Father’s plan? What are some of the effects of the Fall that we need the help of Jesus Christ to overcome? As needed, remind students that because of the Fall, we all experience spiritual death. This means that we are born into a world separated from God’s presence and that we commit sin, which also spiritually separates us from Him. Because of the Fall, we also face difficulties, sicknesses, weaknesses, and eventually physical death. Invite students to ponder the following: Which of the following statements are true of you? I don’t know why I need the Savior. I understand why I need the Savior, but don’t think I could explain it to someone else. I could explain our need for the Savior to someone else. I feel love and gratitude for Jesus Christ and what He has done for me. Encourage students to invite the Holy Ghost’s influence by actively participating throughout the lesson. The Atonement of Jesus Christ As part of the Fall, Adam and Eve had to leave the Garden of Eden. The Lord continued to bless them by providing clothing (see Moses 4:27 ) and giving commandments to help them overcome the Fall. Consider displaying the image at the beginning of this lesson and reading the following verses as a class. Pause occasionally to invite students to share what they are learning. For example, after reading verses 5–7 , they might discuss how offering the firstlings of their flocks symbolized the sacrifice of Jesus Christ. Or you could ask students what they learn from Adam’s example of obedience and how they could apply this example to their own lives. Read Moses 5:5–9 , looking for what God commanded. What did Adam and Eve learn from the angel and the Holy Ghost? Students could identify that through the Atonement of Jesus Christ, we can be redeemed from the Fall . Consider inviting students to mark words or phrases in verses 7 and 9 that teach this truth. You might explain that redeemed means to be rescued or freed . To help students deepen their understanding of this truth, display the following instructions and provide students with the handout below. You could place students in groups of three and invite each student within the group to study a different section of the handout. Students could then share with their groups what they learned and create the next page in their pamphlets together. ( Note : Lesson 21: “ Assess Your Learning 1 ” suggests that students refer to the pamphlets they create in this activity to help them explain the role of Jesus Christ as our Redeemer.) Inside your pamphlet, label the right (blank) page “The Atonement of Jesus Christ.” Study the material on the handout to learn how the Atonement of Jesus Christ redeems us from the effects of the Fall. You may have listed the effects of the Fall on the previous page of your pamphlet. On the new page of your pamphlet, write one or two sentences summarizing what you learn from each section of the handout. Seek help from the Holy Ghost to recognize how these teachings relate to you. Open PDF Consider inviting a few students to share what they wrote in their pamphlets. The other students could add what they learn from their classmates to their pamphlets. The joy of redemption Invite students to label the back cover of their pamphlets “The Joy of My Redemption.” Encourage them to copy the following statement onto that page, leaving room to write under it. President Russell M. Nelson taught: When we can feel the Savior’s Atonement working in our lives, we will be filled with joy. (“ Joy and Spiritual Survival ,” Ensign or Liahona , Nov. 2016, 84) Read Moses 5:10–11 , looking for what Adam and Eve observed about the results of both the Fall and the Savior’s Atonement. What stands out to you from their words? Give students time to complete the final page of their pamphlets, which they could do by writing a personalized version of Moses 5:10–11 . Like Adam and Eve, they could write reasons they have for feeling joy because of their Redeemer. Consider concluding by inviting a few students to share what they wrote.\n\n--- SCRIPTURE: Moses 4 ---\n1. And I, theLord God, spake unto Moses, saying: ThatSatan, whom thou hast commanded in the name of mine Only Begotten, is the same which was from thebeginning, and he came before me, sayingBehold, here am I, send me, I will be thy son, and I willredeemall mankind, that one soul shall not be lost, and surelyIwill do it; whereforegiveme thine honor.\n2. But, behold, my BelovedSon, which was my Beloved andChosenfrom the beginning, said unto meFather, thywill bedone, and theglorybe thine forever.\n3. Wherefore, because thatSatanrebelledagainst me, and sought to destroy theagencyof man, which I, the Lord God, had given him, and also, that I should give unto him mine own power; by the power of mine Only Begotten, I caused that he should becast down;\n4. And he becameSatan, yea, even thedevil, the father of alllies, todeceiveand to blind men, and to lead themcaptiveat his will, even as many as would nothearkenunto my voice.\n5. And now the serpent was moresubtlethan any beast of the field which I, the Lord God, had made.\n6. AndSatanput it into the heart of the serpent, (for he had drawn awaymanyafter him,) and he sought also tobeguileEve, for heknew notthemindof God, wherefore he sought to destroy the world.\n7. And he said unto the woman: Yea, hath God saidYe shall not eat of every tree of the garden? (And he spake by the mouth of the serpent.)\n8. And the woman said unto the serpent: We may eat of the fruit of the trees of the garden;\n9. But of the fruit of the tree which thou beholdest in the midst of the garden, God hath saidYe shall not eat of it, neither shall ye touch it, lest ye die.\n10. And the serpent said unto thewoman: Ye shall not surely die;\n11. For God doth know that in the day ye eat thereof, then youreyesshall be opened, and ye shall be as gods,knowinggood and evil.\n12. And when the woman saw that the tree was good for food, and that it became pleasant to the eyes, and tree to bedesiredto make her wise, she took of thefruitthereof, and dideat, and also gave unto her husband with her, and he did eat.\n13. And the eyes of them both were opened, and they knew that they had beennaked. And they sewed fig leaves together and made themselvesaprons.\n14. And they heard the voice of the Lord God, as they werewalkinginthe garden, in the cool of the day; and Adam and his wife went to hide themselves from thepresenceof the Lord God amongst the trees of the garden.\n15. And I, the Lord God, called unto Adam, and said unto him: Wheregoestthou?\n16. And he said: I heard thy voice in the garden, and I was afraid, because I beheld that I was naked, and I hid myself.\n17. And I, the Lord God, said unto Adam: Who told thee thou wast naked? Hast thou eaten of the tree whereof I commanded thee that thou shouldst not eat, if so thou shouldst surelydie?\n18. And the man said: The woman thou gavest me, and commandest that she should remain with me, she gave me of the fruit of the tree and I did eat.\n19. And I, the Lord God, said unto the woman: What is this thing which thou hast done? And the woman said: The serpentbeguiledme, and I did eat.\n20. And I, the Lord God, said unto the serpent: Because thou hast done this thou shalt becursedabove all cattle, and above every beast of the field; upon thy belly shalt thou go, and dust shalt thou eat all the days of thy life;\n21. And I will putenmitybetween thee and the woman, between thy seed and her seed; and he shallbruisethy head, and thou shalt bruise his heel.\n22. Unto the woman, I, the Lord God, said: I will greatly multiply thy sorrow and thy conception. Insorrowthou shalt bring forth children, and thy desire shall be to thyhusband, and he shall rule over thee.\n23. And unto Adam, I, the Lord God, said: Because thou hast hearkened unto the voice of thy wife, and hast eaten of the fruit of the tree of which I commanded thee, sayingThou shalt not eat of it,cursedshall be the ground for thy sake; insorrowshalt thou eat of it all the days of thy life.\n24. Thorns also, and thistles shall it bring forth to thee, and thou shalt eat the herb of the field.\n25. By thesweatof thyfaceshalt thou eat bread, until thou shalt return unto the groundfor thou shalt surely diefor out of it wast thou taken: fordustthou wast, and unto dust shalt thou return.\n26. And Adam called his wifes name Eve, because she was the mother of all living; for thus have I, the Lord God, called the first of all women, which aremany.\n27. Unto Adam, and also unto his wife, did I, the Lord God, make coats ofskins, andclothedthem.\n28. And I, the Lord God,saidunto mine Only Begotten: Behold, themanis become as one of us toknowgood and evil; and now lest he put forth his hand andpartakealso of thetree of life, and eat and live forever,\n29. Therefore I, the Lord God, will send him forth from the Garden ofEden, to till the ground from whence he was taken;\n30. For as I, the Lord God, liveth, even so mywordscannot returnvoid, for as they go forth out of my mouth they must be fulfilled.\n31. So I drove out the man, and I placed at the east of the Garden ofEden,cherubimand flaming sword, which turned every way to keep the way of the tree of life.\n32. (And these are the words which I spake unto my servant Moses, and they are true even as I will; and I have spoken them unto you. See thou show them unto no man, until I command you, except to them that believe. Amen.)\n\n--- SCRIPTURE: Moses 5 ---\n1. And it came to pass that after I, the Lord God, had driven them out, that Adam began to till the earth, and to havedominionover all the beasts of the field, and to eat his bread by the sweat of hisbrow, as I the Lord had commanded him. And Eve, also, his wife, didlaborwith him.\n2. AndAdamknew his wife, and she bare unto himsonsanddaughters, and they began tomultiplyand to replenish the earth.\n3. And from that time forth, the sons anddaughtersof Adam began to divide two and two in the land, and to till the land, and to tend flocks, and they also begat sons and daughters.\n4. And Adam and Eve, his wife,called uponthe name of the Lord, and they heard the voice of the Lord from the way toward the Garden ofEden, speaking unto them, and they saw him not; for they were shut out from hispresence.\n5. And he gave unto them commandments, that they shouldworshipthe Lord their God, and should offer thefirstlingsof theirflocks, for an offering unto the Lord. And Adam wasobedientunto the commandments of the Lord.\n6. And after many days anangelof the Lord appeared unto Adam, saying: Why dost thou offersacrificesunto the Lord? And Adam said unto him: I know not, save the Lord commanded me.\n7. And then the angel spake, saying: This thing is asimilitudeof thesacrificeof the Only Begotten of the Father, which is full ofgraceandtruth.\n8. Wherefore, thou shalt do all that thou doest in thenameof the Son, and thou shaltrepentandcallupon God in the name of the Son forevermore.\n9. And in that day theHoly Ghostfell upon Adam, which beareth record of the Father and the Son, saying: I am theOnly Begottenof the Father from the beginning, henceforth and forever, that as thou hastfallenthou mayest beredeemed,and all mankind, even as many as will.\n10. And in that day Adam blessed God and wasfilled, and began toprophesyconcerning all the families of the earth, saying: Blessed be the name of God, for because of mytransgressionmyeyesare opened, and in this life I shall havejoy, and again in thefleshI shall see God.\n11. And Eve, his wife, heard all these things and was glad, saying: Were it not for our transgression we never should have hadseed, and never should haveknowngood and evil, and the joy of our redemption, and the eternal life which God giveth unto all the obedient.\n12. And Adam andEveblessed the name of God, and they made all thingsknownunto their sons and their daughters.\n13. AndSatancame among them, saying: I am also son of God; and he commanded them, saying:Believeit not; and they believed it not, and theylovedSatan more than God. And men began from that time forth to becarnal, sensual, and devilish.\n14. And the Lord God called upon men by theHoly Ghosteverywhere and commanded them that they should repent;\n15. And as many asbelievedin the Son, and repented of their sins, should besaved; and as many as believed not and repented not, should bedamned; and the words went forth out of the mouth of God in firm decree; wherefore they must be fulfilled.\n16. And Adam and Eve, his wife, ceased not to call upon God. And Adam knew Eve his wife, and she conceived and bareCain, and said: I have gotten man from the Lord; wherefore he may not reject his words. But behold, Cainhearkenednot, saying: Who is the Lord that I shouldknowhim?\n17. And she again conceived and bare his brother Abel. And Abelhearkenedunto the voice of the Lord. AndAbelwas keeper of sheep, but Cain was tiller of the ground.\n18. And CainlovedSatan more than God. And Satan commanded him, saying:Makean offering unto the Lord.\n19. And in process of time it came to pass that Cain brought of thefruitof the ground an offering unto the Lord.\n20. And Abel, he also brought of thefirstlingsof his flock, and of the fat thereof. And the Lord hadrespectunto Abel, and to hisoffering;\n21. But unto Cain, and to hisoffering, he had not respect. Now Satan knew this, and itpleasedhim. And Cain was very wroth, and his countenance fell.\n22. And the Lord said unto Cain: Why art thou wroth? Why is thy countenance fallen?\n23. If thou doest well, thou shalt beaccepted. And if thou doest not well, sin lieth at the door, and Satandesirethto have thee; and exceptthou shalt hearken unto my commandments, I willdeliverthee up, and it shall be unto thee according to his desire. And thou shaltruleover him;\n24. For from this time forth thou shalt be the father of hislies; thou shalt be calledPerdition; for thou wast alsobeforethe world.\n25. And it shall be said in time to comeThat these abominations were had fromCain; for he rejected the greater counsel which was had from God; and this is acursingwhich I will put upon thee, except thou repent.\n26. And Cain was wroth, and listened not any more to the voice of the Lord, neither to Abel, his brother, who walked in holiness before the Lord.\n27. And Adam and his wifemournedbefore the Lord, because of Cain and his brethren.\n28. And it came to pass that Cain took one of his brothers daughters towife, and theylovedSatan more than God.\n29. And Satan said unto Cain:Swearunto me by thy throat, and if thou tell it thou shalt die; and swear thy brethren by their heads, and by the living God, that they tell it not; for if they tell it, they shall surely die; and this that thy father may not know it; and this day I will deliver thy brother Abel into thine hands.\n30. And Satan sware unto Cain that he would do according to hiscommands. And all these things were done in secret.\n31. And Cain said: Truly I am Mahan, the master of this greatsecret, that I maymurderand getgain. Wherefore Cain was called MasterMahan, and he gloried in his wickedness.\n32. And Cain went into the field, and Cain talked with Abel, his brother. And it came to pass that while they were in the field, Cain rose up against Abel, his brother, and slew him.\n33. And Caingloriedin that which he had done, saying: I am free; surely theflocksof my brother falleth into my hands.\n34. And the Lord said unto Cain: Where is Abel, thy brother? And he said: I know not. Am I my brotherskeeper?\n35. And the Lord said: What hast thou done? The voice of thy brothersbloodcries unto me from the ground.\n36. And now thou shalt becursedfrom the earth which hath opened her mouth to receive thy brothers blood from thy hand.\n37. When thou tillest the ground it shall not henceforth yield unto thee herstrength. Afugitiveand vagabond shalt thou be in the earth.\n38. And Cain said unto the Lord: Satantemptedme because of my brothers flocks. And I was wroth also; for his offering thou didst accept and not mine; mypunishmentis greater than I can bear.\n39. Behold thou hast driven me out this day from the face of the Lord, and from thy face shall I be hid; and I shall be fugitive and vagabond in the earth; and it shall come to pass, that he that findeth me will slay me, because of mine iniquities, for these things are not hid from the Lord.\n40. And I the Lord said unto him:Whosoever slayeth thee, vengeance shall be taken on him sevenfold. And I the Lord set amarkupon Cain, lest any finding him should kill him.\n41. And Cain wasshut outfrom thepresenceof the Lord, and with his wife and many of his brethren dwelt in the land of Nod, on the east of Eden.\n42. And Cain knew his wife, and she conceived and bare Enoch, and he also begat many sons and daughters. And he builded city, and he called the name of thecityafter the name of his son, Enoch.\n43. And unto Enoch was born Irad, and other sons and daughters. And Irad begat Mahujael, and other sons and daughters. And Mahujael begat Methusael, and other sons and daughters. And Methusael begat Lamech.\n44. And Lamech took unto himself two wives; the name of one being Adah, and the name of the other, Zillah.\n45. And Adah bare Jabal; he was the father of such as dwell intents, and they were keepers of cattle; and his brothers name was Jubal, who was the father of all such as handle the harp and organ.\n46. And Zillah, she also bare Tubal Cain, an instructor of every artificer in brass and iron. And the sister of Tubal Cain was called Naamah.\n47. And Lamech said unto his wives, Adah and Zillah: Hear my voice, ye wives of Lamech, hearken unto my speech; for I have slain man to my wounding, and young man to my hurt.\n48. If Cain shall be avenged sevenfold, truly Lamech shall beseventy and seven fold;\n49. ForLamechhaving entered into covenant with Satan, after the manner of Cain, wherein he became Master Mahan, master of that great secret which was administered unto Cain by Satan; and Irad, the son of Enoch, having known their secret, began to reveal it unto the sons of Adam;\n50. Wherefore Lamech, being angry, slew him, not like unto Cain, his brother Abel, for the sake of getting gain, but he slew him for theoathssake.\n51. For, from the days of Cain, there was secretcombination, and their works were in the dark, and they knew every man his brother.\n52. Wherefore the LordcursedLamech, and his house, and all them that had covenanted with Satan; for they kept not the commandments of God, and it displeased God, and he ministered not unto them, and their works were abominations, and began to spread among all thesonsof men. And it was among the sons of men.\n53. And among the daughters of men these things were not spoken, because that Lamech had spoken the secret unto his wives, and they rebelled against him, and declared these things abroad, and had not compassion;\n54. Wherefore Lamech was despised, and cast out, and came not among the sons of men, lest he should die.\n55. And thus the works ofdarknessbegan to prevail among all the sons of men.\n56. And Godcursedthe earth with sore curse, and was angry with the wicked, with all the sons of men whom he had made;\n57. For they would nothearkenunto his voice, nor believe on his Only Begotten Son, even him whom he declared shouldcomein the meridian of time, who waspreparedfrom before the foundation of the world.\n58. And thus theGospelbegan to bepreached, from the beginning, being declared byholyangelssent forth from the presence of God, and by his own voice, and by the gift of the Holy Ghost.\n59. And thus all things were confirmed untoAdam, by an holy ordinance, and the Gospel preached, and decree sent forth, that it should be in the world, until the end thereof; and thus it was. Amen.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";Moses 4–5",
      "content": "At first, the story of the Fall of Adam and Eve might seem like a tragedy. Adam and Eve were cast out of the beautiful Garden of Eden. They were sent into a world of pain, sorrow, and death (see\nGenesis 3:16–19\n). And they were separated from their Heavenly Father. But the truths restored through the Prophet Joseph Smith in the book of Moses give us a unique perspective on the Fall.\nYes, the Garden of Eden was beautiful. But Adam and Eve needed more than beautiful surroundings. They needed—and we all need—an opportunity to grow. Leaving the Garden of Eden was the necessary first step toward returning to God and eventually becoming like Him. That meant facing opposition, making choices, making mistakes, learning to repent, and trusting the Savior, whose Atonement makes possible progression and “the joy of our redemption” (\nMoses 5:11\n). So when you read about the Fall of Adam and Eve, focus not on the seeming tragedy but on the possibilities—not on the paradise Adam and Eve lost but on the glory their choice allows us to receive.\nIdeas for Learning at Home and at Church\nGenesis 3\n;\nMoses 4\nThe Fall was a necessary part of God’s plan.\nIt’s true that Adam and Eve’s choice led to many of the difficulties we experience in mortality. But that doesn’t mean we regret their choice. As you read\nGenesis 3\nand\nMoses 4\n, you might ask yourself, why was the Fall important to God’s plan?\nAccording to\nMoses 5:9–12\n, how did Adam and Eve feel about the Fall? How can you apply their words to your experiences in this fallen world? What else do you learn from\n2 Nephi 2:19–25\n?\nSee also\nMosiah 3:19\n;\nAlma 12:21–37\n; and\nDoctrine and Covenants 29:39–43\n.\nLeaving Eden\n, by Annie Henrie Nader\nGenesis 3:1–7\n;\nMoses 4:22–31\n;\n5:4–15\nJesus Christ offers hope and redemption.\nAdam and Eve’s story is one of hope and redemption through Jesus Christ. To see why, you might start by searching for the results of the Fall in\nGenesis 3:1–7\n;\nMoses 4:22–31\nand marking or listing what you find. How do these results affect you? Then you could search\nMoses 5:4–15\n, looking for God’s plan to redeem us from these effects. Why were Adam and Eve “glad” after the angel visited them? What do you learn from them about Heavenly Father’s plan?\nSee also “Because of Him” (video), Gospel Library.\n2:44\nBecause of Him\nGenesis 3:16\n;\nMoses 4:22\nWhat does it mean that Adam was to “rule over” Eve?\nThis passage of scripture has sometimes been misunderstood to mean that a husband is justified in treating his wife unkindly. In our day, the Lord’s prophets have taught that a husband and wife should see each other as equal partners in fulfilling their divine responsibilities in the family (see “\nThe Family: A Proclamation to the World\n” [Gospel Library]). Elder Dale G. Renlund and Sister Ruth Lybbert Renlund explained that a righteous husband “will seek to minister; he will acknowledge error and seek forgiveness; he will be quick to offer praise; he will be considerate of family members’ preferences; he will feel the great weight of responsibility to provide ‘the necessities of life and protection’ for his family; he will treat his wife with the utmost respect and deference. … He will bless his family” (\nThe Melchizedek Priesthood: Understanding the Doctrine, Living the Principles\n[2018], 23).\nTo learn more about how the Lord views the relationship between husbands and wives, ponder the counsel of Elder Ulisses Soares in the following video. How would you explain, in your own words, what it means for husband wife to be “equal partners”?\n3:33\nEqual Partnership in Marriage\nMoses 4:1–4\nI need agency and opposition to grow.\nElder Dale G. Renlund taught, “Our Heavenly Father’s goal in parenting is not to have His children\ndo\nwhat is right; it is to have His children\nchoose\nto do what is right and ultimately become like Him” (“\nChoose You This Day\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 104). Why is it so important in Heavenly Father’s plan that we\nchoose\nto do what is right?\nAs you read\nMoses 4:1–4\n, look for what Heavenly Father and Jesus Christ did to protect your right to choose—your agency. How can you access their protecting power? For ideas, consider studying the section “\nMake inspired choices\n” in\nFor the Strength of Youth: A Guide for Making Choices\n(4–5).\nConsider also reading what Lehi taught about agency in\n2 Nephi 2:11–20, 25–30\n. Why is opposition necessary for agency? How can you show your appreciation to Jesus Christ for making you “free to choose”? (\n2 Nephi 2:27\n).\nSee also Dallin H. Oaks, “\nOpposition in All Things\n,”\nEnsign\nor\nLiahona\n, May 2016, 114–17; Topics and Questions, “\nAgency\n,” Gospel Library; “\nChoose the Right\n,”\nHymns\n, no. 239.\nIncrease participation.\nMany learning activities can be done as an individual, family, or class; in small groups; or in pairs. Use a variety of methods to allow people to participate who might not otherwise have a chance. For this activity, you could invite one person or group to read\nMoses 4\nand the\nFor the Strength of Youth\nguide while another group studies the verses in\n2 Nephi 2\n. They could then teach each other what they learned in their respective section.\nMoses 4:4–12\n;\n5:13–33\nSatan seeks “to deceive and to blind” me.\nAs you read\nMoses 4:4–12\n;\n5:13–33\n, consider listing ways that Satan tried to tempt Adam and Eve and their children. How does he attempt these same things today? How does Heavenly Father help you resist Satan’s deceptions?\nMoses 4:13–16, 27\n“I, the Lord God … clothed them.”\nAfter partaking of the forbidden fruit, Adam and Eve tried to cover their own nakedness. Later, the Lord offered to clothe them. As you read\nMoses 4:13–16, 27\n, consider the following:\nPonder what nakedness and clothing can represent in the scriptures (see, for example,\nRevelation 7:9, 13–15\n;\n2 Nephi 9:14\n;\nDoctrine and Covenants 109:22–26, 76\n). What do you learn from Adam and Eve’s experience with nakedness and clothing?\nIf you have been endowed in the temple, consider what Adam and Eve might say to you about the significance of your temple garment and what it represents.\nSee also “Sacred Temple Clothing” (video), Gospel Library.\n4:12\nSacred Temple Clothing\nMoses 5:4–9, 16–26\nGod will accept my sacrifices if I offer them with a willing and obedient heart.\nAs you study\nMoses 5:4–9, 16–26\n, consider the attitudes of Adam and Eve and their sons Cain and Abel toward sacrifice. Why did the Lord accept Abel’s sacrifice but not Cain’s?\nWhat does the Lord ask you to sacrifice? Is there anything in these verses that shapes the way you think about those sacrifices?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nDid God give Adam and Eve conflicting commandments in the Garden of Eden?\nWas it a sin for Adam and Eve to partake of the forbidden fruit?\nWhat do we know about the curse and mark placed upon Cain?\nClick to see more.\nIdeas for Teaching Children\nGenesis 3\n;\nMoses 4\n;\n5:8–15\nJesus Christ saves us from the Fall.\nTo help your children better understand the Fall of Adam and Eve, you could copy the pictures from “\nAdam and Eve\n” (in\nOld Testament Stories\n, 13–16) and cut them out. Then you could work together to put the pictures in order as you discuss the experiences of Adam and Eve. As you do, talk about why it was important, in Heavenly Father’s plan, for Adam and Eve to leave the Garden of Eden.\nYour children can feel gratitude for the Atonement of Jesus Christ as they understand how He overcomes the effects of the Fall. As you read together\nMoses 4:25\n;\n6:48\n;\nRomans 5:12\n;\n2 Nephi 2:22–23\n, help your children find ways to complete this sentence: “Because of the Fall, I …” Then, as you read together\nMoses 5:8–11, 14–15\n;\n6:59\n;\nAlma 11:42\n, they could complete this sentence: “Because of Jesus Christ, I …” Share with each other your gratitude for Jesus Christ.\nMoses 4:1–4\nI can choose the right.\nConsider a simple object lesson to introduce the principle of agency: invite your children to color this week’s activity page, but give them only one color to use. Why would it be better to have choices? You could then read together\nMoses 4:1–4\nand talk about why God wants us to be able to choose between right and wrong. How do Heavenly Father and Jesus Christ help us make good choices?\nHelp your children think of and draw pictures of good choices they can make to follow Jesus Christ. Or you could sing together a song about making good choices, such as “\nChoose the Right Way\n” (\nChildren’s Songbook\n, 160–61). You might tell each other about a time when you made a good choice and talk about how you felt afterward.\nThe Fall\n, by Robert T. Barrett\nMoses 5:4, 8\nI can pray to Heavenly Father.\nWhen Adam and Eve had to leave the Garden of Eden, they couldn’t be with Heavenly Father anymore. Read\nMoses 5:4, 8\nwith your children, and help them find what Adam and Eve did to feel near to Him and hear Him. What are some things we can say to Heavenly Father in our prayers?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 4: Lesson 10: Lesson 10—Moses 4:1–4This lesson can help students desire to follow Jesus Christ’s example of obeying Heavenly Father.; Lesson 11: Lesson 11—Moses 4:5–32; 5:1–15 Part 1This lesson is intended to help students understand the effects of the Fall in Heavenly Father’s plan and in their own lives....",
      "content": "\n--- Lesson 10 ---\nIn the premortal life, Heavenly Father chose Jesus Christ to be the Savior in His plan. Jesus Christ consistently obeys Heavenly Father’s will, even when it is hard. This lesson can help students desire to follow Jesus Christ’s example of obeying Heavenly Father. Student preparation: Invite students to think about people they know whose examples inspire them to be more obedient to Heavenly Father. Ask them to come prepared to share. Possible Learning Activities Doing Heavenly Father’s will To begin class, consider sharing a time when a teenager was asked by Heavenly Father to do something difficult. This could be a personal experience or one you’ve heard about. The following story is one example that you could use. Encourage students to think about times when they may have had similar feelings. Brother M. Joseph Brough, formerly of the Young Men General Presidency, shared the following story about his daughter: 9:52 Young people, God requires hard things of you. One 14-year-old young woman participated in competitive basketball. She dreamed of playing high school basketball like her older sister. She then learned that her parents had been called to preside over a mission in Guatemala. Upon arrival, she discovered that a couple of her classes would be in Spanish, a language she did not yet speak. There was not a single girls’ sports team at her school. She lived on the 14th floor of a building with tight security. And to top it all off, she could not go outside alone for safety reasons. Her parents listened to her cry herself to sleep every night for months. (“ Lift Up Your Head and Rejoice ,” Ensign or Liahona , Nov. 2018, 14) If you were in this young woman’s situation, what would have been most difficult for you? Reflect on the following questions: What is a hard thing that God has required or may require of you? How willing are you to do this hard thing? Why? What do you want to learn or feel in this lesson that could help you be more willing to do what God asks? As students study Moses 4:1–4 , they will learn about Jesus Christ and His willingness to do the hard things Heavenly Father asks. Encourage students to seek the help of the Holy Ghost to know how the Savior’s example can help them with hard things God may ask them to do. The character of Christ You may want to explain the information in the following paragraph to help students understand the context of the passage they will be studying today. We lived in the premortal life with our Heavenly Father. While there, we were taught His plan to help us become like Him. Moses 4:1–4 contains an account of the Council in Heaven when Jesus Christ was chosen to be our Savior. In these verses, we see the character of Jesus Christ and Satan as they each respond to Heavenly Father’s will in different ways. You might consider making a simple chart like the following on the board to help students clearly see differences between Jesus Christ and Satan. Jesus Christ Satan Read Moses 4:1–4 , looking for what you can learn about the motives and attitudes of Jesus Christ and Satan. Invite students to write their insights on the board and discuss what they have learned. (Students might mention how many times Satan uses the word “I” and his desire to receive honor. In contrast, they might notice the Savior’s use of the word “thy” and His desire for the glory to be the Father’s. Students might notice how Satan “rebelled against” the Father and “sought to destroy the agency of man.” In contrast, they might point out the Savior’s desire to obey the Father’s will and accept the Father’s plan.) What do these verses teach you about the relationship between Jesus Christ and His Father? One truth that students might identify during the discussion is Jesus Christ humbly obeys our Father in Heaven . The following accounts about the Savior can help students learn from His example. Help students understand that learning more about the Savior’s obedience to the Father, even when it was hard, can increase our desire to follow His example. Read the following accounts, looking for Jesus Christ’s constant desire to obey Heavenly Father, even when it was hard. Luke 2:49 (as a 12-year-old) John 8:28–29 (as an adult) Matthew 26:36–39 (in the Garden of Gethsemane) 3 Nephi 11:10–11 (as a resurrected being) Discuss with the students what they are learning about Jesus Christ from these examples. Then invite them to share other examples from the Savior’s life when He humbly obeyed the Father’s will. Invite students to recall the hard thing in their lives they thought about at the beginning of class. To help them connect what they are learning about Jesus Christ to their lives, ask questions like the following: What did Jesus Christ say or do that could inspire someone to choose to obey Heavenly Father, even when it is difficult? Who do you know who is a good example of obeying Heavenly Father’s will? What have you learned from their example? What motivates you to obey Heavenly Father’s will, even when it is hard? Following Christ’s example The young woman from the story at the beginning of the lesson is Brother Brough’s daughter. If you shared his daughter’s story, tell students that she valiantly faced the three years her parents served as mission leaders in Guatemala. Share the following continuation of her story, inviting students to look for Christlike attributes they see in her example. If you shared a different story at the beginning of class, consider sharing a follow-up, such as the story’s conclusion or another experience in the same person’s life. Invite students to look for Christlike attributes in that person. Brother Brough continued: 9:52 At the conclusion of our mission, I asked my daughter if she was going to serve a full-time mission. Her answer was “No, Dad, I have already served.” I was just fine with that! But about six months later, the Spirit awoke me in the night with this thought: “I have called your daughter to serve a mission.” My reaction was “Heavenly Father, she has given so much.” I was quickly corrected by the Spirit and came to understand that her missionary service was required of the Lord. I soon took my daughter to lunch. From across the table, I said, “Ganzie, do you know why we are here?” She said, “Yes, Dad. You know I have to serve a mission. I do not want to go, but I am going.” Because she gave her will to Heavenly Father, she served Him with all of her heart, might, mind, and strength. She has taught her father how to do a hard thing. (“ Lift Up Your Head and Rejoice ,” Ensign or Liahona , Nov. 2018, 14) Think about the verses you read about Jesus Christ today. How did this young woman follow His example? Asking open-ended questions can help your students discover and apply gospel truths to their personal circumstances. Consider using questions like the following to allow students to express what they learned and how they can apply it to their lives. (For additional training on this, see “ Learn the doctrine of Jesus Christ for yourself ” in Teacher Development Skills .) In your study journal, write a response to the following two questions, paying attention to thoughts or impressions from the Spirit: What have you learned today about Jesus Christ that can help you obey Heavenly Father, even when He asks you to do hard things? What do you feel impressed to do because of what you have learned or felt today? Testify of Jesus Christ’s example and His ability to help us do what God has asked.\n\n\n--- Lesson 11 ---\nWhether we realize it or not, the Fall of Adam and Eve directly affects all of us each day. In fact, without it, we would not have even been born. This lesson is intended to help students understand the effects of the Fall in Heavenly Father’s plan and in their own lives. Student preparation: Invite students to memorize the doctrinal mastery passage 2 Nephi 2:25 and to ask a parent or Church leader what it means to them. Possible Learning Activities Good or bad? To begin the lesson, help students think of how some difficult things can be blessings in God’s plan. One way to do this is to use the following scale. You might choose to show pictures that depict the words students will be ranking. On a scale of 1–10 (1 = bad, 10 = good), how do you think most people would rank the following things? Hard work Trials Sorrow Death Viewing these from the eternal perspective of Heavenly Father’s plan, would you rank any of these differently? If so, why? Consider displaying an image of Adam and Eve like the one at the beginning of this lesson. You may want to leave it up for the remainder of the lesson. Many of the hardships we face in life come as a result of a choice made by our first parents, Adam and Eve. How do you think many people would rank the Fall of Adam and Eve on the scale of 1–10? Why? Ponder how well you understand the Fall of Adam and Eve and its significance in your life. Answer the following questions in your study journal: Do you feel the Fall was good or bad? How can your understanding of the Atonement of Jesus Christ affect your answer? As you study Moses 4–5 today, seek inspiration from the Holy Ghost to help you better understand the Fall of Adam and Eve. The Holy Ghost can help you see that the Fall was part of Heavenly Father’s plan to help us progress and become more like Him. The effects of the Fall Invite students to summarize what they know about the Garden of Eden and the Fall of Adam and Eve. If they need help, invite them to search 2 Nephi 2:22–23 ; Moses 3:16–17 ; 4:6–12 , looking for details. You could also summarize by showing the Old Testament Scripture Stories video “ Adam and Eve ” (1:53), located on ChurchofJesusChrist.org . 1:53 Then help students learn about the effects of the Fall on Adam, Eve, and their posterity. To help students organize what they learn, provide them with paper and display the following instructions. You could invite students to work together in pairs to complete this activity. ( Note : Lesson 21: “ Assess Your Learning 1 ” suggests that students refer to the pamphlets they create in this activity to help them explain the effects of the Fall.) Consider limiting the amount of time students take in creating their pamphlets so they will have time to experience the rest of the lesson. To help you organize what you learn about the Fall, create a pamphlet using the following instructions. Imagine you will use this pamphlet to teach others about the Fall and why it was essential in Heavenly Father’s plan. Be creative in personalizing your pamphlet. Fold the paper in half. Create a cover page with a title such as “The Fall in Heavenly Father’s Plan.” Add a drawing or picture that reminds you of the Fall, such as a fruit tree or a piece of fruit. Inside the pamphlet, title the left page “Effects of the Fall.” Study Moses 4:13–16, 22–25, 28–29 ; 5:1–4 . List or draw pictures of the effects of the Fall on God’s children. Include in your pamphlet the verses where you learned about each effect. After sufficient time, invite a few students to share their pamphlets with the class. Invite students to add to their pamphlets anything they missed. Be sure students list that Adam and Eve and their posterity would now: Feel unprepared to be in God’s presence ( Moses 4:13–16 ). Be able to have children ( Moses 4:22 ; 5:2–3 ). Experience sorrow, pain, and difficulty ( Moses 4:22–24 ). Need to work hard to live ( Moses 4:25 ; 5:1–3 ). Know good from evil ( Moses 4:28 ). Physically die ( Moses 4:25 ). Be separated from God’s presence (spiritual death) ( Moses 5:4 ). Explain that separation from God is called “spiritual death”—something we all experience. Ponder how specific effects of the Fall can help us progress toward “immortality and eternal life” ( Moses 1:39 ). How does God allowing Adam and Eve to fall show His wisdom and love for His children? Ponder which effects of the Fall you find most difficult in your life. Explain to students that they will finish their pamphlets during the next lesson as they study about the Savior’s role in overcoming the negative effects of the Fall. The essential role of the Fall The Book of Mormon prophet Lehi explained the significance of the Fall. Study 2 Nephi 2:22–25 , looking for why the Fall was a good thing. What did you learn about the Fall? Students may mention a number of truths, but make sure they understand that the Fall was essential to our progression in Heavenly Father’s plan . You may also want to help your students see that Heavenly Father enabled Adam and Eve and their posterity to experience joy through the Fall. Invite them to write “joy” on their pamphlet under “Effects of the Fall.” Consider asking if any of your students can recite 2 Nephi 2:25 from memory. President Jeffrey R. Holland of the Quorum of the Twelve Apostles explained why the Fall is essential in our lives: The Fall was an essential part of Heavenly Father’s divine plan. Without it no mortal children would have been born to Adam and Eve, and there would have been no human family to experience opposition and growth, moral agency, and the joy of resurrection, redemption, and eternal life. ( Christ and the New Covenant: The Messianic Message of the Book of Mormon [1997], 207) Look back at the “Effects of the Fall” page in your pamphlet. How has your eternal progress been positively influenced because of the Fall? Which of the effects of the Fall do we need to be rescued from? Help students understand that, among other things, we cannot rescue ourselves from physical death or spiritual death. Read the first sentence in 2 Nephi 2:26 , looking for good news for all of God’s children. What did you find? Inform students that the next lesson will focus on the role of the Messiah in redeeming us from the negative effects of the Fall. Invite students to recall the ranking activity from the beginning of the lesson. Ask them how they would now rank the Fall of Adam and Eve on a scale of 1–10. Students could then explain to their neighbor why the Fall was a good thing and how it affects their lives and their progress in Heavenly Father’s plan. Consider closing with your testimony of Heavenly Father’s wisdom and love for us, which He demonstrated by sending His Son to redeem us from the Fall. (Remind students to keep their pamphlets—or turn them in to you—so they can finish creating them in the next lesson.)\n\n\n--- Lesson 12 ---\nThe Fall of Adam and Eve introduced challenges that they had not experienced in the Garden of Eden. They were separated from the presence of God and would now experience sin, physical death, and other mortal difficulties. However, our loving Father in Heaven provided a Savior to overcome the effects of the Fall. This lesson can help students feel the joy of redemption from the Fall through the Atonement of Jesus Christ. Student preparation: Invite students to look for the effects of the Fall of Adam and Eve all around them. These could include birth, death, physical bodies, sin, hunger, sickness, and so on. Ask students to ponder how Jesus Christ can help with each effect they identify. Possible Learning Activities Our need for a Redeemer Begin class by helping students understand our need for the Atonement of Jesus Christ. One way you could do this is by using the following idea, adapted from the talk “ The Atonement of Jesus Christ ” (Tad R. Callister, Ensign or Liahona , May 2019, 85). Display a picture of someone falling out of an airplane, and invite students to discuss the following: Imagine you fell out of an airplane, thousands of feet in the air, without a parachute or any other equipment. What might you do to try to slow your fall? What hope would you have of survival? In contrast, imagine that before you fell out of the plane, a friend was able to put a parachute on you. How would you feel differently about your fall? How would you feel about your friend? To help students connect the previous discussion to our need for the Atonement of Jesus Christ, they could discuss the following questions with a partner. If students created pamphlets about the effects of the Fall in the previous lesson , you could first invite them to briefly review these pamphlets. If students did not create pamphlets, you might modify the activities that reference them. How could we compare this analogy to the Fall of Adam and Eve and the role of Jesus Christ’s Atonement in Heavenly Father’s plan? What are some of the effects of the Fall that we need the help of Jesus Christ to overcome? As needed, remind students that because of the Fall, we all experience spiritual death. This means that we are born into a world separated from God’s presence and that we commit sin, which also spiritually separates us from Him. Because of the Fall, we also face difficulties, sicknesses, weaknesses, and eventually physical death. Invite students to ponder the following: Which of the following statements are true of you? I don’t know why I need the Savior. I understand why I need the Savior, but don’t think I could explain it to someone else. I could explain our need for the Savior to someone else. I feel love and gratitude for Jesus Christ and what He has done for me. Encourage students to invite the Holy Ghost’s influence by actively participating throughout the lesson. The Atonement of Jesus Christ As part of the Fall, Adam and Eve had to leave the Garden of Eden. The Lord continued to bless them by providing clothing (see Moses 4:27 ) and giving commandments to help them overcome the Fall. Consider displaying the image at the beginning of this lesson and reading the following verses as a class. Pause occasionally to invite students to share what they are learning. For example, after reading verses 5–7 , they might discuss how offering the firstlings of their flocks symbolized the sacrifice of Jesus Christ. Or you could ask students what they learn from Adam’s example of obedience and how they could apply this example to their own lives. Read Moses 5:5–9 , looking for what God commanded. What did Adam and Eve learn from the angel and the Holy Ghost? Students could identify that through the Atonement of Jesus Christ, we can be redeemed from the Fall . Consider inviting students to mark words or phrases in verses 7 and 9 that teach this truth. You might explain that redeemed means to be rescued or freed . To help students deepen their understanding of this truth, display the following instructions and provide students with the handout below. You could place students in groups of three and invite each student within the group to study a different section of the handout. Students could then share with their groups what they learned and create the next page in their pamphlets together. ( Note : Lesson 21: “ Assess Your Learning 1 ” suggests that students refer to the pamphlets they create in this activity to help them explain the role of Jesus Christ as our Redeemer.) Inside your pamphlet, label the right (blank) page “The Atonement of Jesus Christ.” Study the material on the handout to learn how the Atonement of Jesus Christ redeems us from the effects of the Fall. You may have listed the effects of the Fall on the previous page of your pamphlet. On the new page of your pamphlet, write one or two sentences summarizing what you learn from each section of the handout. Seek help from the Holy Ghost to recognize how these teachings relate to you. Open PDF Consider inviting a few students to share what they wrote in their pamphlets. The other students could add what they learn from their classmates to their pamphlets. The joy of redemption Invite students to label the back cover of their pamphlets “The Joy of My Redemption.” Encourage them to copy the following statement onto that page, leaving room to write under it. President Russell M. Nelson taught: When we can feel the Savior’s Atonement working in our lives, we will be filled with joy. (“ Joy and Spiritual Survival ,” Ensign or Liahona , Nov. 2016, 84) Read Moses 5:10–11 , looking for what Adam and Eve observed about the results of both the Fall and the Savior’s Atonement. What stands out to you from their words? Give students time to complete the final page of their pamphlets, which they could do by writing a personalized version of Moses 5:10–11 . Like Adam and Eve, they could write reasons they have for feeling joy because of their Redeemer. Consider concluding by inviting a few students to share what they wrote.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Moses 4",
      "content": "1. And I, theLord God, spake unto Moses, saying: ThatSatan, whom thou hast commanded in the name of mine Only Begotten, is the same which was from thebeginning, and he came before me, sayingBehold, here am I, send me, I will be thy son, and I willredeemall mankind, that one soul shall not be lost, and surelyIwill do it; whereforegiveme thine honor.\n2. But, behold, my BelovedSon, which was my Beloved andChosenfrom the beginning, said unto meFather, thywill bedone, and theglorybe thine forever.\n3. Wherefore, because thatSatanrebelledagainst me, and sought to destroy theagencyof man, which I, the Lord God, had given him, and also, that I should give unto him mine own power; by the power of mine Only Begotten, I caused that he should becast down;\n4. And he becameSatan, yea, even thedevil, the father of alllies, todeceiveand to blind men, and to lead themcaptiveat his will, even as many as would nothearkenunto my voice.\n5. And now the serpent was moresubtlethan any beast of the field which I, the Lord God, had made.\n6. AndSatanput it into the heart of the serpent, (for he had drawn awaymanyafter him,) and he sought also tobeguileEve, for heknew notthemindof God, wherefore he sought to destroy the world.\n7. And he said unto the woman: Yea, hath God saidYe shall not eat of every tree of the garden? (And he spake by the mouth of the serpent.)\n8. And the woman said unto the serpent: We may eat of the fruit of the trees of the garden;\n9. But of the fruit of the tree which thou beholdest in the midst of the garden, God hath saidYe shall not eat of it, neither shall ye touch it, lest ye die.\n10. And the serpent said unto thewoman: Ye shall not surely die;\n11. For God doth know that in the day ye eat thereof, then youreyesshall be opened, and ye shall be as gods,knowinggood and evil.\n12. And when the woman saw that the tree was good for food, and that it became pleasant to the eyes, and tree to bedesiredto make her wise, she took of thefruitthereof, and dideat, and also gave unto her husband with her, and he did eat.\n13. And the eyes of them both were opened, and they knew that they had beennaked. And they sewed fig leaves together and made themselvesaprons.\n14. And they heard the voice of the Lord God, as they werewalkinginthe garden, in the cool of the day; and Adam and his wife went to hide themselves from thepresenceof the Lord God amongst the trees of the garden.\n15. And I, the Lord God, called unto Adam, and said unto him: Wheregoestthou?\n16. And he said: I heard thy voice in the garden, and I was afraid, because I beheld that I was naked, and I hid myself.\n17. And I, the Lord God, said unto Adam: Who told thee thou wast naked? Hast thou eaten of the tree whereof I commanded thee that thou shouldst not eat, if so thou shouldst surelydie?\n18. And the man said: The woman thou gavest me, and commandest that she should remain with me, she gave me of the fruit of the tree and I did eat.\n19. And I, the Lord God, said unto the woman: What is this thing which thou hast done? And the woman said: The serpentbeguiledme, and I did eat.\n20. And I, the Lord God, said unto the serpent: Because thou hast done this thou shalt becursedabove all cattle, and above every beast of the field; upon thy belly shalt thou go, and dust shalt thou eat all the days of thy life;\n21. And I will putenmitybetween thee and the woman, between thy seed and her seed; and he shallbruisethy head, and thou shalt bruise his heel.\n22. Unto the woman, I, the Lord God, said: I will greatly multiply thy sorrow and thy conception. Insorrowthou shalt bring forth children, and thy desire shall be to thyhusband, and he shall rule over thee.\n23. And unto Adam, I, the Lord God, said: Because thou hast hearkened unto the voice of thy wife, and hast eaten of the fruit of the tree of which I commanded thee, sayingThou shalt not eat of it,cursedshall be the ground for thy sake; insorrowshalt thou eat of it all the days of thy life.\n24. Thorns also, and thistles shall it bring forth to thee, and thou shalt eat the herb of the field.\n25. By thesweatof thyfaceshalt thou eat bread, until thou shalt return unto the groundfor thou shalt surely diefor out of it wast thou taken: fordustthou wast, and unto dust shalt thou return.\n26. And Adam called his wifes name Eve, because she was the mother of all living; for thus have I, the Lord God, called the first of all women, which aremany.\n27. Unto Adam, and also unto his wife, did I, the Lord God, make coats ofskins, andclothedthem.\n28. And I, the Lord God,saidunto mine Only Begotten: Behold, themanis become as one of us toknowgood and evil; and now lest he put forth his hand andpartakealso of thetree of life, and eat and live forever,\n29. Therefore I, the Lord God, will send him forth from the Garden ofEden, to till the ground from whence he was taken;\n30. For as I, the Lord God, liveth, even so mywordscannot returnvoid, for as they go forth out of my mouth they must be fulfilled.\n31. So I drove out the man, and I placed at the east of the Garden ofEden,cherubimand flaming sword, which turned every way to keep the way of the tree of life.\n32. (And these are the words which I spake unto my servant Moses, and they are true even as I will; and I have spoken them unto you. See thou show them unto no man, until I command you, except to them that believe. Amen.)",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Moses 5",
      "content": "1. And it came to pass that after I, the Lord God, had driven them out, that Adam began to till the earth, and to havedominionover all the beasts of the field, and to eat his bread by the sweat of hisbrow, as I the Lord had commanded him. And Eve, also, his wife, didlaborwith him.\n2. AndAdamknew his wife, and she bare unto himsonsanddaughters, and they began tomultiplyand to replenish the earth.\n3. And from that time forth, the sons anddaughtersof Adam began to divide two and two in the land, and to till the land, and to tend flocks, and they also begat sons and daughters.\n4. And Adam and Eve, his wife,called uponthe name of the Lord, and they heard the voice of the Lord from the way toward the Garden ofEden, speaking unto them, and they saw him not; for they were shut out from hispresence.\n5. And he gave unto them commandments, that they shouldworshipthe Lord their God, and should offer thefirstlingsof theirflocks, for an offering unto the Lord. And Adam wasobedientunto the commandments of the Lord.\n6. And after many days anangelof the Lord appeared unto Adam, saying: Why dost thou offersacrificesunto the Lord? And Adam said unto him: I know not, save the Lord commanded me.\n7. And then the angel spake, saying: This thing is asimilitudeof thesacrificeof the Only Begotten of the Father, which is full ofgraceandtruth.\n8. Wherefore, thou shalt do all that thou doest in thenameof the Son, and thou shaltrepentandcallupon God in the name of the Son forevermore.\n9. And in that day theHoly Ghostfell upon Adam, which beareth record of the Father and the Son, saying: I am theOnly Begottenof the Father from the beginning, henceforth and forever, that as thou hastfallenthou mayest beredeemed,and all mankind, even as many as will.\n10. And in that day Adam blessed God and wasfilled, and began toprophesyconcerning all the families of the earth, saying: Blessed be the name of God, for because of mytransgressionmyeyesare opened, and in this life I shall havejoy, and again in thefleshI shall see God.\n11. And Eve, his wife, heard all these things and was glad, saying: Were it not for our transgression we never should have hadseed, and never should haveknowngood and evil, and the joy of our redemption, and the eternal life which God giveth unto all the obedient.\n12. And Adam andEveblessed the name of God, and they made all thingsknownunto their sons and their daughters.\n13. AndSatancame among them, saying: I am also son of God; and he commanded them, saying:Believeit not; and they believed it not, and theylovedSatan more than God. And men began from that time forth to becarnal, sensual, and devilish.\n14. And the Lord God called upon men by theHoly Ghosteverywhere and commanded them that they should repent;\n15. And as many asbelievedin the Son, and repented of their sins, should besaved; and as many as believed not and repented not, should bedamned; and the words went forth out of the mouth of God in firm decree; wherefore they must be fulfilled.\n16. And Adam and Eve, his wife, ceased not to call upon God. And Adam knew Eve his wife, and she conceived and bareCain, and said: I have gotten man from the Lord; wherefore he may not reject his words. But behold, Cainhearkenednot, saying: Who is the Lord that I shouldknowhim?\n17. And she again conceived and bare his brother Abel. And Abelhearkenedunto the voice of the Lord. AndAbelwas keeper of sheep, but Cain was tiller of the ground.\n18. And CainlovedSatan more than God. And Satan commanded him, saying:Makean offering unto the Lord.\n19. And in process of time it came to pass that Cain brought of thefruitof the ground an offering unto the Lord.\n20. And Abel, he also brought of thefirstlingsof his flock, and of the fat thereof. And the Lord hadrespectunto Abel, and to hisoffering;\n21. But unto Cain, and to hisoffering, he had not respect. Now Satan knew this, and itpleasedhim. And Cain was very wroth, and his countenance fell.\n22. And the Lord said unto Cain: Why art thou wroth? Why is thy countenance fallen?\n23. If thou doest well, thou shalt beaccepted. And if thou doest not well, sin lieth at the door, and Satandesirethto have thee; and exceptthou shalt hearken unto my commandments, I willdeliverthee up, and it shall be unto thee according to his desire. And thou shaltruleover him;\n24. For from this time forth thou shalt be the father of hislies; thou shalt be calledPerdition; for thou wast alsobeforethe world.\n25. And it shall be said in time to comeThat these abominations were had fromCain; for he rejected the greater counsel which was had from God; and this is acursingwhich I will put upon thee, except thou repent.\n26. And Cain was wroth, and listened not any more to the voice of the Lord, neither to Abel, his brother, who walked in holiness before the Lord.\n27. And Adam and his wifemournedbefore the Lord, because of Cain and his brethren.\n28. And it came to pass that Cain took one of his brothers daughters towife, and theylovedSatan more than God.\n29. And Satan said unto Cain:Swearunto me by thy throat, and if thou tell it thou shalt die; and swear thy brethren by their heads, and by the living God, that they tell it not; for if they tell it, they shall surely die; and this that thy father may not know it; and this day I will deliver thy brother Abel into thine hands.\n30. And Satan sware unto Cain that he would do according to hiscommands. And all these things were done in secret.\n31. And Cain said: Truly I am Mahan, the master of this greatsecret, that I maymurderand getgain. Wherefore Cain was called MasterMahan, and he gloried in his wickedness.\n32. And Cain went into the field, and Cain talked with Abel, his brother. And it came to pass that while they were in the field, Cain rose up against Abel, his brother, and slew him.\n33. And Caingloriedin that which he had done, saying: I am free; surely theflocksof my brother falleth into my hands.\n34. And the Lord said unto Cain: Where is Abel, thy brother? And he said: I know not. Am I my brotherskeeper?\n35. And the Lord said: What hast thou done? The voice of thy brothersbloodcries unto me from the ground.\n36. And now thou shalt becursedfrom the earth which hath opened her mouth to receive thy brothers blood from thy hand.\n37. When thou tillest the ground it shall not henceforth yield unto thee herstrength. Afugitiveand vagabond shalt thou be in the earth.\n38. And Cain said unto the Lord: Satantemptedme because of my brothers flocks. And I was wroth also; for his offering thou didst accept and not mine; mypunishmentis greater than I can bear.\n39. Behold thou hast driven me out this day from the face of the Lord, and from thy face shall I be hid; and I shall be fugitive and vagabond in the earth; and it shall come to pass, that he that findeth me will slay me, because of mine iniquities, for these things are not hid from the Lord.\n40. And I the Lord said unto him:Whosoever slayeth thee, vengeance shall be taken on him sevenfold. And I the Lord set amarkupon Cain, lest any finding him should kill him.\n41. And Cain wasshut outfrom thepresenceof the Lord, and with his wife and many of his brethren dwelt in the land of Nod, on the east of Eden.\n42. And Cain knew his wife, and she conceived and bare Enoch, and he also begat many sons and daughters. And he builded city, and he called the name of thecityafter the name of his son, Enoch.\n43. And unto Enoch was born Irad, and other sons and daughters. And Irad begat Mahujael, and other sons and daughters. And Mahujael begat Methusael, and other sons and daughters. And Methusael begat Lamech.\n44. And Lamech took unto himself two wives; the name of one being Adah, and the name of the other, Zillah.\n45. And Adah bare Jabal; he was the father of such as dwell intents, and they were keepers of cattle; and his brothers name was Jubal, who was the father of all such as handle the harp and organ.\n46. And Zillah, she also bare Tubal Cain, an instructor of every artificer in brass and iron. And the sister of Tubal Cain was called Naamah.\n47. And Lamech said unto his wives, Adah and Zillah: Hear my voice, ye wives of Lamech, hearken unto my speech; for I have slain man to my wounding, and young man to my hurt.\n48. If Cain shall be avenged sevenfold, truly Lamech shall beseventy and seven fold;\n49. ForLamechhaving entered into covenant with Satan, after the manner of Cain, wherein he became Master Mahan, master of that great secret which was administered unto Cain by Satan; and Irad, the son of Enoch, having known their secret, began to reveal it unto the sons of Adam;\n50. Wherefore Lamech, being angry, slew him, not like unto Cain, his brother Abel, for the sake of getting gain, but he slew him for theoathssake.\n51. For, from the days of Cain, there was secretcombination, and their works were in the dark, and they knew every man his brother.\n52. Wherefore the LordcursedLamech, and his house, and all them that had covenanted with Satan; for they kept not the commandments of God, and it displeased God, and he ministered not unto them, and their works were abominations, and began to spread among all thesonsof men. And it was among the sons of men.\n53. And among the daughters of men these things were not spoken, because that Lamech had spoken the secret unto his wives, and they rebelled against him, and declared these things abroad, and had not compassion;\n54. Wherefore Lamech was despised, and cast out, and came not among the sons of men, lest he should die.\n55. And thus the works ofdarknessbegan to prevail among all the sons of men.\n56. And Godcursedthe earth with sore curse, and was angry with the wicked, with all the sons of men whom he had made;\n57. For they would nothearkenunto his voice, nor believe on his Only Begotten Son, even him whom he declared shouldcomein the meridian of time, who waspreparedfrom before the foundation of the world.\n58. And thus theGospelbegan to bepreached, from the beginning, being declared byholyangelssent forth from the presence of God, and by his own voice, and by the gift of the Holy Ghost.\n59. And thus all things were confirmed untoAdam, by an holy ordinance, and the Gospel preached, and decree sent forth, that it should be in the world, until the end thereof; and thus it was. Amen.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Moses": {
      "4": {
        "verses": {
          "1": {
            "text": "And I, theLord God, spake unto Moses, saying: ThatSatan, whom thou hast commanded in the name of mine Only Begotten, is the same which was from thebeginning, and he came before me, sayingBehold, here am I, send me, I will be thy son, and I willredeemall mankind, that one soul shall not be lost, and surelyIwill do it; whereforegiveme thine honor.",
            "citation": "(Moses 4:1)"
          },
          "2": {
            "text": "But, behold, my BelovedSon, which was my Beloved andChosenfrom the beginning, said unto meFather, thywill bedone, and theglorybe thine forever.",
            "citation": "(Moses 4:2)"
          },
          "3": {
            "text": "Wherefore, because thatSatanrebelledagainst me, and sought to destroy theagencyof man, which I, the Lord God, had given him, and also, that I should give unto him mine own power; by the power of mine Only Begotten, I caused that he should becast down;",
            "citation": "(Moses 4:3)"
          },
          "4": {
            "text": "And he becameSatan, yea, even thedevil, the father of alllies, todeceiveand to blind men, and to lead themcaptiveat his will, even as many as would nothearkenunto my voice.",
            "citation": "(Moses 4:4)"
          },
          "5": {
            "text": "And now the serpent was moresubtlethan any beast of the field which I, the Lord God, had made.",
            "citation": "(Moses 4:5)"
          },
          "6": {
            "text": "AndSatanput it into the heart of the serpent, (for he had drawn awaymanyafter him,) and he sought also tobeguileEve, for heknew notthemindof God, wherefore he sought to destroy the world.",
            "citation": "(Moses 4:6)"
          },
          "7": {
            "text": "And he said unto the woman: Yea, hath God saidYe shall not eat of every tree of the garden? (And he spake by the mouth of the serpent.)",
            "citation": "(Moses 4:7)"
          },
          "8": {
            "text": "And the woman said unto the serpent: We may eat of the fruit of the trees of the garden;",
            "citation": "(Moses 4:8)"
          },
          "9": {
            "text": "But of the fruit of the tree which thou beholdest in the midst of the garden, God hath saidYe shall not eat of it, neither shall ye touch it, lest ye die.",
            "citation": "(Moses 4:9)"
          },
          "10": {
            "text": "And the serpent said unto thewoman: Ye shall not surely die;",
            "citation": "(Moses 4:10)"
          },
          "11": {
            "text": "For God doth know that in the day ye eat thereof, then youreyesshall be opened, and ye shall be as gods,knowinggood and evil.",
            "citation": "(Moses 4:11)"
          },
          "12": {
            "text": "And when the woman saw that the tree was good for food, and that it became pleasant to the eyes, and tree to bedesiredto make her wise, she took of thefruitthereof, and dideat, and also gave unto her husband with her, and he did eat.",
            "citation": "(Moses 4:12)"
          },
          "13": {
            "text": "And the eyes of them both were opened, and they knew that they had beennaked. And they sewed fig leaves together and made themselvesaprons.",
            "citation": "(Moses 4:13)"
          },
          "14": {
            "text": "And they heard the voice of the Lord God, as they werewalkinginthe garden, in the cool of the day; and Adam and his wife went to hide themselves from thepresenceof the Lord God amongst the trees of the garden.",
            "citation": "(Moses 4:14)"
          },
          "15": {
            "text": "And I, the Lord God, called unto Adam, and said unto him: Wheregoestthou?",
            "citation": "(Moses 4:15)"
          },
          "16": {
            "text": "And he said: I heard thy voice in the garden, and I was afraid, because I beheld that I was naked, and I hid myself.",
            "citation": "(Moses 4:16)"
          },
          "17": {
            "text": "And I, the Lord God, said unto Adam: Who told thee thou wast naked? Hast thou eaten of the tree whereof I commanded thee that thou shouldst not eat, if so thou shouldst surelydie?",
            "citation": "(Moses 4:17)"
          },
          "18": {
            "text": "And the man said: The woman thou gavest me, and commandest that she should remain with me, she gave me of the fruit of the tree and I did eat.",
            "citation": "(Moses 4:18)"
          },
          "19": {
            "text": "And I, the Lord God, said unto the woman: What is this thing which thou hast done? And the woman said: The serpentbeguiledme, and I did eat.",
            "citation": "(Moses 4:19)"
          },
          "20": {
            "text": "And I, the Lord God, said unto the serpent: Because thou hast done this thou shalt becursedabove all cattle, and above every beast of the field; upon thy belly shalt thou go, and dust shalt thou eat all the days of thy life;",
            "citation": "(Moses 4:20)"
          },
          "21": {
            "text": "And I will putenmitybetween thee and the woman, between thy seed and her seed; and he shallbruisethy head, and thou shalt bruise his heel.",
            "citation": "(Moses 4:21)"
          },
          "22": {
            "text": "Unto the woman, I, the Lord God, said: I will greatly multiply thy sorrow and thy conception. Insorrowthou shalt bring forth children, and thy desire shall be to thyhusband, and he shall rule over thee.",
            "citation": "(Moses 4:22)"
          },
          "23": {
            "text": "And unto Adam, I, the Lord God, said: Because thou hast hearkened unto the voice of thy wife, and hast eaten of the fruit of the tree of which I commanded thee, sayingThou shalt not eat of it,cursedshall be the ground for thy sake; insorrowshalt thou eat of it all the days of thy life.",
            "citation": "(Moses 4:23)"
          },
          "24": {
            "text": "Thorns also, and thistles shall it bring forth to thee, and thou shalt eat the herb of the field.",
            "citation": "(Moses 4:24)"
          },
          "25": {
            "text": "By thesweatof thyfaceshalt thou eat bread, until thou shalt return unto the groundfor thou shalt surely diefor out of it wast thou taken: fordustthou wast, and unto dust shalt thou return.",
            "citation": "(Moses 4:25)"
          },
          "26": {
            "text": "And Adam called his wifes name Eve, because she was the mother of all living; for thus have I, the Lord God, called the first of all women, which aremany.",
            "citation": "(Moses 4:26)"
          },
          "27": {
            "text": "Unto Adam, and also unto his wife, did I, the Lord God, make coats ofskins, andclothedthem.",
            "citation": "(Moses 4:27)"
          },
          "28": {
            "text": "And I, the Lord God,saidunto mine Only Begotten: Behold, themanis become as one of us toknowgood and evil; and now lest he put forth his hand andpartakealso of thetree of life, and eat and live forever,",
            "citation": "(Moses 4:28)"
          },
          "29": {
            "text": "Therefore I, the Lord God, will send him forth from the Garden ofEden, to till the ground from whence he was taken;",
            "citation": "(Moses 4:29)"
          },
          "30": {
            "text": "For as I, the Lord God, liveth, even so mywordscannot returnvoid, for as they go forth out of my mouth they must be fulfilled.",
            "citation": "(Moses 4:30)"
          },
          "31": {
            "text": "So I drove out the man, and I placed at the east of the Garden ofEden,cherubimand flaming sword, which turned every way to keep the way of the tree of life.",
            "citation": "(Moses 4:31)"
          },
          "32": {
            "text": "(And these are the words which I spake unto my servant Moses, and they are true even as I will; and I have spoken them unto you. See thou show them unto no man, until I command you, except to them that believe. Amen.)",
            "citation": "(Moses 4:32)"
          }
        }
      },
      "5": {
        "verses": {
          "1": {
            "text": "And it came to pass that after I, the Lord God, had driven them out, that Adam began to till the earth, and to havedominionover all the beasts of the field, and to eat his bread by the sweat of hisbrow, as I the Lord had commanded him. And Eve, also, his wife, didlaborwith him.",
            "citation": "(Moses 5:1)"
          },
          "2": {
            "text": "AndAdamknew his wife, and she bare unto himsonsanddaughters, and they began tomultiplyand to replenish the earth.",
            "citation": "(Moses 5:2)"
          },
          "3": {
            "text": "And from that time forth, the sons anddaughtersof Adam began to divide two and two in the land, and to till the land, and to tend flocks, and they also begat sons and daughters.",
            "citation": "(Moses 5:3)"
          },
          "4": {
            "text": "And Adam and Eve, his wife,called uponthe name of the Lord, and they heard the voice of the Lord from the way toward the Garden ofEden, speaking unto them, and they saw him not; for they were shut out from hispresence.",
            "citation": "(Moses 5:4)"
          },
          "5": {
            "text": "And he gave unto them commandments, that they shouldworshipthe Lord their God, and should offer thefirstlingsof theirflocks, for an offering unto the Lord. And Adam wasobedientunto the commandments of the Lord.",
            "citation": "(Moses 5:5)"
          },
          "6": {
            "text": "And after many days anangelof the Lord appeared unto Adam, saying: Why dost thou offersacrificesunto the Lord? And Adam said unto him: I know not, save the Lord commanded me.",
            "citation": "(Moses 5:6)"
          },
          "7": {
            "text": "And then the angel spake, saying: This thing is asimilitudeof thesacrificeof the Only Begotten of the Father, which is full ofgraceandtruth.",
            "citation": "(Moses 5:7)"
          },
          "8": {
            "text": "Wherefore, thou shalt do all that thou doest in thenameof the Son, and thou shaltrepentandcallupon God in the name of the Son forevermore.",
            "citation": "(Moses 5:8)"
          },
          "9": {
            "text": "And in that day theHoly Ghostfell upon Adam, which beareth record of the Father and the Son, saying: I am theOnly Begottenof the Father from the beginning, henceforth and forever, that as thou hastfallenthou mayest beredeemed,and all mankind, even as many as will.",
            "citation": "(Moses 5:9)"
          },
          "10": {
            "text": "And in that day Adam blessed God and wasfilled, and began toprophesyconcerning all the families of the earth, saying: Blessed be the name of God, for because of mytransgressionmyeyesare opened, and in this life I shall havejoy, and again in thefleshI shall see God.",
            "citation": "(Moses 5:10)"
          },
          "11": {
            "text": "And Eve, his wife, heard all these things and was glad, saying: Were it not for our transgression we never should have hadseed, and never should haveknowngood and evil, and the joy of our redemption, and the eternal life which God giveth unto all the obedient.",
            "citation": "(Moses 5:11)"
          },
          "12": {
            "text": "And Adam andEveblessed the name of God, and they made all thingsknownunto their sons and their daughters.",
            "citation": "(Moses 5:12)"
          },
          "13": {
            "text": "AndSatancame among them, saying: I am also son of God; and he commanded them, saying:Believeit not; and they believed it not, and theylovedSatan more than God. And men began from that time forth to becarnal, sensual, and devilish.",
            "citation": "(Moses 5:13)"
          },
          "14": {
            "text": "And the Lord God called upon men by theHoly Ghosteverywhere and commanded them that they should repent;",
            "citation": "(Moses 5:14)"
          },
          "15": {
            "text": "And as many asbelievedin the Son, and repented of their sins, should besaved; and as many as believed not and repented not, should bedamned; and the words went forth out of the mouth of God in firm decree; wherefore they must be fulfilled.",
            "citation": "(Moses 5:15)"
          },
          "16": {
            "text": "And Adam and Eve, his wife, ceased not to call upon God. And Adam knew Eve his wife, and she conceived and bareCain, and said: I have gotten man from the Lord; wherefore he may not reject his words. But behold, Cainhearkenednot, saying: Who is the Lord that I shouldknowhim?",
            "citation": "(Moses 5:16)"
          },
          "17": {
            "text": "And she again conceived and bare his brother Abel. And Abelhearkenedunto the voice of the Lord. AndAbelwas keeper of sheep, but Cain was tiller of the ground.",
            "citation": "(Moses 5:17)"
          },
          "18": {
            "text": "And CainlovedSatan more than God. And Satan commanded him, saying:Makean offering unto the Lord.",
            "citation": "(Moses 5:18)"
          },
          "19": {
            "text": "And in process of time it came to pass that Cain brought of thefruitof the ground an offering unto the Lord.",
            "citation": "(Moses 5:19)"
          },
          "20": {
            "text": "And Abel, he also brought of thefirstlingsof his flock, and of the fat thereof. And the Lord hadrespectunto Abel, and to hisoffering;",
            "citation": "(Moses 5:20)"
          },
          "21": {
            "text": "But unto Cain, and to hisoffering, he had not respect. Now Satan knew this, and itpleasedhim. And Cain was very wroth, and his countenance fell.",
            "citation": "(Moses 5:21)"
          },
          "22": {
            "text": "And the Lord said unto Cain: Why art thou wroth? Why is thy countenance fallen?",
            "citation": "(Moses 5:22)"
          },
          "23": {
            "text": "If thou doest well, thou shalt beaccepted. And if thou doest not well, sin lieth at the door, and Satandesirethto have thee; and exceptthou shalt hearken unto my commandments, I willdeliverthee up, and it shall be unto thee according to his desire. And thou shaltruleover him;",
            "citation": "(Moses 5:23)"
          },
          "24": {
            "text": "For from this time forth thou shalt be the father of hislies; thou shalt be calledPerdition; for thou wast alsobeforethe world.",
            "citation": "(Moses 5:24)"
          },
          "25": {
            "text": "And it shall be said in time to comeThat these abominations were had fromCain; for he rejected the greater counsel which was had from God; and this is acursingwhich I will put upon thee, except thou repent.",
            "citation": "(Moses 5:25)"
          },
          "26": {
            "text": "And Cain was wroth, and listened not any more to the voice of the Lord, neither to Abel, his brother, who walked in holiness before the Lord.",
            "citation": "(Moses 5:26)"
          },
          "27": {
            "text": "And Adam and his wifemournedbefore the Lord, because of Cain and his brethren.",
            "citation": "(Moses 5:27)"
          },
          "28": {
            "text": "And it came to pass that Cain took one of his brothers daughters towife, and theylovedSatan more than God.",
            "citation": "(Moses 5:28)"
          },
          "29": {
            "text": "And Satan said unto Cain:Swearunto me by thy throat, and if thou tell it thou shalt die; and swear thy brethren by their heads, and by the living God, that they tell it not; for if they tell it, they shall surely die; and this that thy father may not know it; and this day I will deliver thy brother Abel into thine hands.",
            "citation": "(Moses 5:29)"
          },
          "30": {
            "text": "And Satan sware unto Cain that he would do according to hiscommands. And all these things were done in secret.",
            "citation": "(Moses 5:30)"
          },
          "31": {
            "text": "And Cain said: Truly I am Mahan, the master of this greatsecret, that I maymurderand getgain. Wherefore Cain was called MasterMahan, and he gloried in his wickedness.",
            "citation": "(Moses 5:31)"
          },
          "32": {
            "text": "And Cain went into the field, and Cain talked with Abel, his brother. And it came to pass that while they were in the field, Cain rose up against Abel, his brother, and slew him.",
            "citation": "(Moses 5:32)"
          },
          "33": {
            "text": "And Caingloriedin that which he had done, saying: I am free; surely theflocksof my brother falleth into my hands.",
            "citation": "(Moses 5:33)"
          },
          "34": {
            "text": "And the Lord said unto Cain: Where is Abel, thy brother? And he said: I know not. Am I my brotherskeeper?",
            "citation": "(Moses 5:34)"
          },
          "35": {
            "text": "And the Lord said: What hast thou done? The voice of thy brothersbloodcries unto me from the ground.",
            "citation": "(Moses 5:35)"
          },
          "36": {
            "text": "And now thou shalt becursedfrom the earth which hath opened her mouth to receive thy brothers blood from thy hand.",
            "citation": "(Moses 5:36)"
          },
          "37": {
            "text": "When thou tillest the ground it shall not henceforth yield unto thee herstrength. Afugitiveand vagabond shalt thou be in the earth.",
            "citation": "(Moses 5:37)"
          },
          "38": {
            "text": "And Cain said unto the Lord: Satantemptedme because of my brothers flocks. And I was wroth also; for his offering thou didst accept and not mine; mypunishmentis greater than I can bear.",
            "citation": "(Moses 5:38)"
          },
          "39": {
            "text": "Behold thou hast driven me out this day from the face of the Lord, and from thy face shall I be hid; and I shall be fugitive and vagabond in the earth; and it shall come to pass, that he that findeth me will slay me, because of mine iniquities, for these things are not hid from the Lord.",
            "citation": "(Moses 5:39)"
          },
          "40": {
            "text": "And I the Lord said unto him:Whosoever slayeth thee, vengeance shall be taken on him sevenfold. And I the Lord set amarkupon Cain, lest any finding him should kill him.",
            "citation": "(Moses 5:40)"
          },
          "41": {
            "text": "And Cain wasshut outfrom thepresenceof the Lord, and with his wife and many of his brethren dwelt in the land of Nod, on the east of Eden.",
            "citation": "(Moses 5:41)"
          },
          "42": {
            "text": "And Cain knew his wife, and she conceived and bare Enoch, and he also begat many sons and daughters. And he builded city, and he called the name of thecityafter the name of his son, Enoch.",
            "citation": "(Moses 5:42)"
          },
          "43": {
            "text": "And unto Enoch was born Irad, and other sons and daughters. And Irad begat Mahujael, and other sons and daughters. And Mahujael begat Methusael, and other sons and daughters. And Methusael begat Lamech.",
            "citation": "(Moses 5:43)"
          },
          "44": {
            "text": "And Lamech took unto himself two wives; the name of one being Adah, and the name of the other, Zillah.",
            "citation": "(Moses 5:44)"
          },
          "45": {
            "text": "And Adah bare Jabal; he was the father of such as dwell intents, and they were keepers of cattle; and his brothers name was Jubal, who was the father of all such as handle the harp and organ.",
            "citation": "(Moses 5:45)"
          },
          "46": {
            "text": "And Zillah, she also bare Tubal Cain, an instructor of every artificer in brass and iron. And the sister of Tubal Cain was called Naamah.",
            "citation": "(Moses 5:46)"
          },
          "47": {
            "text": "And Lamech said unto his wives, Adah and Zillah: Hear my voice, ye wives of Lamech, hearken unto my speech; for I have slain man to my wounding, and young man to my hurt.",
            "citation": "(Moses 5:47)"
          },
          "48": {
            "text": "If Cain shall be avenged sevenfold, truly Lamech shall beseventy and seven fold;",
            "citation": "(Moses 5:48)"
          },
          "49": {
            "text": "ForLamechhaving entered into covenant with Satan, after the manner of Cain, wherein he became Master Mahan, master of that great secret which was administered unto Cain by Satan; and Irad, the son of Enoch, having known their secret, began to reveal it unto the sons of Adam;",
            "citation": "(Moses 5:49)"
          },
          "50": {
            "text": "Wherefore Lamech, being angry, slew him, not like unto Cain, his brother Abel, for the sake of getting gain, but he slew him for theoathssake.",
            "citation": "(Moses 5:50)"
          },
          "51": {
            "text": "For, from the days of Cain, there was secretcombination, and their works were in the dark, and they knew every man his brother.",
            "citation": "(Moses 5:51)"
          },
          "52": {
            "text": "Wherefore the LordcursedLamech, and his house, and all them that had covenanted with Satan; for they kept not the commandments of God, and it displeased God, and he ministered not unto them, and their works were abominations, and began to spread among all thesonsof men. And it was among the sons of men.",
            "citation": "(Moses 5:52)"
          },
          "53": {
            "text": "And among the daughters of men these things were not spoken, because that Lamech had spoken the secret unto his wives, and they rebelled against him, and declared these things abroad, and had not compassion;",
            "citation": "(Moses 5:53)"
          },
          "54": {
            "text": "Wherefore Lamech was despised, and cast out, and came not among the sons of men, lest he should die.",
            "citation": "(Moses 5:54)"
          },
          "55": {
            "text": "And thus the works ofdarknessbegan to prevail among all the sons of men.",
            "citation": "(Moses 5:55)"
          },
          "56": {
            "text": "And Godcursedthe earth with sore curse, and was angry with the wicked, with all the sons of men whom he had made;",
            "citation": "(Moses 5:56)"
          },
          "57": {
            "text": "For they would nothearkenunto his voice, nor believe on his Only Begotten Son, even him whom he declared shouldcomein the meridian of time, who waspreparedfrom before the foundation of the world.",
            "citation": "(Moses 5:57)"
          },
          "58": {
            "text": "And thus theGospelbegan to bepreached, from the beginning, being declared byholyangelssent forth from the presence of God, and by his own voice, and by the gift of the Holy Ghost.",
            "citation": "(Moses 5:58)"
          },
          "59": {
            "text": "And thus all things were confirmed untoAdam, by an holy ordinance, and the Gospel preached, and decree sent forth, that it should be in the world, until the end thereof; and thus it was. Amen.",
            "citation": "(Moses 5:59)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 45468,
  "total_sources": 4,
  "generated_at": "2025-12-14T04:01:27.364442"
}