{
  "week_number": 12,
  "date_range": "Genesis 42–50",
  "title": "",
  "primary_scriptures": [
    {
      "book": "Genesis",
      "chapters": [
        "42",
        "43",
        "44",
        "45",
        "46",
        "47",
        "48",
        "49",
        "50"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Genesis",
      "chapters": [
        "42",
        "43",
        "44",
        "45",
        "46",
        "47",
        "48",
        "49",
        "50"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM:  ---\nIt had been about 22 years since Joseph’s brothers sold him into slavery. Joseph had suffered many trials, including false accusations and imprisonment. When he finally saw his brothers again, Joseph was the governor of all Egypt, second only to the pharaoh. He could easily have taken revenge on his brothers, and considering what they had done to Joseph, that might seem understandable. And yet Joseph forgave them. Not only that, but he helped them see divine purpose in his suffering. “God meant it unto good” (\nGenesis 50:20\n), he told them, because it put him in a position to save “all his father’s household” (\nGenesis 47:12\n) from famine.\nIn many ways, Joseph was like Jesus Christ. Even though our sins caused Jesus great suffering, He offers forgiveness, delivering all of us from a fate far worse than famine. Whether we need to receive forgiveness or extend it—at some point we all need to do both—Joseph’s example points us to the Savior, the true source of healing and reconciliation.\nIdeas for Learning at Home and at Church\nGenesis 45:5–7\n;\n47:12\n“God sent me before you to preserve you.”\nHave you noticed any similarities between Joseph’s life and the atoning mission of Jesus Christ? To see some examples of these similarities, try comparing:\nGenesis 37:3\nwith\nMatthew 3:17\n.\nGenesis 37:26–28\nwith\nMatthew 26:14–16\n.\nGenesis 45:5–7\nwith\nLuke 4:18\n.\nGenesis 47:12\nwith\nJohn 6:35\n.\nWhat impressions do you have about the Savior and His mission as you read these passages?\nGenesis 45\n;\n50:15–21\nForgiveness brings healing.\nReading about Joseph forgiving his brothers of the terrible things they had done may prompt you to think about someone you are currently struggling to forgive. The following questions may help as you strive to apply this principle:\nWhy might it have been hard for Joseph to forgive his brothers? (to review what they did to him, see\nGenesis 37\n). What experiences or attitudes might have given Joseph the strength to forgive? (see, for example,\nGenesis 45:1–15\nor\n50:15–21\n).\nWhat blessings came from Joseph’s forgiveness of his brothers? For example, compare the relationships in Jacob’s family at the beginning of the story (see, for example,\nGenesis 37:3–11\n) with the relationships at the end (see\nGenesis 45:9–15\n;\n50:15–21\n). How might things have turned out differently if Joseph had not been willing to forgive?\nConsider writing down the name of someone who may need your forgiveness—whether or not they have asked for forgiveness. What can you do to invite the Savior’s healing power into that situation? If forgiving seems too difficult, consider reviewing the counsel of Elder Gerrit W. Gong in the last six paragraphs of his message “\nHappy and Forever\n” (\nLiahona\n, Nov. 2022, 85). What do you find that gives you hope that you can forgive?\nSee also\nDoctrine and Covenants 64:9–11\n; “Forgiveness: My Burden Was Made Light” (video), Gospel Library.\n8:24\nForgiveness: My Burden Was Made Light\nGenesis 49\nJacob gave his family prophetic blessings.\nJacob’s blessings to his posterity contain vivid imagery, but they aren’t easy to understand. Thankfully, the restored gospel gives us some help. When you read the blessing to Joseph in\nGenesis 49:22–26\n, read the following verses too, and see what insights they provide:\n1 Nephi 15:12\n;\n2 Nephi 3:4–5\n;\nJacob 2:25\n;\nDoctrine and Covenants 50:44\n.\nAs you read about Judah’s blessing in\nGenesis 49:8–12\n, remember that Jesus Christ was a descendant of Judah. What do you find in these verses that reminds you of the Savior? (see also\nRevelation 5:5–6, 9\n;\n1 Nephi 15:14–15\n;\nDoctrine and Covenants 45:59\n;\n133:46–50\n).\nReading these blessings might inspire you to review your patriarchal blessing—or, if you don’t have one, to receive one. What words and phrases in your blessing turn your thoughts to Jesus Christ?\nSee also Randall K. Bennett, “\nYour Patriarchal Blessing—Inspired Direction from Heavenly Father\n,”\nLiahona\n, May 2023, 42–44.\nGenesis 50:19–21\nGod can help me find meaning in my trials.\nThough it may not have been clear while he was going through it, Joseph was eventually able to look back on his adversity in Egypt and see that “God meant it unto good” (\nGenesis 50:20\n). If you could have visited Joseph while he was in the pit or in prison, how would you have comforted him? How can\nGenesis 50:19–21\nhelp you in your times of trial?\nSee also\nDoctrine and Covenants 122\n; “\nHow Firm a Foundation\n,”\nHymns\n, no. 85.\nJoseph Smith among the Prophets\n, by Paul Mann (detail)\nGenesis 50:24–25\n“A seer shall the Lord my God raise up.”\nAs you read\nGenesis 50:24–25\nand\nJoseph Smith Translation, Genesis 50:24–38\n(in the Bible appendix), ponder why it would have been important for Joseph to know about Moses and Joseph Smith so many centuries in advance. How did Joseph Smith fulfill Joseph’s prophecies about him? (see\nDoctrine and Covenants 1:17–23\n;\n20:7–12\n;\n39:11\n;\n135:3\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Joseph test his brothers?\nWhy did Jacob adopt Joseph’s two sons?\nWhy did Jacob place his right hand on Ephraim instead of Manasseh?\nClick to see more.\nIdeas for Teaching Children\nGenesis 42–44\n;\n45:4–15\nI can show love and forgiveness to my family.\nIt might be fun for your children to reenact the story of Joseph reuniting his family (see\nGenesis 42–44\n). Or they could use “\nJoseph and the Famine\n” (in\nOld Testament Stories\n, 57–60) or pictures in this outline to teach the story to each other. Here are some questions that could help your children learn from the story:\nWhat did Joseph do to show love for his family? (see\nGenesis 45:4–15\n).\nWhy do you feel Joseph forgave his brothers?\nHow do you think Joseph’s brothers felt when they found out Joseph had forgiven them? Who in your life needs to be forgiven? How can you show love and forgiveness?\n2:26\nJoseph and the Famine\nAs you prepare to teach, ask, “What will my children do to learn?”\nFor example, in this activity your children are acting out or retelling a story. Doing this will help them remember both what happened and the gospel principles contained in the story.\nYou or your children may want to share an experience when they forgave someone or when someone forgave them. You could then sing a song such as “\nLove One Another\n” (\nChildren’s Songbook\n, 136) or “\nHelp Me, Dear Father\n” (\nChildren’s Songbook\n, 99).\nGenesis 48:8–9\nThe Lord helps me through priesthood blessings.\nYou and your children could look at the picture of Jacob blessing his sons at the end of this outline and discuss what is happening (see\nGenesis 48:8–9\n). If needed, explain that Jacob, Joseph’s father, wanted to give priesthood blessings to his family. Perhaps you could share with each other any experiences you’ve had receiving help from God through a priesthood blessing. What are some reasons we might ask for a priesthood blessing?\nGenesis 45:5–11\nHeavenly Father sent Jesus Christ to save me.\nHow can you help your children see the Savior in the story of Joseph saving his family from famine? Consider making a chart with two columns labeled\nJoseph\nand\nJesus Christ\n. Help your children search the following pairs of scriptures and fill in the chart with things that Joseph and Jesus have in common:\nGenesis 37:3\nand\nMatthew 3:17\n;\nGenesis 37:26–28\nand\nMatthew 26:14–16\n;\nGenesis 45:5–7\nand\nLuke 4:18\n; and\nGenesis 47:12\nand\nJohn 6:35\n.\nAsk your children what it means to save or rescue someone. If any of them have had an experience being saved or rescued from danger, invite them to share. How did Joseph save his brothers? (see\nGenesis 42:1–3\n;\n45:5–7\n). Then you could look at a picture of the Savior together and ask your children to talk about how Jesus saves us.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 12: Lesson 35: Lesson 35—Genesis 42–50This lesson can help students follow the Savior’s example by being more forgiving.; Lesson 36: Lesson 36—JST Genesis 50This lesson can help students strengthen their testimonies that the Lord called Joseph Smith to be a prophet.... ---\n\n--- Lesson 35 ---\nMany years after he was sold into Egypt as a slave, Joseph was reunited with his brothers. He could have had felt angry and resentful because of all that he suffered. However, like the Savior, Joseph chose to extend mercy and forgiveness to his brothers who had mistreated him. This lesson can help students follow the Savior’s example by being more forgiving. Student preparation: Invite students to ponder the Savior’s commandment to “forgive all men” ( Doctrine and Covenants 64:10 ). Ask them to list some of the blessings they or others have experienced through forgiving someone. Possible Learning Activities Joseph of Egypt To begin class, consider inviting students to briefly review the account of Joseph of Egypt in Genesis 37–41 . You could ask them to summarize the unkind actions of Joseph’s brothers and the events that led to Joseph’s status as second in command of all of Egypt. The digital images found in Lesson 33: Genesis 37–41 could be used to help students summarize the story. What are some of the ways Joseph suffered because of his brothers’ actions? How would you feel about someone who did this to you? What can make it hard to forgive someone? Reflect on how you typically respond when someone does or says something hurtful to you. As you study today, pay close attention to any impressions you might receive from the Holy Ghost to help you know how you can follow the Savior’s example to forgive. Joseph was reunited with his brothers To study the story of Joseph’s reunion with his brothers, you could organize students in groups of three. Each student in the group could study one of the three summaries and scripture passages. Students could then teach the other members of the group their part of the story. Alternately, you could show the animated video “ Joseph and the Famine ” (2:26) from time code 00:00 to 01:41 on ChurchofJesusChrist.org . 2:26 Review the following summaries and study the accompanying verses. Summary 1: Many years after they sold Joseph as a slave, his brothers traveled to Egypt to seek relief from a famine. Presenting themselves before Joseph, now second in command of all Egypt, the brothers did not recognize him. Not knowing that Joseph recognized and could understand them, the brothers expressed their sorrow and regret for what they had done years earlier to him. Read Genesis 42:21–24 , looking for how Joseph reacted to hearing his brothers talk about how they had treated him. Summary 2: Joseph provided food for the family but imprisoned Simeon and instructed the other brothers not to return to Egypt unless they brought the youngest brother, Benjamin, with them. The brothers returned home, but when the family ran out of food again, they returned to Egypt with Benjamin. Read Genesis 43:30 , looking for how Joseph reacted to seeing his brother Benjamin. Summary 3: Joseph tested his brothers’ love for Benjamin by accusing him of stealing and threatening to throw him in jail. Judah offered his life in exchange for Benjamin’s. Read Genesis 45:1–2 , looking for how Joseph reacted after Judah volunteered to give his life to protect Benjamin. After students have had a chance to study the summaries, you could invite them to discuss the following question. What would have been helpful for Joseph to remember about Heavenly Father and Jesus Christ as he interacted with his brothers? Heavenly Father and Jesus Christ forgive The following scriptures illustrate the forgiving nature of both Heavenly Father and Jesus Christ. You could display these scriptures for students to study or have them find their own scripture passages about the forgiving nature of Heavenly Father and Jesus Christ. Read the following scriptures, looking for what would be helpful for someone who has been mistreated to know about Heavenly Father and Jesus Christ. Luke 6:36 Ephesians 4:31–32 Colossians 3:13 What would you share from these verses? Read Genesis 45:3–8 and 9–15 , looking for how Joseph responded to his brothers. What do we learn about becoming like Heavenly Father and Jesus Christ from Joseph’s example? Students might identify a variety of truths. Thank them for what they share and ask them why they feel it is an important doctrine or principle for us to know. If students do not mention it, share the following truth and write it on the board: We become like Heavenly Father and Jesus Christ as we forgive others. By relying on the Savior, we can forgive others To help students understand this truth, you could show the video “ Forgiving Others: An Easter Message from President Russell M. Nelson ” (5:01) from ChurchofJesusChrist.org . 5:1 Another option is to study the following statement. President Russell M. Nelson helped us understand how we rely on the Savior’s power when we forgive others. 17:18 If forgiveness presently seems impossible, plead for power through the atoning blood of Jesus Christ to help you. As you do so, I promise personal peace and a burst of spiritual momentum. When the Savior atoned for all mankind, He opened a way that those who follow Him can have access to His healing, strengthening, and redeeming power. These spiritual privileges are available to all who seek to hear Him and follow Him. (“ The Power of Spiritual Momentum ,” Liahona , May 2022, 100) How can President Nelson’s teachings help us forgive others? What would you counsel someone to do if they are struggling to forgive? What would you recommend they do to rely on the Savior? If students need help with the last question, you may suggest they look at the Lord’s counsel in Doctrine and Covenants 64:9–11 , particularly verse 11 . Consider inviting students to share an experience where they or someone they know was able to forgive. It might be helpful to remind students not to share details that might be too personal about them or someone they know. You may also want to share an experience of your own. Help us to freely forgive To help students reflect on what they have learned and felt about becoming like Heavenly Father and Jesus Christ, you could display some of the following activities for students to complete in their study journals. Prayerfully ponder any impressions you have received as you studied today. Invite the Holy Ghost to help you recognize any changes you need to make. Ask Heavenly Father to help increase your ability to forgive others. Select one of the following activities to complete in your study journal. Write a short paragraph that summarizes how you have been blessed by your efforts to forgive others. List what you have done to include the Savior in your efforts. What do you feel is important to remember the next time you need to forgive someone? Prayerfully consider if there is someone in your life you need to forgive. Write a short paragraph identifying the feelings you have about forgiving that person. What do you recognize that may be preventing your ability to forgive? List some ways you can seek the Savior’s help in your efforts. Write a note that could help a friend who is struggling to forgive someone. Briefly explain how Joseph’s choice to forgive his brothers was like the Savior. Include a scripture passage that has been meaningful to you in your efforts to forgive others. You could invite a few willing students to share what they wrote. Consider concluding the lesson by inviting students to act on any spiritual impressions they may have received. You might share your witness of the blessings available when we follow the Savior’s example to forgive others.\n\n\n--- Lesson 36 ---\nShortly before his death, Joseph of Egypt prophesied that in the latter days the Lord would raise up Joseph Smith to do His work. We can receive our own witness that Joseph Smith was the Lord’s servant. This lesson can help students strengthen their testimonies that the Lord called Joseph Smith to be a prophet. Student preparation: Invite students to write down what the Prophet Joseph Smith has done that has helped them come closer to Jesus Christ. They might ask a family member or friend to share their thoughts and feelings as well. Possible Learning Activities Delivering the Lord’s people Consider displaying the images of Joseph in Egypt and of Moses. Ask students to identify how the Lord used each of these individuals as a deliverer (a person who rescues others). Next, show the image of Joseph Smith and ask students how the Lord used him as a deliverer. Finally, show an image of Jesus Christ, the Deliverer, and discuss ways that Jesus Christ delivers us. After students share their thoughts, use the images and the paragraph below to summarize the events and prophecies in the Joseph Smith Translation of Genesis 50 . At the end of his life, Joseph of Egypt prophesied that the Lord would raise up two prophets, who are descended from Jacob, to help deliver His people out of bondage. Moses would come to deliver the Israelites out of physical bondage in Egypt (see JST Genesis 50:24, 29 ). Then, in the latter days, the Lord would deliver His people from spiritual darkness through the Prophet Joseph Smith. To help students assess what they know and believe about Joseph Smith, consider inviting them to answer the following questions in their study journals. What thoughts or feelings come to mind when you think about the Prophet Joseph Smith? How would you describe the current state of your testimony that he was called by God to be a prophet? As you study today, listen for impressions from the Spirit confirming that the Lord called Joseph Smith as a prophet. Heavenly Father can send thoughts to your mind or feelings to your heart through the Holy Ghost telling you that what you are studying is true. Joseph of Egypt prophesies of Joseph Smith Invite students to create a blank chart similar to the one below in their study journals. Students may work in pairs or small groups to complete the chart. You could use the information provided in the chart to show how this can be done and help students discover answers as needed. You might help students locate the Joseph Smith Translation Appendix in their scriptures or in Study Helps in Gospel Library. You might also remind students that a seer is a revelator and prophet who knows the past, present, and future (see Mosiah 8:17 ), the “fruit of thy loins” ( JST Genesis 50:27 ) refers to Joseph of Egypt’s posterity or descendants, the writings of Joseph’s seed refers to the Book of Mormon, and the writings of Judah’s seed refers to the Bible (see JST Genesis 50:31 ). Read Joseph Smith Translation Genesis 50:26–33 to complete the following chart. Prophecy about Joseph Smith (including the verse): Possible ways this prophecy was fulfilled: Prophecy about Joseph Smith (including the verse): “He shall be esteemed highly” ( verse 27 ) Possible ways this prophecy was fulfilled: Millions of believers consider Joseph Smith to be the Prophet of the Restoration. Prophecy about Joseph Smith (including the verse): “He shall bring them to the knowledge of the covenants which I have made with thy fathers” ( verse 28 ) Possible ways this prophecy was fulfilled: Through the restored priesthood, we can make covenants with God through baptismal and other ordinances. One of the purposes of the Book of Mormon is to bring the House of Israel to a knowledge of the covenants of the Lord. Prophecy about Joseph Smith (including the verse): “Unto him will I give power to bring forth my word” ( verse 30 ) Possible ways this prophecy was fulfilled: The Lord revealed the Book of Mormon, the Doctrine and Covenants, the Joseph Smith Translation, and other inspired writings through Joseph Smith. Prophecy about Joseph Smith (including the verse): “Out of weakness shall he be made strong” ( verse 32 ) Possible ways this prophecy was fulfilled: From humble beginnings and little formal education, Joseph Smith became a mighty prophet. Prophecy about Joseph Smith (including the verse): “They that seek to destroy him shall be confounded” ( verse 33 ) Possible ways this prophecy was fulfilled: Those who seek to discredit Joseph Smith and his work will be unsuccessful. As part of your discussion, you could point out that the phrase “raised up” is used seven times in these verses. Some possible meanings for this phrase are called, chosen, or prepared to do a work that would bring the Lord’s people unto salvation ( verse 33 ). You could also invite students to identify another pattern by marking each time the Lord is the one doing the action, such as “will I raise up” ( verse 27 ) or “will I give power” ( verse 30 ). What prophecies stood out to you in these verses? Why? Among possible truths the students may identify, point out the following: The Lord chose and prepared Joseph Smith to bring forth the Book of Mormon. Invite students to consider writing this truth next to verses 30–33 . What truths can you identify about the Lord from what you studied about Joseph Smith? How do you think the Book of Mormon brings the Lord’s people unto salvation? How has the Book of Mormon blessed your life? Gaining a spiritual witness of the Prophet Joseph Smith Elder Neil L. Andersen of the Quorum of the Twelve Apostles taught: Each believer needs a spiritual confirmation of the divine mission and character of the Prophet Joseph Smith. This is true for every generation. (“ Joseph Smith ,” Ensign or Liahona , Nov. 2014, 29–30) Why do you think it is important for each of us to receive a spiritual confirmation from Heavenly Father, through the Holy Ghost, about Joseph Smith’s divine mission? Share the following statement by Elder Andersen or show the video “ Joseph Smith ” on ChurchofJesusChrist.org from time code 11:44 to 12:48. 14:49 Elder Andersen shared two ways we can gain or strengthen our testimony of the Prophet Joseph Smith. To the youth listening today or reading these words in the days ahead, I give a specific challenge: Gain a personal witness of the Prophet Joseph Smith. Let your voice help fulfill Moroni’s prophetic words to speak good of the Prophet. Here are two ideas: First, find scriptures in the Book of Mormon that you feel and know are absolutely true. Then share them with family and friends in family home evening, seminary, and your Young Men and Young Women classes, acknowledging that Joseph was an instrument in God’s hands. Next, read the testimony of the Prophet Joseph Smith in the Pearl of Great Price. … This is Joseph’s own testimony of what actually occurred. Read it often. (“ Joseph Smith ,” Ensign or Liahona , Nov. 2014, 30) After sharing this statement, invite students to choose one of Elder Andersen’s suggestions to strengthen their personal witness that the Lord called Joseph Smith as a prophet. Option 1: Find one or more personally meaningful scriptures in the Book of Mormon. Create a picture or write a paragraph highlighting your selection. Include your thoughts and feelings about how the Book of Mormon and its teachings help you learn about and love the Savior. Also include how this helps confirm that Joseph was an instrument in God’s hands. Option 2: Read Joseph Smith’s testimony as recorded in Joseph Smith History 1:15–20 and the testimony of Joseph Smith recorded in Doctrine and Covenants 135:3 . Create a picture or write a paragraph about what you have learned and felt about how the Savior chose and prepared Joseph Smith to be the prophet of the Restoration. Testify of the Prophet Joseph Smith When students have completed the activity, invite them to share what they created with a class member. Then, you might invite a few willing students to testify about how Jesus Christ called Joseph Smith to be a prophet. The following questions can help. What have you learned today that has strengthened your testimony of Joseph Smith? How does having a testimony of Joseph Smith strengthen your testimony of Jesus Christ? Consider closing with your testimony of the work the Lord performed through Joseph Smith. Invite students to continue to listen for impressions from the Spirit to know for themselves that Jesus Christ called Joseph Smith to be a prophet.\n\n\n--- Lesson 37 ---\nReflecting on and assessing our spiritual learning can help us draw closer to Heavenly Father and Jesus Christ. This lesson is intended to help students reflect on the goals they have set and the growth they have experienced during their study of Genesis 12–50 and Abraham 1–2 . Student preparation: Invite students to come ready to share ways they have grown spiritually from their study of the Old Testament and the Pearl of Great Price this year. You might suggest that they review their study journals or notes in their scriptures to help them notice their growth and learning. Possible Learning Activities Your class’s study of Abraham 1–2 and Genesis 12–50 may have focused on different outcomes than the outcomes assessed in this lesson. If so, adapt the activities to assess the growth students experienced from the outcomes your class focused on. In this lesson, students will have the opportunity to assess their progress in the following three areas: Explain the importance of eternal marriage in Heavenly Father’s plan. ( Note: This activity is based on teachings from Lesson 9: “ Genesis 1:28–2:25 ” and Lesson 29: “ Genesis 24 .”) Feel an increased desire to make and keep covenants with God. ( Note: This activity is based on teachings from Lesson 23: “ Genesis 12, 17 ” and Lesson 31: “ Genesis 28 .”) Participate in the gathering of Israel. ( Note: This activity is based on teachings from Lesson 24: “ Abraham 2:9–11 .”) Becoming more like Jesus Christ Identifying how they are growing spiritually can help students in their efforts to become disciples of Jesus Christ. To help them do this, consider displaying the following images. Alternatively, students could draw a picture of two trees in their study journals: a young tree and a mature tree. Imagine that these are pictures of the same tree taken a few years apart from each other. In your study journals, list any evidence you see that the tree is growing. Students could work in partnerships or small groups to share their lists and to answer the following questions. How can we compare these images of a tree to our spiritual growth to become more like Heavenly Father and Jesus Christ? What are some ways we can recognize how we are growing spiritually and becoming more like Heavenly Father and Jesus Christ? Explain that we can identify spiritual growth by reviewing what we have learned about Heavenly Father and Jesus Christ and how it has helped us improve our relationship with Them. Invite students to take a few minutes to review what they have learned and applied from their seminary experience this year. They could do this by looking through their scriptures and notes. What are you learning in seminary that is helping you grow spiritually and become more like Jesus Christ? What evidence of spiritual growth have you noticed in your life? Explain the importance of eternal marriage in Heavenly Father’s plan This exercise can help students explain the importance of eternal marriage in Heavenly Father’s plan. Invite students to turn to the image they may have drawn in Lesson 29: “ Genesis 24 .” Give students time to review what they learned about marriage in Lesson 9: “ Genesis 1:28–2:25 ” and Lesson 29: “ Genesis 24 .” Students could review any notes or insights they recorded in their study journals. They could also review the following verses and anything they may have marked in them: Genesis 1:27–28 Genesis 2:18, 21–24 Doctrine and Covenants 49:15–17 Doctrine and Covenants 131:1–4 To help students explain their understanding of eternal marriage, share a scenario like the following. You can adjust the scenario to meet the needs of your students. Today at school, you were talking about future plans with some friends. You mentioned marriage as one of your plans. One of your friends asked: “It seems like you have a lot of potential for a career. Why do you want to get married?” Using what you have learned about eternal marriage in Heavenly Father’s plan, how would you respond to your friend? Students might take a few minutes to plan their responses. Encourage students to find a few scriptures they have studied in the Old Testament or other places. Ask them to share those scriptures as part of their explanations. Consider placing students in partnerships. Invite each student to practice explaining what they would say to their friend. Feel an increased desire to make and keep covenants with God Students may have drawn a picture of Jacob’s dream as part of Lesson 31: “ Genesis 28 .” They could refer to their pictures as part of their review of covenants. You could also display the following image. Invite students to recall what they remember from the event depicted about making and keeping covenants (see also Lesson 23: “ Genesis 12, 17 ”). If helpful, students could review Genesis 28:10–21 . You might want to remind students that Jacob made covenants with God after leaving his parents’ home and starting life on his own. As part of Lesson 31: Genesis 28 , students reflected on the opportunity they will have to make covenants with God in the temple. Students may have written answers in their study journals to the following questions: What promised blessings have you experienced from striving to keep your covenants with God or by serving in the temple? What situations might you face in the future where you would benefit from the care and protection God promises to people who make covenants with Him? If relevant, invite students to review the answers they recorded. After sufficient time, provide students with paper and envelopes for the following activity. Using what you have learned about making and keeping covenants with God, write a letter to yourself that you could open at the end of high school. Write about why you feel it is important to make and keep covenants with God in the temple and throughout your life. Include how making covenants with God can increase your access to His guidance, care, and protection. Participate in the gathering of Israel In Lesson 24: “ Abraham 2:9–11 ,” students may have made a plan to participate in the gathering of Israel. If so, give students time to review their plans. Their plans may have included ways to share the gospel, to help others make or keep covenants with the Lord, or to bless others through temple and family history work. Students who haven’t yet created a plan can use the following visual to begin making one. You may have made plans to participate in the gathering of Israel. Reflect on these plans by filling out the following graphic in your study journal. Invite a few willing students to share what experiences they have had acting on their plans and how those experiences have affected them. Ask students to share how participating in the gathering of Israel has influenced their feelings for Heavenly Father and Jesus Christ. Invite students to continue to seek the help of the Holy Ghost to know ways they can participate in the gathering of Israel. Encourage students who may not have acted on a plan to begin now. Testify of the blessings the Lord will give them and others as they carry out their plans.\n\n--- SCRIPTURE: Genesis 42 ---\n1. Now when Jacob saw that there wascornin Egypt, Jacob said unto his sons, Why do ye look one upon another?\n2. And he said, Behold, I have heard that there is corn in Egypt: get you down thither, and buy for us from thence; that we may live, and not die.\n3. And Josephs ten brethren went down to buycornin Egypt.\n4. ButBenjamin, Josephs brother, Jacob sent not with his brethren; for he said, Lest peradventure mischief befall him.\n5. And the sons of Israel came to buycornamong those that came: for the famine was in the land of Canaan.\n6. And Josephwasthegovernorover the land,andheit wasthat sold to all the people of the land: and Josephs brethren came, andboweddown themselves before himwiththeir faces to the earth.\n7. And Joseph saw his brethren, and he knew them, but made himself strange unto them, and spake roughly unto them; and he said unto them, Whence come ye? And they said, From the land of Canaan to buy food.\n8. And Joseph knew his brethren, but they knew not him.\n9. And Joseph remembered thedreamswhich he dreamed of them, and said unto them, Yearespies; to see the nakedness of the land ye are come.\n10. And they said unto him, Nay, my lord, but to buy food are thy servants come.\n11. Weareall onemanssons; wearetruemen,thy servants are no spies.\n12. And he said unto them, Nay, but to see the nakedness of the land ye are come.\n13. And they said, Thy servantsaretwelve brethren, the sons of one man in the land of Canaan; and, behold, the youngestisthis day with our father, and oneisnot.\n14. And Joseph said unto them, Thatis itthat I spake unto you, saying, Yearespies:\n15. Hereby ye shall be proved: By the life of Pharaoh ye shall not go forth hence, except your youngest brother come hither.\n16. Send one of you, and let him fetch your brother, and ye shall be kept in prison, that your words may be proved, whetherthere be anytruth in you: or else by the life of Pharaoh surely yearespies.\n17. And he put them all together into ward three days.\n18. And Joseph said unto them the third day, This do, and live;forIfearGod:\n19. If yebetruemen,let one of your brethren be bound in the house of your prison: go ye, carry corn for the famine of your houses:\n20. But bring your youngest brother unto me; so shall your words be verified, and ye shall not die. And they did so.\n21. And they said one to another, Weareverilyguiltyconcerning our brother, in that we saw the anguish of his soul, when he besought us, and we would not hear; therefore is this distress come upon us.\n22. AndReubenanswered them, saying, Spake I not unto you, saying, Do not sin against the child; and ye would not hear? therefore, behold, also hisbloodis required.\n23. And they knew not that Joseph understoodthem;for he spake unto them by an interpreter.\n24. And he turned himself about from them, andwept; and returned to them again, and communed with them, and took from them Simeon, and bound him before their eyes.\n25. Then Joseph commanded to fill their sacks with corn, and to restore every mansmoneyinto his sack, and to give them provision for the way: and thus did he unto them.\n26. And they laded their asses with the corn, and departed thence.\n27. And as one of them opened his sack to give his ass provender in the inn, he espied hismoney; for, behold, itwasin his sacks mouth.\n28. And he said unto his brethren, My money is restored; and, lo,it iseven in my sack: and their heart failedthem,and they were afraid, saying one to another, WhatisthisthatGod hath done unto us?\n29. And they came unto Jacob their father unto the land of Canaan, and told him all that befell unto them; saying,\n30. The man,who isthe lord of the land, spake roughly to us, and took us for spies of the country.\n31. And we said unto him, Wearetruemen;we are no spies:\n32. Webetwelve brethren, sons of our father; oneisnot, and the youngestisthis day with our father in the land of Canaan.\n33. And the man, the lord of the country, said unto us, Hereby shall I know that yearetruemen;leave one of your brethrenherewith me, and takefood forthe famine of your households, and be gone:\n34. And bring your youngest brother unto me: then shall I know that yeareno spies, butthatyearetruemen: sowill I deliver you your brother, and ye shall traffick in the land.\n35. And it came to pass as they emptied their sacks, that, behold, every mans bundle of moneywasin his sack: and whenboththey and their father saw the bundles of money, they were afraid.\n36. And Jacob their father said unto them, Me have ye bereavedof my children:Josephisnot, and Simeonisnot, and ye will takeBenjaminaway:all these things are against me.\n37. AndReubenspake unto his father, saying, Slay my two sons, if I bring him not to thee: deliver him into my hand, and I will bring him to thee again.\n38. And he said, My son shall not go down with you; for his brother is dead, and he is left alone: if mischief befall him by the way in the which ye go, then shall ye bring down my gray hairs withsorrowto the grave.\n\n--- SCRIPTURE: Genesis 43 ---\n1. And the faminewassore in the land.\n2. And it came to pass, when they had eaten up the corn which they had brought out of Egypt, their father said unto them, Go again, buy us little food.\n3. And Judah spake unto him, saying, The man did solemnly protest unto us, saying, Ye shall not see my face, except yourbrotherbewith you.\n4. If thou wilt send our brother with us, we will go down and buy thee food:\n5. But if thou wilt not sendhim,we will not go down: for the man said unto us, Ye shall not see my face, except yourbrotherbewith you.\n6. And Israel said, Wherefore dealt yesoill with me,asto tell the man whether ye had yet brother?\n7. And they said, The man asked us straitly of our state, and of our kindred, saying,Isyour father yet alive? have yeanotherbrother? and we told him according to the tenor of these words: could we certainly know that he would say, Bring your brother down?\n8. And Judah said unto Israel his father, Send the lad with me, and we will arise and go; that we may live, and not die, both we, and thou,andalso our little ones.\n9. I will be surety for him; of my hand shalt thou require him: if I bring him not unto thee, and set him before thee, then let me bear theblamefor ever:\n10. For except we had lingered, surely now we had returned this second time.\n11. And their father Israel said unto them, Ifit must beso now, do this; take of the best fruits in the land in your vessels, and carry down the man present, little balm, and little honey, spices, and myrrh, nuts, and almonds:\n12. And take double money in your hand; and themoneythat was brought again in the mouth of your sacks, carryitagain in your hand; peradventure itwasan oversight:\n13. Take also your brother, and arise, go again unto the man:\n14. And God Almighty give you mercy before the man, that he may send away your other brother, and Benjamin. If I be bereavedof my children,I am bereaved.\n15. And the men took that present, and they took double money in their hand, and Benjamin; and rose up, and went down to Egypt, and stood before Joseph.\n16. And when Joseph saw Benjamin with them, he said to the ruler of his house, Bringthesemen home, and slay, and make ready; forthesemen shall dine with me at noon.\n17. And the man did as Joseph bade; and the man brought the men into Josephs house.\n18. And the men were afraid, because they were brought into Josephs house; and they said, Because of the money that was returned in our sacks at the first time are we brought in; that he may seek occasion against us, and fall upon us, and take us for bondmen, and our asses.\n19. And they came near to the steward of Josephs house, and they communed with him at the door of the house,\n20. And said, Osir, we came indeed down at the first time to buyfood:\n21. And it came to pass, when we came to the inn, that we opened our sacks, and, behold,everymansmoneywasin the mouth of his sack, our money in full weight: and we have brought it again in our hand.\n22. And other money have we brought down in our hands to buy food: we cannot tell who put our money in our sacks.\n23. And he said, Peacebeto you, fear not: your God, and the God of your father, hath given you treasure in your sacks: I had your money. And he brought Simeon out unto them.\n24. And the man brought the men into Josephs house, and gavethemwater, and theywashedtheir feet; and he gave their asses provender.\n25. And they made ready the present against Joseph came at noon: for they heard that they should eat bread there.\n26. And when Joseph came home, they brought him the present whichwasin their hand into the house, andbowedthemselves to him to the earth.\n27. And he asked them oftheirwelfare, and said,Isyour father well, the oldmanof whom ye spake?Ishe yet alive?\n28. And they answered, Thy servant our fatherisin good health, heisyet alive. And they bowed down their heads, and made obeisance.\n29. And he lifted up his eyes, and saw his brotherBenjamin, his mothers son, and said,Isthis your younger brother, of whom ye spake unto me? And he said, God be gracious unto thee, my son.\n30. And Joseph made haste; for his bowels did yearn upon his brother: and he soughtwhereto weep; and he entered intohischamber, andweptthere.\n31. And he washed his face, and went out, and refrained himself, and said, Set on bread.\n32. And they set on for him by himself, and for them by themselves, and for the Egyptians, which did eat with him, by themselves: because the Egyptians might not eat bread with the Hebrews; for thatisanabominationunto the Egyptians.\n33. And they sat before him, the firstborn according to hisbirthright, and the youngest according to his youth: and the men marvelled one at another.\n34. And he tookand sentmessesunto them from before him: butBenjaminsmess was five times so much as any of theirs. And they drank, and were merry with him.\n\n--- SCRIPTURE: Genesis 44 ---\n1. And he commanded the steward of his house, saying, Fill the mens sackswithfood, as much as they can carry, and put every mans money in his sacks mouth.\n2. And put my cup, the silver cup, in the sacks mouth of the youngest, and his corn money. And he did according to the word that Joseph had spoken.\n3. As soon as the morning was light, the men were sent away, they and their asses.\n4. Andwhen they were gone out of the city,andnotyetfar off, Joseph said unto his steward, Up, follow after the men; and when thou dost overtake them, say unto them, Wherefore have ye rewarded evil for good?\n5. Isnot thisitin which my lord drinketh, and whereby indeed he divineth? ye have done evil in so doing.\n6. And he overtook them, and he spake unto them these same words.\n7. And they said unto him, Wherefore saith my lord these words? God forbid that thy servants should do according to this thing:\n8. Behold, the money, which we found in our sacks mouths, we brought again unto thee out of the land of Canaan: how then should we steal out of thy lords house silver or gold?\n9. With whomsoever of thy servants it be found, both let him die, and we also will be my lords bondmen.\n10. And he said, Now alsoletitbeaccording unto your words: he with whom it is found shall be my servant; and ye shall be blameless.\n11. Then they speedily took down every man his sack to the ground, and opened every man his sack.\n12. And he searched,andbegan at the eldest, and left at the youngest: and the cup was found in Benjamins sack.\n13. Then theyrenttheir clothes, and laded every man his ass, and returned to the city.\n14. And Judah and his brethren came to Josephs house; for hewasyet there: and theyfellbefore him on the ground.\n15. And Joseph said unto them, What deedisthis that ye have done? wot ye not that such man as I can certainly divine?\n16. And Judah said, What shall we say unto my lord? what shall we speak? or how shall we clear ourselves? God hath found out the iniquity of thy servants: behold, wearemy lords servants, both we, andhealso with whom the cup is found.\n17. And he said, God forbid that I should do so:butthe man in whose hand the cup is found, he shall be my servant; and as for you, get you up in peace unto your father.\n18. Then Judah came near unto him, and said, Oh mylord, let thy servant, I pray thee, speak word in my lords ears, and let not thineangerburn against thy servant: for thouarteven as Pharaoh.\n19. My lord asked his servants, saying, Have ye father, or brother?\n20. And we said unto my lord, We have father, an oldman, and child of his old age, little one; and his brother is dead, and he alone is left of his mother, and his father loveth him.\n21. And thou saidst unto thy servants, Bring him down unto me, that I may set mine eyes upon him.\n22. And we said unto my lord, The lad cannot leave his father: forifheshould leave his father,his fatherwould die.\n23. And thou saidst unto thy servants, Except your youngestbrothercome down with you, ye shall see my face no more.\n24. And it came to pass when we came up unto thy servant my father, we told him the words of my lord.\n25. And our father said, Go again,andbuy us little food.\n26. And we said, We cannot go down: if our youngest brother be with us, then will we go down: for we may not see the mans face, except ouryoungestbrotherbewith us.\n27. And thy servant my father said unto us, Ye know that my wife bare me twosons:\n28. And the one went out from me, and I said, Surely he istorninpieces; and I saw him not since:\n29. And if yetakethis also from me, and mischief befallhim, ye shall bring down my gray hairs with sorrow to the grave.\n30. Now therefore when I come to thy servant my father, and the ladbenot with us; seeing that his life isboundup in the lads life;\n31. It shall come to pass, when he seeth that the ladisnotwith us,that he will die: and thy servants shall bring down the gray hairs of thy servant our father withsorrowto the grave.\n32. For thy servant became surety for the lad unto my father, saying, If I bring him not unto thee, then I shall bear theblameto my father for ever.\n33. Now therefore, I pray thee, let thy servant abide instead of the lad bondman to my lord; and let the lad go up with his brethren.\n34. For how shall I go up to my father, and the ladbenot with me? lest peradventure I see the evil that shall come on my father.\n\n--- SCRIPTURE: Genesis 45 ---\n1. Then Joseph could notrefrainhimself before all them that stood by him; and hecried, Cause every man to go out from me. And there stood no man with him, while Joseph made himself known unto his brethren.\n2. And he wept aloud: and the Egyptians and the house of Pharaoh heard.\n3. And Joseph said unto his brethren, IamJoseph; doth my father yet live? And his brethren could not answer him; for they weretroubledat his presence.\n4. And Joseph said unto his brethren, Come near to me, I pray you. And they came near. And he said, IamJosephyour brother, whom ye sold into Egypt.\n5. Now therefore be notgrieved, nor angry with yourselves, that ye sold me hither: for God didsendme before you to preserve life.\n6. For these two yearshaththe faminebeenin the land: and yetthere arefive years, in the whichthere shallneitherbeearing nor harvest.\n7. And God sent me before you topreserveyou aposterityin the earth, and to save your lives by great deliverance.\n8. So nowit wasnot youthatsent me hither, but God: and he hath made me father to Pharaoh, and lord of all his house, and arulerthroughout all the land of Egypt.\n9. Haste ye, and go up to my father, and say unto him, Thus saith thy son Joseph, God hath made me lord of all Egypt: come down unto me, tarry not:\n10. And thou shalt dwell in the land ofGoshen, and thou shalt be near unto me, thou, and thy children, and thy childrens children, and thy flocks, and thy herds, and all that thou hast:\n11. And there will Inourishthee; for yetthere arefive years of famine; lest thou, and thy household, and all that thou hast, come to poverty.\n12. And, behold, your eyes see, and the eyes of my brother Benjamin, thatit ismy mouth that speaketh unto you.\n13. And ye shall tell my father of all my glory in Egypt, and of all that ye have seen; and ye shall haste and bring down myfatherhither.\n14. And he fell upon his brother Benjamins neck, and wept; and Benjamin wept upon his neck.\n15. Moreover he kissed all his brethren, and wept upon them: and after that his brethren talked with him.\n16. And the fame thereof was heard in Pharaohs house, saying, Josephs brethren are come: and itpleasedPharaoh well, and his servants.\n17. And Pharaoh said unto Joseph, Say unto thy brethren, This do ye; lade your beasts, and go, get you unto the land of Canaan;\n18. And take your father and your households, and come unto me: and I will give you the good of the land of Egypt, and ye shall eat the fat of the land.\n19. Now thou art commanded, this do ye; take youwagonsout of the land of Egypt for your little ones, and for your wives, and bring your father, and come.\n20. Also regard not your stuff; for the good of all the land of Egyptisyours.\n21. And the children of Israel did so: and Joseph gave them wagons, according to the commandment of Pharaoh, and gave them provision for the way.\n22. To all of them he gave each man changes of raiment; but toBenjaminhe gave three hundredpiecesof silver, and five changes of raiment.\n23. And to his father he sent after thismanner;ten asses laden with the good things of Egypt, and ten she asses laden with corn and bread and meat for his father by the way.\n24. So he sent his brethren away, and they departed: and he said unto them, See that ye fall not out by the way.\n25. And they went up out of Egypt, and came into the land of Canaan unto Jacob their father,\n26. And told him, saying, Josephisyet alive, and heisgovernorover all the land of Egypt. And Jacobs heart fainted, for he believed them not.\n27. And they told him all the words of Joseph, which he had said unto them: and when he saw thewagonswhich Joseph had sent to carry him, the spirit of Jacob their fatherrevived:\n28. And Israel said,It isenough; Joseph my sonisyet alive: I will go and see him before I die.\n\n--- SCRIPTURE: Genesis 46 ---\n1. And Israel took his journey with all that he had, and came toBeer-sheba, and offered sacrifices unto the God of his father Isaac.\n2. And God spake unto Israel in thevisionsof the night, and said, Jacob, Jacob. And he said, HereamI.\n3. And he said, IamGod, the God of thyfather: fear not to go down intoEgypt; for I will there make of thee greatnation:\n4. Iwill go down with thee into Egypt; and I will also surelybringthee upagain:andJosephshall put his hand upon thine eyes.\n5. And Jacobrose upfrom Beer-sheba: and the sons of Israel carried Jacob their father, and their little ones, and their wives, in thewagonswhich Pharaoh had sent to carry him.\n6. And they took their cattle, and their goods, which they had gotten in the land of Canaan, and came intoEgypt, Jacob, and all his seed with him:\n7. His sons, and his sons sons with him, his daughters, and his sons daughters, and all hisseedbrought he with him into Egypt.\n8. And thesearethenamesof thechildren of Israel, which came into Egypt, Jacob and his sons: Reuben, Jacobs firstborn.\n9. And the sons ofReuben; Hanoch, and Phallu, and Hezron, and Carmi.\n10. And the sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Shaul the son of Canaanitish woman.\n11. And the sons ofLevi; Gershon, Kohath, and Merari.\n12. And the sons of Judah;Er, andOnan, and Shelah, and Pharez, andZerah: but Er and Onan died in the land of Canaan. And the sons of Pharez were Hezron and Hamul.\n13. And the sons ofIssachar; Tola, and Phuvah, and Job, and Shimron.\n14. And the sons of Zebulun; Sered, and Elon, and Jahleel.\n15. Thesebethe sons ofLeah, which she bare unto Jacob in Padan-aram, with his daughter Dinah: all the souls of his sons and his daughterswerethirty and three.\n16. And the sons ofGad; Ziphion, and Haggi, Shuni, and Ezbon, Eri, and Arodi, and Areli.\n17. And the sons of Asher; Jimnah, and Ishuah, and Isui, and Beriah, and Serah their sister: and the sons of Beriah; Heber, and Malchiel.\n18. Thesearethe sons ofZilpah, whom Laban gave to Leah his daughter, and these she bare unto Jacob,evensixteen souls.\n19. The sons of Rachel Jacobs wife; Joseph, andBenjamin.\n20. And unto Joseph in the land of Egypt were bornManassehand Ephraim, whichAsenaththe daughter of Poti-pherah priest of On bare unto him.\n21. And the sons ofBenjaminwereBelah, and Becher, and Ashbel, Gera, and Naaman, Ehi, and Rosh, Muppim, and Huppim, and Ard.\n22. Thesearethe sons of Rachel, which were born to Jacob: all the soulswerefourteen.\n23. And the sons ofDan; Hushim.\n24. And the sons of Naphtali; Jahzeel, and Guni, and Jezer, and Shillem.\n25. Thesearethe sons ofBilhah, which Laban gave unto Rachel his daughter, and she bare these unto Jacob: all the soulswereseven.\n26. All the souls that came with Jacob into Egypt, which came outof his loins, besides Jacobs sons wives, all the soulswerethreescore and six;\n27. And the sons of Joseph, which were born him in Egypt,weretwo souls: all the souls of the house ofJacob, which came into Egypt,werethreescoreand ten.\n28. And he sent Judah before him unto Joseph, to direct his face unto Goshen; and they came into the land ofGoshen.\n29. And Joseph made ready his chariot, and went up to meet Israel his father, to Goshen, and presented himself unto him; and he fell on his neck, andwepton his neck good while.\n30. And Israel said unto Joseph, Now let me die, since I have seen thy face, because thouartyet alive.\n31. And Joseph said unto his brethren, and unto his fathers house, I will go up, and shewPharaoh, and say unto him, My brethren, and my fathers house, whichwerein the land of Canaan, are come unto me;\n32. And the menareshepherds, for their trade hath been to feed cattle; and they have brought their flocks, and their herds, and all that they have.\n33. And it shall come to pass, when Pharaoh shall call you, and shall say, Whatisyouroccupation?\n34. That ye shall say, Thy servants trade hath been aboutcattlefrom our youth even until now, both we,andalso our fathers: that ye may dwell in the land of Goshen; for every shepherdisanabominationunto the Egyptians.\n\n--- SCRIPTURE: Genesis 47 ---\n1. Then Joseph came and toldPharaoh, and said, My father and my brethren, and their flocks, and their herds, and all that they have, are come out of the land of Canaan; and, behold, theyarein the land ofGoshen.\n2. And he took some of his brethren,evenfive men, and presented them untoPharaoh.\n3. And Pharaoh said unto his brethren, Whatisyouroccupation? And they said unto Pharaoh, Thy servantsareshepherds, both we,andalso our fathers.\n4. They said moreover unto Pharaoh, For tosojournin the land are we come; for thy servants have no pasture for their flocks; for the famineissore in the land of Canaan: now therefore, we pray thee, let thy servants dwell in the land of Goshen.\n5. And Pharaoh spake unto Joseph, saying, Thy father and thy brethren are come unto thee:\n6. The land ofEgyptisbefore thee; in the best of the land make thy father and brethren to dwell; in the land of Goshen let them dwell: and if thou knowestanymen of activity among them, then make them rulers over my cattle.\n7. And Joseph brought in Jacob his father, and set him before Pharaoh: and Jacob blessed Pharaoh.\n8. And Pharaoh said unto Jacob, How oldartthou?\n9. And Jacob said unto Pharaoh, The days of the years of mypilgrimagearean hundred and thirty years: few andevilhave the days of the years of my life been, and have not attained unto thedaysof the years of the life of my fathers in the days of their pilgrimage.\n10. And Jacob blessed Pharaoh, and went out from before Pharaoh.\n11. And Joseph placed his father and his brethren, and gave them possession in the land of Egypt, in the best of the land, in the land ofRameses, as Pharaoh had commanded.\n12. And Josephnourishedhis father, and his brethren, and all his fathers household, with bread, according totheirfamilies.\n13. Andthere wasno bread in all the land; for thefaminewasvery sore, so that the land of Egypt andallthe land of Canaan fainted by reason of the famine.\n14. And Joseph gathered up all themoneythat was found in the land of Egypt, and in the land of Canaan, for the corn which they bought: and Joseph brought the money into Pharaohs house.\n15. And when money failed in the land of Egypt, and in the land of Canaan, all the Egyptians came unto Joseph, and said, Give usbread: for why should we die in thy presence? for the money faileth.\n16. And Joseph said, Give your cattle; and I will give you for your cattle, if money fail.\n17. And they brought their cattle unto Joseph: and Joseph gave them breadin exchangefor horses, and for the flocks, and for the cattle of the herds, and for the asses: and he fed them with bread for all their cattle for that year.\n18. When that year was ended, they came unto him the second year, and said unto him, We will not hideitfrom my lord, how that our money is spent; my lord also hath our herds of cattle; there is not ought left in the sight of my lord, but our bodies, and our lands:\n19. Wherefore shall we die before thine eyes, both we and our land? buy us and our land for bread, and we and our land will be servants unto Pharaoh: and giveusseed, that we may live, and not die, that the land be not desolate.\n20. And Joseph bought all the land of Egypt for Pharaoh; for the Egyptians sold every man his field, because the famine prevailed over them: so the land became Pharaohs.\n21. And as for the people,heremoved them to cities fromoneend of the borders of Egypt even to theotherend thereof.\n22. Only the land of thepriestsbought he not; for the priests had portionassigned themof Pharaoh, and did eat their portion which Pharaoh gave them: wherefore they sold not their lands.\n23. Then Joseph said unto the people, Behold, I have bought you this day and your land for Pharaoh: lo,here isseed for you, and ye shall sow the land.\n24. And it shall come to passin the increase, that ye shall give thefifthpartunto Pharaoh, and four parts shall be your own, for seed of the field, and for your food, and for them of your households, and for food for your little ones.\n25. And they said, Thou hast saved our lives: let us find grace in the sight of my lord, and we will be Pharaohs servants.\n26. And Joseph made it law over the land of Egypt unto this day,thatPharaoh should have the fifthpart;except the land of thepriestsonly,whichbecame not Pharaohs.\n27. And Israel dwelt in the land of Egypt, in the country of Goshen; and they had possessions therein, and grew, and multiplied exceedingly.\n28. And Jacob lived in the land of Egypt seventeen years: so the whole age ofJacobwas an hundred forty and seven years.\n29. And thetimedrew nigh that Israel must die: and he called his son Joseph, and said unto him, If now I have found grace in thy sight, put, I pray thee, thy hand under mythigh, and deal kindly and truly with me;buryme not, I pray thee, in Egypt:\n30. But I will lie with my fathers, and thou shalt carry me out of Egypt, andburyme in their buryingplace. And he said, I will do as thou hast said.\n31. And he said, Swear unto me. And he sware unto him. And Israelbowedhimselfuponthebedshead.\n\n--- SCRIPTURE: Genesis 48 ---\n1. And it came to pass after these things, thatonetold Joseph, Behold, thy fatherissick: and he took with him his two sons, Manasseh and Ephraim.\n2. AndonetoldJacob, and said, Behold, thy son Joseph cometh unto thee: and Israelstrengthenedhimself, and sat upon the bed.\n3. And Jacob said unto Joseph, GodAlmightyappearedunto me atLuzin the land of Canaan, and blessed me,\n4. And said unto me, Behold, I will make theefruitful, and multiply thee, and I will make of thee multitude of people; and will give thislandto thy seed after theeforan everlastingpossession.\n5. Andnow thy two sons,EphraimandManasseh, which were born unto thee in the land of Egypt before I came unto thee into Egypt,aremine; as Reuben and Simeon, they shall be mine.\n6. And thy issue, which thou begettest after them, shall be thine,andshall be called after the name of their brethren in their inheritance.\n7. And as for me, when I came from Padan,Racheldied by me in the land of Canaan in the way, when yetthere wasbut little way to come unto Ephrath: and I buried her there in the way of Ephrath; the sameisBeth-lehem.\n8. And Israel beheld Josephs sons, and said, Whoarethese?\n9. And Joseph said unto his father, Theyaremy sons, whom God hath given me in thisplace.And he said, Bring them, I pray thee, unto me, and I willblessthem.\n10. Now the eyes of Israel weredimfor age,so thathe could not see. And he brought themnearunto him; and he kissed them, and embraced them.\n11. And Israel said unto Joseph, I had not thought to see thy face: and, lo, God hath shewed me also thy seed.\n12. And Joseph brought them out from between his knees, and he bowed himself with his face to the earth.\n13. And Joseph took them both, Ephraim in his right hand toward Israels left hand, and Manasseh in his left hand toward Israels right hand, and broughtthemnear unto him.\n14. And Israel stretched out his right hand, and laidituponEphraimshead, whowasthe younger, and his left hand upon Manassehs head,guiding his handswittingly; for Manassehwasthe firstborn.\n15. And he blessedJoseph, and said, God, before whom my fathers Abraham and Isaac didwalk, the God whichfedme all my life long unto this day,\n16. TheAngelwhich redeemed me from all evil, bless the lads; and let mynamebe named on them, and the name of my fathers Abraham and Isaac; and let them grow into multitude in the midst of the earth.\n17. And when Joseph saw that his father laid his righthandupon the head ofEphraim,it displeased him: and he held up his fathers hand, to remove it from Ephraims head unto Manassehs head.\n18. And Joseph said unto his father, Not so, my father: for thisisthe firstborn; put thy right hand upon his head.\n19. And his father refused, and said, I knowit,my son, I knowit:he also shall become people, and he also shall begreat: but truly his younger brother shall be greater than he, and hisseedshall become amultitudeofnations.\n20. And he blessed them that day, saying,In theeshall Israelbless, saying, God make thee as Ephraim and as Manasseh: and he setEphraimbefore Manasseh.\n21. And Israel said unto Joseph, Behold, I die: butGodshall be with you, andbringyou again unto thelandof your fathers.\n22. Moreover I have given to thee oneportionabove thy brethren, which I took out of the hand of the Amorite with my sword and with my bow.\n\n--- SCRIPTURE: Genesis 49 ---\n1. AndJacobcalled unto hissons, and said, Gather yourselves together, that I may tell youthatwhich shall befall you in thelast days.\n2. Gather yourselves together, and hear, ye sons of Jacob; and hearken unto Israel yourfather.\n3. Reuben, thouartmy firstborn, my might, and thebeginningof my strength, the excellency of dignity, and the excellency of power:\n4. Unstable as water, thou shalt not excel; because thou wentest up to thy fathersbed; thendefiledstthouit:he went up to my couch.\n5. SimeonandLeviarebrethren;instruments ofcrueltyare intheir habitations.\n6. O my soul, come not thou into their secret; unto their assembly, mine honour, be not thouunited: for in theirangertheyslewa man, and in their selfwill they digged down wall.\n7. Cursedbetheiranger, forit wasfierce; and their wrath, for it wascruel: I will divide them in Jacob, and scatter them in Israel.\n8. Judah, thouart hewhom thy brethren shallpraise: thy handshall bein theneckof thine enemies; thy fathers children shallbowdown before thee.\n9. Judahisalionswhelp: from the prey, my son, thou art gone up: he stooped down, he couched as alion, and as an old lion; who shall rouse him up?\n10. The sceptre shall not depart fromJudah, nor alawgiverfrom between his feet, untilShilohcome; and unto himshallthegatheringof the peoplebe.\n11. Binding his foal unto the vine, and his asss colt unto the choicevine; hewashedhis garments in wine, and his clothes in thebloodof grapes:\n12. His eyesshall bered with wine, and his teeth white with milk.\n13. Zebulunshall dwell at the haven of the sea; and heshall befor an haven of ships; and his bordershall beunto Zidon.\n14. Issacharisa strong ass couching down between two burdens:\n15. And he saw that restwasgood, and the land thatit waspleasant; and bowed his shoulder to bear, and became servant unto tribute.\n16. Danshalljudgehis people, as one of the tribes of Israel.\n17. Dan shall be serpent by the way, an adder in the path, that biteth the horse heels, so that his rider shall fall backward.\n18. I havewaitedfor thy salvation, OLord.\n19. Gad, atroopshall overcome him: but he shall overcome at the last.\n20. Out ofAsherhis breadshall befat, and he shall yield royal dainties.\n21. Naphtaliisa hind let loose: he giveth goodly words.\n22. Josephisa fruitfulbough,evena fruitful bough by well;whosebranchesrunover the wall:\n23. The archers have sorely grieved him, and shotat him,and hated him:\n24. But his bow abode in strength, and the arms of his hands were madestrong by the hands of the mightyGodof Jacob; (fromthenceistheshepherd, thestoneof Israel:)\n25. Evenby the God of thy father, who shall help thee; and by theAlmighty, who shall bless thee with blessings of heaven above, blessings of the deep that lieth under, blessings of the breasts, and of thewomb:\n26. Theblessingsof thy father have prevailed above the blessings of my progenitors unto theutmostbound of the everlastinghills: they shall be on the head ofJoseph, and on the crown of the head of him that was separate from his brethren.\n27. Benjaminshall ravinasa wolf: in the morning he shall devour the prey, and at night he shall divide the spoil.\n28. All thesearethetwelve tribesof Israel: and thisis itthat their father spake unto them, andblessedthem; every one according to hisblessinghe blessed them.\n29. And he charged them, and said unto them, I am to be gathered unto mypeople:buryme with my fathers in the cave thatisin the field of Ephron the Hittite,\n30. In the cave thatisin the field ofMachpelah, whichisbefore Mamre, in the land of Canaan, which Abraham bought with the field ofEphronthe Hittite for possession of buryingplace.\n31. There theyburiedAbraham and Sarah his wife; there they buried Isaac and Rebekah his wife; and there I buried Leah.\n32. The purchase of the field and of the cave thatisthereinwasfrom the children of Heth.\n33. And when Jacob had made an end of commanding his sons, he gathered up his feet into the bed, and yielded up theghost, and wasgatheredunto his people.\n\n--- SCRIPTURE: Genesis 50 ---\n1. AndJosephfell upon his fathers face, andweptupon him, and kissed him.\n2. And Joseph commanded his servants the physicians toembalmhis father: and the physicians embalmed Israel.\n3. And forty days were fulfilled for him; for so are fulfilled the days of those which are embalmed: and the Egyptians mourned for him threescore and ten days.\n4. And when the days of his mourning were past, Joseph spake unto the house of Pharaoh, saying, If now I have found grace in your eyes, speak, I pray you, in the ears of Pharaoh, saying,\n5. My father made me swear, saying, Lo, I die: in mygravewhich I have digged for me in the land of Canaan, there shalt thou bury me. Now therefore let me go up, I pray thee, and bury my father, and I will come again.\n6. And Pharaoh said, Go up, and bury thy father, according as he made thee swear.\n7. And Joseph went up to bury his father: and with him went up all the servants of Pharaoh, the elders of his house, and all the elders of the land of Egypt,\n8. And all the house of Joseph, and his brethren, and his fathers house: only their little ones, and their flocks, and their herds, they left in the land ofGoshen.\n9. And there went up with him both chariots and horsemen: and it was very great company.\n10. And they came to the threshingfloor of Atad, whichisbeyond Jordan, and there theymournedwith great and very sore lamentation: and he made amourningfor his father seven days.\n11. And when the inhabitants of the land, the Canaanites, saw the mourning in the floor of Atad, they said, Thisisa grievous mourning to the Egyptians: wherefore the name of it was calledAbel-mizraim, whichisbeyond Jordan.\n12. And his sons did unto him according as he commanded them:\n13. For his sonscarriedhim into the land of Canaan, and buried him in the cave of the field of Machpelah, which Abraham bought with the field for possession of aburyingplaceofEphronthe Hittite, before Mamre.\n14. And Joseph returned into Egypt, he, and his brethren, and all that went up with him to bury his father, after he had buried his father.\n15. And when Josephs brethren saw that their father was dead, they said,Josephwill peradventure hate us, and will certainly requite us all the evil which we did unto him.\n16. And they sent messenger unto Joseph, saying, Thy father did command before he died, saying,\n17. So shall ye say unto Joseph,Forgive, I pray thee now, the trespass of thy brethren, and their sin; for they did unto thee evil: and now, we pray thee, forgive the trespass of the servants of the God of thy father. And Josephweptwhen they spake unto him.\n18. And his brethren also went and fell down before his face; and they said, Behold, webethyservants.\n19. And Joseph said unto them, Fear not: foramI in the place of God?\n20. But as for you, ye thoughtevilagainst me;butGodmeantit untogood, to bring to pass, asit isthis day, to save much people alive.\n21. Now therefore fear ye not: I willnourishyou, and your little ones. And he comforted them, and spake kindly unto them.\n22. AndJosephdwelt in Egypt, he, and his fathers house: and Joseph lived an hundred and ten years.\n23. And Joseph saw Ephraimschildrenof the thirdgeneration:the children also of Machir the son ofManassehwere brought up upon Josephs knees.\n24. AndJoseph said unto his brethren, I die: and God will surely visit you, andbringyou out of this land unto thelandwhich he sware toAbraham, to Isaac, and to Jacob.\n25. And Joseph took anoathof the children of Israel, saying, God will surely visit you, and ye shall carry up mybonesfrom hence.\n26. SoJosephdied,beingan hundred and ten years old: and theyembalmedhim, and he was put in coffin in Egypt.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "",
      "content": "It had been about 22 years since Joseph’s brothers sold him into slavery. Joseph had suffered many trials, including false accusations and imprisonment. When he finally saw his brothers again, Joseph was the governor of all Egypt, second only to the pharaoh. He could easily have taken revenge on his brothers, and considering what they had done to Joseph, that might seem understandable. And yet Joseph forgave them. Not only that, but he helped them see divine purpose in his suffering. “God meant it unto good” (\nGenesis 50:20\n), he told them, because it put him in a position to save “all his father’s household” (\nGenesis 47:12\n) from famine.\nIn many ways, Joseph was like Jesus Christ. Even though our sins caused Jesus great suffering, He offers forgiveness, delivering all of us from a fate far worse than famine. Whether we need to receive forgiveness or extend it—at some point we all need to do both—Joseph’s example points us to the Savior, the true source of healing and reconciliation.\nIdeas for Learning at Home and at Church\nGenesis 45:5–7\n;\n47:12\n“God sent me before you to preserve you.”\nHave you noticed any similarities between Joseph’s life and the atoning mission of Jesus Christ? To see some examples of these similarities, try comparing:\nGenesis 37:3\nwith\nMatthew 3:17\n.\nGenesis 37:26–28\nwith\nMatthew 26:14–16\n.\nGenesis 45:5–7\nwith\nLuke 4:18\n.\nGenesis 47:12\nwith\nJohn 6:35\n.\nWhat impressions do you have about the Savior and His mission as you read these passages?\nGenesis 45\n;\n50:15–21\nForgiveness brings healing.\nReading about Joseph forgiving his brothers of the terrible things they had done may prompt you to think about someone you are currently struggling to forgive. The following questions may help as you strive to apply this principle:\nWhy might it have been hard for Joseph to forgive his brothers? (to review what they did to him, see\nGenesis 37\n). What experiences or attitudes might have given Joseph the strength to forgive? (see, for example,\nGenesis 45:1–15\nor\n50:15–21\n).\nWhat blessings came from Joseph’s forgiveness of his brothers? For example, compare the relationships in Jacob’s family at the beginning of the story (see, for example,\nGenesis 37:3–11\n) with the relationships at the end (see\nGenesis 45:9–15\n;\n50:15–21\n). How might things have turned out differently if Joseph had not been willing to forgive?\nConsider writing down the name of someone who may need your forgiveness—whether or not they have asked for forgiveness. What can you do to invite the Savior’s healing power into that situation? If forgiving seems too difficult, consider reviewing the counsel of Elder Gerrit W. Gong in the last six paragraphs of his message “\nHappy and Forever\n” (\nLiahona\n, Nov. 2022, 85). What do you find that gives you hope that you can forgive?\nSee also\nDoctrine and Covenants 64:9–11\n; “Forgiveness: My Burden Was Made Light” (video), Gospel Library.\n8:24\nForgiveness: My Burden Was Made Light\nGenesis 49\nJacob gave his family prophetic blessings.\nJacob’s blessings to his posterity contain vivid imagery, but they aren’t easy to understand. Thankfully, the restored gospel gives us some help. When you read the blessing to Joseph in\nGenesis 49:22–26\n, read the following verses too, and see what insights they provide:\n1 Nephi 15:12\n;\n2 Nephi 3:4–5\n;\nJacob 2:25\n;\nDoctrine and Covenants 50:44\n.\nAs you read about Judah’s blessing in\nGenesis 49:8–12\n, remember that Jesus Christ was a descendant of Judah. What do you find in these verses that reminds you of the Savior? (see also\nRevelation 5:5–6, 9\n;\n1 Nephi 15:14–15\n;\nDoctrine and Covenants 45:59\n;\n133:46–50\n).\nReading these blessings might inspire you to review your patriarchal blessing—or, if you don’t have one, to receive one. What words and phrases in your blessing turn your thoughts to Jesus Christ?\nSee also Randall K. Bennett, “\nYour Patriarchal Blessing—Inspired Direction from Heavenly Father\n,”\nLiahona\n, May 2023, 42–44.\nGenesis 50:19–21\nGod can help me find meaning in my trials.\nThough it may not have been clear while he was going through it, Joseph was eventually able to look back on his adversity in Egypt and see that “God meant it unto good” (\nGenesis 50:20\n). If you could have visited Joseph while he was in the pit or in prison, how would you have comforted him? How can\nGenesis 50:19–21\nhelp you in your times of trial?\nSee also\nDoctrine and Covenants 122\n; “\nHow Firm a Foundation\n,”\nHymns\n, no. 85.\nJoseph Smith among the Prophets\n, by Paul Mann (detail)\nGenesis 50:24–25\n“A seer shall the Lord my God raise up.”\nAs you read\nGenesis 50:24–25\nand\nJoseph Smith Translation, Genesis 50:24–38\n(in the Bible appendix), ponder why it would have been important for Joseph to know about Moses and Joseph Smith so many centuries in advance. How did Joseph Smith fulfill Joseph’s prophecies about him? (see\nDoctrine and Covenants 1:17–23\n;\n20:7–12\n;\n39:11\n;\n135:3\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Joseph test his brothers?\nWhy did Jacob adopt Joseph’s two sons?\nWhy did Jacob place his right hand on Ephraim instead of Manasseh?\nClick to see more.\nIdeas for Teaching Children\nGenesis 42–44\n;\n45:4–15\nI can show love and forgiveness to my family.\nIt might be fun for your children to reenact the story of Joseph reuniting his family (see\nGenesis 42–44\n). Or they could use “\nJoseph and the Famine\n” (in\nOld Testament Stories\n, 57–60) or pictures in this outline to teach the story to each other. Here are some questions that could help your children learn from the story:\nWhat did Joseph do to show love for his family? (see\nGenesis 45:4–15\n).\nWhy do you feel Joseph forgave his brothers?\nHow do you think Joseph’s brothers felt when they found out Joseph had forgiven them? Who in your life needs to be forgiven? How can you show love and forgiveness?\n2:26\nJoseph and the Famine\nAs you prepare to teach, ask, “What will my children do to learn?”\nFor example, in this activity your children are acting out or retelling a story. Doing this will help them remember both what happened and the gospel principles contained in the story.\nYou or your children may want to share an experience when they forgave someone or when someone forgave them. You could then sing a song such as “\nLove One Another\n” (\nChildren’s Songbook\n, 136) or “\nHelp Me, Dear Father\n” (\nChildren’s Songbook\n, 99).\nGenesis 48:8–9\nThe Lord helps me through priesthood blessings.\nYou and your children could look at the picture of Jacob blessing his sons at the end of this outline and discuss what is happening (see\nGenesis 48:8–9\n). If needed, explain that Jacob, Joseph’s father, wanted to give priesthood blessings to his family. Perhaps you could share with each other any experiences you’ve had receiving help from God through a priesthood blessing. What are some reasons we might ask for a priesthood blessing?\nGenesis 45:5–11\nHeavenly Father sent Jesus Christ to save me.\nHow can you help your children see the Savior in the story of Joseph saving his family from famine? Consider making a chart with two columns labeled\nJoseph\nand\nJesus Christ\n. Help your children search the following pairs of scriptures and fill in the chart with things that Joseph and Jesus have in common:\nGenesis 37:3\nand\nMatthew 3:17\n;\nGenesis 37:26–28\nand\nMatthew 26:14–16\n;\nGenesis 45:5–7\nand\nLuke 4:18\n; and\nGenesis 47:12\nand\nJohn 6:35\n.\nAsk your children what it means to save or rescue someone. If any of them have had an experience being saved or rescued from danger, invite them to share. How did Joseph save his brothers? (see\nGenesis 42:1–3\n;\n45:5–7\n). Then you could look at a picture of the Savior together and ask your children to talk about how Jesus saves us.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 12: Lesson 35: Lesson 35—Genesis 42–50This lesson can help students follow the Savior’s example by being more forgiving.; Lesson 36: Lesson 36—JST Genesis 50This lesson can help students strengthen their testimonies that the Lord called Joseph Smith to be a prophet....",
      "content": "\n--- Lesson 35 ---\nMany years after he was sold into Egypt as a slave, Joseph was reunited with his brothers. He could have had felt angry and resentful because of all that he suffered. However, like the Savior, Joseph chose to extend mercy and forgiveness to his brothers who had mistreated him. This lesson can help students follow the Savior’s example by being more forgiving. Student preparation: Invite students to ponder the Savior’s commandment to “forgive all men” ( Doctrine and Covenants 64:10 ). Ask them to list some of the blessings they or others have experienced through forgiving someone. Possible Learning Activities Joseph of Egypt To begin class, consider inviting students to briefly review the account of Joseph of Egypt in Genesis 37–41 . You could ask them to summarize the unkind actions of Joseph’s brothers and the events that led to Joseph’s status as second in command of all of Egypt. The digital images found in Lesson 33: Genesis 37–41 could be used to help students summarize the story. What are some of the ways Joseph suffered because of his brothers’ actions? How would you feel about someone who did this to you? What can make it hard to forgive someone? Reflect on how you typically respond when someone does or says something hurtful to you. As you study today, pay close attention to any impressions you might receive from the Holy Ghost to help you know how you can follow the Savior’s example to forgive. Joseph was reunited with his brothers To study the story of Joseph’s reunion with his brothers, you could organize students in groups of three. Each student in the group could study one of the three summaries and scripture passages. Students could then teach the other members of the group their part of the story. Alternately, you could show the animated video “ Joseph and the Famine ” (2:26) from time code 00:00 to 01:41 on ChurchofJesusChrist.org . 2:26 Review the following summaries and study the accompanying verses. Summary 1: Many years after they sold Joseph as a slave, his brothers traveled to Egypt to seek relief from a famine. Presenting themselves before Joseph, now second in command of all Egypt, the brothers did not recognize him. Not knowing that Joseph recognized and could understand them, the brothers expressed their sorrow and regret for what they had done years earlier to him. Read Genesis 42:21–24 , looking for how Joseph reacted to hearing his brothers talk about how they had treated him. Summary 2: Joseph provided food for the family but imprisoned Simeon and instructed the other brothers not to return to Egypt unless they brought the youngest brother, Benjamin, with them. The brothers returned home, but when the family ran out of food again, they returned to Egypt with Benjamin. Read Genesis 43:30 , looking for how Joseph reacted to seeing his brother Benjamin. Summary 3: Joseph tested his brothers’ love for Benjamin by accusing him of stealing and threatening to throw him in jail. Judah offered his life in exchange for Benjamin’s. Read Genesis 45:1–2 , looking for how Joseph reacted after Judah volunteered to give his life to protect Benjamin. After students have had a chance to study the summaries, you could invite them to discuss the following question. What would have been helpful for Joseph to remember about Heavenly Father and Jesus Christ as he interacted with his brothers? Heavenly Father and Jesus Christ forgive The following scriptures illustrate the forgiving nature of both Heavenly Father and Jesus Christ. You could display these scriptures for students to study or have them find their own scripture passages about the forgiving nature of Heavenly Father and Jesus Christ. Read the following scriptures, looking for what would be helpful for someone who has been mistreated to know about Heavenly Father and Jesus Christ. Luke 6:36 Ephesians 4:31–32 Colossians 3:13 What would you share from these verses? Read Genesis 45:3–8 and 9–15 , looking for how Joseph responded to his brothers. What do we learn about becoming like Heavenly Father and Jesus Christ from Joseph’s example? Students might identify a variety of truths. Thank them for what they share and ask them why they feel it is an important doctrine or principle for us to know. If students do not mention it, share the following truth and write it on the board: We become like Heavenly Father and Jesus Christ as we forgive others. By relying on the Savior, we can forgive others To help students understand this truth, you could show the video “ Forgiving Others: An Easter Message from President Russell M. Nelson ” (5:01) from ChurchofJesusChrist.org . 5:1 Another option is to study the following statement. President Russell M. Nelson helped us understand how we rely on the Savior’s power when we forgive others. 17:18 If forgiveness presently seems impossible, plead for power through the atoning blood of Jesus Christ to help you. As you do so, I promise personal peace and a burst of spiritual momentum. When the Savior atoned for all mankind, He opened a way that those who follow Him can have access to His healing, strengthening, and redeeming power. These spiritual privileges are available to all who seek to hear Him and follow Him. (“ The Power of Spiritual Momentum ,” Liahona , May 2022, 100) How can President Nelson’s teachings help us forgive others? What would you counsel someone to do if they are struggling to forgive? What would you recommend they do to rely on the Savior? If students need help with the last question, you may suggest they look at the Lord’s counsel in Doctrine and Covenants 64:9–11 , particularly verse 11 . Consider inviting students to share an experience where they or someone they know was able to forgive. It might be helpful to remind students not to share details that might be too personal about them or someone they know. You may also want to share an experience of your own. Help us to freely forgive To help students reflect on what they have learned and felt about becoming like Heavenly Father and Jesus Christ, you could display some of the following activities for students to complete in their study journals. Prayerfully ponder any impressions you have received as you studied today. Invite the Holy Ghost to help you recognize any changes you need to make. Ask Heavenly Father to help increase your ability to forgive others. Select one of the following activities to complete in your study journal. Write a short paragraph that summarizes how you have been blessed by your efforts to forgive others. List what you have done to include the Savior in your efforts. What do you feel is important to remember the next time you need to forgive someone? Prayerfully consider if there is someone in your life you need to forgive. Write a short paragraph identifying the feelings you have about forgiving that person. What do you recognize that may be preventing your ability to forgive? List some ways you can seek the Savior’s help in your efforts. Write a note that could help a friend who is struggling to forgive someone. Briefly explain how Joseph’s choice to forgive his brothers was like the Savior. Include a scripture passage that has been meaningful to you in your efforts to forgive others. You could invite a few willing students to share what they wrote. Consider concluding the lesson by inviting students to act on any spiritual impressions they may have received. You might share your witness of the blessings available when we follow the Savior’s example to forgive others.\n\n\n--- Lesson 36 ---\nShortly before his death, Joseph of Egypt prophesied that in the latter days the Lord would raise up Joseph Smith to do His work. We can receive our own witness that Joseph Smith was the Lord’s servant. This lesson can help students strengthen their testimonies that the Lord called Joseph Smith to be a prophet. Student preparation: Invite students to write down what the Prophet Joseph Smith has done that has helped them come closer to Jesus Christ. They might ask a family member or friend to share their thoughts and feelings as well. Possible Learning Activities Delivering the Lord’s people Consider displaying the images of Joseph in Egypt and of Moses. Ask students to identify how the Lord used each of these individuals as a deliverer (a person who rescues others). Next, show the image of Joseph Smith and ask students how the Lord used him as a deliverer. Finally, show an image of Jesus Christ, the Deliverer, and discuss ways that Jesus Christ delivers us. After students share their thoughts, use the images and the paragraph below to summarize the events and prophecies in the Joseph Smith Translation of Genesis 50 . At the end of his life, Joseph of Egypt prophesied that the Lord would raise up two prophets, who are descended from Jacob, to help deliver His people out of bondage. Moses would come to deliver the Israelites out of physical bondage in Egypt (see JST Genesis 50:24, 29 ). Then, in the latter days, the Lord would deliver His people from spiritual darkness through the Prophet Joseph Smith. To help students assess what they know and believe about Joseph Smith, consider inviting them to answer the following questions in their study journals. What thoughts or feelings come to mind when you think about the Prophet Joseph Smith? How would you describe the current state of your testimony that he was called by God to be a prophet? As you study today, listen for impressions from the Spirit confirming that the Lord called Joseph Smith as a prophet. Heavenly Father can send thoughts to your mind or feelings to your heart through the Holy Ghost telling you that what you are studying is true. Joseph of Egypt prophesies of Joseph Smith Invite students to create a blank chart similar to the one below in their study journals. Students may work in pairs or small groups to complete the chart. You could use the information provided in the chart to show how this can be done and help students discover answers as needed. You might help students locate the Joseph Smith Translation Appendix in their scriptures or in Study Helps in Gospel Library. You might also remind students that a seer is a revelator and prophet who knows the past, present, and future (see Mosiah 8:17 ), the “fruit of thy loins” ( JST Genesis 50:27 ) refers to Joseph of Egypt’s posterity or descendants, the writings of Joseph’s seed refers to the Book of Mormon, and the writings of Judah’s seed refers to the Bible (see JST Genesis 50:31 ). Read Joseph Smith Translation Genesis 50:26–33 to complete the following chart. Prophecy about Joseph Smith (including the verse): Possible ways this prophecy was fulfilled: Prophecy about Joseph Smith (including the verse): “He shall be esteemed highly” ( verse 27 ) Possible ways this prophecy was fulfilled: Millions of believers consider Joseph Smith to be the Prophet of the Restoration. Prophecy about Joseph Smith (including the verse): “He shall bring them to the knowledge of the covenants which I have made with thy fathers” ( verse 28 ) Possible ways this prophecy was fulfilled: Through the restored priesthood, we can make covenants with God through baptismal and other ordinances. One of the purposes of the Book of Mormon is to bring the House of Israel to a knowledge of the covenants of the Lord. Prophecy about Joseph Smith (including the verse): “Unto him will I give power to bring forth my word” ( verse 30 ) Possible ways this prophecy was fulfilled: The Lord revealed the Book of Mormon, the Doctrine and Covenants, the Joseph Smith Translation, and other inspired writings through Joseph Smith. Prophecy about Joseph Smith (including the verse): “Out of weakness shall he be made strong” ( verse 32 ) Possible ways this prophecy was fulfilled: From humble beginnings and little formal education, Joseph Smith became a mighty prophet. Prophecy about Joseph Smith (including the verse): “They that seek to destroy him shall be confounded” ( verse 33 ) Possible ways this prophecy was fulfilled: Those who seek to discredit Joseph Smith and his work will be unsuccessful. As part of your discussion, you could point out that the phrase “raised up” is used seven times in these verses. Some possible meanings for this phrase are called, chosen, or prepared to do a work that would bring the Lord’s people unto salvation ( verse 33 ). You could also invite students to identify another pattern by marking each time the Lord is the one doing the action, such as “will I raise up” ( verse 27 ) or “will I give power” ( verse 30 ). What prophecies stood out to you in these verses? Why? Among possible truths the students may identify, point out the following: The Lord chose and prepared Joseph Smith to bring forth the Book of Mormon. Invite students to consider writing this truth next to verses 30–33 . What truths can you identify about the Lord from what you studied about Joseph Smith? How do you think the Book of Mormon brings the Lord’s people unto salvation? How has the Book of Mormon blessed your life? Gaining a spiritual witness of the Prophet Joseph Smith Elder Neil L. Andersen of the Quorum of the Twelve Apostles taught: Each believer needs a spiritual confirmation of the divine mission and character of the Prophet Joseph Smith. This is true for every generation. (“ Joseph Smith ,” Ensign or Liahona , Nov. 2014, 29–30) Why do you think it is important for each of us to receive a spiritual confirmation from Heavenly Father, through the Holy Ghost, about Joseph Smith’s divine mission? Share the following statement by Elder Andersen or show the video “ Joseph Smith ” on ChurchofJesusChrist.org from time code 11:44 to 12:48. 14:49 Elder Andersen shared two ways we can gain or strengthen our testimony of the Prophet Joseph Smith. To the youth listening today or reading these words in the days ahead, I give a specific challenge: Gain a personal witness of the Prophet Joseph Smith. Let your voice help fulfill Moroni’s prophetic words to speak good of the Prophet. Here are two ideas: First, find scriptures in the Book of Mormon that you feel and know are absolutely true. Then share them with family and friends in family home evening, seminary, and your Young Men and Young Women classes, acknowledging that Joseph was an instrument in God’s hands. Next, read the testimony of the Prophet Joseph Smith in the Pearl of Great Price. … This is Joseph’s own testimony of what actually occurred. Read it often. (“ Joseph Smith ,” Ensign or Liahona , Nov. 2014, 30) After sharing this statement, invite students to choose one of Elder Andersen’s suggestions to strengthen their personal witness that the Lord called Joseph Smith as a prophet. Option 1: Find one or more personally meaningful scriptures in the Book of Mormon. Create a picture or write a paragraph highlighting your selection. Include your thoughts and feelings about how the Book of Mormon and its teachings help you learn about and love the Savior. Also include how this helps confirm that Joseph was an instrument in God’s hands. Option 2: Read Joseph Smith’s testimony as recorded in Joseph Smith History 1:15–20 and the testimony of Joseph Smith recorded in Doctrine and Covenants 135:3 . Create a picture or write a paragraph about what you have learned and felt about how the Savior chose and prepared Joseph Smith to be the prophet of the Restoration. Testify of the Prophet Joseph Smith When students have completed the activity, invite them to share what they created with a class member. Then, you might invite a few willing students to testify about how Jesus Christ called Joseph Smith to be a prophet. The following questions can help. What have you learned today that has strengthened your testimony of Joseph Smith? How does having a testimony of Joseph Smith strengthen your testimony of Jesus Christ? Consider closing with your testimony of the work the Lord performed through Joseph Smith. Invite students to continue to listen for impressions from the Spirit to know for themselves that Jesus Christ called Joseph Smith to be a prophet.\n\n\n--- Lesson 37 ---\nReflecting on and assessing our spiritual learning can help us draw closer to Heavenly Father and Jesus Christ. This lesson is intended to help students reflect on the goals they have set and the growth they have experienced during their study of Genesis 12–50 and Abraham 1–2 . Student preparation: Invite students to come ready to share ways they have grown spiritually from their study of the Old Testament and the Pearl of Great Price this year. You might suggest that they review their study journals or notes in their scriptures to help them notice their growth and learning. Possible Learning Activities Your class’s study of Abraham 1–2 and Genesis 12–50 may have focused on different outcomes than the outcomes assessed in this lesson. If so, adapt the activities to assess the growth students experienced from the outcomes your class focused on. In this lesson, students will have the opportunity to assess their progress in the following three areas: Explain the importance of eternal marriage in Heavenly Father’s plan. ( Note: This activity is based on teachings from Lesson 9: “ Genesis 1:28–2:25 ” and Lesson 29: “ Genesis 24 .”) Feel an increased desire to make and keep covenants with God. ( Note: This activity is based on teachings from Lesson 23: “ Genesis 12, 17 ” and Lesson 31: “ Genesis 28 .”) Participate in the gathering of Israel. ( Note: This activity is based on teachings from Lesson 24: “ Abraham 2:9–11 .”) Becoming more like Jesus Christ Identifying how they are growing spiritually can help students in their efforts to become disciples of Jesus Christ. To help them do this, consider displaying the following images. Alternatively, students could draw a picture of two trees in their study journals: a young tree and a mature tree. Imagine that these are pictures of the same tree taken a few years apart from each other. In your study journals, list any evidence you see that the tree is growing. Students could work in partnerships or small groups to share their lists and to answer the following questions. How can we compare these images of a tree to our spiritual growth to become more like Heavenly Father and Jesus Christ? What are some ways we can recognize how we are growing spiritually and becoming more like Heavenly Father and Jesus Christ? Explain that we can identify spiritual growth by reviewing what we have learned about Heavenly Father and Jesus Christ and how it has helped us improve our relationship with Them. Invite students to take a few minutes to review what they have learned and applied from their seminary experience this year. They could do this by looking through their scriptures and notes. What are you learning in seminary that is helping you grow spiritually and become more like Jesus Christ? What evidence of spiritual growth have you noticed in your life? Explain the importance of eternal marriage in Heavenly Father’s plan This exercise can help students explain the importance of eternal marriage in Heavenly Father’s plan. Invite students to turn to the image they may have drawn in Lesson 29: “ Genesis 24 .” Give students time to review what they learned about marriage in Lesson 9: “ Genesis 1:28–2:25 ” and Lesson 29: “ Genesis 24 .” Students could review any notes or insights they recorded in their study journals. They could also review the following verses and anything they may have marked in them: Genesis 1:27–28 Genesis 2:18, 21–24 Doctrine and Covenants 49:15–17 Doctrine and Covenants 131:1–4 To help students explain their understanding of eternal marriage, share a scenario like the following. You can adjust the scenario to meet the needs of your students. Today at school, you were talking about future plans with some friends. You mentioned marriage as one of your plans. One of your friends asked: “It seems like you have a lot of potential for a career. Why do you want to get married?” Using what you have learned about eternal marriage in Heavenly Father’s plan, how would you respond to your friend? Students might take a few minutes to plan their responses. Encourage students to find a few scriptures they have studied in the Old Testament or other places. Ask them to share those scriptures as part of their explanations. Consider placing students in partnerships. Invite each student to practice explaining what they would say to their friend. Feel an increased desire to make and keep covenants with God Students may have drawn a picture of Jacob’s dream as part of Lesson 31: “ Genesis 28 .” They could refer to their pictures as part of their review of covenants. You could also display the following image. Invite students to recall what they remember from the event depicted about making and keeping covenants (see also Lesson 23: “ Genesis 12, 17 ”). If helpful, students could review Genesis 28:10–21 . You might want to remind students that Jacob made covenants with God after leaving his parents’ home and starting life on his own. As part of Lesson 31: Genesis 28 , students reflected on the opportunity they will have to make covenants with God in the temple. Students may have written answers in their study journals to the following questions: What promised blessings have you experienced from striving to keep your covenants with God or by serving in the temple? What situations might you face in the future where you would benefit from the care and protection God promises to people who make covenants with Him? If relevant, invite students to review the answers they recorded. After sufficient time, provide students with paper and envelopes for the following activity. Using what you have learned about making and keeping covenants with God, write a letter to yourself that you could open at the end of high school. Write about why you feel it is important to make and keep covenants with God in the temple and throughout your life. Include how making covenants with God can increase your access to His guidance, care, and protection. Participate in the gathering of Israel In Lesson 24: “ Abraham 2:9–11 ,” students may have made a plan to participate in the gathering of Israel. If so, give students time to review their plans. Their plans may have included ways to share the gospel, to help others make or keep covenants with the Lord, or to bless others through temple and family history work. Students who haven’t yet created a plan can use the following visual to begin making one. You may have made plans to participate in the gathering of Israel. Reflect on these plans by filling out the following graphic in your study journal. Invite a few willing students to share what experiences they have had acting on their plans and how those experiences have affected them. Ask students to share how participating in the gathering of Israel has influenced their feelings for Heavenly Father and Jesus Christ. Invite students to continue to seek the help of the Holy Ghost to know ways they can participate in the gathering of Israel. Encourage students who may not have acted on a plan to begin now. Testify of the blessings the Lord will give them and others as they carry out their plans.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 42",
      "content": "1. Now when Jacob saw that there wascornin Egypt, Jacob said unto his sons, Why do ye look one upon another?\n2. And he said, Behold, I have heard that there is corn in Egypt: get you down thither, and buy for us from thence; that we may live, and not die.\n3. And Josephs ten brethren went down to buycornin Egypt.\n4. ButBenjamin, Josephs brother, Jacob sent not with his brethren; for he said, Lest peradventure mischief befall him.\n5. And the sons of Israel came to buycornamong those that came: for the famine was in the land of Canaan.\n6. And Josephwasthegovernorover the land,andheit wasthat sold to all the people of the land: and Josephs brethren came, andboweddown themselves before himwiththeir faces to the earth.\n7. And Joseph saw his brethren, and he knew them, but made himself strange unto them, and spake roughly unto them; and he said unto them, Whence come ye? And they said, From the land of Canaan to buy food.\n8. And Joseph knew his brethren, but they knew not him.\n9. And Joseph remembered thedreamswhich he dreamed of them, and said unto them, Yearespies; to see the nakedness of the land ye are come.\n10. And they said unto him, Nay, my lord, but to buy food are thy servants come.\n11. Weareall onemanssons; wearetruemen,thy servants are no spies.\n12. And he said unto them, Nay, but to see the nakedness of the land ye are come.\n13. And they said, Thy servantsaretwelve brethren, the sons of one man in the land of Canaan; and, behold, the youngestisthis day with our father, and oneisnot.\n14. And Joseph said unto them, Thatis itthat I spake unto you, saying, Yearespies:\n15. Hereby ye shall be proved: By the life of Pharaoh ye shall not go forth hence, except your youngest brother come hither.\n16. Send one of you, and let him fetch your brother, and ye shall be kept in prison, that your words may be proved, whetherthere be anytruth in you: or else by the life of Pharaoh surely yearespies.\n17. And he put them all together into ward three days.\n18. And Joseph said unto them the third day, This do, and live;forIfearGod:\n19. If yebetruemen,let one of your brethren be bound in the house of your prison: go ye, carry corn for the famine of your houses:\n20. But bring your youngest brother unto me; so shall your words be verified, and ye shall not die. And they did so.\n21. And they said one to another, Weareverilyguiltyconcerning our brother, in that we saw the anguish of his soul, when he besought us, and we would not hear; therefore is this distress come upon us.\n22. AndReubenanswered them, saying, Spake I not unto you, saying, Do not sin against the child; and ye would not hear? therefore, behold, also hisbloodis required.\n23. And they knew not that Joseph understoodthem;for he spake unto them by an interpreter.\n24. And he turned himself about from them, andwept; and returned to them again, and communed with them, and took from them Simeon, and bound him before their eyes.\n25. Then Joseph commanded to fill their sacks with corn, and to restore every mansmoneyinto his sack, and to give them provision for the way: and thus did he unto them.\n26. And they laded their asses with the corn, and departed thence.\n27. And as one of them opened his sack to give his ass provender in the inn, he espied hismoney; for, behold, itwasin his sacks mouth.\n28. And he said unto his brethren, My money is restored; and, lo,it iseven in my sack: and their heart failedthem,and they were afraid, saying one to another, WhatisthisthatGod hath done unto us?\n29. And they came unto Jacob their father unto the land of Canaan, and told him all that befell unto them; saying,\n30. The man,who isthe lord of the land, spake roughly to us, and took us for spies of the country.\n31. And we said unto him, Wearetruemen;we are no spies:\n32. Webetwelve brethren, sons of our father; oneisnot, and the youngestisthis day with our father in the land of Canaan.\n33. And the man, the lord of the country, said unto us, Hereby shall I know that yearetruemen;leave one of your brethrenherewith me, and takefood forthe famine of your households, and be gone:\n34. And bring your youngest brother unto me: then shall I know that yeareno spies, butthatyearetruemen: sowill I deliver you your brother, and ye shall traffick in the land.\n35. And it came to pass as they emptied their sacks, that, behold, every mans bundle of moneywasin his sack: and whenboththey and their father saw the bundles of money, they were afraid.\n36. And Jacob their father said unto them, Me have ye bereavedof my children:Josephisnot, and Simeonisnot, and ye will takeBenjaminaway:all these things are against me.\n37. AndReubenspake unto his father, saying, Slay my two sons, if I bring him not to thee: deliver him into my hand, and I will bring him to thee again.\n38. And he said, My son shall not go down with you; for his brother is dead, and he is left alone: if mischief befall him by the way in the which ye go, then shall ye bring down my gray hairs withsorrowto the grave.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 43",
      "content": "1. And the faminewassore in the land.\n2. And it came to pass, when they had eaten up the corn which they had brought out of Egypt, their father said unto them, Go again, buy us little food.\n3. And Judah spake unto him, saying, The man did solemnly protest unto us, saying, Ye shall not see my face, except yourbrotherbewith you.\n4. If thou wilt send our brother with us, we will go down and buy thee food:\n5. But if thou wilt not sendhim,we will not go down: for the man said unto us, Ye shall not see my face, except yourbrotherbewith you.\n6. And Israel said, Wherefore dealt yesoill with me,asto tell the man whether ye had yet brother?\n7. And they said, The man asked us straitly of our state, and of our kindred, saying,Isyour father yet alive? have yeanotherbrother? and we told him according to the tenor of these words: could we certainly know that he would say, Bring your brother down?\n8. And Judah said unto Israel his father, Send the lad with me, and we will arise and go; that we may live, and not die, both we, and thou,andalso our little ones.\n9. I will be surety for him; of my hand shalt thou require him: if I bring him not unto thee, and set him before thee, then let me bear theblamefor ever:\n10. For except we had lingered, surely now we had returned this second time.\n11. And their father Israel said unto them, Ifit must beso now, do this; take of the best fruits in the land in your vessels, and carry down the man present, little balm, and little honey, spices, and myrrh, nuts, and almonds:\n12. And take double money in your hand; and themoneythat was brought again in the mouth of your sacks, carryitagain in your hand; peradventure itwasan oversight:\n13. Take also your brother, and arise, go again unto the man:\n14. And God Almighty give you mercy before the man, that he may send away your other brother, and Benjamin. If I be bereavedof my children,I am bereaved.\n15. And the men took that present, and they took double money in their hand, and Benjamin; and rose up, and went down to Egypt, and stood before Joseph.\n16. And when Joseph saw Benjamin with them, he said to the ruler of his house, Bringthesemen home, and slay, and make ready; forthesemen shall dine with me at noon.\n17. And the man did as Joseph bade; and the man brought the men into Josephs house.\n18. And the men were afraid, because they were brought into Josephs house; and they said, Because of the money that was returned in our sacks at the first time are we brought in; that he may seek occasion against us, and fall upon us, and take us for bondmen, and our asses.\n19. And they came near to the steward of Josephs house, and they communed with him at the door of the house,\n20. And said, Osir, we came indeed down at the first time to buyfood:\n21. And it came to pass, when we came to the inn, that we opened our sacks, and, behold,everymansmoneywasin the mouth of his sack, our money in full weight: and we have brought it again in our hand.\n22. And other money have we brought down in our hands to buy food: we cannot tell who put our money in our sacks.\n23. And he said, Peacebeto you, fear not: your God, and the God of your father, hath given you treasure in your sacks: I had your money. And he brought Simeon out unto them.\n24. And the man brought the men into Josephs house, and gavethemwater, and theywashedtheir feet; and he gave their asses provender.\n25. And they made ready the present against Joseph came at noon: for they heard that they should eat bread there.\n26. And when Joseph came home, they brought him the present whichwasin their hand into the house, andbowedthemselves to him to the earth.\n27. And he asked them oftheirwelfare, and said,Isyour father well, the oldmanof whom ye spake?Ishe yet alive?\n28. And they answered, Thy servant our fatherisin good health, heisyet alive. And they bowed down their heads, and made obeisance.\n29. And he lifted up his eyes, and saw his brotherBenjamin, his mothers son, and said,Isthis your younger brother, of whom ye spake unto me? And he said, God be gracious unto thee, my son.\n30. And Joseph made haste; for his bowels did yearn upon his brother: and he soughtwhereto weep; and he entered intohischamber, andweptthere.\n31. And he washed his face, and went out, and refrained himself, and said, Set on bread.\n32. And they set on for him by himself, and for them by themselves, and for the Egyptians, which did eat with him, by themselves: because the Egyptians might not eat bread with the Hebrews; for thatisanabominationunto the Egyptians.\n33. And they sat before him, the firstborn according to hisbirthright, and the youngest according to his youth: and the men marvelled one at another.\n34. And he tookand sentmessesunto them from before him: butBenjaminsmess was five times so much as any of theirs. And they drank, and were merry with him.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 44",
      "content": "1. And he commanded the steward of his house, saying, Fill the mens sackswithfood, as much as they can carry, and put every mans money in his sacks mouth.\n2. And put my cup, the silver cup, in the sacks mouth of the youngest, and his corn money. And he did according to the word that Joseph had spoken.\n3. As soon as the morning was light, the men were sent away, they and their asses.\n4. Andwhen they were gone out of the city,andnotyetfar off, Joseph said unto his steward, Up, follow after the men; and when thou dost overtake them, say unto them, Wherefore have ye rewarded evil for good?\n5. Isnot thisitin which my lord drinketh, and whereby indeed he divineth? ye have done evil in so doing.\n6. And he overtook them, and he spake unto them these same words.\n7. And they said unto him, Wherefore saith my lord these words? God forbid that thy servants should do according to this thing:\n8. Behold, the money, which we found in our sacks mouths, we brought again unto thee out of the land of Canaan: how then should we steal out of thy lords house silver or gold?\n9. With whomsoever of thy servants it be found, both let him die, and we also will be my lords bondmen.\n10. And he said, Now alsoletitbeaccording unto your words: he with whom it is found shall be my servant; and ye shall be blameless.\n11. Then they speedily took down every man his sack to the ground, and opened every man his sack.\n12. And he searched,andbegan at the eldest, and left at the youngest: and the cup was found in Benjamins sack.\n13. Then theyrenttheir clothes, and laded every man his ass, and returned to the city.\n14. And Judah and his brethren came to Josephs house; for hewasyet there: and theyfellbefore him on the ground.\n15. And Joseph said unto them, What deedisthis that ye have done? wot ye not that such man as I can certainly divine?\n16. And Judah said, What shall we say unto my lord? what shall we speak? or how shall we clear ourselves? God hath found out the iniquity of thy servants: behold, wearemy lords servants, both we, andhealso with whom the cup is found.\n17. And he said, God forbid that I should do so:butthe man in whose hand the cup is found, he shall be my servant; and as for you, get you up in peace unto your father.\n18. Then Judah came near unto him, and said, Oh mylord, let thy servant, I pray thee, speak word in my lords ears, and let not thineangerburn against thy servant: for thouarteven as Pharaoh.\n19. My lord asked his servants, saying, Have ye father, or brother?\n20. And we said unto my lord, We have father, an oldman, and child of his old age, little one; and his brother is dead, and he alone is left of his mother, and his father loveth him.\n21. And thou saidst unto thy servants, Bring him down unto me, that I may set mine eyes upon him.\n22. And we said unto my lord, The lad cannot leave his father: forifheshould leave his father,his fatherwould die.\n23. And thou saidst unto thy servants, Except your youngestbrothercome down with you, ye shall see my face no more.\n24. And it came to pass when we came up unto thy servant my father, we told him the words of my lord.\n25. And our father said, Go again,andbuy us little food.\n26. And we said, We cannot go down: if our youngest brother be with us, then will we go down: for we may not see the mans face, except ouryoungestbrotherbewith us.\n27. And thy servant my father said unto us, Ye know that my wife bare me twosons:\n28. And the one went out from me, and I said, Surely he istorninpieces; and I saw him not since:\n29. And if yetakethis also from me, and mischief befallhim, ye shall bring down my gray hairs with sorrow to the grave.\n30. Now therefore when I come to thy servant my father, and the ladbenot with us; seeing that his life isboundup in the lads life;\n31. It shall come to pass, when he seeth that the ladisnotwith us,that he will die: and thy servants shall bring down the gray hairs of thy servant our father withsorrowto the grave.\n32. For thy servant became surety for the lad unto my father, saying, If I bring him not unto thee, then I shall bear theblameto my father for ever.\n33. Now therefore, I pray thee, let thy servant abide instead of the lad bondman to my lord; and let the lad go up with his brethren.\n34. For how shall I go up to my father, and the ladbenot with me? lest peradventure I see the evil that shall come on my father.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 45",
      "content": "1. Then Joseph could notrefrainhimself before all them that stood by him; and hecried, Cause every man to go out from me. And there stood no man with him, while Joseph made himself known unto his brethren.\n2. And he wept aloud: and the Egyptians and the house of Pharaoh heard.\n3. And Joseph said unto his brethren, IamJoseph; doth my father yet live? And his brethren could not answer him; for they weretroubledat his presence.\n4. And Joseph said unto his brethren, Come near to me, I pray you. And they came near. And he said, IamJosephyour brother, whom ye sold into Egypt.\n5. Now therefore be notgrieved, nor angry with yourselves, that ye sold me hither: for God didsendme before you to preserve life.\n6. For these two yearshaththe faminebeenin the land: and yetthere arefive years, in the whichthere shallneitherbeearing nor harvest.\n7. And God sent me before you topreserveyou aposterityin the earth, and to save your lives by great deliverance.\n8. So nowit wasnot youthatsent me hither, but God: and he hath made me father to Pharaoh, and lord of all his house, and arulerthroughout all the land of Egypt.\n9. Haste ye, and go up to my father, and say unto him, Thus saith thy son Joseph, God hath made me lord of all Egypt: come down unto me, tarry not:\n10. And thou shalt dwell in the land ofGoshen, and thou shalt be near unto me, thou, and thy children, and thy childrens children, and thy flocks, and thy herds, and all that thou hast:\n11. And there will Inourishthee; for yetthere arefive years of famine; lest thou, and thy household, and all that thou hast, come to poverty.\n12. And, behold, your eyes see, and the eyes of my brother Benjamin, thatit ismy mouth that speaketh unto you.\n13. And ye shall tell my father of all my glory in Egypt, and of all that ye have seen; and ye shall haste and bring down myfatherhither.\n14. And he fell upon his brother Benjamins neck, and wept; and Benjamin wept upon his neck.\n15. Moreover he kissed all his brethren, and wept upon them: and after that his brethren talked with him.\n16. And the fame thereof was heard in Pharaohs house, saying, Josephs brethren are come: and itpleasedPharaoh well, and his servants.\n17. And Pharaoh said unto Joseph, Say unto thy brethren, This do ye; lade your beasts, and go, get you unto the land of Canaan;\n18. And take your father and your households, and come unto me: and I will give you the good of the land of Egypt, and ye shall eat the fat of the land.\n19. Now thou art commanded, this do ye; take youwagonsout of the land of Egypt for your little ones, and for your wives, and bring your father, and come.\n20. Also regard not your stuff; for the good of all the land of Egyptisyours.\n21. And the children of Israel did so: and Joseph gave them wagons, according to the commandment of Pharaoh, and gave them provision for the way.\n22. To all of them he gave each man changes of raiment; but toBenjaminhe gave three hundredpiecesof silver, and five changes of raiment.\n23. And to his father he sent after thismanner;ten asses laden with the good things of Egypt, and ten she asses laden with corn and bread and meat for his father by the way.\n24. So he sent his brethren away, and they departed: and he said unto them, See that ye fall not out by the way.\n25. And they went up out of Egypt, and came into the land of Canaan unto Jacob their father,\n26. And told him, saying, Josephisyet alive, and heisgovernorover all the land of Egypt. And Jacobs heart fainted, for he believed them not.\n27. And they told him all the words of Joseph, which he had said unto them: and when he saw thewagonswhich Joseph had sent to carry him, the spirit of Jacob their fatherrevived:\n28. And Israel said,It isenough; Joseph my sonisyet alive: I will go and see him before I die.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 46",
      "content": "1. And Israel took his journey with all that he had, and came toBeer-sheba, and offered sacrifices unto the God of his father Isaac.\n2. And God spake unto Israel in thevisionsof the night, and said, Jacob, Jacob. And he said, HereamI.\n3. And he said, IamGod, the God of thyfather: fear not to go down intoEgypt; for I will there make of thee greatnation:\n4. Iwill go down with thee into Egypt; and I will also surelybringthee upagain:andJosephshall put his hand upon thine eyes.\n5. And Jacobrose upfrom Beer-sheba: and the sons of Israel carried Jacob their father, and their little ones, and their wives, in thewagonswhich Pharaoh had sent to carry him.\n6. And they took their cattle, and their goods, which they had gotten in the land of Canaan, and came intoEgypt, Jacob, and all his seed with him:\n7. His sons, and his sons sons with him, his daughters, and his sons daughters, and all hisseedbrought he with him into Egypt.\n8. And thesearethenamesof thechildren of Israel, which came into Egypt, Jacob and his sons: Reuben, Jacobs firstborn.\n9. And the sons ofReuben; Hanoch, and Phallu, and Hezron, and Carmi.\n10. And the sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Shaul the son of Canaanitish woman.\n11. And the sons ofLevi; Gershon, Kohath, and Merari.\n12. And the sons of Judah;Er, andOnan, and Shelah, and Pharez, andZerah: but Er and Onan died in the land of Canaan. And the sons of Pharez were Hezron and Hamul.\n13. And the sons ofIssachar; Tola, and Phuvah, and Job, and Shimron.\n14. And the sons of Zebulun; Sered, and Elon, and Jahleel.\n15. Thesebethe sons ofLeah, which she bare unto Jacob in Padan-aram, with his daughter Dinah: all the souls of his sons and his daughterswerethirty and three.\n16. And the sons ofGad; Ziphion, and Haggi, Shuni, and Ezbon, Eri, and Arodi, and Areli.\n17. And the sons of Asher; Jimnah, and Ishuah, and Isui, and Beriah, and Serah their sister: and the sons of Beriah; Heber, and Malchiel.\n18. Thesearethe sons ofZilpah, whom Laban gave to Leah his daughter, and these she bare unto Jacob,evensixteen souls.\n19. The sons of Rachel Jacobs wife; Joseph, andBenjamin.\n20. And unto Joseph in the land of Egypt were bornManassehand Ephraim, whichAsenaththe daughter of Poti-pherah priest of On bare unto him.\n21. And the sons ofBenjaminwereBelah, and Becher, and Ashbel, Gera, and Naaman, Ehi, and Rosh, Muppim, and Huppim, and Ard.\n22. Thesearethe sons of Rachel, which were born to Jacob: all the soulswerefourteen.\n23. And the sons ofDan; Hushim.\n24. And the sons of Naphtali; Jahzeel, and Guni, and Jezer, and Shillem.\n25. Thesearethe sons ofBilhah, which Laban gave unto Rachel his daughter, and she bare these unto Jacob: all the soulswereseven.\n26. All the souls that came with Jacob into Egypt, which came outof his loins, besides Jacobs sons wives, all the soulswerethreescore and six;\n27. And the sons of Joseph, which were born him in Egypt,weretwo souls: all the souls of the house ofJacob, which came into Egypt,werethreescoreand ten.\n28. And he sent Judah before him unto Joseph, to direct his face unto Goshen; and they came into the land ofGoshen.\n29. And Joseph made ready his chariot, and went up to meet Israel his father, to Goshen, and presented himself unto him; and he fell on his neck, andwepton his neck good while.\n30. And Israel said unto Joseph, Now let me die, since I have seen thy face, because thouartyet alive.\n31. And Joseph said unto his brethren, and unto his fathers house, I will go up, and shewPharaoh, and say unto him, My brethren, and my fathers house, whichwerein the land of Canaan, are come unto me;\n32. And the menareshepherds, for their trade hath been to feed cattle; and they have brought their flocks, and their herds, and all that they have.\n33. And it shall come to pass, when Pharaoh shall call you, and shall say, Whatisyouroccupation?\n34. That ye shall say, Thy servants trade hath been aboutcattlefrom our youth even until now, both we,andalso our fathers: that ye may dwell in the land of Goshen; for every shepherdisanabominationunto the Egyptians.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 47",
      "content": "1. Then Joseph came and toldPharaoh, and said, My father and my brethren, and their flocks, and their herds, and all that they have, are come out of the land of Canaan; and, behold, theyarein the land ofGoshen.\n2. And he took some of his brethren,evenfive men, and presented them untoPharaoh.\n3. And Pharaoh said unto his brethren, Whatisyouroccupation? And they said unto Pharaoh, Thy servantsareshepherds, both we,andalso our fathers.\n4. They said moreover unto Pharaoh, For tosojournin the land are we come; for thy servants have no pasture for their flocks; for the famineissore in the land of Canaan: now therefore, we pray thee, let thy servants dwell in the land of Goshen.\n5. And Pharaoh spake unto Joseph, saying, Thy father and thy brethren are come unto thee:\n6. The land ofEgyptisbefore thee; in the best of the land make thy father and brethren to dwell; in the land of Goshen let them dwell: and if thou knowestanymen of activity among them, then make them rulers over my cattle.\n7. And Joseph brought in Jacob his father, and set him before Pharaoh: and Jacob blessed Pharaoh.\n8. And Pharaoh said unto Jacob, How oldartthou?\n9. And Jacob said unto Pharaoh, The days of the years of mypilgrimagearean hundred and thirty years: few andevilhave the days of the years of my life been, and have not attained unto thedaysof the years of the life of my fathers in the days of their pilgrimage.\n10. And Jacob blessed Pharaoh, and went out from before Pharaoh.\n11. And Joseph placed his father and his brethren, and gave them possession in the land of Egypt, in the best of the land, in the land ofRameses, as Pharaoh had commanded.\n12. And Josephnourishedhis father, and his brethren, and all his fathers household, with bread, according totheirfamilies.\n13. Andthere wasno bread in all the land; for thefaminewasvery sore, so that the land of Egypt andallthe land of Canaan fainted by reason of the famine.\n14. And Joseph gathered up all themoneythat was found in the land of Egypt, and in the land of Canaan, for the corn which they bought: and Joseph brought the money into Pharaohs house.\n15. And when money failed in the land of Egypt, and in the land of Canaan, all the Egyptians came unto Joseph, and said, Give usbread: for why should we die in thy presence? for the money faileth.\n16. And Joseph said, Give your cattle; and I will give you for your cattle, if money fail.\n17. And they brought their cattle unto Joseph: and Joseph gave them breadin exchangefor horses, and for the flocks, and for the cattle of the herds, and for the asses: and he fed them with bread for all their cattle for that year.\n18. When that year was ended, they came unto him the second year, and said unto him, We will not hideitfrom my lord, how that our money is spent; my lord also hath our herds of cattle; there is not ought left in the sight of my lord, but our bodies, and our lands:\n19. Wherefore shall we die before thine eyes, both we and our land? buy us and our land for bread, and we and our land will be servants unto Pharaoh: and giveusseed, that we may live, and not die, that the land be not desolate.\n20. And Joseph bought all the land of Egypt for Pharaoh; for the Egyptians sold every man his field, because the famine prevailed over them: so the land became Pharaohs.\n21. And as for the people,heremoved them to cities fromoneend of the borders of Egypt even to theotherend thereof.\n22. Only the land of thepriestsbought he not; for the priests had portionassigned themof Pharaoh, and did eat their portion which Pharaoh gave them: wherefore they sold not their lands.\n23. Then Joseph said unto the people, Behold, I have bought you this day and your land for Pharaoh: lo,here isseed for you, and ye shall sow the land.\n24. And it shall come to passin the increase, that ye shall give thefifthpartunto Pharaoh, and four parts shall be your own, for seed of the field, and for your food, and for them of your households, and for food for your little ones.\n25. And they said, Thou hast saved our lives: let us find grace in the sight of my lord, and we will be Pharaohs servants.\n26. And Joseph made it law over the land of Egypt unto this day,thatPharaoh should have the fifthpart;except the land of thepriestsonly,whichbecame not Pharaohs.\n27. And Israel dwelt in the land of Egypt, in the country of Goshen; and they had possessions therein, and grew, and multiplied exceedingly.\n28. And Jacob lived in the land of Egypt seventeen years: so the whole age ofJacobwas an hundred forty and seven years.\n29. And thetimedrew nigh that Israel must die: and he called his son Joseph, and said unto him, If now I have found grace in thy sight, put, I pray thee, thy hand under mythigh, and deal kindly and truly with me;buryme not, I pray thee, in Egypt:\n30. But I will lie with my fathers, and thou shalt carry me out of Egypt, andburyme in their buryingplace. And he said, I will do as thou hast said.\n31. And he said, Swear unto me. And he sware unto him. And Israelbowedhimselfuponthebedshead.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 48",
      "content": "1. And it came to pass after these things, thatonetold Joseph, Behold, thy fatherissick: and he took with him his two sons, Manasseh and Ephraim.\n2. AndonetoldJacob, and said, Behold, thy son Joseph cometh unto thee: and Israelstrengthenedhimself, and sat upon the bed.\n3. And Jacob said unto Joseph, GodAlmightyappearedunto me atLuzin the land of Canaan, and blessed me,\n4. And said unto me, Behold, I will make theefruitful, and multiply thee, and I will make of thee multitude of people; and will give thislandto thy seed after theeforan everlastingpossession.\n5. Andnow thy two sons,EphraimandManasseh, which were born unto thee in the land of Egypt before I came unto thee into Egypt,aremine; as Reuben and Simeon, they shall be mine.\n6. And thy issue, which thou begettest after them, shall be thine,andshall be called after the name of their brethren in their inheritance.\n7. And as for me, when I came from Padan,Racheldied by me in the land of Canaan in the way, when yetthere wasbut little way to come unto Ephrath: and I buried her there in the way of Ephrath; the sameisBeth-lehem.\n8. And Israel beheld Josephs sons, and said, Whoarethese?\n9. And Joseph said unto his father, Theyaremy sons, whom God hath given me in thisplace.And he said, Bring them, I pray thee, unto me, and I willblessthem.\n10. Now the eyes of Israel weredimfor age,so thathe could not see. And he brought themnearunto him; and he kissed them, and embraced them.\n11. And Israel said unto Joseph, I had not thought to see thy face: and, lo, God hath shewed me also thy seed.\n12. And Joseph brought them out from between his knees, and he bowed himself with his face to the earth.\n13. And Joseph took them both, Ephraim in his right hand toward Israels left hand, and Manasseh in his left hand toward Israels right hand, and broughtthemnear unto him.\n14. And Israel stretched out his right hand, and laidituponEphraimshead, whowasthe younger, and his left hand upon Manassehs head,guiding his handswittingly; for Manassehwasthe firstborn.\n15. And he blessedJoseph, and said, God, before whom my fathers Abraham and Isaac didwalk, the God whichfedme all my life long unto this day,\n16. TheAngelwhich redeemed me from all evil, bless the lads; and let mynamebe named on them, and the name of my fathers Abraham and Isaac; and let them grow into multitude in the midst of the earth.\n17. And when Joseph saw that his father laid his righthandupon the head ofEphraim,it displeased him: and he held up his fathers hand, to remove it from Ephraims head unto Manassehs head.\n18. And Joseph said unto his father, Not so, my father: for thisisthe firstborn; put thy right hand upon his head.\n19. And his father refused, and said, I knowit,my son, I knowit:he also shall become people, and he also shall begreat: but truly his younger brother shall be greater than he, and hisseedshall become amultitudeofnations.\n20. And he blessed them that day, saying,In theeshall Israelbless, saying, God make thee as Ephraim and as Manasseh: and he setEphraimbefore Manasseh.\n21. And Israel said unto Joseph, Behold, I die: butGodshall be with you, andbringyou again unto thelandof your fathers.\n22. Moreover I have given to thee oneportionabove thy brethren, which I took out of the hand of the Amorite with my sword and with my bow.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 49",
      "content": "1. AndJacobcalled unto hissons, and said, Gather yourselves together, that I may tell youthatwhich shall befall you in thelast days.\n2. Gather yourselves together, and hear, ye sons of Jacob; and hearken unto Israel yourfather.\n3. Reuben, thouartmy firstborn, my might, and thebeginningof my strength, the excellency of dignity, and the excellency of power:\n4. Unstable as water, thou shalt not excel; because thou wentest up to thy fathersbed; thendefiledstthouit:he went up to my couch.\n5. SimeonandLeviarebrethren;instruments ofcrueltyare intheir habitations.\n6. O my soul, come not thou into their secret; unto their assembly, mine honour, be not thouunited: for in theirangertheyslewa man, and in their selfwill they digged down wall.\n7. Cursedbetheiranger, forit wasfierce; and their wrath, for it wascruel: I will divide them in Jacob, and scatter them in Israel.\n8. Judah, thouart hewhom thy brethren shallpraise: thy handshall bein theneckof thine enemies; thy fathers children shallbowdown before thee.\n9. Judahisalionswhelp: from the prey, my son, thou art gone up: he stooped down, he couched as alion, and as an old lion; who shall rouse him up?\n10. The sceptre shall not depart fromJudah, nor alawgiverfrom between his feet, untilShilohcome; and unto himshallthegatheringof the peoplebe.\n11. Binding his foal unto the vine, and his asss colt unto the choicevine; hewashedhis garments in wine, and his clothes in thebloodof grapes:\n12. His eyesshall bered with wine, and his teeth white with milk.\n13. Zebulunshall dwell at the haven of the sea; and heshall befor an haven of ships; and his bordershall beunto Zidon.\n14. Issacharisa strong ass couching down between two burdens:\n15. And he saw that restwasgood, and the land thatit waspleasant; and bowed his shoulder to bear, and became servant unto tribute.\n16. Danshalljudgehis people, as one of the tribes of Israel.\n17. Dan shall be serpent by the way, an adder in the path, that biteth the horse heels, so that his rider shall fall backward.\n18. I havewaitedfor thy salvation, OLord.\n19. Gad, atroopshall overcome him: but he shall overcome at the last.\n20. Out ofAsherhis breadshall befat, and he shall yield royal dainties.\n21. Naphtaliisa hind let loose: he giveth goodly words.\n22. Josephisa fruitfulbough,evena fruitful bough by well;whosebranchesrunover the wall:\n23. The archers have sorely grieved him, and shotat him,and hated him:\n24. But his bow abode in strength, and the arms of his hands were madestrong by the hands of the mightyGodof Jacob; (fromthenceistheshepherd, thestoneof Israel:)\n25. Evenby the God of thy father, who shall help thee; and by theAlmighty, who shall bless thee with blessings of heaven above, blessings of the deep that lieth under, blessings of the breasts, and of thewomb:\n26. Theblessingsof thy father have prevailed above the blessings of my progenitors unto theutmostbound of the everlastinghills: they shall be on the head ofJoseph, and on the crown of the head of him that was separate from his brethren.\n27. Benjaminshall ravinasa wolf: in the morning he shall devour the prey, and at night he shall divide the spoil.\n28. All thesearethetwelve tribesof Israel: and thisis itthat their father spake unto them, andblessedthem; every one according to hisblessinghe blessed them.\n29. And he charged them, and said unto them, I am to be gathered unto mypeople:buryme with my fathers in the cave thatisin the field of Ephron the Hittite,\n30. In the cave thatisin the field ofMachpelah, whichisbefore Mamre, in the land of Canaan, which Abraham bought with the field ofEphronthe Hittite for possession of buryingplace.\n31. There theyburiedAbraham and Sarah his wife; there they buried Isaac and Rebekah his wife; and there I buried Leah.\n32. The purchase of the field and of the cave thatisthereinwasfrom the children of Heth.\n33. And when Jacob had made an end of commanding his sons, he gathered up his feet into the bed, and yielded up theghost, and wasgatheredunto his people.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 50",
      "content": "1. AndJosephfell upon his fathers face, andweptupon him, and kissed him.\n2. And Joseph commanded his servants the physicians toembalmhis father: and the physicians embalmed Israel.\n3. And forty days were fulfilled for him; for so are fulfilled the days of those which are embalmed: and the Egyptians mourned for him threescore and ten days.\n4. And when the days of his mourning were past, Joseph spake unto the house of Pharaoh, saying, If now I have found grace in your eyes, speak, I pray you, in the ears of Pharaoh, saying,\n5. My father made me swear, saying, Lo, I die: in mygravewhich I have digged for me in the land of Canaan, there shalt thou bury me. Now therefore let me go up, I pray thee, and bury my father, and I will come again.\n6. And Pharaoh said, Go up, and bury thy father, according as he made thee swear.\n7. And Joseph went up to bury his father: and with him went up all the servants of Pharaoh, the elders of his house, and all the elders of the land of Egypt,\n8. And all the house of Joseph, and his brethren, and his fathers house: only their little ones, and their flocks, and their herds, they left in the land ofGoshen.\n9. And there went up with him both chariots and horsemen: and it was very great company.\n10. And they came to the threshingfloor of Atad, whichisbeyond Jordan, and there theymournedwith great and very sore lamentation: and he made amourningfor his father seven days.\n11. And when the inhabitants of the land, the Canaanites, saw the mourning in the floor of Atad, they said, Thisisa grievous mourning to the Egyptians: wherefore the name of it was calledAbel-mizraim, whichisbeyond Jordan.\n12. And his sons did unto him according as he commanded them:\n13. For his sonscarriedhim into the land of Canaan, and buried him in the cave of the field of Machpelah, which Abraham bought with the field for possession of aburyingplaceofEphronthe Hittite, before Mamre.\n14. And Joseph returned into Egypt, he, and his brethren, and all that went up with him to bury his father, after he had buried his father.\n15. And when Josephs brethren saw that their father was dead, they said,Josephwill peradventure hate us, and will certainly requite us all the evil which we did unto him.\n16. And they sent messenger unto Joseph, saying, Thy father did command before he died, saying,\n17. So shall ye say unto Joseph,Forgive, I pray thee now, the trespass of thy brethren, and their sin; for they did unto thee evil: and now, we pray thee, forgive the trespass of the servants of the God of thy father. And Josephweptwhen they spake unto him.\n18. And his brethren also went and fell down before his face; and they said, Behold, webethyservants.\n19. And Joseph said unto them, Fear not: foramI in the place of God?\n20. But as for you, ye thoughtevilagainst me;butGodmeantit untogood, to bring to pass, asit isthis day, to save much people alive.\n21. Now therefore fear ye not: I willnourishyou, and your little ones. And he comforted them, and spake kindly unto them.\n22. AndJosephdwelt in Egypt, he, and his fathers house: and Joseph lived an hundred and ten years.\n23. And Joseph saw Ephraimschildrenof the thirdgeneration:the children also of Machir the son ofManassehwere brought up upon Josephs knees.\n24. AndJoseph said unto his brethren, I die: and God will surely visit you, andbringyou out of this land unto thelandwhich he sware toAbraham, to Isaac, and to Jacob.\n25. And Joseph took anoathof the children of Israel, saying, God will surely visit you, and ye shall carry up mybonesfrom hence.\n26. SoJosephdied,beingan hundred and ten years old: and theyembalmedhim, and he was put in coffin in Egypt.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Genesis": {
      "42": {
        "verses": {
          "1": {
            "text": "Now when Jacob saw that there wascornin Egypt, Jacob said unto his sons, Why do ye look one upon another?",
            "citation": "(Genesis 42:1)"
          },
          "2": {
            "text": "And he said, Behold, I have heard that there is corn in Egypt: get you down thither, and buy for us from thence; that we may live, and not die.",
            "citation": "(Genesis 42:2)"
          },
          "3": {
            "text": "And Josephs ten brethren went down to buycornin Egypt.",
            "citation": "(Genesis 42:3)"
          },
          "4": {
            "text": "ButBenjamin, Josephs brother, Jacob sent not with his brethren; for he said, Lest peradventure mischief befall him.",
            "citation": "(Genesis 42:4)"
          },
          "5": {
            "text": "And the sons of Israel came to buycornamong those that came: for the famine was in the land of Canaan.",
            "citation": "(Genesis 42:5)"
          },
          "6": {
            "text": "And Josephwasthegovernorover the land,andheit wasthat sold to all the people of the land: and Josephs brethren came, andboweddown themselves before himwiththeir faces to the earth.",
            "citation": "(Genesis 42:6)"
          },
          "7": {
            "text": "And Joseph saw his brethren, and he knew them, but made himself strange unto them, and spake roughly unto them; and he said unto them, Whence come ye? And they said, From the land of Canaan to buy food.",
            "citation": "(Genesis 42:7)"
          },
          "8": {
            "text": "And Joseph knew his brethren, but they knew not him.",
            "citation": "(Genesis 42:8)"
          },
          "9": {
            "text": "And Joseph remembered thedreamswhich he dreamed of them, and said unto them, Yearespies; to see the nakedness of the land ye are come.",
            "citation": "(Genesis 42:9)"
          },
          "10": {
            "text": "And they said unto him, Nay, my lord, but to buy food are thy servants come.",
            "citation": "(Genesis 42:10)"
          },
          "11": {
            "text": "Weareall onemanssons; wearetruemen,thy servants are no spies.",
            "citation": "(Genesis 42:11)"
          },
          "12": {
            "text": "And he said unto them, Nay, but to see the nakedness of the land ye are come.",
            "citation": "(Genesis 42:12)"
          },
          "13": {
            "text": "And they said, Thy servantsaretwelve brethren, the sons of one man in the land of Canaan; and, behold, the youngestisthis day with our father, and oneisnot.",
            "citation": "(Genesis 42:13)"
          },
          "14": {
            "text": "And Joseph said unto them, Thatis itthat I spake unto you, saying, Yearespies:",
            "citation": "(Genesis 42:14)"
          },
          "15": {
            "text": "Hereby ye shall be proved: By the life of Pharaoh ye shall not go forth hence, except your youngest brother come hither.",
            "citation": "(Genesis 42:15)"
          },
          "16": {
            "text": "Send one of you, and let him fetch your brother, and ye shall be kept in prison, that your words may be proved, whetherthere be anytruth in you: or else by the life of Pharaoh surely yearespies.",
            "citation": "(Genesis 42:16)"
          },
          "17": {
            "text": "And he put them all together into ward three days.",
            "citation": "(Genesis 42:17)"
          },
          "18": {
            "text": "And Joseph said unto them the third day, This do, and live;forIfearGod:",
            "citation": "(Genesis 42:18)"
          },
          "19": {
            "text": "If yebetruemen,let one of your brethren be bound in the house of your prison: go ye, carry corn for the famine of your houses:",
            "citation": "(Genesis 42:19)"
          },
          "20": {
            "text": "But bring your youngest brother unto me; so shall your words be verified, and ye shall not die. And they did so.",
            "citation": "(Genesis 42:20)"
          },
          "21": {
            "text": "And they said one to another, Weareverilyguiltyconcerning our brother, in that we saw the anguish of his soul, when he besought us, and we would not hear; therefore is this distress come upon us.",
            "citation": "(Genesis 42:21)"
          },
          "22": {
            "text": "AndReubenanswered them, saying, Spake I not unto you, saying, Do not sin against the child; and ye would not hear? therefore, behold, also hisbloodis required.",
            "citation": "(Genesis 42:22)"
          },
          "23": {
            "text": "And they knew not that Joseph understoodthem;for he spake unto them by an interpreter.",
            "citation": "(Genesis 42:23)"
          },
          "24": {
            "text": "And he turned himself about from them, andwept; and returned to them again, and communed with them, and took from them Simeon, and bound him before their eyes.",
            "citation": "(Genesis 42:24)"
          },
          "25": {
            "text": "Then Joseph commanded to fill their sacks with corn, and to restore every mansmoneyinto his sack, and to give them provision for the way: and thus did he unto them.",
            "citation": "(Genesis 42:25)"
          },
          "26": {
            "text": "And they laded their asses with the corn, and departed thence.",
            "citation": "(Genesis 42:26)"
          },
          "27": {
            "text": "And as one of them opened his sack to give his ass provender in the inn, he espied hismoney; for, behold, itwasin his sacks mouth.",
            "citation": "(Genesis 42:27)"
          },
          "28": {
            "text": "And he said unto his brethren, My money is restored; and, lo,it iseven in my sack: and their heart failedthem,and they were afraid, saying one to another, WhatisthisthatGod hath done unto us?",
            "citation": "(Genesis 42:28)"
          },
          "29": {
            "text": "And they came unto Jacob their father unto the land of Canaan, and told him all that befell unto them; saying,",
            "citation": "(Genesis 42:29)"
          },
          "30": {
            "text": "The man,who isthe lord of the land, spake roughly to us, and took us for spies of the country.",
            "citation": "(Genesis 42:30)"
          },
          "31": {
            "text": "And we said unto him, Wearetruemen;we are no spies:",
            "citation": "(Genesis 42:31)"
          },
          "32": {
            "text": "Webetwelve brethren, sons of our father; oneisnot, and the youngestisthis day with our father in the land of Canaan.",
            "citation": "(Genesis 42:32)"
          },
          "33": {
            "text": "And the man, the lord of the country, said unto us, Hereby shall I know that yearetruemen;leave one of your brethrenherewith me, and takefood forthe famine of your households, and be gone:",
            "citation": "(Genesis 42:33)"
          },
          "34": {
            "text": "And bring your youngest brother unto me: then shall I know that yeareno spies, butthatyearetruemen: sowill I deliver you your brother, and ye shall traffick in the land.",
            "citation": "(Genesis 42:34)"
          },
          "35": {
            "text": "And it came to pass as they emptied their sacks, that, behold, every mans bundle of moneywasin his sack: and whenboththey and their father saw the bundles of money, they were afraid.",
            "citation": "(Genesis 42:35)"
          },
          "36": {
            "text": "And Jacob their father said unto them, Me have ye bereavedof my children:Josephisnot, and Simeonisnot, and ye will takeBenjaminaway:all these things are against me.",
            "citation": "(Genesis 42:36)"
          },
          "37": {
            "text": "AndReubenspake unto his father, saying, Slay my two sons, if I bring him not to thee: deliver him into my hand, and I will bring him to thee again.",
            "citation": "(Genesis 42:37)"
          },
          "38": {
            "text": "And he said, My son shall not go down with you; for his brother is dead, and he is left alone: if mischief befall him by the way in the which ye go, then shall ye bring down my gray hairs withsorrowto the grave.",
            "citation": "(Genesis 42:38)"
          }
        }
      },
      "43": {
        "verses": {
          "1": {
            "text": "And the faminewassore in the land.",
            "citation": "(Genesis 43:1)"
          },
          "2": {
            "text": "And it came to pass, when they had eaten up the corn which they had brought out of Egypt, their father said unto them, Go again, buy us little food.",
            "citation": "(Genesis 43:2)"
          },
          "3": {
            "text": "And Judah spake unto him, saying, The man did solemnly protest unto us, saying, Ye shall not see my face, except yourbrotherbewith you.",
            "citation": "(Genesis 43:3)"
          },
          "4": {
            "text": "If thou wilt send our brother with us, we will go down and buy thee food:",
            "citation": "(Genesis 43:4)"
          },
          "5": {
            "text": "But if thou wilt not sendhim,we will not go down: for the man said unto us, Ye shall not see my face, except yourbrotherbewith you.",
            "citation": "(Genesis 43:5)"
          },
          "6": {
            "text": "And Israel said, Wherefore dealt yesoill with me,asto tell the man whether ye had yet brother?",
            "citation": "(Genesis 43:6)"
          },
          "7": {
            "text": "And they said, The man asked us straitly of our state, and of our kindred, saying,Isyour father yet alive? have yeanotherbrother? and we told him according to the tenor of these words: could we certainly know that he would say, Bring your brother down?",
            "citation": "(Genesis 43:7)"
          },
          "8": {
            "text": "And Judah said unto Israel his father, Send the lad with me, and we will arise and go; that we may live, and not die, both we, and thou,andalso our little ones.",
            "citation": "(Genesis 43:8)"
          },
          "9": {
            "text": "I will be surety for him; of my hand shalt thou require him: if I bring him not unto thee, and set him before thee, then let me bear theblamefor ever:",
            "citation": "(Genesis 43:9)"
          },
          "10": {
            "text": "For except we had lingered, surely now we had returned this second time.",
            "citation": "(Genesis 43:10)"
          },
          "11": {
            "text": "And their father Israel said unto them, Ifit must beso now, do this; take of the best fruits in the land in your vessels, and carry down the man present, little balm, and little honey, spices, and myrrh, nuts, and almonds:",
            "citation": "(Genesis 43:11)"
          },
          "12": {
            "text": "And take double money in your hand; and themoneythat was brought again in the mouth of your sacks, carryitagain in your hand; peradventure itwasan oversight:",
            "citation": "(Genesis 43:12)"
          },
          "13": {
            "text": "Take also your brother, and arise, go again unto the man:",
            "citation": "(Genesis 43:13)"
          },
          "14": {
            "text": "And God Almighty give you mercy before the man, that he may send away your other brother, and Benjamin. If I be bereavedof my children,I am bereaved.",
            "citation": "(Genesis 43:14)"
          },
          "15": {
            "text": "And the men took that present, and they took double money in their hand, and Benjamin; and rose up, and went down to Egypt, and stood before Joseph.",
            "citation": "(Genesis 43:15)"
          },
          "16": {
            "text": "And when Joseph saw Benjamin with them, he said to the ruler of his house, Bringthesemen home, and slay, and make ready; forthesemen shall dine with me at noon.",
            "citation": "(Genesis 43:16)"
          },
          "17": {
            "text": "And the man did as Joseph bade; and the man brought the men into Josephs house.",
            "citation": "(Genesis 43:17)"
          },
          "18": {
            "text": "And the men were afraid, because they were brought into Josephs house; and they said, Because of the money that was returned in our sacks at the first time are we brought in; that he may seek occasion against us, and fall upon us, and take us for bondmen, and our asses.",
            "citation": "(Genesis 43:18)"
          },
          "19": {
            "text": "And they came near to the steward of Josephs house, and they communed with him at the door of the house,",
            "citation": "(Genesis 43:19)"
          },
          "20": {
            "text": "And said, Osir, we came indeed down at the first time to buyfood:",
            "citation": "(Genesis 43:20)"
          },
          "21": {
            "text": "And it came to pass, when we came to the inn, that we opened our sacks, and, behold,everymansmoneywasin the mouth of his sack, our money in full weight: and we have brought it again in our hand.",
            "citation": "(Genesis 43:21)"
          },
          "22": {
            "text": "And other money have we brought down in our hands to buy food: we cannot tell who put our money in our sacks.",
            "citation": "(Genesis 43:22)"
          },
          "23": {
            "text": "And he said, Peacebeto you, fear not: your God, and the God of your father, hath given you treasure in your sacks: I had your money. And he brought Simeon out unto them.",
            "citation": "(Genesis 43:23)"
          },
          "24": {
            "text": "And the man brought the men into Josephs house, and gavethemwater, and theywashedtheir feet; and he gave their asses provender.",
            "citation": "(Genesis 43:24)"
          },
          "25": {
            "text": "And they made ready the present against Joseph came at noon: for they heard that they should eat bread there.",
            "citation": "(Genesis 43:25)"
          },
          "26": {
            "text": "And when Joseph came home, they brought him the present whichwasin their hand into the house, andbowedthemselves to him to the earth.",
            "citation": "(Genesis 43:26)"
          },
          "27": {
            "text": "And he asked them oftheirwelfare, and said,Isyour father well, the oldmanof whom ye spake?Ishe yet alive?",
            "citation": "(Genesis 43:27)"
          },
          "28": {
            "text": "And they answered, Thy servant our fatherisin good health, heisyet alive. And they bowed down their heads, and made obeisance.",
            "citation": "(Genesis 43:28)"
          },
          "29": {
            "text": "And he lifted up his eyes, and saw his brotherBenjamin, his mothers son, and said,Isthis your younger brother, of whom ye spake unto me? And he said, God be gracious unto thee, my son.",
            "citation": "(Genesis 43:29)"
          },
          "30": {
            "text": "And Joseph made haste; for his bowels did yearn upon his brother: and he soughtwhereto weep; and he entered intohischamber, andweptthere.",
            "citation": "(Genesis 43:30)"
          },
          "31": {
            "text": "And he washed his face, and went out, and refrained himself, and said, Set on bread.",
            "citation": "(Genesis 43:31)"
          },
          "32": {
            "text": "And they set on for him by himself, and for them by themselves, and for the Egyptians, which did eat with him, by themselves: because the Egyptians might not eat bread with the Hebrews; for thatisanabominationunto the Egyptians.",
            "citation": "(Genesis 43:32)"
          },
          "33": {
            "text": "And they sat before him, the firstborn according to hisbirthright, and the youngest according to his youth: and the men marvelled one at another.",
            "citation": "(Genesis 43:33)"
          },
          "34": {
            "text": "And he tookand sentmessesunto them from before him: butBenjaminsmess was five times so much as any of theirs. And they drank, and were merry with him.",
            "citation": "(Genesis 43:34)"
          }
        }
      },
      "44": {
        "verses": {
          "1": {
            "text": "And he commanded the steward of his house, saying, Fill the mens sackswithfood, as much as they can carry, and put every mans money in his sacks mouth.",
            "citation": "(Genesis 44:1)"
          },
          "2": {
            "text": "And put my cup, the silver cup, in the sacks mouth of the youngest, and his corn money. And he did according to the word that Joseph had spoken.",
            "citation": "(Genesis 44:2)"
          },
          "3": {
            "text": "As soon as the morning was light, the men were sent away, they and their asses.",
            "citation": "(Genesis 44:3)"
          },
          "4": {
            "text": "Andwhen they were gone out of the city,andnotyetfar off, Joseph said unto his steward, Up, follow after the men; and when thou dost overtake them, say unto them, Wherefore have ye rewarded evil for good?",
            "citation": "(Genesis 44:4)"
          },
          "5": {
            "text": "Isnot thisitin which my lord drinketh, and whereby indeed he divineth? ye have done evil in so doing.",
            "citation": "(Genesis 44:5)"
          },
          "6": {
            "text": "And he overtook them, and he spake unto them these same words.",
            "citation": "(Genesis 44:6)"
          },
          "7": {
            "text": "And they said unto him, Wherefore saith my lord these words? God forbid that thy servants should do according to this thing:",
            "citation": "(Genesis 44:7)"
          },
          "8": {
            "text": "Behold, the money, which we found in our sacks mouths, we brought again unto thee out of the land of Canaan: how then should we steal out of thy lords house silver or gold?",
            "citation": "(Genesis 44:8)"
          },
          "9": {
            "text": "With whomsoever of thy servants it be found, both let him die, and we also will be my lords bondmen.",
            "citation": "(Genesis 44:9)"
          },
          "10": {
            "text": "And he said, Now alsoletitbeaccording unto your words: he with whom it is found shall be my servant; and ye shall be blameless.",
            "citation": "(Genesis 44:10)"
          },
          "11": {
            "text": "Then they speedily took down every man his sack to the ground, and opened every man his sack.",
            "citation": "(Genesis 44:11)"
          },
          "12": {
            "text": "And he searched,andbegan at the eldest, and left at the youngest: and the cup was found in Benjamins sack.",
            "citation": "(Genesis 44:12)"
          },
          "13": {
            "text": "Then theyrenttheir clothes, and laded every man his ass, and returned to the city.",
            "citation": "(Genesis 44:13)"
          },
          "14": {
            "text": "And Judah and his brethren came to Josephs house; for hewasyet there: and theyfellbefore him on the ground.",
            "citation": "(Genesis 44:14)"
          },
          "15": {
            "text": "And Joseph said unto them, What deedisthis that ye have done? wot ye not that such man as I can certainly divine?",
            "citation": "(Genesis 44:15)"
          },
          "16": {
            "text": "And Judah said, What shall we say unto my lord? what shall we speak? or how shall we clear ourselves? God hath found out the iniquity of thy servants: behold, wearemy lords servants, both we, andhealso with whom the cup is found.",
            "citation": "(Genesis 44:16)"
          },
          "17": {
            "text": "And he said, God forbid that I should do so:butthe man in whose hand the cup is found, he shall be my servant; and as for you, get you up in peace unto your father.",
            "citation": "(Genesis 44:17)"
          },
          "18": {
            "text": "Then Judah came near unto him, and said, Oh mylord, let thy servant, I pray thee, speak word in my lords ears, and let not thineangerburn against thy servant: for thouarteven as Pharaoh.",
            "citation": "(Genesis 44:18)"
          },
          "19": {
            "text": "My lord asked his servants, saying, Have ye father, or brother?",
            "citation": "(Genesis 44:19)"
          },
          "20": {
            "text": "And we said unto my lord, We have father, an oldman, and child of his old age, little one; and his brother is dead, and he alone is left of his mother, and his father loveth him.",
            "citation": "(Genesis 44:20)"
          },
          "21": {
            "text": "And thou saidst unto thy servants, Bring him down unto me, that I may set mine eyes upon him.",
            "citation": "(Genesis 44:21)"
          },
          "22": {
            "text": "And we said unto my lord, The lad cannot leave his father: forifheshould leave his father,his fatherwould die.",
            "citation": "(Genesis 44:22)"
          },
          "23": {
            "text": "And thou saidst unto thy servants, Except your youngestbrothercome down with you, ye shall see my face no more.",
            "citation": "(Genesis 44:23)"
          },
          "24": {
            "text": "And it came to pass when we came up unto thy servant my father, we told him the words of my lord.",
            "citation": "(Genesis 44:24)"
          },
          "25": {
            "text": "And our father said, Go again,andbuy us little food.",
            "citation": "(Genesis 44:25)"
          },
          "26": {
            "text": "And we said, We cannot go down: if our youngest brother be with us, then will we go down: for we may not see the mans face, except ouryoungestbrotherbewith us.",
            "citation": "(Genesis 44:26)"
          },
          "27": {
            "text": "And thy servant my father said unto us, Ye know that my wife bare me twosons:",
            "citation": "(Genesis 44:27)"
          },
          "28": {
            "text": "And the one went out from me, and I said, Surely he istorninpieces; and I saw him not since:",
            "citation": "(Genesis 44:28)"
          },
          "29": {
            "text": "And if yetakethis also from me, and mischief befallhim, ye shall bring down my gray hairs with sorrow to the grave.",
            "citation": "(Genesis 44:29)"
          },
          "30": {
            "text": "Now therefore when I come to thy servant my father, and the ladbenot with us; seeing that his life isboundup in the lads life;",
            "citation": "(Genesis 44:30)"
          },
          "31": {
            "text": "It shall come to pass, when he seeth that the ladisnotwith us,that he will die: and thy servants shall bring down the gray hairs of thy servant our father withsorrowto the grave.",
            "citation": "(Genesis 44:31)"
          },
          "32": {
            "text": "For thy servant became surety for the lad unto my father, saying, If I bring him not unto thee, then I shall bear theblameto my father for ever.",
            "citation": "(Genesis 44:32)"
          },
          "33": {
            "text": "Now therefore, I pray thee, let thy servant abide instead of the lad bondman to my lord; and let the lad go up with his brethren.",
            "citation": "(Genesis 44:33)"
          },
          "34": {
            "text": "For how shall I go up to my father, and the ladbenot with me? lest peradventure I see the evil that shall come on my father.",
            "citation": "(Genesis 44:34)"
          }
        }
      },
      "45": {
        "verses": {
          "1": {
            "text": "Then Joseph could notrefrainhimself before all them that stood by him; and hecried, Cause every man to go out from me. And there stood no man with him, while Joseph made himself known unto his brethren.",
            "citation": "(Genesis 45:1)"
          },
          "2": {
            "text": "And he wept aloud: and the Egyptians and the house of Pharaoh heard.",
            "citation": "(Genesis 45:2)"
          },
          "3": {
            "text": "And Joseph said unto his brethren, IamJoseph; doth my father yet live? And his brethren could not answer him; for they weretroubledat his presence.",
            "citation": "(Genesis 45:3)"
          },
          "4": {
            "text": "And Joseph said unto his brethren, Come near to me, I pray you. And they came near. And he said, IamJosephyour brother, whom ye sold into Egypt.",
            "citation": "(Genesis 45:4)"
          },
          "5": {
            "text": "Now therefore be notgrieved, nor angry with yourselves, that ye sold me hither: for God didsendme before you to preserve life.",
            "citation": "(Genesis 45:5)"
          },
          "6": {
            "text": "For these two yearshaththe faminebeenin the land: and yetthere arefive years, in the whichthere shallneitherbeearing nor harvest.",
            "citation": "(Genesis 45:6)"
          },
          "7": {
            "text": "And God sent me before you topreserveyou aposterityin the earth, and to save your lives by great deliverance.",
            "citation": "(Genesis 45:7)"
          },
          "8": {
            "text": "So nowit wasnot youthatsent me hither, but God: and he hath made me father to Pharaoh, and lord of all his house, and arulerthroughout all the land of Egypt.",
            "citation": "(Genesis 45:8)"
          },
          "9": {
            "text": "Haste ye, and go up to my father, and say unto him, Thus saith thy son Joseph, God hath made me lord of all Egypt: come down unto me, tarry not:",
            "citation": "(Genesis 45:9)"
          },
          "10": {
            "text": "And thou shalt dwell in the land ofGoshen, and thou shalt be near unto me, thou, and thy children, and thy childrens children, and thy flocks, and thy herds, and all that thou hast:",
            "citation": "(Genesis 45:10)"
          },
          "11": {
            "text": "And there will Inourishthee; for yetthere arefive years of famine; lest thou, and thy household, and all that thou hast, come to poverty.",
            "citation": "(Genesis 45:11)"
          },
          "12": {
            "text": "And, behold, your eyes see, and the eyes of my brother Benjamin, thatit ismy mouth that speaketh unto you.",
            "citation": "(Genesis 45:12)"
          },
          "13": {
            "text": "And ye shall tell my father of all my glory in Egypt, and of all that ye have seen; and ye shall haste and bring down myfatherhither.",
            "citation": "(Genesis 45:13)"
          },
          "14": {
            "text": "And he fell upon his brother Benjamins neck, and wept; and Benjamin wept upon his neck.",
            "citation": "(Genesis 45:14)"
          },
          "15": {
            "text": "Moreover he kissed all his brethren, and wept upon them: and after that his brethren talked with him.",
            "citation": "(Genesis 45:15)"
          },
          "16": {
            "text": "And the fame thereof was heard in Pharaohs house, saying, Josephs brethren are come: and itpleasedPharaoh well, and his servants.",
            "citation": "(Genesis 45:16)"
          },
          "17": {
            "text": "And Pharaoh said unto Joseph, Say unto thy brethren, This do ye; lade your beasts, and go, get you unto the land of Canaan;",
            "citation": "(Genesis 45:17)"
          },
          "18": {
            "text": "And take your father and your households, and come unto me: and I will give you the good of the land of Egypt, and ye shall eat the fat of the land.",
            "citation": "(Genesis 45:18)"
          },
          "19": {
            "text": "Now thou art commanded, this do ye; take youwagonsout of the land of Egypt for your little ones, and for your wives, and bring your father, and come.",
            "citation": "(Genesis 45:19)"
          },
          "20": {
            "text": "Also regard not your stuff; for the good of all the land of Egyptisyours.",
            "citation": "(Genesis 45:20)"
          },
          "21": {
            "text": "And the children of Israel did so: and Joseph gave them wagons, according to the commandment of Pharaoh, and gave them provision for the way.",
            "citation": "(Genesis 45:21)"
          },
          "22": {
            "text": "To all of them he gave each man changes of raiment; but toBenjaminhe gave three hundredpiecesof silver, and five changes of raiment.",
            "citation": "(Genesis 45:22)"
          },
          "23": {
            "text": "And to his father he sent after thismanner;ten asses laden with the good things of Egypt, and ten she asses laden with corn and bread and meat for his father by the way.",
            "citation": "(Genesis 45:23)"
          },
          "24": {
            "text": "So he sent his brethren away, and they departed: and he said unto them, See that ye fall not out by the way.",
            "citation": "(Genesis 45:24)"
          },
          "25": {
            "text": "And they went up out of Egypt, and came into the land of Canaan unto Jacob their father,",
            "citation": "(Genesis 45:25)"
          },
          "26": {
            "text": "And told him, saying, Josephisyet alive, and heisgovernorover all the land of Egypt. And Jacobs heart fainted, for he believed them not.",
            "citation": "(Genesis 45:26)"
          },
          "27": {
            "text": "And they told him all the words of Joseph, which he had said unto them: and when he saw thewagonswhich Joseph had sent to carry him, the spirit of Jacob their fatherrevived:",
            "citation": "(Genesis 45:27)"
          },
          "28": {
            "text": "And Israel said,It isenough; Joseph my sonisyet alive: I will go and see him before I die.",
            "citation": "(Genesis 45:28)"
          }
        }
      },
      "46": {
        "verses": {
          "1": {
            "text": "And Israel took his journey with all that he had, and came toBeer-sheba, and offered sacrifices unto the God of his father Isaac.",
            "citation": "(Genesis 46:1)"
          },
          "2": {
            "text": "And God spake unto Israel in thevisionsof the night, and said, Jacob, Jacob. And he said, HereamI.",
            "citation": "(Genesis 46:2)"
          },
          "3": {
            "text": "And he said, IamGod, the God of thyfather: fear not to go down intoEgypt; for I will there make of thee greatnation:",
            "citation": "(Genesis 46:3)"
          },
          "4": {
            "text": "Iwill go down with thee into Egypt; and I will also surelybringthee upagain:andJosephshall put his hand upon thine eyes.",
            "citation": "(Genesis 46:4)"
          },
          "5": {
            "text": "And Jacobrose upfrom Beer-sheba: and the sons of Israel carried Jacob their father, and their little ones, and their wives, in thewagonswhich Pharaoh had sent to carry him.",
            "citation": "(Genesis 46:5)"
          },
          "6": {
            "text": "And they took their cattle, and their goods, which they had gotten in the land of Canaan, and came intoEgypt, Jacob, and all his seed with him:",
            "citation": "(Genesis 46:6)"
          },
          "7": {
            "text": "His sons, and his sons sons with him, his daughters, and his sons daughters, and all hisseedbrought he with him into Egypt.",
            "citation": "(Genesis 46:7)"
          },
          "8": {
            "text": "And thesearethenamesof thechildren of Israel, which came into Egypt, Jacob and his sons: Reuben, Jacobs firstborn.",
            "citation": "(Genesis 46:8)"
          },
          "9": {
            "text": "And the sons ofReuben; Hanoch, and Phallu, and Hezron, and Carmi.",
            "citation": "(Genesis 46:9)"
          },
          "10": {
            "text": "And the sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Shaul the son of Canaanitish woman.",
            "citation": "(Genesis 46:10)"
          },
          "11": {
            "text": "And the sons ofLevi; Gershon, Kohath, and Merari.",
            "citation": "(Genesis 46:11)"
          },
          "12": {
            "text": "And the sons of Judah;Er, andOnan, and Shelah, and Pharez, andZerah: but Er and Onan died in the land of Canaan. And the sons of Pharez were Hezron and Hamul.",
            "citation": "(Genesis 46:12)"
          },
          "13": {
            "text": "And the sons ofIssachar; Tola, and Phuvah, and Job, and Shimron.",
            "citation": "(Genesis 46:13)"
          },
          "14": {
            "text": "And the sons of Zebulun; Sered, and Elon, and Jahleel.",
            "citation": "(Genesis 46:14)"
          },
          "15": {
            "text": "Thesebethe sons ofLeah, which she bare unto Jacob in Padan-aram, with his daughter Dinah: all the souls of his sons and his daughterswerethirty and three.",
            "citation": "(Genesis 46:15)"
          },
          "16": {
            "text": "And the sons ofGad; Ziphion, and Haggi, Shuni, and Ezbon, Eri, and Arodi, and Areli.",
            "citation": "(Genesis 46:16)"
          },
          "17": {
            "text": "And the sons of Asher; Jimnah, and Ishuah, and Isui, and Beriah, and Serah their sister: and the sons of Beriah; Heber, and Malchiel.",
            "citation": "(Genesis 46:17)"
          },
          "18": {
            "text": "Thesearethe sons ofZilpah, whom Laban gave to Leah his daughter, and these she bare unto Jacob,evensixteen souls.",
            "citation": "(Genesis 46:18)"
          },
          "19": {
            "text": "The sons of Rachel Jacobs wife; Joseph, andBenjamin.",
            "citation": "(Genesis 46:19)"
          },
          "20": {
            "text": "And unto Joseph in the land of Egypt were bornManassehand Ephraim, whichAsenaththe daughter of Poti-pherah priest of On bare unto him.",
            "citation": "(Genesis 46:20)"
          },
          "21": {
            "text": "And the sons ofBenjaminwereBelah, and Becher, and Ashbel, Gera, and Naaman, Ehi, and Rosh, Muppim, and Huppim, and Ard.",
            "citation": "(Genesis 46:21)"
          },
          "22": {
            "text": "Thesearethe sons of Rachel, which were born to Jacob: all the soulswerefourteen.",
            "citation": "(Genesis 46:22)"
          },
          "23": {
            "text": "And the sons ofDan; Hushim.",
            "citation": "(Genesis 46:23)"
          },
          "24": {
            "text": "And the sons of Naphtali; Jahzeel, and Guni, and Jezer, and Shillem.",
            "citation": "(Genesis 46:24)"
          },
          "25": {
            "text": "Thesearethe sons ofBilhah, which Laban gave unto Rachel his daughter, and she bare these unto Jacob: all the soulswereseven.",
            "citation": "(Genesis 46:25)"
          },
          "26": {
            "text": "All the souls that came with Jacob into Egypt, which came outof his loins, besides Jacobs sons wives, all the soulswerethreescore and six;",
            "citation": "(Genesis 46:26)"
          },
          "27": {
            "text": "And the sons of Joseph, which were born him in Egypt,weretwo souls: all the souls of the house ofJacob, which came into Egypt,werethreescoreand ten.",
            "citation": "(Genesis 46:27)"
          },
          "28": {
            "text": "And he sent Judah before him unto Joseph, to direct his face unto Goshen; and they came into the land ofGoshen.",
            "citation": "(Genesis 46:28)"
          },
          "29": {
            "text": "And Joseph made ready his chariot, and went up to meet Israel his father, to Goshen, and presented himself unto him; and he fell on his neck, andwepton his neck good while.",
            "citation": "(Genesis 46:29)"
          },
          "30": {
            "text": "And Israel said unto Joseph, Now let me die, since I have seen thy face, because thouartyet alive.",
            "citation": "(Genesis 46:30)"
          },
          "31": {
            "text": "And Joseph said unto his brethren, and unto his fathers house, I will go up, and shewPharaoh, and say unto him, My brethren, and my fathers house, whichwerein the land of Canaan, are come unto me;",
            "citation": "(Genesis 46:31)"
          },
          "32": {
            "text": "And the menareshepherds, for their trade hath been to feed cattle; and they have brought their flocks, and their herds, and all that they have.",
            "citation": "(Genesis 46:32)"
          },
          "33": {
            "text": "And it shall come to pass, when Pharaoh shall call you, and shall say, Whatisyouroccupation?",
            "citation": "(Genesis 46:33)"
          },
          "34": {
            "text": "That ye shall say, Thy servants trade hath been aboutcattlefrom our youth even until now, both we,andalso our fathers: that ye may dwell in the land of Goshen; for every shepherdisanabominationunto the Egyptians.",
            "citation": "(Genesis 46:34)"
          }
        }
      },
      "47": {
        "verses": {
          "1": {
            "text": "Then Joseph came and toldPharaoh, and said, My father and my brethren, and their flocks, and their herds, and all that they have, are come out of the land of Canaan; and, behold, theyarein the land ofGoshen.",
            "citation": "(Genesis 47:1)"
          },
          "2": {
            "text": "And he took some of his brethren,evenfive men, and presented them untoPharaoh.",
            "citation": "(Genesis 47:2)"
          },
          "3": {
            "text": "And Pharaoh said unto his brethren, Whatisyouroccupation? And they said unto Pharaoh, Thy servantsareshepherds, both we,andalso our fathers.",
            "citation": "(Genesis 47:3)"
          },
          "4": {
            "text": "They said moreover unto Pharaoh, For tosojournin the land are we come; for thy servants have no pasture for their flocks; for the famineissore in the land of Canaan: now therefore, we pray thee, let thy servants dwell in the land of Goshen.",
            "citation": "(Genesis 47:4)"
          },
          "5": {
            "text": "And Pharaoh spake unto Joseph, saying, Thy father and thy brethren are come unto thee:",
            "citation": "(Genesis 47:5)"
          },
          "6": {
            "text": "The land ofEgyptisbefore thee; in the best of the land make thy father and brethren to dwell; in the land of Goshen let them dwell: and if thou knowestanymen of activity among them, then make them rulers over my cattle.",
            "citation": "(Genesis 47:6)"
          },
          "7": {
            "text": "And Joseph brought in Jacob his father, and set him before Pharaoh: and Jacob blessed Pharaoh.",
            "citation": "(Genesis 47:7)"
          },
          "8": {
            "text": "And Pharaoh said unto Jacob, How oldartthou?",
            "citation": "(Genesis 47:8)"
          },
          "9": {
            "text": "And Jacob said unto Pharaoh, The days of the years of mypilgrimagearean hundred and thirty years: few andevilhave the days of the years of my life been, and have not attained unto thedaysof the years of the life of my fathers in the days of their pilgrimage.",
            "citation": "(Genesis 47:9)"
          },
          "10": {
            "text": "And Jacob blessed Pharaoh, and went out from before Pharaoh.",
            "citation": "(Genesis 47:10)"
          },
          "11": {
            "text": "And Joseph placed his father and his brethren, and gave them possession in the land of Egypt, in the best of the land, in the land ofRameses, as Pharaoh had commanded.",
            "citation": "(Genesis 47:11)"
          },
          "12": {
            "text": "And Josephnourishedhis father, and his brethren, and all his fathers household, with bread, according totheirfamilies.",
            "citation": "(Genesis 47:12)"
          },
          "13": {
            "text": "Andthere wasno bread in all the land; for thefaminewasvery sore, so that the land of Egypt andallthe land of Canaan fainted by reason of the famine.",
            "citation": "(Genesis 47:13)"
          },
          "14": {
            "text": "And Joseph gathered up all themoneythat was found in the land of Egypt, and in the land of Canaan, for the corn which they bought: and Joseph brought the money into Pharaohs house.",
            "citation": "(Genesis 47:14)"
          },
          "15": {
            "text": "And when money failed in the land of Egypt, and in the land of Canaan, all the Egyptians came unto Joseph, and said, Give usbread: for why should we die in thy presence? for the money faileth.",
            "citation": "(Genesis 47:15)"
          },
          "16": {
            "text": "And Joseph said, Give your cattle; and I will give you for your cattle, if money fail.",
            "citation": "(Genesis 47:16)"
          },
          "17": {
            "text": "And they brought their cattle unto Joseph: and Joseph gave them breadin exchangefor horses, and for the flocks, and for the cattle of the herds, and for the asses: and he fed them with bread for all their cattle for that year.",
            "citation": "(Genesis 47:17)"
          },
          "18": {
            "text": "When that year was ended, they came unto him the second year, and said unto him, We will not hideitfrom my lord, how that our money is spent; my lord also hath our herds of cattle; there is not ought left in the sight of my lord, but our bodies, and our lands:",
            "citation": "(Genesis 47:18)"
          },
          "19": {
            "text": "Wherefore shall we die before thine eyes, both we and our land? buy us and our land for bread, and we and our land will be servants unto Pharaoh: and giveusseed, that we may live, and not die, that the land be not desolate.",
            "citation": "(Genesis 47:19)"
          },
          "20": {
            "text": "And Joseph bought all the land of Egypt for Pharaoh; for the Egyptians sold every man his field, because the famine prevailed over them: so the land became Pharaohs.",
            "citation": "(Genesis 47:20)"
          },
          "21": {
            "text": "And as for the people,heremoved them to cities fromoneend of the borders of Egypt even to theotherend thereof.",
            "citation": "(Genesis 47:21)"
          },
          "22": {
            "text": "Only the land of thepriestsbought he not; for the priests had portionassigned themof Pharaoh, and did eat their portion which Pharaoh gave them: wherefore they sold not their lands.",
            "citation": "(Genesis 47:22)"
          },
          "23": {
            "text": "Then Joseph said unto the people, Behold, I have bought you this day and your land for Pharaoh: lo,here isseed for you, and ye shall sow the land.",
            "citation": "(Genesis 47:23)"
          },
          "24": {
            "text": "And it shall come to passin the increase, that ye shall give thefifthpartunto Pharaoh, and four parts shall be your own, for seed of the field, and for your food, and for them of your households, and for food for your little ones.",
            "citation": "(Genesis 47:24)"
          },
          "25": {
            "text": "And they said, Thou hast saved our lives: let us find grace in the sight of my lord, and we will be Pharaohs servants.",
            "citation": "(Genesis 47:25)"
          },
          "26": {
            "text": "And Joseph made it law over the land of Egypt unto this day,thatPharaoh should have the fifthpart;except the land of thepriestsonly,whichbecame not Pharaohs.",
            "citation": "(Genesis 47:26)"
          },
          "27": {
            "text": "And Israel dwelt in the land of Egypt, in the country of Goshen; and they had possessions therein, and grew, and multiplied exceedingly.",
            "citation": "(Genesis 47:27)"
          },
          "28": {
            "text": "And Jacob lived in the land of Egypt seventeen years: so the whole age ofJacobwas an hundred forty and seven years.",
            "citation": "(Genesis 47:28)"
          },
          "29": {
            "text": "And thetimedrew nigh that Israel must die: and he called his son Joseph, and said unto him, If now I have found grace in thy sight, put, I pray thee, thy hand under mythigh, and deal kindly and truly with me;buryme not, I pray thee, in Egypt:",
            "citation": "(Genesis 47:29)"
          },
          "30": {
            "text": "But I will lie with my fathers, and thou shalt carry me out of Egypt, andburyme in their buryingplace. And he said, I will do as thou hast said.",
            "citation": "(Genesis 47:30)"
          },
          "31": {
            "text": "And he said, Swear unto me. And he sware unto him. And Israelbowedhimselfuponthebedshead.",
            "citation": "(Genesis 47:31)"
          }
        }
      },
      "48": {
        "verses": {
          "1": {
            "text": "And it came to pass after these things, thatonetold Joseph, Behold, thy fatherissick: and he took with him his two sons, Manasseh and Ephraim.",
            "citation": "(Genesis 48:1)"
          },
          "2": {
            "text": "AndonetoldJacob, and said, Behold, thy son Joseph cometh unto thee: and Israelstrengthenedhimself, and sat upon the bed.",
            "citation": "(Genesis 48:2)"
          },
          "3": {
            "text": "And Jacob said unto Joseph, GodAlmightyappearedunto me atLuzin the land of Canaan, and blessed me,",
            "citation": "(Genesis 48:3)"
          },
          "4": {
            "text": "And said unto me, Behold, I will make theefruitful, and multiply thee, and I will make of thee multitude of people; and will give thislandto thy seed after theeforan everlastingpossession.",
            "citation": "(Genesis 48:4)"
          },
          "5": {
            "text": "Andnow thy two sons,EphraimandManasseh, which were born unto thee in the land of Egypt before I came unto thee into Egypt,aremine; as Reuben and Simeon, they shall be mine.",
            "citation": "(Genesis 48:5)"
          },
          "6": {
            "text": "And thy issue, which thou begettest after them, shall be thine,andshall be called after the name of their brethren in their inheritance.",
            "citation": "(Genesis 48:6)"
          },
          "7": {
            "text": "And as for me, when I came from Padan,Racheldied by me in the land of Canaan in the way, when yetthere wasbut little way to come unto Ephrath: and I buried her there in the way of Ephrath; the sameisBeth-lehem.",
            "citation": "(Genesis 48:7)"
          },
          "8": {
            "text": "And Israel beheld Josephs sons, and said, Whoarethese?",
            "citation": "(Genesis 48:8)"
          },
          "9": {
            "text": "And Joseph said unto his father, Theyaremy sons, whom God hath given me in thisplace.And he said, Bring them, I pray thee, unto me, and I willblessthem.",
            "citation": "(Genesis 48:9)"
          },
          "10": {
            "text": "Now the eyes of Israel weredimfor age,so thathe could not see. And he brought themnearunto him; and he kissed them, and embraced them.",
            "citation": "(Genesis 48:10)"
          },
          "11": {
            "text": "And Israel said unto Joseph, I had not thought to see thy face: and, lo, God hath shewed me also thy seed.",
            "citation": "(Genesis 48:11)"
          },
          "12": {
            "text": "And Joseph brought them out from between his knees, and he bowed himself with his face to the earth.",
            "citation": "(Genesis 48:12)"
          },
          "13": {
            "text": "And Joseph took them both, Ephraim in his right hand toward Israels left hand, and Manasseh in his left hand toward Israels right hand, and broughtthemnear unto him.",
            "citation": "(Genesis 48:13)"
          },
          "14": {
            "text": "And Israel stretched out his right hand, and laidituponEphraimshead, whowasthe younger, and his left hand upon Manassehs head,guiding his handswittingly; for Manassehwasthe firstborn.",
            "citation": "(Genesis 48:14)"
          },
          "15": {
            "text": "And he blessedJoseph, and said, God, before whom my fathers Abraham and Isaac didwalk, the God whichfedme all my life long unto this day,",
            "citation": "(Genesis 48:15)"
          },
          "16": {
            "text": "TheAngelwhich redeemed me from all evil, bless the lads; and let mynamebe named on them, and the name of my fathers Abraham and Isaac; and let them grow into multitude in the midst of the earth.",
            "citation": "(Genesis 48:16)"
          },
          "17": {
            "text": "And when Joseph saw that his father laid his righthandupon the head ofEphraim,it displeased him: and he held up his fathers hand, to remove it from Ephraims head unto Manassehs head.",
            "citation": "(Genesis 48:17)"
          },
          "18": {
            "text": "And Joseph said unto his father, Not so, my father: for thisisthe firstborn; put thy right hand upon his head.",
            "citation": "(Genesis 48:18)"
          },
          "19": {
            "text": "And his father refused, and said, I knowit,my son, I knowit:he also shall become people, and he also shall begreat: but truly his younger brother shall be greater than he, and hisseedshall become amultitudeofnations.",
            "citation": "(Genesis 48:19)"
          },
          "20": {
            "text": "And he blessed them that day, saying,In theeshall Israelbless, saying, God make thee as Ephraim and as Manasseh: and he setEphraimbefore Manasseh.",
            "citation": "(Genesis 48:20)"
          },
          "21": {
            "text": "And Israel said unto Joseph, Behold, I die: butGodshall be with you, andbringyou again unto thelandof your fathers.",
            "citation": "(Genesis 48:21)"
          },
          "22": {
            "text": "Moreover I have given to thee oneportionabove thy brethren, which I took out of the hand of the Amorite with my sword and with my bow.",
            "citation": "(Genesis 48:22)"
          }
        }
      },
      "49": {
        "verses": {
          "1": {
            "text": "AndJacobcalled unto hissons, and said, Gather yourselves together, that I may tell youthatwhich shall befall you in thelast days.",
            "citation": "(Genesis 49:1)"
          },
          "2": {
            "text": "Gather yourselves together, and hear, ye sons of Jacob; and hearken unto Israel yourfather.",
            "citation": "(Genesis 49:2)"
          },
          "3": {
            "text": "Reuben, thouartmy firstborn, my might, and thebeginningof my strength, the excellency of dignity, and the excellency of power:",
            "citation": "(Genesis 49:3)"
          },
          "4": {
            "text": "Unstable as water, thou shalt not excel; because thou wentest up to thy fathersbed; thendefiledstthouit:he went up to my couch.",
            "citation": "(Genesis 49:4)"
          },
          "5": {
            "text": "SimeonandLeviarebrethren;instruments ofcrueltyare intheir habitations.",
            "citation": "(Genesis 49:5)"
          },
          "6": {
            "text": "O my soul, come not thou into their secret; unto their assembly, mine honour, be not thouunited: for in theirangertheyslewa man, and in their selfwill they digged down wall.",
            "citation": "(Genesis 49:6)"
          },
          "7": {
            "text": "Cursedbetheiranger, forit wasfierce; and their wrath, for it wascruel: I will divide them in Jacob, and scatter them in Israel.",
            "citation": "(Genesis 49:7)"
          },
          "8": {
            "text": "Judah, thouart hewhom thy brethren shallpraise: thy handshall bein theneckof thine enemies; thy fathers children shallbowdown before thee.",
            "citation": "(Genesis 49:8)"
          },
          "9": {
            "text": "Judahisalionswhelp: from the prey, my son, thou art gone up: he stooped down, he couched as alion, and as an old lion; who shall rouse him up?",
            "citation": "(Genesis 49:9)"
          },
          "10": {
            "text": "The sceptre shall not depart fromJudah, nor alawgiverfrom between his feet, untilShilohcome; and unto himshallthegatheringof the peoplebe.",
            "citation": "(Genesis 49:10)"
          },
          "11": {
            "text": "Binding his foal unto the vine, and his asss colt unto the choicevine; hewashedhis garments in wine, and his clothes in thebloodof grapes:",
            "citation": "(Genesis 49:11)"
          },
          "12": {
            "text": "His eyesshall bered with wine, and his teeth white with milk.",
            "citation": "(Genesis 49:12)"
          },
          "13": {
            "text": "Zebulunshall dwell at the haven of the sea; and heshall befor an haven of ships; and his bordershall beunto Zidon.",
            "citation": "(Genesis 49:13)"
          },
          "14": {
            "text": "Issacharisa strong ass couching down between two burdens:",
            "citation": "(Genesis 49:14)"
          },
          "15": {
            "text": "And he saw that restwasgood, and the land thatit waspleasant; and bowed his shoulder to bear, and became servant unto tribute.",
            "citation": "(Genesis 49:15)"
          },
          "16": {
            "text": "Danshalljudgehis people, as one of the tribes of Israel.",
            "citation": "(Genesis 49:16)"
          },
          "17": {
            "text": "Dan shall be serpent by the way, an adder in the path, that biteth the horse heels, so that his rider shall fall backward.",
            "citation": "(Genesis 49:17)"
          },
          "18": {
            "text": "I havewaitedfor thy salvation, OLord.",
            "citation": "(Genesis 49:18)"
          },
          "19": {
            "text": "Gad, atroopshall overcome him: but he shall overcome at the last.",
            "citation": "(Genesis 49:19)"
          },
          "20": {
            "text": "Out ofAsherhis breadshall befat, and he shall yield royal dainties.",
            "citation": "(Genesis 49:20)"
          },
          "21": {
            "text": "Naphtaliisa hind let loose: he giveth goodly words.",
            "citation": "(Genesis 49:21)"
          },
          "22": {
            "text": "Josephisa fruitfulbough,evena fruitful bough by well;whosebranchesrunover the wall:",
            "citation": "(Genesis 49:22)"
          },
          "23": {
            "text": "The archers have sorely grieved him, and shotat him,and hated him:",
            "citation": "(Genesis 49:23)"
          },
          "24": {
            "text": "But his bow abode in strength, and the arms of his hands were madestrong by the hands of the mightyGodof Jacob; (fromthenceistheshepherd, thestoneof Israel:)",
            "citation": "(Genesis 49:24)"
          },
          "25": {
            "text": "Evenby the God of thy father, who shall help thee; and by theAlmighty, who shall bless thee with blessings of heaven above, blessings of the deep that lieth under, blessings of the breasts, and of thewomb:",
            "citation": "(Genesis 49:25)"
          },
          "26": {
            "text": "Theblessingsof thy father have prevailed above the blessings of my progenitors unto theutmostbound of the everlastinghills: they shall be on the head ofJoseph, and on the crown of the head of him that was separate from his brethren.",
            "citation": "(Genesis 49:26)"
          },
          "27": {
            "text": "Benjaminshall ravinasa wolf: in the morning he shall devour the prey, and at night he shall divide the spoil.",
            "citation": "(Genesis 49:27)"
          },
          "28": {
            "text": "All thesearethetwelve tribesof Israel: and thisis itthat their father spake unto them, andblessedthem; every one according to hisblessinghe blessed them.",
            "citation": "(Genesis 49:28)"
          },
          "29": {
            "text": "And he charged them, and said unto them, I am to be gathered unto mypeople:buryme with my fathers in the cave thatisin the field of Ephron the Hittite,",
            "citation": "(Genesis 49:29)"
          },
          "30": {
            "text": "In the cave thatisin the field ofMachpelah, whichisbefore Mamre, in the land of Canaan, which Abraham bought with the field ofEphronthe Hittite for possession of buryingplace.",
            "citation": "(Genesis 49:30)"
          },
          "31": {
            "text": "There theyburiedAbraham and Sarah his wife; there they buried Isaac and Rebekah his wife; and there I buried Leah.",
            "citation": "(Genesis 49:31)"
          },
          "32": {
            "text": "The purchase of the field and of the cave thatisthereinwasfrom the children of Heth.",
            "citation": "(Genesis 49:32)"
          },
          "33": {
            "text": "And when Jacob had made an end of commanding his sons, he gathered up his feet into the bed, and yielded up theghost, and wasgatheredunto his people.",
            "citation": "(Genesis 49:33)"
          }
        }
      },
      "50": {
        "verses": {
          "1": {
            "text": "AndJosephfell upon his fathers face, andweptupon him, and kissed him.",
            "citation": "(Genesis 50:1)"
          },
          "2": {
            "text": "And Joseph commanded his servants the physicians toembalmhis father: and the physicians embalmed Israel.",
            "citation": "(Genesis 50:2)"
          },
          "3": {
            "text": "And forty days were fulfilled for him; for so are fulfilled the days of those which are embalmed: and the Egyptians mourned for him threescore and ten days.",
            "citation": "(Genesis 50:3)"
          },
          "4": {
            "text": "And when the days of his mourning were past, Joseph spake unto the house of Pharaoh, saying, If now I have found grace in your eyes, speak, I pray you, in the ears of Pharaoh, saying,",
            "citation": "(Genesis 50:4)"
          },
          "5": {
            "text": "My father made me swear, saying, Lo, I die: in mygravewhich I have digged for me in the land of Canaan, there shalt thou bury me. Now therefore let me go up, I pray thee, and bury my father, and I will come again.",
            "citation": "(Genesis 50:5)"
          },
          "6": {
            "text": "And Pharaoh said, Go up, and bury thy father, according as he made thee swear.",
            "citation": "(Genesis 50:6)"
          },
          "7": {
            "text": "And Joseph went up to bury his father: and with him went up all the servants of Pharaoh, the elders of his house, and all the elders of the land of Egypt,",
            "citation": "(Genesis 50:7)"
          },
          "8": {
            "text": "And all the house of Joseph, and his brethren, and his fathers house: only their little ones, and their flocks, and their herds, they left in the land ofGoshen.",
            "citation": "(Genesis 50:8)"
          },
          "9": {
            "text": "And there went up with him both chariots and horsemen: and it was very great company.",
            "citation": "(Genesis 50:9)"
          },
          "10": {
            "text": "And they came to the threshingfloor of Atad, whichisbeyond Jordan, and there theymournedwith great and very sore lamentation: and he made amourningfor his father seven days.",
            "citation": "(Genesis 50:10)"
          },
          "11": {
            "text": "And when the inhabitants of the land, the Canaanites, saw the mourning in the floor of Atad, they said, Thisisa grievous mourning to the Egyptians: wherefore the name of it was calledAbel-mizraim, whichisbeyond Jordan.",
            "citation": "(Genesis 50:11)"
          },
          "12": {
            "text": "And his sons did unto him according as he commanded them:",
            "citation": "(Genesis 50:12)"
          },
          "13": {
            "text": "For his sonscarriedhim into the land of Canaan, and buried him in the cave of the field of Machpelah, which Abraham bought with the field for possession of aburyingplaceofEphronthe Hittite, before Mamre.",
            "citation": "(Genesis 50:13)"
          },
          "14": {
            "text": "And Joseph returned into Egypt, he, and his brethren, and all that went up with him to bury his father, after he had buried his father.",
            "citation": "(Genesis 50:14)"
          },
          "15": {
            "text": "And when Josephs brethren saw that their father was dead, they said,Josephwill peradventure hate us, and will certainly requite us all the evil which we did unto him.",
            "citation": "(Genesis 50:15)"
          },
          "16": {
            "text": "And they sent messenger unto Joseph, saying, Thy father did command before he died, saying,",
            "citation": "(Genesis 50:16)"
          },
          "17": {
            "text": "So shall ye say unto Joseph,Forgive, I pray thee now, the trespass of thy brethren, and their sin; for they did unto thee evil: and now, we pray thee, forgive the trespass of the servants of the God of thy father. And Josephweptwhen they spake unto him.",
            "citation": "(Genesis 50:17)"
          },
          "18": {
            "text": "And his brethren also went and fell down before his face; and they said, Behold, webethyservants.",
            "citation": "(Genesis 50:18)"
          },
          "19": {
            "text": "And Joseph said unto them, Fear not: foramI in the place of God?",
            "citation": "(Genesis 50:19)"
          },
          "20": {
            "text": "But as for you, ye thoughtevilagainst me;butGodmeantit untogood, to bring to pass, asit isthis day, to save much people alive.",
            "citation": "(Genesis 50:20)"
          },
          "21": {
            "text": "Now therefore fear ye not: I willnourishyou, and your little ones. And he comforted them, and spake kindly unto them.",
            "citation": "(Genesis 50:21)"
          },
          "22": {
            "text": "AndJosephdwelt in Egypt, he, and his fathers house: and Joseph lived an hundred and ten years.",
            "citation": "(Genesis 50:22)"
          },
          "23": {
            "text": "And Joseph saw Ephraimschildrenof the thirdgeneration:the children also of Machir the son ofManassehwere brought up upon Josephs knees.",
            "citation": "(Genesis 50:23)"
          },
          "24": {
            "text": "AndJoseph said unto his brethren, I die: and God will surely visit you, andbringyou out of this land unto thelandwhich he sware toAbraham, to Isaac, and to Jacob.",
            "citation": "(Genesis 50:24)"
          },
          "25": {
            "text": "And Joseph took anoathof the children of Israel, saying, God will surely visit you, and ye shall carry up mybonesfrom hence.",
            "citation": "(Genesis 50:25)"
          },
          "26": {
            "text": "SoJosephdied,beingan hundred and ten years old: and theyembalmedhim, and he was put in coffin in Egypt.",
            "citation": "(Genesis 50:26)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 69503,
  "total_sources": 11,
  "generated_at": "2025-12-14T04:01:27.373592"
}