{
  "week_number": 13,
  "date_range": "Exodus 1–6",
  "title": "",
  "primary_scriptures": [
    {
      "book": "Exodus",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Exodus",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM:  ---\nThe invitation to live in Egypt saved Jacob’s family. But after hundreds of years, their descendants were enslaved and terrorized by a new pharaoh who “knew not Joseph” (\nExodus 1:8\n). It would have been natural for the Israelites to wonder why God allowed this to happen to them, His covenant people. Did He remember the covenant He had made with them? Were they still His people? Could He see how much they were suffering?\nThere may be times when you’ve felt like asking similar questions. You might wonder, “Does God know what I’m going through? Can He hear my pleas for help?” Israel’s deliverance from Egypt answers such questions clearly: God does not forget His people. He remembers His covenants with us and will fulfill them in His own time and way. “I will redeem you with a stretched out arm,” He declares. “I am the Lord your God, which bringeth you out from under [your] burdens” (\nExodus 6:6–7\n).\nFor an overview of the book of Exodus, see “\nExodus, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and Church\nExodus 1–2\nGod can work through me to fulfill His purposes.\nWhat impresses you about the women described in\nExodus 1–2\n? How did they help fulfill God’s plan for His people? What do their efforts teach you about service in God’s work?\nExodus 1–3\nJesus Christ is my Deliverer.\nBefore you begin reading Exodus, you might think about a hardship you’re going through—something you hope the Lord will deliver you from. What words and phrases in\nExodus 1–3\nsound similar to spiritual captivity or other things we face today? Notice also how the children of Israel sought deliverance and how the Lord responded (see, for example,\nExodus 2:23–25\n;\n3:7–8\n). How has the Lord “come down to deliver” you?\nThroughout the book of Exodus, you might also note some similarities between Moses and Jesus Christ (see\nDeuteronomy 18:18–19\n;\n1 Nephi 22:20–21\n). For example, what similarities do you see between\nExodus 1:22\n;\n2:1–10\nand\nMatthew 2:13–16\n? Or between\nExodus 24:18\nand\nMatthew 4:1–2\n? What do you feel the Lord wants you to understand about Himself and His power?\nLook for symbols that testify of Jesus Christ.\n“You can … find parallels to the Savior’s life in the lives of prophets and other faithful men and women in the scriptures. [Doing so] reveals truths about the Savior in places you might otherwise overlook” (See\nTeaching in the Savior’s Way\n,\n7\n; see also\nHosea 12:10\n).\nFaith at Water’s Edge\n, by Anne Marie Oborn\nExodus 3:1–6\nI can show reverence for holy things and places.\nCan you think of a time when something filled you with awe and wonder? How did you react? How would you describe the emotions you felt?\nWith that in mind, read\nExodus 3:1–6\n. What impresses you about Moses’s inspiring experience? What did Moses do to show reverence for God? What connections do you see between his actions and reverence for sacred things?\nReading these verses might prompt you to think about holy things and holy places in your life. Why are they sacred to you? How do you treat them differently from things that are common? To guide your pondering, you could refer to the section titled “\nRemembering the Promises\n” in Elder David A. Bednar’s message “Exceeding Great and Precious Promises” (\nEnsign\nor\nLiahona\n, Nov. 2017, 91–93). You might also sing or listen to a hymn that inspires awe, like “\nI Stand All Amazed\n” (\nHymns\n, no. 193) and ponder what it is about the gospel that amazes you.\nOf course, even when we’ve had wonderful spiritual experiences, there’s a danger of becoming too casual about sacred things. How do you avoid this? Here are two messages that address this issue; pick one, and look for statements that help you: Ulisses Soares, “\nIn Awe of Christ and His Gospel\n” (\nLiahona\n, May 2022, 115–17); Gérald Caussé, “\nIs It Still Wonderful to You?\n” (\nEnsign\nor\nLiahona\n, May 2015, 98–100).\nSee also\nDoctrine and Covenants 6:10–12\n;\n63:64\n.\nExodus 3–4\nGod gives power to people He calls to do His work.\nToday we know Moses as a great prophet and leader. But Moses did not see himself that way when the Lord first called him. As you read\nExodus 3–4\n, list Moses’s concerns and how the Lord responded to each. What do you find in these chapters that might inspire you when you feel inadequate? When have you seen God empower you or others to do His work?\nSee also “\nThe Church Gives Us Opportunities to Assist in God’s Work\n” in “Church Organization” in Topics and Questions, Gospel Library.\nExodus 5–6\nThe Lord’s purposes will be fulfilled in His own time.\nIt can be discouraging when our sincere efforts to do good don’t seem to be working—when we’re trying to do the Lord’s will but we’re not seeing the results we expected. To learn about a similar experience Moses had, read\nExodus 5:4–9, 20–23\n. How did the Lord help Moses overcome his feelings of discouragement? (see\nExodus 6:1–13\n). How has the Lord helped you persist in doing His will?\nSee also Jeffrey R. Holland, “\nWaiting on the Lord\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 115–17.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Moses slay an Egyptian?\nWho was Jethro?\nWhat can we learn about the glory of God from the burning bush?\nClick to see more.\nIdeas for Teaching Children\nBecause this Sunday is the fifth Sunday of the month, Primary teachers are encouraged to use learning activities in “\nAppendix B: Preparing Children for a Lifetime on God’s Covenant Path\n.”\nExodus 1–2\nGod can work through me to fulfill His purposes.\nMoses had a major role in freeing Israel from bondage. But he wouldn’t have been able to accomplish this if his mother, his sister, Pharaoh’s daughter, and other faithful women hadn’t protected and cared for him. Help your children learn about these women in\nExodus 1:15–20\n;\nExodus 2:2–10\n(see also\nNumbers 26:59\n); and\nExodus 2:16–21\n. You could also use this week’s activity page and “\nBaby Moses\n” (in\nOld Testament Stories\n, 61–63) to tell their stories. How did these women help fulfill God’s plan? Talk with each other about other people you admire who help with God’s work, including in small and simple ways. How can we follow their example?\n1:36\nBaby Moses\nExodus 3:1–5\nI can treat holy places with reverence.\nAfter reading\nExodus 3:1–5\ntogether, ask your children to summarize these verses in their own words (see also “\nMoses the Prophet\n” in\nOld Testament Stories\n, 64–66). You could also review the beginning of Elder Ulisses Soares’s message “\nReverence for Sacred Things\n” (\nLiahona\n, May 2025, 108). How did Moses show reverence in the Lord’s presence? How does the Lord want us to show reverence? You might also ask your children to help you find (or draw) pictures of sacred places or activities where we should be reverent. What can we do to make our home a sacred place?\n1:26\nMoses the Prophet\nSing together a song about reverence, such as “\nReverence Is Love\n” (\nChildren’s Songbook\n, 31). As you do, your children could find words or phrases that explain what it means to be reverent. If we were bringing a friend to church for the first time, how would we explain what it means to be reverent?\nMoses and Aaron Speak to the People\n, by James J. Tissot\nExodus 3–4\nWhen the Lord asks me to do something, He will help me do it.\nUsing the account in\nExodus 3\n;\n4:1–17\n, let your children take turns pretending to be Moses. It might be fun to include objects or simple props, such as a flashlight and a plant to represent the burning bush. Help your children discover how Moses felt about the assignment the Lord gave him (see\nExodus 3:11\n;\n4:1, 10\n). Maybe you could share with each other times when you had similar feelings. What advice would we share with Moses to help him? Read about how the Lord encouraged Moses in\nExodus 3:12\n;\n4:2–9, 11–12\n. Tell the children how the Savior has helped you fulfill a calling, follow a prompting, or do something else that was hard for you.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 13: Lesson 38: Lesson 38—Exodus 1This lesson can help students desire to put God above other pressures.; Lesson 39: Lesson 39—Exodus 2–4This lesson can help students more fully incorporate the Lord’s words through His prophets into their lives.... ---\n\n--- Lesson 38 ---\nThe Egyptian pharaoh enslaved the Israelites and commanded the midwives to kill the Israelite sons at birth. These midwives chose to disobey Pharaoh because of their reverence for God. Like these faithful women, we can choose to put our trust in God even in difficult circumstances. This lesson can help students desire to put God above other pressures. Student preparation: Consider inviting students to ask a family member or friend how they have seen God bless them for following Him rather than others. Possible Learning Activities Christlike courage Consider sharing the following from President Nelson. President Russell M. Nelson described characteristics of disciples of Jesus Christ: 14:51 True disciples of Jesus Christ are willing to stand out, speak up, and be different from the people of the world. They are undaunted, devoted, and courageous. (“ Drawing the Power of Jesus Christ into Our Lives , ” Ensign or Liahona , May 2017, 40–41) Why might it take courage to act in the way President Nelson described? Why do you think it is important to follow President Nelson’s counsel? Display the following self-assessment to help students ponder how they feel about obeying God rather than giving in to other pressures. Read the following statements and rate how true they are of you on a scale from 1 (not true at all) to 5 (very true). I am willing to put the Lord first, even when I feel pressure from others to lower my standards. I am unsure if God will bless me for striving to obey His commandments. I am willing to stand up for what I know is right, even if it isn’t the popular choice. Encourage students to pay attention to impressions from the Spirit as they study Exodus 1 . The Spirit can help them prepare to act with courage when they feel pressure to do things that are against God’s will. Righteous examples Consider inviting the students to share what they know about what happened to the Israelites after the death of Joseph of Egypt. As needed, use some or all of the following summary. After Joseph of Egypt died, the Israelites (also called the Hebrews) grew in number in the land of Egypt. Fearing that the Israelites could overpower the Egyptians, the new pharaoh enslaved them (see Exodus 1:6–14 ). Read Exodus 1:15–16 , looking for what Pharaoh commanded Shiphrah and Puah, two Hebrew midwives, to do. “Midwives” refers to women who assist in childbirth. “Stools” ( verse 16 ) refers to seats used by women who are giving birth. Invite students to share what they found. Find ways to help students relate to the pressure these women may have felt to do what others wanted rather than what God wanted. The following question and activity is one way to do this. If you were Shiphrah or Puah, what might have made it difficult for you to put God’s will above Pharaoh’s? Consider separating the class into groups. Invite groups to identify circumstances they have faced or might face where it could be difficult to choose God’s will because of other pressures. Have them create a list of reasons why someone might be concerned about following God in those circumstances. Read Exodus 1:17–21 , looking for why Shiphrah and Puah made the decisions they did. What did you find? What in these verses could motivate someone who might wonder whether they should put God above other pressures they face? As students share, you might want to tell them that “fearing God” (see verses 17, 21 ) means to revere or respect God. Point out the phrase “God dealt well” with Shiphrah and Puah ( verse 20 ) if students do not identify it. Invite students to mark this phrase. This means that God blessed Shiphrah and Puah for putting Him above the pressures they faced. According to footnote b in verse 21 , one blessing the Lord gave Shiphrah and Puah was descendants. What truth can we learn from Shiphrah and Puah that can help us when we face pressures to follow others rather than God? Using their own words, students could identify a truth like as we submit our will to God instead of bending to other pressures, He will bless us. Although the rest of the lesson focuses on how “God [deals] well” with us, you might consider taking time to focus on the Savior’s example of submitting to Heavenly Father’s will. You could use a question like the following to do that. If students have a hard time coming up with examples, you might direct them to John 6:38 or Luke 22:42 . What has the Savior taught or done that shows how He is the perfect example of this truth? Think of an activity to help students understand ways the Lord might deal well with (bless) them for revering Him by putting Him first. Here are two ideas. Choose one of these or another of your choice to help students answer the following questions. Share with students the video “ Leave the Party ” (6:26) or the video “ Be Valiant in Courage, Strength, and Activity ” from time code 1:20 to 5:13 (both videos are available at ChurchofJesusChrist.org ). Invite students to identify how the Lord blessed John for putting God above other pressures. 6:26 10:35 Provide students with a few scriptures to study that show ways God has dealt well with others for choosing Him over other pressures. They could study 2 Nephi 5:6–13 ; Mosiah 24:11–15 ; 4 Nephi 1:15–18 . Students could also find other scriptures that illustrate how God deals well with His children when they put Him first. What might it look like when “God [deals] well” with us? How has God dealt well with you or someone you know for submitting to His will instead of bending to other pressures? Why is it worth it to you to choose to put God first no matter the outcome? Submitting our will to God Consider displaying the following questions to help students think about what they have learned or felt today and how it can help them when they face difficult situations. Choose one of the following questions to respond to in your study journal: What have you learned or felt today that can help you be confident that God will bless you when you choose to put Him first? What would you share with someone who is unsure if it is worth choosing God when we face other pressures? Consider giving students an opportunity to share what they wrote. You might also share the Savior’s promise to people who are persecuted for choosing Him, found in Matthew 5:10–12 . Consider sharing your testimony of how God will bless us when we choose to follow Him, even when it is difficult.\n\n\n--- Lesson 39 ---\nWhen we face difficulties, the Lord lovingly guides us through His prophets. Under Pharaoh’s reign, the children of Israel struggled in bondage and cried unto the Lord. The Lord heard their cries and called Moses as a prophet to help them. This lesson can help students more fully incorporate the Lord’s words through His prophets into their lives. Student preparation: Invite students to review recent teachings from the prophet. Then invite them to discuss with a family member or friend how following the prophet’s teachings has blessed their lives. Possible Learning Activities Which voices to trust Consider beginning class by sharing this statement and asking the following questions. Elder Neil L. Andersen of the Quorum of the Twelve Apostles observed: 16:4 We live on a planet clamoring with a million voices. The internet, our smartphones, our bloated boxes of entertainment all plead for our attention and thrust their influence upon us. (“ The Prophet of God ,” Ensign or Liahona , May 2018, 26) List of a few examples of the voices you have seen or heard over the last several days. What do you notice about the different sources of information? How are the words of prophets different from other voices? Consider displaying the following self-evaluation statements and invite students to think about their answers. For each of the following statements, rate yourself using a scale from 1 (not true at all) to 5 (very true): I place more trust in the words of prophets and apostles than in other voices or influences. I have confidence in the counsel and direction we receive from the Lord’s prophets and apostles. I make efforts to study the words of today’s prophets and apostles. As students study today, invite them to listen for impressions from the Spirit about how they can more fully follow the counsel of prophets and apostles in their lives. The Lord calls Moses to be a prophet To help students understand how the Lord prepared Moses to be His prophet, consider inviting students to share what they know about Moses’s early life. You could display an image of the baby Moses to help students recall what they know. You could also show the video “ Baby Moses ” (1:37), available at ChurchofJesusChrist.org . 1:36 The following paragraphs contain details that may be helpful as students summarize. Although he was an Israelite by birth, the prophet Moses was raised in the household of Pharaoh in Egypt. When Moses was an infant, Pharaoh commanded that all newborn Israelite boys should be killed (see Exodus 1:22 ). To save Moses, his mother hid him in a basket and placed it next to a river. Moses was discovered by Pharaoh’s daughter, who raised him as her son (see Exodus 2:1–10 ). In Egypt, Moses was well educated and “mighty in words and in deeds” ( Acts 7:22 ). As a grown man, Moses killed an Egyptian while defending one of the Israelite slaves. Moses fled to Midian, where he lived with a high priest named Jethro and married his daughter, Zipporah (see Exodus 2:11–21 ). While tending sheep in Midian, Moses had an experience with Jehovah. Show the following picture. Invite students to imagine they were Moses as they read the following verses and answer the following questions in small groups. They can then share highlights of what they learned as a class. Exodus 3:1–6 . How would you feel? Why? Exodus 3:7–14 . Which of the Lord’s teachings may have been most meaningful or comforting to you? To help students focus on Jesus Christ as they study these verses, consider displaying an image of the Savior on the center of the board. You could invite students to write phrases about the Savior around the picture, describing through His words what we can learn about Him and His relationship with Moses and the children of Israel. Examples of insights could include that Jesus called Moses by name ( verse 4 ), Jesus’s presence made the ground holy ( verse 5 ), Jesus saw the afflictions and heard the cries of His people ( verse 7 ), and Jesus promised to be with Moses ( verse 12 ). If students do not mention it, point out the title “I AM” ( Exodus 3:14 ). Explain that it comes from the same root word as Jehovah, which can be interpreted as “He is” or “He exists.” The name would have been easily recognized by the Israelites. To help students understand the significance of this name, you might ask why it would be meaningful to know that the Lord truly exists and is always present. After students share their responses, you could ask the following question. If you had been in Moses’s situation, what questions or concerns might you have had? Explain that despite the Lord’s declaration of who He is and what He promises, Moses still had concerns about his call to deliver Israel. Read Exodus 4:10–15 , looking for how the Lord addressed Moses’s concerns. What do you learn about the words of prophets from these verses? Help students identify the truth that the Lord speaks His words through His prophets. How could knowing this truth affect your life or your decisions? To help students better understand this truth, you might show one of the following videos: “ Why Do We Have Prophets? ” (1:37) “ Listen to a Prophet ” from time code 0:53 to 2:56 1:37 2:56 Recall the beginning of the lesson and the various voices hoping to gain our attention. Think about what you could share with someone else to help them understand that the Lord speaks through prophets and that we should listen to prophets over other voices. You could include what you learned from Exodus 3 and any experiences you, or someone you know, have had that have helped you know that the Lord speaks His words through His prophets. Invite students to share what they might say. A possible follow-up question is “How has this understanding blessed you or someone you know?” Applying the words of the Lord’s prophets in our lives What are some ways we could hear and apply the Lord’s words, given through His prophets, in our lives? Encourage several students to share examples of applying the prophets’ teachings. If useful, share a few ideas like: Applying specific prophetic counsel from a recent general conference talk. Studying the words of prophets more often, like listening to a general conference talk each morning while preparing for school. Creating a plan to study the most recent general conference talks of each of the members of the First Presidency and Quorum of the Twelve Apostles. (If students have digital access, they could use the Study Plans feature on the Gospel Library app.) Write in your study journal how you will hear and apply the word of the Lord through His prophets in your personal life. As part of your plan, record what obstacles you think you might face. For each obstacle, write how you might overcome it. Explain to students that they will have an opportunity in a future lesson, Lesson 55: “ Assess Your Learning 3 ,” to assess how they are doing at implementing their plans. Close by sharing your testimony that the Lord speaks through His living prophets today.\n\n\n--- Lesson 40 ---\nAfter the Lord called him to deliver Israel from Egyptian captivity, Moses asked Pharaoh to let the Lord’s people go. Pharaoh refused and instead increased the Israelites’ burden. Despite Pharaoh’s response, Moses continued to follow what the Lord asked him to do. This lesson can help students recognize that the Lord’s promises can motivate them to do His will, regardless of the immediate outcome. Student preparation: Invite students to come to class prepared to share their answers to the following question: Does following Jesus Christ make your life easier or harder? Possible Learning Activities Following Jesus Christ Invite students to consider how they would respond if someone asked them the following question. Does following Jesus Christ make your life easier or harder? To discuss this question, you could write Easier and Harder as headings on the board and list students’ reasons for their response under the appropriate heading. Consider having a few students explain their responses. Moses asks Pharaoh to set the Israelites free You might want to point out that in Exodus 5–7 , Moses and the Israelites may have wondered if following the Savior makes life easier or harder. To help students understand the context of Exodus 5–7 , consider inviting class members to share what they remember about Moses and the children of Israel from Lesson 39: “ Exodus 2–4 .” If needed, invite a student to read the following summary. The children of Israel had been in bondage to the Egyptians for many generations. The Lord heard His people’s cry and called Moses to help deliver them from bondage (see Exodus 3:9–10 ). Read Exodus 5:1–2 , looking for what Moses and Aaron told Pharaoh from the Lord. What was Pharaoh’s response? Consider writing on the board Pharaoh’s response: “Who is the Lord?” You might ask students why this question is important for us to answer for ourselves. The next section of the lesson will refer to this question. In his anger, Pharaoh made the lives of the Israelites harder by increasing their daily workload (see Exodus 5:6–9 , including footnote 8 a , 15–19). The Israelites complained to Moses and Aaron about their increased burdens (see Exodus 5:20–21 ). If you were Moses, how might you have felt? Read Exodus 5:22–23 , thinking about how you might summarize what Moses is saying to the Lord. How might we relate to Moses in Exodus 5:22–23 ? Students may share how they feel when they don’t see immediate blessings after obeying the Lord. Validate their answers and feelings. Display the following self-assessment, and invite students to ponder their responses. Complete the following sentence in a way that best reflects your feelings. You might select more than one answer: When I don’t see immediate blessings after obeying Heavenly Father and Jesus Christ, I feel … If students would benefit from prompts to this self-assessment, you might write some of the following words on the board for them to choose from: frustrated , confused , angry , disappointed , resolved , hopeful , confident , peaceful . They could also add what they might do in this situation. As you continue to learn today, look for truths about Jesus Christ that can help you follow Him even when it is hard and the blessings are not immediate. Pay attention to impressions from the Holy Ghost that can help you in your personal circumstances. The Lord’s promises As students read the following passages, consider inviting them to mark all the statements in which the Lord refers to Himself (statements beginning with I , I am , I will , and I have ). Marking scriptures can help students notice and remember important insights and truths they learn. Read Exodus 6:1–8 ; 7:1–2, 5 , looking for what the Lord taught Moses about Himself. After students have had time to read and mark, they could discuss the following question with a partner. Questions that help students assess what they are learning can help a teacher identify when students are ready to move on in the lesson. One way to do this is to ask questions about what students have read in the scriptures, such as the one below. For additional training on asking questions that assess learning, see “ Always be ready to respond to spiritual promptings about the needs of learners ” in Teacher Development Skills . What are you learning about the Lord from His promises to Moses? Students could write their answers under “Who is the Lord?” on the board. Students’ answers could include the following list: He is God Almighty ( 6:2–3 ). He remembers and keeps His promises ( 6:3–5 ). He promised to free the Israelites from bondage ( 6:6 ; 7:5 ), give them the land of Canaan ( 6:4, 8 ), and be their God ( 6:7 ) Continuing to do the Lord’s will Recall how Moses felt previously. Read Exodus 7:6 , and mark what Moses and Aaron did after learning from the Lord and hearing His promises. If you were Moses, which of the promises from the Lord would have helped you go back to Pharaoh? Why? What truth can we learn from Moses’s experience? Using their own words, students could identify a truth similar to the following: When we believe the Lord and His promises, we can trust and follow Him even when we don’t see the immediate outcome. To help students understand how this truth can apply to situations they might face, consider sharing the following statement. Willing students could read each paragraph aloud to the class. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles provided important counsel for us as we await the Lord’s promised blessings: 13:17 Some misunderstand the promises of God to mean that obedience to Him yields specific outcomes on a fixed schedule. They might think, “If I diligently serve a full-time mission, God will bless me with a happy marriage and children” or “If I refrain from doing schoolwork on the Sabbath, God will bless me with good grades” or “If I pay tithing, God will bless me with that job I’ve been wanting.” … We ought not to think of God’s plan as a cosmic vending machine where we (1) select a desired blessing, (2) insert the required sum of good works, and (3) the order is promptly delivered. God will indeed honor His covenants and promises to each of us. We need not worry about that. The atoning power of Jesus Christ … ensures that God can and will fulfill His promises. It is essential that we honor and obey His laws, but not every blessing predicated on obedience to law is shaped, designed, and timed according to our expectations. We do our best but must leave to Him the management of blessings, both temporal and spiritual. (“ Our Relationship with God ,” Liahona , May 2022, 78) What stood out to you from this statement? Remind students that one thing we learned about the Lord is that He remembers and keeps His promises (see Exodus 6:3–5 ). Explain that the Lord fulfilled His promises to Moses (see Exodus 20:2 ; Deuteronomy 7:6 ; 14:2 ; Joshua 24:5–7, 13 ). If you have sufficient time, you could write these references on the board and have students match the fulfillment to the promise. Just as the Lord taught Moses more about Himself by reiterating His promises, we can also better know the Lord by identifying promises He has made to us. Reviewing these promises can help us to obey Him, even if we do not receive immediate results. Identify three promises the Lord has made to you in the scriptures or from recent teachings through His chosen servants. You might find promises in: Doctrinal mastery passages or other scriptures. For the Strength of Youth: A Guide for Making Choices . Recent general conference talks. After sufficient time, you could invite willing students to share what they learned or felt as they studied some of the promises. Encourage students to continue to trust the Lord regardless of the immediate outcome.\n\n--- SCRIPTURE: Exodus 1 ---\n1. Now thesearethenamesof thechildren of Israel, which cameintoEgypt; every man and his household came with Jacob.\n2. Reuben, Simeon, Levi, and Judah,\n3. Issachar, Zebulun, and Benjamin,\n4. Dan, and Naphtali, Gad, and Asher.\n5. And all the souls that came out of the loins ofJacobwere seventy souls: for Joseph was in Egyptalready.\n6. AndJosephdied, and all his brethren, and all that generation.\n7. And the children of Israel werefruitful, andincreasedabundantly, and multiplied, andwaxedexceeding mighty; and the land was filled with them.\n8. Now there arose up newkingover Egypt, which knew not Joseph.\n9. And he said unto his people, Behold, the people of the children of Israelaremoreandmightierthan we:\n10. Come on, let us dealwiselywith them; lest they multiply, and it come to pass, that, when therefalleth outany war, they join also unto our enemies, and fight against us, andsoget them up out of the land.\n11. Therefore they did set over themtaskmastersto afflict them with theirburdens. And they built for Pharaohtreasure cities, Pithom andRaamses.\n12. But the more they afflicted them, the more theymultipliedand grew. And they weregrieved because ofthe children of Israel.\n13. And the Egyptians made the children of Israel to serve with rigour:\n14. And they made their lives bitter with hardbondage, in mortar, and in brick, and in all manner of service in the field: all their service, wherein they made them serve,waswith rigour.\n15. And the king of Egypt spake to the Hebrew midwives, of which the name of the onewasShiphrah, and the name of the other Puah:\n16. And he said, When yedo the office ofa midwife to the Hebrew women, and seethemupon thestools; if itbea son, then ye shall kill him: but if itbea daughter, then she shall live.\n17. But the midwivesfearedGod, and did not as the king of Egyptcommandedthem, but saved the men children alive.\n18. And the king of Egypt called for the midwives, and said unto them, Why have ye done this thing, and have saved the men children alive?\n19. And the midwives said unto Pharaoh, Because the Hebrew womenarenot as the Egyptian women; for theyarelively, and aredeliveredere the midwives come in unto them.\n20. Therefore God dealtwellwith the midwives: and the people multiplied, and waxed very mighty.\n21. And it came to pass, because the midwivesfeared God, that he made themhouses.\n22. And Pharaoh charged all his people, saying, Every son that isbornye shall cast into the river, and every daughter ye shall save alive.\n\n--- SCRIPTURE: Exodus 2 ---\n1. And there went man of the house ofLevi, and tookto wifea daughter of Levi.\n2. And the woman conceived, and bare ason: and when she saw him that hewas agoodlychild,she hid himthreemonths.\n3. And when she could not longer hide him, she took for him an ark of bulrushes, and daubed it with slime and with pitch, and put the child therein; and she laiditin the flagsby the rivers brink.\n4. And hissisterstood afar off,to witwhat would be done to him.\n5. And the daughter of Pharaoh came down to washherselfat the river; and her maidens walked along by the rivers side; and when she saw the ark among the flags, she sent her maid to fetch it.\n6. And when she had openedit,she saw the child: and, behold, the babe wept. And she had compassion on him, and said, Thisis oneof the Hebrews children.\n7. Then said his sister to Pharaohs daughter, Shall I go and call to thee nurse of the Hebrew women, that she may nurse the child for thee?\n8. And Pharaohs daughter said to her, Go. And the maid went and called the childs mother.\n9. And Pharaohs daughter said unto her, Take this child away, and nurse it for me, and I will givetheethy wages. And the woman took the child, and nursed it.\n10. And the child grew, and she brought him unto Pharaohs daughter, and he became herson. And she called his nameMoses: and she said, Because I drew him out of the water.\n11. And it came to pass in those days, when Moses was grown, that he went out unto hisbrethren, and looked on theirburdens: and he spied an Egyptian smiting an Hebrew, one of his brethren.\n12. And he looked this way and that way, and when he saw thatthere wasno man, heslewthe Egyptian, and hid him in the sand.\n13. And when he went out the second day, behold, two men of the Hebrews strove together: and hesaid to him that did the wrong, Whereforesmitestthou thy fellow?\n14. And he said, Who made thee aprinceand judge over us? intendest thou to kill me, as thou killedst the Egyptian? And Moses feared, and said, Surely this thing is known.\n15. Now when Pharaoh heard this thing, he sought toslayMoses. But Mosesfledfromthe face ofPharaoh, and dwelt in the land of Midian: and he sat down by well.\n16. Now the priest ofMidianhad seven daughters: and they came and drewwater,and filled the troughs to water their fathers flock.\n17. And the shepherds came and drove them away: but Moses stood up and helped them, and watered their flock.\n18. And when they came toReueltheir father, he said, Howis it thatye are come so soon to day?\n19. And they said, An Egyptian delivered us out of the hand of the shepherds, and also drewwaterenough for us, and watered the flock.\n20. And he said unto his daughters, And whereishe? whyisitthatye have left the man? call him, that he may eat bread.\n21. And Moses was content to dwell with the man: and he gave MosesZipporahhis daughter.\n22. And she barehimason, and he called his nameGershom: for he said, I have been astrangerin strange land.\n23. And it came to pass in process of time, that the king of Egyptdied: and the children of Israel sighed by reason of the bondage, and theycried, and theircrycame up unto God by reason of the bondage.\n24. And Godheardtheir groaning, and God remembered hiscovenantwith Abraham, with Isaac, and with Jacob.\n25. And God looked upon the children of Israel,andGod had respect untothem.\n\n--- SCRIPTURE: Exodus 3 ---\n1. Now Moses kept the flock ofJethrohis father in law, thepriestof Midian: and he led the flock to the backside of the desert, and came to themountain of God,eventoHoreb.\n2. And theangel of theLordappeared unto him in flame offireout of the midst of abush: and he looked, and, behold, the bush burned with fire, and the bushwasnot consumed.\n3. And Moses said, I will now turn aside, and see this great sight, why the bush is not burnt.\n4. And when theLordsaw that he turned aside to see, Godcalledunto him out of the midst of the bush,and said, Moses, Moses. And he said, HereamI.\n5. And he said, Draw not nigh hither: put off thyshoesfrom off thy feet, for the place whereon thou standestisholyground.\n6. Moreover he said,IamtheGodof thy father, the God of Abraham, the God of Isaac, and the God of Jacob. And Moses hid his face; for he wasafraidtolookupon God.\n7. And theLordsaid, I have surely seen theafflictionof my people whichareinEgypt, and have heard theircryby reason of their taskmasters; for I know their sorrows;\n8. And I am comedowntodeliverthem out of the hand of the Egyptians, and to bring them up out of that land unto good land and large, unto landflowingwith milk and honey; unto the place of theCanaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and the Jebusites.\n9. Now therefore, behold, thecryof the children of Israel is come unto me: and I have also seen the oppression wherewith the Egyptians oppress them.\n10. Come now therefore, and I willsendthee unto Pharaoh, that thou mayestbring forthmy people thechildren of Israeloutof Egypt.\n11. And Moses said unto God,WhoamI, that I should go untoPharaoh, and that I should bring forth the children of Israel out of Egypt?\n12. And he said, Certainly I will bewith thee; and thisshall bea tokenunto thee, that I havesentthee: When thou hast brought forth the people out of Egypt, ye shall serve God upon thismountain.\n13. And Moses said unto God, Behold,whenI come unto the children of Israel, and shall say unto them, The God of your fathers hath sent me unto you; and they shall say to me, Whatishis name?whatshall I say unto them?\n14. And God said unto Moses,I Am That I Am: and he said, Thus shalt thou say unto the children of Israel,I Amhath sent me unto you.\n15. And God said moreover unto Moses, Thus shalt thou say unto the children of Israel, TheLordGodof your fathers, the God of Abraham, the God of Isaac, and the God of Jacob, hath sent me unto you: thisismynamefor ever, andthisismymemorialunto all generations.\n16. Go, and gather theeldersof Israel together, and say unto them, TheLordGod of your fathers, the God of Abraham, of Isaac, and of Jacob, appeared unto me, saying, Ihave surelyvisitedyou, andseenthat which is done to you in Egypt:\n17. And I have said, I will bring you up out of theafflictionofEgyptunto the land of theCanaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and theJebusites, unto alandflowing with milk and honey.\n18. And they shallhearkento thy voice: and thou shalt come, thou and the elders of Israel, unto the king of Egypt, and ye shall say unto him, TheLordGodof the Hebrews hath met with us: and nowletus go, we beseech thee, three days journey into the wilderness, that we maysacrificeto theLordour God.\n19. AndI am surethat the king of Egypt will not let you go,no, not by amightyhand.\n20. And I will stretch out my hand, and smite Egypt with all mywonderswhich I will do in the midst thereof: and after that he will let yougo.\n21. And I will give this people favour in the sight of the Egyptians: and it shall come to pass, that, when ye go, ye shall not goempty:\n22. But every woman shallborrowof her neighbour, and of her that sojourneth in her house, jewels of silver, and jewels of gold, and raiment: and ye shall putthemupon your sons, and upon your daughters; and ye shallspoilthe Egyptians.\n\n--- SCRIPTURE: Exodus 4 ---\n1. And Moses answered and said, But, behold, they will notbelieveme, norhearkenunto my voice: for they will say, TheLordhath not appeared unto thee.\n2. And theLordsaid unto him, Whatisthat in thine hand? And he said, A rod.\n3. And he said, Cast it on the ground. And he cast it on the ground, and it became serpent; and Moses fled from before it.\n4. And theLordsaid unto Moses, Put forth thine hand, and take it by the tail. And he put forth his hand, and caught it, and it became rod in his hand:\n5. That they may believe that theLordGod of their fathers, the God of Abraham, the God of Isaac, and the God of Jacob, hath appeared unto thee.\n6. And theLordsaid furthermore unto him, Put now thine hand into thy bosom. And he put his hand into his bosom: and when he took it out, behold, his handwasleprousas snow.\n7. And he said, Put thine hand into thy bosom again. And he put his hand into his bosom again; andpluckedit out of his bosom, and, behold, it wasturned again ashisotherflesh.\n8. And it shall come to pass, if they will not believe thee, neither hearken to the voice of the first sign, that they will believe the voice of the lattersign.\n9. And it shall come to pass, if they will not believe also these two signs,neither hearken unto thy voice, that thou shalt take of the water ofthe river, and pouritupon the dryland:and the water which thou takest out of the river shall becomebloodupon the dryland.\n10. And Moses said unto theLord, O my Lord, Iamnot eloquent, neither heretofore, nor since thou hast spoken unto thy servant: but Iamslow ofspeech, and of aslowtongue.\n11. And theLordsaid unto him, Who hath made mans mouth? or whomakeththe dumb, or deaf, or the seeing, or the blind? have not I theLord?\n12. Now therefore go, and I will be with thymouth, andteachthee what thou shaltsay.\n13. And he said, O my Lord, send, I pray thee,bythe handof him whomthou wilt send.\n14. And theangerof theLordwas kindled against Moses, and he said,Isnot Aaron the Levite thy brother? I know that he can speak well. And also, behold, he cometh forth to meet thee: and when he seeth thee, he will be glad in his heart.\n15. And thou shalt speak unto him, and put words in his mouth: and I will be with thymouth, and with his mouth, and willteachyou what ye shall do.\n16. And he shall be thyspokesmanunto the people: and he shall be,evenhe shall be to thee instead of mouth, and thou shalt be to himinsteadofGod.\n17. And thou shalt take thisrodin thine hand, wherewith thou shalt do signs.\n18. And Moses went and returned toJethrohis father in law, and said unto him, Let me go, I pray thee, and return unto my brethren whicharein Egypt, and see whether they be yet alive. And Jethro said to Moses, Go in peace.\n19. And theLordsaid unto Moses in Midian, Go, return into Egypt: for all the men aredeadwhich sought thylife.\n20. And Moses took his wife and his sons, and set them upon an ass, and he returned to the land of Egypt: and Moses took therodof God in his hand.\n21. And theLordsaid unto Moses, When thou goest to return into Egypt, see that thou do all thosewondersbefore Pharaoh, which I have put in thinehand:butI willhardenhis heart, that he shall not let the people go.\n22. And thou shalt say unto Pharaoh, Thus saith theLord,Israelismyson,evenmyfirstborn:\n23. And I say unto thee, Let my son go, that he may serve me: and if thou refuse to let him go, behold, I will slay thyson,eventhy firstborn.\n24. Andit came to passbythe way in the inn, that theLordmet him, and sought tokillhim.\n25. Then Zipporah took asharp stone, and cut off the foreskin of her son, and castitat his feet, and said,Surely abloody husbandartthou to me.\n26. So he let him go: then she said, A bloody husbandthou art,because of thecircumcision.\n27. And theLordsaid to Aaron, Go into the wilderness to meet Moses. And he went, and met him in themount of God, and kissed him.\n28. And Moses told Aaron all the words of theLordwho had sent him, and all the signs which he had commanded him.\n29. And Moses and Aaron went and gathered together all theeldersof the children of Israel:\n30. And Aaronspakeall the words which theLordhad spoken unto Moses, and did the signs in the sight of the people.\n31. And the peoplebelieved: and when they heard that theLordhadvisitedthe children of Israel, and that he had looked upon theiraffliction, then theybowedtheir heads and worshipped.\n\n--- SCRIPTURE: Exodus 5 ---\n1. And afterward Moses and Aaron went in, and told Pharaoh, Thus saith theLordGod of Israel,Letmy peoplego, that they may hold afeastunto me in the wilderness.\n2. And Pharaoh said, WhoistheLord, that I shouldobeyhis voice to let Israel go? Iknow nottheLord, neither will I let Israel go.\n3. And they said, TheGodof the Hebrews hath met with us: let us go, we pray thee, three days journey into the desert, and sacrifice unto theLordour God; lest he fall upon us with pestilence, or with the sword.\n4. And the king of Egypt said unto them, Wherefore do ye, Moses and Aaron,letthe people from their works? get you unto yourburdens.\n5. And Pharaoh said, Behold, the people of the land nowaremany, and ye make them rest from their burdens.\n6. And Pharaoh commanded the same day the taskmasters of the people, and their officers, saying,\n7. Ye shall no more give the people straw to make brick, as heretofore: let them go and gather straw for themselves.\n8. And thetaleof the bricks, which they did make heretofore, ye shall lay upon them; ye shall not diminishoughtthereof: for theybeidle; therefore they cry, saying, Let us goandsacrifice to our God.\n9. Let there more work be laid upon the men, that they may labour therein; and let them not regard vain words.\n10. And the taskmasters of the people went out, and their officers, and they spake to the people, saying, Thus saith Pharaoh, I will not give you straw.\n11. Go ye, get you straw where ye can find it: yetnot ought ofyour work shall be diminished.\n12. So the people were scattered abroad throughout all the land of Egypt to gather stubble instead of straw.\n13. And the taskmastershastedthem,saying, Fulfil your works,yourdaily tasks, as when there was straw.\n14. And the officers of the children of Israel, which Pharaohs taskmasters had set over them, were beaten,anddemanded, Whereforehave ye not fulfilled your task in making brick both yesterday and to day, as heretofore?\n15. Then the officers of the children of Israel came and cried unto Pharaoh, saying, Wherefore dealest thou thus with thy servants?\n16. There is no straw given unto thy servants, and they say to us, Make brick: and, behold, thy servantsarebeaten; but the faultisin thine own people.\n17. But he said, Yeareidle,ye areidle: therefore ye say, Let us goanddo sacrifice to theLord.\n18. Go therefore now,andwork; for there shall no straw be given you, yet shall ye deliver the tale of bricks.\n19. And the officers of the children of Israel did seethattheywerein evilcase,after it was said, Ye shall not minishoughtfrom your bricks of your daily task.\n20. And they met Moses and Aaron, who stood in the way, as they came forth from Pharaoh:\n21. And they said unto them, TheLordlook upon you, and judge; because ye have madeoursavour to beabhorredin the eyes of Pharaoh, and in the eyes of his servants, to put sword in their hand to slay us.\n22. And Mosesreturnedunto theLord, and said, Lord, wherefore hast thousoevil entreatedthis people? whyisitthatthou hast sent me?\n23. For since I came to Pharaoh to speak in thy name, he hath done evil to this people; neither hast thou delivered thy people at all.\n\n--- SCRIPTURE: Exodus 6 ---\n1. Then theLordsaid unto Moses, Now shalt thou see what I will do to Pharaoh: forwith strong handshall he let them go, and with astronghand shall hedrivethem out of his land.\n2. And God spake unto Moses, and said unto him, IamtheLord:\n3. And IappeareduntoAbraham, unto Isaac,andunto Jacob, bythe name ofGod Almighty, but by mynameJehovahwas I not known to them.\n4. And I have also established mycovenantwith them, to give them the land of Canaan, the land of theirpilgrimage, wherein they werestrangers.\n5. And I have alsoheardthe groaning of the children of Israel, whom the Egyptians keep inbondage; and I have remembered my covenant.\n6. Wherefore say unto the children of Israel, IamtheLord, and I willbringyou out from under theburdensof the Egyptians, and I willridyou out of their bondage, and I will redeem you with stretched out arm, and with great judgments:\n7. And I will take you to me for apeople, and I will be to you aGod: and ye shallknowthat IamtheLordyour God, which bringeth you out from under the burdens of the Egyptians.\n8. And I will bring you in unto the land, concerning the which Ididswearto give it to Abraham, to Isaac, and to Jacob; and I will give it you for an heritage: IamtheLord.\n9. And Moses spake so unto the children of Israel: but they hearkened not unto Moses for anguish of spirit, and forcruelbondage.\n10. And theLordspake unto Moses, saying,\n11. Go in, speak unto Pharaoh king of Egypt, that he let the children of Israel go out of his land.\n12. And Moses spake before theLord, saying, Behold, the children of Israel have not hearkened unto me; how then shall Pharaoh hear me, whoamof uncircumcised lips?\n13. And theLordspake unto Moses and unto Aaron, and gave them achargeunto the children of Israel, and unto Pharaoh king of Egypt, to bring the children of Israel out of the land of Egypt.\n14. Thesebetheheadsof their fathers houses: The sons of Reuben the firstborn of Israel; Hanoch, and Pallu, Hezron, and Carmi: thesebethe families of Reuben.\n15. And the sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Shaul the son of Canaanitish woman: thesearethe families of Simeon.\n16. And thesearethe names of the sons ofLeviaccording to their generations; Gershon, and Kohath, and Merari: and the years of the life of Leviwerean hundred thirty and seven years.\n17. The sons ofGershon; Libni, and Shimi, according to their families.\n18. And the sons of Kohath; Amram, and Izhar, and Hebron, and Uzziel: and the years of the life of Kohathwerean hundred thirty and three years.\n19. And the sons ofMerari; Mahali and Mushi: thesearethefamiliesof Levi according to their generations.\n20. AndAmramtook him Jochebed his fathers sister to wife; and she bare himAaronand Moses: and the years of the life of Amramwerean hundred and thirty and seven years.\n21. And the sons of Izhar; Korah, and Nepheg, and Zichri.\n22. And the sons ofUzziel; Mishael, and Elzaphan, and Zithri.\n23. And Aaron took him Elisheba, daughter of Amminadab, sister of Naashon, to wife; and she bare himNadab, and Abihu, Eleazar, andIthamar.\n24. And the sons of Korah; Assir, and Elkanah, and Abiasaph: thesearethe families of the Korhites.\n25. AndEleazarAarons son took himoneof the daughters of Putiel to wife; and she bare him Phinehas: thesearethe heads of the fathers of the Levites according to their families.\n26. Thesearethat Aaron and Moses, to whom theLordsaid, Bring out the children of Israel from the land of Egypt according to their armies.\n27. Thesearethey which spake to Pharaoh king of Egypt, to bring out the children of Israel from Egypt: thesearethat Moses and Aaron.\n28. And it came to pass on the daywhentheLordspake unto Moses in the land of Egypt,\n29. That theLordspake unto Moses, saying, IamtheLord: speak thou unto Pharaoh king of Egypt all that I say unto thee.\n30. And Moses said before theLord, Behold, Iamof uncircumcised lips, and how shall Pharaoh hearken unto me?",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "",
      "content": "The invitation to live in Egypt saved Jacob’s family. But after hundreds of years, their descendants were enslaved and terrorized by a new pharaoh who “knew not Joseph” (\nExodus 1:8\n). It would have been natural for the Israelites to wonder why God allowed this to happen to them, His covenant people. Did He remember the covenant He had made with them? Were they still His people? Could He see how much they were suffering?\nThere may be times when you’ve felt like asking similar questions. You might wonder, “Does God know what I’m going through? Can He hear my pleas for help?” Israel’s deliverance from Egypt answers such questions clearly: God does not forget His people. He remembers His covenants with us and will fulfill them in His own time and way. “I will redeem you with a stretched out arm,” He declares. “I am the Lord your God, which bringeth you out from under [your] burdens” (\nExodus 6:6–7\n).\nFor an overview of the book of Exodus, see “\nExodus, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and Church\nExodus 1–2\nGod can work through me to fulfill His purposes.\nWhat impresses you about the women described in\nExodus 1–2\n? How did they help fulfill God’s plan for His people? What do their efforts teach you about service in God’s work?\nExodus 1–3\nJesus Christ is my Deliverer.\nBefore you begin reading Exodus, you might think about a hardship you’re going through—something you hope the Lord will deliver you from. What words and phrases in\nExodus 1–3\nsound similar to spiritual captivity or other things we face today? Notice also how the children of Israel sought deliverance and how the Lord responded (see, for example,\nExodus 2:23–25\n;\n3:7–8\n). How has the Lord “come down to deliver” you?\nThroughout the book of Exodus, you might also note some similarities between Moses and Jesus Christ (see\nDeuteronomy 18:18–19\n;\n1 Nephi 22:20–21\n). For example, what similarities do you see between\nExodus 1:22\n;\n2:1–10\nand\nMatthew 2:13–16\n? Or between\nExodus 24:18\nand\nMatthew 4:1–2\n? What do you feel the Lord wants you to understand about Himself and His power?\nLook for symbols that testify of Jesus Christ.\n“You can … find parallels to the Savior’s life in the lives of prophets and other faithful men and women in the scriptures. [Doing so] reveals truths about the Savior in places you might otherwise overlook” (See\nTeaching in the Savior’s Way\n,\n7\n; see also\nHosea 12:10\n).\nFaith at Water’s Edge\n, by Anne Marie Oborn\nExodus 3:1–6\nI can show reverence for holy things and places.\nCan you think of a time when something filled you with awe and wonder? How did you react? How would you describe the emotions you felt?\nWith that in mind, read\nExodus 3:1–6\n. What impresses you about Moses’s inspiring experience? What did Moses do to show reverence for God? What connections do you see between his actions and reverence for sacred things?\nReading these verses might prompt you to think about holy things and holy places in your life. Why are they sacred to you? How do you treat them differently from things that are common? To guide your pondering, you could refer to the section titled “\nRemembering the Promises\n” in Elder David A. Bednar’s message “Exceeding Great and Precious Promises” (\nEnsign\nor\nLiahona\n, Nov. 2017, 91–93). You might also sing or listen to a hymn that inspires awe, like “\nI Stand All Amazed\n” (\nHymns\n, no. 193) and ponder what it is about the gospel that amazes you.\nOf course, even when we’ve had wonderful spiritual experiences, there’s a danger of becoming too casual about sacred things. How do you avoid this? Here are two messages that address this issue; pick one, and look for statements that help you: Ulisses Soares, “\nIn Awe of Christ and His Gospel\n” (\nLiahona\n, May 2022, 115–17); Gérald Caussé, “\nIs It Still Wonderful to You?\n” (\nEnsign\nor\nLiahona\n, May 2015, 98–100).\nSee also\nDoctrine and Covenants 6:10–12\n;\n63:64\n.\nExodus 3–4\nGod gives power to people He calls to do His work.\nToday we know Moses as a great prophet and leader. But Moses did not see himself that way when the Lord first called him. As you read\nExodus 3–4\n, list Moses’s concerns and how the Lord responded to each. What do you find in these chapters that might inspire you when you feel inadequate? When have you seen God empower you or others to do His work?\nSee also “\nThe Church Gives Us Opportunities to Assist in God’s Work\n” in “Church Organization” in Topics and Questions, Gospel Library.\nExodus 5–6\nThe Lord’s purposes will be fulfilled in His own time.\nIt can be discouraging when our sincere efforts to do good don’t seem to be working—when we’re trying to do the Lord’s will but we’re not seeing the results we expected. To learn about a similar experience Moses had, read\nExodus 5:4–9, 20–23\n. How did the Lord help Moses overcome his feelings of discouragement? (see\nExodus 6:1–13\n). How has the Lord helped you persist in doing His will?\nSee also Jeffrey R. Holland, “\nWaiting on the Lord\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 115–17.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Moses slay an Egyptian?\nWho was Jethro?\nWhat can we learn about the glory of God from the burning bush?\nClick to see more.\nIdeas for Teaching Children\nBecause this Sunday is the fifth Sunday of the month, Primary teachers are encouraged to use learning activities in “\nAppendix B: Preparing Children for a Lifetime on God’s Covenant Path\n.”\nExodus 1–2\nGod can work through me to fulfill His purposes.\nMoses had a major role in freeing Israel from bondage. But he wouldn’t have been able to accomplish this if his mother, his sister, Pharaoh’s daughter, and other faithful women hadn’t protected and cared for him. Help your children learn about these women in\nExodus 1:15–20\n;\nExodus 2:2–10\n(see also\nNumbers 26:59\n); and\nExodus 2:16–21\n. You could also use this week’s activity page and “\nBaby Moses\n” (in\nOld Testament Stories\n, 61–63) to tell their stories. How did these women help fulfill God’s plan? Talk with each other about other people you admire who help with God’s work, including in small and simple ways. How can we follow their example?\n1:36\nBaby Moses\nExodus 3:1–5\nI can treat holy places with reverence.\nAfter reading\nExodus 3:1–5\ntogether, ask your children to summarize these verses in their own words (see also “\nMoses the Prophet\n” in\nOld Testament Stories\n, 64–66). You could also review the beginning of Elder Ulisses Soares’s message “\nReverence for Sacred Things\n” (\nLiahona\n, May 2025, 108). How did Moses show reverence in the Lord’s presence? How does the Lord want us to show reverence? You might also ask your children to help you find (or draw) pictures of sacred places or activities where we should be reverent. What can we do to make our home a sacred place?\n1:26\nMoses the Prophet\nSing together a song about reverence, such as “\nReverence Is Love\n” (\nChildren’s Songbook\n, 31). As you do, your children could find words or phrases that explain what it means to be reverent. If we were bringing a friend to church for the first time, how would we explain what it means to be reverent?\nMoses and Aaron Speak to the People\n, by James J. Tissot\nExodus 3–4\nWhen the Lord asks me to do something, He will help me do it.\nUsing the account in\nExodus 3\n;\n4:1–17\n, let your children take turns pretending to be Moses. It might be fun to include objects or simple props, such as a flashlight and a plant to represent the burning bush. Help your children discover how Moses felt about the assignment the Lord gave him (see\nExodus 3:11\n;\n4:1, 10\n). Maybe you could share with each other times when you had similar feelings. What advice would we share with Moses to help him? Read about how the Lord encouraged Moses in\nExodus 3:12\n;\n4:2–9, 11–12\n. Tell the children how the Savior has helped you fulfill a calling, follow a prompting, or do something else that was hard for you.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 13: Lesson 38: Lesson 38—Exodus 1This lesson can help students desire to put God above other pressures.; Lesson 39: Lesson 39—Exodus 2–4This lesson can help students more fully incorporate the Lord’s words through His prophets into their lives....",
      "content": "\n--- Lesson 38 ---\nThe Egyptian pharaoh enslaved the Israelites and commanded the midwives to kill the Israelite sons at birth. These midwives chose to disobey Pharaoh because of their reverence for God. Like these faithful women, we can choose to put our trust in God even in difficult circumstances. This lesson can help students desire to put God above other pressures. Student preparation: Consider inviting students to ask a family member or friend how they have seen God bless them for following Him rather than others. Possible Learning Activities Christlike courage Consider sharing the following from President Nelson. President Russell M. Nelson described characteristics of disciples of Jesus Christ: 14:51 True disciples of Jesus Christ are willing to stand out, speak up, and be different from the people of the world. They are undaunted, devoted, and courageous. (“ Drawing the Power of Jesus Christ into Our Lives , ” Ensign or Liahona , May 2017, 40–41) Why might it take courage to act in the way President Nelson described? Why do you think it is important to follow President Nelson’s counsel? Display the following self-assessment to help students ponder how they feel about obeying God rather than giving in to other pressures. Read the following statements and rate how true they are of you on a scale from 1 (not true at all) to 5 (very true). I am willing to put the Lord first, even when I feel pressure from others to lower my standards. I am unsure if God will bless me for striving to obey His commandments. I am willing to stand up for what I know is right, even if it isn’t the popular choice. Encourage students to pay attention to impressions from the Spirit as they study Exodus 1 . The Spirit can help them prepare to act with courage when they feel pressure to do things that are against God’s will. Righteous examples Consider inviting the students to share what they know about what happened to the Israelites after the death of Joseph of Egypt. As needed, use some or all of the following summary. After Joseph of Egypt died, the Israelites (also called the Hebrews) grew in number in the land of Egypt. Fearing that the Israelites could overpower the Egyptians, the new pharaoh enslaved them (see Exodus 1:6–14 ). Read Exodus 1:15–16 , looking for what Pharaoh commanded Shiphrah and Puah, two Hebrew midwives, to do. “Midwives” refers to women who assist in childbirth. “Stools” ( verse 16 ) refers to seats used by women who are giving birth. Invite students to share what they found. Find ways to help students relate to the pressure these women may have felt to do what others wanted rather than what God wanted. The following question and activity is one way to do this. If you were Shiphrah or Puah, what might have made it difficult for you to put God’s will above Pharaoh’s? Consider separating the class into groups. Invite groups to identify circumstances they have faced or might face where it could be difficult to choose God’s will because of other pressures. Have them create a list of reasons why someone might be concerned about following God in those circumstances. Read Exodus 1:17–21 , looking for why Shiphrah and Puah made the decisions they did. What did you find? What in these verses could motivate someone who might wonder whether they should put God above other pressures they face? As students share, you might want to tell them that “fearing God” (see verses 17, 21 ) means to revere or respect God. Point out the phrase “God dealt well” with Shiphrah and Puah ( verse 20 ) if students do not identify it. Invite students to mark this phrase. This means that God blessed Shiphrah and Puah for putting Him above the pressures they faced. According to footnote b in verse 21 , one blessing the Lord gave Shiphrah and Puah was descendants. What truth can we learn from Shiphrah and Puah that can help us when we face pressures to follow others rather than God? Using their own words, students could identify a truth like as we submit our will to God instead of bending to other pressures, He will bless us. Although the rest of the lesson focuses on how “God [deals] well” with us, you might consider taking time to focus on the Savior’s example of submitting to Heavenly Father’s will. You could use a question like the following to do that. If students have a hard time coming up with examples, you might direct them to John 6:38 or Luke 22:42 . What has the Savior taught or done that shows how He is the perfect example of this truth? Think of an activity to help students understand ways the Lord might deal well with (bless) them for revering Him by putting Him first. Here are two ideas. Choose one of these or another of your choice to help students answer the following questions. Share with students the video “ Leave the Party ” (6:26) or the video “ Be Valiant in Courage, Strength, and Activity ” from time code 1:20 to 5:13 (both videos are available at ChurchofJesusChrist.org ). Invite students to identify how the Lord blessed John for putting God above other pressures. 6:26 10:35 Provide students with a few scriptures to study that show ways God has dealt well with others for choosing Him over other pressures. They could study 2 Nephi 5:6–13 ; Mosiah 24:11–15 ; 4 Nephi 1:15–18 . Students could also find other scriptures that illustrate how God deals well with His children when they put Him first. What might it look like when “God [deals] well” with us? How has God dealt well with you or someone you know for submitting to His will instead of bending to other pressures? Why is it worth it to you to choose to put God first no matter the outcome? Submitting our will to God Consider displaying the following questions to help students think about what they have learned or felt today and how it can help them when they face difficult situations. Choose one of the following questions to respond to in your study journal: What have you learned or felt today that can help you be confident that God will bless you when you choose to put Him first? What would you share with someone who is unsure if it is worth choosing God when we face other pressures? Consider giving students an opportunity to share what they wrote. You might also share the Savior’s promise to people who are persecuted for choosing Him, found in Matthew 5:10–12 . Consider sharing your testimony of how God will bless us when we choose to follow Him, even when it is difficult.\n\n\n--- Lesson 39 ---\nWhen we face difficulties, the Lord lovingly guides us through His prophets. Under Pharaoh’s reign, the children of Israel struggled in bondage and cried unto the Lord. The Lord heard their cries and called Moses as a prophet to help them. This lesson can help students more fully incorporate the Lord’s words through His prophets into their lives. Student preparation: Invite students to review recent teachings from the prophet. Then invite them to discuss with a family member or friend how following the prophet’s teachings has blessed their lives. Possible Learning Activities Which voices to trust Consider beginning class by sharing this statement and asking the following questions. Elder Neil L. Andersen of the Quorum of the Twelve Apostles observed: 16:4 We live on a planet clamoring with a million voices. The internet, our smartphones, our bloated boxes of entertainment all plead for our attention and thrust their influence upon us. (“ The Prophet of God ,” Ensign or Liahona , May 2018, 26) List of a few examples of the voices you have seen or heard over the last several days. What do you notice about the different sources of information? How are the words of prophets different from other voices? Consider displaying the following self-evaluation statements and invite students to think about their answers. For each of the following statements, rate yourself using a scale from 1 (not true at all) to 5 (very true): I place more trust in the words of prophets and apostles than in other voices or influences. I have confidence in the counsel and direction we receive from the Lord’s prophets and apostles. I make efforts to study the words of today’s prophets and apostles. As students study today, invite them to listen for impressions from the Spirit about how they can more fully follow the counsel of prophets and apostles in their lives. The Lord calls Moses to be a prophet To help students understand how the Lord prepared Moses to be His prophet, consider inviting students to share what they know about Moses’s early life. You could display an image of the baby Moses to help students recall what they know. You could also show the video “ Baby Moses ” (1:37), available at ChurchofJesusChrist.org . 1:36 The following paragraphs contain details that may be helpful as students summarize. Although he was an Israelite by birth, the prophet Moses was raised in the household of Pharaoh in Egypt. When Moses was an infant, Pharaoh commanded that all newborn Israelite boys should be killed (see Exodus 1:22 ). To save Moses, his mother hid him in a basket and placed it next to a river. Moses was discovered by Pharaoh’s daughter, who raised him as her son (see Exodus 2:1–10 ). In Egypt, Moses was well educated and “mighty in words and in deeds” ( Acts 7:22 ). As a grown man, Moses killed an Egyptian while defending one of the Israelite slaves. Moses fled to Midian, where he lived with a high priest named Jethro and married his daughter, Zipporah (see Exodus 2:11–21 ). While tending sheep in Midian, Moses had an experience with Jehovah. Show the following picture. Invite students to imagine they were Moses as they read the following verses and answer the following questions in small groups. They can then share highlights of what they learned as a class. Exodus 3:1–6 . How would you feel? Why? Exodus 3:7–14 . Which of the Lord’s teachings may have been most meaningful or comforting to you? To help students focus on Jesus Christ as they study these verses, consider displaying an image of the Savior on the center of the board. You could invite students to write phrases about the Savior around the picture, describing through His words what we can learn about Him and His relationship with Moses and the children of Israel. Examples of insights could include that Jesus called Moses by name ( verse 4 ), Jesus’s presence made the ground holy ( verse 5 ), Jesus saw the afflictions and heard the cries of His people ( verse 7 ), and Jesus promised to be with Moses ( verse 12 ). If students do not mention it, point out the title “I AM” ( Exodus 3:14 ). Explain that it comes from the same root word as Jehovah, which can be interpreted as “He is” or “He exists.” The name would have been easily recognized by the Israelites. To help students understand the significance of this name, you might ask why it would be meaningful to know that the Lord truly exists and is always present. After students share their responses, you could ask the following question. If you had been in Moses’s situation, what questions or concerns might you have had? Explain that despite the Lord’s declaration of who He is and what He promises, Moses still had concerns about his call to deliver Israel. Read Exodus 4:10–15 , looking for how the Lord addressed Moses’s concerns. What do you learn about the words of prophets from these verses? Help students identify the truth that the Lord speaks His words through His prophets. How could knowing this truth affect your life or your decisions? To help students better understand this truth, you might show one of the following videos: “ Why Do We Have Prophets? ” (1:37) “ Listen to a Prophet ” from time code 0:53 to 2:56 1:37 2:56 Recall the beginning of the lesson and the various voices hoping to gain our attention. Think about what you could share with someone else to help them understand that the Lord speaks through prophets and that we should listen to prophets over other voices. You could include what you learned from Exodus 3 and any experiences you, or someone you know, have had that have helped you know that the Lord speaks His words through His prophets. Invite students to share what they might say. A possible follow-up question is “How has this understanding blessed you or someone you know?” Applying the words of the Lord’s prophets in our lives What are some ways we could hear and apply the Lord’s words, given through His prophets, in our lives? Encourage several students to share examples of applying the prophets’ teachings. If useful, share a few ideas like: Applying specific prophetic counsel from a recent general conference talk. Studying the words of prophets more often, like listening to a general conference talk each morning while preparing for school. Creating a plan to study the most recent general conference talks of each of the members of the First Presidency and Quorum of the Twelve Apostles. (If students have digital access, they could use the Study Plans feature on the Gospel Library app.) Write in your study journal how you will hear and apply the word of the Lord through His prophets in your personal life. As part of your plan, record what obstacles you think you might face. For each obstacle, write how you might overcome it. Explain to students that they will have an opportunity in a future lesson, Lesson 55: “ Assess Your Learning 3 ,” to assess how they are doing at implementing their plans. Close by sharing your testimony that the Lord speaks through His living prophets today.\n\n\n--- Lesson 40 ---\nAfter the Lord called him to deliver Israel from Egyptian captivity, Moses asked Pharaoh to let the Lord’s people go. Pharaoh refused and instead increased the Israelites’ burden. Despite Pharaoh’s response, Moses continued to follow what the Lord asked him to do. This lesson can help students recognize that the Lord’s promises can motivate them to do His will, regardless of the immediate outcome. Student preparation: Invite students to come to class prepared to share their answers to the following question: Does following Jesus Christ make your life easier or harder? Possible Learning Activities Following Jesus Christ Invite students to consider how they would respond if someone asked them the following question. Does following Jesus Christ make your life easier or harder? To discuss this question, you could write Easier and Harder as headings on the board and list students’ reasons for their response under the appropriate heading. Consider having a few students explain their responses. Moses asks Pharaoh to set the Israelites free You might want to point out that in Exodus 5–7 , Moses and the Israelites may have wondered if following the Savior makes life easier or harder. To help students understand the context of Exodus 5–7 , consider inviting class members to share what they remember about Moses and the children of Israel from Lesson 39: “ Exodus 2–4 .” If needed, invite a student to read the following summary. The children of Israel had been in bondage to the Egyptians for many generations. The Lord heard His people’s cry and called Moses to help deliver them from bondage (see Exodus 3:9–10 ). Read Exodus 5:1–2 , looking for what Moses and Aaron told Pharaoh from the Lord. What was Pharaoh’s response? Consider writing on the board Pharaoh’s response: “Who is the Lord?” You might ask students why this question is important for us to answer for ourselves. The next section of the lesson will refer to this question. In his anger, Pharaoh made the lives of the Israelites harder by increasing their daily workload (see Exodus 5:6–9 , including footnote 8 a , 15–19). The Israelites complained to Moses and Aaron about their increased burdens (see Exodus 5:20–21 ). If you were Moses, how might you have felt? Read Exodus 5:22–23 , thinking about how you might summarize what Moses is saying to the Lord. How might we relate to Moses in Exodus 5:22–23 ? Students may share how they feel when they don’t see immediate blessings after obeying the Lord. Validate their answers and feelings. Display the following self-assessment, and invite students to ponder their responses. Complete the following sentence in a way that best reflects your feelings. You might select more than one answer: When I don’t see immediate blessings after obeying Heavenly Father and Jesus Christ, I feel … If students would benefit from prompts to this self-assessment, you might write some of the following words on the board for them to choose from: frustrated , confused , angry , disappointed , resolved , hopeful , confident , peaceful . They could also add what they might do in this situation. As you continue to learn today, look for truths about Jesus Christ that can help you follow Him even when it is hard and the blessings are not immediate. Pay attention to impressions from the Holy Ghost that can help you in your personal circumstances. The Lord’s promises As students read the following passages, consider inviting them to mark all the statements in which the Lord refers to Himself (statements beginning with I , I am , I will , and I have ). Marking scriptures can help students notice and remember important insights and truths they learn. Read Exodus 6:1–8 ; 7:1–2, 5 , looking for what the Lord taught Moses about Himself. After students have had time to read and mark, they could discuss the following question with a partner. Questions that help students assess what they are learning can help a teacher identify when students are ready to move on in the lesson. One way to do this is to ask questions about what students have read in the scriptures, such as the one below. For additional training on asking questions that assess learning, see “ Always be ready to respond to spiritual promptings about the needs of learners ” in Teacher Development Skills . What are you learning about the Lord from His promises to Moses? Students could write their answers under “Who is the Lord?” on the board. Students’ answers could include the following list: He is God Almighty ( 6:2–3 ). He remembers and keeps His promises ( 6:3–5 ). He promised to free the Israelites from bondage ( 6:6 ; 7:5 ), give them the land of Canaan ( 6:4, 8 ), and be their God ( 6:7 ) Continuing to do the Lord’s will Recall how Moses felt previously. Read Exodus 7:6 , and mark what Moses and Aaron did after learning from the Lord and hearing His promises. If you were Moses, which of the promises from the Lord would have helped you go back to Pharaoh? Why? What truth can we learn from Moses’s experience? Using their own words, students could identify a truth similar to the following: When we believe the Lord and His promises, we can trust and follow Him even when we don’t see the immediate outcome. To help students understand how this truth can apply to situations they might face, consider sharing the following statement. Willing students could read each paragraph aloud to the class. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles provided important counsel for us as we await the Lord’s promised blessings: 13:17 Some misunderstand the promises of God to mean that obedience to Him yields specific outcomes on a fixed schedule. They might think, “If I diligently serve a full-time mission, God will bless me with a happy marriage and children” or “If I refrain from doing schoolwork on the Sabbath, God will bless me with good grades” or “If I pay tithing, God will bless me with that job I’ve been wanting.” … We ought not to think of God’s plan as a cosmic vending machine where we (1) select a desired blessing, (2) insert the required sum of good works, and (3) the order is promptly delivered. God will indeed honor His covenants and promises to each of us. We need not worry about that. The atoning power of Jesus Christ … ensures that God can and will fulfill His promises. It is essential that we honor and obey His laws, but not every blessing predicated on obedience to law is shaped, designed, and timed according to our expectations. We do our best but must leave to Him the management of blessings, both temporal and spiritual. (“ Our Relationship with God ,” Liahona , May 2022, 78) What stood out to you from this statement? Remind students that one thing we learned about the Lord is that He remembers and keeps His promises (see Exodus 6:3–5 ). Explain that the Lord fulfilled His promises to Moses (see Exodus 20:2 ; Deuteronomy 7:6 ; 14:2 ; Joshua 24:5–7, 13 ). If you have sufficient time, you could write these references on the board and have students match the fulfillment to the promise. Just as the Lord taught Moses more about Himself by reiterating His promises, we can also better know the Lord by identifying promises He has made to us. Reviewing these promises can help us to obey Him, even if we do not receive immediate results. Identify three promises the Lord has made to you in the scriptures or from recent teachings through His chosen servants. You might find promises in: Doctrinal mastery passages or other scriptures. For the Strength of Youth: A Guide for Making Choices . Recent general conference talks. After sufficient time, you could invite willing students to share what they learned or felt as they studied some of the promises. Encourage students to continue to trust the Lord regardless of the immediate outcome.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 1",
      "content": "1. Now thesearethenamesof thechildren of Israel, which cameintoEgypt; every man and his household came with Jacob.\n2. Reuben, Simeon, Levi, and Judah,\n3. Issachar, Zebulun, and Benjamin,\n4. Dan, and Naphtali, Gad, and Asher.\n5. And all the souls that came out of the loins ofJacobwere seventy souls: for Joseph was in Egyptalready.\n6. AndJosephdied, and all his brethren, and all that generation.\n7. And the children of Israel werefruitful, andincreasedabundantly, and multiplied, andwaxedexceeding mighty; and the land was filled with them.\n8. Now there arose up newkingover Egypt, which knew not Joseph.\n9. And he said unto his people, Behold, the people of the children of Israelaremoreandmightierthan we:\n10. Come on, let us dealwiselywith them; lest they multiply, and it come to pass, that, when therefalleth outany war, they join also unto our enemies, and fight against us, andsoget them up out of the land.\n11. Therefore they did set over themtaskmastersto afflict them with theirburdens. And they built for Pharaohtreasure cities, Pithom andRaamses.\n12. But the more they afflicted them, the more theymultipliedand grew. And they weregrieved because ofthe children of Israel.\n13. And the Egyptians made the children of Israel to serve with rigour:\n14. And they made their lives bitter with hardbondage, in mortar, and in brick, and in all manner of service in the field: all their service, wherein they made them serve,waswith rigour.\n15. And the king of Egypt spake to the Hebrew midwives, of which the name of the onewasShiphrah, and the name of the other Puah:\n16. And he said, When yedo the office ofa midwife to the Hebrew women, and seethemupon thestools; if itbea son, then ye shall kill him: but if itbea daughter, then she shall live.\n17. But the midwivesfearedGod, and did not as the king of Egyptcommandedthem, but saved the men children alive.\n18. And the king of Egypt called for the midwives, and said unto them, Why have ye done this thing, and have saved the men children alive?\n19. And the midwives said unto Pharaoh, Because the Hebrew womenarenot as the Egyptian women; for theyarelively, and aredeliveredere the midwives come in unto them.\n20. Therefore God dealtwellwith the midwives: and the people multiplied, and waxed very mighty.\n21. And it came to pass, because the midwivesfeared God, that he made themhouses.\n22. And Pharaoh charged all his people, saying, Every son that isbornye shall cast into the river, and every daughter ye shall save alive.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 2",
      "content": "1. And there went man of the house ofLevi, and tookto wifea daughter of Levi.\n2. And the woman conceived, and bare ason: and when she saw him that hewas agoodlychild,she hid himthreemonths.\n3. And when she could not longer hide him, she took for him an ark of bulrushes, and daubed it with slime and with pitch, and put the child therein; and she laiditin the flagsby the rivers brink.\n4. And hissisterstood afar off,to witwhat would be done to him.\n5. And the daughter of Pharaoh came down to washherselfat the river; and her maidens walked along by the rivers side; and when she saw the ark among the flags, she sent her maid to fetch it.\n6. And when she had openedit,she saw the child: and, behold, the babe wept. And she had compassion on him, and said, Thisis oneof the Hebrews children.\n7. Then said his sister to Pharaohs daughter, Shall I go and call to thee nurse of the Hebrew women, that she may nurse the child for thee?\n8. And Pharaohs daughter said to her, Go. And the maid went and called the childs mother.\n9. And Pharaohs daughter said unto her, Take this child away, and nurse it for me, and I will givetheethy wages. And the woman took the child, and nursed it.\n10. And the child grew, and she brought him unto Pharaohs daughter, and he became herson. And she called his nameMoses: and she said, Because I drew him out of the water.\n11. And it came to pass in those days, when Moses was grown, that he went out unto hisbrethren, and looked on theirburdens: and he spied an Egyptian smiting an Hebrew, one of his brethren.\n12. And he looked this way and that way, and when he saw thatthere wasno man, heslewthe Egyptian, and hid him in the sand.\n13. And when he went out the second day, behold, two men of the Hebrews strove together: and hesaid to him that did the wrong, Whereforesmitestthou thy fellow?\n14. And he said, Who made thee aprinceand judge over us? intendest thou to kill me, as thou killedst the Egyptian? And Moses feared, and said, Surely this thing is known.\n15. Now when Pharaoh heard this thing, he sought toslayMoses. But Mosesfledfromthe face ofPharaoh, and dwelt in the land of Midian: and he sat down by well.\n16. Now the priest ofMidianhad seven daughters: and they came and drewwater,and filled the troughs to water their fathers flock.\n17. And the shepherds came and drove them away: but Moses stood up and helped them, and watered their flock.\n18. And when they came toReueltheir father, he said, Howis it thatye are come so soon to day?\n19. And they said, An Egyptian delivered us out of the hand of the shepherds, and also drewwaterenough for us, and watered the flock.\n20. And he said unto his daughters, And whereishe? whyisitthatye have left the man? call him, that he may eat bread.\n21. And Moses was content to dwell with the man: and he gave MosesZipporahhis daughter.\n22. And she barehimason, and he called his nameGershom: for he said, I have been astrangerin strange land.\n23. And it came to pass in process of time, that the king of Egyptdied: and the children of Israel sighed by reason of the bondage, and theycried, and theircrycame up unto God by reason of the bondage.\n24. And Godheardtheir groaning, and God remembered hiscovenantwith Abraham, with Isaac, and with Jacob.\n25. And God looked upon the children of Israel,andGod had respect untothem.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 3",
      "content": "1. Now Moses kept the flock ofJethrohis father in law, thepriestof Midian: and he led the flock to the backside of the desert, and came to themountain of God,eventoHoreb.\n2. And theangel of theLordappeared unto him in flame offireout of the midst of abush: and he looked, and, behold, the bush burned with fire, and the bushwasnot consumed.\n3. And Moses said, I will now turn aside, and see this great sight, why the bush is not burnt.\n4. And when theLordsaw that he turned aside to see, Godcalledunto him out of the midst of the bush,and said, Moses, Moses. And he said, HereamI.\n5. And he said, Draw not nigh hither: put off thyshoesfrom off thy feet, for the place whereon thou standestisholyground.\n6. Moreover he said,IamtheGodof thy father, the God of Abraham, the God of Isaac, and the God of Jacob. And Moses hid his face; for he wasafraidtolookupon God.\n7. And theLordsaid, I have surely seen theafflictionof my people whichareinEgypt, and have heard theircryby reason of their taskmasters; for I know their sorrows;\n8. And I am comedowntodeliverthem out of the hand of the Egyptians, and to bring them up out of that land unto good land and large, unto landflowingwith milk and honey; unto the place of theCanaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and the Jebusites.\n9. Now therefore, behold, thecryof the children of Israel is come unto me: and I have also seen the oppression wherewith the Egyptians oppress them.\n10. Come now therefore, and I willsendthee unto Pharaoh, that thou mayestbring forthmy people thechildren of Israeloutof Egypt.\n11. And Moses said unto God,WhoamI, that I should go untoPharaoh, and that I should bring forth the children of Israel out of Egypt?\n12. And he said, Certainly I will bewith thee; and thisshall bea tokenunto thee, that I havesentthee: When thou hast brought forth the people out of Egypt, ye shall serve God upon thismountain.\n13. And Moses said unto God, Behold,whenI come unto the children of Israel, and shall say unto them, The God of your fathers hath sent me unto you; and they shall say to me, Whatishis name?whatshall I say unto them?\n14. And God said unto Moses,I Am That I Am: and he said, Thus shalt thou say unto the children of Israel,I Amhath sent me unto you.\n15. And God said moreover unto Moses, Thus shalt thou say unto the children of Israel, TheLordGodof your fathers, the God of Abraham, the God of Isaac, and the God of Jacob, hath sent me unto you: thisismynamefor ever, andthisismymemorialunto all generations.\n16. Go, and gather theeldersof Israel together, and say unto them, TheLordGod of your fathers, the God of Abraham, of Isaac, and of Jacob, appeared unto me, saying, Ihave surelyvisitedyou, andseenthat which is done to you in Egypt:\n17. And I have said, I will bring you up out of theafflictionofEgyptunto the land of theCanaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and theJebusites, unto alandflowing with milk and honey.\n18. And they shallhearkento thy voice: and thou shalt come, thou and the elders of Israel, unto the king of Egypt, and ye shall say unto him, TheLordGodof the Hebrews hath met with us: and nowletus go, we beseech thee, three days journey into the wilderness, that we maysacrificeto theLordour God.\n19. AndI am surethat the king of Egypt will not let you go,no, not by amightyhand.\n20. And I will stretch out my hand, and smite Egypt with all mywonderswhich I will do in the midst thereof: and after that he will let yougo.\n21. And I will give this people favour in the sight of the Egyptians: and it shall come to pass, that, when ye go, ye shall not goempty:\n22. But every woman shallborrowof her neighbour, and of her that sojourneth in her house, jewels of silver, and jewels of gold, and raiment: and ye shall putthemupon your sons, and upon your daughters; and ye shallspoilthe Egyptians.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 4",
      "content": "1. And Moses answered and said, But, behold, they will notbelieveme, norhearkenunto my voice: for they will say, TheLordhath not appeared unto thee.\n2. And theLordsaid unto him, Whatisthat in thine hand? And he said, A rod.\n3. And he said, Cast it on the ground. And he cast it on the ground, and it became serpent; and Moses fled from before it.\n4. And theLordsaid unto Moses, Put forth thine hand, and take it by the tail. And he put forth his hand, and caught it, and it became rod in his hand:\n5. That they may believe that theLordGod of their fathers, the God of Abraham, the God of Isaac, and the God of Jacob, hath appeared unto thee.\n6. And theLordsaid furthermore unto him, Put now thine hand into thy bosom. And he put his hand into his bosom: and when he took it out, behold, his handwasleprousas snow.\n7. And he said, Put thine hand into thy bosom again. And he put his hand into his bosom again; andpluckedit out of his bosom, and, behold, it wasturned again ashisotherflesh.\n8. And it shall come to pass, if they will not believe thee, neither hearken to the voice of the first sign, that they will believe the voice of the lattersign.\n9. And it shall come to pass, if they will not believe also these two signs,neither hearken unto thy voice, that thou shalt take of the water ofthe river, and pouritupon the dryland:and the water which thou takest out of the river shall becomebloodupon the dryland.\n10. And Moses said unto theLord, O my Lord, Iamnot eloquent, neither heretofore, nor since thou hast spoken unto thy servant: but Iamslow ofspeech, and of aslowtongue.\n11. And theLordsaid unto him, Who hath made mans mouth? or whomakeththe dumb, or deaf, or the seeing, or the blind? have not I theLord?\n12. Now therefore go, and I will be with thymouth, andteachthee what thou shaltsay.\n13. And he said, O my Lord, send, I pray thee,bythe handof him whomthou wilt send.\n14. And theangerof theLordwas kindled against Moses, and he said,Isnot Aaron the Levite thy brother? I know that he can speak well. And also, behold, he cometh forth to meet thee: and when he seeth thee, he will be glad in his heart.\n15. And thou shalt speak unto him, and put words in his mouth: and I will be with thymouth, and with his mouth, and willteachyou what ye shall do.\n16. And he shall be thyspokesmanunto the people: and he shall be,evenhe shall be to thee instead of mouth, and thou shalt be to himinsteadofGod.\n17. And thou shalt take thisrodin thine hand, wherewith thou shalt do signs.\n18. And Moses went and returned toJethrohis father in law, and said unto him, Let me go, I pray thee, and return unto my brethren whicharein Egypt, and see whether they be yet alive. And Jethro said to Moses, Go in peace.\n19. And theLordsaid unto Moses in Midian, Go, return into Egypt: for all the men aredeadwhich sought thylife.\n20. And Moses took his wife and his sons, and set them upon an ass, and he returned to the land of Egypt: and Moses took therodof God in his hand.\n21. And theLordsaid unto Moses, When thou goest to return into Egypt, see that thou do all thosewondersbefore Pharaoh, which I have put in thinehand:butI willhardenhis heart, that he shall not let the people go.\n22. And thou shalt say unto Pharaoh, Thus saith theLord,Israelismyson,evenmyfirstborn:\n23. And I say unto thee, Let my son go, that he may serve me: and if thou refuse to let him go, behold, I will slay thyson,eventhy firstborn.\n24. Andit came to passbythe way in the inn, that theLordmet him, and sought tokillhim.\n25. Then Zipporah took asharp stone, and cut off the foreskin of her son, and castitat his feet, and said,Surely abloody husbandartthou to me.\n26. So he let him go: then she said, A bloody husbandthou art,because of thecircumcision.\n27. And theLordsaid to Aaron, Go into the wilderness to meet Moses. And he went, and met him in themount of God, and kissed him.\n28. And Moses told Aaron all the words of theLordwho had sent him, and all the signs which he had commanded him.\n29. And Moses and Aaron went and gathered together all theeldersof the children of Israel:\n30. And Aaronspakeall the words which theLordhad spoken unto Moses, and did the signs in the sight of the people.\n31. And the peoplebelieved: and when they heard that theLordhadvisitedthe children of Israel, and that he had looked upon theiraffliction, then theybowedtheir heads and worshipped.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 5",
      "content": "1. And afterward Moses and Aaron went in, and told Pharaoh, Thus saith theLordGod of Israel,Letmy peoplego, that they may hold afeastunto me in the wilderness.\n2. And Pharaoh said, WhoistheLord, that I shouldobeyhis voice to let Israel go? Iknow nottheLord, neither will I let Israel go.\n3. And they said, TheGodof the Hebrews hath met with us: let us go, we pray thee, three days journey into the desert, and sacrifice unto theLordour God; lest he fall upon us with pestilence, or with the sword.\n4. And the king of Egypt said unto them, Wherefore do ye, Moses and Aaron,letthe people from their works? get you unto yourburdens.\n5. And Pharaoh said, Behold, the people of the land nowaremany, and ye make them rest from their burdens.\n6. And Pharaoh commanded the same day the taskmasters of the people, and their officers, saying,\n7. Ye shall no more give the people straw to make brick, as heretofore: let them go and gather straw for themselves.\n8. And thetaleof the bricks, which they did make heretofore, ye shall lay upon them; ye shall not diminishoughtthereof: for theybeidle; therefore they cry, saying, Let us goandsacrifice to our God.\n9. Let there more work be laid upon the men, that they may labour therein; and let them not regard vain words.\n10. And the taskmasters of the people went out, and their officers, and they spake to the people, saying, Thus saith Pharaoh, I will not give you straw.\n11. Go ye, get you straw where ye can find it: yetnot ought ofyour work shall be diminished.\n12. So the people were scattered abroad throughout all the land of Egypt to gather stubble instead of straw.\n13. And the taskmastershastedthem,saying, Fulfil your works,yourdaily tasks, as when there was straw.\n14. And the officers of the children of Israel, which Pharaohs taskmasters had set over them, were beaten,anddemanded, Whereforehave ye not fulfilled your task in making brick both yesterday and to day, as heretofore?\n15. Then the officers of the children of Israel came and cried unto Pharaoh, saying, Wherefore dealest thou thus with thy servants?\n16. There is no straw given unto thy servants, and they say to us, Make brick: and, behold, thy servantsarebeaten; but the faultisin thine own people.\n17. But he said, Yeareidle,ye areidle: therefore ye say, Let us goanddo sacrifice to theLord.\n18. Go therefore now,andwork; for there shall no straw be given you, yet shall ye deliver the tale of bricks.\n19. And the officers of the children of Israel did seethattheywerein evilcase,after it was said, Ye shall not minishoughtfrom your bricks of your daily task.\n20. And they met Moses and Aaron, who stood in the way, as they came forth from Pharaoh:\n21. And they said unto them, TheLordlook upon you, and judge; because ye have madeoursavour to beabhorredin the eyes of Pharaoh, and in the eyes of his servants, to put sword in their hand to slay us.\n22. And Mosesreturnedunto theLord, and said, Lord, wherefore hast thousoevil entreatedthis people? whyisitthatthou hast sent me?\n23. For since I came to Pharaoh to speak in thy name, he hath done evil to this people; neither hast thou delivered thy people at all.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 6",
      "content": "1. Then theLordsaid unto Moses, Now shalt thou see what I will do to Pharaoh: forwith strong handshall he let them go, and with astronghand shall hedrivethem out of his land.\n2. And God spake unto Moses, and said unto him, IamtheLord:\n3. And IappeareduntoAbraham, unto Isaac,andunto Jacob, bythe name ofGod Almighty, but by mynameJehovahwas I not known to them.\n4. And I have also established mycovenantwith them, to give them the land of Canaan, the land of theirpilgrimage, wherein they werestrangers.\n5. And I have alsoheardthe groaning of the children of Israel, whom the Egyptians keep inbondage; and I have remembered my covenant.\n6. Wherefore say unto the children of Israel, IamtheLord, and I willbringyou out from under theburdensof the Egyptians, and I willridyou out of their bondage, and I will redeem you with stretched out arm, and with great judgments:\n7. And I will take you to me for apeople, and I will be to you aGod: and ye shallknowthat IamtheLordyour God, which bringeth you out from under the burdens of the Egyptians.\n8. And I will bring you in unto the land, concerning the which Ididswearto give it to Abraham, to Isaac, and to Jacob; and I will give it you for an heritage: IamtheLord.\n9. And Moses spake so unto the children of Israel: but they hearkened not unto Moses for anguish of spirit, and forcruelbondage.\n10. And theLordspake unto Moses, saying,\n11. Go in, speak unto Pharaoh king of Egypt, that he let the children of Israel go out of his land.\n12. And Moses spake before theLord, saying, Behold, the children of Israel have not hearkened unto me; how then shall Pharaoh hear me, whoamof uncircumcised lips?\n13. And theLordspake unto Moses and unto Aaron, and gave them achargeunto the children of Israel, and unto Pharaoh king of Egypt, to bring the children of Israel out of the land of Egypt.\n14. Thesebetheheadsof their fathers houses: The sons of Reuben the firstborn of Israel; Hanoch, and Pallu, Hezron, and Carmi: thesebethe families of Reuben.\n15. And the sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Shaul the son of Canaanitish woman: thesearethe families of Simeon.\n16. And thesearethe names of the sons ofLeviaccording to their generations; Gershon, and Kohath, and Merari: and the years of the life of Leviwerean hundred thirty and seven years.\n17. The sons ofGershon; Libni, and Shimi, according to their families.\n18. And the sons of Kohath; Amram, and Izhar, and Hebron, and Uzziel: and the years of the life of Kohathwerean hundred thirty and three years.\n19. And the sons ofMerari; Mahali and Mushi: thesearethefamiliesof Levi according to their generations.\n20. AndAmramtook him Jochebed his fathers sister to wife; and she bare himAaronand Moses: and the years of the life of Amramwerean hundred and thirty and seven years.\n21. And the sons of Izhar; Korah, and Nepheg, and Zichri.\n22. And the sons ofUzziel; Mishael, and Elzaphan, and Zithri.\n23. And Aaron took him Elisheba, daughter of Amminadab, sister of Naashon, to wife; and she bare himNadab, and Abihu, Eleazar, andIthamar.\n24. And the sons of Korah; Assir, and Elkanah, and Abiasaph: thesearethe families of the Korhites.\n25. AndEleazarAarons son took himoneof the daughters of Putiel to wife; and she bare him Phinehas: thesearethe heads of the fathers of the Levites according to their families.\n26. Thesearethat Aaron and Moses, to whom theLordsaid, Bring out the children of Israel from the land of Egypt according to their armies.\n27. Thesearethey which spake to Pharaoh king of Egypt, to bring out the children of Israel from Egypt: thesearethat Moses and Aaron.\n28. And it came to pass on the daywhentheLordspake unto Moses in the land of Egypt,\n29. That theLordspake unto Moses, saying, IamtheLord: speak thou unto Pharaoh king of Egypt all that I say unto thee.\n30. And Moses said before theLord, Behold, Iamof uncircumcised lips, and how shall Pharaoh hearken unto me?",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Exodus": {
      "1": {
        "verses": {
          "1": {
            "text": "Now thesearethenamesof thechildren of Israel, which cameintoEgypt; every man and his household came with Jacob.",
            "citation": "(Exodus 1:1)"
          },
          "2": {
            "text": "Reuben, Simeon, Levi, and Judah,",
            "citation": "(Exodus 1:2)"
          },
          "3": {
            "text": "Issachar, Zebulun, and Benjamin,",
            "citation": "(Exodus 1:3)"
          },
          "4": {
            "text": "Dan, and Naphtali, Gad, and Asher.",
            "citation": "(Exodus 1:4)"
          },
          "5": {
            "text": "And all the souls that came out of the loins ofJacobwere seventy souls: for Joseph was in Egyptalready.",
            "citation": "(Exodus 1:5)"
          },
          "6": {
            "text": "AndJosephdied, and all his brethren, and all that generation.",
            "citation": "(Exodus 1:6)"
          },
          "7": {
            "text": "And the children of Israel werefruitful, andincreasedabundantly, and multiplied, andwaxedexceeding mighty; and the land was filled with them.",
            "citation": "(Exodus 1:7)"
          },
          "8": {
            "text": "Now there arose up newkingover Egypt, which knew not Joseph.",
            "citation": "(Exodus 1:8)"
          },
          "9": {
            "text": "And he said unto his people, Behold, the people of the children of Israelaremoreandmightierthan we:",
            "citation": "(Exodus 1:9)"
          },
          "10": {
            "text": "Come on, let us dealwiselywith them; lest they multiply, and it come to pass, that, when therefalleth outany war, they join also unto our enemies, and fight against us, andsoget them up out of the land.",
            "citation": "(Exodus 1:10)"
          },
          "11": {
            "text": "Therefore they did set over themtaskmastersto afflict them with theirburdens. And they built for Pharaohtreasure cities, Pithom andRaamses.",
            "citation": "(Exodus 1:11)"
          },
          "12": {
            "text": "But the more they afflicted them, the more theymultipliedand grew. And they weregrieved because ofthe children of Israel.",
            "citation": "(Exodus 1:12)"
          },
          "13": {
            "text": "And the Egyptians made the children of Israel to serve with rigour:",
            "citation": "(Exodus 1:13)"
          },
          "14": {
            "text": "And they made their lives bitter with hardbondage, in mortar, and in brick, and in all manner of service in the field: all their service, wherein they made them serve,waswith rigour.",
            "citation": "(Exodus 1:14)"
          },
          "15": {
            "text": "And the king of Egypt spake to the Hebrew midwives, of which the name of the onewasShiphrah, and the name of the other Puah:",
            "citation": "(Exodus 1:15)"
          },
          "16": {
            "text": "And he said, When yedo the office ofa midwife to the Hebrew women, and seethemupon thestools; if itbea son, then ye shall kill him: but if itbea daughter, then she shall live.",
            "citation": "(Exodus 1:16)"
          },
          "17": {
            "text": "But the midwivesfearedGod, and did not as the king of Egyptcommandedthem, but saved the men children alive.",
            "citation": "(Exodus 1:17)"
          },
          "18": {
            "text": "And the king of Egypt called for the midwives, and said unto them, Why have ye done this thing, and have saved the men children alive?",
            "citation": "(Exodus 1:18)"
          },
          "19": {
            "text": "And the midwives said unto Pharaoh, Because the Hebrew womenarenot as the Egyptian women; for theyarelively, and aredeliveredere the midwives come in unto them.",
            "citation": "(Exodus 1:19)"
          },
          "20": {
            "text": "Therefore God dealtwellwith the midwives: and the people multiplied, and waxed very mighty.",
            "citation": "(Exodus 1:20)"
          },
          "21": {
            "text": "And it came to pass, because the midwivesfeared God, that he made themhouses.",
            "citation": "(Exodus 1:21)"
          },
          "22": {
            "text": "And Pharaoh charged all his people, saying, Every son that isbornye shall cast into the river, and every daughter ye shall save alive.",
            "citation": "(Exodus 1:22)"
          }
        }
      },
      "2": {
        "verses": {
          "1": {
            "text": "And there went man of the house ofLevi, and tookto wifea daughter of Levi.",
            "citation": "(Exodus 2:1)"
          },
          "2": {
            "text": "And the woman conceived, and bare ason: and when she saw him that hewas agoodlychild,she hid himthreemonths.",
            "citation": "(Exodus 2:2)"
          },
          "3": {
            "text": "And when she could not longer hide him, she took for him an ark of bulrushes, and daubed it with slime and with pitch, and put the child therein; and she laiditin the flagsby the rivers brink.",
            "citation": "(Exodus 2:3)"
          },
          "4": {
            "text": "And hissisterstood afar off,to witwhat would be done to him.",
            "citation": "(Exodus 2:4)"
          },
          "5": {
            "text": "And the daughter of Pharaoh came down to washherselfat the river; and her maidens walked along by the rivers side; and when she saw the ark among the flags, she sent her maid to fetch it.",
            "citation": "(Exodus 2:5)"
          },
          "6": {
            "text": "And when she had openedit,she saw the child: and, behold, the babe wept. And she had compassion on him, and said, Thisis oneof the Hebrews children.",
            "citation": "(Exodus 2:6)"
          },
          "7": {
            "text": "Then said his sister to Pharaohs daughter, Shall I go and call to thee nurse of the Hebrew women, that she may nurse the child for thee?",
            "citation": "(Exodus 2:7)"
          },
          "8": {
            "text": "And Pharaohs daughter said to her, Go. And the maid went and called the childs mother.",
            "citation": "(Exodus 2:8)"
          },
          "9": {
            "text": "And Pharaohs daughter said unto her, Take this child away, and nurse it for me, and I will givetheethy wages. And the woman took the child, and nursed it.",
            "citation": "(Exodus 2:9)"
          },
          "10": {
            "text": "And the child grew, and she brought him unto Pharaohs daughter, and he became herson. And she called his nameMoses: and she said, Because I drew him out of the water.",
            "citation": "(Exodus 2:10)"
          },
          "11": {
            "text": "And it came to pass in those days, when Moses was grown, that he went out unto hisbrethren, and looked on theirburdens: and he spied an Egyptian smiting an Hebrew, one of his brethren.",
            "citation": "(Exodus 2:11)"
          },
          "12": {
            "text": "And he looked this way and that way, and when he saw thatthere wasno man, heslewthe Egyptian, and hid him in the sand.",
            "citation": "(Exodus 2:12)"
          },
          "13": {
            "text": "And when he went out the second day, behold, two men of the Hebrews strove together: and hesaid to him that did the wrong, Whereforesmitestthou thy fellow?",
            "citation": "(Exodus 2:13)"
          },
          "14": {
            "text": "And he said, Who made thee aprinceand judge over us? intendest thou to kill me, as thou killedst the Egyptian? And Moses feared, and said, Surely this thing is known.",
            "citation": "(Exodus 2:14)"
          },
          "15": {
            "text": "Now when Pharaoh heard this thing, he sought toslayMoses. But Mosesfledfromthe face ofPharaoh, and dwelt in the land of Midian: and he sat down by well.",
            "citation": "(Exodus 2:15)"
          },
          "16": {
            "text": "Now the priest ofMidianhad seven daughters: and they came and drewwater,and filled the troughs to water their fathers flock.",
            "citation": "(Exodus 2:16)"
          },
          "17": {
            "text": "And the shepherds came and drove them away: but Moses stood up and helped them, and watered their flock.",
            "citation": "(Exodus 2:17)"
          },
          "18": {
            "text": "And when they came toReueltheir father, he said, Howis it thatye are come so soon to day?",
            "citation": "(Exodus 2:18)"
          },
          "19": {
            "text": "And they said, An Egyptian delivered us out of the hand of the shepherds, and also drewwaterenough for us, and watered the flock.",
            "citation": "(Exodus 2:19)"
          },
          "20": {
            "text": "And he said unto his daughters, And whereishe? whyisitthatye have left the man? call him, that he may eat bread.",
            "citation": "(Exodus 2:20)"
          },
          "21": {
            "text": "And Moses was content to dwell with the man: and he gave MosesZipporahhis daughter.",
            "citation": "(Exodus 2:21)"
          },
          "22": {
            "text": "And she barehimason, and he called his nameGershom: for he said, I have been astrangerin strange land.",
            "citation": "(Exodus 2:22)"
          },
          "23": {
            "text": "And it came to pass in process of time, that the king of Egyptdied: and the children of Israel sighed by reason of the bondage, and theycried, and theircrycame up unto God by reason of the bondage.",
            "citation": "(Exodus 2:23)"
          },
          "24": {
            "text": "And Godheardtheir groaning, and God remembered hiscovenantwith Abraham, with Isaac, and with Jacob.",
            "citation": "(Exodus 2:24)"
          },
          "25": {
            "text": "And God looked upon the children of Israel,andGod had respect untothem.",
            "citation": "(Exodus 2:25)"
          }
        }
      },
      "3": {
        "verses": {
          "1": {
            "text": "Now Moses kept the flock ofJethrohis father in law, thepriestof Midian: and he led the flock to the backside of the desert, and came to themountain of God,eventoHoreb.",
            "citation": "(Exodus 3:1)"
          },
          "2": {
            "text": "And theangel of theLordappeared unto him in flame offireout of the midst of abush: and he looked, and, behold, the bush burned with fire, and the bushwasnot consumed.",
            "citation": "(Exodus 3:2)"
          },
          "3": {
            "text": "And Moses said, I will now turn aside, and see this great sight, why the bush is not burnt.",
            "citation": "(Exodus 3:3)"
          },
          "4": {
            "text": "And when theLordsaw that he turned aside to see, Godcalledunto him out of the midst of the bush,and said, Moses, Moses. And he said, HereamI.",
            "citation": "(Exodus 3:4)"
          },
          "5": {
            "text": "And he said, Draw not nigh hither: put off thyshoesfrom off thy feet, for the place whereon thou standestisholyground.",
            "citation": "(Exodus 3:5)"
          },
          "6": {
            "text": "Moreover he said,IamtheGodof thy father, the God of Abraham, the God of Isaac, and the God of Jacob. And Moses hid his face; for he wasafraidtolookupon God.",
            "citation": "(Exodus 3:6)"
          },
          "7": {
            "text": "And theLordsaid, I have surely seen theafflictionof my people whichareinEgypt, and have heard theircryby reason of their taskmasters; for I know their sorrows;",
            "citation": "(Exodus 3:7)"
          },
          "8": {
            "text": "And I am comedowntodeliverthem out of the hand of the Egyptians, and to bring them up out of that land unto good land and large, unto landflowingwith milk and honey; unto the place of theCanaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and the Jebusites.",
            "citation": "(Exodus 3:8)"
          },
          "9": {
            "text": "Now therefore, behold, thecryof the children of Israel is come unto me: and I have also seen the oppression wherewith the Egyptians oppress them.",
            "citation": "(Exodus 3:9)"
          },
          "10": {
            "text": "Come now therefore, and I willsendthee unto Pharaoh, that thou mayestbring forthmy people thechildren of Israeloutof Egypt.",
            "citation": "(Exodus 3:10)"
          },
          "11": {
            "text": "And Moses said unto God,WhoamI, that I should go untoPharaoh, and that I should bring forth the children of Israel out of Egypt?",
            "citation": "(Exodus 3:11)"
          },
          "12": {
            "text": "And he said, Certainly I will bewith thee; and thisshall bea tokenunto thee, that I havesentthee: When thou hast brought forth the people out of Egypt, ye shall serve God upon thismountain.",
            "citation": "(Exodus 3:12)"
          },
          "13": {
            "text": "And Moses said unto God, Behold,whenI come unto the children of Israel, and shall say unto them, The God of your fathers hath sent me unto you; and they shall say to me, Whatishis name?whatshall I say unto them?",
            "citation": "(Exodus 3:13)"
          },
          "14": {
            "text": "And God said unto Moses,I Am That I Am: and he said, Thus shalt thou say unto the children of Israel,I Amhath sent me unto you.",
            "citation": "(Exodus 3:14)"
          },
          "15": {
            "text": "And God said moreover unto Moses, Thus shalt thou say unto the children of Israel, TheLordGodof your fathers, the God of Abraham, the God of Isaac, and the God of Jacob, hath sent me unto you: thisismynamefor ever, andthisismymemorialunto all generations.",
            "citation": "(Exodus 3:15)"
          },
          "16": {
            "text": "Go, and gather theeldersof Israel together, and say unto them, TheLordGod of your fathers, the God of Abraham, of Isaac, and of Jacob, appeared unto me, saying, Ihave surelyvisitedyou, andseenthat which is done to you in Egypt:",
            "citation": "(Exodus 3:16)"
          },
          "17": {
            "text": "And I have said, I will bring you up out of theafflictionofEgyptunto the land of theCanaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and theJebusites, unto alandflowing with milk and honey.",
            "citation": "(Exodus 3:17)"
          },
          "18": {
            "text": "And they shallhearkento thy voice: and thou shalt come, thou and the elders of Israel, unto the king of Egypt, and ye shall say unto him, TheLordGodof the Hebrews hath met with us: and nowletus go, we beseech thee, three days journey into the wilderness, that we maysacrificeto theLordour God.",
            "citation": "(Exodus 3:18)"
          },
          "19": {
            "text": "AndI am surethat the king of Egypt will not let you go,no, not by amightyhand.",
            "citation": "(Exodus 3:19)"
          },
          "20": {
            "text": "And I will stretch out my hand, and smite Egypt with all mywonderswhich I will do in the midst thereof: and after that he will let yougo.",
            "citation": "(Exodus 3:20)"
          },
          "21": {
            "text": "And I will give this people favour in the sight of the Egyptians: and it shall come to pass, that, when ye go, ye shall not goempty:",
            "citation": "(Exodus 3:21)"
          },
          "22": {
            "text": "But every woman shallborrowof her neighbour, and of her that sojourneth in her house, jewels of silver, and jewels of gold, and raiment: and ye shall putthemupon your sons, and upon your daughters; and ye shallspoilthe Egyptians.",
            "citation": "(Exodus 3:22)"
          }
        }
      },
      "4": {
        "verses": {
          "1": {
            "text": "And Moses answered and said, But, behold, they will notbelieveme, norhearkenunto my voice: for they will say, TheLordhath not appeared unto thee.",
            "citation": "(Exodus 4:1)"
          },
          "2": {
            "text": "And theLordsaid unto him, Whatisthat in thine hand? And he said, A rod.",
            "citation": "(Exodus 4:2)"
          },
          "3": {
            "text": "And he said, Cast it on the ground. And he cast it on the ground, and it became serpent; and Moses fled from before it.",
            "citation": "(Exodus 4:3)"
          },
          "4": {
            "text": "And theLordsaid unto Moses, Put forth thine hand, and take it by the tail. And he put forth his hand, and caught it, and it became rod in his hand:",
            "citation": "(Exodus 4:4)"
          },
          "5": {
            "text": "That they may believe that theLordGod of their fathers, the God of Abraham, the God of Isaac, and the God of Jacob, hath appeared unto thee.",
            "citation": "(Exodus 4:5)"
          },
          "6": {
            "text": "And theLordsaid furthermore unto him, Put now thine hand into thy bosom. And he put his hand into his bosom: and when he took it out, behold, his handwasleprousas snow.",
            "citation": "(Exodus 4:6)"
          },
          "7": {
            "text": "And he said, Put thine hand into thy bosom again. And he put his hand into his bosom again; andpluckedit out of his bosom, and, behold, it wasturned again ashisotherflesh.",
            "citation": "(Exodus 4:7)"
          },
          "8": {
            "text": "And it shall come to pass, if they will not believe thee, neither hearken to the voice of the first sign, that they will believe the voice of the lattersign.",
            "citation": "(Exodus 4:8)"
          },
          "9": {
            "text": "And it shall come to pass, if they will not believe also these two signs,neither hearken unto thy voice, that thou shalt take of the water ofthe river, and pouritupon the dryland:and the water which thou takest out of the river shall becomebloodupon the dryland.",
            "citation": "(Exodus 4:9)"
          },
          "10": {
            "text": "And Moses said unto theLord, O my Lord, Iamnot eloquent, neither heretofore, nor since thou hast spoken unto thy servant: but Iamslow ofspeech, and of aslowtongue.",
            "citation": "(Exodus 4:10)"
          },
          "11": {
            "text": "And theLordsaid unto him, Who hath made mans mouth? or whomakeththe dumb, or deaf, or the seeing, or the blind? have not I theLord?",
            "citation": "(Exodus 4:11)"
          },
          "12": {
            "text": "Now therefore go, and I will be with thymouth, andteachthee what thou shaltsay.",
            "citation": "(Exodus 4:12)"
          },
          "13": {
            "text": "And he said, O my Lord, send, I pray thee,bythe handof him whomthou wilt send.",
            "citation": "(Exodus 4:13)"
          },
          "14": {
            "text": "And theangerof theLordwas kindled against Moses, and he said,Isnot Aaron the Levite thy brother? I know that he can speak well. And also, behold, he cometh forth to meet thee: and when he seeth thee, he will be glad in his heart.",
            "citation": "(Exodus 4:14)"
          },
          "15": {
            "text": "And thou shalt speak unto him, and put words in his mouth: and I will be with thymouth, and with his mouth, and willteachyou what ye shall do.",
            "citation": "(Exodus 4:15)"
          },
          "16": {
            "text": "And he shall be thyspokesmanunto the people: and he shall be,evenhe shall be to thee instead of mouth, and thou shalt be to himinsteadofGod.",
            "citation": "(Exodus 4:16)"
          },
          "17": {
            "text": "And thou shalt take thisrodin thine hand, wherewith thou shalt do signs.",
            "citation": "(Exodus 4:17)"
          },
          "18": {
            "text": "And Moses went and returned toJethrohis father in law, and said unto him, Let me go, I pray thee, and return unto my brethren whicharein Egypt, and see whether they be yet alive. And Jethro said to Moses, Go in peace.",
            "citation": "(Exodus 4:18)"
          },
          "19": {
            "text": "And theLordsaid unto Moses in Midian, Go, return into Egypt: for all the men aredeadwhich sought thylife.",
            "citation": "(Exodus 4:19)"
          },
          "20": {
            "text": "And Moses took his wife and his sons, and set them upon an ass, and he returned to the land of Egypt: and Moses took therodof God in his hand.",
            "citation": "(Exodus 4:20)"
          },
          "21": {
            "text": "And theLordsaid unto Moses, When thou goest to return into Egypt, see that thou do all thosewondersbefore Pharaoh, which I have put in thinehand:butI willhardenhis heart, that he shall not let the people go.",
            "citation": "(Exodus 4:21)"
          },
          "22": {
            "text": "And thou shalt say unto Pharaoh, Thus saith theLord,Israelismyson,evenmyfirstborn:",
            "citation": "(Exodus 4:22)"
          },
          "23": {
            "text": "And I say unto thee, Let my son go, that he may serve me: and if thou refuse to let him go, behold, I will slay thyson,eventhy firstborn.",
            "citation": "(Exodus 4:23)"
          },
          "24": {
            "text": "Andit came to passbythe way in the inn, that theLordmet him, and sought tokillhim.",
            "citation": "(Exodus 4:24)"
          },
          "25": {
            "text": "Then Zipporah took asharp stone, and cut off the foreskin of her son, and castitat his feet, and said,Surely abloody husbandartthou to me.",
            "citation": "(Exodus 4:25)"
          },
          "26": {
            "text": "So he let him go: then she said, A bloody husbandthou art,because of thecircumcision.",
            "citation": "(Exodus 4:26)"
          },
          "27": {
            "text": "And theLordsaid to Aaron, Go into the wilderness to meet Moses. And he went, and met him in themount of God, and kissed him.",
            "citation": "(Exodus 4:27)"
          },
          "28": {
            "text": "And Moses told Aaron all the words of theLordwho had sent him, and all the signs which he had commanded him.",
            "citation": "(Exodus 4:28)"
          },
          "29": {
            "text": "And Moses and Aaron went and gathered together all theeldersof the children of Israel:",
            "citation": "(Exodus 4:29)"
          },
          "30": {
            "text": "And Aaronspakeall the words which theLordhad spoken unto Moses, and did the signs in the sight of the people.",
            "citation": "(Exodus 4:30)"
          },
          "31": {
            "text": "And the peoplebelieved: and when they heard that theLordhadvisitedthe children of Israel, and that he had looked upon theiraffliction, then theybowedtheir heads and worshipped.",
            "citation": "(Exodus 4:31)"
          }
        }
      },
      "5": {
        "verses": {
          "1": {
            "text": "And afterward Moses and Aaron went in, and told Pharaoh, Thus saith theLordGod of Israel,Letmy peoplego, that they may hold afeastunto me in the wilderness.",
            "citation": "(Exodus 5:1)"
          },
          "2": {
            "text": "And Pharaoh said, WhoistheLord, that I shouldobeyhis voice to let Israel go? Iknow nottheLord, neither will I let Israel go.",
            "citation": "(Exodus 5:2)"
          },
          "3": {
            "text": "And they said, TheGodof the Hebrews hath met with us: let us go, we pray thee, three days journey into the desert, and sacrifice unto theLordour God; lest he fall upon us with pestilence, or with the sword.",
            "citation": "(Exodus 5:3)"
          },
          "4": {
            "text": "And the king of Egypt said unto them, Wherefore do ye, Moses and Aaron,letthe people from their works? get you unto yourburdens.",
            "citation": "(Exodus 5:4)"
          },
          "5": {
            "text": "And Pharaoh said, Behold, the people of the land nowaremany, and ye make them rest from their burdens.",
            "citation": "(Exodus 5:5)"
          },
          "6": {
            "text": "And Pharaoh commanded the same day the taskmasters of the people, and their officers, saying,",
            "citation": "(Exodus 5:6)"
          },
          "7": {
            "text": "Ye shall no more give the people straw to make brick, as heretofore: let them go and gather straw for themselves.",
            "citation": "(Exodus 5:7)"
          },
          "8": {
            "text": "And thetaleof the bricks, which they did make heretofore, ye shall lay upon them; ye shall not diminishoughtthereof: for theybeidle; therefore they cry, saying, Let us goandsacrifice to our God.",
            "citation": "(Exodus 5:8)"
          },
          "9": {
            "text": "Let there more work be laid upon the men, that they may labour therein; and let them not regard vain words.",
            "citation": "(Exodus 5:9)"
          },
          "10": {
            "text": "And the taskmasters of the people went out, and their officers, and they spake to the people, saying, Thus saith Pharaoh, I will not give you straw.",
            "citation": "(Exodus 5:10)"
          },
          "11": {
            "text": "Go ye, get you straw where ye can find it: yetnot ought ofyour work shall be diminished.",
            "citation": "(Exodus 5:11)"
          },
          "12": {
            "text": "So the people were scattered abroad throughout all the land of Egypt to gather stubble instead of straw.",
            "citation": "(Exodus 5:12)"
          },
          "13": {
            "text": "And the taskmastershastedthem,saying, Fulfil your works,yourdaily tasks, as when there was straw.",
            "citation": "(Exodus 5:13)"
          },
          "14": {
            "text": "And the officers of the children of Israel, which Pharaohs taskmasters had set over them, were beaten,anddemanded, Whereforehave ye not fulfilled your task in making brick both yesterday and to day, as heretofore?",
            "citation": "(Exodus 5:14)"
          },
          "15": {
            "text": "Then the officers of the children of Israel came and cried unto Pharaoh, saying, Wherefore dealest thou thus with thy servants?",
            "citation": "(Exodus 5:15)"
          },
          "16": {
            "text": "There is no straw given unto thy servants, and they say to us, Make brick: and, behold, thy servantsarebeaten; but the faultisin thine own people.",
            "citation": "(Exodus 5:16)"
          },
          "17": {
            "text": "But he said, Yeareidle,ye areidle: therefore ye say, Let us goanddo sacrifice to theLord.",
            "citation": "(Exodus 5:17)"
          },
          "18": {
            "text": "Go therefore now,andwork; for there shall no straw be given you, yet shall ye deliver the tale of bricks.",
            "citation": "(Exodus 5:18)"
          },
          "19": {
            "text": "And the officers of the children of Israel did seethattheywerein evilcase,after it was said, Ye shall not minishoughtfrom your bricks of your daily task.",
            "citation": "(Exodus 5:19)"
          },
          "20": {
            "text": "And they met Moses and Aaron, who stood in the way, as they came forth from Pharaoh:",
            "citation": "(Exodus 5:20)"
          },
          "21": {
            "text": "And they said unto them, TheLordlook upon you, and judge; because ye have madeoursavour to beabhorredin the eyes of Pharaoh, and in the eyes of his servants, to put sword in their hand to slay us.",
            "citation": "(Exodus 5:21)"
          },
          "22": {
            "text": "And Mosesreturnedunto theLord, and said, Lord, wherefore hast thousoevil entreatedthis people? whyisitthatthou hast sent me?",
            "citation": "(Exodus 5:22)"
          },
          "23": {
            "text": "For since I came to Pharaoh to speak in thy name, he hath done evil to this people; neither hast thou delivered thy people at all.",
            "citation": "(Exodus 5:23)"
          }
        }
      },
      "6": {
        "verses": {
          "1": {
            "text": "Then theLordsaid unto Moses, Now shalt thou see what I will do to Pharaoh: forwith strong handshall he let them go, and with astronghand shall hedrivethem out of his land.",
            "citation": "(Exodus 6:1)"
          },
          "2": {
            "text": "And God spake unto Moses, and said unto him, IamtheLord:",
            "citation": "(Exodus 6:2)"
          },
          "3": {
            "text": "And IappeareduntoAbraham, unto Isaac,andunto Jacob, bythe name ofGod Almighty, but by mynameJehovahwas I not known to them.",
            "citation": "(Exodus 6:3)"
          },
          "4": {
            "text": "And I have also established mycovenantwith them, to give them the land of Canaan, the land of theirpilgrimage, wherein they werestrangers.",
            "citation": "(Exodus 6:4)"
          },
          "5": {
            "text": "And I have alsoheardthe groaning of the children of Israel, whom the Egyptians keep inbondage; and I have remembered my covenant.",
            "citation": "(Exodus 6:5)"
          },
          "6": {
            "text": "Wherefore say unto the children of Israel, IamtheLord, and I willbringyou out from under theburdensof the Egyptians, and I willridyou out of their bondage, and I will redeem you with stretched out arm, and with great judgments:",
            "citation": "(Exodus 6:6)"
          },
          "7": {
            "text": "And I will take you to me for apeople, and I will be to you aGod: and ye shallknowthat IamtheLordyour God, which bringeth you out from under the burdens of the Egyptians.",
            "citation": "(Exodus 6:7)"
          },
          "8": {
            "text": "And I will bring you in unto the land, concerning the which Ididswearto give it to Abraham, to Isaac, and to Jacob; and I will give it you for an heritage: IamtheLord.",
            "citation": "(Exodus 6:8)"
          },
          "9": {
            "text": "And Moses spake so unto the children of Israel: but they hearkened not unto Moses for anguish of spirit, and forcruelbondage.",
            "citation": "(Exodus 6:9)"
          },
          "10": {
            "text": "And theLordspake unto Moses, saying,",
            "citation": "(Exodus 6:10)"
          },
          "11": {
            "text": "Go in, speak unto Pharaoh king of Egypt, that he let the children of Israel go out of his land.",
            "citation": "(Exodus 6:11)"
          },
          "12": {
            "text": "And Moses spake before theLord, saying, Behold, the children of Israel have not hearkened unto me; how then shall Pharaoh hear me, whoamof uncircumcised lips?",
            "citation": "(Exodus 6:12)"
          },
          "13": {
            "text": "And theLordspake unto Moses and unto Aaron, and gave them achargeunto the children of Israel, and unto Pharaoh king of Egypt, to bring the children of Israel out of the land of Egypt.",
            "citation": "(Exodus 6:13)"
          },
          "14": {
            "text": "Thesebetheheadsof their fathers houses: The sons of Reuben the firstborn of Israel; Hanoch, and Pallu, Hezron, and Carmi: thesebethe families of Reuben.",
            "citation": "(Exodus 6:14)"
          },
          "15": {
            "text": "And the sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Shaul the son of Canaanitish woman: thesearethe families of Simeon.",
            "citation": "(Exodus 6:15)"
          },
          "16": {
            "text": "And thesearethe names of the sons ofLeviaccording to their generations; Gershon, and Kohath, and Merari: and the years of the life of Leviwerean hundred thirty and seven years.",
            "citation": "(Exodus 6:16)"
          },
          "17": {
            "text": "The sons ofGershon; Libni, and Shimi, according to their families.",
            "citation": "(Exodus 6:17)"
          },
          "18": {
            "text": "And the sons of Kohath; Amram, and Izhar, and Hebron, and Uzziel: and the years of the life of Kohathwerean hundred thirty and three years.",
            "citation": "(Exodus 6:18)"
          },
          "19": {
            "text": "And the sons ofMerari; Mahali and Mushi: thesearethefamiliesof Levi according to their generations.",
            "citation": "(Exodus 6:19)"
          },
          "20": {
            "text": "AndAmramtook him Jochebed his fathers sister to wife; and she bare himAaronand Moses: and the years of the life of Amramwerean hundred and thirty and seven years.",
            "citation": "(Exodus 6:20)"
          },
          "21": {
            "text": "And the sons of Izhar; Korah, and Nepheg, and Zichri.",
            "citation": "(Exodus 6:21)"
          },
          "22": {
            "text": "And the sons ofUzziel; Mishael, and Elzaphan, and Zithri.",
            "citation": "(Exodus 6:22)"
          },
          "23": {
            "text": "And Aaron took him Elisheba, daughter of Amminadab, sister of Naashon, to wife; and she bare himNadab, and Abihu, Eleazar, andIthamar.",
            "citation": "(Exodus 6:23)"
          },
          "24": {
            "text": "And the sons of Korah; Assir, and Elkanah, and Abiasaph: thesearethe families of the Korhites.",
            "citation": "(Exodus 6:24)"
          },
          "25": {
            "text": "AndEleazarAarons son took himoneof the daughters of Putiel to wife; and she bare him Phinehas: thesearethe heads of the fathers of the Levites according to their families.",
            "citation": "(Exodus 6:25)"
          },
          "26": {
            "text": "Thesearethat Aaron and Moses, to whom theLordsaid, Bring out the children of Israel from the land of Egypt according to their armies.",
            "citation": "(Exodus 6:26)"
          },
          "27": {
            "text": "Thesearethey which spake to Pharaoh king of Egypt, to bring out the children of Israel from Egypt: thesearethat Moses and Aaron.",
            "citation": "(Exodus 6:27)"
          },
          "28": {
            "text": "And it came to pass on the daywhentheLordspake unto Moses in the land of Egypt,",
            "citation": "(Exodus 6:28)"
          },
          "29": {
            "text": "That theLordspake unto Moses, saying, IamtheLord: speak thou unto Pharaoh king of Egypt all that I say unto thee.",
            "citation": "(Exodus 6:29)"
          },
          "30": {
            "text": "And Moses said before theLord, Behold, Iamof uncircumcised lips, and how shall Pharaoh hearken unto me?",
            "citation": "(Exodus 6:30)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 50853,
  "total_sources": 8,
  "generated_at": "2025-12-14T04:01:27.375164"
}