{
  "week_number": 28,
  "date_range": "Kings 2–7",
  "title": "2",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: 2 ---\nA prophet’s main mission is to teach and testify of the Savior Jesus Christ. Our record of the prophet Elisha, however, doesn’t include much of his teaching or testifying. What the record does include is the miracles Elisha performed, including raising a child from the dead (see\n2 Kings 4:18–37\n), feeding a multitude with just a little food (see\n2 Kings 4:42–44\n), and healing a leper (see\n2 Kings 5:1–14\n). So while we don’t have Elisha’s words about Christ, we do have Elisha’s ministry and miracles, which do testify of Christ. They are powerful manifestations of the Lord’s life-giving, nourishing, and healing power. Miracles happen more often in our lives than we sometimes realize. To see them, we need to seek the faith Elisha had when he prayed on behalf of his fearful young servant: “Lord, I pray thee, open his eyes, that he may see” (\n2 Kings 6:17\n).\nFor more information about 2 Kings, see “\nKings, books of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n2 Kings 2–6\nGod can work miracles in my life.\nMiracles show us God’s power. They can help us overcome the difficulties of mortality—like a barren land that needs pure water (see\n2 Kings 2:19–22\n) or a lost ax that needs to be recovered (see\n2 Kings 6:4–7\n). But most importantly, miracles can turn us to the Lord. As you read\n2 Kings 2–6\n, consider listing the miracles you find, and ponder the spiritual lessons you learn from each one.\nYou might also compare the miracles Elisha performed with miracles that Jesus Christ performed (see\n2 Kings 4:8–37\nand\nLuke 7:11–16\n;\n2 Kings 4:42–44\nand\nJohn 6:1–13\n;\n2 Kings 5:1–15\nand\nLuke 17:11–19\n). What do these miracles teach you about the Savior and His prophets?\nSee also\n2 Nephi 26:12–13\n;\n27:23\n;\nMoroni 7:35–37\n; the section “\nSeek and expect miracles\n” in Russell M. Nelson, “\nThe Power of Spiritual Momentum\n,”\nLiahona\n, May 2022, 99–100.\nElisha Raising the Son of the Shunamite\n, by Frederic Leighton\n2 Kings 4:8–17\n;\n7:1–16\nThe Lord will fulfill His words given through His prophets.\nThe Lord inspired Elisha to prophesy of things to come—usually, things that seemed unlikely to occur. As you read\n2 Kings 4:8–17\n;\n7:1–16\n, think about how you respond to the word of the Lord through His prophets today. What teachings, prophecies, or promises have you heard from living prophets? What are you doing to act in faith on their words?\nSee also\n3 Nephi 29:6\n;\nDoctrine and Covenants 1:37–38\n; “\nTeachings of Presidents” collection\n, Gospel Library.\n2 Kings 5\nAs I am humble and obedient, Jesus Christ can heal me.\nAs you read\n2 Kings 5\n, consider comparing Naaman’s leprosy with a spiritual challenge you are facing.\nIs there someone like the “little maid” in your life, encouraging you to seek guidance about your challenge from the Lord’s prophets? (see\nverses 2–3, 13\n).\nWhat is the Lord inviting you to do that might seem too simple—like “wash, and be clean”? (\nverse 13\n). What might be keeping you from accepting His simple invitations?\nHow can you show humility as Naaman did?\nNote how Naaman’s experience affected his faith in the God of Israel (see\nverse 15\n). What can you learn from this?\nSee also\nLuke 4:27\n;\n1 Peter 5:5–7\n;\nAlma 37:3–7\n;\nEther 12:27\n; L. Whitney Clayton, “\nWhatsoever He Saith unto You, Do It\n,”\nEnsign\nor\nLiahona\n, May 2017, 97–99; “Naaman and Elisha” (video), Gospel Library.\n14:30\nNaaman and Elisha\nCompare the scriptures to your life.\nSometimes it’s easier to find personal meaning in the scriptures when you compare physical things in a story with spiritual things in your life. For example, while you study\n2 Kings 2–7\n, you could compare situations in your life to things like leprosy, a borrowed ax, the Jordan River, or a large invading army. What lessons might the Lord have for you in these accounts?\n2 Kings 6:8–23\n“They that be with us are more than they that be with them.”\nAs you try to follow Christ, have you ever felt like Elisha’s young servant—outnumbered and fearful? Imagine you were in his place as you read\n2 Kings 6:8–23\n. How does this story change the way you think and feel about your trials, your responsibilities, or your efforts to live the gospel?\nAs you ponder, consider President Henry B. Eyring’s words: “Like that servant of Elisha, there are more with you than those you can see opposed to you. Some who are with you will be invisible to your mortal eyes. The Lord will bear you up and will at times do it by calling others to stand with you” (“\nO Ye That Embark\n,”\nEnsign\nor\nLiahona\n, Nov. 2008, 58).\nConsider making a list of “they that be with [you]” (\nverse 16\n)—people God has placed in your life to support you. You might ask Him to help you identify them by opening your spiritual eyes. He has probably also placed you in others’ lives to help them. How can you draw strength and support from each other?\nWhen have you felt the support that the Lord describes in\nDoctrine and Covenants 84:88\n?\nYou might also study Sister Michelle D. Craig’s message “\nEyes to See\n” (\nEnsign\nor\nLiahona\n, Nov. 2020, 15–17). Ask yourself, “What does God want me to see?”\nReferring to the story in\n2 Kings 6:8–23\n, Elder Ronald A. Rasband said: “We may or may not have chariots of fire sent to dispel our fears and conquer our demons, but the lesson is clear. The Lord is with us, mindful of us and blessing us in ways only He can do. Prayer can call down the strength and the revelation that we need to center our thoughts on Jesus Christ and His atoning sacrifice. The Lord knew that at times we would feel fear. I have been there and so have you. … In this Church we may be few in number by the way the world counts influence, but when we open our spiritual eyes, ‘they that be with us are more than they that be with them’ [\n2 Kings 6:16\n]” (“\nBe Not Troubled\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 18, 19). How would you use these words to help someone who feels anxious or afraid?\nSee also “\nDearest Children, God Is Near You\n,”\nHymns\n, no. 96.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n2 Kings 4\nGod can work miracles in my life.\nAfter helping your children understand what a miracle is, invite them to list as many examples of miracles as they can. Pictures in the\nGospel Art Book\nor\nCome, Follow Me\ncan help. Then they could look for miracles in\n2 Kings 4:1–7, 14–17, 32–35, 38–44\n. What do these miracles teach about Heavenly Father?\nYou and your children could talk about how God has shown His love through miracles. You could also sing together a song such as “God’s Gracious Love” (Gospel Library).\nStand as a Witness\n, by Kwani Povi Winder\n2 Kings 5:1–15\nI can choose to do what God commands through His prophet.\nHelp your children learn the story in\n2 Kings 5:1–3, 9–14\n. Consider using “\nElisha Heals Naaman\n” (in\nOld Testament Stories\n, 134–37) or the picture of Naaman in this week’s outline. Why didn’t Naaman want to wash in the Jordan River, even though Elisha said that this would heal his disease? How was Naaman blessed when he followed Elisha’s instructions? You might share with each other experiences when you obeyed the Lord, even when you weren’t sure you wanted to.\n1:52\nElisha Heals Naaman\nYou might also emphasize\n2 Kings 5:13\n, where Naaman’s servants helped him decide to obey the prophet Elisha. Your children could then talk about ways they can help their friends or family members listen to and obey the prophet.\n2 Kings 6:8–17\nI am not alone.\nYou and your children could imagine you are surrounded by an army with swords, horses, and chariots. How would you feel? What would you do? Your children could then close their eyes while you read\n2 Kings 6:16–17\nto them. (See also “\nElisha and the Lord’s Army\n,” in\nOld Testament Stories\n, 138–39, or the picture at the end of this outline.) When you get to the words “open his eyes” (\nverse 17\n), ask the children to open their eyes. Talk about what the servant saw. Share with your children ways you have felt that the Lord was with you during your challenges, even when it seemed like you were alone.\n1:9\nElisha and the Lord’s Army\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 28: Lesson 78: Lesson 78—1 Kings 3This lesson can help students understand that the Lord will bless us with the ability to accomplish His work.; Lesson 79: Lesson 79—1 Kings 6–9This lesson can help students deepen their understanding that the temple is the house of the Lord. ---\n\n--- Lesson 78 ---\nHave you ever considered how the blessings you receive from Heavenly Father help you accomplish His work? After the death of David, his father, Solomon was appointed by the Lord to be the new king of Israel. Wanting to honor the Lord, Solomon humbly sought blessings that would increase his ability to serve the Lord and the Israelites righteously. This lesson can help students understand that the Lord will bless us with the ability to accomplish His work. Student preparation: Invite students to write down something they are trying to do to participate in the work of Heavenly Father and Jesus Christ. Invite students to prayerfully ask Heavenly Father what blessings they need to help Him accomplish His work Possible Learning Activities Humbly recognizing our weaknesses To begin class, draw an image like the following on the board. Students could copy the drawing in their study journals. Then invite students to discuss the following questions: What are some ways the Savior has invited us to participate in His work? What are some ways a teenager might feel inadequate to serve the Lord? Consider inviting students to list, in the gap between the images, some ways a teenager might feel inadequate. Students might identify worries, such as anxiety, shyness, feeling overwhelmed or not qualified. Then invite students to ponder the following questions. Think about a few of the invitations the Lord has given you to participate in His work. What concerns do you have about your ability to accomplish His invitations? How confident do you feel in the Lord’s ability to help you overcome concerns you have? As you study today, invite the Holy Ghost to help you understand how the Lord will help you accomplish His work. King Solomon desires to reign righteously Share with students that when King David died, his son Solomon was chosen by the Lord to reign as king of Israel (see 1 Kings 1:11–13 ). Solomon loved the Lord and desired to be a righteous king (see 1 Kings 3:3 ). You could change the label of the stick figure on the board to Solomon and change the other side to Be a righteous king . How might a righteous king have been expected to act? How might Solomon have felt replacing his father as king? Consider displaying the following scripture passages and questions. You could organize students into partnerships. Have one partner read 1 Kings 3:5–9 and the other read 1 Kings 3:10–14 , then share their answers with each other. Read 1 Kings 3:5–9 , looking for blessings Solomon requested of the Lord. What impresses you about Solomon’s request? What Christlike attributes does Solomon demonstrate? Read 1 Kings 3:10–14 , looking for blessings the Lord promised Solomon. How could a “wise and understanding heart” ( verse 12 ) and “riches and honor” ( verse 13 ) increase Solomon’s ability to serve the Lord righteously? What did the Lord require of Solomon to qualify for these blessings? ( verse 14 ). Summarize Solomon’s experience with the Lord as a statement of truth. Students might identify a truth such as: As we humbly recognize our weakness and seek the Lord’s help to bless others, He will increase our ability to accomplish His work. It might be helpful to write this truth on the board and invite students to mark the phrases that teach this truth. Read the following statement from President Thomas S. Monson (1927–2018), looking for the promise given to all who are willing to participate in the Lord’s work. Now, some of you may be shy by nature or consider yourselves inadequate to respond affirmatively to [the Lord]. Remember that this work is not yours and mine alone. It is the Lord’s work, and when we are on the Lord’s errand, we are entitled to the Lord’s help. Remember that the Lord will shape the back to bear the burden placed upon it. (“ To Learn, to Do, to Be ,” Ensign or Liahona , Nov. 2008, 62) How might President Monson’s teachings help someone who was worried about their ability to serve the Lord? You could draw a bridge between each side of the image on the board and label it The Lord’s help . Invite students to draw something similar in their study journals. The Lord increases our ability to serve Him You might want to help students deepen their understanding of this truth. One way to do this would be to use the handout “Participate in the Work of the Lord.” You could cut the handout in half and invite students to select the section that focuses on the part of the truth they would like to learn more about. Students could work individually or with two or three others who selected the same section. Open PDF After the study activity, invite students to respond to the following invitation. Refer to the drawing in your study journal from the beginning of class. Prayerfully write down one or two weaknesses you feel could be keeping you from better serving Heavenly Father and Jesus Christ. Invite the Holy Ghost to help you recognize blessings you could seek from the Lord that could help you overcome these weaknesses. Demonstrate understanding Provide an opportunity for students to share what they have learned. This can invite the Holy Ghost to testify that what they are sharing is true. The following activity is one way to help students do this. Imagine a friend shares her anxiety about receiving a new calling in your ward or branch. From what you studied today, what would you share that could help your friend? You might invite volunteers to share with the class. Consider encouraging students to take their handout home and share what they learned with a family member or friend. You could testify of the Lord’s power and willingness to bless us with what we need to faithfully labor with Him in this great work.\n\n\n--- Lesson 79 ---\nIn our day, the temple is becoming more accessible around the world, but it has not always been that way. With the construction of Solomon’s temple, the Israelites finally had a permanent house of the Lord, a place where the Savior Himself would “dwell among the children of Israel” ( 1 Kings 6:13 ). The Savior’s promise is also being fulfilled in our day as temples dot the earth. This lesson can help students deepen their understanding that the temple is the house of the Lord. Student preparation: Invite students to bring a picture of a nearby or favorite temple. They could prepare to share why the temple is meaningful to them. Possible Learning Activities The temple is the house of the Lord To begin class, invite students to respond to the following scenario (or something similar that fits the needs of your class). Imagine your friend Angela sees a picture of a new temple being built in your area and asks: Why does your Church build temples? How is a temple different from your other church buildings? Consider asking students to consider how confident they feel about answering Angela’s questions. You might invite a couple of students to share how they feel. After the dedication of the Praia Cape Verde Temple, Elder Neil L. Andersen of the Quorum of the Twelve Apostles taught: The temple is literally the house of the Lord. Let those words sink gently into your soul. It is His house. (“ The House of the Lord—Recent Messages from Prophets, Apostles, and Other Church Leaders ”, newsroom.ChurchofJesusChrist.org , Aug. 13, 2023) Invite students to write this truth in their study journals and on the board: The temple is the house of the Lord . Take a moment to follow Elder Andersen’s invitation to let this truth sink gently into your soul as you respond to the following question in your study journal. What does it mean to you that the temple is the house of the Lord? As you study today, invite the Holy Ghost to help deepen your understanding of the temple as the Lord’s house. Throughout the lesson, add what you are learning to your study journal. It might be helpful to reassure students that although their specific questions about the temple may not be answered today, the Holy Ghost will continue to inspire and direct their efforts to learn more about the Lord’s house. The Lord commands His people to build His house At Mount Sinai, the Lord commanded the people to build a portable, temporary tabernacle to bless the children of Israel (see Exodus 25:1–8 ). Many generations later, at the time of King Solomon, a permanent temple still had not been built. To help students see similarities in the Lord’s command to build His house at the time of 1 Kings 6–9 and in our day, you could display images of Solomon’s temple and the nearest modern-day temple. One way to help students see these similarities between temples anciently and in our day would be to display the following chart. There are three suggested chart activities in the lesson. You might consider some variety in how students will study each chart. For this first chart activity, consider inviting half the class to study the verses in the “Solomon’s Day” column and the other half to study the verses in the “Our Day” column. After studying the verses, students could share what they found with a partner who studied the verses from the opposite column. Another way to organize the activity would be to divide students into three groups and give each group a chart. Students could study together and select a spokesperson to present their group’s section to the class. At the end of the presentation, each group could share how the topics they studied could help answer Angela’s questions. As you study the following verses, look for teachings that could help you explain the Lord’s promises for temples anciently and today. Add what you find to your study journal entry. Solomon’s Day Our Day Solomon’s Day 2 Samuel 7:4–6 1 Chronicles 22:5–11 1 Kings 5:5 ; 6:1 Our Day Doctrine and Covenants 88:119–120 Doctrine and Covenants 97:10–16 What did you learn about the importance of temples today? To help students reflect on how we continue to follow the Savior’s instruction to build temples today, consider showing a video of the current prophet announcing new temples during general conference. Alternatively, you could share some of the latest temple statistics, available at Temple List at ChurchofJesusChrist.org . Temples are dedicated to the Lord as His house After seven years of construction, Solomon’s temple was finished and dedicated. To help students understand that temple dedicatory prayers are received by revelation and preserved in the records of the Church, consider sharing an example of a dedicatory prayer with the class. The dedicatory prayer for each operating temple can be found by selecting the temple from Temple List at ChurchofJesusChrist.org . For this chart activity, you could display the verses and invite students to study the opposite half of the chart they studied previously and share with a partner who studied the other half. A discussion question is provided to help students share what they discover. Read the following passages from the dedicatory prayers of Solomon’s Temple and the Kirtland Temple looking for the blessings Solomon and the Prophet Joseph Smith sought from the Lord. Solomon’s Day Our Day Solomon’s Day 1 Kings 8:29–30, 35–40 Our Day Doctrine and Covenants 109:10–18 What could similar blessings look like today as we prepare for and worship in the house of the Lord? You could explain that following the dedication of the house of the Lord, the people experienced remarkable manifestations of His power. This chart could be a reverent moment for students to study individually, as appropriate. As you read the following passages, invite the Holy Ghost to help you imagine what it might have felt like to witness these events. Solomon’s Day Our Day Solomon’s Day 1 Kings 9:1–3 2 Chronicles 7:1–3 Our Day Doctrine and Covenants 110:2–10 What experiences have you or someone you know had participating in a temple dedication? How have you felt the Savior’s power from having His house on the earth today? It might be appropriate to explain that since the dedication of the Kirtland Temple, the hymn “ The Spirit of God ” has been sung at every temple dedication around the world. Students could sing or listen to this hymn, looking for what we learn about the Lord and His house. You might watch a video of a choir or group singing such as “ The Spirit of God ” (5:32) from ChurchofJesusChrist.org . 5:32 Demonstrate understanding To help students demonstrate understanding, you could display Angela’s questions from the beginning of the lesson. Think about how the lessons you learned today could help someone like Angela better understand the purpose of temples. Answer the questions with a partner or in your study journal. Why does your church build temples? How is a temple different from your other church buildings? Invite students to practice teaching a partner what they have learned from their study of Solomon’s temple and temples today. The student preparation for this lesson suggested that students might bring a picture of a nearby or favorite temple to class. If students brought a picture, you could invite them to show it to the class and share why that temple is meaningful to them. You could share your feelings about the Savior and His house at the conclusion of class.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "2",
      "content": "A prophet’s main mission is to teach and testify of the Savior Jesus Christ. Our record of the prophet Elisha, however, doesn’t include much of his teaching or testifying. What the record does include is the miracles Elisha performed, including raising a child from the dead (see\n2 Kings 4:18–37\n), feeding a multitude with just a little food (see\n2 Kings 4:42–44\n), and healing a leper (see\n2 Kings 5:1–14\n). So while we don’t have Elisha’s words about Christ, we do have Elisha’s ministry and miracles, which do testify of Christ. They are powerful manifestations of the Lord’s life-giving, nourishing, and healing power. Miracles happen more often in our lives than we sometimes realize. To see them, we need to seek the faith Elisha had when he prayed on behalf of his fearful young servant: “Lord, I pray thee, open his eyes, that he may see” (\n2 Kings 6:17\n).\nFor more information about 2 Kings, see “\nKings, books of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n2 Kings 2–6\nGod can work miracles in my life.\nMiracles show us God’s power. They can help us overcome the difficulties of mortality—like a barren land that needs pure water (see\n2 Kings 2:19–22\n) or a lost ax that needs to be recovered (see\n2 Kings 6:4–7\n). But most importantly, miracles can turn us to the Lord. As you read\n2 Kings 2–6\n, consider listing the miracles you find, and ponder the spiritual lessons you learn from each one.\nYou might also compare the miracles Elisha performed with miracles that Jesus Christ performed (see\n2 Kings 4:8–37\nand\nLuke 7:11–16\n;\n2 Kings 4:42–44\nand\nJohn 6:1–13\n;\n2 Kings 5:1–15\nand\nLuke 17:11–19\n). What do these miracles teach you about the Savior and His prophets?\nSee also\n2 Nephi 26:12–13\n;\n27:23\n;\nMoroni 7:35–37\n; the section “\nSeek and expect miracles\n” in Russell M. Nelson, “\nThe Power of Spiritual Momentum\n,”\nLiahona\n, May 2022, 99–100.\nElisha Raising the Son of the Shunamite\n, by Frederic Leighton\n2 Kings 4:8–17\n;\n7:1–16\nThe Lord will fulfill His words given through His prophets.\nThe Lord inspired Elisha to prophesy of things to come—usually, things that seemed unlikely to occur. As you read\n2 Kings 4:8–17\n;\n7:1–16\n, think about how you respond to the word of the Lord through His prophets today. What teachings, prophecies, or promises have you heard from living prophets? What are you doing to act in faith on their words?\nSee also\n3 Nephi 29:6\n;\nDoctrine and Covenants 1:37–38\n; “\nTeachings of Presidents” collection\n, Gospel Library.\n2 Kings 5\nAs I am humble and obedient, Jesus Christ can heal me.\nAs you read\n2 Kings 5\n, consider comparing Naaman’s leprosy with a spiritual challenge you are facing.\nIs there someone like the “little maid” in your life, encouraging you to seek guidance about your challenge from the Lord’s prophets? (see\nverses 2–3, 13\n).\nWhat is the Lord inviting you to do that might seem too simple—like “wash, and be clean”? (\nverse 13\n). What might be keeping you from accepting His simple invitations?\nHow can you show humility as Naaman did?\nNote how Naaman’s experience affected his faith in the God of Israel (see\nverse 15\n). What can you learn from this?\nSee also\nLuke 4:27\n;\n1 Peter 5:5–7\n;\nAlma 37:3–7\n;\nEther 12:27\n; L. Whitney Clayton, “\nWhatsoever He Saith unto You, Do It\n,”\nEnsign\nor\nLiahona\n, May 2017, 97–99; “Naaman and Elisha” (video), Gospel Library.\n14:30\nNaaman and Elisha\nCompare the scriptures to your life.\nSometimes it’s easier to find personal meaning in the scriptures when you compare physical things in a story with spiritual things in your life. For example, while you study\n2 Kings 2–7\n, you could compare situations in your life to things like leprosy, a borrowed ax, the Jordan River, or a large invading army. What lessons might the Lord have for you in these accounts?\n2 Kings 6:8–23\n“They that be with us are more than they that be with them.”\nAs you try to follow Christ, have you ever felt like Elisha’s young servant—outnumbered and fearful? Imagine you were in his place as you read\n2 Kings 6:8–23\n. How does this story change the way you think and feel about your trials, your responsibilities, or your efforts to live the gospel?\nAs you ponder, consider President Henry B. Eyring’s words: “Like that servant of Elisha, there are more with you than those you can see opposed to you. Some who are with you will be invisible to your mortal eyes. The Lord will bear you up and will at times do it by calling others to stand with you” (“\nO Ye That Embark\n,”\nEnsign\nor\nLiahona\n, Nov. 2008, 58).\nConsider making a list of “they that be with [you]” (\nverse 16\n)—people God has placed in your life to support you. You might ask Him to help you identify them by opening your spiritual eyes. He has probably also placed you in others’ lives to help them. How can you draw strength and support from each other?\nWhen have you felt the support that the Lord describes in\nDoctrine and Covenants 84:88\n?\nYou might also study Sister Michelle D. Craig’s message “\nEyes to See\n” (\nEnsign\nor\nLiahona\n, Nov. 2020, 15–17). Ask yourself, “What does God want me to see?”\nReferring to the story in\n2 Kings 6:8–23\n, Elder Ronald A. Rasband said: “We may or may not have chariots of fire sent to dispel our fears and conquer our demons, but the lesson is clear. The Lord is with us, mindful of us and blessing us in ways only He can do. Prayer can call down the strength and the revelation that we need to center our thoughts on Jesus Christ and His atoning sacrifice. The Lord knew that at times we would feel fear. I have been there and so have you. … In this Church we may be few in number by the way the world counts influence, but when we open our spiritual eyes, ‘they that be with us are more than they that be with them’ [\n2 Kings 6:16\n]” (“\nBe Not Troubled\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 18, 19). How would you use these words to help someone who feels anxious or afraid?\nSee also “\nDearest Children, God Is Near You\n,”\nHymns\n, no. 96.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n2 Kings 4\nGod can work miracles in my life.\nAfter helping your children understand what a miracle is, invite them to list as many examples of miracles as they can. Pictures in the\nGospel Art Book\nor\nCome, Follow Me\ncan help. Then they could look for miracles in\n2 Kings 4:1–7, 14–17, 32–35, 38–44\n. What do these miracles teach about Heavenly Father?\nYou and your children could talk about how God has shown His love through miracles. You could also sing together a song such as “God’s Gracious Love” (Gospel Library).\nStand as a Witness\n, by Kwani Povi Winder\n2 Kings 5:1–15\nI can choose to do what God commands through His prophet.\nHelp your children learn the story in\n2 Kings 5:1–3, 9–14\n. Consider using “\nElisha Heals Naaman\n” (in\nOld Testament Stories\n, 134–37) or the picture of Naaman in this week’s outline. Why didn’t Naaman want to wash in the Jordan River, even though Elisha said that this would heal his disease? How was Naaman blessed when he followed Elisha’s instructions? You might share with each other experiences when you obeyed the Lord, even when you weren’t sure you wanted to.\n1:52\nElisha Heals Naaman\nYou might also emphasize\n2 Kings 5:13\n, where Naaman’s servants helped him decide to obey the prophet Elisha. Your children could then talk about ways they can help their friends or family members listen to and obey the prophet.\n2 Kings 6:8–17\nI am not alone.\nYou and your children could imagine you are surrounded by an army with swords, horses, and chariots. How would you feel? What would you do? Your children could then close their eyes while you read\n2 Kings 6:16–17\nto them. (See also “\nElisha and the Lord’s Army\n,” in\nOld Testament Stories\n, 138–39, or the picture at the end of this outline.) When you get to the words “open his eyes” (\nverse 17\n), ask the children to open their eyes. Talk about what the servant saw. Share with your children ways you have felt that the Lord was with you during your challenges, even when it seemed like you were alone.\n1:9\nElisha and the Lord’s Army\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 28: Lesson 78: Lesson 78—1 Kings 3This lesson can help students understand that the Lord will bless us with the ability to accomplish His work.; Lesson 79: Lesson 79—1 Kings 6–9This lesson can help students deepen their understanding that the temple is the house of the Lord.",
      "content": "\n--- Lesson 78 ---\nHave you ever considered how the blessings you receive from Heavenly Father help you accomplish His work? After the death of David, his father, Solomon was appointed by the Lord to be the new king of Israel. Wanting to honor the Lord, Solomon humbly sought blessings that would increase his ability to serve the Lord and the Israelites righteously. This lesson can help students understand that the Lord will bless us with the ability to accomplish His work. Student preparation: Invite students to write down something they are trying to do to participate in the work of Heavenly Father and Jesus Christ. Invite students to prayerfully ask Heavenly Father what blessings they need to help Him accomplish His work Possible Learning Activities Humbly recognizing our weaknesses To begin class, draw an image like the following on the board. Students could copy the drawing in their study journals. Then invite students to discuss the following questions: What are some ways the Savior has invited us to participate in His work? What are some ways a teenager might feel inadequate to serve the Lord? Consider inviting students to list, in the gap between the images, some ways a teenager might feel inadequate. Students might identify worries, such as anxiety, shyness, feeling overwhelmed or not qualified. Then invite students to ponder the following questions. Think about a few of the invitations the Lord has given you to participate in His work. What concerns do you have about your ability to accomplish His invitations? How confident do you feel in the Lord’s ability to help you overcome concerns you have? As you study today, invite the Holy Ghost to help you understand how the Lord will help you accomplish His work. King Solomon desires to reign righteously Share with students that when King David died, his son Solomon was chosen by the Lord to reign as king of Israel (see 1 Kings 1:11–13 ). Solomon loved the Lord and desired to be a righteous king (see 1 Kings 3:3 ). You could change the label of the stick figure on the board to Solomon and change the other side to Be a righteous king . How might a righteous king have been expected to act? How might Solomon have felt replacing his father as king? Consider displaying the following scripture passages and questions. You could organize students into partnerships. Have one partner read 1 Kings 3:5–9 and the other read 1 Kings 3:10–14 , then share their answers with each other. Read 1 Kings 3:5–9 , looking for blessings Solomon requested of the Lord. What impresses you about Solomon’s request? What Christlike attributes does Solomon demonstrate? Read 1 Kings 3:10–14 , looking for blessings the Lord promised Solomon. How could a “wise and understanding heart” ( verse 12 ) and “riches and honor” ( verse 13 ) increase Solomon’s ability to serve the Lord righteously? What did the Lord require of Solomon to qualify for these blessings? ( verse 14 ). Summarize Solomon’s experience with the Lord as a statement of truth. Students might identify a truth such as: As we humbly recognize our weakness and seek the Lord’s help to bless others, He will increase our ability to accomplish His work. It might be helpful to write this truth on the board and invite students to mark the phrases that teach this truth. Read the following statement from President Thomas S. Monson (1927–2018), looking for the promise given to all who are willing to participate in the Lord’s work. Now, some of you may be shy by nature or consider yourselves inadequate to respond affirmatively to [the Lord]. Remember that this work is not yours and mine alone. It is the Lord’s work, and when we are on the Lord’s errand, we are entitled to the Lord’s help. Remember that the Lord will shape the back to bear the burden placed upon it. (“ To Learn, to Do, to Be ,” Ensign or Liahona , Nov. 2008, 62) How might President Monson’s teachings help someone who was worried about their ability to serve the Lord? You could draw a bridge between each side of the image on the board and label it The Lord’s help . Invite students to draw something similar in their study journals. The Lord increases our ability to serve Him You might want to help students deepen their understanding of this truth. One way to do this would be to use the handout “Participate in the Work of the Lord.” You could cut the handout in half and invite students to select the section that focuses on the part of the truth they would like to learn more about. Students could work individually or with two or three others who selected the same section. Open PDF After the study activity, invite students to respond to the following invitation. Refer to the drawing in your study journal from the beginning of class. Prayerfully write down one or two weaknesses you feel could be keeping you from better serving Heavenly Father and Jesus Christ. Invite the Holy Ghost to help you recognize blessings you could seek from the Lord that could help you overcome these weaknesses. Demonstrate understanding Provide an opportunity for students to share what they have learned. This can invite the Holy Ghost to testify that what they are sharing is true. The following activity is one way to help students do this. Imagine a friend shares her anxiety about receiving a new calling in your ward or branch. From what you studied today, what would you share that could help your friend? You might invite volunteers to share with the class. Consider encouraging students to take their handout home and share what they learned with a family member or friend. You could testify of the Lord’s power and willingness to bless us with what we need to faithfully labor with Him in this great work.\n\n\n--- Lesson 79 ---\nIn our day, the temple is becoming more accessible around the world, but it has not always been that way. With the construction of Solomon’s temple, the Israelites finally had a permanent house of the Lord, a place where the Savior Himself would “dwell among the children of Israel” ( 1 Kings 6:13 ). The Savior’s promise is also being fulfilled in our day as temples dot the earth. This lesson can help students deepen their understanding that the temple is the house of the Lord. Student preparation: Invite students to bring a picture of a nearby or favorite temple. They could prepare to share why the temple is meaningful to them. Possible Learning Activities The temple is the house of the Lord To begin class, invite students to respond to the following scenario (or something similar that fits the needs of your class). Imagine your friend Angela sees a picture of a new temple being built in your area and asks: Why does your Church build temples? How is a temple different from your other church buildings? Consider asking students to consider how confident they feel about answering Angela’s questions. You might invite a couple of students to share how they feel. After the dedication of the Praia Cape Verde Temple, Elder Neil L. Andersen of the Quorum of the Twelve Apostles taught: The temple is literally the house of the Lord. Let those words sink gently into your soul. It is His house. (“ The House of the Lord—Recent Messages from Prophets, Apostles, and Other Church Leaders ”, newsroom.ChurchofJesusChrist.org , Aug. 13, 2023) Invite students to write this truth in their study journals and on the board: The temple is the house of the Lord . Take a moment to follow Elder Andersen’s invitation to let this truth sink gently into your soul as you respond to the following question in your study journal. What does it mean to you that the temple is the house of the Lord? As you study today, invite the Holy Ghost to help deepen your understanding of the temple as the Lord’s house. Throughout the lesson, add what you are learning to your study journal. It might be helpful to reassure students that although their specific questions about the temple may not be answered today, the Holy Ghost will continue to inspire and direct their efforts to learn more about the Lord’s house. The Lord commands His people to build His house At Mount Sinai, the Lord commanded the people to build a portable, temporary tabernacle to bless the children of Israel (see Exodus 25:1–8 ). Many generations later, at the time of King Solomon, a permanent temple still had not been built. To help students see similarities in the Lord’s command to build His house at the time of 1 Kings 6–9 and in our day, you could display images of Solomon’s temple and the nearest modern-day temple. One way to help students see these similarities between temples anciently and in our day would be to display the following chart. There are three suggested chart activities in the lesson. You might consider some variety in how students will study each chart. For this first chart activity, consider inviting half the class to study the verses in the “Solomon’s Day” column and the other half to study the verses in the “Our Day” column. After studying the verses, students could share what they found with a partner who studied the verses from the opposite column. Another way to organize the activity would be to divide students into three groups and give each group a chart. Students could study together and select a spokesperson to present their group’s section to the class. At the end of the presentation, each group could share how the topics they studied could help answer Angela’s questions. As you study the following verses, look for teachings that could help you explain the Lord’s promises for temples anciently and today. Add what you find to your study journal entry. Solomon’s Day Our Day Solomon’s Day 2 Samuel 7:4–6 1 Chronicles 22:5–11 1 Kings 5:5 ; 6:1 Our Day Doctrine and Covenants 88:119–120 Doctrine and Covenants 97:10–16 What did you learn about the importance of temples today? To help students reflect on how we continue to follow the Savior’s instruction to build temples today, consider showing a video of the current prophet announcing new temples during general conference. Alternatively, you could share some of the latest temple statistics, available at Temple List at ChurchofJesusChrist.org . Temples are dedicated to the Lord as His house After seven years of construction, Solomon’s temple was finished and dedicated. To help students understand that temple dedicatory prayers are received by revelation and preserved in the records of the Church, consider sharing an example of a dedicatory prayer with the class. The dedicatory prayer for each operating temple can be found by selecting the temple from Temple List at ChurchofJesusChrist.org . For this chart activity, you could display the verses and invite students to study the opposite half of the chart they studied previously and share with a partner who studied the other half. A discussion question is provided to help students share what they discover. Read the following passages from the dedicatory prayers of Solomon’s Temple and the Kirtland Temple looking for the blessings Solomon and the Prophet Joseph Smith sought from the Lord. Solomon’s Day Our Day Solomon’s Day 1 Kings 8:29–30, 35–40 Our Day Doctrine and Covenants 109:10–18 What could similar blessings look like today as we prepare for and worship in the house of the Lord? You could explain that following the dedication of the house of the Lord, the people experienced remarkable manifestations of His power. This chart could be a reverent moment for students to study individually, as appropriate. As you read the following passages, invite the Holy Ghost to help you imagine what it might have felt like to witness these events. Solomon’s Day Our Day Solomon’s Day 1 Kings 9:1–3 2 Chronicles 7:1–3 Our Day Doctrine and Covenants 110:2–10 What experiences have you or someone you know had participating in a temple dedication? How have you felt the Savior’s power from having His house on the earth today? It might be appropriate to explain that since the dedication of the Kirtland Temple, the hymn “ The Spirit of God ” has been sung at every temple dedication around the world. Students could sing or listen to this hymn, looking for what we learn about the Lord and His house. You might watch a video of a choir or group singing such as “ The Spirit of God ” (5:32) from ChurchofJesusChrist.org . 5:32 Demonstrate understanding To help students demonstrate understanding, you could display Angela’s questions from the beginning of the lesson. Think about how the lessons you learned today could help someone like Angela better understand the purpose of temples. Answer the questions with a partner or in your study journal. Why does your church build temples? How is a temple different from your other church buildings? Invite students to practice teaching a partner what they have learned from their study of Solomon’s temple and temples today. The student preparation for this lesson suggested that students might bring a picture of a nearby or favorite temple to class. If students brought a picture, you could invite them to show it to the class and share why that temple is meaningful to them. You could share your feelings about the Savior and His house at the conclusion of class.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 21667,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.386507"
}