{
  "week_number": 29,
  "date_range": "Kings 16–25",
  "title": "2",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: 2 ---\nDespite the prophet Elisha’s powerful ministry, the people of the Northern Kingdom of Israel did not repent. Eventually, the Assyrian Empire conquered and scattered the ten tribes of Israel. Meanwhile, the Southern Kingdom of Judah wasn’t doing much better: idolatry was also widespread there.\nAmid all this spiritual decay, the scriptures mention two kings of Judah who, for a time, turned their people back to the Lord. One was Hezekiah. During his reign, the Assyrians conquered much of Judah. But Hezekiah and his people showed faith in the Lord, who saved Jerusalem in a miraculous way. Later, after another period of apostasy, Josiah became king. Inspired in part by a rediscovery of the book of the law of Moses, Josiah brought reforms that revived the religious life of his people.\nLike Israel and Judah, we all make both good and bad choices. When we sense that our lives need some reforms, we can take encouragement from these two bright spots in the dark years of Judah’s history. Perhaps the examples of Hezekiah and Josiah can inspire us to “trust in the Lord our God” (\n2 Kings 18:22\n).\nIdeas for Learning at Home and at Church\n2 Kings 18–19\nI can stay true to the Lord when my faith is challenged.\nMost of us have experiences that challenge our faith. For Hezekiah and his people, one of those challenges came when the Assyrian army approached Jerusalem. As you read\n2 Kings 18–19\n, imagine that you lived in Jerusalem during this time. How might you have felt, for example, hearing the Assyrians’ taunts in\n2 Kings 18:28–37\n;\n19:10–13\n? What would you have done? Compare the Assyrians’ reasons for the Israelites not to trust the Lord with the reasons Satan gives for us to doubt our faith today. You could also contrast the Assyrians’ reasons with your reasons why you\ndo\ntrust the Lord.\nWhat do you learn from Hezekiah’s actions in this situation? (see\n2 Kings 19:1–7, 14–19\n). How did the Lord respond? (see\n2 Kings 19:35–37\n). Why do you think Hezekiah remained faithful? (see\n2 Kings 18:5–7\n). Ponder how the Lord has sustained you in challenging times. What do you feel inspired to do to increase your trust in Him?\nPresident Jeffrey R. Holland’s message “\nFear Not: Believe Only!\n” (\nLiahona\n, May 2022, 34–36) has helpful counsel for times of fear or doubt. A hymn like “\nLet Us All Press On\n” (\nHymns\n, no. 243) could also have encouraging messages. What do you find in these resources that helps you?\nSee also\n2 Chronicles 31–32\n;\n3 Nephi 3–4\n; Jörg Klebingat, “\nValiant Discipleship in the Latter Days\n,”\nLiahona\n, May 2022, 107–10.\nUse scripture study helps.\nThe Church provides many resources to help you understand the scriptures. For example, in the Gospel Library you can find the\nGuide to the Scriptures\n,\nTopics and Questions\n, and\nChurch magazines\n. In addition, as you read the Old Testament, you can find helpful context and insights in the “Thoughts to Keep in Mind” articles in\nCome, Follow Me\n. The article titled “J\nesus Will Say to All Israel, ‘Come Home’\n” might help your study of\n2 Kings 16–25\n.\n2 Kings 19:20–37\nAll things are in the Lord’s hands.\nSennacherib, the king of Assyria, had good reason to believe that his army would conquer Jerusalem (see\n2 Kings 17\n;\n18:33–34\n;\n19:11–13\n). But the Lord had a message regarding Sennacherib, given through the prophet Isaiah. It’s recorded in\n2 Kings 19:20–34\n. What truths do you find in the Lord’s message that help you have faith in Him and His plan?\n2 Kings 21–23\nThe scriptures can turn my heart to the Lord.\nHave you ever felt that you were lacking something spiritually? Maybe you felt that your relationship with God could be stronger. What helped you turn back to Him? Ponder these questions as you read\n2 Kings 21–23\n, which describes how the Kingdom of Judah fell away from the Lord under King Manasseh (see\n2 Kings 21\n) and how King Josiah helped the people turn back to Him (see\n2 Kings 22–23\n). How and why did Josiah and his people change? (see\n2 Kings 22:8–11\n;\n23:1–6, 21, 24\n).\nPresident Spencer W. Kimball called the story of King Josiah “one of the finest stories in all of the scriptures” (\nTeachings of Presidents of the Church: Spencer W. Kimball\n[2006], 62). Read President Kimball’s words about King Josiah (\npages 62–64\n). Perhaps you can think of an experience when a passage of scripture “work[ed] mightily” in you. What might you do to receive more experiences like that?\nSee also\nAlma 31:5\n; “Josiah and the Book of the Law” (video), Gospel Library.\n12:25\nJosiah and the Book of the Law\n2 Kings 23:1–25\nA covenant is a whole-souled commitment between me and the Lord.\nWhat impresses you about the covenant Josiah made in\n2 Kings 23:3\n? As you continue reading\nchapter 23\n, notice what Josiah did to show his commitment to the Lord (see also the picture at the end of this outline). How can you show your commitment to Him?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n2 Kings 18:3–6\n;\n19:14–19\nI can trust Heavenly Father and Jesus Christ.\nIn\n2 Kings 18:3, 5–6\n, help your children discover what made Hezekiah a good king. Then as you read together\n2 Kings 19:14–19\n, they could discover how he showed that he trusted the Lord. You could look at a picture of Jesus and talk about why we can trust Him. How can we show that we trust the Lord?\n2 Kings 22:1–7\nHeavenly Father and Jesus Christ can trust me.\nIn\n2 Kings 22:1\n, help your children discover how old Josiah was when he became king. What do we learn about Josiah in\nverse 2\n? Consider an activity that could illustrate following the Lord and not turning “aside to the right hand or to the left.”\nThe workers described in\n2 Kings 22:3–7\nwere trusted with the money to rebuild the temple “because they dealt faithfully” (\nverse 7\n). After reading these verses, you and your children could talk about things you have been trusted with. How can we be trustworthy like the workers in these verses?\nA scribe bringing a scroll of scripture to King Josiah; illustration by Robert T. Barrett\n2 Kings 22:8–11\n;\n23:2–3\nThe scriptures teach me to follow Jesus Christ.\nTo introduce the story of King Josiah in\n2 Kings 22–23\n, you could hide a copy of the scriptures somewhere in the room. Invite your children to find it. Then you could share what happened when one of Josiah’s priests found the scriptures in the temple (see\n2 Kings 22:8–11\n; see also “\nKing Josiah\n” in\nOld Testament Stories\n, 148–49). What might happen to us if we didn’t have the scriptures? Share with each other why you are glad we have the scriptures today.\n1:36\nKing Josiah\nAfter reading\n2 Kings 23:2–3\n, you and your children could talk about scriptures that have inspired you to “walk after the Lord” (\nverse 3\n). You could also sing a song about the scriptures, such as “\nSearch, Ponder, and Pray\n” (\nChildren’s Songbook\n, 109).\n2 Kings 23:1–3\nI will keep my covenants with God.\nWhen Josiah and his people learned the commandments of God, they made a covenant to live them. Read about this with your children in\n2 Kings 23:1–3\n, and help them find words or phrases that show how the people felt about the Lord’s commandments. Maybe your children could stand and talk about what it might mean to “[stand] to the covenant.” Then they could walk in place and talk about what it might mean to “walk after the Lord.” Next, they could place their hands on their hearts and suggest ways we can keep our covenants “with all [our] heart.”\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 29: Lesson 81: Lesson 81—1 Kings 17This lesson can help students act with greater faith in Heavenly Father and Jesus Christ by following the words of prophets.; Lesson 82: Lesson 82—1 Kings 18This lesson can help students feel a greater desire to follow the Lord. ---\n\n--- Lesson 81 ---\nOur loving Father in Heaven and His son, Jesus Christ, often give us opportunities to exercise faith in Them amid life’s difficulties. In the middle of a drought, the prophet Elijah asked a widow in Zarephath to give him the last of her food. As the widow acted in faith, the Lord promised her great blessings. Like the widow, we can demonstrate our faith in God by following His prophets. This lesson can help students act with greater faith in Heavenly Father and Jesus Christ by following the words of prophets. Student preparation: Invite students to identify something the Lord has invited us to do through His prophet and a promise He has given if we do it. Invite students to come to class ready to share. Possible Learning Activities Prophetic invitations To help students see how Heavenly Father and Jesus Christ provide guidance to us through Their prophets, you could display the following activity. Consider including the current prophet and an invitation he has recently given. Alternatively, students could name several prophets (including the current prophet) and list at least one invitation the Lord has given us through each prophet. Match the prophets with an invitation the Lord gave to their people: Brother of Jared Moses Lehi Brigham Young Leave Jerusalem and depart into the wilderness. Journey to the Rocky Mountains. Build barges to cross the ocean to the promised land. Walk through the Red Sea on dry ground. Answers: 1–C (see Ether 2:16 ; 6:4, 12 ); 2–D (see Exodus 14:21–22 ); 3–A (see 1 Nephi 2:1–2 ); 4–B (see Doctrine and Covenants 136:1 ). You might invite students to ponder whether they would have followed this prophetic direction if they were alive in the days of those prophets. Invite students to reflect on their responses to the living prophet’s invitations by doing the following. On a scale of 1–10, how you would rate yourself on each of the following statements: I believe the Lord speaks through prophets. I am familiar with what the Lord is teaching through His prophets today. I am following the Lord’s teachings that are given through His prophets. As you study 1 Kings 17 , pay attention to thoughts and insights from the Holy Ghost. Think about how your study today can affect your feelings about these statements. Elijah and the widow of Zarephath The following two paragraphs could be read or summarized. Because of wickedness, the kingdom of Israel was divided into two kingdoms: Israel and Judah (see 1 Kings 11–12 ). During the reign of wicked King Ahab, the Lord sent His prophet Elijah to the people of Israel. Using the power of God, Elijah prevented rain from coming upon the land, which resulted in years of drought. The Lord provided for Elijah’s needs, instructing him to hide by a brook of water where ravens fed him (see 1 Kings 17:1–6 ). One way students can feel the power of what they read in the scriptures is to imagine themselves in similar situations. Invite students to read the following verses and answer the questions through the viewpoint of Elijah or the widow. Be sure to explain that one way the Savior communicates His words to us is through His prophets and that Elijah’s words in this account came from the Lord. Students could be placed in pairs, with each partner reading the story through a different viewpoint. Students could then use the accompanying questions to interview their partner about what they learned from their viewpoint. Alternatively, you might watch “ Elijah and the Widow of Zarephath ,” available at ChurchofJesusChrist.org , from time code 4:09 to 10:06, and follow along in the verses. 10:13 Read 1 Kings 17:8–16 . How did Elijah or the widow show faith in Jesus Christ? How was the Lord’s promise fulfilled? How can both Elijah and the widow be symbolic of Jesus Christ? Invite students to share their answers. One of the ways Elijah may remind students of Jesus Christ is by inviting the widow to follow what he said to be saved. He also promised her that food would be multiplied ( 1 Kings 17:14–16 ), like the Savior promised for others (see Matthew 14:15–21 ). One of the ways the widow may remind students of Jesus Christ is by the way she was willing to sacrifice all she had, like the Savior did. Ask what lessons students learned from this account. They may share various principles. If they do not mention the following truth, be sure to add it: Acting in faith on the Savior’s words brings His promised blessings . This includes the Savior’s words through His prophets. What can make it difficult to act in faith on the Savior’s teachings? What do you know about Heavenly Father and Jesus Christ that can help you act in faith? The Savior’s words through His prophets Invite students to share where the Lord’s words given through His prophets can be found. In addition to scriptures and general conference, students may share places such as Liahona and For the Strength of Youth magazines, For the Strength of Youth: A Guide for Making Choices , and social media. Invite students to use any of these sources to complete the following activity. Consider displaying the instructions and giving students a specific amount of time to study. Draw two columns in your study journal. Draw a loaf of bread to represent the widow’s cake in the left column and a cruse of oil and barrel of meal (see 1 Kings 17:12, 16 ) in the right column. Label the left column What Heavenly Father and Jesus Christ Ask . Label the right column Their Promised Blessings . In the left column, make a list of things Heavenly Father and Jesus Christ are asking us to do through Their prophets. In the right column, list the promised blessings of obeying Their words. It may be helpful to provide an example for students. You could offer “living the Word of Wisdom” for the left column. Students could then read Doctrine and Covenants 89:18–21 for the blessings the Lord promises. Alternatively, you could share a recent example from the prophet’s words in general conference. Invite students to share what they wrote in their columns in small groups. Ensure that each student has an opportunity to share at least one thing from each column. Groups could then discuss the following question. How have you seen the blessings of exercising faith in the Lord’s words given through His prophets? Consider inviting students to share examples from their life of when they have seen blessings from following prophetic counsel. As part of this discussion, you might show “ That Night My Family Had Sufficient ” (1:47) or “ Fathers and Sons ” (5:42), available at ChurchofJesusChrist.org . 1:47 6:2 Plan to follow God’s prophets Encourage students to seek the help of the Holy Ghost as they do the following activity. In the left column, write down or circle something the Lord is asking you to do through His prophets that you feel He would like you to focus on. In the right column, write down or circle how the Lord has promised to bless you if you follow His counsel. Reflect on what you wrote or circled, then write your plan to be obedient to what the Lord has asked you to do through His prophet. Invite students to find a way to remember what they plan to do. For example, students could take a picture of their response and use it as wallpaper on their phone. Students will have an opportunity to follow up and report on their plan in Lesson 96: “ Assess Your Learning 6 .” Consider concluding class by testifying that students will come closer to Jesus Christ through their efforts to follow His prophet.\n\n\n--- Lesson 82 ---\nHow committed are you to following God? To demonstrate that the God of Israel was the only true God, Elijah challenged the priests of Baal to a contest. The Lord answered Elijah’s prayers and prevailed in the contest. This lesson can help students feel a greater desire to follow the Lord. Student preparation: Invite students to think of one or more times in their lives when they knew Heavenly Father or Jesus Christ was real, or when they felt Their power in their life. Or they could think of what they could do to find out whether Heavenly Father and Jesus Christ are real and if they should completely follow Them. Possible Learning Activities Can we follow two influences at the same time? Using tape or some other resource, make two lines on the floor in opposite directions as shown below. Ask a student to stand in the middle where the ends of the lines are close together and to place one foot on each line. Ask the student to take a few steps, trying to walk both lines. Ask them how long they feel they could be successful. If necessary, point out that though it is possible that someone could walk both lines for a short distance, they would not be successful for long, nor would they walk either line well. Invite the student to return to their seat. For this lesson, one line could represent the ways of the Lord, and the other could represent other influences that that do not align with the ways of the Lord. What are some ways we may try to follow the Lord and other influences at the same time? Elijah challenges the priests of Baal to a contest Summarize the paragraph below, or if you feel it would be appropriate for your students, show “ Elijah and the Priests of Baal ” (2:16), available at ChurchofJesusChrist.org , from time code 0:07 to 0:33. 2:17 In 1 Kings 18 , Elijah wanted the kingdom of Israel to fully commit to the Lord. It had been about three years since Elijah used his sealing power to bring a drought upon the land (see 1 Kings 17:1 ). But Israel continued worshiping false gods, including Baal (see 1 Kings 18:18 ). Elijah challenged the hundreds of false prophets of Baal and prophets of the grove to a contest on Mount Carmel to prove whether Baal or Jehovah was the true God (see 1 Kings 18:19 ). Before the contest began, Elijah spoke to the people. Read 1 Kings 18:21 , looking for Elijah’s words to the people. The word halt in this case means to hesitate or waver. What did Elijah ask the people to do? Elder D. Todd Christofferson of the Quorum of the Twelve Apostles rephrased Elijah’s statement this way: Today Elijah might say: Either God, our Heavenly Father, exists, or He does not, but if He exists, worship Him. Either Jesus Christ is the Son of God, the resurrected Redeemer of mankind, or He is not, but if He is, follow Him. (“ Firm and Steadfast in the Faith of Christ ,” Ensign or Liahona , Nov. 2018, 30) What stands out to you from Elijah’s and Elder Christofferson’s statements? Invite students to share their thoughts. Some truths we can learn are: The Lord allows us to choose whether we will follow Him or the false gods and unrighteous ways of the world. When we know that Heavenly Father exists and Jesus is the Christ, we should commit to follow Them. Answer the following questions in your study journal: How strongly do I believe that I have a Father in Heaven and a Savior? How committed am I to following Them? What might keep me from committing to follow Them completely? As you continue your study, seek the guidance of the Holy Ghost to help you know how you might overcome any obstacles that may prevent you from fully following Heavenly Father and Jesus Christ. The contest between Baal and Jehovah Read 1 Kings 18:23–24 , looking for the conditions of the contest between Elijah and the false prophets of Baal. The priests of Baal tried first, calling upon their false god for hours. Read 1 Kings 18:26–29 , looking for what happened. What did you find? If students struggle to understand these verses, consider showing “ Elijah and the Priests of Baal ” from time code 0:33 to 1:19. 2:17 For the following activity, consider giving students a time limit of around five minutes to read the verses and complete the following instructions. Emphasize that the drawing does not need to be elaborate. To learn what happened when Elijah called upon God, read 1 Kings 18:30–39 . Then, take a piece of paper and divide it in half. On one half of the paper, draw a picture of what happened when Elijah prepared his sacrifice and called upon God. What would you think and feel if you were there? How might it affect your testimony of the Lord and your willingness to follow Him? For the following activity, consider giving students a time limit of about five minutes. If it would be useful to show an example of someone who came to know God was real or what they did to come to know, consider showing one of the following videos, available at ChurchofJesusChrist.org . “ His Grace: Choosing to Believe in God ” (4:07) 4:7 “ Faith Crisis: What Do We Do When We Feel Nothing? ” (5:55) 5:55 On the other half of your paper, write about or draw a picture of one or more times in your life when you knew Heavenly Father or Jesus Christ was real, or when you felt Their power in your life. Or you could write about or draw a picture of what you could do to find out if They are real and if you should completely follow Them. When the students have finished, consider giving multiple volunteers time to share what they drew or wrote if it is not too personal. Encouraging many students to share can give various perspectives and help other students realize how the truths they are learning can affect them. It might also be beneficial to ask questions such as the ones below. How does reflecting on your own experiences of seeing the power of Heavenly Father and Jesus Christ in your life help you in your commitment to worship and follow Them? Why do you think Heavenly Father and the Savior Jesus Christ are worth following completely? Observe Christlike attributes in students and share what you’ve noticed. You can help motivate students to continue to strive to come closer to the Lord when you point out ways they have been improving or making good choices. For this lesson, consider pointing out ways you have noticed students choosing to follow Heavenly Father and Jesus Christ. This might include complimenting them on the choice to attend seminary, study the Lord’s word, and seek to come closer to Him. This could also include Christlike attributes you have noticed in students. To learn more on this, see “ Help learners intentionally strive to be more like Jesus Christ ” in Teacher Development Skills . To end this lesson, write in your study journal how you feel about following Heavenly Father and Jesus Christ completely. Seek the guidance of the Holy Ghost to help you remember and express your feelings. You could include what you would like to do or remember because of this lesson. Share your testimony of Heavenly Father and Jesus Christ and the blessings of completely following Them.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "2",
      "content": "Despite the prophet Elisha’s powerful ministry, the people of the Northern Kingdom of Israel did not repent. Eventually, the Assyrian Empire conquered and scattered the ten tribes of Israel. Meanwhile, the Southern Kingdom of Judah wasn’t doing much better: idolatry was also widespread there.\nAmid all this spiritual decay, the scriptures mention two kings of Judah who, for a time, turned their people back to the Lord. One was Hezekiah. During his reign, the Assyrians conquered much of Judah. But Hezekiah and his people showed faith in the Lord, who saved Jerusalem in a miraculous way. Later, after another period of apostasy, Josiah became king. Inspired in part by a rediscovery of the book of the law of Moses, Josiah brought reforms that revived the religious life of his people.\nLike Israel and Judah, we all make both good and bad choices. When we sense that our lives need some reforms, we can take encouragement from these two bright spots in the dark years of Judah’s history. Perhaps the examples of Hezekiah and Josiah can inspire us to “trust in the Lord our God” (\n2 Kings 18:22\n).\nIdeas for Learning at Home and at Church\n2 Kings 18–19\nI can stay true to the Lord when my faith is challenged.\nMost of us have experiences that challenge our faith. For Hezekiah and his people, one of those challenges came when the Assyrian army approached Jerusalem. As you read\n2 Kings 18–19\n, imagine that you lived in Jerusalem during this time. How might you have felt, for example, hearing the Assyrians’ taunts in\n2 Kings 18:28–37\n;\n19:10–13\n? What would you have done? Compare the Assyrians’ reasons for the Israelites not to trust the Lord with the reasons Satan gives for us to doubt our faith today. You could also contrast the Assyrians’ reasons with your reasons why you\ndo\ntrust the Lord.\nWhat do you learn from Hezekiah’s actions in this situation? (see\n2 Kings 19:1–7, 14–19\n). How did the Lord respond? (see\n2 Kings 19:35–37\n). Why do you think Hezekiah remained faithful? (see\n2 Kings 18:5–7\n). Ponder how the Lord has sustained you in challenging times. What do you feel inspired to do to increase your trust in Him?\nPresident Jeffrey R. Holland’s message “\nFear Not: Believe Only!\n” (\nLiahona\n, May 2022, 34–36) has helpful counsel for times of fear or doubt. A hymn like “\nLet Us All Press On\n” (\nHymns\n, no. 243) could also have encouraging messages. What do you find in these resources that helps you?\nSee also\n2 Chronicles 31–32\n;\n3 Nephi 3–4\n; Jörg Klebingat, “\nValiant Discipleship in the Latter Days\n,”\nLiahona\n, May 2022, 107–10.\nUse scripture study helps.\nThe Church provides many resources to help you understand the scriptures. For example, in the Gospel Library you can find the\nGuide to the Scriptures\n,\nTopics and Questions\n, and\nChurch magazines\n. In addition, as you read the Old Testament, you can find helpful context and insights in the “Thoughts to Keep in Mind” articles in\nCome, Follow Me\n. The article titled “J\nesus Will Say to All Israel, ‘Come Home’\n” might help your study of\n2 Kings 16–25\n.\n2 Kings 19:20–37\nAll things are in the Lord’s hands.\nSennacherib, the king of Assyria, had good reason to believe that his army would conquer Jerusalem (see\n2 Kings 17\n;\n18:33–34\n;\n19:11–13\n). But the Lord had a message regarding Sennacherib, given through the prophet Isaiah. It’s recorded in\n2 Kings 19:20–34\n. What truths do you find in the Lord’s message that help you have faith in Him and His plan?\n2 Kings 21–23\nThe scriptures can turn my heart to the Lord.\nHave you ever felt that you were lacking something spiritually? Maybe you felt that your relationship with God could be stronger. What helped you turn back to Him? Ponder these questions as you read\n2 Kings 21–23\n, which describes how the Kingdom of Judah fell away from the Lord under King Manasseh (see\n2 Kings 21\n) and how King Josiah helped the people turn back to Him (see\n2 Kings 22–23\n). How and why did Josiah and his people change? (see\n2 Kings 22:8–11\n;\n23:1–6, 21, 24\n).\nPresident Spencer W. Kimball called the story of King Josiah “one of the finest stories in all of the scriptures” (\nTeachings of Presidents of the Church: Spencer W. Kimball\n[2006], 62). Read President Kimball’s words about King Josiah (\npages 62–64\n). Perhaps you can think of an experience when a passage of scripture “work[ed] mightily” in you. What might you do to receive more experiences like that?\nSee also\nAlma 31:5\n; “Josiah and the Book of the Law” (video), Gospel Library.\n12:25\nJosiah and the Book of the Law\n2 Kings 23:1–25\nA covenant is a whole-souled commitment between me and the Lord.\nWhat impresses you about the covenant Josiah made in\n2 Kings 23:3\n? As you continue reading\nchapter 23\n, notice what Josiah did to show his commitment to the Lord (see also the picture at the end of this outline). How can you show your commitment to Him?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n2 Kings 18:3–6\n;\n19:14–19\nI can trust Heavenly Father and Jesus Christ.\nIn\n2 Kings 18:3, 5–6\n, help your children discover what made Hezekiah a good king. Then as you read together\n2 Kings 19:14–19\n, they could discover how he showed that he trusted the Lord. You could look at a picture of Jesus and talk about why we can trust Him. How can we show that we trust the Lord?\n2 Kings 22:1–7\nHeavenly Father and Jesus Christ can trust me.\nIn\n2 Kings 22:1\n, help your children discover how old Josiah was when he became king. What do we learn about Josiah in\nverse 2\n? Consider an activity that could illustrate following the Lord and not turning “aside to the right hand or to the left.”\nThe workers described in\n2 Kings 22:3–7\nwere trusted with the money to rebuild the temple “because they dealt faithfully” (\nverse 7\n). After reading these verses, you and your children could talk about things you have been trusted with. How can we be trustworthy like the workers in these verses?\nA scribe bringing a scroll of scripture to King Josiah; illustration by Robert T. Barrett\n2 Kings 22:8–11\n;\n23:2–3\nThe scriptures teach me to follow Jesus Christ.\nTo introduce the story of King Josiah in\n2 Kings 22–23\n, you could hide a copy of the scriptures somewhere in the room. Invite your children to find it. Then you could share what happened when one of Josiah’s priests found the scriptures in the temple (see\n2 Kings 22:8–11\n; see also “\nKing Josiah\n” in\nOld Testament Stories\n, 148–49). What might happen to us if we didn’t have the scriptures? Share with each other why you are glad we have the scriptures today.\n1:36\nKing Josiah\nAfter reading\n2 Kings 23:2–3\n, you and your children could talk about scriptures that have inspired you to “walk after the Lord” (\nverse 3\n). You could also sing a song about the scriptures, such as “\nSearch, Ponder, and Pray\n” (\nChildren’s Songbook\n, 109).\n2 Kings 23:1–3\nI will keep my covenants with God.\nWhen Josiah and his people learned the commandments of God, they made a covenant to live them. Read about this with your children in\n2 Kings 23:1–3\n, and help them find words or phrases that show how the people felt about the Lord’s commandments. Maybe your children could stand and talk about what it might mean to “[stand] to the covenant.” Then they could walk in place and talk about what it might mean to “walk after the Lord.” Next, they could place their hands on their hearts and suggest ways we can keep our covenants “with all [our] heart.”\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 29: Lesson 81: Lesson 81—1 Kings 17This lesson can help students act with greater faith in Heavenly Father and Jesus Christ by following the words of prophets.; Lesson 82: Lesson 82—1 Kings 18This lesson can help students feel a greater desire to follow the Lord.",
      "content": "\n--- Lesson 81 ---\nOur loving Father in Heaven and His son, Jesus Christ, often give us opportunities to exercise faith in Them amid life’s difficulties. In the middle of a drought, the prophet Elijah asked a widow in Zarephath to give him the last of her food. As the widow acted in faith, the Lord promised her great blessings. Like the widow, we can demonstrate our faith in God by following His prophets. This lesson can help students act with greater faith in Heavenly Father and Jesus Christ by following the words of prophets. Student preparation: Invite students to identify something the Lord has invited us to do through His prophet and a promise He has given if we do it. Invite students to come to class ready to share. Possible Learning Activities Prophetic invitations To help students see how Heavenly Father and Jesus Christ provide guidance to us through Their prophets, you could display the following activity. Consider including the current prophet and an invitation he has recently given. Alternatively, students could name several prophets (including the current prophet) and list at least one invitation the Lord has given us through each prophet. Match the prophets with an invitation the Lord gave to their people: Brother of Jared Moses Lehi Brigham Young Leave Jerusalem and depart into the wilderness. Journey to the Rocky Mountains. Build barges to cross the ocean to the promised land. Walk through the Red Sea on dry ground. Answers: 1–C (see Ether 2:16 ; 6:4, 12 ); 2–D (see Exodus 14:21–22 ); 3–A (see 1 Nephi 2:1–2 ); 4–B (see Doctrine and Covenants 136:1 ). You might invite students to ponder whether they would have followed this prophetic direction if they were alive in the days of those prophets. Invite students to reflect on their responses to the living prophet’s invitations by doing the following. On a scale of 1–10, how you would rate yourself on each of the following statements: I believe the Lord speaks through prophets. I am familiar with what the Lord is teaching through His prophets today. I am following the Lord’s teachings that are given through His prophets. As you study 1 Kings 17 , pay attention to thoughts and insights from the Holy Ghost. Think about how your study today can affect your feelings about these statements. Elijah and the widow of Zarephath The following two paragraphs could be read or summarized. Because of wickedness, the kingdom of Israel was divided into two kingdoms: Israel and Judah (see 1 Kings 11–12 ). During the reign of wicked King Ahab, the Lord sent His prophet Elijah to the people of Israel. Using the power of God, Elijah prevented rain from coming upon the land, which resulted in years of drought. The Lord provided for Elijah’s needs, instructing him to hide by a brook of water where ravens fed him (see 1 Kings 17:1–6 ). One way students can feel the power of what they read in the scriptures is to imagine themselves in similar situations. Invite students to read the following verses and answer the questions through the viewpoint of Elijah or the widow. Be sure to explain that one way the Savior communicates His words to us is through His prophets and that Elijah’s words in this account came from the Lord. Students could be placed in pairs, with each partner reading the story through a different viewpoint. Students could then use the accompanying questions to interview their partner about what they learned from their viewpoint. Alternatively, you might watch “ Elijah and the Widow of Zarephath ,” available at ChurchofJesusChrist.org , from time code 4:09 to 10:06, and follow along in the verses. 10:13 Read 1 Kings 17:8–16 . How did Elijah or the widow show faith in Jesus Christ? How was the Lord’s promise fulfilled? How can both Elijah and the widow be symbolic of Jesus Christ? Invite students to share their answers. One of the ways Elijah may remind students of Jesus Christ is by inviting the widow to follow what he said to be saved. He also promised her that food would be multiplied ( 1 Kings 17:14–16 ), like the Savior promised for others (see Matthew 14:15–21 ). One of the ways the widow may remind students of Jesus Christ is by the way she was willing to sacrifice all she had, like the Savior did. Ask what lessons students learned from this account. They may share various principles. If they do not mention the following truth, be sure to add it: Acting in faith on the Savior’s words brings His promised blessings . This includes the Savior’s words through His prophets. What can make it difficult to act in faith on the Savior’s teachings? What do you know about Heavenly Father and Jesus Christ that can help you act in faith? The Savior’s words through His prophets Invite students to share where the Lord’s words given through His prophets can be found. In addition to scriptures and general conference, students may share places such as Liahona and For the Strength of Youth magazines, For the Strength of Youth: A Guide for Making Choices , and social media. Invite students to use any of these sources to complete the following activity. Consider displaying the instructions and giving students a specific amount of time to study. Draw two columns in your study journal. Draw a loaf of bread to represent the widow’s cake in the left column and a cruse of oil and barrel of meal (see 1 Kings 17:12, 16 ) in the right column. Label the left column What Heavenly Father and Jesus Christ Ask . Label the right column Their Promised Blessings . In the left column, make a list of things Heavenly Father and Jesus Christ are asking us to do through Their prophets. In the right column, list the promised blessings of obeying Their words. It may be helpful to provide an example for students. You could offer “living the Word of Wisdom” for the left column. Students could then read Doctrine and Covenants 89:18–21 for the blessings the Lord promises. Alternatively, you could share a recent example from the prophet’s words in general conference. Invite students to share what they wrote in their columns in small groups. Ensure that each student has an opportunity to share at least one thing from each column. Groups could then discuss the following question. How have you seen the blessings of exercising faith in the Lord’s words given through His prophets? Consider inviting students to share examples from their life of when they have seen blessings from following prophetic counsel. As part of this discussion, you might show “ That Night My Family Had Sufficient ” (1:47) or “ Fathers and Sons ” (5:42), available at ChurchofJesusChrist.org . 1:47 6:2 Plan to follow God’s prophets Encourage students to seek the help of the Holy Ghost as they do the following activity. In the left column, write down or circle something the Lord is asking you to do through His prophets that you feel He would like you to focus on. In the right column, write down or circle how the Lord has promised to bless you if you follow His counsel. Reflect on what you wrote or circled, then write your plan to be obedient to what the Lord has asked you to do through His prophet. Invite students to find a way to remember what they plan to do. For example, students could take a picture of their response and use it as wallpaper on their phone. Students will have an opportunity to follow up and report on their plan in Lesson 96: “ Assess Your Learning 6 .” Consider concluding class by testifying that students will come closer to Jesus Christ through their efforts to follow His prophet.\n\n\n--- Lesson 82 ---\nHow committed are you to following God? To demonstrate that the God of Israel was the only true God, Elijah challenged the priests of Baal to a contest. The Lord answered Elijah’s prayers and prevailed in the contest. This lesson can help students feel a greater desire to follow the Lord. Student preparation: Invite students to think of one or more times in their lives when they knew Heavenly Father or Jesus Christ was real, or when they felt Their power in their life. Or they could think of what they could do to find out whether Heavenly Father and Jesus Christ are real and if they should completely follow Them. Possible Learning Activities Can we follow two influences at the same time? Using tape or some other resource, make two lines on the floor in opposite directions as shown below. Ask a student to stand in the middle where the ends of the lines are close together and to place one foot on each line. Ask the student to take a few steps, trying to walk both lines. Ask them how long they feel they could be successful. If necessary, point out that though it is possible that someone could walk both lines for a short distance, they would not be successful for long, nor would they walk either line well. Invite the student to return to their seat. For this lesson, one line could represent the ways of the Lord, and the other could represent other influences that that do not align with the ways of the Lord. What are some ways we may try to follow the Lord and other influences at the same time? Elijah challenges the priests of Baal to a contest Summarize the paragraph below, or if you feel it would be appropriate for your students, show “ Elijah and the Priests of Baal ” (2:16), available at ChurchofJesusChrist.org , from time code 0:07 to 0:33. 2:17 In 1 Kings 18 , Elijah wanted the kingdom of Israel to fully commit to the Lord. It had been about three years since Elijah used his sealing power to bring a drought upon the land (see 1 Kings 17:1 ). But Israel continued worshiping false gods, including Baal (see 1 Kings 18:18 ). Elijah challenged the hundreds of false prophets of Baal and prophets of the grove to a contest on Mount Carmel to prove whether Baal or Jehovah was the true God (see 1 Kings 18:19 ). Before the contest began, Elijah spoke to the people. Read 1 Kings 18:21 , looking for Elijah’s words to the people. The word halt in this case means to hesitate or waver. What did Elijah ask the people to do? Elder D. Todd Christofferson of the Quorum of the Twelve Apostles rephrased Elijah’s statement this way: Today Elijah might say: Either God, our Heavenly Father, exists, or He does not, but if He exists, worship Him. Either Jesus Christ is the Son of God, the resurrected Redeemer of mankind, or He is not, but if He is, follow Him. (“ Firm and Steadfast in the Faith of Christ ,” Ensign or Liahona , Nov. 2018, 30) What stands out to you from Elijah’s and Elder Christofferson’s statements? Invite students to share their thoughts. Some truths we can learn are: The Lord allows us to choose whether we will follow Him or the false gods and unrighteous ways of the world. When we know that Heavenly Father exists and Jesus is the Christ, we should commit to follow Them. Answer the following questions in your study journal: How strongly do I believe that I have a Father in Heaven and a Savior? How committed am I to following Them? What might keep me from committing to follow Them completely? As you continue your study, seek the guidance of the Holy Ghost to help you know how you might overcome any obstacles that may prevent you from fully following Heavenly Father and Jesus Christ. The contest between Baal and Jehovah Read 1 Kings 18:23–24 , looking for the conditions of the contest between Elijah and the false prophets of Baal. The priests of Baal tried first, calling upon their false god for hours. Read 1 Kings 18:26–29 , looking for what happened. What did you find? If students struggle to understand these verses, consider showing “ Elijah and the Priests of Baal ” from time code 0:33 to 1:19. 2:17 For the following activity, consider giving students a time limit of around five minutes to read the verses and complete the following instructions. Emphasize that the drawing does not need to be elaborate. To learn what happened when Elijah called upon God, read 1 Kings 18:30–39 . Then, take a piece of paper and divide it in half. On one half of the paper, draw a picture of what happened when Elijah prepared his sacrifice and called upon God. What would you think and feel if you were there? How might it affect your testimony of the Lord and your willingness to follow Him? For the following activity, consider giving students a time limit of about five minutes. If it would be useful to show an example of someone who came to know God was real or what they did to come to know, consider showing one of the following videos, available at ChurchofJesusChrist.org . “ His Grace: Choosing to Believe in God ” (4:07) 4:7 “ Faith Crisis: What Do We Do When We Feel Nothing? ” (5:55) 5:55 On the other half of your paper, write about or draw a picture of one or more times in your life when you knew Heavenly Father or Jesus Christ was real, or when you felt Their power in your life. Or you could write about or draw a picture of what you could do to find out if They are real and if you should completely follow Them. When the students have finished, consider giving multiple volunteers time to share what they drew or wrote if it is not too personal. Encouraging many students to share can give various perspectives and help other students realize how the truths they are learning can affect them. It might also be beneficial to ask questions such as the ones below. How does reflecting on your own experiences of seeing the power of Heavenly Father and Jesus Christ in your life help you in your commitment to worship and follow Them? Why do you think Heavenly Father and the Savior Jesus Christ are worth following completely? Observe Christlike attributes in students and share what you’ve noticed. You can help motivate students to continue to strive to come closer to the Lord when you point out ways they have been improving or making good choices. For this lesson, consider pointing out ways you have noticed students choosing to follow Heavenly Father and Jesus Christ. This might include complimenting them on the choice to attend seminary, study the Lord’s word, and seek to come closer to Him. This could also include Christlike attributes you have noticed in students. To learn more on this, see “ Help learners intentionally strive to be more like Jesus Christ ” in Teacher Development Skills . To end this lesson, write in your study journal how you feel about following Heavenly Father and Jesus Christ completely. Seek the guidance of the Holy Ghost to help you remember and express your feelings. You could include what you would like to do or remember because of this lesson. Share your testimony of Heavenly Father and Jesus Christ and the blessings of completely following Them.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 22442,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.386992"
}