{
  "week_number": 23,
  "date_range": "Samuel 1–7Ruth",
  "title": "Ruth;1",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: Ruth;1 ---\nSometimes we imagine that our lives should follow a clear path from beginning to end. The shortest distance between two points is a straight line, after all. And yet life is often full of delays and detours that take us in unexpected directions.\nRuth and Hannah surely understood this. Ruth was not an Israelite, but she married one, and when her husband died, she had a choice to make. Would she return to her family and her old, familiar life, or would she embrace the Israelite faith and a new home with her mother-in-law? (see\nRuth 1:4–18\n). Hannah’s plan for her life was to bear children, but she could not, and that left her “in bitterness of soul” (see\n1 Samuel 1:1–10\n). As you read about Ruth and Hannah, consider the faith they must have had to travel their unexpected paths. Then think about your own journey. It’s different from Ruth’s and Hannah’s—and anyone else’s. But throughout the trials and surprises between here and your eternal destination, you can learn to say with Hannah, “My heart rejoiceth in the Lord” (\n1 Samuel 2:1\n).\nSee also the Bible Dictionary for an overview of the books of\nRuth\nand\n1 Samuel\n.\nIdeas for Learning at Home and at Church\nRuth\nJesus Christ can turn tragedy into triumph.\nLife is hard for a widow in any era. But when Ruth’s husband died, her situation was especially hard. In Israelite culture at the time, a woman without a husband or sons had no right to property and very few ways to earn a living. As you read Ruth’s story, notice how the Lord turned tragedy into great blessings. What do you notice about Ruth that might have helped her? How did Boaz redeem Ruth from her desperate situation? (see\nRuth 4:4–10\n). How were both Ruth and Boaz like Jesus Christ?\nSee also “\nBe Still, My Soul\n,”\nHymns\n, no. 124.\nRuth\n;\n1 Samuel 1\nI can trust that God will guide and help me regardless of my situation.\nPerhaps you have suffered a great loss, as Ruth and Naomi did (see\nRuth 1:1–5\n). Or maybe, like Hannah, you long for blessings you have not yet received (see\n1 Samuel 1:1–10\n). How did these women show their faith in God? What do you learn from their examples?\nOf course, not everyone who prays for a child receives one, and not everyone whose spouse dies remarries. But everyone who turns to the Savior receives His help and guidance. Consider how you have “come to trust” the Lord (\nRuth 2:12\n) during your difficult times.\nSee also Amy A. Wright, “\nAbide the Day in Christ\n,”\nLiahona\n, Nov. 2023, 9–11.\nFor This Child I Prayed\n, by Elspeth Young\n1 Samuel 2\n;\n4–7\nTo receive the Lord’s help, I need to trust Him and obey His commandments.\nWhen their enemies attacked, the Israelites apparently thought that simply possessing the ark of the covenant would protect them. As you read\n1 Samuel 4–6\n, think about why that didn’t work. (Note also the unrighteous actions of Eli’s sons, who served as priests in the tabernacle, in\n1 Samuel 2:12–25\n.) What do you think the Lord was trying to teach His people? What do you learn from what happened to the Philistines after capturing the ark? (see\nchapters 5–6\n). What do you learn from Israel’s efforts to regain the Lord’s protection in\n1 Samuel 7\n?\nYou might be inspired by reading Hannah’s poem of praise in\n1 Samuel 2:1–10\n. What do you find in her words that could have helped Eli’s sons and the rest of the Israelites?\n1 Samuel 3\nI can hear and obey the voice of the Lord.\nAt times, you may feel like Samuel, who heard the voice of the Lord but did not recognize it. Like all of us, Samuel had to learn how to recognize the Lord’s voice. As you study\n1 Samuel 3\n, what do you learn from this young boy about hearing and obeying the Lord’s voice? You might also search these additional scriptures and make a list of guidelines that can help a person recognize the Lord’s voice:\n1 Kings 19:11–12\n;\nLuke 24:15–32\n;\n3 Nephi 11:3–7\n;\nDoctrine and Covenants 6:22–23\n;\n8:2–3\n;\n9:7–9\n.\nOther times, you may feel that the heavens are shut and that God does not want to communicate with you. President Russell M. Nelson said, “Does God really\nwant\nto speak to you? Yes!” (“\nRevelation for the Church, Revelation for Our Lives\n,”\nEnsign\nor\nLiahona\n, May 2018, 93–96). As you study President Nelson’s message, what do you find that inspires you to hear and obey the voice of the Lord? What does President Nelson invite you to do, and what blessings does he promise? You can also find invitations and promised blessings about revelation in “\nWalk in God’s light\n” (\nFor the Strength of Youth: A Guide for Making Choices\n, 16–20). Consider choosing one thing you can do to “increase your spiritual capacity to receive revelation.”\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat did it mean to glean a field?\nWhy was it significant that Boaz was one of Naomi’s “next kinsmen”?\nWhy did Naomi instruct Ruth to lay at the feet of Boaz?\nClick to see more.\nIdeas for Teaching Children\nRuth\nI can show love and kindness to people around me.\nAs you share with your children the story of Ruth (you could use “\nRuth and Naomi\n” in\nOld Testament Stories\n, 100–103), invite them to raise their hands every time they hear an act of kindness in the story. They could also share how they feel when others are kind to them, or when they are kind to others. How has the Savior been kind to us? How can we follow His example? (see “\nKindness Begins with Me,\n”\nChildren’s Songbook\n, 145).\n2:0\nRuth and Naomi\nRuth\n;\n1 Samuel 1\nI can have faith in the Lord.\nThe stories of Ruth and Hannah can inspire your children to stay faithful during hard times. Consider helping them create a simple chart with the headings\nTrials\n,\nActions\n,\nBlessings\n. Then you could read together\nRuth 1:3–5, 8, 16\n;\n2:1–3, 8–12\n;\n4:13–17\n;\n1 Samuel 1:1–18\nand write under the headings what they find in these verses. How did Ruth and Hannah show their faith in the Lord? You or your children could then share examples of how the Lord has blessed you during hard times.\n1 Samuel 1:1–18\nHeavenly Father hears and answers my prayers.\nTo learn about Hannah, your children could read\n1 Samuel 1:1–18\nor “\nHannah\n” in\nOld Testament Stories\n(104–5) or watch “Hannah’s Faith” (video, Gospel Library). It might be fun to toss a ball to a child and invite them to tell part of the story before passing the ball to someone else. What do we learn about prayer from Hannah’s example?\n1:15\nHannah\n3:9\nHannah's Faith\nSamuel Tells Eli the Truth\n, by Robert T. Barrett\n1 Samuel 3:1–10\nI can hear and obey the Lord’s voice.\nPerhaps a simple role-play could help your children learn from Samuel’s experience with revelation. One child could pretend to be Samuel, and another could pretend to be Eli as you read\n1 Samuel 3:1–10\n(see also “\nSamuel the Prophet\n” in\nOld Testament Stories\n, 106–9, or the video “Samuel and Eli,” Gospel Library). What do we learn from Samuel about how to hear the voice of the Lord? How do we show that we are willing to hear when the Lord speaks to us?\n2:10\nSamuel the Prophet\n1:58\nSamuel and Eli\nAsk your children how they would explain to someone how the Lord speaks to them. You could help them look for answers in\nDoctrine and Covenants 6:22–23\n;\n8:2–3\n;\n9:7–9\n.\nHelp your children learn to recognize the Spirit.\nIt’s not easy to discern between our own feelings and the Holy Ghost. Everyone struggles with this from time to time. Take every opportunity you can to help your children recognize when they are feeling the influence of the Spirit. For example, as you read\n1 Samuel 3:1–10\nand the suggested verses in the Doctrine and Covenants, you could share experiences in which the Lord has taught you in your mind and heart.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 23: Lesson 61: Lesson 61—Joshua 1This lesson can help increase students’ confidence that the Lord can help them be strong and courageous when they face challenges.; Lesson 62: Lesson 62—Joshua 2–4This lesson can help students understand how they can exercise faith in Jesus Christ.... ---\n\n--- Lesson 61 ---\nAs the Lord’s chosen prophet, Joshua was ordained by Moses to lead Israel into the promised land. Although this task may have seemed daunting, the Savior commanded Joshua to be strong and courageous, with a promise that He would not fail or forsake His prophet (see Joshua 1:5–6 ). This lesson can help increase students’ confidence that the Lord can help them be strong and courageous when they face challenges. Student preparation: Invite students to think of situations when a youth might need to demonstrate courage. Students could ask a family member or friend for experiences they have had that required courage. Possible Learning Activities Courage when facing challenges To begin class, consider writing the word Courage on the board. As students respond to the following questions, invite them to write their responses on the board. How was Jesus Christ an example of courage? What are some situations a teenager may face that would require courage? In your study journal, write down some of the challenges you are facing now or may face in the future that require courage. Self–assessment can help students evaluate their current situation and provide an opportunity for the Holy Ghost to meet their individual needs throughout the lesson. One way to do this could be to invite students to respond to the following prompts in their study journals. When I am asked to do something that seems challenging, I often feel . On a scale of 1 (low) to 5 (high), how confident do I feel that Heavenly Father and Jesus Christ will help me face my challenges with courage? Why? As you study today, pay attention to impressions from the Holy Ghost that can help you be courageous and increase your confidence that the Lord is with you. Joshua is ordained to lead the children of Israel Consider displaying an image of Moses ordaining Joshua, like the image from the beginning of this lesson (see Deuteronomy 34:9 ). Although Moses had been with the children of Israel since their deliverance from Egypt, the Lord called Joshua to lead them into the promised land. What are some of the challenges Joshua could have faced as the Lord’s prophet and military leader of Israel? Help students understand that Joshua would have the responsibility of the spiritual leadership of Israel. Joshua was also the military commander and would lead Israel to conquer the land from the Canaanites who were ripe in iniquity (see 1 Nephi 17:31–40 ). The Lord had promised this land to Abraham and his righteous posterity (see Joshua 1:1–4 ). Read Joshua 1:5–9 , marking repeated promises and instructions from the Lord that could have helped Joshua focus on Him when facing challenges. What do you find significant from these verses? How would you summarize a truth to help someone going through challenges? As students share truths they have identified, help them recognize that when we know the Lord is with us, we can be strong and courageous. You might use some or all of the following questions to help students understand this truth. Students might work with a partner or small group and then share what they discussed with the class. Think about the challenging situations listed on the board and in your journal. What might it look like to be strong and have courage when facing these challenges? What do you know about the Lord that could help someone be strong and have courage? How do you know this? Read Doctrine and Covenants 84:88 , looking for ways the Lord is with us. Ways to invite the Lord’s help The following activities can help students recognize ways to invite the Lord’s help when they need to be strong and courageous. Invite students to choose one of the activities. After an appropriate amount of time, students could share what they learned with those who chose the other activity. You might provide one of the statements available in Additional Resources for students to study with each activity. Activity A: Obedience to God’s law Read Joshua 1:7 and one or more of the following scriptures: John 15:10 ; 1 Nephi 3:7 ; Mosiah 2:41 ; Doctrine and Covenants 93:20 . What connections do you see between obeying God’s commandments and being strong and courageous? What are some ways Heavenly Father and Jesus Christ could bless us because of our obedience? Activity B: Meditating on God’s word Read Joshua 1:8 and one or more of the following scriptures: 2 Timothy 3:15–17 ; 2 Nephi 31:20 ; 32:3 . What helps you meditate on scriptures? How do you think meditating on God’s words can help you feel close to Him? Reviewing goals can help students recognize the progress they have made and make any needed adjustments to their goal. Encourage students to review the scripture study goal they may have set. Then invite them to evaluate their progress and make any adjustments to their goal. (For additional training on reminding students of their scripture study goals, see “ Encourage learners to come to know the Savior by studying the gospel daily—study goal ” in Teacher Development Skills [2022], 31.) Remembering the Lord is with us What are some ways you have felt the Lord with you during your challenges? Provide an opportunity for students to reflect on what they have learned and felt today. They could invite the Spirit to help them see how their efforts have increased their confidence that the Lord will be with them. In your study journal, think about the challenges you face now or may face in the future. What have you learned or felt about Heavenly Father and Jesus Christ that can help you be strong and courageous when facing challenges? From what you learned or felt about Heavenly Father and Jesus Christ, what do you want to remember the next time you feel uncertain about your ability to handle a difficult situation? Consider sharing your witness that the Lord will keep His promise to be with us always, never failing or forsaking us, just as He promised Joshua.\n\n\n--- Lesson 62 ---\nAfter the Israelites’ journey through the wilderness, the Lord commanded Joshua to lead them into the promised land. Entering the promised land required them to exercise faith in Jesus Christ. The children of Israel and a woman named Rahab demonstrated their faith in Jesus Christ. This lesson can help students understand how they can exercise faith in Jesus Christ. Student preparation: Invite students to find a scripture that helps them understand what it means to have faith in Jesus Christ. Ask them to come prepared to share it in class. If needed, they could look up “Faith” in the Topical Guide or Guide to the Scriptures. Possible Learning Activities Faith in Jesus Christ Consider beginning class by inviting a student to think of a word that represents their hobbies or interests—for example, basketball or singing . Ask students to describe their words without using the word itself. Class members can guess the word. Next, write faith on the board, and invite students to describe faith in Jesus Christ. They could share what they found as part of their preparation for class. You might want to point out that Heavenly Father wants us to exercise faith in Jesus Christ so that He can save and bless us (see 2 Nephi 26:13 ; Ether 12:12, 18 ; Moroni 7:33 ). Remind students that one of the roles of the Holy Ghost is to guide us to truth (see John 16:13 ). Encourage students to invite the Holy Ghost to help them better understand faith in Jesus Christ. How might increasing your faith in Jesus Christ help you in your current circumstances? Read what Elder David A. Bednar of the Quorum of the Twelve Apostles taught about faith in Jesus Christ, or watch the video “ Seek Learning by Faith ” from time code 3:15 to 4:33. The video is located on ChurchofJesusChrist.org . 33:36 The Apostle Paul defined faith as “the substance of things hoped for [and] the evidence of things not seen” ( Hebrews 11:1 ). Alma declared that faith is not a perfect knowledge; rather, if we have faith, we “hope for things which are not seen [but] are true” ( Alma 32:21 ). Additionally, we learn in the Lectures on Faith that faith is … “the principle of action in all intelligent beings.” These teachings highlight three basic elements of faith: (1) faith as the assurance of things hoped for that are true, (2) faith as the evidence of things not seen, and (3) faith as the principle of action in all intelligent beings. I describe these three components of faith in the Savior as simultaneously facing the future, looking to the past, and initiating action in the present. (“ Seek Learning by Faith ,” Ensign , Sept. 2007, 61–62) The image “ Exercising faith in Jesus Christ ” can help students understand Elder Bednar’s definition of faith in Jesus Christ. Draw the image on the board or display it for students to reference throughout the lesson. Open PDF What has God done in the past that can help you have faith in Him? How can having hope in God’s promised blessings help you exercise faith in Him? How would you summarize Elder Bednar’s teachings about faith in Jesus Christ? Help students identify a truth like: We exercise faith in Jesus Christ as we face the future, look to the past, and act in the present. Examples of faith The stories in Joshua 2–4 illustrate one or more of these elements of exercising faith in Jesus Christ. Help students study these stories. One way is to create a learning station for each chapter. You could place one section of the handout “ Examples of Faith in Jesus Christ from Joshua 2–4 ” in three different areas of the classroom. Students could rotate through each station and follow the instructions on the handout. For larger classes, you might want to create multiple learning stations for each section. Allow students to participate individually or in small groups. If possible, you could display the following at each learning station: A red thread for Joshua 2 A pair of shoes for Joshua 3 A stone for Joshua 4 Open PDF If students have questions about the destruction of the people in Jericho, you can refer to the question “Why were the Canaanites destroyed?” in the Additional Resources section of Lesson 63: “ Joshua 23–24 .” After enough time, invite students to share with the class what they learned about faith in Jesus Christ. Students could hold the red thread, the shoes, or the stone as they share. Questions such as the following could help. What have you learned about exercising faith in Jesus Christ? How could what you learned help youth today? Consider inviting students to share how they or someone they know has exercised faith in Jesus Christ by facing the future, acting in the present, and looking to the past. You could also share a personal experience about exercising faith in Jesus Christ.\n\n\n--- Lesson 63 ---\nAt the end of his life, Joshua reminded the Israelites who the Lord is and what He had done for them. Joshua invited them to choose to serve the Lord instead of false gods. This lesson can help students choose to serve the Lord over other influences. Student preparation: Invite students to bring a small rock to class. They will use it as a reminder of the plan they will make in the lesson. Possible Learning Activities The influence of distractions Consider inviting students to create a list of the top five things that can distract youth from choosing to serve the Lord. Students could work individually or as a group. Ask students to share their lists. What about these distractions might make them seem more appealing or more important than serving the Lord? You might explain that, if we are not careful, these distractions can become a modern version of worshipping and serving gods other than the Lord. What might be the long-term effect of continually choosing these influences over the Lord? Invite students to ponder the following questions or record their answers in their study journals. How might you be serving the Lord or serving something or someone else through your daily choices? What might be the long-term effect if you continue to make these choices? Invite students to seek the help of the Spirit to recognize what choices they can make to serve the Lord. The Lord our God A student could read the following paragraph to summarize Joshua 5–24 . After leading the Israelites over the Jordan River on dry ground (see Joshua 3–4 ), the Lord blessed the Israelites in their many battles with the Canaanites. The Israelites took possession of the land that God had promised them (see Joshua 5–12 ). The land was divided among the twelve tribes (see Joshua 13–22 ). Toward the end of his life, Joshua gave one final message to the Israelites (see Joshua 23–24 ). For the following activity, you could invite half of the class to read Joshua 23:3–11 , and the other half to read Joshua 24:3–11 . Students could mark what they find in their scriptures. Read Joshua 23:3–11 ; 24:3–11 , looking for what the Lord had done and would do for Israel. Invite students to share. You might do this by either writing their answers on the board as they share or asking students to come to the board to write what they found. Then, to help students reflect on how they have seen the Lord work in their lives, ask the following question. You could invite them to think about examples from Church history, general conference, their own lives, or the life of someone in their ward or family. What are some examples of how the Lord has blessed us today? Joshua 24:15 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. To help students understand Joshua 24:14–15 , you could invite them to rewrite what Joshua taught in their own words. They could rewrite the verses in partnerships or small groups. Read Joshua 24:14–15 . Rewrite what Joshua taught as if he were teaching the same thing today. Invite students to share how they rewrote Joshua’s counsel. Students might share something like “Stop following all these other influences around you and choose to follow the Lord! You can choose what you want, but I’m going to serve the Lord.” To help students identify a clear statement of truth, you could ask a question like the following. How would you summarize Joshua’s teachings in verse 15 ? Students might summarize verse 15 using words like we can use our agency to choose to serve the Lord . As you ask the following question, consider referring students to the answers they listed in the chart. What are ways that we can serve the Lord today? How can what you know about the Lord help you choose to serve Him? Choosing to serve the Lord Read Joshua 24:24–25 , looking for what the Israelites chose to do. To help students connect what they have learned to their own choices, consider asking them to write answers to the following questions. In your study journal, respond to one of the following sets of questions: What do you want to remember about the Lord that can help you serve Him when it might be difficult? How do you think remembering the Lord in those moments could help you? What will you start doing or stop doing to choose to serve the Lord? What blessings might you experience from doing that? You might want to ask willing students to share what they wrote down. Remind them not to share anything too personal. You could also share your testimony of the Lord and explain why you choose to love and serve Him instead of other things. Read Joshua 24:26–27 , looking for what Joshua did to remind the Israelites of their choice to serve the Lord. If students brought a rock to class, they could take it out now. Or they could draw a picture of a rock. Discuss where Joshua laid the stone (under the oak tree) and why he put it there (to remind the children of Israel of the covenant they made to serve the Lord). Ask students where they can put their rock to remind themselves of their plan to serve the Lord. Invite them to put their rock in a prominent place they will see regularly. They could also write something on the rock that reminds them of the Lord or their plan to serve Him, like “I will serve the Lord.” You might want to share the following statement with students. Testify of the long-term effect of choosing to serve the Lord. Elder Dale G. Renlund of the Quorum of the Twelve Apostles taught about the long-term effect of choosing to serve the Lord: We need to choose whom we will serve. The magnitude of our eternal happiness depends on choosing the living God and joining Him in His work. … Choosing to follow the Father’s plan is the only way we can become inheritors in His kingdom. (“ Choose You This Day ,” Ensign or Liahona , Nov. 2018, 106) Memorize You might want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Joshua 24:15 is “Choose you this day whom ye will serve.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Ruth;1",
      "content": "Sometimes we imagine that our lives should follow a clear path from beginning to end. The shortest distance between two points is a straight line, after all. And yet life is often full of delays and detours that take us in unexpected directions.\nRuth and Hannah surely understood this. Ruth was not an Israelite, but she married one, and when her husband died, she had a choice to make. Would she return to her family and her old, familiar life, or would she embrace the Israelite faith and a new home with her mother-in-law? (see\nRuth 1:4–18\n). Hannah’s plan for her life was to bear children, but she could not, and that left her “in bitterness of soul” (see\n1 Samuel 1:1–10\n). As you read about Ruth and Hannah, consider the faith they must have had to travel their unexpected paths. Then think about your own journey. It’s different from Ruth’s and Hannah’s—and anyone else’s. But throughout the trials and surprises between here and your eternal destination, you can learn to say with Hannah, “My heart rejoiceth in the Lord” (\n1 Samuel 2:1\n).\nSee also the Bible Dictionary for an overview of the books of\nRuth\nand\n1 Samuel\n.\nIdeas for Learning at Home and at Church\nRuth\nJesus Christ can turn tragedy into triumph.\nLife is hard for a widow in any era. But when Ruth’s husband died, her situation was especially hard. In Israelite culture at the time, a woman without a husband or sons had no right to property and very few ways to earn a living. As you read Ruth’s story, notice how the Lord turned tragedy into great blessings. What do you notice about Ruth that might have helped her? How did Boaz redeem Ruth from her desperate situation? (see\nRuth 4:4–10\n). How were both Ruth and Boaz like Jesus Christ?\nSee also “\nBe Still, My Soul\n,”\nHymns\n, no. 124.\nRuth\n;\n1 Samuel 1\nI can trust that God will guide and help me regardless of my situation.\nPerhaps you have suffered a great loss, as Ruth and Naomi did (see\nRuth 1:1–5\n). Or maybe, like Hannah, you long for blessings you have not yet received (see\n1 Samuel 1:1–10\n). How did these women show their faith in God? What do you learn from their examples?\nOf course, not everyone who prays for a child receives one, and not everyone whose spouse dies remarries. But everyone who turns to the Savior receives His help and guidance. Consider how you have “come to trust” the Lord (\nRuth 2:12\n) during your difficult times.\nSee also Amy A. Wright, “\nAbide the Day in Christ\n,”\nLiahona\n, Nov. 2023, 9–11.\nFor This Child I Prayed\n, by Elspeth Young\n1 Samuel 2\n;\n4–7\nTo receive the Lord’s help, I need to trust Him and obey His commandments.\nWhen their enemies attacked, the Israelites apparently thought that simply possessing the ark of the covenant would protect them. As you read\n1 Samuel 4–6\n, think about why that didn’t work. (Note also the unrighteous actions of Eli’s sons, who served as priests in the tabernacle, in\n1 Samuel 2:12–25\n.) What do you think the Lord was trying to teach His people? What do you learn from what happened to the Philistines after capturing the ark? (see\nchapters 5–6\n). What do you learn from Israel’s efforts to regain the Lord’s protection in\n1 Samuel 7\n?\nYou might be inspired by reading Hannah’s poem of praise in\n1 Samuel 2:1–10\n. What do you find in her words that could have helped Eli’s sons and the rest of the Israelites?\n1 Samuel 3\nI can hear and obey the voice of the Lord.\nAt times, you may feel like Samuel, who heard the voice of the Lord but did not recognize it. Like all of us, Samuel had to learn how to recognize the Lord’s voice. As you study\n1 Samuel 3\n, what do you learn from this young boy about hearing and obeying the Lord’s voice? You might also search these additional scriptures and make a list of guidelines that can help a person recognize the Lord’s voice:\n1 Kings 19:11–12\n;\nLuke 24:15–32\n;\n3 Nephi 11:3–7\n;\nDoctrine and Covenants 6:22–23\n;\n8:2–3\n;\n9:7–9\n.\nOther times, you may feel that the heavens are shut and that God does not want to communicate with you. President Russell M. Nelson said, “Does God really\nwant\nto speak to you? Yes!” (“\nRevelation for the Church, Revelation for Our Lives\n,”\nEnsign\nor\nLiahona\n, May 2018, 93–96). As you study President Nelson’s message, what do you find that inspires you to hear and obey the voice of the Lord? What does President Nelson invite you to do, and what blessings does he promise? You can also find invitations and promised blessings about revelation in “\nWalk in God’s light\n” (\nFor the Strength of Youth: A Guide for Making Choices\n, 16–20). Consider choosing one thing you can do to “increase your spiritual capacity to receive revelation.”\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat did it mean to glean a field?\nWhy was it significant that Boaz was one of Naomi’s “next kinsmen”?\nWhy did Naomi instruct Ruth to lay at the feet of Boaz?\nClick to see more.\nIdeas for Teaching Children\nRuth\nI can show love and kindness to people around me.\nAs you share with your children the story of Ruth (you could use “\nRuth and Naomi\n” in\nOld Testament Stories\n, 100–103), invite them to raise their hands every time they hear an act of kindness in the story. They could also share how they feel when others are kind to them, or when they are kind to others. How has the Savior been kind to us? How can we follow His example? (see “\nKindness Begins with Me,\n”\nChildren’s Songbook\n, 145).\n2:0\nRuth and Naomi\nRuth\n;\n1 Samuel 1\nI can have faith in the Lord.\nThe stories of Ruth and Hannah can inspire your children to stay faithful during hard times. Consider helping them create a simple chart with the headings\nTrials\n,\nActions\n,\nBlessings\n. Then you could read together\nRuth 1:3–5, 8, 16\n;\n2:1–3, 8–12\n;\n4:13–17\n;\n1 Samuel 1:1–18\nand write under the headings what they find in these verses. How did Ruth and Hannah show their faith in the Lord? You or your children could then share examples of how the Lord has blessed you during hard times.\n1 Samuel 1:1–18\nHeavenly Father hears and answers my prayers.\nTo learn about Hannah, your children could read\n1 Samuel 1:1–18\nor “\nHannah\n” in\nOld Testament Stories\n(104–5) or watch “Hannah’s Faith” (video, Gospel Library). It might be fun to toss a ball to a child and invite them to tell part of the story before passing the ball to someone else. What do we learn about prayer from Hannah’s example?\n1:15\nHannah\n3:9\nHannah's Faith\nSamuel Tells Eli the Truth\n, by Robert T. Barrett\n1 Samuel 3:1–10\nI can hear and obey the Lord’s voice.\nPerhaps a simple role-play could help your children learn from Samuel’s experience with revelation. One child could pretend to be Samuel, and another could pretend to be Eli as you read\n1 Samuel 3:1–10\n(see also “\nSamuel the Prophet\n” in\nOld Testament Stories\n, 106–9, or the video “Samuel and Eli,” Gospel Library). What do we learn from Samuel about how to hear the voice of the Lord? How do we show that we are willing to hear when the Lord speaks to us?\n2:10\nSamuel the Prophet\n1:58\nSamuel and Eli\nAsk your children how they would explain to someone how the Lord speaks to them. You could help them look for answers in\nDoctrine and Covenants 6:22–23\n;\n8:2–3\n;\n9:7–9\n.\nHelp your children learn to recognize the Spirit.\nIt’s not easy to discern between our own feelings and the Holy Ghost. Everyone struggles with this from time to time. Take every opportunity you can to help your children recognize when they are feeling the influence of the Spirit. For example, as you read\n1 Samuel 3:1–10\nand the suggested verses in the Doctrine and Covenants, you could share experiences in which the Lord has taught you in your mind and heart.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 23: Lesson 61: Lesson 61—Joshua 1This lesson can help increase students’ confidence that the Lord can help them be strong and courageous when they face challenges.; Lesson 62: Lesson 62—Joshua 2–4This lesson can help students understand how they can exercise faith in Jesus Christ....",
      "content": "\n--- Lesson 61 ---\nAs the Lord’s chosen prophet, Joshua was ordained by Moses to lead Israel into the promised land. Although this task may have seemed daunting, the Savior commanded Joshua to be strong and courageous, with a promise that He would not fail or forsake His prophet (see Joshua 1:5–6 ). This lesson can help increase students’ confidence that the Lord can help them be strong and courageous when they face challenges. Student preparation: Invite students to think of situations when a youth might need to demonstrate courage. Students could ask a family member or friend for experiences they have had that required courage. Possible Learning Activities Courage when facing challenges To begin class, consider writing the word Courage on the board. As students respond to the following questions, invite them to write their responses on the board. How was Jesus Christ an example of courage? What are some situations a teenager may face that would require courage? In your study journal, write down some of the challenges you are facing now or may face in the future that require courage. Self–assessment can help students evaluate their current situation and provide an opportunity for the Holy Ghost to meet their individual needs throughout the lesson. One way to do this could be to invite students to respond to the following prompts in their study journals. When I am asked to do something that seems challenging, I often feel . On a scale of 1 (low) to 5 (high), how confident do I feel that Heavenly Father and Jesus Christ will help me face my challenges with courage? Why? As you study today, pay attention to impressions from the Holy Ghost that can help you be courageous and increase your confidence that the Lord is with you. Joshua is ordained to lead the children of Israel Consider displaying an image of Moses ordaining Joshua, like the image from the beginning of this lesson (see Deuteronomy 34:9 ). Although Moses had been with the children of Israel since their deliverance from Egypt, the Lord called Joshua to lead them into the promised land. What are some of the challenges Joshua could have faced as the Lord’s prophet and military leader of Israel? Help students understand that Joshua would have the responsibility of the spiritual leadership of Israel. Joshua was also the military commander and would lead Israel to conquer the land from the Canaanites who were ripe in iniquity (see 1 Nephi 17:31–40 ). The Lord had promised this land to Abraham and his righteous posterity (see Joshua 1:1–4 ). Read Joshua 1:5–9 , marking repeated promises and instructions from the Lord that could have helped Joshua focus on Him when facing challenges. What do you find significant from these verses? How would you summarize a truth to help someone going through challenges? As students share truths they have identified, help them recognize that when we know the Lord is with us, we can be strong and courageous. You might use some or all of the following questions to help students understand this truth. Students might work with a partner or small group and then share what they discussed with the class. Think about the challenging situations listed on the board and in your journal. What might it look like to be strong and have courage when facing these challenges? What do you know about the Lord that could help someone be strong and have courage? How do you know this? Read Doctrine and Covenants 84:88 , looking for ways the Lord is with us. Ways to invite the Lord’s help The following activities can help students recognize ways to invite the Lord’s help when they need to be strong and courageous. Invite students to choose one of the activities. After an appropriate amount of time, students could share what they learned with those who chose the other activity. You might provide one of the statements available in Additional Resources for students to study with each activity. Activity A: Obedience to God’s law Read Joshua 1:7 and one or more of the following scriptures: John 15:10 ; 1 Nephi 3:7 ; Mosiah 2:41 ; Doctrine and Covenants 93:20 . What connections do you see between obeying God’s commandments and being strong and courageous? What are some ways Heavenly Father and Jesus Christ could bless us because of our obedience? Activity B: Meditating on God’s word Read Joshua 1:8 and one or more of the following scriptures: 2 Timothy 3:15–17 ; 2 Nephi 31:20 ; 32:3 . What helps you meditate on scriptures? How do you think meditating on God’s words can help you feel close to Him? Reviewing goals can help students recognize the progress they have made and make any needed adjustments to their goal. Encourage students to review the scripture study goal they may have set. Then invite them to evaluate their progress and make any adjustments to their goal. (For additional training on reminding students of their scripture study goals, see “ Encourage learners to come to know the Savior by studying the gospel daily—study goal ” in Teacher Development Skills [2022], 31.) Remembering the Lord is with us What are some ways you have felt the Lord with you during your challenges? Provide an opportunity for students to reflect on what they have learned and felt today. They could invite the Spirit to help them see how their efforts have increased their confidence that the Lord will be with them. In your study journal, think about the challenges you face now or may face in the future. What have you learned or felt about Heavenly Father and Jesus Christ that can help you be strong and courageous when facing challenges? From what you learned or felt about Heavenly Father and Jesus Christ, what do you want to remember the next time you feel uncertain about your ability to handle a difficult situation? Consider sharing your witness that the Lord will keep His promise to be with us always, never failing or forsaking us, just as He promised Joshua.\n\n\n--- Lesson 62 ---\nAfter the Israelites’ journey through the wilderness, the Lord commanded Joshua to lead them into the promised land. Entering the promised land required them to exercise faith in Jesus Christ. The children of Israel and a woman named Rahab demonstrated their faith in Jesus Christ. This lesson can help students understand how they can exercise faith in Jesus Christ. Student preparation: Invite students to find a scripture that helps them understand what it means to have faith in Jesus Christ. Ask them to come prepared to share it in class. If needed, they could look up “Faith” in the Topical Guide or Guide to the Scriptures. Possible Learning Activities Faith in Jesus Christ Consider beginning class by inviting a student to think of a word that represents their hobbies or interests—for example, basketball or singing . Ask students to describe their words without using the word itself. Class members can guess the word. Next, write faith on the board, and invite students to describe faith in Jesus Christ. They could share what they found as part of their preparation for class. You might want to point out that Heavenly Father wants us to exercise faith in Jesus Christ so that He can save and bless us (see 2 Nephi 26:13 ; Ether 12:12, 18 ; Moroni 7:33 ). Remind students that one of the roles of the Holy Ghost is to guide us to truth (see John 16:13 ). Encourage students to invite the Holy Ghost to help them better understand faith in Jesus Christ. How might increasing your faith in Jesus Christ help you in your current circumstances? Read what Elder David A. Bednar of the Quorum of the Twelve Apostles taught about faith in Jesus Christ, or watch the video “ Seek Learning by Faith ” from time code 3:15 to 4:33. The video is located on ChurchofJesusChrist.org . 33:36 The Apostle Paul defined faith as “the substance of things hoped for [and] the evidence of things not seen” ( Hebrews 11:1 ). Alma declared that faith is not a perfect knowledge; rather, if we have faith, we “hope for things which are not seen [but] are true” ( Alma 32:21 ). Additionally, we learn in the Lectures on Faith that faith is … “the principle of action in all intelligent beings.” These teachings highlight three basic elements of faith: (1) faith as the assurance of things hoped for that are true, (2) faith as the evidence of things not seen, and (3) faith as the principle of action in all intelligent beings. I describe these three components of faith in the Savior as simultaneously facing the future, looking to the past, and initiating action in the present. (“ Seek Learning by Faith ,” Ensign , Sept. 2007, 61–62) The image “ Exercising faith in Jesus Christ ” can help students understand Elder Bednar’s definition of faith in Jesus Christ. Draw the image on the board or display it for students to reference throughout the lesson. Open PDF What has God done in the past that can help you have faith in Him? How can having hope in God’s promised blessings help you exercise faith in Him? How would you summarize Elder Bednar’s teachings about faith in Jesus Christ? Help students identify a truth like: We exercise faith in Jesus Christ as we face the future, look to the past, and act in the present. Examples of faith The stories in Joshua 2–4 illustrate one or more of these elements of exercising faith in Jesus Christ. Help students study these stories. One way is to create a learning station for each chapter. You could place one section of the handout “ Examples of Faith in Jesus Christ from Joshua 2–4 ” in three different areas of the classroom. Students could rotate through each station and follow the instructions on the handout. For larger classes, you might want to create multiple learning stations for each section. Allow students to participate individually or in small groups. If possible, you could display the following at each learning station: A red thread for Joshua 2 A pair of shoes for Joshua 3 A stone for Joshua 4 Open PDF If students have questions about the destruction of the people in Jericho, you can refer to the question “Why were the Canaanites destroyed?” in the Additional Resources section of Lesson 63: “ Joshua 23–24 .” After enough time, invite students to share with the class what they learned about faith in Jesus Christ. Students could hold the red thread, the shoes, or the stone as they share. Questions such as the following could help. What have you learned about exercising faith in Jesus Christ? How could what you learned help youth today? Consider inviting students to share how they or someone they know has exercised faith in Jesus Christ by facing the future, acting in the present, and looking to the past. You could also share a personal experience about exercising faith in Jesus Christ.\n\n\n--- Lesson 63 ---\nAt the end of his life, Joshua reminded the Israelites who the Lord is and what He had done for them. Joshua invited them to choose to serve the Lord instead of false gods. This lesson can help students choose to serve the Lord over other influences. Student preparation: Invite students to bring a small rock to class. They will use it as a reminder of the plan they will make in the lesson. Possible Learning Activities The influence of distractions Consider inviting students to create a list of the top five things that can distract youth from choosing to serve the Lord. Students could work individually or as a group. Ask students to share their lists. What about these distractions might make them seem more appealing or more important than serving the Lord? You might explain that, if we are not careful, these distractions can become a modern version of worshipping and serving gods other than the Lord. What might be the long-term effect of continually choosing these influences over the Lord? Invite students to ponder the following questions or record their answers in their study journals. How might you be serving the Lord or serving something or someone else through your daily choices? What might be the long-term effect if you continue to make these choices? Invite students to seek the help of the Spirit to recognize what choices they can make to serve the Lord. The Lord our God A student could read the following paragraph to summarize Joshua 5–24 . After leading the Israelites over the Jordan River on dry ground (see Joshua 3–4 ), the Lord blessed the Israelites in their many battles with the Canaanites. The Israelites took possession of the land that God had promised them (see Joshua 5–12 ). The land was divided among the twelve tribes (see Joshua 13–22 ). Toward the end of his life, Joshua gave one final message to the Israelites (see Joshua 23–24 ). For the following activity, you could invite half of the class to read Joshua 23:3–11 , and the other half to read Joshua 24:3–11 . Students could mark what they find in their scriptures. Read Joshua 23:3–11 ; 24:3–11 , looking for what the Lord had done and would do for Israel. Invite students to share. You might do this by either writing their answers on the board as they share or asking students to come to the board to write what they found. Then, to help students reflect on how they have seen the Lord work in their lives, ask the following question. You could invite them to think about examples from Church history, general conference, their own lives, or the life of someone in their ward or family. What are some examples of how the Lord has blessed us today? Joshua 24:15 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. To help students understand Joshua 24:14–15 , you could invite them to rewrite what Joshua taught in their own words. They could rewrite the verses in partnerships or small groups. Read Joshua 24:14–15 . Rewrite what Joshua taught as if he were teaching the same thing today. Invite students to share how they rewrote Joshua’s counsel. Students might share something like “Stop following all these other influences around you and choose to follow the Lord! You can choose what you want, but I’m going to serve the Lord.” To help students identify a clear statement of truth, you could ask a question like the following. How would you summarize Joshua’s teachings in verse 15 ? Students might summarize verse 15 using words like we can use our agency to choose to serve the Lord . As you ask the following question, consider referring students to the answers they listed in the chart. What are ways that we can serve the Lord today? How can what you know about the Lord help you choose to serve Him? Choosing to serve the Lord Read Joshua 24:24–25 , looking for what the Israelites chose to do. To help students connect what they have learned to their own choices, consider asking them to write answers to the following questions. In your study journal, respond to one of the following sets of questions: What do you want to remember about the Lord that can help you serve Him when it might be difficult? How do you think remembering the Lord in those moments could help you? What will you start doing or stop doing to choose to serve the Lord? What blessings might you experience from doing that? You might want to ask willing students to share what they wrote down. Remind them not to share anything too personal. You could also share your testimony of the Lord and explain why you choose to love and serve Him instead of other things. Read Joshua 24:26–27 , looking for what Joshua did to remind the Israelites of their choice to serve the Lord. If students brought a rock to class, they could take it out now. Or they could draw a picture of a rock. Discuss where Joshua laid the stone (under the oak tree) and why he put it there (to remind the children of Israel of the covenant they made to serve the Lord). Ask students where they can put their rock to remind themselves of their plan to serve the Lord. Invite them to put their rock in a prominent place they will see regularly. They could also write something on the rock that reminds them of the Lord or their plan to serve Him, like “I will serve the Lord.” You might want to share the following statement with students. Testify of the long-term effect of choosing to serve the Lord. Elder Dale G. Renlund of the Quorum of the Twelve Apostles taught about the long-term effect of choosing to serve the Lord: We need to choose whom we will serve. The magnitude of our eternal happiness depends on choosing the living God and joining Him in His work. … Choosing to follow the Father’s plan is the only way we can become inheritors in His kingdom. (“ Choose You This Day ,” Ensign or Liahona , Nov. 2018, 106) Memorize You might want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Joshua 24:15 is “Choose you this day whom ye will serve.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 25019,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.384423"
}