{
  "week_number": 19,
  "date_range": "Numbers 11–14",
  "title": ";20–24;27",
  "primary_scriptures": [
    {
      "book": "Numbers",
      "chapters": [
        "11",
        "12",
        "13",
        "14"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Numbers",
      "chapters": [
        "11",
        "12",
        "13",
        "14"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;20–24;27 ---\nEven on foot, it wouldn’t take 40 years to travel from the wilderness of Sinai to the promised land in Canaan. But that’s how long the children of Israel needed—not to cover the geographical distance but to cover the spiritual distance: the distance between who they were and who they could become as God’s covenant people.\nThe book of Numbers describes some of what happened during those 40 years, including lessons the children of Israel needed to learn before entering the promised land. They learned about being faithful to the Lord’s servants (see\nNumbers 12\n). They learned about trusting the Lord’s power, even when the future seems hopeless (see\nNumbers 13–14\n). And they learned that being faithless brings spiritual harm, but they could repent and look to the Savior for healing (see\nNumbers 21:4–9\n).\nWe’re all like the Israelites in some ways. We know what it’s like to be in a spiritual wilderness, and the lessons they learned can help us prepare to enter our promised land: eternal life with our Heavenly Father.\nFor an overview of the book of Numbers, see “\nNumbers\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nNumbers 11:11–17, 24–29\n;\n12\nRevelation is available to everyone, but God guides His Church through His prophet.\nIn\nNumbers 11:11–17, 24–29\n, notice the problem Moses faced and the solution God proposed. What do you think Moses meant when he said he wished “that all the Lord’s people were prophets”? (\nverse 29\n). As you ponder this question, look for possible answers in President Russell M. Nelson’s message “\nRevelation for the Church, Revelation for Our Lives\n” (\nEnsign\nor\nLiahona\n, May 2018, 93–96).\nSaying we can all receive revelation, however, doesn’t mean we all can lead God’s people the way Moses did. The event in\nNumbers 12\nmakes this clear. What cautions do you find in this chapter? What do you feel the Lord wants you to understand about personal revelation and following His prophet?\nSee also\n1 Nephi 10:17\n;\nDoctrine and Covenants 28:1–7\n; Dallin H. Oaks, “\nTwo Lines of Communication\n,”\nEnsign\nor\nLiahona\n, Nov. 2010, 83–86.\nFocus on what’s most important.\nSome people get overwhelmed with the weekly reading suggestions in\nCome, Follow Me\n. As you review the outlines, follow the Spirit. Consider your own needs and the needs of the people you may be teaching. Understanding and fully applying\none\nprinciple in a week could be more helpful than reading several chapters only superficially.\nNumbers 12:3\n“Moses was very meek.”\nSome people are surprised to learn that Moses, the mighty leader who stood before Pharaoh and performed stunning miracles with the Lord’s power, was also “very meek” (\nNumbers 12:3\n). What does it mean to be meek? Consider studying Elder David A. Bednar’s explanation in “\nMeek and Lowly of Heart\n” (\nEnsign\nor\nLiahona\n, May 2018, 30–33) or “\nMeek, Meekness\n” in Guide to the Scriptures (Gospel Library).\nWhat do you learn from Moses’s examples of meekness in\nExodus 18:13–25\n;\nNumbers 11:26–29\n;\nNumbers 12\n;\nHebrews 11:24–27\n; and\nMoses 1:10–11\n? You might also ponder how the Savior showed meekness (see\nMatthew 11:29\n;\n27:11–14\n;\nLuke 22:41–42\n;\nJohn 13:4–5\n). What do these examples teach you?\nNumbers 13–14\nWith faith in the Lord, I can have hope for the future.\nAs you read\nNumbers 13–14\n, try to put yourself in the place of the Israelites. Why do you think they wanted to “return into Egypt”? (\nNumbers 14:3\n). How would you describe the other “spirit” Caleb had? (\nNumbers 14:24\n). What impresses you about the faith of Caleb and Joshua, and how might you apply their examples to situations you face?\nTen of the Israelite spies were afraid; Joshua and Caleb had faith.\nJoshua and Caleb: Obedient Spies\n, by Douglas Klauba. © Lifeway Collection/licensed from\ngoodsalt.com\nNumbers 21:4–9\nIf I look to Jesus Christ in faith, He can heal me spiritually.\nBook of Mormon prophets knew the story found in\nNumbers 21:4–9\nand understood its spiritual significance. Read their teachings about this story in\n1 Nephi 17:40–41\n;\nAlma 33:18–22\n; and\nHelaman 8:13–15\n. Here are some questions to ponder as you do:\nWhat could the brass serpent represent?\nWhat might the snakebites represent?\nThe Israelites had to “[behold] the serpent of brass” (\nNumbers 21:9\n) to be healed. Why do you think some people refused to look? Does something similar ever happen to you?\nWhat do you feel inspired to do to more fully “look upon the Son of God with faith” and be healed? (\nHelaman 8:15\n). You may find some ideas in President D. Todd Christofferson’s message “\nLook to God and Live\n” (\nLiahona\n, Nov. 2025, 86–90)\nReading these passages might remind you of other times in the scriptures when people needed to keep their focus on Christ. For example, compare the message of\nNumbers 21:4–9\nwith\nMatthew 14:25–31\nand\n1 Nephi 8:24–28\n(see also the pictures at the end of this week’s outline). What tends to draw us away from Christ? How does He bless people who stay focused on Him?\nSee also “\nJesus, the Very Thought of Thee\n” (\nHymns\n, no. 141).\nNumbers 22–24\nI can follow God’s will, even if others try to persuade me not to.\nWhen Balak, the king of Moab, learned that the Israelites were approaching, he called for Balaam, a man known for pronouncing blessings and curses. Balak wanted him to curse the Israelites. Notice how Balak tried to persuade Balaam (see\nNumbers 22:5–7, 15–17\n), and think about temptations you might face to go against God’s will. What impresses you about Balaam’s responses in\nNumbers 22:18, 38\n;\n23:8, 12, 26\n;\n24:13\n? Sadly, Balaam eventually gave in to pressure and betrayed Israel (see\nNumbers 31:16\n;\nJude 1:11\n). Ponder how you can remain faithful to the Lord despite pressure from others.\nStudy Helps\nWhat was significant about Oshea being called Joshua?\nWho was Balaam?\nClick to see more.\nIdeas for Teaching Children\nNumbers 11:4–10\nI can be thankful for what God has given me.\nAsk your children if they remember some of the miracles the Lord performed to help the Israelites (see “\nThe Plagues of Egypt\n” and “\nThe Passover\n” in\nOld Testament Stories\n, 67–74). Then you could summarize for them\nNumbers 11:4–10\n, emphasizing that the Israelites had forgotten their blessings and were complaining. What blessings do we sometimes forget?\nAs you sing or listen to a song about gratitude, such as “\nCount Your Blessings\n” (\nHymns\n, no. 241), your children could draw pictures of blessings the Lord has given them.\nNumbers 12\nThe Lord wants me to follow His prophet.\nTo introduce\nNumbers 12\n, you could tell your children that the Lord was unhappy with Aaron and Miriam, Moses’s brother and sister. Invite them to read\nNumbers 12:1–8\nto find out why. Consider using the\nGospel Art Book\nto help your children find examples of people in the scriptures who respected the Lord’s prophet and were blessed. How are we blessed when we follow the Lord’s prophet?\nNumbers 21:6–9\nI can look to Jesus Christ.\nYou could use “\nMoses and the Brass Serpent\n” in\nOld Testament Stories\n, 83–84, to help your children learn what happened in\nNumbers 21:6–9\n. How is the brass serpent like Jesus Christ? (see\nJohn 3:14–15\n). Your children might enjoy making a serpent out of paper and writing on it some simple things they can do to “look upon the Son of God with faith” (\nHelaman 8:15\n).\n1:2\nMoses and the Brass Serpent\nOlder children could choose one of the following scriptures and share what it adds to their understanding of the story:\n1 Nephi 17:41\n;\nAlma 33:18–20\n;\nHelaman 8:13–15\n;\nDoctrine and Covenants 6:36\n.\nBronze Serpent\n, by Brent Evans\nNumbers 22–24\nI can follow God’s will, even if others try to persuade me not to.\nSummarize\nNumbers 22:1–18\nfor your children, emphasizing how Balaam refused to curse God’s people, even though Balak, the king of Moab, offered him honor and riches. Then you could help your children search the following verses for phrases that they feel show that Balaam wanted to follow God:\nNumbers 22:18\n;\n23:26\n;\n24:13\n. Perhaps your children could pick one phrase they like and write it on a card to help them remember to obey the Lord.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SCRIPTURE: Numbers 11 ---\n1. Andwhenthe peoplecomplained, it displeased theLord: and theLordheardit;and his anger was kindled; and thefireof theLordburnt among them, and consumedthem that werein the uttermost parts of the camp.\n2. And the people cried unto Moses; and when Moses prayed unto theLord, the fire was quenched.\n3. And he called the name of the place Taberah: because the fire of theLordburnt among them.\n4. And the mixed multitude thatwasamong them fell alusting: and the children of Israel also wept again, and said, Who shall give us flesh to eat?\n5. We remember the fish, which we did eat in Egypt freely; the cucumbers, and the melons, and the leeks, and the onions, and the garlick:\n6. But now our soulisdried away:there isnothing at all, beside this manna,beforeour eyes.\n7. And themannawasascorianderseed, and the colour thereof as the colour of bdellium.\n8. Andthe people went about, and gatheredit,and grounditin mills, or beatitin mortar, and bakeditin pans, and made cakes of it: and the taste of it was as the taste of fresh oil.\n9. And when the dew fell upon the camp in the night, the manna fellupon it.\n10. Then Moses heard the people weep throughout their families, every man in the door of his tent: and the anger of theLordwas kindled greatly; Moses also was displeased.\n11. And Moses said unto theLord, Wherefore hast thou afflicted thy servant? and wherefore have I not found favour in thy sight, that thou layest the burden of all this people upon me?\n12. Have I conceived all this people? have I begotten them, that thou shouldest say unto me, Carry them in thy bosom, as nursing father beareth the sucking child, unto the land which thou swarest unto their fathers?\n13. Whence should I have flesh to give unto all this people? for they weep unto me, saying, Give us flesh, that we may eat.\n14. I am not able to bear all this people alone, becauseit istooheavyfor me.\n15. And if thou deal thus with me, kill me, I pray thee,out of hand, if I have found favour in thy sight; and let me not see my wretchedness.\n16. And theLordsaid unto Moses, Gather unto meseventymen of the elders of Israel, whom thou knowest to be the elders of the people, andofficersover them; and bring them unto thetabernacle of the congregation, that they may stand there with thee.\n17. And I will come down and talk with thee there: and I will take of the spirit whichisupon thee, and will putitupon them; and they shallbearthe burden of the people with thee, that thou bearitnot thyself alone.\n18. And say thou unto the people, Sanctify yourselves against to morrow, and ye shall eat flesh: for ye have wept in the ears of theLord, saying, Who shall give us flesh to eat? forit waswell with us in Egypt: therefore theLordwill give you flesh, and ye shall eat.\n19. Ye shall not eat one day, nor two days, nor five days, neither ten days, nor twenty days;\n20. Buteven whole month, until it come out at your nostrils, and it be loathsome unto you: because that ye have despised theLordwhichisamong you, and have wept before him, saying, Why came we forth out of Egypt?\n21. And Moses said, The people, among whom Iam, aresix hundred thousand footmen; and thou hast said, I will give them flesh, that they may eat whole month.\n22. Shall the flocks and the herds be slain for them, to suffice them? or shall all the fish of the sea be gathered together for them, to suffice them?\n23. And theLordsaid unto Moses, Is theLords hand waxed short? thou shalt see now whether my word shall come to pass unto thee or not.\n24. And Moses went out, and told the people the words of theLord, and gathered theseventymen of the elders of the people, and set them round about the tabernacle.\n25. And theLordcame down in acloud, and spake unto him, and took of the spirit thatwasupon him, and gaveitunto the seventyelders: and it came to pass,that,when the spirit rested upon them, theyprophesied, and did not cease.\n26. But there remained twoof themen in the camp, the name of the onewasEldad, and the name of the other Medad: and the spiritrested upon them; and theywereof them that were written, but went not out unto the tabernacle: and they prophesied in the camp.\n27. And there ran young man, and told Moses, and said, Eldad and Medad do prophesy in the camp.\n28. AndJoshuathe son ofNun, the servant of Moses,oneof his young men, answered and said, My lord Moses, forbid them.\n29. And Moses said unto him, Enviest thou for my sake? would God that all theLords people wereprophets,andthat theLordwould put his spirit upon them!\n30. And Moses gat him into the camp, he and the elders of Israel.\n31. And there went forth wind from theLord, and broughtquailsfrom the sea, and letthemfall by the camp, as it were days journey on this side, and as it were days journey on the other side, round about the camp, and as it were two cubitshighupon the face of the earth.\n32. And the people stood up all that day, and allthatnight, and all the next day, and they gathered the quails: he that gathered least gathered ten homers: and they spreadthemall abroad for themselves round about the camp.\n33. And while the fleshwasyet between their teeth, ere it was chewed, the wrath of theLordwas kindled against the people, and theLordsmote the people with very greatplague.\n34. And he called the name of that placeKibroth-hattaavah: because there they buried the people thatlusted.\n35. Andthe people journeyed from Kibroth-hattaavah unto Hazeroth; and abode at Hazeroth.\n\n--- SCRIPTURE: Numbers 12 ---\n1. And Miriam and Aaron spake against Moses because of theEthiopianwoman whom he had married: for he had married an Ethiopian woman.\n2. And they said, Hath theLordindeed spoken only by Moses? hath he not spoken also by us? And theLordheardit.\n3. (Now the man Moseswasverymeek, above all the men whichwereupon the face of the earth.)\n4. And theLordspake suddenly unto Moses, and unto Aaron, and unto Miriam, Come out ye three unto the tabernacle of the congregation. And they three came out.\n5. And theLordcame down in thepillarof the cloud, and stoodinthe door of the tabernacle, and called Aaron and Miriam: and they both came forth.\n6. And he said, Hear now my words: If there be aprophetamong you,ItheLordwill make myself known unto him in avision,andwill speak unto him in adream.\n7. My servant Mosesisnot so, whoisfaithful in all mine house.\n8. With him will Ispeakmouthto mouth, even apparently, and not in dark speeches; and the similitude of theLordshall hebehold: wherefore then were ye not afraid to speak against my servant Moses?\n9. And the anger of theLordwas kindled against them; and he departed.\n10. And the cloud departed fromoff the tabernacle; and, behold, Miriambecameleprous,whiteas snow: and Aaron looked upon Miriam, and, behold,she wasleprous.\n11. And Aaron said unto Moses, Alas, my lord, I beseech thee, lay not the sin upon us, wherein we have done foolishly, and wherein we have sinned.\n12. Let her not be as one dead, of whom the flesh is half consumed when he cometh out of his mothers womb.\n13. And Moses cried unto theLord, saying,Healher now, O God, I beseech thee.\n14. And theLordsaid unto Moses, If her father had but spit in her face, should she not be ashamed seven days? let her be shut out from the camp seven days, and after that let her be received inagain.\n15. And Miriam was shut out from the camp seven days: and the people journeyed not till Miriam was brought inagain.\n16. And afterward the people removed from Hazeroth, and pitched in the wilderness of Paran.\n\n--- SCRIPTURE: Numbers 13 ---\n1. And theLordspake unto Moses, saying,\n2. Sendthou men, that they maysearchthe land of Canaan, which I give unto the children of Israel: of every tribe of their fathers shall ye send man, every one ruler among them.\n3. And Moses by the commandment of theLordsent them from the wilderness of Paran: all those menwereheads of the children of Israel.\n4. And theseweretheir names: of the tribe of Reuben, Shammua the son of Zaccur.\n5. Of the tribe of Simeon, Shaphat the son of Hori.\n6. Of the tribe of Judah,Calebthe son of Jephunneh.\n7. Of the tribe of Issachar, Igal the son of Joseph.\n8. Of the tribe of Ephraim, Oshea the son of Nun.\n9. Of the tribe of Benjamin, Palti the son of Raphu.\n10. Of the tribe of Zebulun, Gaddiel the son of Sodi.\n11. Of the tribe of Joseph,namely,of the tribe of Manasseh, Gaddi the son of Susi.\n12. Of the tribe of Dan, Ammiel the son of Gemalli.\n13. Of the tribe of Asher, Sethur the son of Michael.\n14. Of the tribe of Naphtali, Nahbi the son of Vophsi.\n15. Of the tribe of Gad, Geuel the son of Machi.\n16. Thesearethe names of the men which Moses sent to spy out theland. And Moses calledOsheathe son ofNunJehoshua.\n17. And Moses sent them to spy out the land of Canaan, and said unto them, Get you upthiswaysouthward, and go up into the mountain:\n18. And see the land, what itis;and the people that dwelleth therein, whether theybestrong or weak, few or many;\n19. And what the landisthat they dwell in, whether itbegood or bad; and what citiesthey bethat they dwell in, whether in tents, or in strong holds;\n20. And what the landis,whether itbefat or lean, whether there be wood therein, or not. And be ye of good courage, and bring of the fruit of the land. Now the timewasthe time of the firstripe grapes.\n21. So they went up, and searched the land from the wilderness of Zin unto Rehob,as men come toHamath.\n22. And theyascended by thesouth, and came untoHebron; where Ahiman, Sheshai, and Talmai, the children of Anak,were.(Now Hebron was built seven years beforeZoanin Egypt.)\n23. And they came unto thebrookof Eshcol, and cut down from thence branch with one cluster of grapes, and they bare it between two upon staff; andthey broughtof the pomegranates, and of the figs.\n24. The place was called the brook Eshcol, because of the cluster of grapes which the children of Israel cut down from thence.\n25. And they returned from searching of the land after forty days.\n26. And they went and came to Moses, and to Aaron, and to all the congregation of the children of Israel, unto the wilderness of Paran, to Kadesh; and brought back word unto them, and unto all the congregation, and shewed them the fruit of the land.\n27. And they told him, and said, We came unto the land whither thou sentest us, and surely itflowethwith milk and honey; and thisisthe fruit of it.\n28. Nevertheless the peoplebestrong that dwell in the land, and the citiesarewalled,andvery great: and moreover we saw the children of Anak there.\n29. TheAmalekitesdwell in the land of thesouth: and the Hittites, and the Jebusites, and the Amorites, dwell in the mountains: and the Canaanites dwell by the sea, and by the coast of Jordan.\n30. AndCalebstilled the people before Moses, and said, Let us go up at once, and possess it; for we are well able to overcome it.\n31. But thementhat went up with him said, We be not able to go up against the people; for theyarestronger than we.\n32. And they brought up an evil report of the land which they had searched unto the children of Israel, saying, The land, through which we have gone to search it,isa land that eateth up the inhabitants thereof; and all the people that we saw in itaremen of great stature.\n33. And there we saw thegiants, the sons of Anak,which comeof thegiants: and we were in our own sight as grasshoppers, and so we were in their sight.\n\n--- SCRIPTURE: Numbers 14 ---\n1. And all the congregation lifted up their voice, and cried; and the people wept that night.\n2. And all the children of Israelmurmuredagainst Moses and against Aaron: and the whole congregation said unto them, Would God that we had died in the land of Egypt! or would God we had died in this wilderness!\n3. And wherefore hath theLordbrought us unto this land, to fall by the sword, that our wives and our children should be prey? were it not better for us to return into Egypt?\n4. And they said one to another, Let us make captain, and let usreturninto Egypt.\n5. Then Moses and Aaron fell on their faces before all the assembly of the congregation of the children of Israel.\n6. AndJoshuathe son of Nun,and Caleb the son of Jephunneh,which wereof them that searched the land, rent their clothes:\n7. And they spake unto all the company of the children of Israel, saying, The land, which we passed through to search it,isan exceeding good land.\n8. If theLorddelight in us, then he will bring us into this land, and give it us; land which floweth with milk and honey.\n9. Onlyrebelnot ye against theLord, neither fear ye the people of the land; for theyarebread for us: their defence is departed from them, and theLordiswith us:fearthem not.\n10. But all the congregation bade stone them with stones. And thegloryof theLordappeared in the tabernacle of the congregation before all the children of Israel.\n11. And theLordsaid unto Moses, How long will this peopleprovokeme? and how long will it be ere theybelieveme, for all the signs which I have shewed among them?\n12. I will smite them with the pestilence, and disinherit them, and will make of thee greaternationand mightier than they.\n13. And Moses said unto theLord, Then theEgyptiansshall hearit,(for thou broughtest up this people in thy might from among them;)\n14. And they will tellitto the inhabitants of this land:forthey have heard that thouLordartamongthis people, that thouLordart seen face to face, andthatthycloudstandeth over them, andthatthougoestbefore them, by day time in apillarof acloud, and in pillar of fire by night.\n15. Nowifthou shalt killallthis people as one man, then the nations which have heard the fame of thee will speak, saying,\n16. Because theLordwas not able to bring this people into the land which he sware unto them, therefore he hath slain them in the wilderness.\n17. And now, I beseech thee, let the power of my Lord be great, according as thou hast spoken, saying,\n18. TheLordislongsuffering, and of great mercy,forgivinginiquity and transgression, and by no means clearingthe guilty,visiting the iniquity of the fathers upon the children unto the third and fourthgeneration.\n19. Pardon, I beseech thee, the iniquity of this people according unto the greatness of thy mercy, and as thou hast forgiven this people, from Egypt even until now.\n20. And theLordsaid,Ihave pardoned according to thy word:\n21. ButastrulyasI live, all the earth shall befilledwith the glory of theLord.\n22. Because all those men which have seen my glory, and mymiracles, which I did in Egypt and in the wilderness, and havetemptedme now these ten times, and have not hearkened to my voice;\n23. Surely they shall notseethelandwhich I sware unto their fathers, neither shall any of them thatprovokedme see it:\n24. But my servantCaleb, because he had another spirit with him, and hathfollowedme fully, him will Ibringinto the land whereinto he went; and his seed shall possess it.\n25. (Now theAmalekitesand the Canaanites dwelt in the valley.) To morrow turn you, and get you intothe wilderness by the way of the Red sea.\n26. And theLordspake unto Moses and unto Aaron, saying,\n27. How longshall I bear withthis evil congregation, whichmurmuragainst me? I have heard the murmurings of the children of Israel, which they murmur against me.\n28. Say unto them,As truly asI live, saith theLord, as ye have spoken in mine ears, so will I do to you:\n29. Yourcarcasesshall fall in thiswilderness; and all that were numbered of you, according to your whole number, from twenty years old and upward, which have murmured against me,\n30. Doubtless ye shall not come into the land,concerningwhich I sware to make you dwell therein, save Caleb the son of Jephunneh, and Joshua the son of Nun.\n31. But your little ones, which ye said should be prey, them will I bring in, and they shall know the land which ye have despised.\n32. Butas foryou, your carcases, they shall fall in this wilderness.\n33. And your children shall wander in the wildernessfortyyears, andbear your whoredoms, until your carcases be wasted in the wilderness.\n34. After the number of the days in which ye searched the land,evenforty days, each day for year, shall ye bear your iniquities,evenforty years, and ye shallknowmy breach of promise.\n35. I theLordhave said, I will surely do it unto all this evil congregation, that are gathered together against me: in this wilderness they shall be consumed, and there they shalldie.\n36. And the men, which Moses sent to search the land, who returned, and made all the congregation to murmur against him, by bringing up slander upon the land,\n37. Even those men that did bring up the evil report upon the land,diedby theplaguebefore theLord.\n38. But Joshua the son of Nun, and Caleb the son of Jephunneh,which wereof the men that went to search the land, livedstill.\n39. And Moses told these sayings unto all the children of Israel: and the peoplemournedgreatly.\n40. And they rose up early in the morning, and gat them up into the top of the mountain, saying, Lo, webe here,and will go up unto the place which theLordhath promised: for we havesinned.\n41. And Moses said, Wherefore now do ye transgress the commandment of theLord? but it shall not prosper.\n42. Go not up, for theLordisnot among you; that ye be not smitten before your enemies.\n43. For theAmalekitesand the Canaanitesarethere before you, and ye shall fall by the sword: because ye are turned away from theLord, therefore theLordwill not be with you.\n44. But theypresumedto go up unto the hill top: nevertheless the ark of the covenant of theLord, and Moses, departed not out of the camp.\n45. Then the Amalekites came down, and the Canaanites which dwelt in that hill, and smote them, and discomfited them,evenunto Hormah.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";20–24;27",
      "content": "Even on foot, it wouldn’t take 40 years to travel from the wilderness of Sinai to the promised land in Canaan. But that’s how long the children of Israel needed—not to cover the geographical distance but to cover the spiritual distance: the distance between who they were and who they could become as God’s covenant people.\nThe book of Numbers describes some of what happened during those 40 years, including lessons the children of Israel needed to learn before entering the promised land. They learned about being faithful to the Lord’s servants (see\nNumbers 12\n). They learned about trusting the Lord’s power, even when the future seems hopeless (see\nNumbers 13–14\n). And they learned that being faithless brings spiritual harm, but they could repent and look to the Savior for healing (see\nNumbers 21:4–9\n).\nWe’re all like the Israelites in some ways. We know what it’s like to be in a spiritual wilderness, and the lessons they learned can help us prepare to enter our promised land: eternal life with our Heavenly Father.\nFor an overview of the book of Numbers, see “\nNumbers\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nNumbers 11:11–17, 24–29\n;\n12\nRevelation is available to everyone, but God guides His Church through His prophet.\nIn\nNumbers 11:11–17, 24–29\n, notice the problem Moses faced and the solution God proposed. What do you think Moses meant when he said he wished “that all the Lord’s people were prophets”? (\nverse 29\n). As you ponder this question, look for possible answers in President Russell M. Nelson’s message “\nRevelation for the Church, Revelation for Our Lives\n” (\nEnsign\nor\nLiahona\n, May 2018, 93–96).\nSaying we can all receive revelation, however, doesn’t mean we all can lead God’s people the way Moses did. The event in\nNumbers 12\nmakes this clear. What cautions do you find in this chapter? What do you feel the Lord wants you to understand about personal revelation and following His prophet?\nSee also\n1 Nephi 10:17\n;\nDoctrine and Covenants 28:1–7\n; Dallin H. Oaks, “\nTwo Lines of Communication\n,”\nEnsign\nor\nLiahona\n, Nov. 2010, 83–86.\nFocus on what’s most important.\nSome people get overwhelmed with the weekly reading suggestions in\nCome, Follow Me\n. As you review the outlines, follow the Spirit. Consider your own needs and the needs of the people you may be teaching. Understanding and fully applying\none\nprinciple in a week could be more helpful than reading several chapters only superficially.\nNumbers 12:3\n“Moses was very meek.”\nSome people are surprised to learn that Moses, the mighty leader who stood before Pharaoh and performed stunning miracles with the Lord’s power, was also “very meek” (\nNumbers 12:3\n). What does it mean to be meek? Consider studying Elder David A. Bednar’s explanation in “\nMeek and Lowly of Heart\n” (\nEnsign\nor\nLiahona\n, May 2018, 30–33) or “\nMeek, Meekness\n” in Guide to the Scriptures (Gospel Library).\nWhat do you learn from Moses’s examples of meekness in\nExodus 18:13–25\n;\nNumbers 11:26–29\n;\nNumbers 12\n;\nHebrews 11:24–27\n; and\nMoses 1:10–11\n? You might also ponder how the Savior showed meekness (see\nMatthew 11:29\n;\n27:11–14\n;\nLuke 22:41–42\n;\nJohn 13:4–5\n). What do these examples teach you?\nNumbers 13–14\nWith faith in the Lord, I can have hope for the future.\nAs you read\nNumbers 13–14\n, try to put yourself in the place of the Israelites. Why do you think they wanted to “return into Egypt”? (\nNumbers 14:3\n). How would you describe the other “spirit” Caleb had? (\nNumbers 14:24\n). What impresses you about the faith of Caleb and Joshua, and how might you apply their examples to situations you face?\nTen of the Israelite spies were afraid; Joshua and Caleb had faith.\nJoshua and Caleb: Obedient Spies\n, by Douglas Klauba. © Lifeway Collection/licensed from\ngoodsalt.com\nNumbers 21:4–9\nIf I look to Jesus Christ in faith, He can heal me spiritually.\nBook of Mormon prophets knew the story found in\nNumbers 21:4–9\nand understood its spiritual significance. Read their teachings about this story in\n1 Nephi 17:40–41\n;\nAlma 33:18–22\n; and\nHelaman 8:13–15\n. Here are some questions to ponder as you do:\nWhat could the brass serpent represent?\nWhat might the snakebites represent?\nThe Israelites had to “[behold] the serpent of brass” (\nNumbers 21:9\n) to be healed. Why do you think some people refused to look? Does something similar ever happen to you?\nWhat do you feel inspired to do to more fully “look upon the Son of God with faith” and be healed? (\nHelaman 8:15\n). You may find some ideas in President D. Todd Christofferson’s message “\nLook to God and Live\n” (\nLiahona\n, Nov. 2025, 86–90)\nReading these passages might remind you of other times in the scriptures when people needed to keep their focus on Christ. For example, compare the message of\nNumbers 21:4–9\nwith\nMatthew 14:25–31\nand\n1 Nephi 8:24–28\n(see also the pictures at the end of this week’s outline). What tends to draw us away from Christ? How does He bless people who stay focused on Him?\nSee also “\nJesus, the Very Thought of Thee\n” (\nHymns\n, no. 141).\nNumbers 22–24\nI can follow God’s will, even if others try to persuade me not to.\nWhen Balak, the king of Moab, learned that the Israelites were approaching, he called for Balaam, a man known for pronouncing blessings and curses. Balak wanted him to curse the Israelites. Notice how Balak tried to persuade Balaam (see\nNumbers 22:5–7, 15–17\n), and think about temptations you might face to go against God’s will. What impresses you about Balaam’s responses in\nNumbers 22:18, 38\n;\n23:8, 12, 26\n;\n24:13\n? Sadly, Balaam eventually gave in to pressure and betrayed Israel (see\nNumbers 31:16\n;\nJude 1:11\n). Ponder how you can remain faithful to the Lord despite pressure from others.\nStudy Helps\nWhat was significant about Oshea being called Joshua?\nWho was Balaam?\nClick to see more.\nIdeas for Teaching Children\nNumbers 11:4–10\nI can be thankful for what God has given me.\nAsk your children if they remember some of the miracles the Lord performed to help the Israelites (see “\nThe Plagues of Egypt\n” and “\nThe Passover\n” in\nOld Testament Stories\n, 67–74). Then you could summarize for them\nNumbers 11:4–10\n, emphasizing that the Israelites had forgotten their blessings and were complaining. What blessings do we sometimes forget?\nAs you sing or listen to a song about gratitude, such as “\nCount Your Blessings\n” (\nHymns\n, no. 241), your children could draw pictures of blessings the Lord has given them.\nNumbers 12\nThe Lord wants me to follow His prophet.\nTo introduce\nNumbers 12\n, you could tell your children that the Lord was unhappy with Aaron and Miriam, Moses’s brother and sister. Invite them to read\nNumbers 12:1–8\nto find out why. Consider using the\nGospel Art Book\nto help your children find examples of people in the scriptures who respected the Lord’s prophet and were blessed. How are we blessed when we follow the Lord’s prophet?\nNumbers 21:6–9\nI can look to Jesus Christ.\nYou could use “\nMoses and the Brass Serpent\n” in\nOld Testament Stories\n, 83–84, to help your children learn what happened in\nNumbers 21:6–9\n. How is the brass serpent like Jesus Christ? (see\nJohn 3:14–15\n). Your children might enjoy making a serpent out of paper and writing on it some simple things they can do to “look upon the Son of God with faith” (\nHelaman 8:15\n).\n1:2\nMoses and the Brass Serpent\nOlder children could choose one of the following scriptures and share what it adds to their understanding of the story:\n1 Nephi 17:41\n;\nAlma 33:18–20\n;\nHelaman 8:13–15\n;\nDoctrine and Covenants 6:36\n.\nBronze Serpent\n, by Brent Evans\nNumbers 22–24\nI can follow God’s will, even if others try to persuade me not to.\nSummarize\nNumbers 22:1–18\nfor your children, emphasizing how Balaam refused to curse God’s people, even though Balak, the king of Moab, offered him honor and riches. Then you could help your children search the following verses for phrases that they feel show that Balaam wanted to follow God:\nNumbers 22:18\n;\n23:26\n;\n24:13\n. Perhaps your children could pick one phrase they like and write it on a card to help them remember to obey the Lord.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "scripture",
      "title": "Numbers 11",
      "content": "1. Andwhenthe peoplecomplained, it displeased theLord: and theLordheardit;and his anger was kindled; and thefireof theLordburnt among them, and consumedthem that werein the uttermost parts of the camp.\n2. And the people cried unto Moses; and when Moses prayed unto theLord, the fire was quenched.\n3. And he called the name of the place Taberah: because the fire of theLordburnt among them.\n4. And the mixed multitude thatwasamong them fell alusting: and the children of Israel also wept again, and said, Who shall give us flesh to eat?\n5. We remember the fish, which we did eat in Egypt freely; the cucumbers, and the melons, and the leeks, and the onions, and the garlick:\n6. But now our soulisdried away:there isnothing at all, beside this manna,beforeour eyes.\n7. And themannawasascorianderseed, and the colour thereof as the colour of bdellium.\n8. Andthe people went about, and gatheredit,and grounditin mills, or beatitin mortar, and bakeditin pans, and made cakes of it: and the taste of it was as the taste of fresh oil.\n9. And when the dew fell upon the camp in the night, the manna fellupon it.\n10. Then Moses heard the people weep throughout their families, every man in the door of his tent: and the anger of theLordwas kindled greatly; Moses also was displeased.\n11. And Moses said unto theLord, Wherefore hast thou afflicted thy servant? and wherefore have I not found favour in thy sight, that thou layest the burden of all this people upon me?\n12. Have I conceived all this people? have I begotten them, that thou shouldest say unto me, Carry them in thy bosom, as nursing father beareth the sucking child, unto the land which thou swarest unto their fathers?\n13. Whence should I have flesh to give unto all this people? for they weep unto me, saying, Give us flesh, that we may eat.\n14. I am not able to bear all this people alone, becauseit istooheavyfor me.\n15. And if thou deal thus with me, kill me, I pray thee,out of hand, if I have found favour in thy sight; and let me not see my wretchedness.\n16. And theLordsaid unto Moses, Gather unto meseventymen of the elders of Israel, whom thou knowest to be the elders of the people, andofficersover them; and bring them unto thetabernacle of the congregation, that they may stand there with thee.\n17. And I will come down and talk with thee there: and I will take of the spirit whichisupon thee, and will putitupon them; and they shallbearthe burden of the people with thee, that thou bearitnot thyself alone.\n18. And say thou unto the people, Sanctify yourselves against to morrow, and ye shall eat flesh: for ye have wept in the ears of theLord, saying, Who shall give us flesh to eat? forit waswell with us in Egypt: therefore theLordwill give you flesh, and ye shall eat.\n19. Ye shall not eat one day, nor two days, nor five days, neither ten days, nor twenty days;\n20. Buteven whole month, until it come out at your nostrils, and it be loathsome unto you: because that ye have despised theLordwhichisamong you, and have wept before him, saying, Why came we forth out of Egypt?\n21. And Moses said, The people, among whom Iam, aresix hundred thousand footmen; and thou hast said, I will give them flesh, that they may eat whole month.\n22. Shall the flocks and the herds be slain for them, to suffice them? or shall all the fish of the sea be gathered together for them, to suffice them?\n23. And theLordsaid unto Moses, Is theLords hand waxed short? thou shalt see now whether my word shall come to pass unto thee or not.\n24. And Moses went out, and told the people the words of theLord, and gathered theseventymen of the elders of the people, and set them round about the tabernacle.\n25. And theLordcame down in acloud, and spake unto him, and took of the spirit thatwasupon him, and gaveitunto the seventyelders: and it came to pass,that,when the spirit rested upon them, theyprophesied, and did not cease.\n26. But there remained twoof themen in the camp, the name of the onewasEldad, and the name of the other Medad: and the spiritrested upon them; and theywereof them that were written, but went not out unto the tabernacle: and they prophesied in the camp.\n27. And there ran young man, and told Moses, and said, Eldad and Medad do prophesy in the camp.\n28. AndJoshuathe son ofNun, the servant of Moses,oneof his young men, answered and said, My lord Moses, forbid them.\n29. And Moses said unto him, Enviest thou for my sake? would God that all theLords people wereprophets,andthat theLordwould put his spirit upon them!\n30. And Moses gat him into the camp, he and the elders of Israel.\n31. And there went forth wind from theLord, and broughtquailsfrom the sea, and letthemfall by the camp, as it were days journey on this side, and as it were days journey on the other side, round about the camp, and as it were two cubitshighupon the face of the earth.\n32. And the people stood up all that day, and allthatnight, and all the next day, and they gathered the quails: he that gathered least gathered ten homers: and they spreadthemall abroad for themselves round about the camp.\n33. And while the fleshwasyet between their teeth, ere it was chewed, the wrath of theLordwas kindled against the people, and theLordsmote the people with very greatplague.\n34. And he called the name of that placeKibroth-hattaavah: because there they buried the people thatlusted.\n35. Andthe people journeyed from Kibroth-hattaavah unto Hazeroth; and abode at Hazeroth.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Numbers 12",
      "content": "1. And Miriam and Aaron spake against Moses because of theEthiopianwoman whom he had married: for he had married an Ethiopian woman.\n2. And they said, Hath theLordindeed spoken only by Moses? hath he not spoken also by us? And theLordheardit.\n3. (Now the man Moseswasverymeek, above all the men whichwereupon the face of the earth.)\n4. And theLordspake suddenly unto Moses, and unto Aaron, and unto Miriam, Come out ye three unto the tabernacle of the congregation. And they three came out.\n5. And theLordcame down in thepillarof the cloud, and stoodinthe door of the tabernacle, and called Aaron and Miriam: and they both came forth.\n6. And he said, Hear now my words: If there be aprophetamong you,ItheLordwill make myself known unto him in avision,andwill speak unto him in adream.\n7. My servant Mosesisnot so, whoisfaithful in all mine house.\n8. With him will Ispeakmouthto mouth, even apparently, and not in dark speeches; and the similitude of theLordshall hebehold: wherefore then were ye not afraid to speak against my servant Moses?\n9. And the anger of theLordwas kindled against them; and he departed.\n10. And the cloud departed fromoff the tabernacle; and, behold, Miriambecameleprous,whiteas snow: and Aaron looked upon Miriam, and, behold,she wasleprous.\n11. And Aaron said unto Moses, Alas, my lord, I beseech thee, lay not the sin upon us, wherein we have done foolishly, and wherein we have sinned.\n12. Let her not be as one dead, of whom the flesh is half consumed when he cometh out of his mothers womb.\n13. And Moses cried unto theLord, saying,Healher now, O God, I beseech thee.\n14. And theLordsaid unto Moses, If her father had but spit in her face, should she not be ashamed seven days? let her be shut out from the camp seven days, and after that let her be received inagain.\n15. And Miriam was shut out from the camp seven days: and the people journeyed not till Miriam was brought inagain.\n16. And afterward the people removed from Hazeroth, and pitched in the wilderness of Paran.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Numbers 13",
      "content": "1. And theLordspake unto Moses, saying,\n2. Sendthou men, that they maysearchthe land of Canaan, which I give unto the children of Israel: of every tribe of their fathers shall ye send man, every one ruler among them.\n3. And Moses by the commandment of theLordsent them from the wilderness of Paran: all those menwereheads of the children of Israel.\n4. And theseweretheir names: of the tribe of Reuben, Shammua the son of Zaccur.\n5. Of the tribe of Simeon, Shaphat the son of Hori.\n6. Of the tribe of Judah,Calebthe son of Jephunneh.\n7. Of the tribe of Issachar, Igal the son of Joseph.\n8. Of the tribe of Ephraim, Oshea the son of Nun.\n9. Of the tribe of Benjamin, Palti the son of Raphu.\n10. Of the tribe of Zebulun, Gaddiel the son of Sodi.\n11. Of the tribe of Joseph,namely,of the tribe of Manasseh, Gaddi the son of Susi.\n12. Of the tribe of Dan, Ammiel the son of Gemalli.\n13. Of the tribe of Asher, Sethur the son of Michael.\n14. Of the tribe of Naphtali, Nahbi the son of Vophsi.\n15. Of the tribe of Gad, Geuel the son of Machi.\n16. Thesearethe names of the men which Moses sent to spy out theland. And Moses calledOsheathe son ofNunJehoshua.\n17. And Moses sent them to spy out the land of Canaan, and said unto them, Get you upthiswaysouthward, and go up into the mountain:\n18. And see the land, what itis;and the people that dwelleth therein, whether theybestrong or weak, few or many;\n19. And what the landisthat they dwell in, whether itbegood or bad; and what citiesthey bethat they dwell in, whether in tents, or in strong holds;\n20. And what the landis,whether itbefat or lean, whether there be wood therein, or not. And be ye of good courage, and bring of the fruit of the land. Now the timewasthe time of the firstripe grapes.\n21. So they went up, and searched the land from the wilderness of Zin unto Rehob,as men come toHamath.\n22. And theyascended by thesouth, and came untoHebron; where Ahiman, Sheshai, and Talmai, the children of Anak,were.(Now Hebron was built seven years beforeZoanin Egypt.)\n23. And they came unto thebrookof Eshcol, and cut down from thence branch with one cluster of grapes, and they bare it between two upon staff; andthey broughtof the pomegranates, and of the figs.\n24. The place was called the brook Eshcol, because of the cluster of grapes which the children of Israel cut down from thence.\n25. And they returned from searching of the land after forty days.\n26. And they went and came to Moses, and to Aaron, and to all the congregation of the children of Israel, unto the wilderness of Paran, to Kadesh; and brought back word unto them, and unto all the congregation, and shewed them the fruit of the land.\n27. And they told him, and said, We came unto the land whither thou sentest us, and surely itflowethwith milk and honey; and thisisthe fruit of it.\n28. Nevertheless the peoplebestrong that dwell in the land, and the citiesarewalled,andvery great: and moreover we saw the children of Anak there.\n29. TheAmalekitesdwell in the land of thesouth: and the Hittites, and the Jebusites, and the Amorites, dwell in the mountains: and the Canaanites dwell by the sea, and by the coast of Jordan.\n30. AndCalebstilled the people before Moses, and said, Let us go up at once, and possess it; for we are well able to overcome it.\n31. But thementhat went up with him said, We be not able to go up against the people; for theyarestronger than we.\n32. And they brought up an evil report of the land which they had searched unto the children of Israel, saying, The land, through which we have gone to search it,isa land that eateth up the inhabitants thereof; and all the people that we saw in itaremen of great stature.\n33. And there we saw thegiants, the sons of Anak,which comeof thegiants: and we were in our own sight as grasshoppers, and so we were in their sight.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Numbers 14",
      "content": "1. And all the congregation lifted up their voice, and cried; and the people wept that night.\n2. And all the children of Israelmurmuredagainst Moses and against Aaron: and the whole congregation said unto them, Would God that we had died in the land of Egypt! or would God we had died in this wilderness!\n3. And wherefore hath theLordbrought us unto this land, to fall by the sword, that our wives and our children should be prey? were it not better for us to return into Egypt?\n4. And they said one to another, Let us make captain, and let usreturninto Egypt.\n5. Then Moses and Aaron fell on their faces before all the assembly of the congregation of the children of Israel.\n6. AndJoshuathe son of Nun,and Caleb the son of Jephunneh,which wereof them that searched the land, rent their clothes:\n7. And they spake unto all the company of the children of Israel, saying, The land, which we passed through to search it,isan exceeding good land.\n8. If theLorddelight in us, then he will bring us into this land, and give it us; land which floweth with milk and honey.\n9. Onlyrebelnot ye against theLord, neither fear ye the people of the land; for theyarebread for us: their defence is departed from them, and theLordiswith us:fearthem not.\n10. But all the congregation bade stone them with stones. And thegloryof theLordappeared in the tabernacle of the congregation before all the children of Israel.\n11. And theLordsaid unto Moses, How long will this peopleprovokeme? and how long will it be ere theybelieveme, for all the signs which I have shewed among them?\n12. I will smite them with the pestilence, and disinherit them, and will make of thee greaternationand mightier than they.\n13. And Moses said unto theLord, Then theEgyptiansshall hearit,(for thou broughtest up this people in thy might from among them;)\n14. And they will tellitto the inhabitants of this land:forthey have heard that thouLordartamongthis people, that thouLordart seen face to face, andthatthycloudstandeth over them, andthatthougoestbefore them, by day time in apillarof acloud, and in pillar of fire by night.\n15. Nowifthou shalt killallthis people as one man, then the nations which have heard the fame of thee will speak, saying,\n16. Because theLordwas not able to bring this people into the land which he sware unto them, therefore he hath slain them in the wilderness.\n17. And now, I beseech thee, let the power of my Lord be great, according as thou hast spoken, saying,\n18. TheLordislongsuffering, and of great mercy,forgivinginiquity and transgression, and by no means clearingthe guilty,visiting the iniquity of the fathers upon the children unto the third and fourthgeneration.\n19. Pardon, I beseech thee, the iniquity of this people according unto the greatness of thy mercy, and as thou hast forgiven this people, from Egypt even until now.\n20. And theLordsaid,Ihave pardoned according to thy word:\n21. ButastrulyasI live, all the earth shall befilledwith the glory of theLord.\n22. Because all those men which have seen my glory, and mymiracles, which I did in Egypt and in the wilderness, and havetemptedme now these ten times, and have not hearkened to my voice;\n23. Surely they shall notseethelandwhich I sware unto their fathers, neither shall any of them thatprovokedme see it:\n24. But my servantCaleb, because he had another spirit with him, and hathfollowedme fully, him will Ibringinto the land whereinto he went; and his seed shall possess it.\n25. (Now theAmalekitesand the Canaanites dwelt in the valley.) To morrow turn you, and get you intothe wilderness by the way of the Red sea.\n26. And theLordspake unto Moses and unto Aaron, saying,\n27. How longshall I bear withthis evil congregation, whichmurmuragainst me? I have heard the murmurings of the children of Israel, which they murmur against me.\n28. Say unto them,As truly asI live, saith theLord, as ye have spoken in mine ears, so will I do to you:\n29. Yourcarcasesshall fall in thiswilderness; and all that were numbered of you, according to your whole number, from twenty years old and upward, which have murmured against me,\n30. Doubtless ye shall not come into the land,concerningwhich I sware to make you dwell therein, save Caleb the son of Jephunneh, and Joshua the son of Nun.\n31. But your little ones, which ye said should be prey, them will I bring in, and they shall know the land which ye have despised.\n32. Butas foryou, your carcases, they shall fall in this wilderness.\n33. And your children shall wander in the wildernessfortyyears, andbear your whoredoms, until your carcases be wasted in the wilderness.\n34. After the number of the days in which ye searched the land,evenforty days, each day for year, shall ye bear your iniquities,evenforty years, and ye shallknowmy breach of promise.\n35. I theLordhave said, I will surely do it unto all this evil congregation, that are gathered together against me: in this wilderness they shall be consumed, and there they shalldie.\n36. And the men, which Moses sent to search the land, who returned, and made all the congregation to murmur against him, by bringing up slander upon the land,\n37. Even those men that did bring up the evil report upon the land,diedby theplaguebefore theLord.\n38. But Joshua the son of Nun, and Caleb the son of Jephunneh,which wereof the men that went to search the land, livedstill.\n39. And Moses told these sayings unto all the children of Israel: and the peoplemournedgreatly.\n40. And they rose up early in the morning, and gat them up into the top of the mountain, saying, Lo, webe here,and will go up unto the place which theLordhath promised: for we havesinned.\n41. And Moses said, Wherefore now do ye transgress the commandment of theLord? but it shall not prosper.\n42. Go not up, for theLordisnot among you; that ye be not smitten before your enemies.\n43. For theAmalekitesand the Canaanitesarethere before you, and ye shall fall by the sword: because ye are turned away from theLord, therefore theLordwill not be with you.\n44. But theypresumedto go up unto the hill top: nevertheless the ark of the covenant of theLord, and Moses, departed not out of the camp.\n45. Then the Amalekites came down, and the Canaanites which dwelt in that hill, and smote them, and discomfited them,evenunto Hormah.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Numbers": {
      "11": {
        "verses": {
          "1": {
            "text": "Andwhenthe peoplecomplained, it displeased theLord: and theLordheardit;and his anger was kindled; and thefireof theLordburnt among them, and consumedthem that werein the uttermost parts of the camp.",
            "citation": "(Numbers 11:1)"
          },
          "2": {
            "text": "And the people cried unto Moses; and when Moses prayed unto theLord, the fire was quenched.",
            "citation": "(Numbers 11:2)"
          },
          "3": {
            "text": "And he called the name of the place Taberah: because the fire of theLordburnt among them.",
            "citation": "(Numbers 11:3)"
          },
          "4": {
            "text": "And the mixed multitude thatwasamong them fell alusting: and the children of Israel also wept again, and said, Who shall give us flesh to eat?",
            "citation": "(Numbers 11:4)"
          },
          "5": {
            "text": "We remember the fish, which we did eat in Egypt freely; the cucumbers, and the melons, and the leeks, and the onions, and the garlick:",
            "citation": "(Numbers 11:5)"
          },
          "6": {
            "text": "But now our soulisdried away:there isnothing at all, beside this manna,beforeour eyes.",
            "citation": "(Numbers 11:6)"
          },
          "7": {
            "text": "And themannawasascorianderseed, and the colour thereof as the colour of bdellium.",
            "citation": "(Numbers 11:7)"
          },
          "8": {
            "text": "Andthe people went about, and gatheredit,and grounditin mills, or beatitin mortar, and bakeditin pans, and made cakes of it: and the taste of it was as the taste of fresh oil.",
            "citation": "(Numbers 11:8)"
          },
          "9": {
            "text": "And when the dew fell upon the camp in the night, the manna fellupon it.",
            "citation": "(Numbers 11:9)"
          },
          "10": {
            "text": "Then Moses heard the people weep throughout their families, every man in the door of his tent: and the anger of theLordwas kindled greatly; Moses also was displeased.",
            "citation": "(Numbers 11:10)"
          },
          "11": {
            "text": "And Moses said unto theLord, Wherefore hast thou afflicted thy servant? and wherefore have I not found favour in thy sight, that thou layest the burden of all this people upon me?",
            "citation": "(Numbers 11:11)"
          },
          "12": {
            "text": "Have I conceived all this people? have I begotten them, that thou shouldest say unto me, Carry them in thy bosom, as nursing father beareth the sucking child, unto the land which thou swarest unto their fathers?",
            "citation": "(Numbers 11:12)"
          },
          "13": {
            "text": "Whence should I have flesh to give unto all this people? for they weep unto me, saying, Give us flesh, that we may eat.",
            "citation": "(Numbers 11:13)"
          },
          "14": {
            "text": "I am not able to bear all this people alone, becauseit istooheavyfor me.",
            "citation": "(Numbers 11:14)"
          },
          "15": {
            "text": "And if thou deal thus with me, kill me, I pray thee,out of hand, if I have found favour in thy sight; and let me not see my wretchedness.",
            "citation": "(Numbers 11:15)"
          },
          "16": {
            "text": "And theLordsaid unto Moses, Gather unto meseventymen of the elders of Israel, whom thou knowest to be the elders of the people, andofficersover them; and bring them unto thetabernacle of the congregation, that they may stand there with thee.",
            "citation": "(Numbers 11:16)"
          },
          "17": {
            "text": "And I will come down and talk with thee there: and I will take of the spirit whichisupon thee, and will putitupon them; and they shallbearthe burden of the people with thee, that thou bearitnot thyself alone.",
            "citation": "(Numbers 11:17)"
          },
          "18": {
            "text": "And say thou unto the people, Sanctify yourselves against to morrow, and ye shall eat flesh: for ye have wept in the ears of theLord, saying, Who shall give us flesh to eat? forit waswell with us in Egypt: therefore theLordwill give you flesh, and ye shall eat.",
            "citation": "(Numbers 11:18)"
          },
          "19": {
            "text": "Ye shall not eat one day, nor two days, nor five days, neither ten days, nor twenty days;",
            "citation": "(Numbers 11:19)"
          },
          "20": {
            "text": "Buteven whole month, until it come out at your nostrils, and it be loathsome unto you: because that ye have despised theLordwhichisamong you, and have wept before him, saying, Why came we forth out of Egypt?",
            "citation": "(Numbers 11:20)"
          },
          "21": {
            "text": "And Moses said, The people, among whom Iam, aresix hundred thousand footmen; and thou hast said, I will give them flesh, that they may eat whole month.",
            "citation": "(Numbers 11:21)"
          },
          "22": {
            "text": "Shall the flocks and the herds be slain for them, to suffice them? or shall all the fish of the sea be gathered together for them, to suffice them?",
            "citation": "(Numbers 11:22)"
          },
          "23": {
            "text": "And theLordsaid unto Moses, Is theLords hand waxed short? thou shalt see now whether my word shall come to pass unto thee or not.",
            "citation": "(Numbers 11:23)"
          },
          "24": {
            "text": "And Moses went out, and told the people the words of theLord, and gathered theseventymen of the elders of the people, and set them round about the tabernacle.",
            "citation": "(Numbers 11:24)"
          },
          "25": {
            "text": "And theLordcame down in acloud, and spake unto him, and took of the spirit thatwasupon him, and gaveitunto the seventyelders: and it came to pass,that,when the spirit rested upon them, theyprophesied, and did not cease.",
            "citation": "(Numbers 11:25)"
          },
          "26": {
            "text": "But there remained twoof themen in the camp, the name of the onewasEldad, and the name of the other Medad: and the spiritrested upon them; and theywereof them that were written, but went not out unto the tabernacle: and they prophesied in the camp.",
            "citation": "(Numbers 11:26)"
          },
          "27": {
            "text": "And there ran young man, and told Moses, and said, Eldad and Medad do prophesy in the camp.",
            "citation": "(Numbers 11:27)"
          },
          "28": {
            "text": "AndJoshuathe son ofNun, the servant of Moses,oneof his young men, answered and said, My lord Moses, forbid them.",
            "citation": "(Numbers 11:28)"
          },
          "29": {
            "text": "And Moses said unto him, Enviest thou for my sake? would God that all theLords people wereprophets,andthat theLordwould put his spirit upon them!",
            "citation": "(Numbers 11:29)"
          },
          "30": {
            "text": "And Moses gat him into the camp, he and the elders of Israel.",
            "citation": "(Numbers 11:30)"
          },
          "31": {
            "text": "And there went forth wind from theLord, and broughtquailsfrom the sea, and letthemfall by the camp, as it were days journey on this side, and as it were days journey on the other side, round about the camp, and as it were two cubitshighupon the face of the earth.",
            "citation": "(Numbers 11:31)"
          },
          "32": {
            "text": "And the people stood up all that day, and allthatnight, and all the next day, and they gathered the quails: he that gathered least gathered ten homers: and they spreadthemall abroad for themselves round about the camp.",
            "citation": "(Numbers 11:32)"
          },
          "33": {
            "text": "And while the fleshwasyet between their teeth, ere it was chewed, the wrath of theLordwas kindled against the people, and theLordsmote the people with very greatplague.",
            "citation": "(Numbers 11:33)"
          },
          "34": {
            "text": "And he called the name of that placeKibroth-hattaavah: because there they buried the people thatlusted.",
            "citation": "(Numbers 11:34)"
          },
          "35": {
            "text": "Andthe people journeyed from Kibroth-hattaavah unto Hazeroth; and abode at Hazeroth.",
            "citation": "(Numbers 11:35)"
          }
        }
      },
      "12": {
        "verses": {
          "1": {
            "text": "And Miriam and Aaron spake against Moses because of theEthiopianwoman whom he had married: for he had married an Ethiopian woman.",
            "citation": "(Numbers 12:1)"
          },
          "2": {
            "text": "And they said, Hath theLordindeed spoken only by Moses? hath he not spoken also by us? And theLordheardit.",
            "citation": "(Numbers 12:2)"
          },
          "3": {
            "text": "(Now the man Moseswasverymeek, above all the men whichwereupon the face of the earth.)",
            "citation": "(Numbers 12:3)"
          },
          "4": {
            "text": "And theLordspake suddenly unto Moses, and unto Aaron, and unto Miriam, Come out ye three unto the tabernacle of the congregation. And they three came out.",
            "citation": "(Numbers 12:4)"
          },
          "5": {
            "text": "And theLordcame down in thepillarof the cloud, and stoodinthe door of the tabernacle, and called Aaron and Miriam: and they both came forth.",
            "citation": "(Numbers 12:5)"
          },
          "6": {
            "text": "And he said, Hear now my words: If there be aprophetamong you,ItheLordwill make myself known unto him in avision,andwill speak unto him in adream.",
            "citation": "(Numbers 12:6)"
          },
          "7": {
            "text": "My servant Mosesisnot so, whoisfaithful in all mine house.",
            "citation": "(Numbers 12:7)"
          },
          "8": {
            "text": "With him will Ispeakmouthto mouth, even apparently, and not in dark speeches; and the similitude of theLordshall hebehold: wherefore then were ye not afraid to speak against my servant Moses?",
            "citation": "(Numbers 12:8)"
          },
          "9": {
            "text": "And the anger of theLordwas kindled against them; and he departed.",
            "citation": "(Numbers 12:9)"
          },
          "10": {
            "text": "And the cloud departed fromoff the tabernacle; and, behold, Miriambecameleprous,whiteas snow: and Aaron looked upon Miriam, and, behold,she wasleprous.",
            "citation": "(Numbers 12:10)"
          },
          "11": {
            "text": "And Aaron said unto Moses, Alas, my lord, I beseech thee, lay not the sin upon us, wherein we have done foolishly, and wherein we have sinned.",
            "citation": "(Numbers 12:11)"
          },
          "12": {
            "text": "Let her not be as one dead, of whom the flesh is half consumed when he cometh out of his mothers womb.",
            "citation": "(Numbers 12:12)"
          },
          "13": {
            "text": "And Moses cried unto theLord, saying,Healher now, O God, I beseech thee.",
            "citation": "(Numbers 12:13)"
          },
          "14": {
            "text": "And theLordsaid unto Moses, If her father had but spit in her face, should she not be ashamed seven days? let her be shut out from the camp seven days, and after that let her be received inagain.",
            "citation": "(Numbers 12:14)"
          },
          "15": {
            "text": "And Miriam was shut out from the camp seven days: and the people journeyed not till Miriam was brought inagain.",
            "citation": "(Numbers 12:15)"
          },
          "16": {
            "text": "And afterward the people removed from Hazeroth, and pitched in the wilderness of Paran.",
            "citation": "(Numbers 12:16)"
          }
        }
      },
      "13": {
        "verses": {
          "1": {
            "text": "And theLordspake unto Moses, saying,",
            "citation": "(Numbers 13:1)"
          },
          "2": {
            "text": "Sendthou men, that they maysearchthe land of Canaan, which I give unto the children of Israel: of every tribe of their fathers shall ye send man, every one ruler among them.",
            "citation": "(Numbers 13:2)"
          },
          "3": {
            "text": "And Moses by the commandment of theLordsent them from the wilderness of Paran: all those menwereheads of the children of Israel.",
            "citation": "(Numbers 13:3)"
          },
          "4": {
            "text": "And theseweretheir names: of the tribe of Reuben, Shammua the son of Zaccur.",
            "citation": "(Numbers 13:4)"
          },
          "5": {
            "text": "Of the tribe of Simeon, Shaphat the son of Hori.",
            "citation": "(Numbers 13:5)"
          },
          "6": {
            "text": "Of the tribe of Judah,Calebthe son of Jephunneh.",
            "citation": "(Numbers 13:6)"
          },
          "7": {
            "text": "Of the tribe of Issachar, Igal the son of Joseph.",
            "citation": "(Numbers 13:7)"
          },
          "8": {
            "text": "Of the tribe of Ephraim, Oshea the son of Nun.",
            "citation": "(Numbers 13:8)"
          },
          "9": {
            "text": "Of the tribe of Benjamin, Palti the son of Raphu.",
            "citation": "(Numbers 13:9)"
          },
          "10": {
            "text": "Of the tribe of Zebulun, Gaddiel the son of Sodi.",
            "citation": "(Numbers 13:10)"
          },
          "11": {
            "text": "Of the tribe of Joseph,namely,of the tribe of Manasseh, Gaddi the son of Susi.",
            "citation": "(Numbers 13:11)"
          },
          "12": {
            "text": "Of the tribe of Dan, Ammiel the son of Gemalli.",
            "citation": "(Numbers 13:12)"
          },
          "13": {
            "text": "Of the tribe of Asher, Sethur the son of Michael.",
            "citation": "(Numbers 13:13)"
          },
          "14": {
            "text": "Of the tribe of Naphtali, Nahbi the son of Vophsi.",
            "citation": "(Numbers 13:14)"
          },
          "15": {
            "text": "Of the tribe of Gad, Geuel the son of Machi.",
            "citation": "(Numbers 13:15)"
          },
          "16": {
            "text": "Thesearethe names of the men which Moses sent to spy out theland. And Moses calledOsheathe son ofNunJehoshua.",
            "citation": "(Numbers 13:16)"
          },
          "17": {
            "text": "And Moses sent them to spy out the land of Canaan, and said unto them, Get you upthiswaysouthward, and go up into the mountain:",
            "citation": "(Numbers 13:17)"
          },
          "18": {
            "text": "And see the land, what itis;and the people that dwelleth therein, whether theybestrong or weak, few or many;",
            "citation": "(Numbers 13:18)"
          },
          "19": {
            "text": "And what the landisthat they dwell in, whether itbegood or bad; and what citiesthey bethat they dwell in, whether in tents, or in strong holds;",
            "citation": "(Numbers 13:19)"
          },
          "20": {
            "text": "And what the landis,whether itbefat or lean, whether there be wood therein, or not. And be ye of good courage, and bring of the fruit of the land. Now the timewasthe time of the firstripe grapes.",
            "citation": "(Numbers 13:20)"
          },
          "21": {
            "text": "So they went up, and searched the land from the wilderness of Zin unto Rehob,as men come toHamath.",
            "citation": "(Numbers 13:21)"
          },
          "22": {
            "text": "And theyascended by thesouth, and came untoHebron; where Ahiman, Sheshai, and Talmai, the children of Anak,were.(Now Hebron was built seven years beforeZoanin Egypt.)",
            "citation": "(Numbers 13:22)"
          },
          "23": {
            "text": "And they came unto thebrookof Eshcol, and cut down from thence branch with one cluster of grapes, and they bare it between two upon staff; andthey broughtof the pomegranates, and of the figs.",
            "citation": "(Numbers 13:23)"
          },
          "24": {
            "text": "The place was called the brook Eshcol, because of the cluster of grapes which the children of Israel cut down from thence.",
            "citation": "(Numbers 13:24)"
          },
          "25": {
            "text": "And they returned from searching of the land after forty days.",
            "citation": "(Numbers 13:25)"
          },
          "26": {
            "text": "And they went and came to Moses, and to Aaron, and to all the congregation of the children of Israel, unto the wilderness of Paran, to Kadesh; and brought back word unto them, and unto all the congregation, and shewed them the fruit of the land.",
            "citation": "(Numbers 13:26)"
          },
          "27": {
            "text": "And they told him, and said, We came unto the land whither thou sentest us, and surely itflowethwith milk and honey; and thisisthe fruit of it.",
            "citation": "(Numbers 13:27)"
          },
          "28": {
            "text": "Nevertheless the peoplebestrong that dwell in the land, and the citiesarewalled,andvery great: and moreover we saw the children of Anak there.",
            "citation": "(Numbers 13:28)"
          },
          "29": {
            "text": "TheAmalekitesdwell in the land of thesouth: and the Hittites, and the Jebusites, and the Amorites, dwell in the mountains: and the Canaanites dwell by the sea, and by the coast of Jordan.",
            "citation": "(Numbers 13:29)"
          },
          "30": {
            "text": "AndCalebstilled the people before Moses, and said, Let us go up at once, and possess it; for we are well able to overcome it.",
            "citation": "(Numbers 13:30)"
          },
          "31": {
            "text": "But thementhat went up with him said, We be not able to go up against the people; for theyarestronger than we.",
            "citation": "(Numbers 13:31)"
          },
          "32": {
            "text": "And they brought up an evil report of the land which they had searched unto the children of Israel, saying, The land, through which we have gone to search it,isa land that eateth up the inhabitants thereof; and all the people that we saw in itaremen of great stature.",
            "citation": "(Numbers 13:32)"
          },
          "33": {
            "text": "And there we saw thegiants, the sons of Anak,which comeof thegiants: and we were in our own sight as grasshoppers, and so we were in their sight.",
            "citation": "(Numbers 13:33)"
          }
        }
      },
      "14": {
        "verses": {
          "1": {
            "text": "And all the congregation lifted up their voice, and cried; and the people wept that night.",
            "citation": "(Numbers 14:1)"
          },
          "2": {
            "text": "And all the children of Israelmurmuredagainst Moses and against Aaron: and the whole congregation said unto them, Would God that we had died in the land of Egypt! or would God we had died in this wilderness!",
            "citation": "(Numbers 14:2)"
          },
          "3": {
            "text": "And wherefore hath theLordbrought us unto this land, to fall by the sword, that our wives and our children should be prey? were it not better for us to return into Egypt?",
            "citation": "(Numbers 14:3)"
          },
          "4": {
            "text": "And they said one to another, Let us make captain, and let usreturninto Egypt.",
            "citation": "(Numbers 14:4)"
          },
          "5": {
            "text": "Then Moses and Aaron fell on their faces before all the assembly of the congregation of the children of Israel.",
            "citation": "(Numbers 14:5)"
          },
          "6": {
            "text": "AndJoshuathe son of Nun,and Caleb the son of Jephunneh,which wereof them that searched the land, rent their clothes:",
            "citation": "(Numbers 14:6)"
          },
          "7": {
            "text": "And they spake unto all the company of the children of Israel, saying, The land, which we passed through to search it,isan exceeding good land.",
            "citation": "(Numbers 14:7)"
          },
          "8": {
            "text": "If theLorddelight in us, then he will bring us into this land, and give it us; land which floweth with milk and honey.",
            "citation": "(Numbers 14:8)"
          },
          "9": {
            "text": "Onlyrebelnot ye against theLord, neither fear ye the people of the land; for theyarebread for us: their defence is departed from them, and theLordiswith us:fearthem not.",
            "citation": "(Numbers 14:9)"
          },
          "10": {
            "text": "But all the congregation bade stone them with stones. And thegloryof theLordappeared in the tabernacle of the congregation before all the children of Israel.",
            "citation": "(Numbers 14:10)"
          },
          "11": {
            "text": "And theLordsaid unto Moses, How long will this peopleprovokeme? and how long will it be ere theybelieveme, for all the signs which I have shewed among them?",
            "citation": "(Numbers 14:11)"
          },
          "12": {
            "text": "I will smite them with the pestilence, and disinherit them, and will make of thee greaternationand mightier than they.",
            "citation": "(Numbers 14:12)"
          },
          "13": {
            "text": "And Moses said unto theLord, Then theEgyptiansshall hearit,(for thou broughtest up this people in thy might from among them;)",
            "citation": "(Numbers 14:13)"
          },
          "14": {
            "text": "And they will tellitto the inhabitants of this land:forthey have heard that thouLordartamongthis people, that thouLordart seen face to face, andthatthycloudstandeth over them, andthatthougoestbefore them, by day time in apillarof acloud, and in pillar of fire by night.",
            "citation": "(Numbers 14:14)"
          },
          "15": {
            "text": "Nowifthou shalt killallthis people as one man, then the nations which have heard the fame of thee will speak, saying,",
            "citation": "(Numbers 14:15)"
          },
          "16": {
            "text": "Because theLordwas not able to bring this people into the land which he sware unto them, therefore he hath slain them in the wilderness.",
            "citation": "(Numbers 14:16)"
          },
          "17": {
            "text": "And now, I beseech thee, let the power of my Lord be great, according as thou hast spoken, saying,",
            "citation": "(Numbers 14:17)"
          },
          "18": {
            "text": "TheLordislongsuffering, and of great mercy,forgivinginiquity and transgression, and by no means clearingthe guilty,visiting the iniquity of the fathers upon the children unto the third and fourthgeneration.",
            "citation": "(Numbers 14:18)"
          },
          "19": {
            "text": "Pardon, I beseech thee, the iniquity of this people according unto the greatness of thy mercy, and as thou hast forgiven this people, from Egypt even until now.",
            "citation": "(Numbers 14:19)"
          },
          "20": {
            "text": "And theLordsaid,Ihave pardoned according to thy word:",
            "citation": "(Numbers 14:20)"
          },
          "21": {
            "text": "ButastrulyasI live, all the earth shall befilledwith the glory of theLord.",
            "citation": "(Numbers 14:21)"
          },
          "22": {
            "text": "Because all those men which have seen my glory, and mymiracles, which I did in Egypt and in the wilderness, and havetemptedme now these ten times, and have not hearkened to my voice;",
            "citation": "(Numbers 14:22)"
          },
          "23": {
            "text": "Surely they shall notseethelandwhich I sware unto their fathers, neither shall any of them thatprovokedme see it:",
            "citation": "(Numbers 14:23)"
          },
          "24": {
            "text": "But my servantCaleb, because he had another spirit with him, and hathfollowedme fully, him will Ibringinto the land whereinto he went; and his seed shall possess it.",
            "citation": "(Numbers 14:24)"
          },
          "25": {
            "text": "(Now theAmalekitesand the Canaanites dwelt in the valley.) To morrow turn you, and get you intothe wilderness by the way of the Red sea.",
            "citation": "(Numbers 14:25)"
          },
          "26": {
            "text": "And theLordspake unto Moses and unto Aaron, saying,",
            "citation": "(Numbers 14:26)"
          },
          "27": {
            "text": "How longshall I bear withthis evil congregation, whichmurmuragainst me? I have heard the murmurings of the children of Israel, which they murmur against me.",
            "citation": "(Numbers 14:27)"
          },
          "28": {
            "text": "Say unto them,As truly asI live, saith theLord, as ye have spoken in mine ears, so will I do to you:",
            "citation": "(Numbers 14:28)"
          },
          "29": {
            "text": "Yourcarcasesshall fall in thiswilderness; and all that were numbered of you, according to your whole number, from twenty years old and upward, which have murmured against me,",
            "citation": "(Numbers 14:29)"
          },
          "30": {
            "text": "Doubtless ye shall not come into the land,concerningwhich I sware to make you dwell therein, save Caleb the son of Jephunneh, and Joshua the son of Nun.",
            "citation": "(Numbers 14:30)"
          },
          "31": {
            "text": "But your little ones, which ye said should be prey, them will I bring in, and they shall know the land which ye have despised.",
            "citation": "(Numbers 14:31)"
          },
          "32": {
            "text": "Butas foryou, your carcases, they shall fall in this wilderness.",
            "citation": "(Numbers 14:32)"
          },
          "33": {
            "text": "And your children shall wander in the wildernessfortyyears, andbear your whoredoms, until your carcases be wasted in the wilderness.",
            "citation": "(Numbers 14:33)"
          },
          "34": {
            "text": "After the number of the days in which ye searched the land,evenforty days, each day for year, shall ye bear your iniquities,evenforty years, and ye shallknowmy breach of promise.",
            "citation": "(Numbers 14:34)"
          },
          "35": {
            "text": "I theLordhave said, I will surely do it unto all this evil congregation, that are gathered together against me: in this wilderness they shall be consumed, and there they shalldie.",
            "citation": "(Numbers 14:35)"
          },
          "36": {
            "text": "And the men, which Moses sent to search the land, who returned, and made all the congregation to murmur against him, by bringing up slander upon the land,",
            "citation": "(Numbers 14:36)"
          },
          "37": {
            "text": "Even those men that did bring up the evil report upon the land,diedby theplaguebefore theLord.",
            "citation": "(Numbers 14:37)"
          },
          "38": {
            "text": "But Joshua the son of Nun, and Caleb the son of Jephunneh,which wereof the men that went to search the land, livedstill.",
            "citation": "(Numbers 14:38)"
          },
          "39": {
            "text": "And Moses told these sayings unto all the children of Israel: and the peoplemournedgreatly.",
            "citation": "(Numbers 14:39)"
          },
          "40": {
            "text": "And they rose up early in the morning, and gat them up into the top of the mountain, saying, Lo, webe here,and will go up unto the place which theLordhath promised: for we havesinned.",
            "citation": "(Numbers 14:40)"
          },
          "41": {
            "text": "And Moses said, Wherefore now do ye transgress the commandment of theLord? but it shall not prosper.",
            "citation": "(Numbers 14:41)"
          },
          "42": {
            "text": "Go not up, for theLordisnot among you; that ye be not smitten before your enemies.",
            "citation": "(Numbers 14:42)"
          },
          "43": {
            "text": "For theAmalekitesand the Canaanitesarethere before you, and ye shall fall by the sword: because ye are turned away from theLord, therefore theLordwill not be with you.",
            "citation": "(Numbers 14:43)"
          },
          "44": {
            "text": "But theypresumedto go up unto the hill top: nevertheless the ark of the covenant of theLord, and Moses, departed not out of the camp.",
            "citation": "(Numbers 14:44)"
          },
          "45": {
            "text": "Then the Amalekites came down, and the Canaanites which dwelt in that hill, and smote them, and discomfited them,evenunto Hormah.",
            "citation": "(Numbers 14:45)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 25767,
  "total_sources": 5,
  "generated_at": "2025-12-14T04:01:27.380613"
}