{
  "week_number": 26,
  "date_range": "Samuel 11–122 ",
  "title": "2 ;1 Kings 3;6–9;11",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: 2 ;1 Kings 3;6–9;11 ---\nSaul, David, and Solomon, the first three kings of Israel, all started out with so much promise. Humble, courageous, and wise, they each found favor with the Lord—at least at first. Sadly, each king also gave in to human weaknesses and temptation. They put their own desires before the Lord’s. And as we’ve seen over and over in the scriptures—and in our own lives—that led to tragedy.\nBut something important happened during the reign of Solomon that provided some hope for stability in the lives of the covenant people. Solomon built a temple. It was to be a more permanent house of the Lord than the tabernacle had been. And it would represent a more permanent presence of the Lord among His people. Solomon knew that the people would continue to face weakness and trials of various kinds. In dedicating the new holy house, Solomon pleaded with the Lord, “If they … return unto thee with all their heart, … then hear thou their prayer” (\n1 Kings 8:47–48\n). That’s part of what temple covenants do for us—they create a connection to God. They secure for us the promise that through our repentance and His mercy, He can “dwell among [us]” and never forsake us (\n1 Kings 6:13\n).\nFor an overview of the book of 1 Kings, see “\nKings, books of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n2 Samuel 11\n;\n12:1–14\nThe Lord can help me make good choices when I am tempted to sin.\nSometimes we look at people who seem strong in their faith, and we assume that they are unaffected by temptation. David’s tragic choices described in\n2 Samuel 11\nclearly show that this isn’t the case. Consider what lessons you can learn from his experiences. Questions like these might help you study\n2 Samuel 11–12\n:\nWhat choices did David make that led him down an increasingly sinful path? What righteous choices could he have made instead? (See also the video “To Look Upon,” Gospel Library.)\n4:15\nTo Look Upon\nUsing videos.\nVideos can help you visualize accounts from the scriptures and consider how they apply to you. Consider how you can use them to enhance teaching and learning. For example, while watching “To Look Upon” (Gospel Library), consider pausing the video at various points to ponder or discuss some of the questions suggested in this activity.\nHow is the adversary trying to lead you down sinful paths? What choices could you make now to stay spiritually safe?\nNote David’s reaction to Nathan’s story in\n2 Samuel 12:1–6\n. What does his reaction suggest about how David viewed himself? What has the Lord done to help you see yourself more accurately?\nHow would you summarize the events of\n2 Samuel 11–12\nin a one-sentence warning?\nReading about David’s bad choices could lead you to learn about the dangers of pornography and sexual sin. A good resource for this is\nFor the Strength of Youth: A Guide for Making Choices\n, especially the sections titled “\nWhat to do in the moment\n” and “\nYour body is sacred\n” (pages 21–28). Maybe you could look in that resource for counsel that would have helped David make better choices. Or you could read “\nJesus Christ will help you\n” (pages 6–9), looking for something that would have helped David return to the Lord.\nConsider singing a hymn like “\nI Need Thee Every Hour\n” (\nHymns\n, no. 98) and pondering how the Savior has strengthened you when you’ve faced temptation.\nSee also\n2 Nephi 28:20–24\n; Ulisses Soares, “\nSeek Christ in Every Thought\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 82–85; “\nTaking Charge of Technology\n,” Gospel Library; “Watch Your Step” (video), Gospel Library.\n2:36\nWatch Your Step\n1 Kings 3:1–15\nThe gift of discernment helps me distinguish between right and wrong.\nIf the Lord said to you, “Ask what I shall give thee” (\n1 Kings 3:5\n), what would you ask for? What impresses you about Solomon’s request? Ponder why “an understanding heart” to “discern between good and bad” (\nverse 9\n) is a valuable gift. What can you do to seek this gift?\nSee also\nMoroni 7:12–19\n.\n1 Kings 6–8\n;\n9:1–9\nThrough covenants made in the Lord’s house, the Lord dwells with me.\nIn\n1 Kings 6–7\nyou’ll find a detailed description of the sacred house that Solomon built for the Lord. The details may not seem as important to you as they were to the ancient Israelites. But reading these chapters might give you a sense for how important it was to them to have a house of the Lord. Why is it important to you?\nYou might ponder what the different parts of Solomon’s temple might symbolize. For example, consider what the cherubim, trees, and flowers in\n1 Kings 6:35\nmight represent. (See also\nGenesis 3:24\n.)\nChapter 8\nrecords Solomon’s prayer upon completing the temple (see\nverses 22–61\n). Consider making a list of the blessings Solomon asked for. What impresses you about these blessings? (Note also the Lord’s promises in\n2 Kings 6:11–13\n;\n9:1–9\n.) If you’ve been to the Lord’s house, think about your experiences worshipping there. How has keeping temple covenants helped you access the Lord’s blessings?\nSee also\nDoctrine and Covenants 109\n; Henry B. Eyring, “\nI Love to See the Temple\n,”\nLiahona\n, May 2021, 28–31.\nBarranquilla Colombia Temple\n1 Kings 8:61\n;\n11:1–11\n“His heart was not perfect with the Lord.”\nWhat does it mean to “let your heart … be perfect with the Lord”? (\n1 Kings 8:61\n). Is that different from our actions being perfect? How so? Read\n1 Kings 11:1–11\n, and notice what the Lord said about Solomon’s heart. You might ponder whether there are influences in your life that could turn your heart away from the Lord and toward “other gods.”\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWho was Nathan?\nWhat was the molten sea on the back of 12 oxen?\nWhat does it mean that the Lord would put His name upon the temple?\nClick to see more.\nIdeas for Teaching Children\n2 Samuel 11\nThe Lord can help me when I am tempted.\n“\nKing David\n” in\nOld Testament Stories\n, 117–20, can help you tell your children the story in\n2 Samuel 11\n. You might ask your children to identify the wrong choices David made and suggest good choices he could have made instead. What are some things we can do when we are being tempted that can help us make the right choice?\n2:11\nKing David\nReading about David’s tragic sins might be a good opportunity to discuss the dangers of pornography. The video “What Should I Do When I See Pornography?” (Gospel Library) has helpful guidance. Help your children make a plan about what they will do when they encounter pornography.\n5:46\nWhat should I do when I see pornography?\n1 Kings 8:22–61\nMaking covenants in the Lord’s house—and keeping them—helps me walk in His ways.\nAs you and your children learn about the dedication of the temple in\n1 Kings 8\n, you could look at the pictures of temples in this week’s outline. Let your children talk about details they see in the pictures. You might emphasize\nverses 57–58\n. What does it mean to “walk in all [the Lord’s] ways”? (\n1 Kings 8:58\n). Maybe your children could take a step for each answer they give.\nTell your children how keeping the covenants you make in the temple helps you walk in the Lord’s ways. You might tell them what these covenants are (see\nGeneral Handbook\n,\n27.2\n, Gospel Library). You could also sing a song together like “\nI Love to See the Temple\n” (\nChildren’s Songbook\n, 95).\nIllustration of Solomon’s temple, by Sam Lawlor\n1 Kings 11:1–11\nI can put the Lord first in my life.\nReading about how Solomon’s wives influenced him could lead to a conversation about examples of “other gods”—or things that people worship or love instead of the Lord. How do we show that we love Him more than anything else in our lives?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 26: Lesson 69: Lesson 69—1 Samuel 1This lesson can help students understand that Heavenly Father will hear their humble prayers and bless them.; Lesson 70: Lesson 70—1 Samuel 3This lesson can help students seek for and recognize personal revelation.... ---\n\n--- Lesson 69 ---\nHave you found yourself pleading to Heavenly Father for a blessing that seems to require your patience and faith? Hannah, a righteous Israelite woman, longed to have a child. Although her noble desires were unfulfilled “year by year” ( 1 Samuel 1:7 ), Hannah continued to act in faith and petition Heavenly Father for this blessing. Hannah’s humble prayers were answered as she received peace, joy, and a child she named Samuel. This lesson can help students understand that Heavenly Father will hear their humble prayers and bless them. Student preparation: Invite students to think of an experience when they or someone they know received an answer to prayer. Students could prepare to share that experience as part of the study activity. Possible Learning Activities When prayers feel unanswered Reverent music can invite the Holy Ghost into your classroom and prepare students’ hearts and minds for the learning experience. Consider beginning class by inviting students to select a favorite hymn that teaches the power of praying to Heavenly Father. Before the opening prayer, the class could sing or listen to the first verse of a song like “ A Child’s Prayer ,” ( Children’s Songbook , 12–13) or “ Did You Think to Pray ,” ( Hymns , no. 140). Students could also watch an appropriate video like “ Are You Really There? ” (3:46) or “ Abide with Me ,” (3:08) available at ChurchofJesusChrist.org . 3:45 3:9 As you begin the lesson, display the following scenario or something similar that best fits the needs of your class. Consider writing them on the board. After a seminary lesson on prayer, a friend approaches you and admits, “I say my prayers, but I’m not sure if they are answered.” As you talk, she asks three questions. How can I tell if Heavenly Father hears and answers my prayers? What are some of the ways Heavenly Father answers prayers? What can I do to make my prayers to Heavenly Father more meaningful? The following activity is a self-assessment. These opportunities allow students to evaluate their current understanding of truths they will study in class. It can also help students see what they may need or want to learn. On a scale of 1 (low) to 5 (high), rank how confidently you feel you could answer each question from the scenario. Select one question you would like to learn more about today. Write that question in your study journal. As you study, seek the guidance of the Spirit to help answer the question you selected. Hannah longs for a child In the land of Ephraim, a righteous Israelite named Elkanah lived with his two wives, Peninnah and Hannah (plural marriages were not uncommon at this time and were acceptable to the Lord). Read 1 Samuel 1:1–8 looking for the challenges Hannah was facing. (The “adversary” in verse 6 was possibly Peninnah.) What did you find? If you were struggling with personal challenges like Hannah, what might you think or feel? Though their situations are very different, you might ask how students how they could relate to Hannah. As students study the next passage, they might notice that initially Eli, the high priest, misunderstands Hannah’s humble prayer. Help students focus on Hannah, how she responds to Eli, and the blessing she receives from the Lord (see verse 20 ). If useful, point out that as they honestly spoke to one another, Eli quickly corrected his mistake. Students could watch the video “ Hannah’s Faith ” (3:08) available at ChurchofJesusChrist.org and follow along in their scriptures. You might pause at time code 1:03 and invite students to share their thoughts about verses 9–13 and pause again at time code 1:30 to invite students to share their insights about verses 14–20 . 3:9 Read 1 Samuel 1:9–20 and 2:1–2 looking for what Hannah did in response to her challenges. What did you discover? What can we learn about Heavenly Father and prayer from this account? Students may share a variety of thoughts. Thank them and ask why what they discovered is important to know. If students do not mention the following truth, write it on the board and ask how Hannah’s story is evidence of it: As we petition Heavenly Father in humble prayer, He hears and blesses us. What are some of the words or phrases in 1 Samuel 1:9–20 that show Hannah’s prayers were humble and meaningful? According to verses 17–18 , what comfort did the Lord give Hannah while she was waiting to be blessed with a child? It might be helpful to point out that we, like Hannah, may need to trust in the Lord and patiently wait for His blessings. He may not always respond in the way we would hope, but we can trust that He answers prayers according to His will and what is best for us. You could share an example of a humble, meaningful prayer that was not answered in the way expected, like “ How I #HearHim: Elder D. Todd Christofferson ” (2:25) from ChurchofJesusChrist.org or “ One–on–One (Ministering with Love) ” (time code 7:24 to 9:00). Alternately, you could share an example from your life. 2:25 13:2 Heavenly Father hears our prayers and blesses us You could use the following activity to deepen students’ understanding of the truth they identified above and answer the three questions from the beginning of the lesson. One way to do this is to provide or display the instructions below for each question (A, B, and C). You might give students the option to study individually or work in a small group with other students who selected the same question. You could also place students in groups of three, with each person having selected a different question to study. They could share what they find with the group. Question A: How might the story of Hannah help someone believe that Heavenly Father hears their prayers and blesses them? Use scripture study tools such as the Topical Guide, Guide to the Scriptures, and the Gospel Library to find a few scripture passages or a statement from a Church leader that could help someone understand that Heavenly Father answers prayers (for example, James 1:5–6 ; Enos 1:2–10 ; 3 Nephi 18:20 ; Doctrine and Covenants 90:24 ). Question B: How might the story of Hannah help someone understand some of the ways Heavenly Father answers their prayers? Use scripture study tools such as the Topical Guide, Guide to the Scriptures, and the Gospel Library to find a few scripture accounts or a statement from a Church leader that could help someone understand some of the ways Heavenly Father answers prayers (for example, Luke 22:39–44 ; 2 Corinthians 12:7–9 ; Mosiah 24:10–16 ; Doctrine and Covenants 6:22–23 ; 8:2–3 ). Question C: How might the story of Hannah help someone try to make their prayers more humble and meaningful? Use scripture study tools such as the Topical Guide, Guide to the Scriptures, and the Gospel Library to find a few scripture passages or a statement from a Church leader that could help someone who wants to make their prayers more humble and meaningful (for example, Enos 1:2–10 ; Alma 5:45–46 ; Ether 3:1–5 ; Doctrine and Covenants 46:30 ). Demonstrate understanding To help students share what they have learned and felt today, they could partner with someone who studied one of the other questions and teach each other. You might deepen the discussion by inviting students to share their thoughts with the class and encourage students who studied other questions to add additional insights. As you conclude class, reassure students that, like Hannah, sometimes we must wait for Heavenly Father to answer our prayers. In His way and timing, Heavenly Father does hear their prayers and will bless them.\n\n\n--- Lesson 70 ---\nHow well do you feel you can recognize the Lord’s voice in your life? One night the Lord spoke to the boy Samuel. With help from Eli, Samuel eventually recognized the Lord’s voice. He responded, “Speak, Lord, for thy servant heareth” ( 1 Samuel 3:9 ). The Lord speaks to us too, and like Samuel, we need to learn to recognize His voice. This lesson can help students seek and recognize personal revelation. Student preparation: Ask students the question, “How do you hear the voice of the Lord in your life?” Invite them to reflect on how they would answer. They could also ask friends or family members the question. Possible Learning Activities Hearing the Lord’s voice Consider inviting a volunteer to the front of the class who is willing to be blindfolded. Place a blindfold on the student. One at a time, invite a few class members to call the student by name. Ask the blindfolded student to identify who called their name. Why were some of the voices easier to recognize? What are some spiritual lessons that could relate to this activity? Students may or may not share principles similar to the truths outlined in this lesson. If they do, invite them to look for evidence or understanding of these truths as they study 1 Samuel 3 . If not, that is fine. Thank all students for what they shared. Write the following truth on the board: God speaks to us and wants us to recognize His voice . Explain that the Lord speaks to us through the Holy Ghost (see Doctrine and Covenants 8:2 ). This is known as personal revelation. Students will identify additional principles of personal revelation throughout the lesson. President Russell M. Nelson taught: One of the things the Spirit has repeatedly impressed upon my mind … is how willing the Lord is to reveal His mind and will. The privilege of receiving revelation is one of the greatest gifts of God to His children. … Does God really want to speak to you? Yes! (“ Revelation for the Church, Revelation for Our Lives ,” Ensign or Liahona , May 2018, 94–95) Invite students to reflect on the following questions: Do you believe God really wants to speak to you? Why or why not? How confident are you in your ability to recognize revelation? What makes it easy or difficult for you to recognize God’s voice (or personal revelation) in your life? Express your confidence that God wants to speak to your students. Throughout the lesson, try to seek for and recognize messages from the Lord. Try to recognize how He speaks to you. Principles of revelation Samuel was born to Hannah as an answer to her prayers. When Samuel was young, Hannah brought him to the tabernacle where Eli could care for him. One night, the boy Samuel had an experience hearing the voice of the Lord. Before providing the instructions below, you might explain that some principles in the scriptures are implied. This means they are not directly stated in the verses. The Holy Ghost can help us identify implied principles as we ask ourselves questions like “What might the author of these verses have wanted me to learn?” or “What are some of the important lessons these verses teach?” Study 1 Samuel 3:1–10, 19 , looking for insights and truths about receiving revelation from God. When students have finished studying, invite them to write principles they discovered on the board. Using their own words, students may have identified principles listed below. If they struggle to identify principles, you may list the following and invite them to identify phrases or verses that teach them. The Lord patiently reaches out to us even when we do not initially recognize His voice ( see verses 4, 6, 8, 10 ). The Lord speaks to youth ( see verses 4, 6, 8, 10 ). It often requires time and practice to become familiar with the Lord’s voice ( see verses 7, 10, 19 ). Others can help us recognize the voice of the Lord ( see verse 8–9 ). When we demonstrate a willingness to listen and act, the Lord will reveal more. ( see verses 10, 19 ) Why could these principles be helpful as we try to recognize the Lord’s voice in our lives? How are they a demonstration of His love for us? Recognizing the voice of the Lord The Lord speaks to us in many ways through the Holy Ghost. Learning how He might speak to you can help you better recognize His voice in your life. Provide students with the handout “ How Can I Recognize the Lord’s Voice? ” Consider doing the first row of the chart as a class before inviting students to complete the remaining rows. It might be best to invite students to complete this on their own to allow for personal reflection. If you feel you may not have enough time for this activity, consider inviting students to only do a few rows, or consider continuing the lesson on another day. Open PDF When students finish studying, take time to let them discuss what they discovered and to ask questions. Use this time to allow students to share how they hear the Lord’s voice in their lives. You might also share a personal experience and explain how you hear Him. Express gratitude to students for the things they share. Let them know that their contributions make a meaningful difference in class. Becoming familiar with the Lord’s voice Like Samuel, it might require time and practice for us to become familiar with the Lord’s voice and recognize personal revelation (see 1 Samuel 3:7, 10, 19 ). What are some ways we, like Samuel, can try to recognize the voice of the Lord? Some ideas might be talking to a parent or trusted mentor about how to receive revelation like Samuel spoke to Eli. Samuel said, “Speak; for thy servant heareth” ( 1 Samuel 3:10 ). Perhaps we can also make it clear to the Lord we are ready to hear His messages by having moments to ponder and listen after prayer or throughout the day. Or we could record in a journal some of the ways we may be receiving messages from Heavenly Father, like those in the handout. In your study journal, create a plan of something you would like to do to seek for and recognize revelation from God in your life. Testify that as students make a focused effort over time, their ability to recognize personal revelation will increase. Let students know they will be given an opportunity to reflect on their efforts to recognize personal revelation in Lesson 80: “ Assess Your Learning 5 .”\n\n\n--- Lesson 71 ---\nLike many people today, the ancient Israelites struggled with the temptation to fit in with others rather than obeying the Lord. For many years in the promised land, the Lord guided Israel through judges like Samuel. Later in Samuel’s life, the Israelites desired to have a king “like all the nations” ( 1 Samuel 8:5 ) instead of the Lord to reign over them. This lesson can help students understand the importance of choosing to follow Jesus Christ instead of worldly influences. Student preparation: Invite students to make a list of any peer pressures that they face to disobey standards and commandments of the Lord. Invite students to ponder the difference it would make in their lives to follow Jesus Christ instead of giving in to those pressures. Possible Learning Activities Decision-making To help students think about what influences their decisions, consider writing the following statement on the board. Students could complete the statement and respond to the accompanying questions as a class or in small groups. Some teenagers want to because “everybody else is doing it.” What challenges might a teenager experience if that is their reason for doing things? How could that reason for doing things affect their relationship with Heavenly Father and Jesus Christ? Give students an opportunity to reflect on how peer pressure may be influencing their lives. One way to do this is to give students the following instructions and display the scale. Think about what influences the decisions you make in your life. Draw the following scale in your study journal. Draw a small stick figure of yourself that represents where you would place yourself on the scale. To help students recognize what may be influencing specific decisions in their lives, they or you could provide examples of decisions they are facing. Possible examples include the way they dress, entertainment and media choices, and how they spend their time. You could share these examples one at a time and invite students to draw additional stick figures on the scale for each example. Invite students to seek the influence of the Holy Ghost as they ponder their own decisions while studying 1 Samuel 8 . A king “like all the nations” For many years in the promised land, the Lord guided the Israelites through judges like Samuel. As Samuel grew older, the elders of Israel came to him with a request. Read 1 Samuel 8:4–7 , looking for how the children of Israel might have finished the statement from the beginning of the lesson. What did the children of Israel want? Why do you think their reasons for wanting a king would displease Samuel? It may seem surprising that the Lord would tell Samuel to listen to the poor choice of his people (see verse 7 ). Heavenly Father honors agency and will not force us to choose the right. Yet, before the Israelites made their final decision, the Lord loved them enough to warn them through Samuel of the consequences of their choice (see 1 Samuel 8:9 ). One way you can help students see how the scriptures illustrate gospel truths is by writing a truth on the board. Then have students search a scripture passage, looking for evidence of that truth. Consider displaying the following truth on the board. Students could read the accompanying verses with a partner, pausing after every couple of verses to discuss what they find. Choosing to follow the world instead of the Lord’s loving counsel will lead to suffering and regret. As you study 1 Samuel 8:10–18 , look for words or phrases that help teach this truth. As students answer the following questions, remind them to not share names or specific details about individuals they personally know. Examples could come from their life, the lives of others, or from accounts in the scriptures or Church history. What examples have you seen when choosing to follow the world has led to suffering or regret? How have you seen choosing to follow Heavenly Father and Jesus Christ lead to joy and a stronger relationship with Them? To help students see the importance of following Heavenly Father and Jesus Christ instead of worldly influences, you could show Elder Randall K. Bennett’s October 2011 conference talk “ Choose Eternal Life ,” available at ChurchofJesusChrist.org , from time code 0:00 to 2:08. Elder Bennett shares the consequences he suffered because he ignored warnings. Then you could show the same video from time code 5:08 to 6:43 as Elder Bennett teaches how his experience can apply to the currents in the world we may be tempted to follow and how we can avoid them. 10:9 10:9 Choosing the Lord instead of worldly pressures The following activity can help students discover counsel the Lord has given to protect them from giving in to temptations they may feel pressured to do or believe. You could have students work in small groups to complete steps 1 and 2. They could then complete step 3 on their own. Display the following instructions. Choose something that teenage members of the Church around you might feel pressure to do or believe. Use the scriptures, scripture study helps, For the Strength of Youth: A Guide for Making Choices , or the Gospel Library app to answer the following questions about the pressure you selected: What counsel has the Lord given us about this? What blessings has the Lord promised to people who choose Him over worldly influences? Think about what you believe about Heavenly Father and Jesus Christ. Write a couple of sentences about how this knowledge can help you follow Them instead of worldly pressures. After sufficient time, provide students an opportunity to share with others what they learned from their study. Demonstrate understanding This section is designed to give students an opportunity to demonstrate their understanding of what they have learned today. Read 1 Samuel 8:19–22 , looking for how Israel responded to the Lord’s warnings about their desire to have a king. From what you have learned today, what would you want to tell the Israelites before they made their final choice? It will be helpful for future lessons for students to know that the Lord honored the Israelites’ agency and instructed Samuel to call Saul as King of Israel (see 1 Samuel 9–10 ).\n\n\n--- Lesson 72 ---\nThough God gives commandments to guide us and bring us joy, we might be tempted to respond to His commandments the way that Saul did. God gave Saul and his army specific instructions through the prophet Samuel about their conflict with the Amalekites. Saul and his army followed some of God’s commands but felt justified disobeying others. This lesson can help students understand the importance of striving to obey all of God’s commandments. Student preparation: Invite students to think of reasons people might have for choosing to disobey God’s commandments. Students could record their list in a note on their phone or write it on a small piece of paper. Invite students to bring their lists to class. Possible Learning Activities Cafeterias Consider beginning class by contrasting situations when it is appropriate to pick what we like with situations when it is not. You could display several kinds of food or pictures of several kinds of food. Invite students to imagine all this food is available for them to eat. Which foods would you choose to eat? Which would you choose not to eat? Why? Read this statement from President Russell M. Nelson, looking for how our approach to obeying God’s commandments should differ from how we choose our food: 14:30 [Have] faith to keep all the commandments of God, knowing that they are given to bless His children and bring them joy. [You] will encounter people who pick which commandments they will keep and ignore others that they choose to break. I call this the cafeteria approach to obedience. This practice of picking and choosing will not work. It will lead to misery. To prepare to meet God, one keeps all of His commandments. It takes faith to obey them, and keeping His commandments will strengthen that faith. (“ Face the Future with Faith ,” Ensign or Liahona , May 2011, 34) Invite students to summarize what President Nelson taught about keeping all of God’s commandments into a statement of truth. Using the students’ own words, help them identify a truth like striving to keep all of God’s commandments leads to joy or picking and choosing which of God’s commandments to keep leads to misery . Why might someone choose not to keep certain commandments from God? Reflect on your own approach to obeying God’s commandments by silently pondering the following questions: How do you respond when you hear a commandment or standard you might not be sure you want to keep? How important to you is striving to obey all of God’s commandments? As you study today, seek the Spirit’s help in understanding the importance of striving to obey all of God’s commandments. King Saul’s choices Consider summarizing or reading the following paragraph to help students understand the events leading up to 1 Samuel 15 . After the Lord told Samuel to let the Israelites have a king, the Lord directed Samuel to anoint a young man named Saul to be the king (see 1 Samuel 8–10 ). When threatened by an attack from the Philistines, Saul disobeyed the Lord by offering a sacrifice that he wasn’t authorized to make (see 1 Samuel 13:8–9 ). Samuel then taught Saul the consequences of his disobedience (see 1 Samuel 13:10–14 ). In Chapter 15 , we see a similar pattern when Saul doesn’t follow the Lord’s instructions with exactness. Read 1 Samuel 15:1–3, 7–9 , where the Lord gave Saul and his army specific commandments. As you read, look for which of the Lord’s commandments Saul and his army chose to obey and which they chose not to obey. You might want to remind students that we don’t know all the reasons God commanded Saul and his army to destroy the Amalekites and their animals. But we do know God is perfect and loves all of His children, and we can still learn valuable lessons from Saul’s response to God’s commandment. How might the truth taught by President Nelson have helped Saul and his army? Attitudes and justifications The following study activity can help students recognize attitudes and excuses that can lead to disobeying God. Students could complete the activity in groups or individually. After the battle with the Amalekites, Samuel spoke to Saul about his and his army’s disobedience. Read 1 Samuel 15:13–24 , looking for attitudes and excuses that influenced Saul’s choice to disobey God’s commandments. Students could write what they find on the board. They might point out that Saul: Lied about his obedience ( verses 13, 20 ). Tried to justify his disobedience ( verses 15, 21 ). Blamed others for his actions ( verses 15, 21 ). Became prideful ( verse 17 ). Didn’t prioritize what was most important ( verse 22 ). Worried more about the opinions of others than obeying God ( verse 24 ). You might invite students to compare Saul’s attitudes and justifications with the Savior’s attitudes and actions in Matthew 26:36–39 . Invite students to share what they learn about obedience from the Savior’s example. Then, consider separating students into groups. Ask them to create the following list. Make a list of some commandments that people today might choose to overlook or ignore. Ask each group to pick one of the commandments on their list. Have them create a scenario in which a teenager might be tempted to disobey the commandment by adopting some of the attitudes or justifications students identified from 1 Samuel 15 . Or you could watch “ Honesty: You Better Believe It! ” (4:46), from ChurchofJesusChrist.org . Stop the video at time code 1:27 and invite students to use the young woman’s situation as the scenario. (You could show the conclusion of the video after students answer the questions below.) 4:47 Using their scenarios, invite students to discuss the questions below with their group. How might someone in this situation be tempted to use the attitudes or justifications that Saul used? How could choices to obey or disobey this commandment eventually lead to joy or misery? What related gospel teachings could help us choose to obey God if we were in this situation? God’s love Elder D. Todd Christofferson of the Quorum of the Twelve Apostles helped us understand why Heavenly Father and Jesus Christ give us laws that They expect us to obey: 13:12 The love of the Father and the Son is freely given but also includes hopes and expectations. … [Q]uoting President Nelson, “God’s laws are motivated entirely by His infinite love for us and His desire for us to become all we can become.” Because They love you, They do not want to leave you “just as you are.” Because They love you, They want you to have joy and success. Because They love you, They want you to repent because that is the path to happiness. But it is your choice—They honor your agency. You must choose to love Them, to serve Them, to keep Their commandments. Then They can more abundantly bless you as well as love you. (“ The Love of God ,” Liahona , Nov. 2021, 18) What would you share from this statement with someone who feels like God’s commandments are not very important? How has keeping a specific commandment of God helped you “to have joy and success”? Choosing to obey all of God’s commandments You might want to tell students that Saul’s choices to reject God’s counsel led to God instructing Samuel to find another king to take Saul’s place (see 1 Samuel 13:14 ; 15:28 ). To help students demonstrate their understanding of the importance of obeying God’s commandments, consider displaying the following instructions. Pick one of the following activities to complete in your study journal: Imagine that you have friends who are Latter-day Saints and who are justifying breaking certain commandments. They have been pressuring you to do the same. Write what you want to remember from this lesson to help you follow God’s commandments. Fill in the blanks: I want to obey God’s commandments because . Something I want to remember from what I felt or learned today is . Consider sharing your testimony of the blessings that come from striving to obey all of God’s commandments.\n\n\n--- Lesson 73 ---\nThe Lord revealed to Samuel that He had chosen David to succeed Saul as king of Israel. Through this experience, Samuel learned that the Lord sees us differently than people usually see one another. This lesson can help students feel the importance of seeing themselves and others like Heavenly Father and Jesus Christ do. Student preparation: Invite students to read 1 Samuel 16:7 . Ask them to list next to the verse differences between what others sometimes value in people and what Heavenly Father values in us. Possible Learning Activities Hidden value Consider beginning class by helping students realize that we can’t always see the worth of something by the package it is in. To do this, you might display two identical items in two different packages, or you might display items of different value in two identical packages. Before revealing the contents, invite a student to choose which package they want more. Ask them why they chose that package. Then reveal the contents of both packages. What problems can come from judging other people, or even judging ourselves, based only on what we can see? How is God’s view of us different than how we might view each other? Consider displaying the following self-reflection prompts. Ponder and complete the following prompts in your study journal: When someone first meets me, I think they are most likely to notice . I believe Heavenly Father sees the following qualities in me that many others don’t see: . When I first meet other people, I tend to notice . If I could see others as Heavenly Father does, it could help me to . As you study 1 Samuel 16 today, prayerfully invite the Holy Ghost to help you feel the importance of seeing yourself and others more like God does. The Lord sends Samuel to anoint the next king To allow all students to actively participate, consider putting students into partnerships. Invite partners to read the two passages below and to discuss the questions that follow. Before students read, ensure they know that because of Saul’s disobedience, the Lord rejected him as king of Israel (see 1 Samuel 13:13–14 ; 15:26–28 ). Read 1 Samuel 16:1–5 to see why the Lord sent Samuel to Bethlehem. If the Lord had given you Samuel’s responsibility to anoint a new king, what qualities would you have looked for in Jesse’s sons? Read verses 6–13 , looking for truths the Lord taught as Samuel tried to identify the future king. What did you learn from this account that is important for people today to understand? When partners are done sharing what they learned, invite each partnership to write one truth on the board along with the verse number where they found it. Students might write a variety of truths in their own words, such as God sees our true potential by looking at our hearts rather than our outward appearance . What have you learned from the scriptures and Church leaders about qualities the Lord values? How do you think our relationships with others would be different if we saw ourselves and each other more like the Lord sees us? Help students deepen their understanding The following options are different methods for students to deepen their understanding of what the Lord taught in 1 Samuel 16:7 . Choose the methods you feel are best for your students. Before presenting the option or options of your choice, consider helping students relate what they will study to real life. You could do this by presenting a brief situation that students could help with. For example, you could ask them to look for things they might share with someone who feels overlooked or misjudged by people around them. Or you could invite students to look for things they might share with someone who feels that the Lord doesn’t really understand them. Option 1 Consider placing students in partnerships. Have each student study a different statement. Students could then share what they learn with their partner. You might want to display or provide copies of the statements. President Dieter F. Uchtdorf, then of the First Presidency, said: Heavenly Father’s interest in you does not depend on how rich or beautiful or healthy or smart you are. He sees you not as the world sees you; He sees who you really are. He looks on your heart. And He loves you because you are His child. (“ Your Wonderful Journey Home ,” Ensign or Liahona , May 2013, 128) Sister Michelle D. Craig, formerly of the Young Women General Presidency, explained: Jesus Christ sees people deeply. He sees individuals, their needs, and who they can become. Where others saw fishermen, sinners, or publicans, Jesus saw disciples; where others saw a man possessed by devils, Jesus looked past the outward distress, acknowledged the man, and healed him. Even in our busy lives, we can follow the example of Jesus and see individuals—their needs, their faith, their struggle, and who they can become. (“ Eyes to See ,” Ensign or Liahona , Nov. 2020, 16) Option 2 Students could search the list of doctrinal mastery passages in the Doctrinal Mastery Core Document (2023) for passages that help them understand how God feels about us and how perfectly He knows us. Students could work in groups of four, with each student looking for applicable passages from one of the four standard works. (Examples they might share include Abraham 3:22–23 ; Jeremiah 1:4–5 ; Hebrews 12:9 ; Alma 7:11–13 ; Doctrine and Covenants 18:10–11 .) Option 3 Show students a video that helps them understand how God sees us or that shows someone else seeing others as He does. Invite students to think about and be prepared to share real-life situations when they could use what they learn from the video. The video “ Our True Identity ” (3:39), available at ChurchofJesusChrist.org , is one example you could use. 3:39 Personal experiences This section of the lesson can help students feel the importance of seeing themselves and others as Heavenly Father and Jesus Christ do. Remembering and sharing experiences can invite the Holy Ghost to testify of truths students are learning. It might be helpful to display the following options. Choose one of the following options and record your thoughts in your study journal. Be sure to include what you have learned about God today from the scriptures or Church leaders. Write about someone who seems to see the good in you, even if they are aware of some of your weaknesses and mistakes. How does their influence affect how you feel about yourself? How does their influence remind you of how Heavenly Father and Jesus Christ see you? Write about someone you have come to love and admire as you have gotten to know them better. What do you now see in them that others might not see or that you didn’t see when you first met them? Do you feel any impressions from the Holy Ghost of how you could help them see themselves the way that you see them or the way that their Heavenly Father and Jesus Christ see them? Invite volunteers to share parts of what they recorded in their study journals.\n\n\n--- Lesson 74 ---\nWhen David went to fight Goliath, David was “but a youth,” facing Goliath, “a man of war from his youth” ( 1 Samuel 17:33 ). However, David knew the Lord would be with him, which made all the difference. Today, we can find strength in our challenges as we face them with Jesus Christ. This lesson can help students rely on the Lord as they face their challenges. Student preparation: Invite students to think of situations when a youth might need to demonstrate courage. Students could ask a family member or friend for experiences they have had that required courage. Possible Learning Activities My Goliath Before class, consider placing tape or another type of marker on the wall to visually indicate how tall Goliath might have been (approximately 9 feet 9 inches, or 3 meters). Display the picture from the beginning of the lesson. What do you know about the story of David and Goliath? Invite a few students to stand and compare their height with Goliath’s height on the wall. Encourage them to imagine what it would be like to face Goliath in one-on-one combat. Draw a large stick figure on the board that represents Goliath. Label it Our Challenges . Invite students to list challenges youth face next to the large stick figure on the board. What are some challenges—large or small—that youth face today? After students have listed several challenges on the board, invite them to draw a large stick figure in their study journal and label it My Challenge . Students could write a personal challenge next to their stick figure. Have students quietly reflect on the following: Ponder any challenges you might have in your life. Choose one to focus on today. Think about how confident you feel that the Lord can help you with this challenge. Record your thoughts in your journal. As you study 1 Samuel 17 , invite the Holy Ghost to help you know how you can invite the Savior’s help to face your challenge. Faith over fear To help your students understand the context of this story, you could share any details from the following paragraph that students might not have shared at the beginning of the lesson. Israel was at war with the Philistines. A Philistine warrior, Goliath, issued a challenge. He said that if one of the Israelites defeated him in single combat, then the Philistines would surrender and be servants to Israel. But if Goliath won, Israel would be servants to the Philistines. For 40 days Goliath came and challenged the Israelites to battle. King Saul and Israel’s army were afraid. David came to deliver food to his brothers who were soldiers in the army. He heard Goliath defy the armies of Israel (see 1 Samuel 17:1–25 ). Read 1 Samuel 17:26 , looking for how David responded when he heard Goliath defy the armies of Israel. What stands out to you about David’s response? To help students study the following verses, you could invite three willing students to read the roles of King Saul, David, and the narrator. Read 1 Samuel 17:31–37 , looking for why David was so confident in “the living God” ( verse 36 ). To help students visualize these verses, you could show the video “ David and Goliath ” from time code 0:00 to 1:20 or “ The Lord Will Deliver Me ” from time code 0:47 to 1:59. Both videos are available at ChurchofJesusChrist.org . 2:36 3:24 What had David learned about the Lord that gave him confidence to go against Goliath? Helping students state converting principles in their own words can deepen their understanding of the scriptures and the words of the prophets. One way to do this is by asking follow-up questions after a student has shared an explanation. The following question is an example. (For additional training on how to help students state converting principles, see “ Focus on truths that lead to conversion and build faith in Jesus Christ ” in Teacher Development Skills .) How could what David learned about the Lord help us as we face our challenges? One principle that students might state in their own words is that as we rely on the Lord, He will help us face our challenges . Relying on the Lord Read 1 Samuel 17:38–51 , looking for ways David relied on the Lord as he faced Goliath. Consider marking what you find. If students read different roles of the story, they could continue doing so for these verses. You could add another student for the part of Goliath. You could also finish one of the following videos: “ David and Goliath ” from time code 1:20 to 2:36 or “ The Lord Will Deliver Me ” from time code 1:59 to 3:23. 2:36 3:24 How did David show that he relied on the Lord? Students might respond with a variety of answers, such as when David removed the king’s armor and chose stones and a sling as a weapon ( verses 39–40 ) or when he testified of Jesus Christ ( verses 45–47 ). Ask students to explain how each action demonstrated how David relied on the Lord. Facing our challenges Consider displaying five stones or drawing five stones on the board (see 1 Samuel 17:40 ). These stones can represent ways that we can rely on the Lord as we face our challenges. Consider organizing students into pairs or small groups to follow the instructions below. They could list their answers on the board next to the stones. Choose one of the challenges listed on the board under Our Challenges . Identify five ways, specific to the challenge you chose, that an individual could rely on Heavenly Father and Jesus Christ as they face this challenge. Discuss why you chose each action. Invite willing students to share what they discussed. How have Heavenly Father and Jesus Christ helped you or someone you know face a challenge? What actions did you or that person take to receive Their help? Elder Dieter F. Uchtdorf of the Quorum of the Twelve Apostles testified how Jesus Christ can help us as we face challenges: 14:11 If the Savior were standing here today, He would express His endless love for you, His complete confidence in you. He would tell you that you can do this. You can build a joyful, happy life because Jesus Christ is your strength. (“ Jesus Christ Is the Strength of Youth ,” Liahona , Nov. 2022, 12) What do you know about Jesus Christ that can help face your challenges with greater confidence in Him? Facing our personal Goliath Display the following instructions. Reflect on the personal challenge you wrote about earlier in your journal. Seek impressions from the Holy Ghost to help you choose at least one way you can rely on the Lord to face that challenge. Draw one or more stones in your study journal. Write what you will do and how you will do it next to or inside the stones. Invite willing students to share. Testify of the Savior’s ability and desire to help the students with their challenges. Express your confidence in your students’ ability to face their challenges with Jesus Christ.\n\n\n--- Lesson 75 ---\nThroughout our lives, other people will likely hurt or offend us. David was insulted by a man named Nabal. As a type of Jesus Christ, Nabal’s wife, Abigail, interceded and helped David to forgive. We can learn more about Jesus Christ and the help He gives us by comparing Abigail to Him. This lesson can help students understand how Jesus Christ can help them forgive others. Student preparation: Invite students to read, watch, or listen to “ Beauty for Ashes: The Healing Path of Forgiveness ” by Sister Kristin M. Yee ( Liahona , Nov. 2022, 36–38). They could study the entire address or portions that you have preselected. Invite students to come to class prepared to share insights that they gain about receiving the Savior’s help to forgive others. Possible Learning Activities The Atonement of Jesus Christ Consider displaying an image of Jesus Christ, such as the one at the beginning of this lesson. Write the following incomplete statement on the board. Invite students to use their study journals to list several ways they could complete it. You could play reverent music while students reflect and write. Because of Jesus Christ, I can … After sufficient time, invite willing students to share how they completed the statement. They could also express their feelings or beliefs about what they share. Display the following statement to support or add to the lists students created. President Russell M. Nelson described something we can all do because of Jesus Christ: 15:3 Through [the Savior’s] infinite Atonement, you can forgive those who have hurt you and who may never accept responsibility for their cruelty to you. It is usually easy to forgive one who sincerely and humbly seeks your forgiveness. But the Savior will grant you the ability to forgive anyone who has mistreated you in any way. Then their hurtful acts can no longer canker your soul. (“ Four Gifts That Jesus Christ Offers to You ” [First Presidency Christmas devotional, Dec. 2, 2018], Gospel Library) What does Jesus Christ make possible through His Atonement? Complete the statement on the board with the following truth: Because of Jesus Christ, I can forgive people who have hurt me. You could invite students to add this truth to their journals if it was not part of their initial list. David and Nabal 1 Samuel 25 contains an account in which the actions of Nabal’s wife, Abigail, can be compared to Jesus Christ. This comparison helps us learn more about Him. These kinds of comparisons are sometimes called types of Jesus Christ. Encourage students to invite the Holy Ghost to help them understand the type of Christ in this chapter. It might be helpful to summarize the entire account before students begin to study so they can better focus on looking for what this account teaches about Christ. As David and his men traveled in the wilderness, they met servants of a man named Nabal. During times of battle, weary soldiers often broke the law to get what they needed. David and his men needed help and support. Nabal was a wealthy man and had many flocks and herds. Rather than treating the servants of Nabal harshly and taking what they needed, David and his soldiers were kind to these servants and did not take anything from them (see 1 Samuel 25:7, 15–16 ). David sent 10 of his servants to peacefully ask Nabal for much-needed food and supplies (see 1 Samuel 25:5–9 ). Nabal insulted David and refused to help him and his army (see 1 Samuel 25:10–11 ). Under the completed statement on the board, you could draw two faces. Label one David and the other Nabal . Leave space to draw a third face between the two later in the lesson. Under the face representing David, you could write: Kind to Nabal’s servants ; Sought help from Nabal . Under the face representing Nabal, you could write: Insulted David ; Refused to help . You could invite students to change the emotions of the faces as they read the verses below. Invite half the class to read about Nabal and the other half to read about David. If needed, direct students to the footnotes for better understanding. Read 1 Samuel 25:3, 14, 17, 25 , looking for characteristics of Nabal. Read 1 Samuel 25:13, 21–22 , looking for David’s reaction to Nabal’s insults and refusal to help. Ask a volunteer from each group to write on the board what they learned about their assigned person. For example, under Nabal they could write Rude ; Wicked ; Insensitive . Under David they could write Angry ; Felt mistreated ; Sought revenge . Students could change the emotions on each face to reflect what they learned. Give students a chance to think about their own circumstances. Assure them that they will not be sharing their answers to this self-assessment. Ponder your answers to the following questions: When has someone else mistreated you? What efforts, success, or struggles have you made or had forgiving this person for their mistreatment? Abigail as a type of Christ Prepare students to study about Abigail by introducing the study skill of finding types of Christ. Explain that students can look for things that Abigail says or does that remind them of Jesus Christ, His roles, and His mission in Heavenly Father’s plan. A servant of Nabal witnessed the conflict between his master and David. The servant informed Abigail, Nabal’s wife (see 1 Samuel 25:14–17 ). When Abigail learned of this conflict, she interceded on Nabal’s behalf and asked David to forgive him (see 1 Samuel 25:18–20, 23–28 ). Abigail can be seen as a type of Christ. We can find types of Christ as we study the scriptures and look for how individuals, objects, or even events help us to think of Christ. On the board, draw a face between David and Nabal. Label this face Abigail . Give students sufficient time to study the following individually or in small groups. Read 1 Samuel 25:18–19, 23–28, 31 , looking for anything that Abigail said or did that is similar to something that Jesus Christ has said or done. Consider marking what you find. Under the face representing Abigail, make a list of things students found. Possible answers could be: Provided abundant support ( verse 18 ); Took the mistakes of Nabal upon herself ( verse 24 ); Asked David to forgive her for Nabal’s mistakes ( verse 28 ); Worked to remove grief and offense from David’s heart ( verse 31 ). How is Abigail a type of Jesus Christ? Sister Kristin M. Yee of the Relief Society General Presidency shared insights into the Savior’s ability to help us forgive. In this account, Abigail can be seen as a powerful type or symbol of Jesus Christ. Through His atoning sacrifice, He can release us from the sin and weight of a warring heart and provide us with the sustenance we need. Just as Abigail was willing to take Nabal’s sin upon herself, so did the Savior—in an incomprehensible way—take upon Him our sins and the sins of those who have hurt or offended us. … Abigail’s bringing an abundance of food and supplies can teach us that the Savior offers to those who have been hurt and injured the sustenance and help we need to be healed and made whole. … Just as Abigail helped David not to have an “offence of heart” [ 1 Samuel 25:31 ] and to receive the help he needed, so will the Savior help you. (“ Beauty for Ashes: The Healing Path of Forgiveness ,” Liahona , Nov. 2022, 36–37) Invite students to share what is meaningful to them from Sister Yee’s statement. As students share, you could replace the face that represents Abigail with the image of Jesus Christ you displayed earlier in the lesson, putting the image of the Savior between the faces of Nabal and David. How does the Savior help us forgive others? Read 1 Samuel 25:32–35 , looking for how Abigail’s actions affected David. How might we feel similarly when we receive the Savior’s help to forgive others? Demonstrate understanding Give students an opportunity to express what they understand about the Savior’s ability to help them forgive others. The following is one way you could do this. Complete the following in your study journal: Draw a face that represents your feelings when someone hurts or offends you. Next to that image, draw a face that represents a person who might have hurt you. Between the two drawings, make a list of what you understand about the Savior that can help you forgive others. Consider inviting students to share what they wrote about the Savior. You might also encourage them to share what they have learned with others outside the class. Add your witness of the help the Savior offers us as we strive to forgive others.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "2 ;1 Kings 3;6–9;11",
      "content": "Saul, David, and Solomon, the first three kings of Israel, all started out with so much promise. Humble, courageous, and wise, they each found favor with the Lord—at least at first. Sadly, each king also gave in to human weaknesses and temptation. They put their own desires before the Lord’s. And as we’ve seen over and over in the scriptures—and in our own lives—that led to tragedy.\nBut something important happened during the reign of Solomon that provided some hope for stability in the lives of the covenant people. Solomon built a temple. It was to be a more permanent house of the Lord than the tabernacle had been. And it would represent a more permanent presence of the Lord among His people. Solomon knew that the people would continue to face weakness and trials of various kinds. In dedicating the new holy house, Solomon pleaded with the Lord, “If they … return unto thee with all their heart, … then hear thou their prayer” (\n1 Kings 8:47–48\n). That’s part of what temple covenants do for us—they create a connection to God. They secure for us the promise that through our repentance and His mercy, He can “dwell among [us]” and never forsake us (\n1 Kings 6:13\n).\nFor an overview of the book of 1 Kings, see “\nKings, books of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n2 Samuel 11\n;\n12:1–14\nThe Lord can help me make good choices when I am tempted to sin.\nSometimes we look at people who seem strong in their faith, and we assume that they are unaffected by temptation. David’s tragic choices described in\n2 Samuel 11\nclearly show that this isn’t the case. Consider what lessons you can learn from his experiences. Questions like these might help you study\n2 Samuel 11–12\n:\nWhat choices did David make that led him down an increasingly sinful path? What righteous choices could he have made instead? (See also the video “To Look Upon,” Gospel Library.)\n4:15\nTo Look Upon\nUsing videos.\nVideos can help you visualize accounts from the scriptures and consider how they apply to you. Consider how you can use them to enhance teaching and learning. For example, while watching “To Look Upon” (Gospel Library), consider pausing the video at various points to ponder or discuss some of the questions suggested in this activity.\nHow is the adversary trying to lead you down sinful paths? What choices could you make now to stay spiritually safe?\nNote David’s reaction to Nathan’s story in\n2 Samuel 12:1–6\n. What does his reaction suggest about how David viewed himself? What has the Lord done to help you see yourself more accurately?\nHow would you summarize the events of\n2 Samuel 11–12\nin a one-sentence warning?\nReading about David’s bad choices could lead you to learn about the dangers of pornography and sexual sin. A good resource for this is\nFor the Strength of Youth: A Guide for Making Choices\n, especially the sections titled “\nWhat to do in the moment\n” and “\nYour body is sacred\n” (pages 21–28). Maybe you could look in that resource for counsel that would have helped David make better choices. Or you could read “\nJesus Christ will help you\n” (pages 6–9), looking for something that would have helped David return to the Lord.\nConsider singing a hymn like “\nI Need Thee Every Hour\n” (\nHymns\n, no. 98) and pondering how the Savior has strengthened you when you’ve faced temptation.\nSee also\n2 Nephi 28:20–24\n; Ulisses Soares, “\nSeek Christ in Every Thought\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 82–85; “\nTaking Charge of Technology\n,” Gospel Library; “Watch Your Step” (video), Gospel Library.\n2:36\nWatch Your Step\n1 Kings 3:1–15\nThe gift of discernment helps me distinguish between right and wrong.\nIf the Lord said to you, “Ask what I shall give thee” (\n1 Kings 3:5\n), what would you ask for? What impresses you about Solomon’s request? Ponder why “an understanding heart” to “discern between good and bad” (\nverse 9\n) is a valuable gift. What can you do to seek this gift?\nSee also\nMoroni 7:12–19\n.\n1 Kings 6–8\n;\n9:1–9\nThrough covenants made in the Lord’s house, the Lord dwells with me.\nIn\n1 Kings 6–7\nyou’ll find a detailed description of the sacred house that Solomon built for the Lord. The details may not seem as important to you as they were to the ancient Israelites. But reading these chapters might give you a sense for how important it was to them to have a house of the Lord. Why is it important to you?\nYou might ponder what the different parts of Solomon’s temple might symbolize. For example, consider what the cherubim, trees, and flowers in\n1 Kings 6:35\nmight represent. (See also\nGenesis 3:24\n.)\nChapter 8\nrecords Solomon’s prayer upon completing the temple (see\nverses 22–61\n). Consider making a list of the blessings Solomon asked for. What impresses you about these blessings? (Note also the Lord’s promises in\n2 Kings 6:11–13\n;\n9:1–9\n.) If you’ve been to the Lord’s house, think about your experiences worshipping there. How has keeping temple covenants helped you access the Lord’s blessings?\nSee also\nDoctrine and Covenants 109\n; Henry B. Eyring, “\nI Love to See the Temple\n,”\nLiahona\n, May 2021, 28–31.\nBarranquilla Colombia Temple\n1 Kings 8:61\n;\n11:1–11\n“His heart was not perfect with the Lord.”\nWhat does it mean to “let your heart … be perfect with the Lord”? (\n1 Kings 8:61\n). Is that different from our actions being perfect? How so? Read\n1 Kings 11:1–11\n, and notice what the Lord said about Solomon’s heart. You might ponder whether there are influences in your life that could turn your heart away from the Lord and toward “other gods.”\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWho was Nathan?\nWhat was the molten sea on the back of 12 oxen?\nWhat does it mean that the Lord would put His name upon the temple?\nClick to see more.\nIdeas for Teaching Children\n2 Samuel 11\nThe Lord can help me when I am tempted.\n“\nKing David\n” in\nOld Testament Stories\n, 117–20, can help you tell your children the story in\n2 Samuel 11\n. You might ask your children to identify the wrong choices David made and suggest good choices he could have made instead. What are some things we can do when we are being tempted that can help us make the right choice?\n2:11\nKing David\nReading about David’s tragic sins might be a good opportunity to discuss the dangers of pornography. The video “What Should I Do When I See Pornography?” (Gospel Library) has helpful guidance. Help your children make a plan about what they will do when they encounter pornography.\n5:46\nWhat should I do when I see pornography?\n1 Kings 8:22–61\nMaking covenants in the Lord’s house—and keeping them—helps me walk in His ways.\nAs you and your children learn about the dedication of the temple in\n1 Kings 8\n, you could look at the pictures of temples in this week’s outline. Let your children talk about details they see in the pictures. You might emphasize\nverses 57–58\n. What does it mean to “walk in all [the Lord’s] ways”? (\n1 Kings 8:58\n). Maybe your children could take a step for each answer they give.\nTell your children how keeping the covenants you make in the temple helps you walk in the Lord’s ways. You might tell them what these covenants are (see\nGeneral Handbook\n,\n27.2\n, Gospel Library). You could also sing a song together like “\nI Love to See the Temple\n” (\nChildren’s Songbook\n, 95).\nIllustration of Solomon’s temple, by Sam Lawlor\n1 Kings 11:1–11\nI can put the Lord first in my life.\nReading about how Solomon’s wives influenced him could lead to a conversation about examples of “other gods”—or things that people worship or love instead of the Lord. How do we show that we love Him more than anything else in our lives?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 26: Lesson 69: Lesson 69—1 Samuel 1This lesson can help students understand that Heavenly Father will hear their humble prayers and bless them.; Lesson 70: Lesson 70—1 Samuel 3This lesson can help students seek for and recognize personal revelation....",
      "content": "\n--- Lesson 69 ---\nHave you found yourself pleading to Heavenly Father for a blessing that seems to require your patience and faith? Hannah, a righteous Israelite woman, longed to have a child. Although her noble desires were unfulfilled “year by year” ( 1 Samuel 1:7 ), Hannah continued to act in faith and petition Heavenly Father for this blessing. Hannah’s humble prayers were answered as she received peace, joy, and a child she named Samuel. This lesson can help students understand that Heavenly Father will hear their humble prayers and bless them. Student preparation: Invite students to think of an experience when they or someone they know received an answer to prayer. Students could prepare to share that experience as part of the study activity. Possible Learning Activities When prayers feel unanswered Reverent music can invite the Holy Ghost into your classroom and prepare students’ hearts and minds for the learning experience. Consider beginning class by inviting students to select a favorite hymn that teaches the power of praying to Heavenly Father. Before the opening prayer, the class could sing or listen to the first verse of a song like “ A Child’s Prayer ,” ( Children’s Songbook , 12–13) or “ Did You Think to Pray ,” ( Hymns , no. 140). Students could also watch an appropriate video like “ Are You Really There? ” (3:46) or “ Abide with Me ,” (3:08) available at ChurchofJesusChrist.org . 3:45 3:9 As you begin the lesson, display the following scenario or something similar that best fits the needs of your class. Consider writing them on the board. After a seminary lesson on prayer, a friend approaches you and admits, “I say my prayers, but I’m not sure if they are answered.” As you talk, she asks three questions. How can I tell if Heavenly Father hears and answers my prayers? What are some of the ways Heavenly Father answers prayers? What can I do to make my prayers to Heavenly Father more meaningful? The following activity is a self-assessment. These opportunities allow students to evaluate their current understanding of truths they will study in class. It can also help students see what they may need or want to learn. On a scale of 1 (low) to 5 (high), rank how confidently you feel you could answer each question from the scenario. Select one question you would like to learn more about today. Write that question in your study journal. As you study, seek the guidance of the Spirit to help answer the question you selected. Hannah longs for a child In the land of Ephraim, a righteous Israelite named Elkanah lived with his two wives, Peninnah and Hannah (plural marriages were not uncommon at this time and were acceptable to the Lord). Read 1 Samuel 1:1–8 looking for the challenges Hannah was facing. (The “adversary” in verse 6 was possibly Peninnah.) What did you find? If you were struggling with personal challenges like Hannah, what might you think or feel? Though their situations are very different, you might ask how students how they could relate to Hannah. As students study the next passage, they might notice that initially Eli, the high priest, misunderstands Hannah’s humble prayer. Help students focus on Hannah, how she responds to Eli, and the blessing she receives from the Lord (see verse 20 ). If useful, point out that as they honestly spoke to one another, Eli quickly corrected his mistake. Students could watch the video “ Hannah’s Faith ” (3:08) available at ChurchofJesusChrist.org and follow along in their scriptures. You might pause at time code 1:03 and invite students to share their thoughts about verses 9–13 and pause again at time code 1:30 to invite students to share their insights about verses 14–20 . 3:9 Read 1 Samuel 1:9–20 and 2:1–2 looking for what Hannah did in response to her challenges. What did you discover? What can we learn about Heavenly Father and prayer from this account? Students may share a variety of thoughts. Thank them and ask why what they discovered is important to know. If students do not mention the following truth, write it on the board and ask how Hannah’s story is evidence of it: As we petition Heavenly Father in humble prayer, He hears and blesses us. What are some of the words or phrases in 1 Samuel 1:9–20 that show Hannah’s prayers were humble and meaningful? According to verses 17–18 , what comfort did the Lord give Hannah while she was waiting to be blessed with a child? It might be helpful to point out that we, like Hannah, may need to trust in the Lord and patiently wait for His blessings. He may not always respond in the way we would hope, but we can trust that He answers prayers according to His will and what is best for us. You could share an example of a humble, meaningful prayer that was not answered in the way expected, like “ How I #HearHim: Elder D. Todd Christofferson ” (2:25) from ChurchofJesusChrist.org or “ One–on–One (Ministering with Love) ” (time code 7:24 to 9:00). Alternately, you could share an example from your life. 2:25 13:2 Heavenly Father hears our prayers and blesses us You could use the following activity to deepen students’ understanding of the truth they identified above and answer the three questions from the beginning of the lesson. One way to do this is to provide or display the instructions below for each question (A, B, and C). You might give students the option to study individually or work in a small group with other students who selected the same question. You could also place students in groups of three, with each person having selected a different question to study. They could share what they find with the group. Question A: How might the story of Hannah help someone believe that Heavenly Father hears their prayers and blesses them? Use scripture study tools such as the Topical Guide, Guide to the Scriptures, and the Gospel Library to find a few scripture passages or a statement from a Church leader that could help someone understand that Heavenly Father answers prayers (for example, James 1:5–6 ; Enos 1:2–10 ; 3 Nephi 18:20 ; Doctrine and Covenants 90:24 ). Question B: How might the story of Hannah help someone understand some of the ways Heavenly Father answers their prayers? Use scripture study tools such as the Topical Guide, Guide to the Scriptures, and the Gospel Library to find a few scripture accounts or a statement from a Church leader that could help someone understand some of the ways Heavenly Father answers prayers (for example, Luke 22:39–44 ; 2 Corinthians 12:7–9 ; Mosiah 24:10–16 ; Doctrine and Covenants 6:22–23 ; 8:2–3 ). Question C: How might the story of Hannah help someone try to make their prayers more humble and meaningful? Use scripture study tools such as the Topical Guide, Guide to the Scriptures, and the Gospel Library to find a few scripture passages or a statement from a Church leader that could help someone who wants to make their prayers more humble and meaningful (for example, Enos 1:2–10 ; Alma 5:45–46 ; Ether 3:1–5 ; Doctrine and Covenants 46:30 ). Demonstrate understanding To help students share what they have learned and felt today, they could partner with someone who studied one of the other questions and teach each other. You might deepen the discussion by inviting students to share their thoughts with the class and encourage students who studied other questions to add additional insights. As you conclude class, reassure students that, like Hannah, sometimes we must wait for Heavenly Father to answer our prayers. In His way and timing, Heavenly Father does hear their prayers and will bless them.\n\n\n--- Lesson 70 ---\nHow well do you feel you can recognize the Lord’s voice in your life? One night the Lord spoke to the boy Samuel. With help from Eli, Samuel eventually recognized the Lord’s voice. He responded, “Speak, Lord, for thy servant heareth” ( 1 Samuel 3:9 ). The Lord speaks to us too, and like Samuel, we need to learn to recognize His voice. This lesson can help students seek and recognize personal revelation. Student preparation: Ask students the question, “How do you hear the voice of the Lord in your life?” Invite them to reflect on how they would answer. They could also ask friends or family members the question. Possible Learning Activities Hearing the Lord’s voice Consider inviting a volunteer to the front of the class who is willing to be blindfolded. Place a blindfold on the student. One at a time, invite a few class members to call the student by name. Ask the blindfolded student to identify who called their name. Why were some of the voices easier to recognize? What are some spiritual lessons that could relate to this activity? Students may or may not share principles similar to the truths outlined in this lesson. If they do, invite them to look for evidence or understanding of these truths as they study 1 Samuel 3 . If not, that is fine. Thank all students for what they shared. Write the following truth on the board: God speaks to us and wants us to recognize His voice . Explain that the Lord speaks to us through the Holy Ghost (see Doctrine and Covenants 8:2 ). This is known as personal revelation. Students will identify additional principles of personal revelation throughout the lesson. President Russell M. Nelson taught: One of the things the Spirit has repeatedly impressed upon my mind … is how willing the Lord is to reveal His mind and will. The privilege of receiving revelation is one of the greatest gifts of God to His children. … Does God really want to speak to you? Yes! (“ Revelation for the Church, Revelation for Our Lives ,” Ensign or Liahona , May 2018, 94–95) Invite students to reflect on the following questions: Do you believe God really wants to speak to you? Why or why not? How confident are you in your ability to recognize revelation? What makes it easy or difficult for you to recognize God’s voice (or personal revelation) in your life? Express your confidence that God wants to speak to your students. Throughout the lesson, try to seek for and recognize messages from the Lord. Try to recognize how He speaks to you. Principles of revelation Samuel was born to Hannah as an answer to her prayers. When Samuel was young, Hannah brought him to the tabernacle where Eli could care for him. One night, the boy Samuel had an experience hearing the voice of the Lord. Before providing the instructions below, you might explain that some principles in the scriptures are implied. This means they are not directly stated in the verses. The Holy Ghost can help us identify implied principles as we ask ourselves questions like “What might the author of these verses have wanted me to learn?” or “What are some of the important lessons these verses teach?” Study 1 Samuel 3:1–10, 19 , looking for insights and truths about receiving revelation from God. When students have finished studying, invite them to write principles they discovered on the board. Using their own words, students may have identified principles listed below. If they struggle to identify principles, you may list the following and invite them to identify phrases or verses that teach them. The Lord patiently reaches out to us even when we do not initially recognize His voice ( see verses 4, 6, 8, 10 ). The Lord speaks to youth ( see verses 4, 6, 8, 10 ). It often requires time and practice to become familiar with the Lord’s voice ( see verses 7, 10, 19 ). Others can help us recognize the voice of the Lord ( see verse 8–9 ). When we demonstrate a willingness to listen and act, the Lord will reveal more. ( see verses 10, 19 ) Why could these principles be helpful as we try to recognize the Lord’s voice in our lives? How are they a demonstration of His love for us? Recognizing the voice of the Lord The Lord speaks to us in many ways through the Holy Ghost. Learning how He might speak to you can help you better recognize His voice in your life. Provide students with the handout “ How Can I Recognize the Lord’s Voice? ” Consider doing the first row of the chart as a class before inviting students to complete the remaining rows. It might be best to invite students to complete this on their own to allow for personal reflection. If you feel you may not have enough time for this activity, consider inviting students to only do a few rows, or consider continuing the lesson on another day. Open PDF When students finish studying, take time to let them discuss what they discovered and to ask questions. Use this time to allow students to share how they hear the Lord’s voice in their lives. You might also share a personal experience and explain how you hear Him. Express gratitude to students for the things they share. Let them know that their contributions make a meaningful difference in class. Becoming familiar with the Lord’s voice Like Samuel, it might require time and practice for us to become familiar with the Lord’s voice and recognize personal revelation (see 1 Samuel 3:7, 10, 19 ). What are some ways we, like Samuel, can try to recognize the voice of the Lord? Some ideas might be talking to a parent or trusted mentor about how to receive revelation like Samuel spoke to Eli. Samuel said, “Speak; for thy servant heareth” ( 1 Samuel 3:10 ). Perhaps we can also make it clear to the Lord we are ready to hear His messages by having moments to ponder and listen after prayer or throughout the day. Or we could record in a journal some of the ways we may be receiving messages from Heavenly Father, like those in the handout. In your study journal, create a plan of something you would like to do to seek for and recognize revelation from God in your life. Testify that as students make a focused effort over time, their ability to recognize personal revelation will increase. Let students know they will be given an opportunity to reflect on their efforts to recognize personal revelation in Lesson 80: “ Assess Your Learning 5 .”\n\n\n--- Lesson 71 ---\nLike many people today, the ancient Israelites struggled with the temptation to fit in with others rather than obeying the Lord. For many years in the promised land, the Lord guided Israel through judges like Samuel. Later in Samuel’s life, the Israelites desired to have a king “like all the nations” ( 1 Samuel 8:5 ) instead of the Lord to reign over them. This lesson can help students understand the importance of choosing to follow Jesus Christ instead of worldly influences. Student preparation: Invite students to make a list of any peer pressures that they face to disobey standards and commandments of the Lord. Invite students to ponder the difference it would make in their lives to follow Jesus Christ instead of giving in to those pressures. Possible Learning Activities Decision-making To help students think about what influences their decisions, consider writing the following statement on the board. Students could complete the statement and respond to the accompanying questions as a class or in small groups. Some teenagers want to because “everybody else is doing it.” What challenges might a teenager experience if that is their reason for doing things? How could that reason for doing things affect their relationship with Heavenly Father and Jesus Christ? Give students an opportunity to reflect on how peer pressure may be influencing their lives. One way to do this is to give students the following instructions and display the scale. Think about what influences the decisions you make in your life. Draw the following scale in your study journal. Draw a small stick figure of yourself that represents where you would place yourself on the scale. To help students recognize what may be influencing specific decisions in their lives, they or you could provide examples of decisions they are facing. Possible examples include the way they dress, entertainment and media choices, and how they spend their time. You could share these examples one at a time and invite students to draw additional stick figures on the scale for each example. Invite students to seek the influence of the Holy Ghost as they ponder their own decisions while studying 1 Samuel 8 . A king “like all the nations” For many years in the promised land, the Lord guided the Israelites through judges like Samuel. As Samuel grew older, the elders of Israel came to him with a request. Read 1 Samuel 8:4–7 , looking for how the children of Israel might have finished the statement from the beginning of the lesson. What did the children of Israel want? Why do you think their reasons for wanting a king would displease Samuel? It may seem surprising that the Lord would tell Samuel to listen to the poor choice of his people (see verse 7 ). Heavenly Father honors agency and will not force us to choose the right. Yet, before the Israelites made their final decision, the Lord loved them enough to warn them through Samuel of the consequences of their choice (see 1 Samuel 8:9 ). One way you can help students see how the scriptures illustrate gospel truths is by writing a truth on the board. Then have students search a scripture passage, looking for evidence of that truth. Consider displaying the following truth on the board. Students could read the accompanying verses with a partner, pausing after every couple of verses to discuss what they find. Choosing to follow the world instead of the Lord’s loving counsel will lead to suffering and regret. As you study 1 Samuel 8:10–18 , look for words or phrases that help teach this truth. As students answer the following questions, remind them to not share names or specific details about individuals they personally know. Examples could come from their life, the lives of others, or from accounts in the scriptures or Church history. What examples have you seen when choosing to follow the world has led to suffering or regret? How have you seen choosing to follow Heavenly Father and Jesus Christ lead to joy and a stronger relationship with Them? To help students see the importance of following Heavenly Father and Jesus Christ instead of worldly influences, you could show Elder Randall K. Bennett’s October 2011 conference talk “ Choose Eternal Life ,” available at ChurchofJesusChrist.org , from time code 0:00 to 2:08. Elder Bennett shares the consequences he suffered because he ignored warnings. Then you could show the same video from time code 5:08 to 6:43 as Elder Bennett teaches how his experience can apply to the currents in the world we may be tempted to follow and how we can avoid them. 10:9 10:9 Choosing the Lord instead of worldly pressures The following activity can help students discover counsel the Lord has given to protect them from giving in to temptations they may feel pressured to do or believe. You could have students work in small groups to complete steps 1 and 2. They could then complete step 3 on their own. Display the following instructions. Choose something that teenage members of the Church around you might feel pressure to do or believe. Use the scriptures, scripture study helps, For the Strength of Youth: A Guide for Making Choices , or the Gospel Library app to answer the following questions about the pressure you selected: What counsel has the Lord given us about this? What blessings has the Lord promised to people who choose Him over worldly influences? Think about what you believe about Heavenly Father and Jesus Christ. Write a couple of sentences about how this knowledge can help you follow Them instead of worldly pressures. After sufficient time, provide students an opportunity to share with others what they learned from their study. Demonstrate understanding This section is designed to give students an opportunity to demonstrate their understanding of what they have learned today. Read 1 Samuel 8:19–22 , looking for how Israel responded to the Lord’s warnings about their desire to have a king. From what you have learned today, what would you want to tell the Israelites before they made their final choice? It will be helpful for future lessons for students to know that the Lord honored the Israelites’ agency and instructed Samuel to call Saul as King of Israel (see 1 Samuel 9–10 ).\n\n\n--- Lesson 72 ---\nThough God gives commandments to guide us and bring us joy, we might be tempted to respond to His commandments the way that Saul did. God gave Saul and his army specific instructions through the prophet Samuel about their conflict with the Amalekites. Saul and his army followed some of God’s commands but felt justified disobeying others. This lesson can help students understand the importance of striving to obey all of God’s commandments. Student preparation: Invite students to think of reasons people might have for choosing to disobey God’s commandments. Students could record their list in a note on their phone or write it on a small piece of paper. Invite students to bring their lists to class. Possible Learning Activities Cafeterias Consider beginning class by contrasting situations when it is appropriate to pick what we like with situations when it is not. You could display several kinds of food or pictures of several kinds of food. Invite students to imagine all this food is available for them to eat. Which foods would you choose to eat? Which would you choose not to eat? Why? Read this statement from President Russell M. Nelson, looking for how our approach to obeying God’s commandments should differ from how we choose our food: 14:30 [Have] faith to keep all the commandments of God, knowing that they are given to bless His children and bring them joy. [You] will encounter people who pick which commandments they will keep and ignore others that they choose to break. I call this the cafeteria approach to obedience. This practice of picking and choosing will not work. It will lead to misery. To prepare to meet God, one keeps all of His commandments. It takes faith to obey them, and keeping His commandments will strengthen that faith. (“ Face the Future with Faith ,” Ensign or Liahona , May 2011, 34) Invite students to summarize what President Nelson taught about keeping all of God’s commandments into a statement of truth. Using the students’ own words, help them identify a truth like striving to keep all of God’s commandments leads to joy or picking and choosing which of God’s commandments to keep leads to misery . Why might someone choose not to keep certain commandments from God? Reflect on your own approach to obeying God’s commandments by silently pondering the following questions: How do you respond when you hear a commandment or standard you might not be sure you want to keep? How important to you is striving to obey all of God’s commandments? As you study today, seek the Spirit’s help in understanding the importance of striving to obey all of God’s commandments. King Saul’s choices Consider summarizing or reading the following paragraph to help students understand the events leading up to 1 Samuel 15 . After the Lord told Samuel to let the Israelites have a king, the Lord directed Samuel to anoint a young man named Saul to be the king (see 1 Samuel 8–10 ). When threatened by an attack from the Philistines, Saul disobeyed the Lord by offering a sacrifice that he wasn’t authorized to make (see 1 Samuel 13:8–9 ). Samuel then taught Saul the consequences of his disobedience (see 1 Samuel 13:10–14 ). In Chapter 15 , we see a similar pattern when Saul doesn’t follow the Lord’s instructions with exactness. Read 1 Samuel 15:1–3, 7–9 , where the Lord gave Saul and his army specific commandments. As you read, look for which of the Lord’s commandments Saul and his army chose to obey and which they chose not to obey. You might want to remind students that we don’t know all the reasons God commanded Saul and his army to destroy the Amalekites and their animals. But we do know God is perfect and loves all of His children, and we can still learn valuable lessons from Saul’s response to God’s commandment. How might the truth taught by President Nelson have helped Saul and his army? Attitudes and justifications The following study activity can help students recognize attitudes and excuses that can lead to disobeying God. Students could complete the activity in groups or individually. After the battle with the Amalekites, Samuel spoke to Saul about his and his army’s disobedience. Read 1 Samuel 15:13–24 , looking for attitudes and excuses that influenced Saul’s choice to disobey God’s commandments. Students could write what they find on the board. They might point out that Saul: Lied about his obedience ( verses 13, 20 ). Tried to justify his disobedience ( verses 15, 21 ). Blamed others for his actions ( verses 15, 21 ). Became prideful ( verse 17 ). Didn’t prioritize what was most important ( verse 22 ). Worried more about the opinions of others than obeying God ( verse 24 ). You might invite students to compare Saul’s attitudes and justifications with the Savior’s attitudes and actions in Matthew 26:36–39 . Invite students to share what they learn about obedience from the Savior’s example. Then, consider separating students into groups. Ask them to create the following list. Make a list of some commandments that people today might choose to overlook or ignore. Ask each group to pick one of the commandments on their list. Have them create a scenario in which a teenager might be tempted to disobey the commandment by adopting some of the attitudes or justifications students identified from 1 Samuel 15 . Or you could watch “ Honesty: You Better Believe It! ” (4:46), from ChurchofJesusChrist.org . Stop the video at time code 1:27 and invite students to use the young woman’s situation as the scenario. (You could show the conclusion of the video after students answer the questions below.) 4:47 Using their scenarios, invite students to discuss the questions below with their group. How might someone in this situation be tempted to use the attitudes or justifications that Saul used? How could choices to obey or disobey this commandment eventually lead to joy or misery? What related gospel teachings could help us choose to obey God if we were in this situation? God’s love Elder D. Todd Christofferson of the Quorum of the Twelve Apostles helped us understand why Heavenly Father and Jesus Christ give us laws that They expect us to obey: 13:12 The love of the Father and the Son is freely given but also includes hopes and expectations. … [Q]uoting President Nelson, “God’s laws are motivated entirely by His infinite love for us and His desire for us to become all we can become.” Because They love you, They do not want to leave you “just as you are.” Because They love you, They want you to have joy and success. Because They love you, They want you to repent because that is the path to happiness. But it is your choice—They honor your agency. You must choose to love Them, to serve Them, to keep Their commandments. Then They can more abundantly bless you as well as love you. (“ The Love of God ,” Liahona , Nov. 2021, 18) What would you share from this statement with someone who feels like God’s commandments are not very important? How has keeping a specific commandment of God helped you “to have joy and success”? Choosing to obey all of God’s commandments You might want to tell students that Saul’s choices to reject God’s counsel led to God instructing Samuel to find another king to take Saul’s place (see 1 Samuel 13:14 ; 15:28 ). To help students demonstrate their understanding of the importance of obeying God’s commandments, consider displaying the following instructions. Pick one of the following activities to complete in your study journal: Imagine that you have friends who are Latter-day Saints and who are justifying breaking certain commandments. They have been pressuring you to do the same. Write what you want to remember from this lesson to help you follow God’s commandments. Fill in the blanks: I want to obey God’s commandments because . Something I want to remember from what I felt or learned today is . Consider sharing your testimony of the blessings that come from striving to obey all of God’s commandments.\n\n\n--- Lesson 73 ---\nThe Lord revealed to Samuel that He had chosen David to succeed Saul as king of Israel. Through this experience, Samuel learned that the Lord sees us differently than people usually see one another. This lesson can help students feel the importance of seeing themselves and others like Heavenly Father and Jesus Christ do. Student preparation: Invite students to read 1 Samuel 16:7 . Ask them to list next to the verse differences between what others sometimes value in people and what Heavenly Father values in us. Possible Learning Activities Hidden value Consider beginning class by helping students realize that we can’t always see the worth of something by the package it is in. To do this, you might display two identical items in two different packages, or you might display items of different value in two identical packages. Before revealing the contents, invite a student to choose which package they want more. Ask them why they chose that package. Then reveal the contents of both packages. What problems can come from judging other people, or even judging ourselves, based only on what we can see? How is God’s view of us different than how we might view each other? Consider displaying the following self-reflection prompts. Ponder and complete the following prompts in your study journal: When someone first meets me, I think they are most likely to notice . I believe Heavenly Father sees the following qualities in me that many others don’t see: . When I first meet other people, I tend to notice . If I could see others as Heavenly Father does, it could help me to . As you study 1 Samuel 16 today, prayerfully invite the Holy Ghost to help you feel the importance of seeing yourself and others more like God does. The Lord sends Samuel to anoint the next king To allow all students to actively participate, consider putting students into partnerships. Invite partners to read the two passages below and to discuss the questions that follow. Before students read, ensure they know that because of Saul’s disobedience, the Lord rejected him as king of Israel (see 1 Samuel 13:13–14 ; 15:26–28 ). Read 1 Samuel 16:1–5 to see why the Lord sent Samuel to Bethlehem. If the Lord had given you Samuel’s responsibility to anoint a new king, what qualities would you have looked for in Jesse’s sons? Read verses 6–13 , looking for truths the Lord taught as Samuel tried to identify the future king. What did you learn from this account that is important for people today to understand? When partners are done sharing what they learned, invite each partnership to write one truth on the board along with the verse number where they found it. Students might write a variety of truths in their own words, such as God sees our true potential by looking at our hearts rather than our outward appearance . What have you learned from the scriptures and Church leaders about qualities the Lord values? How do you think our relationships with others would be different if we saw ourselves and each other more like the Lord sees us? Help students deepen their understanding The following options are different methods for students to deepen their understanding of what the Lord taught in 1 Samuel 16:7 . Choose the methods you feel are best for your students. Before presenting the option or options of your choice, consider helping students relate what they will study to real life. You could do this by presenting a brief situation that students could help with. For example, you could ask them to look for things they might share with someone who feels overlooked or misjudged by people around them. Or you could invite students to look for things they might share with someone who feels that the Lord doesn’t really understand them. Option 1 Consider placing students in partnerships. Have each student study a different statement. Students could then share what they learn with their partner. You might want to display or provide copies of the statements. President Dieter F. Uchtdorf, then of the First Presidency, said: Heavenly Father’s interest in you does not depend on how rich or beautiful or healthy or smart you are. He sees you not as the world sees you; He sees who you really are. He looks on your heart. And He loves you because you are His child. (“ Your Wonderful Journey Home ,” Ensign or Liahona , May 2013, 128) Sister Michelle D. Craig, formerly of the Young Women General Presidency, explained: Jesus Christ sees people deeply. He sees individuals, their needs, and who they can become. Where others saw fishermen, sinners, or publicans, Jesus saw disciples; where others saw a man possessed by devils, Jesus looked past the outward distress, acknowledged the man, and healed him. Even in our busy lives, we can follow the example of Jesus and see individuals—their needs, their faith, their struggle, and who they can become. (“ Eyes to See ,” Ensign or Liahona , Nov. 2020, 16) Option 2 Students could search the list of doctrinal mastery passages in the Doctrinal Mastery Core Document (2023) for passages that help them understand how God feels about us and how perfectly He knows us. Students could work in groups of four, with each student looking for applicable passages from one of the four standard works. (Examples they might share include Abraham 3:22–23 ; Jeremiah 1:4–5 ; Hebrews 12:9 ; Alma 7:11–13 ; Doctrine and Covenants 18:10–11 .) Option 3 Show students a video that helps them understand how God sees us or that shows someone else seeing others as He does. Invite students to think about and be prepared to share real-life situations when they could use what they learn from the video. The video “ Our True Identity ” (3:39), available at ChurchofJesusChrist.org , is one example you could use. 3:39 Personal experiences This section of the lesson can help students feel the importance of seeing themselves and others as Heavenly Father and Jesus Christ do. Remembering and sharing experiences can invite the Holy Ghost to testify of truths students are learning. It might be helpful to display the following options. Choose one of the following options and record your thoughts in your study journal. Be sure to include what you have learned about God today from the scriptures or Church leaders. Write about someone who seems to see the good in you, even if they are aware of some of your weaknesses and mistakes. How does their influence affect how you feel about yourself? How does their influence remind you of how Heavenly Father and Jesus Christ see you? Write about someone you have come to love and admire as you have gotten to know them better. What do you now see in them that others might not see or that you didn’t see when you first met them? Do you feel any impressions from the Holy Ghost of how you could help them see themselves the way that you see them or the way that their Heavenly Father and Jesus Christ see them? Invite volunteers to share parts of what they recorded in their study journals.\n\n\n--- Lesson 74 ---\nWhen David went to fight Goliath, David was “but a youth,” facing Goliath, “a man of war from his youth” ( 1 Samuel 17:33 ). However, David knew the Lord would be with him, which made all the difference. Today, we can find strength in our challenges as we face them with Jesus Christ. This lesson can help students rely on the Lord as they face their challenges. Student preparation: Invite students to think of situations when a youth might need to demonstrate courage. Students could ask a family member or friend for experiences they have had that required courage. Possible Learning Activities My Goliath Before class, consider placing tape or another type of marker on the wall to visually indicate how tall Goliath might have been (approximately 9 feet 9 inches, or 3 meters). Display the picture from the beginning of the lesson. What do you know about the story of David and Goliath? Invite a few students to stand and compare their height with Goliath’s height on the wall. Encourage them to imagine what it would be like to face Goliath in one-on-one combat. Draw a large stick figure on the board that represents Goliath. Label it Our Challenges . Invite students to list challenges youth face next to the large stick figure on the board. What are some challenges—large or small—that youth face today? After students have listed several challenges on the board, invite them to draw a large stick figure in their study journal and label it My Challenge . Students could write a personal challenge next to their stick figure. Have students quietly reflect on the following: Ponder any challenges you might have in your life. Choose one to focus on today. Think about how confident you feel that the Lord can help you with this challenge. Record your thoughts in your journal. As you study 1 Samuel 17 , invite the Holy Ghost to help you know how you can invite the Savior’s help to face your challenge. Faith over fear To help your students understand the context of this story, you could share any details from the following paragraph that students might not have shared at the beginning of the lesson. Israel was at war with the Philistines. A Philistine warrior, Goliath, issued a challenge. He said that if one of the Israelites defeated him in single combat, then the Philistines would surrender and be servants to Israel. But if Goliath won, Israel would be servants to the Philistines. For 40 days Goliath came and challenged the Israelites to battle. King Saul and Israel’s army were afraid. David came to deliver food to his brothers who were soldiers in the army. He heard Goliath defy the armies of Israel (see 1 Samuel 17:1–25 ). Read 1 Samuel 17:26 , looking for how David responded when he heard Goliath defy the armies of Israel. What stands out to you about David’s response? To help students study the following verses, you could invite three willing students to read the roles of King Saul, David, and the narrator. Read 1 Samuel 17:31–37 , looking for why David was so confident in “the living God” ( verse 36 ). To help students visualize these verses, you could show the video “ David and Goliath ” from time code 0:00 to 1:20 or “ The Lord Will Deliver Me ” from time code 0:47 to 1:59. Both videos are available at ChurchofJesusChrist.org . 2:36 3:24 What had David learned about the Lord that gave him confidence to go against Goliath? Helping students state converting principles in their own words can deepen their understanding of the scriptures and the words of the prophets. One way to do this is by asking follow-up questions after a student has shared an explanation. The following question is an example. (For additional training on how to help students state converting principles, see “ Focus on truths that lead to conversion and build faith in Jesus Christ ” in Teacher Development Skills .) How could what David learned about the Lord help us as we face our challenges? One principle that students might state in their own words is that as we rely on the Lord, He will help us face our challenges . Relying on the Lord Read 1 Samuel 17:38–51 , looking for ways David relied on the Lord as he faced Goliath. Consider marking what you find. If students read different roles of the story, they could continue doing so for these verses. You could add another student for the part of Goliath. You could also finish one of the following videos: “ David and Goliath ” from time code 1:20 to 2:36 or “ The Lord Will Deliver Me ” from time code 1:59 to 3:23. 2:36 3:24 How did David show that he relied on the Lord? Students might respond with a variety of answers, such as when David removed the king’s armor and chose stones and a sling as a weapon ( verses 39–40 ) or when he testified of Jesus Christ ( verses 45–47 ). Ask students to explain how each action demonstrated how David relied on the Lord. Facing our challenges Consider displaying five stones or drawing five stones on the board (see 1 Samuel 17:40 ). These stones can represent ways that we can rely on the Lord as we face our challenges. Consider organizing students into pairs or small groups to follow the instructions below. They could list their answers on the board next to the stones. Choose one of the challenges listed on the board under Our Challenges . Identify five ways, specific to the challenge you chose, that an individual could rely on Heavenly Father and Jesus Christ as they face this challenge. Discuss why you chose each action. Invite willing students to share what they discussed. How have Heavenly Father and Jesus Christ helped you or someone you know face a challenge? What actions did you or that person take to receive Their help? Elder Dieter F. Uchtdorf of the Quorum of the Twelve Apostles testified how Jesus Christ can help us as we face challenges: 14:11 If the Savior were standing here today, He would express His endless love for you, His complete confidence in you. He would tell you that you can do this. You can build a joyful, happy life because Jesus Christ is your strength. (“ Jesus Christ Is the Strength of Youth ,” Liahona , Nov. 2022, 12) What do you know about Jesus Christ that can help face your challenges with greater confidence in Him? Facing our personal Goliath Display the following instructions. Reflect on the personal challenge you wrote about earlier in your journal. Seek impressions from the Holy Ghost to help you choose at least one way you can rely on the Lord to face that challenge. Draw one or more stones in your study journal. Write what you will do and how you will do it next to or inside the stones. Invite willing students to share. Testify of the Savior’s ability and desire to help the students with their challenges. Express your confidence in your students’ ability to face their challenges with Jesus Christ.\n\n\n--- Lesson 75 ---\nThroughout our lives, other people will likely hurt or offend us. David was insulted by a man named Nabal. As a type of Jesus Christ, Nabal’s wife, Abigail, interceded and helped David to forgive. We can learn more about Jesus Christ and the help He gives us by comparing Abigail to Him. This lesson can help students understand how Jesus Christ can help them forgive others. Student preparation: Invite students to read, watch, or listen to “ Beauty for Ashes: The Healing Path of Forgiveness ” by Sister Kristin M. Yee ( Liahona , Nov. 2022, 36–38). They could study the entire address or portions that you have preselected. Invite students to come to class prepared to share insights that they gain about receiving the Savior’s help to forgive others. Possible Learning Activities The Atonement of Jesus Christ Consider displaying an image of Jesus Christ, such as the one at the beginning of this lesson. Write the following incomplete statement on the board. Invite students to use their study journals to list several ways they could complete it. You could play reverent music while students reflect and write. Because of Jesus Christ, I can … After sufficient time, invite willing students to share how they completed the statement. They could also express their feelings or beliefs about what they share. Display the following statement to support or add to the lists students created. President Russell M. Nelson described something we can all do because of Jesus Christ: 15:3 Through [the Savior’s] infinite Atonement, you can forgive those who have hurt you and who may never accept responsibility for their cruelty to you. It is usually easy to forgive one who sincerely and humbly seeks your forgiveness. But the Savior will grant you the ability to forgive anyone who has mistreated you in any way. Then their hurtful acts can no longer canker your soul. (“ Four Gifts That Jesus Christ Offers to You ” [First Presidency Christmas devotional, Dec. 2, 2018], Gospel Library) What does Jesus Christ make possible through His Atonement? Complete the statement on the board with the following truth: Because of Jesus Christ, I can forgive people who have hurt me. You could invite students to add this truth to their journals if it was not part of their initial list. David and Nabal 1 Samuel 25 contains an account in which the actions of Nabal’s wife, Abigail, can be compared to Jesus Christ. This comparison helps us learn more about Him. These kinds of comparisons are sometimes called types of Jesus Christ. Encourage students to invite the Holy Ghost to help them understand the type of Christ in this chapter. It might be helpful to summarize the entire account before students begin to study so they can better focus on looking for what this account teaches about Christ. As David and his men traveled in the wilderness, they met servants of a man named Nabal. During times of battle, weary soldiers often broke the law to get what they needed. David and his men needed help and support. Nabal was a wealthy man and had many flocks and herds. Rather than treating the servants of Nabal harshly and taking what they needed, David and his soldiers were kind to these servants and did not take anything from them (see 1 Samuel 25:7, 15–16 ). David sent 10 of his servants to peacefully ask Nabal for much-needed food and supplies (see 1 Samuel 25:5–9 ). Nabal insulted David and refused to help him and his army (see 1 Samuel 25:10–11 ). Under the completed statement on the board, you could draw two faces. Label one David and the other Nabal . Leave space to draw a third face between the two later in the lesson. Under the face representing David, you could write: Kind to Nabal’s servants ; Sought help from Nabal . Under the face representing Nabal, you could write: Insulted David ; Refused to help . You could invite students to change the emotions of the faces as they read the verses below. Invite half the class to read about Nabal and the other half to read about David. If needed, direct students to the footnotes for better understanding. Read 1 Samuel 25:3, 14, 17, 25 , looking for characteristics of Nabal. Read 1 Samuel 25:13, 21–22 , looking for David’s reaction to Nabal’s insults and refusal to help. Ask a volunteer from each group to write on the board what they learned about their assigned person. For example, under Nabal they could write Rude ; Wicked ; Insensitive . Under David they could write Angry ; Felt mistreated ; Sought revenge . Students could change the emotions on each face to reflect what they learned. Give students a chance to think about their own circumstances. Assure them that they will not be sharing their answers to this self-assessment. Ponder your answers to the following questions: When has someone else mistreated you? What efforts, success, or struggles have you made or had forgiving this person for their mistreatment? Abigail as a type of Christ Prepare students to study about Abigail by introducing the study skill of finding types of Christ. Explain that students can look for things that Abigail says or does that remind them of Jesus Christ, His roles, and His mission in Heavenly Father’s plan. A servant of Nabal witnessed the conflict between his master and David. The servant informed Abigail, Nabal’s wife (see 1 Samuel 25:14–17 ). When Abigail learned of this conflict, she interceded on Nabal’s behalf and asked David to forgive him (see 1 Samuel 25:18–20, 23–28 ). Abigail can be seen as a type of Christ. We can find types of Christ as we study the scriptures and look for how individuals, objects, or even events help us to think of Christ. On the board, draw a face between David and Nabal. Label this face Abigail . Give students sufficient time to study the following individually or in small groups. Read 1 Samuel 25:18–19, 23–28, 31 , looking for anything that Abigail said or did that is similar to something that Jesus Christ has said or done. Consider marking what you find. Under the face representing Abigail, make a list of things students found. Possible answers could be: Provided abundant support ( verse 18 ); Took the mistakes of Nabal upon herself ( verse 24 ); Asked David to forgive her for Nabal’s mistakes ( verse 28 ); Worked to remove grief and offense from David’s heart ( verse 31 ). How is Abigail a type of Jesus Christ? Sister Kristin M. Yee of the Relief Society General Presidency shared insights into the Savior’s ability to help us forgive. In this account, Abigail can be seen as a powerful type or symbol of Jesus Christ. Through His atoning sacrifice, He can release us from the sin and weight of a warring heart and provide us with the sustenance we need. Just as Abigail was willing to take Nabal’s sin upon herself, so did the Savior—in an incomprehensible way—take upon Him our sins and the sins of those who have hurt or offended us. … Abigail’s bringing an abundance of food and supplies can teach us that the Savior offers to those who have been hurt and injured the sustenance and help we need to be healed and made whole. … Just as Abigail helped David not to have an “offence of heart” [ 1 Samuel 25:31 ] and to receive the help he needed, so will the Savior help you. (“ Beauty for Ashes: The Healing Path of Forgiveness ,” Liahona , Nov. 2022, 36–37) Invite students to share what is meaningful to them from Sister Yee’s statement. As students share, you could replace the face that represents Abigail with the image of Jesus Christ you displayed earlier in the lesson, putting the image of the Savior between the faces of Nabal and David. How does the Savior help us forgive others? Read 1 Samuel 25:32–35 , looking for how Abigail’s actions affected David. How might we feel similarly when we receive the Savior’s help to forgive others? Demonstrate understanding Give students an opportunity to express what they understand about the Savior’s ability to help them forgive others. The following is one way you could do this. Complete the following in your study journal: Draw a face that represents your feelings when someone hurts or offends you. Next to that image, draw a face that represents a person who might have hurt you. Between the two drawings, make a list of what you understand about the Savior that can help you forgive others. Consider inviting students to share what they wrote about the Savior. You might also encourage them to share what they have learned with others outside the class. Add your witness of the help the Savior offers us as we strive to forgive others.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 58436,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.385650"
}