{
  "week_number": 48,
  "date_range": "Amos",
  "title": "Amos;Obadiah;Jonah",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: Amos;Obadiah;Jonah ---\nJonah was on a ship headed for Tarshish. There’s nothing wrong with sailing to Tarshish, except that it is far away from Nineveh, where Jonah was supposed to go to deliver God’s message. When the ship encountered a great storm, Jonah knew it was because of his disobedience. At Jonah’s insistence, his fellow mariners cast him into the depths of the sea to stop the storm. It looked like the end of Jonah and his ministry. But the Lord hadn’t given up on Jonah—just as He hadn’t given up on the people of Nineveh, on the house of Israel, or on any of us.\nSo He keeps sending prophets—like Jonah, Amos, Obadiah, and our prophets today—with the message that if we repent, we will not be cast off forever. Of all the “secrets” God reveals (see\nAmos 3:7\n), this one is among the most precious: that because of Jesus Christ, it’s not too late to change. He still wants to help us live up to the covenants we made with Him, and He’s willing to offer us another chance.\nFor more about these books, see “\nAmos\n,” “\nObadiah\n,” and “\nJonah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nAmos 3:1–8\n;\n7:10–15\nThe Lord reveals truth through His prophets.\nIn\nAmos 3:3–6\n, the prophet Amos presented examples of conclusions we can draw from signs we hear or see: when a lion roars, it must have captured prey; if a bird is caught in a trap, there must have been bait there. In\nverses 7–8\n, Amos applied this logic to prophets. What conclusions can we draw when a prophet prophesies? What else do you learn about prophets from\nAmos 7:10–15\n?\nWhat has the Lord revealed to you through His prophets?\nElder Ulisses Soares said that “having prophets is a sign of God’s love” (“\nProphets Speak by the Power of the Holy Spirit\n,”\nEnsign\nor\nLiahona\n, May 2018, 99). Consider how you would complete this sentence: “I know God loves me, because He sends prophets who …” Here are some scriptures that can help:\nDeuteronomy 18:18\n;\nEzekiel 3:16–17\n;\nEphesians 4:11–14\n;\n1 Nephi 22:2\n;\nDoctrine and Covenants 21:4–6\n;\n84:36–38\n;\n107:91–92\n.\nWhat would you say to someone who feels prophets are not needed today?\nSee also Topics and Questions, “\nProphets,\n” Gospel Library.\nAmos 4–5\n“Seek the Lord, and ye shall live.”\nAccording to\nAmos 4:6–13\n, what had the Lord hoped would happen after the Israelites experienced trials? (see also\nHelaman 12:3\n). While your trials may not have been sent by God, how have they given you opportunities to turn to Him?\nAs you read\nAmos 5:4, 14–15\n, ponder how the Lord has been gracious to you. How has seeking Him brought you life?\nAmos 8:11–12\nThe word of the Lord can satisfy spiritual hunger and thirst.\nAs you read\nAmos 8:11–12\n, think about why famine is a good comparison for living without God’s word (see also\nJohn 6:26–35\n;\n2 Nephi 9:50–51\n;\n32:3\n;\nEnos 1:4–8\n). How do you know when you are spiritually hungry?\nThese verses could also apply to the Great Apostasy (see Topics and Questions, “\nApostasy\n,” Gospel Library). How has that spiritual “famine” affected God’s children? How has the Restoration satisfied your spiritual hunger?\nSee also “The Great Apostasy” (video), Gospel Library.\n16:36\nThe Great Apostasy\nObadiah 1:21\nWho are the “saviours … on mount Zion”?\nReferring to\nObadiah 1:21\n, President Gordon B. Hinckley explained that we become saviors on Mount Zion when we receive ordinances for the dead in the temple (see “\nClosing Remarks\n,”\nEnsign\nor\nLiahona\n, Nov. 2004, 105). How is doing that work similar—if only in a small way—to what the Savior did for us? How has doing this work helped you feel closer to the Savior?\nSee also “\nHoly Temples on Mount Zion\n,”\nHymns\n, no. 289.\nJonah 1–4\nThe Lord is merciful to all who turn to Him.\nNineveh was an enemy of Israel known for its violence and cruelty. To Jonah, it seemed unrealistic that they were ready to repent. It might be interesting to compare Jonah’s attitude (see\nJonah 1\n;\n3–4\n) to the feelings of Alma and the sons of Mosiah (see\nMosiah 28:1–5\n;\nAlma 17:23–25\n). What do you learn from\nJonah 3\nthat inspires you to share the gospel even with people who may not seem ready to change?\nAs you read Jonah, look for examples of the Lord’s mercy. Why do you feel Jonah was “displeased” and “very angry” (\nJonah 4:1\n) when the Lord extended mercy to the people of Nineveh? What do you feel the Lord was trying to teach him in\nchapter 4\n? Ponder how you have experienced His mercy in your life. What do you learn from Jonah that can help you be more merciful?\nIdeas for Teaching Children\nBecause this Sunday is the fifth Sunday of the month, Primary teachers are encouraged to use learning activities in “\nAppendix B: Preparing Children for a Lifetime on God’s Covenant Path\n.”\nAmos 3:7\nProphets are messengers of Jesus Christ.\nTo help your children understand\nAmos 3:7\n, you could whisper a simple message to one of them and ask them to share the message with the other children. How is the messenger in this activity like a prophet? Why does the Lord give us prophets?\nTo learn more about what prophets do, you and your children could review\nrecent messages from the current President of the Church\n. You could also sing a song like “\nFollow the Prophet\n” (\nChildren’s Songbook\n, 110–11). Share with each other why you choose to follow God’s prophet.\nHelp children memorize scriptures.\nElder Richard G. Scott shared: “To memorize a scripture is to forge a new friendship. It is like discovering a new individual who can help in time of need, give inspiration and comfort, and be a source of motivation for needed change” (“\nThe Power of Scripture\n,”\nEnsign\n, Nov. 2011, 6). To help your children memorize all or part of\nAmos 3:7\n, you could write it down and repeat it together. Then you could erase or cover a few words at a time until your children can repeat the entire verse from memory.\nAmos 8:11–12\nThe Restoration of the gospel ended the famine of apostasy.\nInvite your children to pretend to be hungry as you read\nAmos 8:11–12\n. What does it feel like when we are hungry for God’s word? Maybe your children could pretend to eat as you share with each other some of your favorite scriptures.\nYou could use Guide to the Scriptures, “\nApostasy\n” (Gospel Library), or “\nAfter the New Testament\n” (in\nNew Testament Stories\n, 167–70) to help your children understand the “famine” that came from the Great Apostasy and how it ended with the Restoration. Share with each other reasons you are grateful that the Lord restored His gospel in our day.\n2:52\nAfter the New Testament\nJonah 1–3\nThe Lord will help me obey Him, even when it’s hard.\nTo help your children learn the story of Jonah, you could review “\nJonah the Prophet\n” in\nOld Testament Stories\n; see also this week’s activity page). You could then ask:\nWhat happened when Jonah didn’t obey the Lord? (see\nJonah 1:4–17\n).\nWhat did Jonah do to repent? (see\nJonah 1:10–12\n;\n2:1–4, 9\n;\n3:1–4\n).\nWhat happened when Jonah did obey? (see\nJonah 3:5\n).\n2:30\nJonah the Prophet\nYour children might enjoy retelling the story of Jonah or acting it out. Share with each other some experiences when the Lord wanted you to do something that was hard for you. How did He help you obey Him?\nJonah 1–4\nThe Lord is merciful to all who turn to Him.\nMaybe your children could pretend they are interviewing Jonah about his experience. What questions would they ask him? Encourage them to ask questions to find out what Jonah learned about the Lord. What might Jonah say, for example, about the Lord’s mercy? (see, for example,\nJonah 2:7–10\n;\n3:10\n;\n4:2\n).\nChrist and the Palsied Man\n, by J. Kirk Richards\nHelp your children think of examples when the Savior showed mercy to others, such as\nMark 2:3–12\n;\nLuke 23:33–34\n; and\nJohn 8:1–11\n. You and your children could search for pictures of these examples. What opportunities do we have to be merciful to others?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 48: Lesson 149: Lesson 149—Amos 3; 7This lesson can help students understand that Heavenly Father and Jesus Christ reveal counsel and truth through Their prophets.; Lesson 150: Lesson 150—Amos 8This lesson can help students increase their confidence that Heavenly Father and Jesus Christ can satisfy their spiritual hunger through the Restoration of the gospel.... ---\n\n--- Lesson 149 ---\nIn a world with many persuasive voices, it can be difficult to know which voices to trust. Fortunately, our loving Father in Heaven and Savior, Jesus Christ, reveal Their plans to us through Their living prophets. This lesson can help students understand that Heavenly Father and Jesus Christ reveal counsel and truth through Their prophets. Possible Learning Activities Responses to prophetic counsel The following activity is designed to help students ponder their attitude toward prophets. It may be helpful to write the following three social media responses on the board. As an alternative to the following activity, you could invite students to imagine that the responses were shared by their friends after listening to the prophet speak at general conference or a youth devotional. You could then skip the accompanying question. Imagine seeing the following as responses to a social media post: “He has no business talking about this. He doesn’t understand.” “He’s out of touch with what’s really happening.” “With everything else I need to do, I don’t see how I could possibly apply this counsel to my very busy life.” Who could these responses be referring to? You could display a picture of the living prophet and invite students to imagine that these comments were responses to something the prophet said. Students could share why someone may have one of the above attitudes. Consider displaying the following questions to help students assess their feelings about following prophetic counsel. Take a moment to reflect on your view of the Lord’s prophet on the earth today. You could consider your answers to the following questions: How do I feel about the prophet’s counsel? Do my feelings change depending on what counsel he gives? What reasons might I give for following prophetic counsel? Are there any ways I struggle to follow prophetic counsel? As we study in the book of Amos today, the Holy Ghost can help you learn more about the importance of God’s words given to us through His prophets. You may want to write down insights or questions you have while you study today. The Lord reveals His plans through His prophets By the time of Amos’s prophetic ministry to the northern kingdom of Israel, many of God’s covenant people had forsaken Him and His prophets and followed the wicked ways of neighboring nations (see Amos 2:6–12 ). The Lord chose Amos to call them to repentance. Amos prophesied the destruction and captivity of King Jeroboam II and His people (see Amos 7:8–9; 11, 17 ). Read Amos 7:10–15 , looking for how Amaziah, the priest of King Jeroboam II, responded to Amos’s prophetic counsel. What did you find? Why do you think the people thought they could not “bear all [Amos’s] words” ( Amos 7:10 ) and wanted him to go prophesy somewhere else (see Amos 7:12 )? Why do you think God’s prophets continue to teach even when some people see them as being unpopular, out of touch, or not needed? If students do not mention it, you can ask what Amos did before being called to be prophet (see Amos 7:14 ) and what the Lord did in verse 15 to call Amos to become a prophet. Explain that, like with Joseph Smith and others, the Lord does not require His prophets to hold high status or accomplishments before He calls them to be prophets. If students need help answering this question, you may want to share the statement from President Nelson in “ Additional Resources ” of this lesson in Gospel Library. A few chapters earlier, the Lord revealed a powerful truth about Himself and His prophets through Amos. Amos 3:7 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Amos 3:7–8 , looking for what the Lord will always do through His prophets. It may be helpful for students to know that other terms for secret include counsel or plan . What can we learn from these verses about the Lord? Students may use different words to identify that the Lord reveals His plans through His prophets . You might share, as an example of this truth, that before Judah and Israel were eventually destroyed because of the wickedness of the people, the Lord revealed what would happen if the people did not repent (see Amos 2:4–6 , 8:11–12 ). As the lesson continues, look for ways to emphasize that the Lord loves us and wants to guide us. What can this truth teach you about why it’s important for you to listen to the prophet regardless of how others respond to his words? Following the Lord’s prophets The following activity is one way to help students deepen their understanding that Heavenly Father and Jesus Christ reveal truth through Their prophets. Consider organizing students in small groups and displaying the steps of the activity one at a time. Recall the social media comments at the beginning of the lesson and select one. The following activity can help you prepare to write a response. Reread Amos 3:7 and ponder how it may help the person who made that comment. Also read the following doctrinal mastery passages, looking for how they may help. (Consider linking or cross-referencing these scriptures with Amos 3:7 .) Ezekiel 3:16–17 Doctrine and Covenants 1:37–38 Doctrine and Covenants 21:4–6 Include at least two blessings that can come when you listen to God’s prophet. You can find examples in the scriptures, stories from Church history, or teachings from prophets today. Try to share one example where a prophet’s words made a positive difference in your life. You could share some of the following examples with students, as needed: Through His prophet Noah, the Lord warned the people that if they didn’t repent, they would be destroyed by a flood (see Moses 8:22–30 ; Genesis 7:17–24 ). The prophet Isaiah prophesied about what the Savior would experience through His Atonement (see Isaiah 53:3–5 ). Home-centered and Church-supported church “prepared us … before any hint of a pandemic, enabling us to endure the challenges that have come” (Gary E. Stevenson, “ Highly Favored of the Lord ,” Ensign or Liahona , Nov. 2020, 103). My response Using what you have learned and felt today, write a helpful response to one of the negative comments from the beginning of the lesson. Be sure to include at least one scripture and one example, which could be a personal experience. Invite a few willing students to share their responses. Consider sharing what the Holy Ghost has taught you about God’s love and guidance through His prophets. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Amos 3:7 is “The Lord God … revealeth his secret unto his servants the prophets.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 150 ---\nWe have all felt hunger. Imagine what it might be like to suffer from spiritual hunger. The Lord taught the Israelites through Amos using this imagery. Amos prophesied that his people would no longer be given His word because they had rejected it. Losing the Lord’s word would lead to a spiritual famine. This lesson can help students increase their confidence that Heavenly Father and Jesus Christ can satisfy their spiritual hunger through the Restoration of the gospel. Student preparation: Invite students to ponder how their lives would be different if they didn’t have the scriptures or words of prophets. Students could come to class ready to share what they thought of. Possible Learning Activities Spiritual hunger Consider beginning class by displaying a picture of food or bringing a simple food item and asking the following questions. When is a time you have felt particularly hungry? How might we act when we are hungry? Answers could include feeling irritated, having low energy, or being desperate for any kind of food. Write the phrase Spiritual Hunger on the board. What might people hunger for spiritually and struggle to find? Consider writing student responses on the board. Students might say things like God’s love, purpose in their lives, knowing truth, direction in difficult decisions, etc. Take a moment to write in your study journal ways in which you or someone you know might currently feel spiritual hunger. Encourage students to seek the Holy Ghost today as they consider what they can do to receive the spiritual nourishment Jesus Christ offers. A famine of hearing the words of the Lord The prophet Amos prophesied of spiritual hunger. He revealed the Lord’s words to the people of Israel, but they did not want to hear them (see Amos 2:12 ; 7:11–16 ). If you feel it would be helpful, invite students to read Amos 7:12–13 to understand how the Israelites responded to the Lord’s words through Amos. Read Amos 8:11–12 looking for the consequences of the people rejecting the Lord’s word. If necessary, explain that a famine is an extreme shortage of food. What consequences did you see? If students do not point them out, share truths like the following: When people reject the Lord’s prophets, they lose the blessings of the word of the Lord. Without the word of God, we starve spiritually. Why do you think famine is a good comparison for living without the word of the Lord? In what ways has Amos’s prophecy been fulfilled? If needed, share with students that these verses refer to a period of time known as an apostasy. An apostasy is when individuals or groups of people reject the principles of the gospel and the Lord no longer sends prophets to them. One fulfillment of Amos’s prophecy occurred following the death of Christ’s apostles and is known as the Great Apostasy. The Great Apostasy lasted until the Lord restored His gospel through the prophet Joseph Smith. You may wish to share the video “ Dispensations: The Pattern of Apostasy and Restoration ” (6:52) to illustrate the significance of the Restoration of the gospel. 6:53 Satisfying spiritual hunger In the Lord’s lovingkindness, He made clear to His people through His prophets that He would save His people from the effects of apostasy and bless His people. The Lord prophesied through Amos that He will gather His people again in a future day and He will bless them in many ways (see Amos 9:14–15 ). Read the following verses looking for what else the Lord revealed through His prophets He would do in the final dispensation before His Second Coming: Daniel 2:44–45 Acts 3:19–21 Ephesians 1:3, 10 Doctrine and Covenants 27:13 ; 112:30 ; 128:18 Invite students to share what they learned and ask questions they have about these verses. For additional help, you may want to direct them to “ Restoration of the Gospel ,” in Topics and Questions . What blessings have Heavenly Father and Jesus Christ made available to a spiritually famished world through the Restoration? Students may list priesthood keys and authority, prophets, revelations, scriptures, Church organizations, ordinances, and the gift of the Holy Ghost. Think of how you can help students see how these blessings can meet their needs and those of the people they care about. The following is one way you could do this. Invite students to create a scenario of an individual that hungers for one of the topics listed on the board under Spiritual Hunger . You could have students add details so that the scenario feels more relatable. You could share the following about Marta as an example. Students could then work together, individually, or as small groups to respond to the scenario. Scenario: Marta is 15 years old and wants nothing more than to find purpose for her life. She struggles with self-confidence, and she isn’t sure what direction she should take. What could you share that Heavenly Father and Jesus Christ have done as part of the Restoration of the gospel that could help satisfy Marta’s spiritual hunger? As part of your response, be sure to include scriptures; quotes from Church leaders; and, if possible, your own personal experience. If students struggle to respond, you could have them look through the For the Strength of Youth Guide or some of the doctrinal mastery passages. If students are responding to the scenario with Marta, you could point them to the heading “ Make inspired choices ” section of the For the Strength of Youth Guide or Moses 1:39 : “This is my work and my glory—to bring to pass the immortality and eternal life of man.” Students might ponder how knowing that the Lord cares for them and is actively working toward their return to His presence might fill the spiritual hunger for feeling God’s love or feeling purpose in their life. When students have had sufficient time, invite them to share what they prepared. They can also share what they learned from the experience. Personal reflection To conclude, consider inviting students to respond to the following questions in their journal. What have you learned today that increases your confidence that Heavenly Father and Jesus Christ can satisfy our spiritual hunger? What is one way you would like to act on what you have learned or felt?\n\n\n--- Lesson 151 ---\nThe Lord extended His arms of mercy toward Jonah and the people of Nineveh, despite the great mistakes they made. As we recognize that this same love and mercy is extended toward us, we too can exclaim that the Lord is “a gracious God, and merciful, slow to anger, and of great kindness” ( Jonah 4:2 ). This lesson can help students feel the Lord’s love and mercy for them and for others. Student preparation: Invite students to study the story of Jonah with their family or review it on their own and ponder what they feel is its main message. They could also come up with questions or insights from their study. This invitation is an example of helping students connect what they are learning at home with their study in class. This can help students deepen their learning about the scripture and the Savior. For additional training on connecting what students are learning at home with their experience in the classroom see “ Develop and ask questions that help learners connect what they have learned in their personal and family scripture study to the classroom experience ” in Teacher Development Skills . Possible Learning Activities Our perception Consider beginning class by drawing the following scale on the board with the accompanying words on the sides. As you ask students how others might see Heavenly Father and Jesus Christ, you could place a few different lines in different places on the scale to represent their responses. Imagine this scale represents how someone could see Heavenly Father and Jesus Christ. Why may some people see Them as loving, merciful, and kind while others do not? To help students assess how they perceive Heavenly Father and Jesus Christ, consider inviting them to reflect on the following. Ponder where on the line you would place your view of Heavenly Father and Jesus Christ. Consider why you chose that place on the line. Now imagine this scale represents how you think about or treat others. What are reasons we might treat some people one way and other people in a completely different way? As you study the story of Jonah, seek the Holy Ghost to help you see the true nature of Heavenly Father and Jesus Christ. Consider how what you learn about Them can affect the way you see, think about, or treat others. The story of Jonah It may be helpful to explain that Jonah lived in Israel during the reign of King Jeroboam II (see 2 Kings 13–15 , especially 14:25 ). The prophets Amos and Hosea also prophesied around this time. You may want to display an image that provides an overview of the Old Testament and invite students to find Jonah. Read Jonah 1:1–3 , looking for the Lord’s instructions to Jonah and how Jonah responded. Consider explaining that Ninevah was a major city of the Assyrians. The Assyrian kings and soldiers were known for their brutality, such as torturing and murdering the people they conquered. You could also explain that Tarshish might be in present-day Spain, indicating that Jonah left Israel and traveled in the opposite direction of Ninevah. You may want to display a map for students and have them locate Nineveh and Tarshish. What does Jonah’s response indicate to you about how he felt about the Lord’s instructions to preach to the people of Nineveh? To help students study Jonah’s account, you could invite them to complete the handout “The Story of Jonah” individually, in pairs, or in small groups. Alternatively, you could provide students with only the scripture passages from the handout and invite them to sketch a simple illustration and write summary of each passage. Open PDF After giving students time to complete the exercise, invite them to ask questions they have or share insights they gained from studying this account. If needed, explain that Jonah 4 shows that although Jonah was grateful the Lord was merciful and forgiving toward him, he resented these attributes when the Lord showed them to the people of Nineveh. The Lord taught Jonah that the people of Nineveh were of great value to Him, much more than a gourd. Consider writing the following incomplete truths on the board. Invite students to complete the truths using what they just learned from the story of Jonah. The Lord is … To become like the Lord, we must … Consider completing the statements on the board with words or phrases the students share, such as: The Lord is merciful, kind, and forgiving. To become like the Lord, we must be merciful, kind, and forgiving as He is . You could invite students to share specific examples from Jonah’s account that illustrate these truths. They could also share why they feel the words or phrases they chose are important for them to know. Why can it be difficult for us at times to love or be merciful toward others? How can learning about the Lord’s mercy and love affect the way we see, think about, or treat others? Becoming as the Lord Students may have identified other truths than those listed above. If they did, consider ways to deepen students’ understanding of the truths they identified. The following activities can help students better understand both above truths and feel the love of the Lord for them and others. You could organize students into pairs and have each student complete one of the activities individually. They could then teach each other what they found. Or partners could complete the same activity and share with each other what they learn. Choose one of the following scenarios: Scenario A. Imagine you have a friend who feels Heavenly Father and Jesus Christ are cruel, unmerciful, or unforgiving. Scenario B. Imagine you have a friend who struggles to be merciful, kind, or forgiving toward someone else. Do the following: Find a verse from the story of Jonah that you would share with your friend. (You could also find additional scripture passages that might help.) Think of an experience that may help. For scenario A: consider when the Lord has shown love or mercy toward you or someone you know. For scenario B: consider when the Lord helped you or someone you know show love or mercy toward others. Some examples of additional scriptures that could help include the following: for scenario A: Isaiah 1:18 or Ether 12:27 ; for scenario B: Moroni 7:45–48 or Doctrine and Covenants 64:9–11 . Willing students could then explain to the class which verse or verses they would share with their friend and why. They could also share their experiences. Students’ answers could invite the Holy Ghost to help them feel the Lord’s love for them and for others. If time permits, consider showing a video that demonstrates the Lord’s love and mercy, such as “ Moving On from Past Mistakes ” (3:43), available at ChurchofJesusChrist.org . Invite students to look for how the Lord demonstrated love and mercy toward Rachel after she made a mistake as a teenager. 3:43 What did you learn? To help students see and feel the Lord’s love and mercy for them and for others, consider inviting them to draw something in their study journal that could remind them of the story of Jonah, such as a whale or a large plant. They could then write their answer to one of the questions below, inside, or next to their drawing. Consider answering one of the following questions in your study journal: What did you learn today that helps you feel that Heavenly Father and Jesus Christ are merciful, kind, and forgiving? What did you experience today that helps you feel Their love for those you may struggle to love or forgive?",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Amos;Obadiah;Jonah",
      "content": "Jonah was on a ship headed for Tarshish. There’s nothing wrong with sailing to Tarshish, except that it is far away from Nineveh, where Jonah was supposed to go to deliver God’s message. When the ship encountered a great storm, Jonah knew it was because of his disobedience. At Jonah’s insistence, his fellow mariners cast him into the depths of the sea to stop the storm. It looked like the end of Jonah and his ministry. But the Lord hadn’t given up on Jonah—just as He hadn’t given up on the people of Nineveh, on the house of Israel, or on any of us.\nSo He keeps sending prophets—like Jonah, Amos, Obadiah, and our prophets today—with the message that if we repent, we will not be cast off forever. Of all the “secrets” God reveals (see\nAmos 3:7\n), this one is among the most precious: that because of Jesus Christ, it’s not too late to change. He still wants to help us live up to the covenants we made with Him, and He’s willing to offer us another chance.\nFor more about these books, see “\nAmos\n,” “\nObadiah\n,” and “\nJonah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nAmos 3:1–8\n;\n7:10–15\nThe Lord reveals truth through His prophets.\nIn\nAmos 3:3–6\n, the prophet Amos presented examples of conclusions we can draw from signs we hear or see: when a lion roars, it must have captured prey; if a bird is caught in a trap, there must have been bait there. In\nverses 7–8\n, Amos applied this logic to prophets. What conclusions can we draw when a prophet prophesies? What else do you learn about prophets from\nAmos 7:10–15\n?\nWhat has the Lord revealed to you through His prophets?\nElder Ulisses Soares said that “having prophets is a sign of God’s love” (“\nProphets Speak by the Power of the Holy Spirit\n,”\nEnsign\nor\nLiahona\n, May 2018, 99). Consider how you would complete this sentence: “I know God loves me, because He sends prophets who …” Here are some scriptures that can help:\nDeuteronomy 18:18\n;\nEzekiel 3:16–17\n;\nEphesians 4:11–14\n;\n1 Nephi 22:2\n;\nDoctrine and Covenants 21:4–6\n;\n84:36–38\n;\n107:91–92\n.\nWhat would you say to someone who feels prophets are not needed today?\nSee also Topics and Questions, “\nProphets,\n” Gospel Library.\nAmos 4–5\n“Seek the Lord, and ye shall live.”\nAccording to\nAmos 4:6–13\n, what had the Lord hoped would happen after the Israelites experienced trials? (see also\nHelaman 12:3\n). While your trials may not have been sent by God, how have they given you opportunities to turn to Him?\nAs you read\nAmos 5:4, 14–15\n, ponder how the Lord has been gracious to you. How has seeking Him brought you life?\nAmos 8:11–12\nThe word of the Lord can satisfy spiritual hunger and thirst.\nAs you read\nAmos 8:11–12\n, think about why famine is a good comparison for living without God’s word (see also\nJohn 6:26–35\n;\n2 Nephi 9:50–51\n;\n32:3\n;\nEnos 1:4–8\n). How do you know when you are spiritually hungry?\nThese verses could also apply to the Great Apostasy (see Topics and Questions, “\nApostasy\n,” Gospel Library). How has that spiritual “famine” affected God’s children? How has the Restoration satisfied your spiritual hunger?\nSee also “The Great Apostasy” (video), Gospel Library.\n16:36\nThe Great Apostasy\nObadiah 1:21\nWho are the “saviours … on mount Zion”?\nReferring to\nObadiah 1:21\n, President Gordon B. Hinckley explained that we become saviors on Mount Zion when we receive ordinances for the dead in the temple (see “\nClosing Remarks\n,”\nEnsign\nor\nLiahona\n, Nov. 2004, 105). How is doing that work similar—if only in a small way—to what the Savior did for us? How has doing this work helped you feel closer to the Savior?\nSee also “\nHoly Temples on Mount Zion\n,”\nHymns\n, no. 289.\nJonah 1–4\nThe Lord is merciful to all who turn to Him.\nNineveh was an enemy of Israel known for its violence and cruelty. To Jonah, it seemed unrealistic that they were ready to repent. It might be interesting to compare Jonah’s attitude (see\nJonah 1\n;\n3–4\n) to the feelings of Alma and the sons of Mosiah (see\nMosiah 28:1–5\n;\nAlma 17:23–25\n). What do you learn from\nJonah 3\nthat inspires you to share the gospel even with people who may not seem ready to change?\nAs you read Jonah, look for examples of the Lord’s mercy. Why do you feel Jonah was “displeased” and “very angry” (\nJonah 4:1\n) when the Lord extended mercy to the people of Nineveh? What do you feel the Lord was trying to teach him in\nchapter 4\n? Ponder how you have experienced His mercy in your life. What do you learn from Jonah that can help you be more merciful?\nIdeas for Teaching Children\nBecause this Sunday is the fifth Sunday of the month, Primary teachers are encouraged to use learning activities in “\nAppendix B: Preparing Children for a Lifetime on God’s Covenant Path\n.”\nAmos 3:7\nProphets are messengers of Jesus Christ.\nTo help your children understand\nAmos 3:7\n, you could whisper a simple message to one of them and ask them to share the message with the other children. How is the messenger in this activity like a prophet? Why does the Lord give us prophets?\nTo learn more about what prophets do, you and your children could review\nrecent messages from the current President of the Church\n. You could also sing a song like “\nFollow the Prophet\n” (\nChildren’s Songbook\n, 110–11). Share with each other why you choose to follow God’s prophet.\nHelp children memorize scriptures.\nElder Richard G. Scott shared: “To memorize a scripture is to forge a new friendship. It is like discovering a new individual who can help in time of need, give inspiration and comfort, and be a source of motivation for needed change” (“\nThe Power of Scripture\n,”\nEnsign\n, Nov. 2011, 6). To help your children memorize all or part of\nAmos 3:7\n, you could write it down and repeat it together. Then you could erase or cover a few words at a time until your children can repeat the entire verse from memory.\nAmos 8:11–12\nThe Restoration of the gospel ended the famine of apostasy.\nInvite your children to pretend to be hungry as you read\nAmos 8:11–12\n. What does it feel like when we are hungry for God’s word? Maybe your children could pretend to eat as you share with each other some of your favorite scriptures.\nYou could use Guide to the Scriptures, “\nApostasy\n” (Gospel Library), or “\nAfter the New Testament\n” (in\nNew Testament Stories\n, 167–70) to help your children understand the “famine” that came from the Great Apostasy and how it ended with the Restoration. Share with each other reasons you are grateful that the Lord restored His gospel in our day.\n2:52\nAfter the New Testament\nJonah 1–3\nThe Lord will help me obey Him, even when it’s hard.\nTo help your children learn the story of Jonah, you could review “\nJonah the Prophet\n” in\nOld Testament Stories\n; see also this week’s activity page). You could then ask:\nWhat happened when Jonah didn’t obey the Lord? (see\nJonah 1:4–17\n).\nWhat did Jonah do to repent? (see\nJonah 1:10–12\n;\n2:1–4, 9\n;\n3:1–4\n).\nWhat happened when Jonah did obey? (see\nJonah 3:5\n).\n2:30\nJonah the Prophet\nYour children might enjoy retelling the story of Jonah or acting it out. Share with each other some experiences when the Lord wanted you to do something that was hard for you. How did He help you obey Him?\nJonah 1–4\nThe Lord is merciful to all who turn to Him.\nMaybe your children could pretend they are interviewing Jonah about his experience. What questions would they ask him? Encourage them to ask questions to find out what Jonah learned about the Lord. What might Jonah say, for example, about the Lord’s mercy? (see, for example,\nJonah 2:7–10\n;\n3:10\n;\n4:2\n).\nChrist and the Palsied Man\n, by J. Kirk Richards\nHelp your children think of examples when the Savior showed mercy to others, such as\nMark 2:3–12\n;\nLuke 23:33–34\n; and\nJohn 8:1–11\n. You and your children could search for pictures of these examples. What opportunities do we have to be merciful to others?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 48: Lesson 149: Lesson 149—Amos 3; 7This lesson can help students understand that Heavenly Father and Jesus Christ reveal counsel and truth through Their prophets.; Lesson 150: Lesson 150—Amos 8This lesson can help students increase their confidence that Heavenly Father and Jesus Christ can satisfy their spiritual hunger through the Restoration of the gospel....",
      "content": "\n--- Lesson 149 ---\nIn a world with many persuasive voices, it can be difficult to know which voices to trust. Fortunately, our loving Father in Heaven and Savior, Jesus Christ, reveal Their plans to us through Their living prophets. This lesson can help students understand that Heavenly Father and Jesus Christ reveal counsel and truth through Their prophets. Possible Learning Activities Responses to prophetic counsel The following activity is designed to help students ponder their attitude toward prophets. It may be helpful to write the following three social media responses on the board. As an alternative to the following activity, you could invite students to imagine that the responses were shared by their friends after listening to the prophet speak at general conference or a youth devotional. You could then skip the accompanying question. Imagine seeing the following as responses to a social media post: “He has no business talking about this. He doesn’t understand.” “He’s out of touch with what’s really happening.” “With everything else I need to do, I don’t see how I could possibly apply this counsel to my very busy life.” Who could these responses be referring to? You could display a picture of the living prophet and invite students to imagine that these comments were responses to something the prophet said. Students could share why someone may have one of the above attitudes. Consider displaying the following questions to help students assess their feelings about following prophetic counsel. Take a moment to reflect on your view of the Lord’s prophet on the earth today. You could consider your answers to the following questions: How do I feel about the prophet’s counsel? Do my feelings change depending on what counsel he gives? What reasons might I give for following prophetic counsel? Are there any ways I struggle to follow prophetic counsel? As we study in the book of Amos today, the Holy Ghost can help you learn more about the importance of God’s words given to us through His prophets. You may want to write down insights or questions you have while you study today. The Lord reveals His plans through His prophets By the time of Amos’s prophetic ministry to the northern kingdom of Israel, many of God’s covenant people had forsaken Him and His prophets and followed the wicked ways of neighboring nations (see Amos 2:6–12 ). The Lord chose Amos to call them to repentance. Amos prophesied the destruction and captivity of King Jeroboam II and His people (see Amos 7:8–9; 11, 17 ). Read Amos 7:10–15 , looking for how Amaziah, the priest of King Jeroboam II, responded to Amos’s prophetic counsel. What did you find? Why do you think the people thought they could not “bear all [Amos’s] words” ( Amos 7:10 ) and wanted him to go prophesy somewhere else (see Amos 7:12 )? Why do you think God’s prophets continue to teach even when some people see them as being unpopular, out of touch, or not needed? If students do not mention it, you can ask what Amos did before being called to be prophet (see Amos 7:14 ) and what the Lord did in verse 15 to call Amos to become a prophet. Explain that, like with Joseph Smith and others, the Lord does not require His prophets to hold high status or accomplishments before He calls them to be prophets. If students need help answering this question, you may want to share the statement from President Nelson in “ Additional Resources ” of this lesson in Gospel Library. A few chapters earlier, the Lord revealed a powerful truth about Himself and His prophets through Amos. Amos 3:7 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Amos 3:7–8 , looking for what the Lord will always do through His prophets. It may be helpful for students to know that other terms for secret include counsel or plan . What can we learn from these verses about the Lord? Students may use different words to identify that the Lord reveals His plans through His prophets . You might share, as an example of this truth, that before Judah and Israel were eventually destroyed because of the wickedness of the people, the Lord revealed what would happen if the people did not repent (see Amos 2:4–6 , 8:11–12 ). As the lesson continues, look for ways to emphasize that the Lord loves us and wants to guide us. What can this truth teach you about why it’s important for you to listen to the prophet regardless of how others respond to his words? Following the Lord’s prophets The following activity is one way to help students deepen their understanding that Heavenly Father and Jesus Christ reveal truth through Their prophets. Consider organizing students in small groups and displaying the steps of the activity one at a time. Recall the social media comments at the beginning of the lesson and select one. The following activity can help you prepare to write a response. Reread Amos 3:7 and ponder how it may help the person who made that comment. Also read the following doctrinal mastery passages, looking for how they may help. (Consider linking or cross-referencing these scriptures with Amos 3:7 .) Ezekiel 3:16–17 Doctrine and Covenants 1:37–38 Doctrine and Covenants 21:4–6 Include at least two blessings that can come when you listen to God’s prophet. You can find examples in the scriptures, stories from Church history, or teachings from prophets today. Try to share one example where a prophet’s words made a positive difference in your life. You could share some of the following examples with students, as needed: Through His prophet Noah, the Lord warned the people that if they didn’t repent, they would be destroyed by a flood (see Moses 8:22–30 ; Genesis 7:17–24 ). The prophet Isaiah prophesied about what the Savior would experience through His Atonement (see Isaiah 53:3–5 ). Home-centered and Church-supported church “prepared us … before any hint of a pandemic, enabling us to endure the challenges that have come” (Gary E. Stevenson, “ Highly Favored of the Lord ,” Ensign or Liahona , Nov. 2020, 103). My response Using what you have learned and felt today, write a helpful response to one of the negative comments from the beginning of the lesson. Be sure to include at least one scripture and one example, which could be a personal experience. Invite a few willing students to share their responses. Consider sharing what the Holy Ghost has taught you about God’s love and guidance through His prophets. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Amos 3:7 is “The Lord God … revealeth his secret unto his servants the prophets.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 150 ---\nWe have all felt hunger. Imagine what it might be like to suffer from spiritual hunger. The Lord taught the Israelites through Amos using this imagery. Amos prophesied that his people would no longer be given His word because they had rejected it. Losing the Lord’s word would lead to a spiritual famine. This lesson can help students increase their confidence that Heavenly Father and Jesus Christ can satisfy their spiritual hunger through the Restoration of the gospel. Student preparation: Invite students to ponder how their lives would be different if they didn’t have the scriptures or words of prophets. Students could come to class ready to share what they thought of. Possible Learning Activities Spiritual hunger Consider beginning class by displaying a picture of food or bringing a simple food item and asking the following questions. When is a time you have felt particularly hungry? How might we act when we are hungry? Answers could include feeling irritated, having low energy, or being desperate for any kind of food. Write the phrase Spiritual Hunger on the board. What might people hunger for spiritually and struggle to find? Consider writing student responses on the board. Students might say things like God’s love, purpose in their lives, knowing truth, direction in difficult decisions, etc. Take a moment to write in your study journal ways in which you or someone you know might currently feel spiritual hunger. Encourage students to seek the Holy Ghost today as they consider what they can do to receive the spiritual nourishment Jesus Christ offers. A famine of hearing the words of the Lord The prophet Amos prophesied of spiritual hunger. He revealed the Lord’s words to the people of Israel, but they did not want to hear them (see Amos 2:12 ; 7:11–16 ). If you feel it would be helpful, invite students to read Amos 7:12–13 to understand how the Israelites responded to the Lord’s words through Amos. Read Amos 8:11–12 looking for the consequences of the people rejecting the Lord’s word. If necessary, explain that a famine is an extreme shortage of food. What consequences did you see? If students do not point them out, share truths like the following: When people reject the Lord’s prophets, they lose the blessings of the word of the Lord. Without the word of God, we starve spiritually. Why do you think famine is a good comparison for living without the word of the Lord? In what ways has Amos’s prophecy been fulfilled? If needed, share with students that these verses refer to a period of time known as an apostasy. An apostasy is when individuals or groups of people reject the principles of the gospel and the Lord no longer sends prophets to them. One fulfillment of Amos’s prophecy occurred following the death of Christ’s apostles and is known as the Great Apostasy. The Great Apostasy lasted until the Lord restored His gospel through the prophet Joseph Smith. You may wish to share the video “ Dispensations: The Pattern of Apostasy and Restoration ” (6:52) to illustrate the significance of the Restoration of the gospel. 6:53 Satisfying spiritual hunger In the Lord’s lovingkindness, He made clear to His people through His prophets that He would save His people from the effects of apostasy and bless His people. The Lord prophesied through Amos that He will gather His people again in a future day and He will bless them in many ways (see Amos 9:14–15 ). Read the following verses looking for what else the Lord revealed through His prophets He would do in the final dispensation before His Second Coming: Daniel 2:44–45 Acts 3:19–21 Ephesians 1:3, 10 Doctrine and Covenants 27:13 ; 112:30 ; 128:18 Invite students to share what they learned and ask questions they have about these verses. For additional help, you may want to direct them to “ Restoration of the Gospel ,” in Topics and Questions . What blessings have Heavenly Father and Jesus Christ made available to a spiritually famished world through the Restoration? Students may list priesthood keys and authority, prophets, revelations, scriptures, Church organizations, ordinances, and the gift of the Holy Ghost. Think of how you can help students see how these blessings can meet their needs and those of the people they care about. The following is one way you could do this. Invite students to create a scenario of an individual that hungers for one of the topics listed on the board under Spiritual Hunger . You could have students add details so that the scenario feels more relatable. You could share the following about Marta as an example. Students could then work together, individually, or as small groups to respond to the scenario. Scenario: Marta is 15 years old and wants nothing more than to find purpose for her life. She struggles with self-confidence, and she isn’t sure what direction she should take. What could you share that Heavenly Father and Jesus Christ have done as part of the Restoration of the gospel that could help satisfy Marta’s spiritual hunger? As part of your response, be sure to include scriptures; quotes from Church leaders; and, if possible, your own personal experience. If students struggle to respond, you could have them look through the For the Strength of Youth Guide or some of the doctrinal mastery passages. If students are responding to the scenario with Marta, you could point them to the heading “ Make inspired choices ” section of the For the Strength of Youth Guide or Moses 1:39 : “This is my work and my glory—to bring to pass the immortality and eternal life of man.” Students might ponder how knowing that the Lord cares for them and is actively working toward their return to His presence might fill the spiritual hunger for feeling God’s love or feeling purpose in their life. When students have had sufficient time, invite them to share what they prepared. They can also share what they learned from the experience. Personal reflection To conclude, consider inviting students to respond to the following questions in their journal. What have you learned today that increases your confidence that Heavenly Father and Jesus Christ can satisfy our spiritual hunger? What is one way you would like to act on what you have learned or felt?\n\n\n--- Lesson 151 ---\nThe Lord extended His arms of mercy toward Jonah and the people of Nineveh, despite the great mistakes they made. As we recognize that this same love and mercy is extended toward us, we too can exclaim that the Lord is “a gracious God, and merciful, slow to anger, and of great kindness” ( Jonah 4:2 ). This lesson can help students feel the Lord’s love and mercy for them and for others. Student preparation: Invite students to study the story of Jonah with their family or review it on their own and ponder what they feel is its main message. They could also come up with questions or insights from their study. This invitation is an example of helping students connect what they are learning at home with their study in class. This can help students deepen their learning about the scripture and the Savior. For additional training on connecting what students are learning at home with their experience in the classroom see “ Develop and ask questions that help learners connect what they have learned in their personal and family scripture study to the classroom experience ” in Teacher Development Skills . Possible Learning Activities Our perception Consider beginning class by drawing the following scale on the board with the accompanying words on the sides. As you ask students how others might see Heavenly Father and Jesus Christ, you could place a few different lines in different places on the scale to represent their responses. Imagine this scale represents how someone could see Heavenly Father and Jesus Christ. Why may some people see Them as loving, merciful, and kind while others do not? To help students assess how they perceive Heavenly Father and Jesus Christ, consider inviting them to reflect on the following. Ponder where on the line you would place your view of Heavenly Father and Jesus Christ. Consider why you chose that place on the line. Now imagine this scale represents how you think about or treat others. What are reasons we might treat some people one way and other people in a completely different way? As you study the story of Jonah, seek the Holy Ghost to help you see the true nature of Heavenly Father and Jesus Christ. Consider how what you learn about Them can affect the way you see, think about, or treat others. The story of Jonah It may be helpful to explain that Jonah lived in Israel during the reign of King Jeroboam II (see 2 Kings 13–15 , especially 14:25 ). The prophets Amos and Hosea also prophesied around this time. You may want to display an image that provides an overview of the Old Testament and invite students to find Jonah. Read Jonah 1:1–3 , looking for the Lord’s instructions to Jonah and how Jonah responded. Consider explaining that Ninevah was a major city of the Assyrians. The Assyrian kings and soldiers were known for their brutality, such as torturing and murdering the people they conquered. You could also explain that Tarshish might be in present-day Spain, indicating that Jonah left Israel and traveled in the opposite direction of Ninevah. You may want to display a map for students and have them locate Nineveh and Tarshish. What does Jonah’s response indicate to you about how he felt about the Lord’s instructions to preach to the people of Nineveh? To help students study Jonah’s account, you could invite them to complete the handout “The Story of Jonah” individually, in pairs, or in small groups. Alternatively, you could provide students with only the scripture passages from the handout and invite them to sketch a simple illustration and write summary of each passage. Open PDF After giving students time to complete the exercise, invite them to ask questions they have or share insights they gained from studying this account. If needed, explain that Jonah 4 shows that although Jonah was grateful the Lord was merciful and forgiving toward him, he resented these attributes when the Lord showed them to the people of Nineveh. The Lord taught Jonah that the people of Nineveh were of great value to Him, much more than a gourd. Consider writing the following incomplete truths on the board. Invite students to complete the truths using what they just learned from the story of Jonah. The Lord is … To become like the Lord, we must … Consider completing the statements on the board with words or phrases the students share, such as: The Lord is merciful, kind, and forgiving. To become like the Lord, we must be merciful, kind, and forgiving as He is . You could invite students to share specific examples from Jonah’s account that illustrate these truths. They could also share why they feel the words or phrases they chose are important for them to know. Why can it be difficult for us at times to love or be merciful toward others? How can learning about the Lord’s mercy and love affect the way we see, think about, or treat others? Becoming as the Lord Students may have identified other truths than those listed above. If they did, consider ways to deepen students’ understanding of the truths they identified. The following activities can help students better understand both above truths and feel the love of the Lord for them and others. You could organize students into pairs and have each student complete one of the activities individually. They could then teach each other what they found. Or partners could complete the same activity and share with each other what they learn. Choose one of the following scenarios: Scenario A. Imagine you have a friend who feels Heavenly Father and Jesus Christ are cruel, unmerciful, or unforgiving. Scenario B. Imagine you have a friend who struggles to be merciful, kind, or forgiving toward someone else. Do the following: Find a verse from the story of Jonah that you would share with your friend. (You could also find additional scripture passages that might help.) Think of an experience that may help. For scenario A: consider when the Lord has shown love or mercy toward you or someone you know. For scenario B: consider when the Lord helped you or someone you know show love or mercy toward others. Some examples of additional scriptures that could help include the following: for scenario A: Isaiah 1:18 or Ether 12:27 ; for scenario B: Moroni 7:45–48 or Doctrine and Covenants 64:9–11 . Willing students could then explain to the class which verse or verses they would share with their friend and why. They could also share their experiences. Students’ answers could invite the Holy Ghost to help them feel the Lord’s love for them and for others. If time permits, consider showing a video that demonstrates the Lord’s love and mercy, such as “ Moving On from Past Mistakes ” (3:43), available at ChurchofJesusChrist.org . Invite students to look for how the Lord demonstrated love and mercy toward Rachel after she made a mistake as a teenager. 3:43 What did you learn? To help students see and feel the Lord’s love and mercy for them and for others, consider inviting them to draw something in their study journal that could remind them of the story of Jonah, such as a whale or a large plant. They could then write their answer to one of the questions below, inside, or next to their drawing. Consider answering one of the following questions in your study journal: What did you learn today that helps you feel that Heavenly Father and Jesus Christ are merciful, kind, and forgiving? What did you experience today that helps you feel Their love for those you may struggle to love or forgive?",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 28894,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.402860"
}