{
  "week_number": 35,
  "date_range": "Psalms 49–51",
  "title": ";61–66;69–72;77–78;85–86",
  "primary_scriptures": [
    {
      "book": "Psalms",
      "chapters": [
        "49",
        "50",
        "51"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Psalms",
      "chapters": [
        "49",
        "50",
        "51"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;61–66;69–72;77–78;85–86 ---\nThe writers of the Psalms shared deeply personal feelings in their poetry. They wrote about feeling discouraged, afraid, and remorseful. At times, they even felt abandoned by God, and some psalms carry a tone of frustration or desperation. If you’ve ever felt that way, reading the Psalms can help you know that you aren’t the only one. But you’ll also find psalms that can encourage you when you’re having such feelings, because the psalmists also praised the Lord for His goodness, marveled at His power, and rejoiced in His mercy. They knew that we are burdened by evil and sin but that the Lord is “good, and ready to forgive” (\nPsalm 86:5\n). They understood that having faith in the Lord doesn’t mean that you’ll never struggle with anxiety, sin, or fear. It means that you know who to turn to when you do.\nIdeas for Learning at Home and at Church\nPsalms 49\n;\n62:5–12\nRedemption comes only through Jesus Christ.\nPsalm 49\nhas a message for “both low and high, rich and poor” (\nverse 2\n). What would you say this message is? What do you feel\nPsalm 62:5–12\nadds to that message?\nReading these psalms might inspire you to ponder the ways we are tempted to trust something other than God for redemption (see\nPsalm 49:6–7\n). How is your life influenced by your testimony that “God will redeem [your] soul from the power of the grave”? (\nPsalm 49:15\n).\nPsalms 51\n;\n85–86\nBecause of the Savior’s mercy, I can be forgiven.\nKing David wrote\nPsalm 51\nafter he recognized his desperate need for forgiveness—something we all need. Which verses describe feelings you’ve had? What do you find in this psalm that gives you hope for forgiveness?\nYou might also search\nPsalm 51\nfor clues about what it means to repent. Make a list of what you find. See if you can add to your list by searching President Russell M. Nelson’s message “\nWe Can Do Better and Be Better\n” (\nEnsign\nor\nLiahona\n, May 2019, 67–69).\nHow would you describe what it feels like to receive forgiveness through Christ? If you need help describing your feelings, you could look in\nPsalms 51:1–2, 7–12\n;\n85:2–9\n. Some people like to draw or find pictures to express their feelings; you might try that. You could also sing or listen to a hymn about the Savior, such as “\nI Stand All Amazed\n” (\nHymns\n, no. 193).\nTo repent, we need faith not only that Jesus Christ\ncan\ncleanse us but also that He\nwill\n. What do you find in\nPsalm 86:5, 13, 15\nthat helps you know the Savior is both able and willing to forgive?\nSee also\nAlma 36\n; Peter F. Meurs, “\nHe Could Heal\nMe\n!,”\nLiahona\n, May 2023, 39–41.\nPsalms 51:13–15\n;\n66:5–20\n;\n71:15–24\nMy testimony of Jesus Christ can help others come unto Him.\nPonder how you gained your testimony of Jesus Christ and His atoning power. Then, as you study\nPsalms 51:13–15\n;\n66:5–20\n;\n71:15–24\n, think about how you can invite others to “come and see the works of God” (\nPsalm 66:5\n). If you were to “declare what [the Lord] hath done for [your] soul” (\nPsalm 66:16\n), what would you declare?\nWhat does it mean to you to “talk of [His] righteousness all the day long”? (\nPsalm 71:24\n).\nSee also\nAlma 26\n.\n“Come and hear, … and I will declare what [God] hath done for my soul” (\nPsalm 66:16\n).\nPsalms 63\n;\n69\n;\n77–78\nThe Lord will help me in my time of need.\nSeveral psalms describe what it’s like to feel distant from God and desperately need His help (see\nPsalms 63:1, 8\n;\n69:1–8, 18–21\n;\n77:1–9\n). In\nPsalms 63\n;\n69\n;\n77–78\n, what do you find that gave the psalmists reassurance?\nWhen you are distressed, how does it help you to “remember the works of the Lord” and His “wonders of old”? (\nPsalm 77:11\n). Some of those wonders are described in\nPsalm 78\n. As you read about them, ponder what helps you “set [your] hope in God” (\nverse 7\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nBecause this Sunday is the fifth Sunday of the month, Primary teachers are encouraged to use learning activities in “Appendix B: Preparing Children for a Lifetime on God’s Covenant Path.”\nPsalms 51\n;\n86:5, 13, 15\nWhen I make a wrong choice, Jesus can help me change.\nTo help your children discover truths about repentance in\nPsalm 51\n, you could draw a large heart. Then you could help your children write inside the heart bad things Satan tempts us to do. How do we get these things out of our hearts? Ask your children to find the word “heart” in\nPsalm 51:10, 17\n. Talk about what these verses teach about repentance. Let your children erase the words inside the heart and write new words that describe the ways Jesus can change us when we repent.\nYou might want to help your children learn what it means to have “a broken and a contrite heart” (\nPsalm 51:17\n). They could take turns breaking open something that has a hard shell, such as an egg or a nut. You could help them compare the shell to things that keep us from feeling Heavenly Father’s love. How can we open our heart to Him?\nYou could also look at a picture of the Savior together and ask your children what words they would use to describe Him. Invite them to find words that describe Him in\nPsalm 86:5, 13, 15\n. Why is it important to know these things about Him?\nPsalm 61:2–3\nJesus Christ is my rock.\nYour children might enjoy drawing pictures of the symbols in\nPsalm 61:2–3\n. How is Jesus Christ like a high “rock” (\nverse 2\n), “a shelter,” and “a strong tower”? (\nverse 3\n).\n“Thou hast been a shelter for me, and a strong tower” (\nPsalm 61:3\n).\nPsalms 66:16\n;\n77:11\n;\n78:6–7\n“I will remember the works of the Lord.”\nAsk your children to share some of their favorite scripture stories (pictures from the\nGospel Art Book\nmight help). What do these stories teach us about the Lord? You could read together\nPsalm 66:16\nand take turns answering the question “What has the Lord done for my soul”?\nAs you read\nPsalms 77:11\n;\n78:6–7\ntogether, you could share with each other how you try to “remember the works of the Lord” (\nPsalm 77:11\n), including His works in your life. How does the sacrament help us “always remember”? (\nMoroni 4:3\n;\n5:2\n).\nPsalm 71:8\nI can tell others about Jesus Christ.\nAfter reading\nPsalm 71:8\nwith your children, invite them to draw a large mouth. Ask them to help you “fill” the mouth with pictures or words representing things we can tell others about Jesus Christ.\nYou could pass around a picture of Jesus Christ. The person holding the picture could say one thing they know about Him. How can we help other people know these things?\nChildren have much to share.\n“When children learn something new, they naturally want to share it with others. Encourage this desire by giving children opportunities to teach gospel principles to each other, their family members, and their friends. Also ask them to share with you their thoughts, feelings, and experiences related to the principles you are teaching. You will find that they have insights that are simple, pure, and powerful” (\nTeaching in the Savior’s Way\n,\n32\n).\nPsalm 86:7\nHeavenly Father hears and answers my prayers.\nMany of the psalms are like prayers to God. As you read Psalms with your children, you might show them things we can use to communicate with people who are far away, such as a phone or a letter. Then read\nPsalm 86:7\n. How do we “call upon” Heavenly Father? How does He answer us?\nYou could sing together a song about prayer, such as “\nA Child’s Prayer\n” (\nChildren’s Songbook\n, 12–13; see also Susan H. Porter, “\nPray, He Is There\n,”\nLiahona\n, May 2024, 77–79). Tell each other about times when God answered your prayers.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 35: Lesson 105: Lesson 105—Psalms 61–86This lesson can help students communicate more meaningfully with Heavenly Father through prayer.; Lesson 107: Lesson 107—Psalm 119This lesson can help students make a plan to study the word of God.... ---\n\n--- Lesson 105 ---\nYou can probably think of moments in your life when you desired to draw near to Heavenly Father. Many of the Psalms are heartfelt prayers that provide an example of approaching Heavenly Father in humble faith. Prayer is a powerful tool that allows anyone at any time to call upon God for comfort, strength, or guidance. As with many tools, we can learn to use prayer more effectively. This lesson will help students communicate more meaningfully with Heavenly Father through prayer. Student preparation: Consider inviting students to pay attention between now and the next class to how they feel they are connecting with Heavenly Father in their prayers. Possible Learning Activities Careful versus casual Before class, write “ careful ” and “ casual ” on the board. Make sure students understand the following definitions of these words. Careful : done with thought or attention. Casual : relaxed or unconcerned. Consider organizing students into pairs or small groups to share what they think it would look like to be careful or casual in the following activities. Alternatively, you could invite partnerships or groups to come up with things they are careful about and things they are casual about. Playing a sport Learning an instrument School work After students have had a chance to share, write “ prayer ” on the board. What might it look like to be careful or casual in prayer? Invite students to think about how they currently approach their own prayers. The following is one way to do this. Assure students that they will not share their answers with anyone else. Silently consider your responses to the following questions: Would you consider your prayers to be more careful or casual? Why? How might you be blessed if your prayers were more careful and meaningful? The previous questions can help students think about their current life circumstances. When learners see how what they are learning relates to their life circumstances, they are more likely to apply the Savior’s teachings in their lives. You can help students find personal relevance by providing prompts that help students think about their current life circumstances. (For additional training on creating relevant learning experiences, see “ Help learners find personal relevance in the doctrine of Jesus Christ ” in Teacher Development Skills [2022].) You might invite students to ask questions they may have about prayer. Many of the psalms are heartfelt prayers that provide an example of approaching Heavenly Father in humble faith. As you study these psalms, be sensitive to thoughts and feelings from the Holy Ghost about how to communicate more meaningfully with Heavenly Father through prayer. The psalms can teach us about prayer To help students understand ways they can communicate more meaningfully with Heavenly Father in prayer, consider displaying the following scripture passages and questions on the board. Students could read a passage, then think about how it answers one or more of the questions. It could be helpful to quietly play instrumental music as students study. Read at least three of the following scripture passages, looking for answers to one or more of the questions that follow. Psalm 55:16–17 Psalm 61:1–3 Psalm 63:1–7 Psalm 69:13–18 Psalm 86:3–12 When should I pray to Heavenly Father? How can I be more careful in my prayers? What should my attitude be like when approaching Heavenly Father in prayer? Invite students to share what they discovered. As part of the discussion, write the following incomplete statement on the board: Our prayers to Heavenly Father can become more meaningful as we … Ask students to complete the statement with what they learned about prayer from the psalms they read. Some examples of what students might say include: pray at any time of the day (see Psalm 55:16–17 ). pray when we feel overwhelmed (see Psalm 61:2 ). pray for deliverance (see Psalm 69:13–18 ). pray for mercy (see Psalm 86:3–5 ). pray with an attitude of love, reverence, and praise (see Psalm 63:4–6 ; 86:8–13 ). Praying with love and reverence for Heavenly Father This portion of the lesson focuses on this truth: Our prayers to Heavenly Father can become more meaningful as we pray with an attitude of love, reverence, and praise. One way we can pray to Heavenly Father with an attitude of greater love and reverence is through the tone and language of our prayer. President Dallin H. Oaks of the First Presidency taught: The special language of prayer follows different forms in different languages, but the principle is always the same. We should address prayers to our Heavenly Father in words which speakers of that language associate with love and respect and reverence and closeness. … … We wish to follow the Savior’s teaching, “When ye pray, use not vain repetitions, as the heathen do: for they think that they shall be heard for their much speaking.” [ Matthew 6:7 ; see also 3 Nephi 13:7 .] Our prayers should be simple, direct, and sincere. (“ The Language of Prayer ,” Ensign , May 1993, 16) You might explain that we can show love, respect, and reverence to Heavenly Father by addressing Him using the words thee, thou, thy, and thine. See “ The Language of Prayer ,” Ensign , May 1993, for more information. Think about the language you use in your prayers and how it reflects your feelings for Heavenly Father. Why might it be worth the effort to use respectful and reverent language in your prayers? Read Matthew 6:5–13 looking for how Jesus Christ exemplified love and reverence to Heavenly Father in prayer. What do you learn from the Savior’s teachings and example that can influence the way you pray? How has sincere prayer blessed your life? Application The following diagram can help students think about ways to apply what they learned about prayer. Invite students to draw the diagram in their journals. Then invite them to write answers to the questions in the graphic in each section. Help students to recognize that what they wrote are things they can start applying today. Invite them to act on one or two of the things they wrote. If students are able, you might invite them to take a picture of their graphic to remember what they wrote down. Consider sharing your testimony of how we can communicate with Heavenly Father in meaningful ways through prayer.\n\n\n--- Lesson 107 ---\nDo you feel that your scripture study leads to guidance from the Lord? Psalm 119 expresses gratitude for the word of God and testifies of its power. This lesson can help students make a plan to study the word of God. Student preparation: Invite students to personally study the scriptures before next class. Ask them to ponder if they feel the Lord’s guidance through their scripture study. If so, can they think of any examples? Possible Learning Activities Guidance and the scriptures To prepare students to study about the scriptures, invite them to ponder how different people have different attitudes toward the scriptures. Ask students to consider how these different people might finish the following statement. You could also use this activity as student preparation. You could share the statement before class and invite students to bring an object that would help finish it. Scriptures are like because . If students need an example, you could say, “Scriptures are like a map or a GPS because they guide me.” Invite students to share their thoughts. You might ask why some people love studying the scriptures but others do not. Consider inviting students to ponder how they could complete the statement to reflect their attitude toward the scriptures. At the end of the lesson, you will evaluate your scripture study goal or make a new one. Consider saying a silent prayer for Heavenly Father to guide you today as you study Psalm 119 . Seek inspiration to make the goal that would best help you. The word of God is like … The writer of Psalm 119 used symbols to describe the word of God. These symbols emphasized the psalmist’s love for God’s word and the blessings that come through diligently studying and obeying His words. For example, read Psalm 119:105–106 , looking for what the psalmist compared to the word of God. Consider dimming or turning off the lights in the room and turning on a lamp or flashlight. Allow students to share what they found. How is the word of God like a light or lamp? If students share something such as the following principle, write it on the board: As we study the word of God, He blesses us with guidance. If students need more help identifying the principle, consider asking, “How is walking in the light different from walking in the dark?” or “How can scriptures help us walk in the light?” Or you could write the principle and ask, “How do these verses illustrate the principle on the board?” Turn the lights in the room back on. Consider inviting students to cross-reference or link Psalm 119:105 to 2 Nephi 32:3 . Ask students to note how these verses are similar. Or watch “ How I #HearHim: Elder David A. Bednar ” (1:15), Gospel Library. 1:16 Read or display the following questions, and invite a few students to each select one and answer it: Why do you think God wants to guide us? How could knowing that God can guide us through the scriptures motivate someone to study them? When has the word of God been like a lamp or light to you or someone you know? As students share their answers, you could ask how these ideas and experiences have affected their relationship with God. Other symbols The psalmist made other comparisons. ( Note: the psalmist referred to the word of God by various terms such as testimonies, statutes, law, precepts, commandments, and ways.) To help students study Psalm 119 , write the following references on the board: Psalm 119:14–16, 72, 127 Psalm 119:22–24 Psalm 119:33–35 Psalm 119:50–52, 54 Psalm 119:102–104 Divide the class into five groups and assign each group one of the references on the board. Display the following objects or pictures of these objects: a hymnbook, coins (or something representing riches), honey (or something sweet), a picture of a path, and a picture of a counselor (for example, a counselor in the First Presidency of the Church or a school counselor). Display the following instructions: Read your assigned scripture passage, looking for what the psalmist compared to the word of God. Take the object or picture that corresponds to your assigned scripture passage. Discuss how the object or picture could help someone understand the importance of the word of God. Share examples or experiences from your life, the lives of others, or the scriptures that illustrate how the object or picture is like the word of God. Invite students to finish the following principle according to what they studied: As we study the word of God, He blesses us with … Some possible answers are joy (see verses 14, 16, 35, 103 ), comfort (see verses 50, 52 ), counsel (see verse 24 ), and understanding (see verse 104 ). How could the principle you found help someone want to study the word of God? How has God blessed you or people you know with joy, comfort, counsel, or understanding as you or they studied His word? As students share their answers to the previous question, you could ask how these experiences have affected their relationship with God. Your goal Invite the Spirit as you reflect on your scripture study. If you already have a scripture study goal, record in your study journal what has gone well and what you might want to continue. You might include why you chose this goal and how it helps you feel closer to the Lord. Prayerfully ask Heavenly Father if He would want you to make any adjustments to your goal. If you do not have a current scripture study goal, seek the guidance of the Holy Ghost as you make one. You might include the following: The amount of time you will study How often you will study (if possible, strive to study daily) What you will do to seek the Lord’s help with your study (for example, pray before you study or seek revelation about what you study) How you can remember, meditate on, or apply what you learn (for example, keep a journal of what you are learning from your scripture study, keep a record of what you are trying to apply, or discuss with someone else what you are learning once a week) Invite volunteers to share their scripture study goal as well as any concerns they might have. If students share concerns, invite the class to share scriptures, statements from Church leaders, or personal experiences that might help. Tell students that in “ Assess Your Learning 7 ,” they will have the opportunity to report on their goals. They will share how their scripture study is going and what blessings they feel the Lord is giving them because of it. If there is still time in class, invite students to quietly study the scriptures. Invite them to look for truths that God gives us that can guide them in their lives today. Invite a few students to share what they found. Share your testimony of the principles in this lesson.\n\n\n--- Lesson 108 ---\nLike many hymns, the Psalms remind us to give thanks in all things. Expressing sincere gratitude to Heavenly Father and Jesus Christ can open our eyes and hearts to Their love and mercy and allows our love for Them to grow. This lesson can help students feel Heavenly Father and Jesus Christ’s love as they express gratitude for Them. Student preparation: Invite students to offer a prayer thanking Heavenly Father without asking for anything in return. Students could prepare to share their impressions from the experience with the class. Possible Learning Activities How can I feel God’s love? Begin class by helping students ponder how they can feel God’s love. One way to do this is to invite students to imagine the following scenario. One day a friend says to you: “Sometimes in church and seminary, people talk about feeling God’s love. I’m not sure I feel it. What can I do to feel His love in my life?” How might you respond to your friend? Students might have various answers, or they might not know what to say. After students respond, you could share the following statement. President Thomas S. Monson (1927–2018) explained something we can do to feel God’s love: My brothers and sisters, do we remember to give thanks for the blessings we receive? Sincerely giving thanks not only helps us recognize our blessings, but it also unlocks the doors of heaven and helps us feel God’s love. (“ The Divine Gift of Gratitude ,” Ensign or Liahona , Nov. 2010, 87) How would you summarize what President Monson taught? As students share their answers, write the following truth on the board: Expressing gratitude for our blessings helps us feel God’s love. Read Psalm 136:1–3, 26 , looking for why the psalmist expresses gratitude for God. What do you notice? You might want to invite students to mark the phrase “for his mercy endureth for ever.” You could point out that every time the psalmist expresses gratitude, he recognizes God’s love. You might explain that in Hebrew the word for mercy in these verses is hesed , which is “a special kind of love and mercy that God feels for and extends to those who have made a covenant with Him” (Russell M. Nelson, “ The Everlasting Covenant ,” Liahona , Oct. 2022, 6). Why do you think expressing gratitude for our blessings helps us feel God’s love? Recognizing God’s blessings To help students assess how they are doing at expressing gratitude to the Lord, you could do the following activity. Remind students that the Holy Ghost can help us remember so that we can learn and improve. Invite students to listen for impressions from the Holy Ghost as they consider their answers. Think about your experiences over the last week. In your study journal, answer the following questions with the phrases never , once or twice , a few times , or many times . How often did you recognize a specific blessing from the Lord in your life? How often did you express gratitude to the Lord for your blessings? How often did you feel His love? As students consider their answers, they might think about any blessings the Lord has given them that they are not recognizing or expressing gratitude for. To help students recognize their blessings, use the handout “ Psalm 136: Gratitude to the Lord .” Students could work on the handout alone, or you could have students fill out the first box of the handout, then pass it to another classmate to complete the next box. Students continue passing until each box is filled out. The handout could then be returned to the original student to see what their classmates wrote. Allow students enough time to give thoughtful answers to each section. Open PDF After the activity, you might discuss what students learned or felt about expressing gratitude to God. As part of the discussion, you might want to emphasize how feeling and expressing gratitude can help us feel love for and from Heavenly Father and Jesus Christ. After students have had sufficient time to discuss, you could share the following video, available at ChurchofJesusChrist.org : “ Principles of Peace: Gratitude ” (2:32) 2:33 Expressing gratitude to God To help students practice expressing gratitude to God, you could invite them to do one of the following activities. Choose one of the following options to express your gratitude for Heavenly Father and Jesus Christ. Pay attention to the love you might feel from Them as you do this. Express your gratitude for Heavenly Father and Jesus Christ in a social media post or by writing in your journal. Make a list of things that you are grateful for. Remember to include those things in your next prayer. To conclude, you might share how expressing gratitude to Heavenly Father and Jesus Christ helps us feel Their love and allows our love for Them to grow.\n\n--- SCRIPTURE: Psalms 49 ---\n1. Hear this, allyepeople; giveear, allyeinhabitants of the world:\n2. Both low and high, rich and poor, together.\n3. My mouth shall speak of wisdom; and the meditation of my heartshall beof understanding.\n4. I will incline mine ear to parable: I willopenmy dark saying upon the harp.\n5. Wherefore should I fear in the days of evil,whenthe iniquity of myheelsshall compass me about?\n6. They that trust in theirwealth, and boast themselves in the multitude of their riches;\n7. Noneof themcan by any means redeem his brother, nor give to God ransom for him:\n8. (For the redemption of theirsoulisprecious, and it ceaseth for ever:)\n9. That he should stilllivefor ever,andnot see corruption.\n10. For he seeththatwise mendie, likewise the fool and the brutish person perish, and leave their wealth to others.\n11. Their inward thoughtis, thattheir housesshall continuefor ever,andtheir dwelling places to all generations; they calltheirlands after their ownnames.\n12. Nevertheless manbeingin honour abideth not: he is like the beaststhatperish.\n13. This their wayistheir folly: yet their posterity approve their sayings.Selah.\n14. Like sheep they are laid in the grave; death shall feed on them; and the upright shall havedominionover them in the morning; and their beauty shall consume in the grave from their dwelling.\n15. But God willredeemmy soul from the power of the grave: for he shallreceiveme.Selah.\n16. Be not thou afraid when one is made rich, when the glory of his house is increased;\n17. For when he dieth he shall carry nothing away: his glory shall not descend after him.\n18. Though while he lived heblessedhis soul: andmenwill praise thee, when thou doest well to thyself.\n19. He shall go to the generation of his fathers; they shall never see light.\n20. Manthat isin honour, and understandeth not, is like the beaststhatperish.\n\n--- SCRIPTURE: Psalms 50 ---\n1. The mighty God,eventheLord, hath spoken, and called the earth from the rising of the sun unto the going down thereof.\n2. Out of Zion, theperfectionofbeauty, God hathshined.\n3. Our God shall come, and shall not keep silence: afireshall devour before him, and it shall be very tempestuous round about him.\n4. He shall call to theheavensfrom above, and to the earth, that he mayjudgehis people.\n5. Gather mysaintstogether untome; those that have made acovenantwith me bysacrifice.\n6. And the heavens shalldeclarehisrighteousness: for Godisjudgehimself.Selah.\n7. Hear, O my people, and I will speak; O Israel, and I will testify against thee: IamGod,eventhy God.\n8. I will not reprove thee for thy sacrifices or thy burnt offerings,to have beencontinually before me.\n9. I will take no bullock out of thy house,norhe goats out of thy folds.\n10. For every beast of the forestismine,andthe cattle upon thousand hills.\n11. I know all the fowls of the mountains: and the wild beasts of the fieldaremine.\n12. If I were hungry, I would not tell thee: for theworldismine, and the fulness thereof.\n13. Will I eat the flesh of bulls, or drink the blood of goats?\n14. Offer unto Godthanksgiving; and pay thyvowsunto the most High:\n15. Andcallupon me in the day oftrouble: I will deliver thee, and thou shalt glorify me.\n16. But unto the wicked God saith,Whathast thou to do to declare my statutes, orthatthou shouldest take my covenant in thy mouth?\n17. Seeing thou hatest instruction, and castest my words behind thee.\n18. When thou sawest thief, then thou consentedst with him, and hast been partaker with adulterers.\n19. Thou givest thy mouth to evil, and thy tongue framethdeceit.\n20. Thou sittestandspeakest against thy brother; thouslanderestthine own mothers son.\n21. Thesethingshast thou done, and I kept silence; thou thoughtest that I was altogethersuch an oneas thyself:butI will reprove thee,andsetthemin order before thine eyes.\n22. Now consider this, ye thatforgetGod, lest I tearyouin pieces, andthere benone to deliver.\n23. Whoso offerethpraiseglorifieth me: and to him that orderethhisconversationarightwill I shew the salvation of God.\n\n--- SCRIPTURE: Psalms 51 ---\n1. Havemercyupon me, O God, according to thylovingkindness: according unto the multitude of thy tender merciesblot outmytransgressions.\n2. Wash me throughly from mine iniquity, andcleanseme from my sin.\n3. For Iacknowledgemy transgressions: and mysinisever before me.\n4. Against thee, thee only, have Isinned, and donethisevil in thy sight: that thou mightest bejustifiedwhen thou speakest,andbe clear when thou judgest.\n5. Behold, I was shapen in iniquity; and in sin did my motherconceiveme.\n6. Behold, thou desirest truth in the inward parts: and in the hiddenpartthou shalt make me to know wisdom.\n7. Purge me withhyssop, and I shall be clean: wash me, and I shall be whiter than snow.\n8. Make me to hear joy and gladness;thatthe boneswhichthou hast broken may rejoice.\n9. Hide thy face from my sins, and blot out all mine iniquities.\n10. Create in me acleanheart, O God; andrenewa right spirit within me.\n11. Cast me not away from thypresence; and take not thyholy spiritfrom me.\n12. Restore unto me the joy of thy salvation; and uphold mewith thyfree spirit.\n13. Thenwill I teach transgressors thy ways; and sinners shall beconvertedunto thee.\n14. Deliverme from bloodguiltiness, O God, thou God of my salvation:andmy tongue shall sing aloud of thy righteousness.\n15. O Lord, open thou my lips; and my mouth shall shew forth thy praise.\n16. For thou desirest notsacrifice; else would I giveit:thou delightest not in burnt offering.\n17. Thesacrificesof Godarea broken spirit: broken and acontrite heart, O God, thou wilt not despise.\n18. Do good in thy goodpleasureunto Zion: build thou the walls of Jerusalem.\n19. Then shalt thou be pleased with the sacrifices of righteousness, with burnt offering and whole burnt offering: then shall they offer bullocks upon thine altar.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";61–66;69–72;77–78;85–86",
      "content": "The writers of the Psalms shared deeply personal feelings in their poetry. They wrote about feeling discouraged, afraid, and remorseful. At times, they even felt abandoned by God, and some psalms carry a tone of frustration or desperation. If you’ve ever felt that way, reading the Psalms can help you know that you aren’t the only one. But you’ll also find psalms that can encourage you when you’re having such feelings, because the psalmists also praised the Lord for His goodness, marveled at His power, and rejoiced in His mercy. They knew that we are burdened by evil and sin but that the Lord is “good, and ready to forgive” (\nPsalm 86:5\n). They understood that having faith in the Lord doesn’t mean that you’ll never struggle with anxiety, sin, or fear. It means that you know who to turn to when you do.\nIdeas for Learning at Home and at Church\nPsalms 49\n;\n62:5–12\nRedemption comes only through Jesus Christ.\nPsalm 49\nhas a message for “both low and high, rich and poor” (\nverse 2\n). What would you say this message is? What do you feel\nPsalm 62:5–12\nadds to that message?\nReading these psalms might inspire you to ponder the ways we are tempted to trust something other than God for redemption (see\nPsalm 49:6–7\n). How is your life influenced by your testimony that “God will redeem [your] soul from the power of the grave”? (\nPsalm 49:15\n).\nPsalms 51\n;\n85–86\nBecause of the Savior’s mercy, I can be forgiven.\nKing David wrote\nPsalm 51\nafter he recognized his desperate need for forgiveness—something we all need. Which verses describe feelings you’ve had? What do you find in this psalm that gives you hope for forgiveness?\nYou might also search\nPsalm 51\nfor clues about what it means to repent. Make a list of what you find. See if you can add to your list by searching President Russell M. Nelson’s message “\nWe Can Do Better and Be Better\n” (\nEnsign\nor\nLiahona\n, May 2019, 67–69).\nHow would you describe what it feels like to receive forgiveness through Christ? If you need help describing your feelings, you could look in\nPsalms 51:1–2, 7–12\n;\n85:2–9\n. Some people like to draw or find pictures to express their feelings; you might try that. You could also sing or listen to a hymn about the Savior, such as “\nI Stand All Amazed\n” (\nHymns\n, no. 193).\nTo repent, we need faith not only that Jesus Christ\ncan\ncleanse us but also that He\nwill\n. What do you find in\nPsalm 86:5, 13, 15\nthat helps you know the Savior is both able and willing to forgive?\nSee also\nAlma 36\n; Peter F. Meurs, “\nHe Could Heal\nMe\n!,”\nLiahona\n, May 2023, 39–41.\nPsalms 51:13–15\n;\n66:5–20\n;\n71:15–24\nMy testimony of Jesus Christ can help others come unto Him.\nPonder how you gained your testimony of Jesus Christ and His atoning power. Then, as you study\nPsalms 51:13–15\n;\n66:5–20\n;\n71:15–24\n, think about how you can invite others to “come and see the works of God” (\nPsalm 66:5\n). If you were to “declare what [the Lord] hath done for [your] soul” (\nPsalm 66:16\n), what would you declare?\nWhat does it mean to you to “talk of [His] righteousness all the day long”? (\nPsalm 71:24\n).\nSee also\nAlma 26\n.\n“Come and hear, … and I will declare what [God] hath done for my soul” (\nPsalm 66:16\n).\nPsalms 63\n;\n69\n;\n77–78\nThe Lord will help me in my time of need.\nSeveral psalms describe what it’s like to feel distant from God and desperately need His help (see\nPsalms 63:1, 8\n;\n69:1–8, 18–21\n;\n77:1–9\n). In\nPsalms 63\n;\n69\n;\n77–78\n, what do you find that gave the psalmists reassurance?\nWhen you are distressed, how does it help you to “remember the works of the Lord” and His “wonders of old”? (\nPsalm 77:11\n). Some of those wonders are described in\nPsalm 78\n. As you read about them, ponder what helps you “set [your] hope in God” (\nverse 7\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nBecause this Sunday is the fifth Sunday of the month, Primary teachers are encouraged to use learning activities in “Appendix B: Preparing Children for a Lifetime on God’s Covenant Path.”\nPsalms 51\n;\n86:5, 13, 15\nWhen I make a wrong choice, Jesus can help me change.\nTo help your children discover truths about repentance in\nPsalm 51\n, you could draw a large heart. Then you could help your children write inside the heart bad things Satan tempts us to do. How do we get these things out of our hearts? Ask your children to find the word “heart” in\nPsalm 51:10, 17\n. Talk about what these verses teach about repentance. Let your children erase the words inside the heart and write new words that describe the ways Jesus can change us when we repent.\nYou might want to help your children learn what it means to have “a broken and a contrite heart” (\nPsalm 51:17\n). They could take turns breaking open something that has a hard shell, such as an egg or a nut. You could help them compare the shell to things that keep us from feeling Heavenly Father’s love. How can we open our heart to Him?\nYou could also look at a picture of the Savior together and ask your children what words they would use to describe Him. Invite them to find words that describe Him in\nPsalm 86:5, 13, 15\n. Why is it important to know these things about Him?\nPsalm 61:2–3\nJesus Christ is my rock.\nYour children might enjoy drawing pictures of the symbols in\nPsalm 61:2–3\n. How is Jesus Christ like a high “rock” (\nverse 2\n), “a shelter,” and “a strong tower”? (\nverse 3\n).\n“Thou hast been a shelter for me, and a strong tower” (\nPsalm 61:3\n).\nPsalms 66:16\n;\n77:11\n;\n78:6–7\n“I will remember the works of the Lord.”\nAsk your children to share some of their favorite scripture stories (pictures from the\nGospel Art Book\nmight help). What do these stories teach us about the Lord? You could read together\nPsalm 66:16\nand take turns answering the question “What has the Lord done for my soul”?\nAs you read\nPsalms 77:11\n;\n78:6–7\ntogether, you could share with each other how you try to “remember the works of the Lord” (\nPsalm 77:11\n), including His works in your life. How does the sacrament help us “always remember”? (\nMoroni 4:3\n;\n5:2\n).\nPsalm 71:8\nI can tell others about Jesus Christ.\nAfter reading\nPsalm 71:8\nwith your children, invite them to draw a large mouth. Ask them to help you “fill” the mouth with pictures or words representing things we can tell others about Jesus Christ.\nYou could pass around a picture of Jesus Christ. The person holding the picture could say one thing they know about Him. How can we help other people know these things?\nChildren have much to share.\n“When children learn something new, they naturally want to share it with others. Encourage this desire by giving children opportunities to teach gospel principles to each other, their family members, and their friends. Also ask them to share with you their thoughts, feelings, and experiences related to the principles you are teaching. You will find that they have insights that are simple, pure, and powerful” (\nTeaching in the Savior’s Way\n,\n32\n).\nPsalm 86:7\nHeavenly Father hears and answers my prayers.\nMany of the psalms are like prayers to God. As you read Psalms with your children, you might show them things we can use to communicate with people who are far away, such as a phone or a letter. Then read\nPsalm 86:7\n. How do we “call upon” Heavenly Father? How does He answer us?\nYou could sing together a song about prayer, such as “\nA Child’s Prayer\n” (\nChildren’s Songbook\n, 12–13; see also Susan H. Porter, “\nPray, He Is There\n,”\nLiahona\n, May 2024, 77–79). Tell each other about times when God answered your prayers.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 35: Lesson 105: Lesson 105—Psalms 61–86This lesson can help students communicate more meaningfully with Heavenly Father through prayer.; Lesson 107: Lesson 107—Psalm 119This lesson can help students make a plan to study the word of God....",
      "content": "\n--- Lesson 105 ---\nYou can probably think of moments in your life when you desired to draw near to Heavenly Father. Many of the Psalms are heartfelt prayers that provide an example of approaching Heavenly Father in humble faith. Prayer is a powerful tool that allows anyone at any time to call upon God for comfort, strength, or guidance. As with many tools, we can learn to use prayer more effectively. This lesson will help students communicate more meaningfully with Heavenly Father through prayer. Student preparation: Consider inviting students to pay attention between now and the next class to how they feel they are connecting with Heavenly Father in their prayers. Possible Learning Activities Careful versus casual Before class, write “ careful ” and “ casual ” on the board. Make sure students understand the following definitions of these words. Careful : done with thought or attention. Casual : relaxed or unconcerned. Consider organizing students into pairs or small groups to share what they think it would look like to be careful or casual in the following activities. Alternatively, you could invite partnerships or groups to come up with things they are careful about and things they are casual about. Playing a sport Learning an instrument School work After students have had a chance to share, write “ prayer ” on the board. What might it look like to be careful or casual in prayer? Invite students to think about how they currently approach their own prayers. The following is one way to do this. Assure students that they will not share their answers with anyone else. Silently consider your responses to the following questions: Would you consider your prayers to be more careful or casual? Why? How might you be blessed if your prayers were more careful and meaningful? The previous questions can help students think about their current life circumstances. When learners see how what they are learning relates to their life circumstances, they are more likely to apply the Savior’s teachings in their lives. You can help students find personal relevance by providing prompts that help students think about their current life circumstances. (For additional training on creating relevant learning experiences, see “ Help learners find personal relevance in the doctrine of Jesus Christ ” in Teacher Development Skills [2022].) You might invite students to ask questions they may have about prayer. Many of the psalms are heartfelt prayers that provide an example of approaching Heavenly Father in humble faith. As you study these psalms, be sensitive to thoughts and feelings from the Holy Ghost about how to communicate more meaningfully with Heavenly Father through prayer. The psalms can teach us about prayer To help students understand ways they can communicate more meaningfully with Heavenly Father in prayer, consider displaying the following scripture passages and questions on the board. Students could read a passage, then think about how it answers one or more of the questions. It could be helpful to quietly play instrumental music as students study. Read at least three of the following scripture passages, looking for answers to one or more of the questions that follow. Psalm 55:16–17 Psalm 61:1–3 Psalm 63:1–7 Psalm 69:13–18 Psalm 86:3–12 When should I pray to Heavenly Father? How can I be more careful in my prayers? What should my attitude be like when approaching Heavenly Father in prayer? Invite students to share what they discovered. As part of the discussion, write the following incomplete statement on the board: Our prayers to Heavenly Father can become more meaningful as we … Ask students to complete the statement with what they learned about prayer from the psalms they read. Some examples of what students might say include: pray at any time of the day (see Psalm 55:16–17 ). pray when we feel overwhelmed (see Psalm 61:2 ). pray for deliverance (see Psalm 69:13–18 ). pray for mercy (see Psalm 86:3–5 ). pray with an attitude of love, reverence, and praise (see Psalm 63:4–6 ; 86:8–13 ). Praying with love and reverence for Heavenly Father This portion of the lesson focuses on this truth: Our prayers to Heavenly Father can become more meaningful as we pray with an attitude of love, reverence, and praise. One way we can pray to Heavenly Father with an attitude of greater love and reverence is through the tone and language of our prayer. President Dallin H. Oaks of the First Presidency taught: The special language of prayer follows different forms in different languages, but the principle is always the same. We should address prayers to our Heavenly Father in words which speakers of that language associate with love and respect and reverence and closeness. … … We wish to follow the Savior’s teaching, “When ye pray, use not vain repetitions, as the heathen do: for they think that they shall be heard for their much speaking.” [ Matthew 6:7 ; see also 3 Nephi 13:7 .] Our prayers should be simple, direct, and sincere. (“ The Language of Prayer ,” Ensign , May 1993, 16) You might explain that we can show love, respect, and reverence to Heavenly Father by addressing Him using the words thee, thou, thy, and thine. See “ The Language of Prayer ,” Ensign , May 1993, for more information. Think about the language you use in your prayers and how it reflects your feelings for Heavenly Father. Why might it be worth the effort to use respectful and reverent language in your prayers? Read Matthew 6:5–13 looking for how Jesus Christ exemplified love and reverence to Heavenly Father in prayer. What do you learn from the Savior’s teachings and example that can influence the way you pray? How has sincere prayer blessed your life? Application The following diagram can help students think about ways to apply what they learned about prayer. Invite students to draw the diagram in their journals. Then invite them to write answers to the questions in the graphic in each section. Help students to recognize that what they wrote are things they can start applying today. Invite them to act on one or two of the things they wrote. If students are able, you might invite them to take a picture of their graphic to remember what they wrote down. Consider sharing your testimony of how we can communicate with Heavenly Father in meaningful ways through prayer.\n\n\n--- Lesson 107 ---\nDo you feel that your scripture study leads to guidance from the Lord? Psalm 119 expresses gratitude for the word of God and testifies of its power. This lesson can help students make a plan to study the word of God. Student preparation: Invite students to personally study the scriptures before next class. Ask them to ponder if they feel the Lord’s guidance through their scripture study. If so, can they think of any examples? Possible Learning Activities Guidance and the scriptures To prepare students to study about the scriptures, invite them to ponder how different people have different attitudes toward the scriptures. Ask students to consider how these different people might finish the following statement. You could also use this activity as student preparation. You could share the statement before class and invite students to bring an object that would help finish it. Scriptures are like because . If students need an example, you could say, “Scriptures are like a map or a GPS because they guide me.” Invite students to share their thoughts. You might ask why some people love studying the scriptures but others do not. Consider inviting students to ponder how they could complete the statement to reflect their attitude toward the scriptures. At the end of the lesson, you will evaluate your scripture study goal or make a new one. Consider saying a silent prayer for Heavenly Father to guide you today as you study Psalm 119 . Seek inspiration to make the goal that would best help you. The word of God is like … The writer of Psalm 119 used symbols to describe the word of God. These symbols emphasized the psalmist’s love for God’s word and the blessings that come through diligently studying and obeying His words. For example, read Psalm 119:105–106 , looking for what the psalmist compared to the word of God. Consider dimming or turning off the lights in the room and turning on a lamp or flashlight. Allow students to share what they found. How is the word of God like a light or lamp? If students share something such as the following principle, write it on the board: As we study the word of God, He blesses us with guidance. If students need more help identifying the principle, consider asking, “How is walking in the light different from walking in the dark?” or “How can scriptures help us walk in the light?” Or you could write the principle and ask, “How do these verses illustrate the principle on the board?” Turn the lights in the room back on. Consider inviting students to cross-reference or link Psalm 119:105 to 2 Nephi 32:3 . Ask students to note how these verses are similar. Or watch “ How I #HearHim: Elder David A. Bednar ” (1:15), Gospel Library. 1:16 Read or display the following questions, and invite a few students to each select one and answer it: Why do you think God wants to guide us? How could knowing that God can guide us through the scriptures motivate someone to study them? When has the word of God been like a lamp or light to you or someone you know? As students share their answers, you could ask how these ideas and experiences have affected their relationship with God. Other symbols The psalmist made other comparisons. ( Note: the psalmist referred to the word of God by various terms such as testimonies, statutes, law, precepts, commandments, and ways.) To help students study Psalm 119 , write the following references on the board: Psalm 119:14–16, 72, 127 Psalm 119:22–24 Psalm 119:33–35 Psalm 119:50–52, 54 Psalm 119:102–104 Divide the class into five groups and assign each group one of the references on the board. Display the following objects or pictures of these objects: a hymnbook, coins (or something representing riches), honey (or something sweet), a picture of a path, and a picture of a counselor (for example, a counselor in the First Presidency of the Church or a school counselor). Display the following instructions: Read your assigned scripture passage, looking for what the psalmist compared to the word of God. Take the object or picture that corresponds to your assigned scripture passage. Discuss how the object or picture could help someone understand the importance of the word of God. Share examples or experiences from your life, the lives of others, or the scriptures that illustrate how the object or picture is like the word of God. Invite students to finish the following principle according to what they studied: As we study the word of God, He blesses us with … Some possible answers are joy (see verses 14, 16, 35, 103 ), comfort (see verses 50, 52 ), counsel (see verse 24 ), and understanding (see verse 104 ). How could the principle you found help someone want to study the word of God? How has God blessed you or people you know with joy, comfort, counsel, or understanding as you or they studied His word? As students share their answers to the previous question, you could ask how these experiences have affected their relationship with God. Your goal Invite the Spirit as you reflect on your scripture study. If you already have a scripture study goal, record in your study journal what has gone well and what you might want to continue. You might include why you chose this goal and how it helps you feel closer to the Lord. Prayerfully ask Heavenly Father if He would want you to make any adjustments to your goal. If you do not have a current scripture study goal, seek the guidance of the Holy Ghost as you make one. You might include the following: The amount of time you will study How often you will study (if possible, strive to study daily) What you will do to seek the Lord’s help with your study (for example, pray before you study or seek revelation about what you study) How you can remember, meditate on, or apply what you learn (for example, keep a journal of what you are learning from your scripture study, keep a record of what you are trying to apply, or discuss with someone else what you are learning once a week) Invite volunteers to share their scripture study goal as well as any concerns they might have. If students share concerns, invite the class to share scriptures, statements from Church leaders, or personal experiences that might help. Tell students that in “ Assess Your Learning 7 ,” they will have the opportunity to report on their goals. They will share how their scripture study is going and what blessings they feel the Lord is giving them because of it. If there is still time in class, invite students to quietly study the scriptures. Invite them to look for truths that God gives us that can guide them in their lives today. Invite a few students to share what they found. Share your testimony of the principles in this lesson.\n\n\n--- Lesson 108 ---\nLike many hymns, the Psalms remind us to give thanks in all things. Expressing sincere gratitude to Heavenly Father and Jesus Christ can open our eyes and hearts to Their love and mercy and allows our love for Them to grow. This lesson can help students feel Heavenly Father and Jesus Christ’s love as they express gratitude for Them. Student preparation: Invite students to offer a prayer thanking Heavenly Father without asking for anything in return. Students could prepare to share their impressions from the experience with the class. Possible Learning Activities How can I feel God’s love? Begin class by helping students ponder how they can feel God’s love. One way to do this is to invite students to imagine the following scenario. One day a friend says to you: “Sometimes in church and seminary, people talk about feeling God’s love. I’m not sure I feel it. What can I do to feel His love in my life?” How might you respond to your friend? Students might have various answers, or they might not know what to say. After students respond, you could share the following statement. President Thomas S. Monson (1927–2018) explained something we can do to feel God’s love: My brothers and sisters, do we remember to give thanks for the blessings we receive? Sincerely giving thanks not only helps us recognize our blessings, but it also unlocks the doors of heaven and helps us feel God’s love. (“ The Divine Gift of Gratitude ,” Ensign or Liahona , Nov. 2010, 87) How would you summarize what President Monson taught? As students share their answers, write the following truth on the board: Expressing gratitude for our blessings helps us feel God’s love. Read Psalm 136:1–3, 26 , looking for why the psalmist expresses gratitude for God. What do you notice? You might want to invite students to mark the phrase “for his mercy endureth for ever.” You could point out that every time the psalmist expresses gratitude, he recognizes God’s love. You might explain that in Hebrew the word for mercy in these verses is hesed , which is “a special kind of love and mercy that God feels for and extends to those who have made a covenant with Him” (Russell M. Nelson, “ The Everlasting Covenant ,” Liahona , Oct. 2022, 6). Why do you think expressing gratitude for our blessings helps us feel God’s love? Recognizing God’s blessings To help students assess how they are doing at expressing gratitude to the Lord, you could do the following activity. Remind students that the Holy Ghost can help us remember so that we can learn and improve. Invite students to listen for impressions from the Holy Ghost as they consider their answers. Think about your experiences over the last week. In your study journal, answer the following questions with the phrases never , once or twice , a few times , or many times . How often did you recognize a specific blessing from the Lord in your life? How often did you express gratitude to the Lord for your blessings? How often did you feel His love? As students consider their answers, they might think about any blessings the Lord has given them that they are not recognizing or expressing gratitude for. To help students recognize their blessings, use the handout “ Psalm 136: Gratitude to the Lord .” Students could work on the handout alone, or you could have students fill out the first box of the handout, then pass it to another classmate to complete the next box. Students continue passing until each box is filled out. The handout could then be returned to the original student to see what their classmates wrote. Allow students enough time to give thoughtful answers to each section. Open PDF After the activity, you might discuss what students learned or felt about expressing gratitude to God. As part of the discussion, you might want to emphasize how feeling and expressing gratitude can help us feel love for and from Heavenly Father and Jesus Christ. After students have had sufficient time to discuss, you could share the following video, available at ChurchofJesusChrist.org : “ Principles of Peace: Gratitude ” (2:32) 2:33 Expressing gratitude to God To help students practice expressing gratitude to God, you could invite them to do one of the following activities. Choose one of the following options to express your gratitude for Heavenly Father and Jesus Christ. Pay attention to the love you might feel from Them as you do this. Express your gratitude for Heavenly Father and Jesus Christ in a social media post or by writing in your journal. Make a list of things that you are grateful for. Remember to include those things in your next prayer. To conclude, you might share how expressing gratitude to Heavenly Father and Jesus Christ helps us feel Their love and allows our love for Them to grow.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Psalms 49",
      "content": "1. Hear this, allyepeople; giveear, allyeinhabitants of the world:\n2. Both low and high, rich and poor, together.\n3. My mouth shall speak of wisdom; and the meditation of my heartshall beof understanding.\n4. I will incline mine ear to parable: I willopenmy dark saying upon the harp.\n5. Wherefore should I fear in the days of evil,whenthe iniquity of myheelsshall compass me about?\n6. They that trust in theirwealth, and boast themselves in the multitude of their riches;\n7. Noneof themcan by any means redeem his brother, nor give to God ransom for him:\n8. (For the redemption of theirsoulisprecious, and it ceaseth for ever:)\n9. That he should stilllivefor ever,andnot see corruption.\n10. For he seeththatwise mendie, likewise the fool and the brutish person perish, and leave their wealth to others.\n11. Their inward thoughtis, thattheir housesshall continuefor ever,andtheir dwelling places to all generations; they calltheirlands after their ownnames.\n12. Nevertheless manbeingin honour abideth not: he is like the beaststhatperish.\n13. This their wayistheir folly: yet their posterity approve their sayings.Selah.\n14. Like sheep they are laid in the grave; death shall feed on them; and the upright shall havedominionover them in the morning; and their beauty shall consume in the grave from their dwelling.\n15. But God willredeemmy soul from the power of the grave: for he shallreceiveme.Selah.\n16. Be not thou afraid when one is made rich, when the glory of his house is increased;\n17. For when he dieth he shall carry nothing away: his glory shall not descend after him.\n18. Though while he lived heblessedhis soul: andmenwill praise thee, when thou doest well to thyself.\n19. He shall go to the generation of his fathers; they shall never see light.\n20. Manthat isin honour, and understandeth not, is like the beaststhatperish.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Psalms 50",
      "content": "1. The mighty God,eventheLord, hath spoken, and called the earth from the rising of the sun unto the going down thereof.\n2. Out of Zion, theperfectionofbeauty, God hathshined.\n3. Our God shall come, and shall not keep silence: afireshall devour before him, and it shall be very tempestuous round about him.\n4. He shall call to theheavensfrom above, and to the earth, that he mayjudgehis people.\n5. Gather mysaintstogether untome; those that have made acovenantwith me bysacrifice.\n6. And the heavens shalldeclarehisrighteousness: for Godisjudgehimself.Selah.\n7. Hear, O my people, and I will speak; O Israel, and I will testify against thee: IamGod,eventhy God.\n8. I will not reprove thee for thy sacrifices or thy burnt offerings,to have beencontinually before me.\n9. I will take no bullock out of thy house,norhe goats out of thy folds.\n10. For every beast of the forestismine,andthe cattle upon thousand hills.\n11. I know all the fowls of the mountains: and the wild beasts of the fieldaremine.\n12. If I were hungry, I would not tell thee: for theworldismine, and the fulness thereof.\n13. Will I eat the flesh of bulls, or drink the blood of goats?\n14. Offer unto Godthanksgiving; and pay thyvowsunto the most High:\n15. Andcallupon me in the day oftrouble: I will deliver thee, and thou shalt glorify me.\n16. But unto the wicked God saith,Whathast thou to do to declare my statutes, orthatthou shouldest take my covenant in thy mouth?\n17. Seeing thou hatest instruction, and castest my words behind thee.\n18. When thou sawest thief, then thou consentedst with him, and hast been partaker with adulterers.\n19. Thou givest thy mouth to evil, and thy tongue framethdeceit.\n20. Thou sittestandspeakest against thy brother; thouslanderestthine own mothers son.\n21. Thesethingshast thou done, and I kept silence; thou thoughtest that I was altogethersuch an oneas thyself:butI will reprove thee,andsetthemin order before thine eyes.\n22. Now consider this, ye thatforgetGod, lest I tearyouin pieces, andthere benone to deliver.\n23. Whoso offerethpraiseglorifieth me: and to him that orderethhisconversationarightwill I shew the salvation of God.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Psalms 51",
      "content": "1. Havemercyupon me, O God, according to thylovingkindness: according unto the multitude of thy tender merciesblot outmytransgressions.\n2. Wash me throughly from mine iniquity, andcleanseme from my sin.\n3. For Iacknowledgemy transgressions: and mysinisever before me.\n4. Against thee, thee only, have Isinned, and donethisevil in thy sight: that thou mightest bejustifiedwhen thou speakest,andbe clear when thou judgest.\n5. Behold, I was shapen in iniquity; and in sin did my motherconceiveme.\n6. Behold, thou desirest truth in the inward parts: and in the hiddenpartthou shalt make me to know wisdom.\n7. Purge me withhyssop, and I shall be clean: wash me, and I shall be whiter than snow.\n8. Make me to hear joy and gladness;thatthe boneswhichthou hast broken may rejoice.\n9. Hide thy face from my sins, and blot out all mine iniquities.\n10. Create in me acleanheart, O God; andrenewa right spirit within me.\n11. Cast me not away from thypresence; and take not thyholy spiritfrom me.\n12. Restore unto me the joy of thy salvation; and uphold mewith thyfree spirit.\n13. Thenwill I teach transgressors thy ways; and sinners shall beconvertedunto thee.\n14. Deliverme from bloodguiltiness, O God, thou God of my salvation:andmy tongue shall sing aloud of thy righteousness.\n15. O Lord, open thou my lips; and my mouth shall shew forth thy praise.\n16. For thou desirest notsacrifice; else would I giveit:thou delightest not in burnt offering.\n17. Thesacrificesof Godarea broken spirit: broken and acontrite heart, O God, thou wilt not despise.\n18. Do good in thy goodpleasureunto Zion: build thou the walls of Jerusalem.\n19. Then shalt thou be pleased with the sacrifices of righteousness, with burnt offering and whole burnt offering: then shall they offer bullocks upon thine altar.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Psalms": {
      "49": {
        "verses": {
          "1": {
            "text": "Hear this, allyepeople; giveear, allyeinhabitants of the world:",
            "citation": "(Psalms 49:1)"
          },
          "2": {
            "text": "Both low and high, rich and poor, together.",
            "citation": "(Psalms 49:2)"
          },
          "3": {
            "text": "My mouth shall speak of wisdom; and the meditation of my heartshall beof understanding.",
            "citation": "(Psalms 49:3)"
          },
          "4": {
            "text": "I will incline mine ear to parable: I willopenmy dark saying upon the harp.",
            "citation": "(Psalms 49:4)"
          },
          "5": {
            "text": "Wherefore should I fear in the days of evil,whenthe iniquity of myheelsshall compass me about?",
            "citation": "(Psalms 49:5)"
          },
          "6": {
            "text": "They that trust in theirwealth, and boast themselves in the multitude of their riches;",
            "citation": "(Psalms 49:6)"
          },
          "7": {
            "text": "Noneof themcan by any means redeem his brother, nor give to God ransom for him:",
            "citation": "(Psalms 49:7)"
          },
          "8": {
            "text": "(For the redemption of theirsoulisprecious, and it ceaseth for ever:)",
            "citation": "(Psalms 49:8)"
          },
          "9": {
            "text": "That he should stilllivefor ever,andnot see corruption.",
            "citation": "(Psalms 49:9)"
          },
          "10": {
            "text": "For he seeththatwise mendie, likewise the fool and the brutish person perish, and leave their wealth to others.",
            "citation": "(Psalms 49:10)"
          },
          "11": {
            "text": "Their inward thoughtis, thattheir housesshall continuefor ever,andtheir dwelling places to all generations; they calltheirlands after their ownnames.",
            "citation": "(Psalms 49:11)"
          },
          "12": {
            "text": "Nevertheless manbeingin honour abideth not: he is like the beaststhatperish.",
            "citation": "(Psalms 49:12)"
          },
          "13": {
            "text": "This their wayistheir folly: yet their posterity approve their sayings.Selah.",
            "citation": "(Psalms 49:13)"
          },
          "14": {
            "text": "Like sheep they are laid in the grave; death shall feed on them; and the upright shall havedominionover them in the morning; and their beauty shall consume in the grave from their dwelling.",
            "citation": "(Psalms 49:14)"
          },
          "15": {
            "text": "But God willredeemmy soul from the power of the grave: for he shallreceiveme.Selah.",
            "citation": "(Psalms 49:15)"
          },
          "16": {
            "text": "Be not thou afraid when one is made rich, when the glory of his house is increased;",
            "citation": "(Psalms 49:16)"
          },
          "17": {
            "text": "For when he dieth he shall carry nothing away: his glory shall not descend after him.",
            "citation": "(Psalms 49:17)"
          },
          "18": {
            "text": "Though while he lived heblessedhis soul: andmenwill praise thee, when thou doest well to thyself.",
            "citation": "(Psalms 49:18)"
          },
          "19": {
            "text": "He shall go to the generation of his fathers; they shall never see light.",
            "citation": "(Psalms 49:19)"
          },
          "20": {
            "text": "Manthat isin honour, and understandeth not, is like the beaststhatperish.",
            "citation": "(Psalms 49:20)"
          }
        }
      },
      "50": {
        "verses": {
          "1": {
            "text": "The mighty God,eventheLord, hath spoken, and called the earth from the rising of the sun unto the going down thereof.",
            "citation": "(Psalms 50:1)"
          },
          "2": {
            "text": "Out of Zion, theperfectionofbeauty, God hathshined.",
            "citation": "(Psalms 50:2)"
          },
          "3": {
            "text": "Our God shall come, and shall not keep silence: afireshall devour before him, and it shall be very tempestuous round about him.",
            "citation": "(Psalms 50:3)"
          },
          "4": {
            "text": "He shall call to theheavensfrom above, and to the earth, that he mayjudgehis people.",
            "citation": "(Psalms 50:4)"
          },
          "5": {
            "text": "Gather mysaintstogether untome; those that have made acovenantwith me bysacrifice.",
            "citation": "(Psalms 50:5)"
          },
          "6": {
            "text": "And the heavens shalldeclarehisrighteousness: for Godisjudgehimself.Selah.",
            "citation": "(Psalms 50:6)"
          },
          "7": {
            "text": "Hear, O my people, and I will speak; O Israel, and I will testify against thee: IamGod,eventhy God.",
            "citation": "(Psalms 50:7)"
          },
          "8": {
            "text": "I will not reprove thee for thy sacrifices or thy burnt offerings,to have beencontinually before me.",
            "citation": "(Psalms 50:8)"
          },
          "9": {
            "text": "I will take no bullock out of thy house,norhe goats out of thy folds.",
            "citation": "(Psalms 50:9)"
          },
          "10": {
            "text": "For every beast of the forestismine,andthe cattle upon thousand hills.",
            "citation": "(Psalms 50:10)"
          },
          "11": {
            "text": "I know all the fowls of the mountains: and the wild beasts of the fieldaremine.",
            "citation": "(Psalms 50:11)"
          },
          "12": {
            "text": "If I were hungry, I would not tell thee: for theworldismine, and the fulness thereof.",
            "citation": "(Psalms 50:12)"
          },
          "13": {
            "text": "Will I eat the flesh of bulls, or drink the blood of goats?",
            "citation": "(Psalms 50:13)"
          },
          "14": {
            "text": "Offer unto Godthanksgiving; and pay thyvowsunto the most High:",
            "citation": "(Psalms 50:14)"
          },
          "15": {
            "text": "Andcallupon me in the day oftrouble: I will deliver thee, and thou shalt glorify me.",
            "citation": "(Psalms 50:15)"
          },
          "16": {
            "text": "But unto the wicked God saith,Whathast thou to do to declare my statutes, orthatthou shouldest take my covenant in thy mouth?",
            "citation": "(Psalms 50:16)"
          },
          "17": {
            "text": "Seeing thou hatest instruction, and castest my words behind thee.",
            "citation": "(Psalms 50:17)"
          },
          "18": {
            "text": "When thou sawest thief, then thou consentedst with him, and hast been partaker with adulterers.",
            "citation": "(Psalms 50:18)"
          },
          "19": {
            "text": "Thou givest thy mouth to evil, and thy tongue framethdeceit.",
            "citation": "(Psalms 50:19)"
          },
          "20": {
            "text": "Thou sittestandspeakest against thy brother; thouslanderestthine own mothers son.",
            "citation": "(Psalms 50:20)"
          },
          "21": {
            "text": "Thesethingshast thou done, and I kept silence; thou thoughtest that I was altogethersuch an oneas thyself:butI will reprove thee,andsetthemin order before thine eyes.",
            "citation": "(Psalms 50:21)"
          },
          "22": {
            "text": "Now consider this, ye thatforgetGod, lest I tearyouin pieces, andthere benone to deliver.",
            "citation": "(Psalms 50:22)"
          },
          "23": {
            "text": "Whoso offerethpraiseglorifieth me: and to him that orderethhisconversationarightwill I shew the salvation of God.",
            "citation": "(Psalms 50:23)"
          }
        }
      },
      "51": {
        "verses": {
          "1": {
            "text": "Havemercyupon me, O God, according to thylovingkindness: according unto the multitude of thy tender merciesblot outmytransgressions.",
            "citation": "(Psalms 51:1)"
          },
          "2": {
            "text": "Wash me throughly from mine iniquity, andcleanseme from my sin.",
            "citation": "(Psalms 51:2)"
          },
          "3": {
            "text": "For Iacknowledgemy transgressions: and mysinisever before me.",
            "citation": "(Psalms 51:3)"
          },
          "4": {
            "text": "Against thee, thee only, have Isinned, and donethisevil in thy sight: that thou mightest bejustifiedwhen thou speakest,andbe clear when thou judgest.",
            "citation": "(Psalms 51:4)"
          },
          "5": {
            "text": "Behold, I was shapen in iniquity; and in sin did my motherconceiveme.",
            "citation": "(Psalms 51:5)"
          },
          "6": {
            "text": "Behold, thou desirest truth in the inward parts: and in the hiddenpartthou shalt make me to know wisdom.",
            "citation": "(Psalms 51:6)"
          },
          "7": {
            "text": "Purge me withhyssop, and I shall be clean: wash me, and I shall be whiter than snow.",
            "citation": "(Psalms 51:7)"
          },
          "8": {
            "text": "Make me to hear joy and gladness;thatthe boneswhichthou hast broken may rejoice.",
            "citation": "(Psalms 51:8)"
          },
          "9": {
            "text": "Hide thy face from my sins, and blot out all mine iniquities.",
            "citation": "(Psalms 51:9)"
          },
          "10": {
            "text": "Create in me acleanheart, O God; andrenewa right spirit within me.",
            "citation": "(Psalms 51:10)"
          },
          "11": {
            "text": "Cast me not away from thypresence; and take not thyholy spiritfrom me.",
            "citation": "(Psalms 51:11)"
          },
          "12": {
            "text": "Restore unto me the joy of thy salvation; and uphold mewith thyfree spirit.",
            "citation": "(Psalms 51:12)"
          },
          "13": {
            "text": "Thenwill I teach transgressors thy ways; and sinners shall beconvertedunto thee.",
            "citation": "(Psalms 51:13)"
          },
          "14": {
            "text": "Deliverme from bloodguiltiness, O God, thou God of my salvation:andmy tongue shall sing aloud of thy righteousness.",
            "citation": "(Psalms 51:14)"
          },
          "15": {
            "text": "O Lord, open thou my lips; and my mouth shall shew forth thy praise.",
            "citation": "(Psalms 51:15)"
          },
          "16": {
            "text": "For thou desirest notsacrifice; else would I giveit:thou delightest not in burnt offering.",
            "citation": "(Psalms 51:16)"
          },
          "17": {
            "text": "Thesacrificesof Godarea broken spirit: broken and acontrite heart, O God, thou wilt not despise.",
            "citation": "(Psalms 51:17)"
          },
          "18": {
            "text": "Do good in thy goodpleasureunto Zion: build thou the walls of Jerusalem.",
            "citation": "(Psalms 51:18)"
          },
          "19": {
            "text": "Then shalt thou be pleased with the sacrifices of righteousness, with burnt offering and whole burnt offering: then shall they offer bullocks upon thine altar.",
            "citation": "(Psalms 51:19)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 31574,
  "total_sources": 5,
  "generated_at": "2025-12-14T04:01:27.389989"
}