{
  "week_number": 15,
  "date_range": "Exodus 7–13",
  "title": "",
  "primary_scriptures": [
    {
      "book": "Exodus",
      "chapters": [
        "7",
        "8",
        "9",
        "10",
        "11",
        "12",
        "13"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Exodus",
      "chapters": [
        "7",
        "8",
        "9",
        "10",
        "11",
        "12",
        "13"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM:  ---\nPlague after plague afflicted Egypt, but Pharaoh still refused to release the Israelites. And yet God continued to demonstrate His power and give Pharaoh opportunities to accept “that I am the Lord” and “there is none like me in all the earth” (\nExodus 7:5\n;\n9:14\n). Meanwhile, Moses and the Israelites must have watched with awe at these manifestations of God’s power on their behalf. Surely these continued signs confirmed their faith in God and strengthened their willingness to follow God’s prophet. Then, after nine terrible plagues had failed to free the Israelites, it was the tenth plague—the death of the firstborn, including Pharaoh’s firstborn—that finally ended the captivity. This seems fitting because in every case of spiritual captivity, there truly is only one way to escape. It is only the sacrifice of Jesus Christ, the Firstborn—the blood of the Lamb without blemish—that will save us.\nIdeas for Learning at Home and at Church\nExodus 7–11\nI can choose to soften my heart.\nHopefully, your will is never opposed to God’s will as Pharaoh’s was. Still, we all have times when our hearts aren’t as soft as they should be. What stands out to you about Pharaoh’s responses to the plagues in\nExodus 7:14–25\n;\n8:5–32\n;\n9:1–26\n;\n10:12–29\n;\n12:29–33\n? Note the clarification in the Joseph Smith Translation of\nExodus 7:3, 13\n;\n9:12\n.\nWhy is “hard” a good description of Pharaoh’s heart? Consider what you learn from these verses about having a soft heart:\n1 Nephi 2:16\n;\nMosiah 3:19\n;\nAlma 24:7–8\n;\n62:41\n;\nEther 12:27\n. As you read about the consequences of Pharaoh’s hard-heartedness, ponder the condition of your heart. What changes do you feel inspired to make?\nExodus 12:1–42\nJesus Christ can save me because of His Atonement.\nThe only way for the Israelites to be spared from the tenth plague, described in\nExodus 11:4–5\n, was to follow precisely the instructions the Lord gave to Moses in\nExodus 12\n, a ritual known as the Passover. The Passover teaches us through symbols that just as the Lord delivered the Israelites from bondage in Egypt, He can also deliver us from the bondage of sin. To explore this symbolism in\nExodus 12:1–42\n, you could use a chart like this one:\nSymbol\nPossible meanings\nGod’s message to me\nSymbol\nThe beginning of months\n(\nverse 2\n; the Lord commanded the Israelites to use this event to mark the beginning of their calendar).\nPossible meanings\nThis was to be a new beginning for Israel. They were to be “born again.”\nSymbol\nThe lamb\n(\nverses 3–5\n).\nPossible meanings\nSee\nJohn 1:29\n;\n6:54\n;\n1 Peter 1:19\n.\nSymbol\nBlood of the lamb on the doorposts\n(\nverses 7, 13, 23\n).\nPossible meanings\nSee\nMosiah 4:2\n;\nRevelation 12:11\n.\nSymbol\nUnleavened bread\n(\nverses 8, 15, 19–20\n).\nPossible meanings\nLeaven, or yeast, can be a symbol of corruption because it spoils easily. See\nMatthew 16:6–12\n;\nJohn 6:35\n.\nSymbol\nBitter herbs\n(\nverse 8\n).\nPossible meanings\nA reminder of the bitterness of sin and captivity. See\nExodus 1:14\n;\nMoses 6:55\n.\nSymbol\nEating in haste, dressed to leave\n(\nverse 11\n).\nPossible meanings\nA symbol of urgency to leave the captivity of sin. See\nGenesis 39:12\n;\n2 Timothy 2:22\n.\nSymbol\nThe destroyer\n(\nverses 13, 23\n).\nPossible meanings\nSee\nDoctrine and Covenants 89:18–21\n.\nSymbol\nThe Israelites were set free\n(\nverses 29–32\n).\nPossible meanings\nSee\n2 Nephi 2:26\n;\nDoctrine and Covenants 138:15–19, 31\n.\nWhat else do you find in the instructions and symbols of the Passover that reminds you of Jesus Christ and His Atonement? What do these symbols suggest to you about how to receive the blessings of His Atonement?\nCome unto Christ by identifying symbols that testify of Him.\n“All things,” the Lord declared, “are created and made to bear record of me” (\nMoses 6:63\n; see also\n2 Nephi 11:4\n). In\nExodus 12\n, symbols like a lamb, blood, unleavened bread, miracles, and deliverance all point to Christ. “Once we understand how these objects relate to the Savior, they can teach us of His power and attributes” (\nTeaching in the Savior’s Way\n,\n7\n).\nIn Remembrance of Me\n, by Walter Rane\nExodus 12:14–17, 24–27\n;\n13:1–16\nThe sacrament helps me remember my deliverance through Jesus Christ.\nThe Savior commanded the Israelites to observe the Passover each year to help them remember He had delivered them, even after their captivity became a distant memory. As you read His instructions in\nExodus 12:14–17, 24–27\n;\n13:1–16\n, think about what you are doing to remember God’s blessings for you. How can you preserve that remembrance “throughout your generations”? (see\nExodus 12:14, 26–27\n).\nWhat similarities do you see between the feast of the Passover and the sacrament? What can you do to “always remember” Jesus Christ? (\nMoroni 4:3\n;\n5:2\n).\nYou might also ponder other things the Lord wants you to remember; see, for example,\nHelaman 5:6–12\n;\nMoroni 10:3\n;\nDoctrine and Covenants 3:3–5, 10\n;\n18:10\n;\n52:40\n.\nSee also Kevin W. Pearson, “\nAre You Still Willing?\n,”\nLiahona\n, Nov. 2022, 67–69; “Always Remember Him” (video), Gospel Library; “\nIn Memory of the Crucified\n,”\nHymns\n, no. 190.\n5:27\nAlways Remember Him\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nHow were Pharaoh’s magicians able to imitate some of the miracles performed by Moses and Aaron?\nHow did later generations continue to remember the Passover?\nClick to see more.\nIdeas for Teaching Children\nExodus 7–11\nThe Lord has power over all things.\nThe plagues described in\nExodus 7–11\nshowed the Egyptians and the Israelites that the Lord has great power. The Lord will help your children throughout their lives when they have faith in His power. To help them learn from this story, you could give each child a paper divided into 10 sections, and invite them to draw pictures of the plagues described in these verses:\nExodus 7:17–18\n;\n8:1–4\n;\n8:16–17\n;\n8:20–22\n;\n9:1–6\n;\n9:8–9\n;\n9:22–23\n;\n10:4–5\n;\n10:21–22\n;\n11:4–7\n(see also “\nThe Plagues of Egypt\n” in\nOld Testament Stories\n, 67–69). Read together\nExodus 7:5\nand\n9:14\nto explain why the Lord sent the plagues.\n2:3\nThe Plagues of Egypt\nShare with your children how the Lord has shown you “that there is none like [Him] in all the earth” (\nExodus 9:14\n). Let them share how they know that the Lord is powerful.\nExodus 8:28–32\n;\n9:7\nThe Lord can help me have a soft heart.\nTo help your children visualize what it means to have a soft heart, it might be fun to show them an object that is hard, such as a rock, and another that is soft and absorbent, such as a sponge. You could also pour water over these objects to demonstrate how easily a soft heart receives the word of the Lord. You could then read together a few verses describing how Pharaoh responded to the plagues sent by the Lord (see\nExodus 8:28–32\n;\n9:7\n). Which of the objects best represents Pharaoh’s heart or attitude? What does it mean to have a soft heart? (see\nMosiah 3:19\n). Elder Christopher H. Kim’s message “\nHarden Not Your Heart\n” could also help your children understand the difference between a hard heart and a soft one (\nLiahona\n, May 2025, 118–20, especially the fifth paragraph).\nYou and your children could make a list of some actions that might show when we have a hard heart (for example, using unkind words or being unwilling to share). How can we show the Lord we want to have soft hearts?\nExodus 12:1–13\nThe sacrament can help me remember Jesus.\nThe Passover taught the Israelites to look forward to the Savior and His sacrifice for us. As you explore\nExodus 12:1–13\ntogether, help your children see connections between the details of the Passover and Jesus Christ’s Atonement (see also “\nThe Passover\n” in\nOld Testament Stories\n, 70–74). For example, how is Jesus like the lamb described in\nverse 5\n?\n2:54\nThe Passover\nToday, we take the sacrament to remember Jesus’s sacrifice. You could show your children a picture of the sacrament and talk about how this ordinance helps us remember Jesus Christ. You might help your children find the word “remember” in the sacrament prayers (see\nMoroni 4–5\n). Or sing together a favorite hymn about the sacrament, and help your children notice the peaceful feeling they have when they think about the Savior. How can we seek that feeling when we take the sacrament?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 15: Lesson 41: Lesson 41—Exodus 7–11The purpose of this lesson is to help students understand how to recognize the Lord’s power and believe in Him.; Lesson 42: Lesson 42—Exodus 12–13, Part 1This lesson can help students feel the importance of the Savior and His Atonement in their lives.... ---\n\n--- Lesson 41 ---\nIt can be difficult to recognize the Lord’s power in our lives. The Lord selected Moses and Aaron to demonstrate His power before Pharaoh. Pharaoh dismissed the Lord’s power. This prompted additional demonstrations of the Lord’s power through plagues that came upon Egypt. The purpose of this lesson is to help students understand how to recognize the Lord’s power and believe in Him. Student preparation: Invite students to look for evidence of the Lord’s power in their lives between now and the next class. Possible Learning Activities God’s power around us Consider beginning class by asking the following questions or having students discuss them in groups. On your way to seminary today, what are things you saw, noticed, or observed? On a scale of 1–5 (1 being not at all, 5 being very much), how would you rate your awareness of your surroundings today? What are some reasons we may be more or less observant? Explain that in a similar way, we can ponder how observant we are to what the Lord has done or is doing for us. Consider asking the following: What evidence might someone notice of God’s power in an ordinary day? One way to invite the Holy Ghost to teach students individually is by allowing students to privately assess how they feel they are doing with specific gospel principles. You could help them do this by displaying the following: Rate yourself on a scale of 1–5 (1 being lowest, 5 being highest) on how well the following describes you: I feel confident in my ability to recognize God’s power or influence in my life. As you learn today, invite the Holy Ghost to help you increase your ability to recognize God’s power and influence in your life. Believing in the Lord In Exodus 6–7 , the Lord promised Moses that He would bring the Israelites out of bondage. He declared that He would manifest His power to Pharaoh and the Egyptians and that they would have no choice but to set the Israelites free. Read Exodus 6:7 ; 7:5 , looking for what the Lord would make sure that both the Israelites and the Egyptians would know. Students may want to mark what they find. What would the Israelites and Egyptians come to know because of the manifestations of the Lord’s power? What can we learn about the Lord from these declarations? Help students identify a truth similar to the Lord gives us opportunities to believe in Him and recognize His power in our lives . The plagues The following activity can give students the opportunity to become familiar with some of the Egyptian plagues. It can also help them to see different responses to the manifestations of God’s power. Be cautious to not spend so much time in this section that it would take away from the remainder of the lesson. Consider displaying the following chart and questions. In Exodus 7–11 , the Lord manifested His power through a series of plagues. Look at the following chart and select two or three plagues to study, looking for answers to the questions that follow. Some verses say that the Lord hardened Pharaoh’s heart. The Joseph Smith Translation provides important clarification that Pharaoh hardened his own heart (see Joseph Smith Translation, footnotes to Exodus 7:3, 13 ; 9:12 ; 10:1, 20, 27 ; 11:10 ). Plague Verses to study Plague 1. Water turned to blood Verses to study Exodus 7:19–25 Plague 2. Frogs come upon the land Verses to study Exodus 8:5–15 ( Note: “Respite” means rest or relief) Plague 3. Lice Verses to study Exodus 8:16–19 Plague 4. Flies Verses to study Exodus 8:20–25, 29–32 Plague 5. Cattle die Verses to study Exodus 9:1–7 Plague 6. Boils Verses to study Exodus 9:8–12 Plague 7. Hail and fire from the sky Verses to study Exodus 9:22–29, 33–35 Plague 8. Locusts Verses to study Exodus 10:12–20 Plague 9. Darkness Verses to study Exodus 10:21–27 In what ways was the Lord’s power manifest? Why do you think individuals believed or did not believe in the Lord and His power? After sufficient time, consider inviting students to share their findings in pairs or small groups. It may be helpful to clarify some of the following. Students may have noticed that Pharaoh’s magicians, either through deception or the power of the adversary, were able to replicate some portion of the first two plagues. They were not, however, able to fully replicate or stop the plagues. Additionally, the Israelites apparently suffered from some plagues but were protected from the fourth, fifth, and seventh plagues. If useful, you could encourage students to mark additional phrases in Exodus 8:10, 22 ; 10:2 where the Lord testified that the people would know He is the Lord. Why do you think the Lord wanted the Egyptians and Israelites to learn about Him? What are reasons people at times believe in God and His power and later have doubts? The Lord’s power in our lives It could be helpful to share with students that the Lord’s power is manifest in many ways today. The following could help students think about how they have seen or experienced that power. Imagine you have a friend who isn’t confident that they have ever had an experience with Heavenly Father or felt His power. As you continue your study, think about what you would say to this person. It may be helpful to give students time to ponder or write their thoughts on the following question before they share with the class. What are ways you have come to believe in the Lord’s power? Or what are things that could help you believe? What are examples from the scriptures or Church history where people were shown the Lord’s power? Students might share examples such as feeling comfort or peace from prayer or a priesthood blessing, experiencing forgiveness, feeling personal guidance from the Holy Ghost, and so on. Help students understand that experiences with the Lord’s power generally result from demonstrating faithful attitudes or actions. President Russell M. Nelson taught the following about what we can do to invite experiences with Heavenly Father: Understand that in the absence of experiences with God, one can doubt the existence of God. So, put yourself in a position to begin having experiences with Him. Humble yourself. Pray to have eyes to see God’s hand in your life and in the world around you. Ask Him to tell you if He is really there—if He knows you. Ask Him how He feels about you. And then listen. (“ Come, Follow Me ,” Ensign or Liahona , May 2019, 90) What could a person do to begin seeing God’s hand and power in their life? You might invite students to role-play how they could respond to the scenario above. Have them counsel their friend who isn’t confident that they have ever had an experience with the Lord or felt His power. Consider bearing testimony of Heavenly Father and Jesus Christ and the importance of recognizing Their power in our lives.\n\n\n--- Lesson 42 ---\nTo free the Israelites, Jehovah (Jesus Christ) sent one final plague—death to all the firstborn children in Egypt. He then gave instructions so the plague would “pass over” anyone who obediently put their trust in Him (see Exodus 12:13 ). Jesus Christ instituted the Passover meal as a symbolic reminder of the saving power of His Atonement. This lesson can help students feel the importance of the Savior and His Atonement in their lives. Student preparation: Invite students to ponder the symbols of Jesus Christ that they have studied in the past. Ask them to consider what those symbols teach about Him. Then invite them to choose one symbol and explain to someone what it teaches about Jesus Christ. Possible Learning Activities The need to be rescued Consider beginning class by reading or summarizing an account about someone who was trapped and could not free themselves. The following account is one way to do this. (For more details, see “ Timeline: Thai cave rescue that transfixed the world for 17 days ,” June 24, 2019, reuters.com .) On June 23, 2018, 12 members of a youth soccer team, ages 11 to 16, and their 25-year-old assistant coach decided to explore an elaborate cave system in northern Thailand following a practice. Shortly after they entered, heavy rains flooded the caves, trapping them four kilometers (2.5 miles) within the caves and cutting off contact with the outside world for more than a week. How might you feel if you were in their situation? On July 2, experienced divers finally located the young group. But floodwaters and additional rain made immediate rescue nearly impossible. While the boys and their coach received life-sustaining assistance, experts debated options. They could try bringing out the boys with diving equipment, but the path was treacherous and required expert skill. They could also attempt to drill through the rock, look for another escape route, or wait months for the water to subside. With more monsoon rains coming, the soccer team’s deliverance from the caves remained uncertain. In a spiritual sense, how might we feel trapped, stuck, or hopeless? Students might point out that we all need the Savior’s help to deliver us from sin, death, and other difficulties in our lives. To help students assess their reliance on the Savior and His Atonement, you could invite them to answer the following questions in their study journals. Take a moment to ponder any sins or difficulties you are struggling with right now. Consider how you feel about these sins or difficulties. Then answer the following questions: What do I believe about the Lord’s ability to deliver me from my sins and other difficulties I might face? How do I feel about what He has done and is willing to do for me? In this lesson, you will learn how the Savior delivered the Israelites from bondage in Egypt. As you study, invite the Holy Ghost to help you understand that the Savior is also your Deliverer. The symbolism of the Passover You might ask students to recount how the Lord used nine plagues to convince the Israelites and Egyptians that He is God. Read Exodus 11:4–6 , looking for the tenth and final plague. What did you discover? The Lord promised the Israelites that if they would faithfully obey His instructions, He would cause the plague to “pass over” them, and their firstborn children would not die (see Exodus 12:13, 23 ). For this reason, the Lord referred to this event as the Passover (see Exodus 12:43 ). The Lord’s instructions involved a meal, including what to prepare and how to eat it. The Savior used symbols in the Passover meal to teach the Israelites about Himself. Provide an activity to help students identify the instructions the Lord gave the Israelites for the Passover meal. Also help students discover what these instructions might teach about the Lord and the deliverance He offers. You might create a chart on the board with the following headings. Students could duplicate the chart in their study journals and complete it in small groups. Possible answers are included here for your reference. Complete one item as a class to model how students can complete the chart in their groups. Study Exodus 12:3–8, 15, 21–23 and fill out the following chart in your study journal. What instructions did the Lord give the Israelites? What might this instruction symbolize? What instructions did the Lord give the Israelites? Kill a male lamb, without blemish, to eat ( 3–6, 21 ). What might this instruction symbolize? Jesus Christ, “the Lamb of God” ( John 1:36 ), was perfect and gave His life for us. What instructions did the Lord give the Israelites? Place the blood of the lamb on the door posts of the entrance to the house ( 7, 22 ). What might this instruction symbolize? The Atonement of Jesus Christ can protect us as we apply the conditions of repentance in our lives. What instructions did the Lord give the Israelites? Eat lamb with bitter herbs and unleavened bread, remove leaven (yeast) from the house ( 8, 15 ). What might this instruction symbolize? Bitter herbs were a reminder of the Israelites’ bitter bondage in Egypt and is like the bitterness of sin. Leaven, or yeast, can make bread moldy. As part of repentance, we can rid our lives of anything that can corrupt our spirits. When students finish, give them an opportunity to share what they learned. You might show the picture at the beginning of the lesson. Students could point out the different Passover items shown in the picture and discuss what they might symbolize. Jesus Christ delivers us from spiritual and physical death Read Exodus 12:50–51 ; 13:3 to see what happened as the children of Israel kept the Passover. Write the following truth on the board: The Savior delivers His people from spiritual and physical death. Explain that the Passover symbolizes this truth. As part of Heavenly Father’s plan, all people need to be saved from physical death (separation of body and spirit; see 2 Nephi 9:6, 11 ) and spiritual death (separation from God because of sin; see Helaman 14:16–19 ). To help students understand the saving power of Jesus Christ, you may want to have students read some of these verses in the Book of Mormon. You might also read or summarize the remainder of the account of the Thai soccer team. Recall the story of the trapped soccer players from earlier. After several intense days, experts from around the world determined a method for rescuing them. Experienced divers entered the dangerous waters of the elaborate cave system and, one by one, delivered the boys and their coach from the flooded caves. How might the experienced divers’ actions symbolize what the Savior can do for us? Jesus Christ’s Atonement matters to me The following activity can help students understand and feel the importance of the Savior’s power to deliver us. Divide the class into pairs. Invite each pair to role-play the following scenario. If you feel your students might struggle to imagine that they were ancient Israelites, skip that portion of the activity, and have both partners discuss the questions for a modern-day teen. In pairs, imagine one of you is an Israelite teen who just participated in the first Passover in Egypt and the other is a modern-day teen. Use the following questions to interview each other. Questions for the Israelite teen How would you describe your experience in bondage before the Passover? What did you learn from your experience the night of the Passover? How did Jehovah change your life? What would you share about Jehovah with people who may be reluctant to follow Him? Questions for the modern-day teen How is sin similar to bondage? How are trials similar to bondage? How has Jesus Christ changed your life? What would you want others to know about the saving power of Jesus Christ? Invite students to review their answers to the self-assessment questions from the beginning of the lesson. Ask them to consider what impressions they’ve felt from the Spirit about the Savior and His power to deliver them. Students could add their insights to what they wrote earlier. You might invite a few students to share their thoughts about Jesus Christ and His atoning power to deliver.\n\n\n--- Lesson 43 ---\nWhy do you think it’s important to remember Heavenly Father and Jesus Christ? To help the children of Israel remember that He delivered them from Egypt, the Lord instituted the Feast of the Passover. Jesus Christ gave us a new way to always remember Him when He instituted the ordinance of the sacrament. This lesson can help students remember the Savior as they prepare for and participate in the ordinance of the sacrament. Student preparation: Invite students to prepare to share something that has helped them remember the Savior before, during, or after the sacrament. This could include a favorite picture, scripture, hymn, or quote. Possible Learning Activities Always remember To help students recognize the importance of remembering, display a picture or object that helps you remember something or someone important to you. This could be something like a wedding ring, a picture, or a memento. Briefly share how this item helps you remember the person or event. Then invite students to answer the following questions. What is something or who is someone you want to remember throughout your life? Why? What are some things you do or have done to help you remember this thing or person? You could then display an image of Jesus Christ. Invite students to look at the image as they prayerfully think about the Savior. Then you could display the following questions for students to answer in their study journals. How do you feel about the Savior? What do you feel is important to remember about Him? Why? As you study today, seek the guidance of the Holy Ghost to help you know what you can do to remember the Savior and what He has done for you. “This day shall be unto you for a memorial” In the previous lesson, “ Exodus 12–13, Part 1 ,” students studied how the Lord delivered the Israelites from Egypt. You could write the word Passover on the board. You might display the picture of Passover used in the previous lesson. Then invite students to summarize what they remember about the miracle of the first Passover (see Exodus 12:1–13 ). Consider organizing students into groups of three. Have each student study one of the following passages and share what they learn with the other members of the group. The Lord commanded His people to repeat the Passover meal “throughout [their] generations” ( Exodus 12:14 ). Read the following verses, looking for words and phrases that indicate what the Lord wanted them to remember and do: Exodus 12:14, 17 Exodus 12:25–27 Exodus 13:3, 8–10 What was preparing and partaking of the Passover meal designed to help the Israelites remember about the Lord? How do you think the Lord blessed the Israelites for obediently participating in the Feast of the Passover? Passover and the sacrament Display a picture of Jesus Christ at the Last Supper. Explain to students that the evening before His suffering in Gethsemane and on the cross, the Savior celebrated the Passover feast with His disciples. To help students visualize this moment, you could show the video “ The Last Supper ” from time code 0:00 to 1:18. The video is available on ChurchofJesusChrist.org . After students read the verses from Luke 22 , you could show from time code 2:13 to 3:15. 6:12 6:12 Read Luke 22:13–15, 19–20 , looking for the new ordinance the Savior instituted. How is the sacrament ordinance like Passover? How is it different? The following question can help students identify truths that relate to their lives. Questions like this can help students find personal relevance in the scriptures they study. Such questions also allow Heavenly Father to teach and inspire students personally. For additional training on helping students find relevance in the scriptures, see “ Learn the doctrine of Jesus Christ for yourself ” in Teacher Development Skills [2022], 29. What truths can we learn as we consider why Heavenly Father and Jesus Christ have provided ordinances like Passover anciently and the sacrament today? Students may share a variety of truths. One truth they might identify could be that Heavenly Father and Jesus Christ provide ordinances like Passover and the sacrament to help us remember Them . Elder Dale G. Renlund of the Quorum of the Twelve Apostles explained one reason why Heavenly Father and Jesus Christ encourage us to remember Them: Our Heavenly Father wants us to recall His and His Beloved Son’s goodness … for the influence such remembrance has on us. By considering Their kindness, our perspective and understanding are enlarged. By reflecting on Their compassion, we become more humble, prayerful, and steadfast. (“ Consider the Goodness and Greatness of God ,” Ensign or Liahona , May 2020, 41) How has remembering the goodness of God affected you? Remembering the Savior before, during, and after the sacrament The following activity can help students prepare to remember the Savior before, during, and after the sacrament. You could provide paper and art supplies. Invite students to create something like a poster, pamphlet, meme, or other reminder of the sacrament. Encourage students to be creative in their designs. Students could reserve space on the backs of their papers for the end of the lesson. At the end of the lesson, students will make plans to do something to better remember the Savior before, during, or after the sacrament. To help you remember the goodness of God as you prepare for, participate in, and remember the sacrament ordinance, do one or more of the following: List some of the symbols of the Passover feast that you have studied. Write down how these Passover symbols could help you remember the Savior before you take the sacrament. Read the sacrament prayers in Doctrine and Covenants 20:77, 79 . List the promises we make when we partake of the sacrament. Then list the Lord’s promises. Write a short paragraph of how thinking about these promises could help you remember the Savior during the sacrament. List a few passages of scripture or a statement from a Church leader that you might want to read and ponder during the sacrament. Choose passages or statements that could help you remember the Savior. Select a favorite sacrament hymn. List the title and two or three lines from the hymn. Choose lines that are meaningful to you and could help you remember the Savior after the sacrament. Students might share what they created with a partner, a group, or the class. You could encourage students to add ideas that other class members share. Make a plan to remember the Savior Quietly reflect on what you have learned and felt today. Invite the Holy Ghost to help you recognize something you could do to better remember Jesus Christ before, during, and after the sacrament. Invite students to use some space on the backs of their papers to answer the following question. What are some specific things you could do to better remember the Savior as you prepare for, participate in, and reflect on the sacrament? A few willing students could share what they feel impressed to do. Invite students to take their papers with them to sacrament meeting to help them remember what they have learned and felt. Consider sharing your witness of the power that can come into our lives as we better remember the Savior while preparing for and participating in the sacrament.\n\n--- SCRIPTURE: Exodus 7 ---\n1. And theLordsaid unto Moses, See, I have made theeagodto Pharaoh: and Aaron thy brother shall be thyprophet.\n2. Thou shalt speak all that Icommandthee: and Aaron thy brother shall speak unto Pharaoh, that he send the children of Israel out of his land.\n3. AndI will harden Pharaohs heart, and multiply my signs and mywondersin the land of Egypt.\n4. ButPharaoh shall not hearken unto you, that I may lay my hand upon Egypt, and bring forth minearmies,andmy people the children of Israel, out of the land of Egypt by great judgments.\n5. And the Egyptians shallknowthatIamtheLord, when I stretch forth mine hand upon Egypt, and bring out the children of Israel from among them.\n6. And Moses and Aaron did as theLordcommanded them, so did they.\n7. And Moseswasfourscoreyears old, andAaronfourscore and three years old, when they spake unto Pharaoh.\n8. And theLordspake unto Moses and unto Aaron, saying,\n9. When Pharaoh shall speak unto you, saying,Shewamiraclefor you: then thou shalt say unto Aaron, Take thy rod, and castitbefore Pharaoh,andit shall become serpent.\n10. And Moses and Aaron went in unto Pharaoh, and they did so as theLordhad commanded: and Aaron cast down his rod before Pharaoh, and before his servants, and it became serpent.\n11. Then Pharaoh also called the wise men and thesorcerers: now themagiciansof Egypt, they also did in like manner with their enchantments.\n12. For they cast down every man his rod, and they became serpents: but Aarons rod swallowed up their rods.\n13. Andhe hardened Pharaohs heart, that he hearkened not unto them; as theLordhad said.\n14. And theLordsaid unto Moses, Pharaohs heartishardened, he refuseth to let the people go.\n15. Get thee unto Pharaoh in the morning; lo, he goeth out unto the water; and thou shalt stand by the rivers brinkagainst he come; and therodwhich was turned to serpent shalt thou take in thine hand.\n16. And thou shalt say unto him, TheLordGodof the Hebrews hath sent me unto thee, saying, Let my people go, that they mayserveme in the wilderness: and, behold, hitherto thou wouldest not hear.\n17. Thus saith theLord, In this thou shalt know that IamtheLord: behold, I will smite with the rod thatisin mine hand upon the waters whicharein theriver, and they shall beturnedtoblood.\n18. And the fish thatisin the river shall die, and the river shall stink; and the Egyptians shall lothe to drink of the water of the river.\n19. And theLordspake unto Moses, Say unto Aaron, Take thy rod, and stretch out thine hand upon the waters of Egypt, upon their streams, upon their rivers, and upon their ponds, and upon all their pools of water, that they may becomeblood; andthatthere may be blood throughout all the land of Egypt, both invessels ofwood, and invessels ofstone.\n20. And Moses and Aaron did so, as theLordcommanded; and he lifted up therod, and smote the waters thatwerein the river, in the sight of Pharaoh, and in the sight of his servants; and all the waters thatwerein the river were turned toblood.\n21. And the fish thatwasin the river died; and the river stank, and the Egyptians could not drink of the water of the river; and there was blood throughout all the land of Egypt.\n22. And the magicians of Egypt did so with their enchantments: and Pharaohs heart was hardened, neither did he hearken unto them; as theLordhad said.\n23. And Pharaoh turned and went into his house,neitherdid he set his heart to this also.\n24. And all the Egyptians digged round about the river for water to drink; for they could not drink of the water of the river.\n25. And seven days were fulfilled, after that theLordhad smitten the river.\n\n--- SCRIPTURE: Exodus 8 ---\n1. And theLordspake unto Moses, Go unto Pharaoh, and say unto him, Thus saith theLord, Let my people go, that they mayserveme.\n2. And if thou refuse to letthemgo, behold, I will smiteall thy borderswithfrogs:\n3. And the river shall bring forth frogs abundantly, which shall go up and come into thine house, and into thy bedchamber, and upon thy bed, and into the house of thy servants, and upon thy people, and into thine ovens, and into thy kneadingtroughs:\n4. And the frogs shall come up both on thee, and upon thy people, and upon all thy servants.\n5. And theLordspake unto Moses, Say unto Aaron, Stretch forth thine hand with thy rod over the streams, over therivers, and over the ponds, and cause frogs to come up upon the land of Egypt.\n6. And Aaron stretched out his hand over the waters of Egypt; and thefrogscame up, and covered the land of Egypt.\n7. And the magicians did so with their enchantments, and brought up frogs upon the land of Egypt.\n8. Then Pharaoh called for Moses and Aaron, and said, Entreat theLord, that he may take away the frogs from me, and from my people; and I will let the people go, that they may do sacrifice unto theLord.\n9. And Moses said unto Pharaoh,Glory over me: whenshall I entreat for thee, and for thy servants, and for thy people, to destroy the frogs from thee and thy houses,thatthey may remain in the river only?\n10. And he said, To morrow. And he said,Be itaccording to thy word: that thou mayest know thatthere isnonelikeunto theLordour God.\n11. And the frogs shall depart from thee, and from thy houses, and fromthy servants, and from thy people; they shall remain in the river only.\n12. And Moses and Aaron went out from Pharaoh: and Moses cried unto theLordbecause of the frogs which he had brought against Pharaoh.\n13. And theLorddid according to the word of Moses; and the frogs died out of the houses, out of the villages, and out of the fields.\n14. And they gathered them together upon heaps: and the land stank.\n15. But when Pharaoh saw that there was respite, hehardenedhis heart, and hearkened not unto them; as theLordhad said.\n16. And theLordsaid unto Moses, Say unto Aaron, Stretch out thy rod, and smite the dust of the land, that it may becomelicethroughout all the land of Egypt.\n17. And they did so; for Aaron stretched out his hand with his rod, and smote the dust of the earth, and it became lice in man, and in beast; all the dust of the land becamelicethroughout all the land of Egypt.\n18. And the magicians did so with their enchantments tobring forth lice, but they could not: so there were lice upon man, and upon beast.\n19. Then the magicians said unto Pharaoh, Thisisthefingerof God: and Pharaohs heart was hardened, and he hearkened not unto them; as theLordhad said.\n20. And theLordsaid unto Moses, Rise up early in the morning, and stand before Pharaoh;lo, he cometh forth to the water; and say unto him, Thus saith theLord, Let my people go, that they may serve me.\n21. Else, if thou wilt not let my people go, behold, I will send swarmsoffliesupon thee, and upon thy servants, and upon thy people, and into thy houses: and the houses of the Egyptians shall be full of swarmsof flies,and also the ground whereon theyare.\n22. And I willseverin that day the land of Goshen, in which my people dwell, thatnoswarmsof fliesshall be there; to the end thou mayest know that IamtheLordin the midst of the earth.\n23. And I will put division between my people and thy people: to morrow shall this sign be.\n24. And theLorddid so; and there came grievous swarmof fliesinto the house of Pharaoh, andintohis servants houses, and into all the land of Egypt: the land wascorruptedby reason of the swarmof flies.\n25. And Pharaoh called for Moses and for Aaron, and said, Go ye, sacrifice to your God in the land.\n26. And Moses said, Itis not meetso to do; for we shall sacrificethe abomination ofthe Egyptians to theLordour God: lo, shall we sacrifice the abomination of the Egyptians before their eyes, and will they not stone us?\n27. We will go three days journey into the wilderness, and sacrifice to theLordour God, as he shall command us.\n28. And Pharaoh said, I will let you go, that ye may sacrifice to theLordyour God in the wilderness; only ye shall not go very far away: entreat for me.\n29. And Moses said, Behold, I go out from thee, and I will entreat theLordthat the swarmsof fliesmay depart from Pharaoh, from his servants, and from his people, to morrow: but let not Pharaoh deal deceitfully any more in not letting the people go to sacrifice to theLord.\n30. And Moses went out from Pharaoh, and entreated theLord.\n31. And theLorddid according to the word of Moses; and he removedthe swarmsof fliesfrom Pharaoh, from his servants, and from his people; there remained not one.\n32. And Pharaoh hardened his heart at this time also, neither would he let the people go.\n\n--- SCRIPTURE: Exodus 9 ---\n1. Then theLordsaid unto Moses, Go in unto Pharaoh, and tell him, Thus saith theLordGod of the Hebrews, Let my people go, that they may serve me.\n2. For if thou refuse to letthemgo, and wilt hold them still,\n3. Behold, the hand of theLordis upon thy cattle whichisin the field, upon the horses, upon the asses, upon the camels, upon the oxen, and upon the sheep:there shall bea verygrievousmurrain.\n4. And theLordshallsever betweenthe cattle of Israel and the cattle of Egypt: and there shall nothing die of allthat isthe childrens of Israel.\n5. And theLordappointed set time, saying, To morrow theLordshall do this thing in the land.\n6. And theLorddid that thing on the morrow, and all the cattle of Egypt died: but of the cattle of the children of Israel died not one.\n7. And Pharaoh sent, and, behold, there was not one of the cattle of the Israelites dead. And the heart of Pharaoh was hardened, and he did not let the people go.\n8. And theLordsaid unto Moses and unto Aaron, Take to you handfuls of ashes of the furnace, and let Moses sprinkle it toward the heaven in the sight of Pharaoh.\n9. And it shall become small dust in all the land of Egypt, and shall beaboilbreaking forthwithblainsupon man, and upon beast, throughout all the land of Egypt.\n10. And they took ashes of the furnace, and stood before Pharaoh; and Moses sprinkled it up toward heaven; and it became boil breaking forthwithblains upon man, and upon beast.\n11. And the magicians could not stand before Moses because of the boils; for the boil was upon the magicians, and upon all the Egyptians.\n12. AndtheLordhardened the heart of Pharaoh, and he hearkened not unto them; as theLordhad spoken unto Moses.\n13. And theLordsaid unto Moses, Rise up early in the morning, and stand before Pharaoh, and say unto him, Thus saith theLordGod of the Hebrews, Let my people go, that they may serve me.\n14. For I will at this time send all myplaguesupon thine heart, and upon thy servants, and upon thy people; that thou mayest know thatthere isnone like me in all the earth.\n15. For now I will stretch out my hand, that I may smite thee and thy people with pestilence; and thou shalt be cut off from the earth.\n16. And in very deed for thiscausehave Iraised thee up, for toshewintheemy power; and that mynamemay bedeclaredthroughout all the earth.\n17. As yetexaltestthou thyself against my people, that thou wilt not let them go?\n18. Behold, to morrow about this time I will cause it to rain very grievoushail, such as hath not beenin Egypt since the foundation thereof even until now.\n19. Send therefore now,andgather thy cattle, and all that thou hast in the field;for uponevery man and beast which shall be found in the field, and shall not be brought home, the hail shall come down upon them, and they shall die.\n20. He that feared the word of theLordamong the servants of Pharaoh made his servants and his cattle flee into the houses:\n21. And he that regarded not the word of theLordleft his servants and his cattle in the field.\n22. And theLordsaid unto Moses, Stretch forth thine hand toward heaven, that there may be hail in all the land of Egypt, upon man, and upon beast, and upon every herb of the field, throughout the land of Egypt.\n23. And Moses stretched forth his rod toward heaven: and theLordsent thunder andhail, and the fire ran along upon the ground; and theLordrained hail upon the land of Egypt.\n24. So there was hail, andfiremingled with the hail, very grievous, such as there was none like it in all the land of Egypt since it became nation.\n25. And thehailsmote throughout all the land of Egypt all thatwasin the field, both man and beast; and the hail smote every herb of the field, and brake every tree of the field.\n26. Only in the land of Goshen, where the children of Israelwere,was there no hail.\n27. And Pharaoh sent, and called for Moses and Aaron, and said unto them, I have sinned this time: theLordisrighteous, and I and my peoplearewicked.\n28. Entreat theLord(forit isenough) that there be nomoremighty thunderings and hail; and I will let you go, and ye shall stay no longer.\n29. And Moses said unto him, As soon as I am gone out of the city, I willspread abroadmy hands unto theLord;andthe thunder shall cease, neither shall there be any more hail; that thou mayest know how that theearthistheLords.\n30. But as for thee and thy servants, I know that ye will not yet fear theLordGod.\n31. And the flax and the barley was smitten: for the barleywasin the ear, and the flaxwasbolled.\n32. But thewheatand theriewere not smitten: for theywerenot grown up.\n33. And Moses went out of the city from Pharaoh, and spread abroad his hands unto theLord: and the thunders and hail ceased, and the rain was not poured upon the earth.\n34. And when Pharaoh saw that the rain and the hail and the thunders were ceased, he sinned yet more, and hardened his heart, he and his servants.\n35. And the heart of Pharaoh was hardened, neither would he let the children of Israel go; as theLordhad spoken by Moses.\n\n--- SCRIPTURE: Exodus 10 ---\n1. And theLordsaid unto Moses, Go in unto Pharaoh:forI have hardened his heart, and the heart of his servants, that I might shew these my signs before him:\n2. And that thou mayesttellin the ears of thy son, and of thy sons son, what things I have wrought inEgypt, and my signs which I have done among them; that ye may know how that IamtheLord.\n3. And Moses and Aaron came in unto Pharaoh, and said unto him, Thus saith theLordGod of the Hebrews, How long wilt thou refuse tohumblethyself before me? let my people go, that they may serve me.\n4. Else, if thou refuse to let my people go, behold, to morrow will I bring thelocustsinto thy coast:\n5. And they shall cover the face of the earth, that one cannot be able to see the earth: and they shall eat theresidueof that which is escaped, which remaineth unto you from the hail, and shall eat every tree which groweth for you out of the field:\n6. And they shall fill thy houses, and the houses of all thy servants, and the houses of all the Egyptians; which neither thy fathers, nor thy fathers fathers have seen, since the day that they were upon the earth unto this day. And he turned himself, and went out from Pharaoh.\n7. And Pharaohs servants said unto him, How long shall this man be asnareunto us? let the men go, that they may serve theLordtheir God: knowest thou not yet that Egypt isdestroyed?\n8. And Moses and Aaron were brought again unto Pharaoh: and he said unto them, Go, serve theLordyour God:butwhoarethey that shall go?\n9. And Moses said, We will go with our young and with ourold, with our sons and with our daughters, with our flocks and with our herds will we go; for wemust holdafeastunto theLord.\n10. And he said unto them, Let theLordbe so with you,asI will let you go, and your little ones: lookto it;forevilisbefore you.\n11. Not so: go now yethat aremen, and serve theLord; for that ye did desire. And they were driven out from Pharaohs presence.\n12. And theLordsaid unto Moses, Stretch out thine hand over the land of Egypt for the locusts, that they may come up upon the land of Egypt, and eat every herb of the land,evenall that the hail hath left.\n13. And Moses stretched forth his rod over the land of Egypt, and theLordbrought an east wind upon the land all that day, and allthatnight;andwhen it was morning, the east wind brought the locusts.\n14. And thelocustswent up over all the land of Egypt, and restedin all the coastsof Egypt: very grievouswere they;before them there were no such locusts as they, neither after them shall be such.\n15. For they covered the face of the whole earth, so that the land was darkened; and they did eat every herb of the land, and all the fruit of the trees which the hail had left: and there remained not any green thing in the trees, or in the herbs of the field, through all the land of Egypt.\n16. Then Pharaoh called for Moses and Aaron in haste; and he said, I have sinned against theLordyour God, and against you.\n17. Now therefore forgive, I pray thee, my sin only this once, and entreat theLordyour God, that he may take away from me this death only.\n18. And he went out from Pharaoh, and entreated theLord.\n19. And theLordturned mighty strong west wind, which took away the locusts, and cast them into theRed sea; there remained not one locust in all the coasts of Egypt.\n20. ButtheLordhardened Pharaohs heart, so that he would not let the children of Israel go.\n21. And theLordsaid untoMoses, Stretch out thine hand toward heaven, that there may bedarknessover the land of Egypt, even darknesswhichmay befelt.\n22. And Moses stretched forth his hand toward heaven; and there was thickdarknessin all the land of Egypt three days:\n23. They saw not one another, neither rose any from his place for three days: but all the children of Israel had light in their dwellings.\n24. And Pharaoh called unto Moses, and said, Go ye, serve theLord; only let your flocks and your herdsbe stayed: let your little ones also go with you.\n25. And Moses said, Thou mustgive us alsosacrifices and burnt offerings, that we may sacrifice unto theLordour God.\n26. Our cattle also shall go with us; there shall not an hoof be left behind; for thereof must we take to serve theLordour God; and we know not with what we must serve theLord, until we come thither.\n27. ButtheLordhardened Pharaohs heart, and he would not let them go.\n28. And Pharaoh said unto him, Get thee from me, take heed to thyself, see my face no more; for inthatday thou seest my face thou shalt die.\n29. And Moses said,Thou hast spoken well, I will see thy face again no more.\n\n--- SCRIPTURE: Exodus 11 ---\n1. And theLordsaid unto Moses, Yet will I bring one plaguemoreupon Pharaoh, and upon Egypt; afterwards he will let you go hence: when he shall letyougo, he shall surelythrustyou out hence altogether.\n2. Speak now in the ears of the people, and let every manborrowof his neighbour, and every woman of her neighbour,jewelsof silver, and jewels of gold.\n3. And theLordgave the peoplefavourin the sight of the Egyptians. Moreover the man Moseswasvery great in the land of Egypt, in the sight of Pharaohs servants, and in the sight of the people.\n4. And Moses said, Thus saith theLord, About midnight will I go out into the midst of Egypt:\n5. And all thefirstbornin the land of Egypt shall die, from thefirstbornof Pharaoh that sitteth upon his throne, even unto the firstborn of the maidservant thatisbehind the mill; and all the firstborn of beasts.\n6. And there shall be great cry throughout all the land of Egypt, such as there was none like it, nor shall be like it any more.\n7. But against any of the children of Israel shall not dog move his tongue, against man or beast: that ye may know how that theLorddoth put adifferencebetween the Egyptians and Israel.\n8. And all these thy servants shall come down unto me, and bow down themselves unto me, saying, Get thee out, and all the people that follow thee: and after that I will go out. And he went out from Pharaoh in greatanger.\n9. And theLordsaid unto Moses, Pharaoh shall not hearken unto you; that my wonders may be multiplied in the land of Egypt.\n10. And Moses and Aaron did all these wonders before Pharaoh:andtheLordhardened Pharaohs heart,so that he would not let the children of Israel go out of his land.\n\n--- SCRIPTURE: Exodus 12 ---\n1. And theLordspake unto Moses and Aaron in the land of Egypt, saying,\n2. Thismonthshall beunto you thebeginningof months: itshall bethe first month of the year to you.\n3. Speak ye unto all the congregation of Israel, saying, In the tenthdayof this month they shall take to them every man lamb, according to the house oftheirfathers, lamb for an house:\n4. And if the household be too little for the lamb, let him and his neighbour next unto his house takeitaccording to the number of the souls; every man according to hiseatingshall make your count for the lamb.\n5. Yourlambshall be without blemish, maleof the first year: ye shall takeitout from the sheep, or from the goats:\n6. And ye shall keep it up until thefourteenthday of the same month: and the whole assembly of the congregation of Israel shall kill it in the evening.\n7. And they shall take of the blood, and strikeiton the two side posts and on the upper door post of the houses, wherein they shall eat it.\n8. And they shall eat the flesh in that night, roast with fire, andunleavenedbread;andwith bitterherbsthey shall eat it.\n9. Eat not of it raw, norsoddenat all with water, but roastwithfire; his head with his legs, and with thepurtenancethereof.\n10. And ye shall let nothing of itremainuntil the morning; and that which remaineth of it until the morning ye shall burn with fire.\n11. And thus shall ye eat it;withyour loinsgirded, your shoes on your feet, and your staff in your hand; and ye shall eat it inhaste: itistheLords passover.\n12. For I will pass through the land of Egypt this night, and will smite all thefirstbornin the land of Egypt, both man and beast; and against all thegodsof Egypt I will executejudgment: IamtheLord.\n13. And the blood shall be to you for atokenupon the houses where yeare:and when I see the blood, I will pass over you, and the plague shall not be upon you to destroyyou,when I smite the land of Egypt.\n14. And thisdayshall be unto you for amemorial; and ye shall keep it afeastto theLordthroughout your generations; ye shall keep it afeastby an ordinancefor ever.\n15. Seven days shall ye eatunleavenedbread; even the first day ye shall put away leaven out of your houses: for whosoever eateth leavened bread from the first day until the seventh day, that soul shall becut offfrom Israel.\n16. And in the first daythere shall bean holyconvocation, and in theseventh daythere shall be an holy convocation to you; no manner of work shall be done in them, savethatwhich every man must eat, that only may be done of you.\n17. And ye shall observethefeastofunleavenedbread; for in this selfsame day have I brought yourarmiesout of the land of Egypt: therefore shall ye observe this day in your generationsbyan ordinance for ever.\n18. In the firstmonth,on the fourteenth day of the month at even, ye shall eat unleavened bread, until the one and twentieth day of the month at even.\n19. Seven days shall there be no leaven found in your houses: for whosoever eateth that which is leavened, even that soul shall be cut off from the congregation of Israel, whether he be astranger, or born in the land.\n20. Ye shall eat nothing leavened; in all your habitations shall ye eat unleavened bread.\n21. Then Moses called for all the elders of Israel, and said unto them,Drawout and take you alambaccording to yourfamilies, and kill thepassover.\n22. And ye shall take bunch of hyssop, and dipitin the blood thatisin the basin, and strike the lintel and the two side posts with thebloodthatisin the basin; and none of you shall go out at the door of his house until the morning.\n23. For theLordwillpassthrough to smite the Egyptians; and when he seeth the blood upon the lintel, and on the two side posts, theLordwillpassover the door, and will notsufferthedestroyerto come in unto your houses to smiteyou.\n24. And ye shall observe this thing for an ordinance to thee and to thy sons for ever.\n25. And it shall come to pass, when ye be come to the land which theLordwill give you, according as he hath promised, that ye shall keep this service.\n26. And it shall come to pass, when yourchildrenshall say unto you, What mean ye by this service?\n27. That ye shall say, Itisthesacrificeof theLordspassover, who passed over the houses of the children of Israel in Egypt, when he smote the Egyptians, anddeliveredour houses. And the people bowed the head and worshipped.\n28. And the children of Israel went away, and did as theLordhadcommandedMoses and Aaron, so did they.\n29. And it came to pass, that at midnight theLordsmoteall thefirstbornin the land of Egypt, from the firstborn of Pharaoh that sat on his throne unto the firstborn of the captive thatwasin the dungeon; and all the firstborn of cattle.\n30. And Pharaoh rose up in the night, he, and all his servants, and all the Egyptians; and there was great cry in Egypt; forthere wasnot house wherethere wasnot onedead.\n31. And he called for Moses and Aaron by night, and said, Rise up,andget youforthfrom among my people, both ye and the children of Israel; and go, serve theLord, as ye have said.\n32. Also take your flocks and yourherds, as ye have said, and be gone; and bless me also.\n33. And the Egyptians wereurgentupon the people, that they might send them out of the land in haste; for they said, Webeall deadmen.\n34. And the people took their dough before it was leavened, their kneadingtroughs being bound up in their clothes upon their shoulders.\n35. And the children of Israel did according to the word of Moses; and theyborrowedof the Egyptians jewels ofsilver, and jewels of gold, andraiment:\n36. And theLordgave the peoplefavourin the sight of the Egyptians, so that theylent unto themsuch things as they required.And theyspoiledthe Egyptians.\n37. And the children of IsraeljourneyedfromRamesesto Succoth, aboutsix hundred thousandon footthat weremen, beside children.\n38. Anda mixed multitudewent up also with them; and flocks, and herds,evenvery much cattle.\n39. And they bakedunleavenedcakes of the dough which they brought forth out of Egypt, for it was not leavened; because they werethrustout of Egypt, and could not tarry, neither had they prepared for themselves anyvictual.\n40. Now thesojourningof the children of Israel, who dwelt in Egypt,wasfour hundred and thirty years.\n41. And it came to pass at the end of the four hundred and thirty years, even the selfsame day it came to pass, that all the hosts of theLordwent out from the land of Egypt.\n42. Itisa nighttobe muchobservedunto theLordfor bringing them out from the land of Egypt: thisisthat night of theLordto be observed of all the children ofIsraelin their generations.\n43. And theLordsaid unto Moses and Aaron, Thisisthe ordinance of thepassover: There shall nostrangereat thereof:\n44. But every mans servant that isboughtfor money, when thou hast circumcised him, then shall he eat thereof.\n45. A foreigner and an hired servant shall not eat thereof.\n46. In one house shall it be eaten; thou shalt not carry forthoughtof the fleshabroadout of the house; neither shall yebreakabonethereof.\n47. All the congregation of Israel shall keep it.\n48. And when stranger shall sojourn with thee, and will keep the passover to theLord, let all his males becircumcised, and then let him come near and keep it; and he shall be as one that isbornin the land: for no uncircumcised person shall eat thereof.\n49. One law shall be to him that is homeborn, and unto the stranger that sojourneth among you.\n50. Thus did all the children of Israel; as theLordcommanded Moses and Aaron, so did they.\n51. And it came to pass the selfsame day,thattheLorddidbringthe children of Israel out of the land of Egypt by their armies.\n\n--- SCRIPTURE: Exodus 13 ---\n1. And theLordspake unto Moses, saying,\n2. Sanctifyunto me all thefirstborn, whatsoeveropeneththewombamong the children of Israel,bothof man and of beast: itismine.\n3. And Moses said unto the people, Remember this day, in which ye came out fromEgypt, out of the house of bondage; for by strength of hand theLordbrought you out from thisplace:there shall no leavened bread be eaten.\n4. This daycame ye outinthemonthAbib.\n5. And it shall be when theLordshallbringthee into the land of theCanaanites, and the Hittites, and the Amorites, and the Hivites, and the Jebusites, which heswareunto thy fathers to give thee, landflowingwith milk and honey, that thou shalt keep this service in this month.\n6. Seven days thou shalt eat unleavened bread, and in the seventh dayshall bea feast to theLord.\n7. Unleavened bread shall be eaten seven days; and there shall noleavenedbread be seen with thee, neither shall there beleavenseen with theein all thy quarters.\n8. And thou shaltshewthy son in that day, saying,This is donebecause of thatwhichtheLorddid unto me when I came forth out of Egypt.\n9. And it shall be for asignunto thee upon thine hand, and for amemorialbetween thine eyes, that theLords law may be in thy mouth: for with strong hand hath theLordbrought thee out of Egypt.\n10. Thou shalt therefore keep this ordinancein his seasonfrom year to year.\n11. And it shall be when theLordshall bring thee into the land of theCanaanites, as heswareunto thee and to thy fathers, and shall give it thee,\n12. That thou shalt set apart unto theLordallthat openeth the matrix, and everyfirstlingthat cometh of beast which thou hast; the malesshall betheLords.\n13. And every firstling of an ass thou shalt redeem with lamb; and if thou wilt not redeem it, then thou shalt break his neck: and all thefirstbornof man among thy children shalt thou redeem.\n14. And it shall be when thysonaskeththee in time to come, saying, Whatisthis? that thou shalt say unto him, By strength of hand theLordbroughtus out from Egypt, from the house ofbondage:\n15. And it came to pass, when Pharaoh would hardly let us go, that theLordslewall the firstborn in the land of Egypt, both the firstborn of man, and the firstborn of beast: therefore I sacrifice to theLordall that openeth the matrix, being males; but all the firstborn of my children I redeem.\n16. And it shall be for token upon thine hand, and forfrontletsbetween thine eyes: for by strength of hand theLordbrought us forth out of Egypt.\n17. And it came to pass, when Pharaoh had let the people go, that God led them notthroughthe way of the land of the Philistines, although thatwasnear; for God said, Lestperadventurethe peoplerepentwhen they see war, and theyreturnto Egypt:\n18. But Godledthe people about,throughthe way of the wilderness of the Red sea: and the children ofIsraelwent upharnessedout of the land of Egypt.\n19. And Moses took the bones ofJosephwith him: for he had straitly sworn the children of Israel, saying, God will surely visit you; and ye shall carry up mybonesaway hence with you.\n20. And they took their journey fromSuccoth, and encamped in Etham, in the edge of the wilderness.\n21. And theLordwent before them by day in pillar of acloud, toleadthem the way; and by night in apillarof fire, to give them light; to go by day and night:\n22. He took not away the pillar of the cloud by day, nor the pillar of fire by night,frombefore the people.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "",
      "content": "Plague after plague afflicted Egypt, but Pharaoh still refused to release the Israelites. And yet God continued to demonstrate His power and give Pharaoh opportunities to accept “that I am the Lord” and “there is none like me in all the earth” (\nExodus 7:5\n;\n9:14\n). Meanwhile, Moses and the Israelites must have watched with awe at these manifestations of God’s power on their behalf. Surely these continued signs confirmed their faith in God and strengthened their willingness to follow God’s prophet. Then, after nine terrible plagues had failed to free the Israelites, it was the tenth plague—the death of the firstborn, including Pharaoh’s firstborn—that finally ended the captivity. This seems fitting because in every case of spiritual captivity, there truly is only one way to escape. It is only the sacrifice of Jesus Christ, the Firstborn—the blood of the Lamb without blemish—that will save us.\nIdeas for Learning at Home and at Church\nExodus 7–11\nI can choose to soften my heart.\nHopefully, your will is never opposed to God’s will as Pharaoh’s was. Still, we all have times when our hearts aren’t as soft as they should be. What stands out to you about Pharaoh’s responses to the plagues in\nExodus 7:14–25\n;\n8:5–32\n;\n9:1–26\n;\n10:12–29\n;\n12:29–33\n? Note the clarification in the Joseph Smith Translation of\nExodus 7:3, 13\n;\n9:12\n.\nWhy is “hard” a good description of Pharaoh’s heart? Consider what you learn from these verses about having a soft heart:\n1 Nephi 2:16\n;\nMosiah 3:19\n;\nAlma 24:7–8\n;\n62:41\n;\nEther 12:27\n. As you read about the consequences of Pharaoh’s hard-heartedness, ponder the condition of your heart. What changes do you feel inspired to make?\nExodus 12:1–42\nJesus Christ can save me because of His Atonement.\nThe only way for the Israelites to be spared from the tenth plague, described in\nExodus 11:4–5\n, was to follow precisely the instructions the Lord gave to Moses in\nExodus 12\n, a ritual known as the Passover. The Passover teaches us through symbols that just as the Lord delivered the Israelites from bondage in Egypt, He can also deliver us from the bondage of sin. To explore this symbolism in\nExodus 12:1–42\n, you could use a chart like this one:\nSymbol\nPossible meanings\nGod’s message to me\nSymbol\nThe beginning of months\n(\nverse 2\n; the Lord commanded the Israelites to use this event to mark the beginning of their calendar).\nPossible meanings\nThis was to be a new beginning for Israel. They were to be “born again.”\nSymbol\nThe lamb\n(\nverses 3–5\n).\nPossible meanings\nSee\nJohn 1:29\n;\n6:54\n;\n1 Peter 1:19\n.\nSymbol\nBlood of the lamb on the doorposts\n(\nverses 7, 13, 23\n).\nPossible meanings\nSee\nMosiah 4:2\n;\nRevelation 12:11\n.\nSymbol\nUnleavened bread\n(\nverses 8, 15, 19–20\n).\nPossible meanings\nLeaven, or yeast, can be a symbol of corruption because it spoils easily. See\nMatthew 16:6–12\n;\nJohn 6:35\n.\nSymbol\nBitter herbs\n(\nverse 8\n).\nPossible meanings\nA reminder of the bitterness of sin and captivity. See\nExodus 1:14\n;\nMoses 6:55\n.\nSymbol\nEating in haste, dressed to leave\n(\nverse 11\n).\nPossible meanings\nA symbol of urgency to leave the captivity of sin. See\nGenesis 39:12\n;\n2 Timothy 2:22\n.\nSymbol\nThe destroyer\n(\nverses 13, 23\n).\nPossible meanings\nSee\nDoctrine and Covenants 89:18–21\n.\nSymbol\nThe Israelites were set free\n(\nverses 29–32\n).\nPossible meanings\nSee\n2 Nephi 2:26\n;\nDoctrine and Covenants 138:15–19, 31\n.\nWhat else do you find in the instructions and symbols of the Passover that reminds you of Jesus Christ and His Atonement? What do these symbols suggest to you about how to receive the blessings of His Atonement?\nCome unto Christ by identifying symbols that testify of Him.\n“All things,” the Lord declared, “are created and made to bear record of me” (\nMoses 6:63\n; see also\n2 Nephi 11:4\n). In\nExodus 12\n, symbols like a lamb, blood, unleavened bread, miracles, and deliverance all point to Christ. “Once we understand how these objects relate to the Savior, they can teach us of His power and attributes” (\nTeaching in the Savior’s Way\n,\n7\n).\nIn Remembrance of Me\n, by Walter Rane\nExodus 12:14–17, 24–27\n;\n13:1–16\nThe sacrament helps me remember my deliverance through Jesus Christ.\nThe Savior commanded the Israelites to observe the Passover each year to help them remember He had delivered them, even after their captivity became a distant memory. As you read His instructions in\nExodus 12:14–17, 24–27\n;\n13:1–16\n, think about what you are doing to remember God’s blessings for you. How can you preserve that remembrance “throughout your generations”? (see\nExodus 12:14, 26–27\n).\nWhat similarities do you see between the feast of the Passover and the sacrament? What can you do to “always remember” Jesus Christ? (\nMoroni 4:3\n;\n5:2\n).\nYou might also ponder other things the Lord wants you to remember; see, for example,\nHelaman 5:6–12\n;\nMoroni 10:3\n;\nDoctrine and Covenants 3:3–5, 10\n;\n18:10\n;\n52:40\n.\nSee also Kevin W. Pearson, “\nAre You Still Willing?\n,”\nLiahona\n, Nov. 2022, 67–69; “Always Remember Him” (video), Gospel Library; “\nIn Memory of the Crucified\n,”\nHymns\n, no. 190.\n5:27\nAlways Remember Him\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nHow were Pharaoh’s magicians able to imitate some of the miracles performed by Moses and Aaron?\nHow did later generations continue to remember the Passover?\nClick to see more.\nIdeas for Teaching Children\nExodus 7–11\nThe Lord has power over all things.\nThe plagues described in\nExodus 7–11\nshowed the Egyptians and the Israelites that the Lord has great power. The Lord will help your children throughout their lives when they have faith in His power. To help them learn from this story, you could give each child a paper divided into 10 sections, and invite them to draw pictures of the plagues described in these verses:\nExodus 7:17–18\n;\n8:1–4\n;\n8:16–17\n;\n8:20–22\n;\n9:1–6\n;\n9:8–9\n;\n9:22–23\n;\n10:4–5\n;\n10:21–22\n;\n11:4–7\n(see also “\nThe Plagues of Egypt\n” in\nOld Testament Stories\n, 67–69). Read together\nExodus 7:5\nand\n9:14\nto explain why the Lord sent the plagues.\n2:3\nThe Plagues of Egypt\nShare with your children how the Lord has shown you “that there is none like [Him] in all the earth” (\nExodus 9:14\n). Let them share how they know that the Lord is powerful.\nExodus 8:28–32\n;\n9:7\nThe Lord can help me have a soft heart.\nTo help your children visualize what it means to have a soft heart, it might be fun to show them an object that is hard, such as a rock, and another that is soft and absorbent, such as a sponge. You could also pour water over these objects to demonstrate how easily a soft heart receives the word of the Lord. You could then read together a few verses describing how Pharaoh responded to the plagues sent by the Lord (see\nExodus 8:28–32\n;\n9:7\n). Which of the objects best represents Pharaoh’s heart or attitude? What does it mean to have a soft heart? (see\nMosiah 3:19\n). Elder Christopher H. Kim’s message “\nHarden Not Your Heart\n” could also help your children understand the difference between a hard heart and a soft one (\nLiahona\n, May 2025, 118–20, especially the fifth paragraph).\nYou and your children could make a list of some actions that might show when we have a hard heart (for example, using unkind words or being unwilling to share). How can we show the Lord we want to have soft hearts?\nExodus 12:1–13\nThe sacrament can help me remember Jesus.\nThe Passover taught the Israelites to look forward to the Savior and His sacrifice for us. As you explore\nExodus 12:1–13\ntogether, help your children see connections between the details of the Passover and Jesus Christ’s Atonement (see also “\nThe Passover\n” in\nOld Testament Stories\n, 70–74). For example, how is Jesus like the lamb described in\nverse 5\n?\n2:54\nThe Passover\nToday, we take the sacrament to remember Jesus’s sacrifice. You could show your children a picture of the sacrament and talk about how this ordinance helps us remember Jesus Christ. You might help your children find the word “remember” in the sacrament prayers (see\nMoroni 4–5\n). Or sing together a favorite hymn about the sacrament, and help your children notice the peaceful feeling they have when they think about the Savior. How can we seek that feeling when we take the sacrament?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 15: Lesson 41: Lesson 41—Exodus 7–11The purpose of this lesson is to help students understand how to recognize the Lord’s power and believe in Him.; Lesson 42: Lesson 42—Exodus 12–13, Part 1This lesson can help students feel the importance of the Savior and His Atonement in their lives....",
      "content": "\n--- Lesson 41 ---\nIt can be difficult to recognize the Lord’s power in our lives. The Lord selected Moses and Aaron to demonstrate His power before Pharaoh. Pharaoh dismissed the Lord’s power. This prompted additional demonstrations of the Lord’s power through plagues that came upon Egypt. The purpose of this lesson is to help students understand how to recognize the Lord’s power and believe in Him. Student preparation: Invite students to look for evidence of the Lord’s power in their lives between now and the next class. Possible Learning Activities God’s power around us Consider beginning class by asking the following questions or having students discuss them in groups. On your way to seminary today, what are things you saw, noticed, or observed? On a scale of 1–5 (1 being not at all, 5 being very much), how would you rate your awareness of your surroundings today? What are some reasons we may be more or less observant? Explain that in a similar way, we can ponder how observant we are to what the Lord has done or is doing for us. Consider asking the following: What evidence might someone notice of God’s power in an ordinary day? One way to invite the Holy Ghost to teach students individually is by allowing students to privately assess how they feel they are doing with specific gospel principles. You could help them do this by displaying the following: Rate yourself on a scale of 1–5 (1 being lowest, 5 being highest) on how well the following describes you: I feel confident in my ability to recognize God’s power or influence in my life. As you learn today, invite the Holy Ghost to help you increase your ability to recognize God’s power and influence in your life. Believing in the Lord In Exodus 6–7 , the Lord promised Moses that He would bring the Israelites out of bondage. He declared that He would manifest His power to Pharaoh and the Egyptians and that they would have no choice but to set the Israelites free. Read Exodus 6:7 ; 7:5 , looking for what the Lord would make sure that both the Israelites and the Egyptians would know. Students may want to mark what they find. What would the Israelites and Egyptians come to know because of the manifestations of the Lord’s power? What can we learn about the Lord from these declarations? Help students identify a truth similar to the Lord gives us opportunities to believe in Him and recognize His power in our lives . The plagues The following activity can give students the opportunity to become familiar with some of the Egyptian plagues. It can also help them to see different responses to the manifestations of God’s power. Be cautious to not spend so much time in this section that it would take away from the remainder of the lesson. Consider displaying the following chart and questions. In Exodus 7–11 , the Lord manifested His power through a series of plagues. Look at the following chart and select two or three plagues to study, looking for answers to the questions that follow. Some verses say that the Lord hardened Pharaoh’s heart. The Joseph Smith Translation provides important clarification that Pharaoh hardened his own heart (see Joseph Smith Translation, footnotes to Exodus 7:3, 13 ; 9:12 ; 10:1, 20, 27 ; 11:10 ). Plague Verses to study Plague 1. Water turned to blood Verses to study Exodus 7:19–25 Plague 2. Frogs come upon the land Verses to study Exodus 8:5–15 ( Note: “Respite” means rest or relief) Plague 3. Lice Verses to study Exodus 8:16–19 Plague 4. Flies Verses to study Exodus 8:20–25, 29–32 Plague 5. Cattle die Verses to study Exodus 9:1–7 Plague 6. Boils Verses to study Exodus 9:8–12 Plague 7. Hail and fire from the sky Verses to study Exodus 9:22–29, 33–35 Plague 8. Locusts Verses to study Exodus 10:12–20 Plague 9. Darkness Verses to study Exodus 10:21–27 In what ways was the Lord’s power manifest? Why do you think individuals believed or did not believe in the Lord and His power? After sufficient time, consider inviting students to share their findings in pairs or small groups. It may be helpful to clarify some of the following. Students may have noticed that Pharaoh’s magicians, either through deception or the power of the adversary, were able to replicate some portion of the first two plagues. They were not, however, able to fully replicate or stop the plagues. Additionally, the Israelites apparently suffered from some plagues but were protected from the fourth, fifth, and seventh plagues. If useful, you could encourage students to mark additional phrases in Exodus 8:10, 22 ; 10:2 where the Lord testified that the people would know He is the Lord. Why do you think the Lord wanted the Egyptians and Israelites to learn about Him? What are reasons people at times believe in God and His power and later have doubts? The Lord’s power in our lives It could be helpful to share with students that the Lord’s power is manifest in many ways today. The following could help students think about how they have seen or experienced that power. Imagine you have a friend who isn’t confident that they have ever had an experience with Heavenly Father or felt His power. As you continue your study, think about what you would say to this person. It may be helpful to give students time to ponder or write their thoughts on the following question before they share with the class. What are ways you have come to believe in the Lord’s power? Or what are things that could help you believe? What are examples from the scriptures or Church history where people were shown the Lord’s power? Students might share examples such as feeling comfort or peace from prayer or a priesthood blessing, experiencing forgiveness, feeling personal guidance from the Holy Ghost, and so on. Help students understand that experiences with the Lord’s power generally result from demonstrating faithful attitudes or actions. President Russell M. Nelson taught the following about what we can do to invite experiences with Heavenly Father: Understand that in the absence of experiences with God, one can doubt the existence of God. So, put yourself in a position to begin having experiences with Him. Humble yourself. Pray to have eyes to see God’s hand in your life and in the world around you. Ask Him to tell you if He is really there—if He knows you. Ask Him how He feels about you. And then listen. (“ Come, Follow Me ,” Ensign or Liahona , May 2019, 90) What could a person do to begin seeing God’s hand and power in their life? You might invite students to role-play how they could respond to the scenario above. Have them counsel their friend who isn’t confident that they have ever had an experience with the Lord or felt His power. Consider bearing testimony of Heavenly Father and Jesus Christ and the importance of recognizing Their power in our lives.\n\n\n--- Lesson 42 ---\nTo free the Israelites, Jehovah (Jesus Christ) sent one final plague—death to all the firstborn children in Egypt. He then gave instructions so the plague would “pass over” anyone who obediently put their trust in Him (see Exodus 12:13 ). Jesus Christ instituted the Passover meal as a symbolic reminder of the saving power of His Atonement. This lesson can help students feel the importance of the Savior and His Atonement in their lives. Student preparation: Invite students to ponder the symbols of Jesus Christ that they have studied in the past. Ask them to consider what those symbols teach about Him. Then invite them to choose one symbol and explain to someone what it teaches about Jesus Christ. Possible Learning Activities The need to be rescued Consider beginning class by reading or summarizing an account about someone who was trapped and could not free themselves. The following account is one way to do this. (For more details, see “ Timeline: Thai cave rescue that transfixed the world for 17 days ,” June 24, 2019, reuters.com .) On June 23, 2018, 12 members of a youth soccer team, ages 11 to 16, and their 25-year-old assistant coach decided to explore an elaborate cave system in northern Thailand following a practice. Shortly after they entered, heavy rains flooded the caves, trapping them four kilometers (2.5 miles) within the caves and cutting off contact with the outside world for more than a week. How might you feel if you were in their situation? On July 2, experienced divers finally located the young group. But floodwaters and additional rain made immediate rescue nearly impossible. While the boys and their coach received life-sustaining assistance, experts debated options. They could try bringing out the boys with diving equipment, but the path was treacherous and required expert skill. They could also attempt to drill through the rock, look for another escape route, or wait months for the water to subside. With more monsoon rains coming, the soccer team’s deliverance from the caves remained uncertain. In a spiritual sense, how might we feel trapped, stuck, or hopeless? Students might point out that we all need the Savior’s help to deliver us from sin, death, and other difficulties in our lives. To help students assess their reliance on the Savior and His Atonement, you could invite them to answer the following questions in their study journals. Take a moment to ponder any sins or difficulties you are struggling with right now. Consider how you feel about these sins or difficulties. Then answer the following questions: What do I believe about the Lord’s ability to deliver me from my sins and other difficulties I might face? How do I feel about what He has done and is willing to do for me? In this lesson, you will learn how the Savior delivered the Israelites from bondage in Egypt. As you study, invite the Holy Ghost to help you understand that the Savior is also your Deliverer. The symbolism of the Passover You might ask students to recount how the Lord used nine plagues to convince the Israelites and Egyptians that He is God. Read Exodus 11:4–6 , looking for the tenth and final plague. What did you discover? The Lord promised the Israelites that if they would faithfully obey His instructions, He would cause the plague to “pass over” them, and their firstborn children would not die (see Exodus 12:13, 23 ). For this reason, the Lord referred to this event as the Passover (see Exodus 12:43 ). The Lord’s instructions involved a meal, including what to prepare and how to eat it. The Savior used symbols in the Passover meal to teach the Israelites about Himself. Provide an activity to help students identify the instructions the Lord gave the Israelites for the Passover meal. Also help students discover what these instructions might teach about the Lord and the deliverance He offers. You might create a chart on the board with the following headings. Students could duplicate the chart in their study journals and complete it in small groups. Possible answers are included here for your reference. Complete one item as a class to model how students can complete the chart in their groups. Study Exodus 12:3–8, 15, 21–23 and fill out the following chart in your study journal. What instructions did the Lord give the Israelites? What might this instruction symbolize? What instructions did the Lord give the Israelites? Kill a male lamb, without blemish, to eat ( 3–6, 21 ). What might this instruction symbolize? Jesus Christ, “the Lamb of God” ( John 1:36 ), was perfect and gave His life for us. What instructions did the Lord give the Israelites? Place the blood of the lamb on the door posts of the entrance to the house ( 7, 22 ). What might this instruction symbolize? The Atonement of Jesus Christ can protect us as we apply the conditions of repentance in our lives. What instructions did the Lord give the Israelites? Eat lamb with bitter herbs and unleavened bread, remove leaven (yeast) from the house ( 8, 15 ). What might this instruction symbolize? Bitter herbs were a reminder of the Israelites’ bitter bondage in Egypt and is like the bitterness of sin. Leaven, or yeast, can make bread moldy. As part of repentance, we can rid our lives of anything that can corrupt our spirits. When students finish, give them an opportunity to share what they learned. You might show the picture at the beginning of the lesson. Students could point out the different Passover items shown in the picture and discuss what they might symbolize. Jesus Christ delivers us from spiritual and physical death Read Exodus 12:50–51 ; 13:3 to see what happened as the children of Israel kept the Passover. Write the following truth on the board: The Savior delivers His people from spiritual and physical death. Explain that the Passover symbolizes this truth. As part of Heavenly Father’s plan, all people need to be saved from physical death (separation of body and spirit; see 2 Nephi 9:6, 11 ) and spiritual death (separation from God because of sin; see Helaman 14:16–19 ). To help students understand the saving power of Jesus Christ, you may want to have students read some of these verses in the Book of Mormon. You might also read or summarize the remainder of the account of the Thai soccer team. Recall the story of the trapped soccer players from earlier. After several intense days, experts from around the world determined a method for rescuing them. Experienced divers entered the dangerous waters of the elaborate cave system and, one by one, delivered the boys and their coach from the flooded caves. How might the experienced divers’ actions symbolize what the Savior can do for us? Jesus Christ’s Atonement matters to me The following activity can help students understand and feel the importance of the Savior’s power to deliver us. Divide the class into pairs. Invite each pair to role-play the following scenario. If you feel your students might struggle to imagine that they were ancient Israelites, skip that portion of the activity, and have both partners discuss the questions for a modern-day teen. In pairs, imagine one of you is an Israelite teen who just participated in the first Passover in Egypt and the other is a modern-day teen. Use the following questions to interview each other. Questions for the Israelite teen How would you describe your experience in bondage before the Passover? What did you learn from your experience the night of the Passover? How did Jehovah change your life? What would you share about Jehovah with people who may be reluctant to follow Him? Questions for the modern-day teen How is sin similar to bondage? How are trials similar to bondage? How has Jesus Christ changed your life? What would you want others to know about the saving power of Jesus Christ? Invite students to review their answers to the self-assessment questions from the beginning of the lesson. Ask them to consider what impressions they’ve felt from the Spirit about the Savior and His power to deliver them. Students could add their insights to what they wrote earlier. You might invite a few students to share their thoughts about Jesus Christ and His atoning power to deliver.\n\n\n--- Lesson 43 ---\nWhy do you think it’s important to remember Heavenly Father and Jesus Christ? To help the children of Israel remember that He delivered them from Egypt, the Lord instituted the Feast of the Passover. Jesus Christ gave us a new way to always remember Him when He instituted the ordinance of the sacrament. This lesson can help students remember the Savior as they prepare for and participate in the ordinance of the sacrament. Student preparation: Invite students to prepare to share something that has helped them remember the Savior before, during, or after the sacrament. This could include a favorite picture, scripture, hymn, or quote. Possible Learning Activities Always remember To help students recognize the importance of remembering, display a picture or object that helps you remember something or someone important to you. This could be something like a wedding ring, a picture, or a memento. Briefly share how this item helps you remember the person or event. Then invite students to answer the following questions. What is something or who is someone you want to remember throughout your life? Why? What are some things you do or have done to help you remember this thing or person? You could then display an image of Jesus Christ. Invite students to look at the image as they prayerfully think about the Savior. Then you could display the following questions for students to answer in their study journals. How do you feel about the Savior? What do you feel is important to remember about Him? Why? As you study today, seek the guidance of the Holy Ghost to help you know what you can do to remember the Savior and what He has done for you. “This day shall be unto you for a memorial” In the previous lesson, “ Exodus 12–13, Part 1 ,” students studied how the Lord delivered the Israelites from Egypt. You could write the word Passover on the board. You might display the picture of Passover used in the previous lesson. Then invite students to summarize what they remember about the miracle of the first Passover (see Exodus 12:1–13 ). Consider organizing students into groups of three. Have each student study one of the following passages and share what they learn with the other members of the group. The Lord commanded His people to repeat the Passover meal “throughout [their] generations” ( Exodus 12:14 ). Read the following verses, looking for words and phrases that indicate what the Lord wanted them to remember and do: Exodus 12:14, 17 Exodus 12:25–27 Exodus 13:3, 8–10 What was preparing and partaking of the Passover meal designed to help the Israelites remember about the Lord? How do you think the Lord blessed the Israelites for obediently participating in the Feast of the Passover? Passover and the sacrament Display a picture of Jesus Christ at the Last Supper. Explain to students that the evening before His suffering in Gethsemane and on the cross, the Savior celebrated the Passover feast with His disciples. To help students visualize this moment, you could show the video “ The Last Supper ” from time code 0:00 to 1:18. The video is available on ChurchofJesusChrist.org . After students read the verses from Luke 22 , you could show from time code 2:13 to 3:15. 6:12 6:12 Read Luke 22:13–15, 19–20 , looking for the new ordinance the Savior instituted. How is the sacrament ordinance like Passover? How is it different? The following question can help students identify truths that relate to their lives. Questions like this can help students find personal relevance in the scriptures they study. Such questions also allow Heavenly Father to teach and inspire students personally. For additional training on helping students find relevance in the scriptures, see “ Learn the doctrine of Jesus Christ for yourself ” in Teacher Development Skills [2022], 29. What truths can we learn as we consider why Heavenly Father and Jesus Christ have provided ordinances like Passover anciently and the sacrament today? Students may share a variety of truths. One truth they might identify could be that Heavenly Father and Jesus Christ provide ordinances like Passover and the sacrament to help us remember Them . Elder Dale G. Renlund of the Quorum of the Twelve Apostles explained one reason why Heavenly Father and Jesus Christ encourage us to remember Them: Our Heavenly Father wants us to recall His and His Beloved Son’s goodness … for the influence such remembrance has on us. By considering Their kindness, our perspective and understanding are enlarged. By reflecting on Their compassion, we become more humble, prayerful, and steadfast. (“ Consider the Goodness and Greatness of God ,” Ensign or Liahona , May 2020, 41) How has remembering the goodness of God affected you? Remembering the Savior before, during, and after the sacrament The following activity can help students prepare to remember the Savior before, during, and after the sacrament. You could provide paper and art supplies. Invite students to create something like a poster, pamphlet, meme, or other reminder of the sacrament. Encourage students to be creative in their designs. Students could reserve space on the backs of their papers for the end of the lesson. At the end of the lesson, students will make plans to do something to better remember the Savior before, during, or after the sacrament. To help you remember the goodness of God as you prepare for, participate in, and remember the sacrament ordinance, do one or more of the following: List some of the symbols of the Passover feast that you have studied. Write down how these Passover symbols could help you remember the Savior before you take the sacrament. Read the sacrament prayers in Doctrine and Covenants 20:77, 79 . List the promises we make when we partake of the sacrament. Then list the Lord’s promises. Write a short paragraph of how thinking about these promises could help you remember the Savior during the sacrament. List a few passages of scripture or a statement from a Church leader that you might want to read and ponder during the sacrament. Choose passages or statements that could help you remember the Savior. Select a favorite sacrament hymn. List the title and two or three lines from the hymn. Choose lines that are meaningful to you and could help you remember the Savior after the sacrament. Students might share what they created with a partner, a group, or the class. You could encourage students to add ideas that other class members share. Make a plan to remember the Savior Quietly reflect on what you have learned and felt today. Invite the Holy Ghost to help you recognize something you could do to better remember Jesus Christ before, during, and after the sacrament. Invite students to use some space on the backs of their papers to answer the following question. What are some specific things you could do to better remember the Savior as you prepare for, participate in, and reflect on the sacrament? A few willing students could share what they feel impressed to do. Invite students to take their papers with them to sacrament meeting to help them remember what they have learned and felt. Consider sharing your witness of the power that can come into our lives as we better remember the Savior while preparing for and participating in the sacrament.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 7",
      "content": "1. And theLordsaid unto Moses, See, I have made theeagodto Pharaoh: and Aaron thy brother shall be thyprophet.\n2. Thou shalt speak all that Icommandthee: and Aaron thy brother shall speak unto Pharaoh, that he send the children of Israel out of his land.\n3. AndI will harden Pharaohs heart, and multiply my signs and mywondersin the land of Egypt.\n4. ButPharaoh shall not hearken unto you, that I may lay my hand upon Egypt, and bring forth minearmies,andmy people the children of Israel, out of the land of Egypt by great judgments.\n5. And the Egyptians shallknowthatIamtheLord, when I stretch forth mine hand upon Egypt, and bring out the children of Israel from among them.\n6. And Moses and Aaron did as theLordcommanded them, so did they.\n7. And Moseswasfourscoreyears old, andAaronfourscore and three years old, when they spake unto Pharaoh.\n8. And theLordspake unto Moses and unto Aaron, saying,\n9. When Pharaoh shall speak unto you, saying,Shewamiraclefor you: then thou shalt say unto Aaron, Take thy rod, and castitbefore Pharaoh,andit shall become serpent.\n10. And Moses and Aaron went in unto Pharaoh, and they did so as theLordhad commanded: and Aaron cast down his rod before Pharaoh, and before his servants, and it became serpent.\n11. Then Pharaoh also called the wise men and thesorcerers: now themagiciansof Egypt, they also did in like manner with their enchantments.\n12. For they cast down every man his rod, and they became serpents: but Aarons rod swallowed up their rods.\n13. Andhe hardened Pharaohs heart, that he hearkened not unto them; as theLordhad said.\n14. And theLordsaid unto Moses, Pharaohs heartishardened, he refuseth to let the people go.\n15. Get thee unto Pharaoh in the morning; lo, he goeth out unto the water; and thou shalt stand by the rivers brinkagainst he come; and therodwhich was turned to serpent shalt thou take in thine hand.\n16. And thou shalt say unto him, TheLordGodof the Hebrews hath sent me unto thee, saying, Let my people go, that they mayserveme in the wilderness: and, behold, hitherto thou wouldest not hear.\n17. Thus saith theLord, In this thou shalt know that IamtheLord: behold, I will smite with the rod thatisin mine hand upon the waters whicharein theriver, and they shall beturnedtoblood.\n18. And the fish thatisin the river shall die, and the river shall stink; and the Egyptians shall lothe to drink of the water of the river.\n19. And theLordspake unto Moses, Say unto Aaron, Take thy rod, and stretch out thine hand upon the waters of Egypt, upon their streams, upon their rivers, and upon their ponds, and upon all their pools of water, that they may becomeblood; andthatthere may be blood throughout all the land of Egypt, both invessels ofwood, and invessels ofstone.\n20. And Moses and Aaron did so, as theLordcommanded; and he lifted up therod, and smote the waters thatwerein the river, in the sight of Pharaoh, and in the sight of his servants; and all the waters thatwerein the river were turned toblood.\n21. And the fish thatwasin the river died; and the river stank, and the Egyptians could not drink of the water of the river; and there was blood throughout all the land of Egypt.\n22. And the magicians of Egypt did so with their enchantments: and Pharaohs heart was hardened, neither did he hearken unto them; as theLordhad said.\n23. And Pharaoh turned and went into his house,neitherdid he set his heart to this also.\n24. And all the Egyptians digged round about the river for water to drink; for they could not drink of the water of the river.\n25. And seven days were fulfilled, after that theLordhad smitten the river.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 8",
      "content": "1. And theLordspake unto Moses, Go unto Pharaoh, and say unto him, Thus saith theLord, Let my people go, that they mayserveme.\n2. And if thou refuse to letthemgo, behold, I will smiteall thy borderswithfrogs:\n3. And the river shall bring forth frogs abundantly, which shall go up and come into thine house, and into thy bedchamber, and upon thy bed, and into the house of thy servants, and upon thy people, and into thine ovens, and into thy kneadingtroughs:\n4. And the frogs shall come up both on thee, and upon thy people, and upon all thy servants.\n5. And theLordspake unto Moses, Say unto Aaron, Stretch forth thine hand with thy rod over the streams, over therivers, and over the ponds, and cause frogs to come up upon the land of Egypt.\n6. And Aaron stretched out his hand over the waters of Egypt; and thefrogscame up, and covered the land of Egypt.\n7. And the magicians did so with their enchantments, and brought up frogs upon the land of Egypt.\n8. Then Pharaoh called for Moses and Aaron, and said, Entreat theLord, that he may take away the frogs from me, and from my people; and I will let the people go, that they may do sacrifice unto theLord.\n9. And Moses said unto Pharaoh,Glory over me: whenshall I entreat for thee, and for thy servants, and for thy people, to destroy the frogs from thee and thy houses,thatthey may remain in the river only?\n10. And he said, To morrow. And he said,Be itaccording to thy word: that thou mayest know thatthere isnonelikeunto theLordour God.\n11. And the frogs shall depart from thee, and from thy houses, and fromthy servants, and from thy people; they shall remain in the river only.\n12. And Moses and Aaron went out from Pharaoh: and Moses cried unto theLordbecause of the frogs which he had brought against Pharaoh.\n13. And theLorddid according to the word of Moses; and the frogs died out of the houses, out of the villages, and out of the fields.\n14. And they gathered them together upon heaps: and the land stank.\n15. But when Pharaoh saw that there was respite, hehardenedhis heart, and hearkened not unto them; as theLordhad said.\n16. And theLordsaid unto Moses, Say unto Aaron, Stretch out thy rod, and smite the dust of the land, that it may becomelicethroughout all the land of Egypt.\n17. And they did so; for Aaron stretched out his hand with his rod, and smote the dust of the earth, and it became lice in man, and in beast; all the dust of the land becamelicethroughout all the land of Egypt.\n18. And the magicians did so with their enchantments tobring forth lice, but they could not: so there were lice upon man, and upon beast.\n19. Then the magicians said unto Pharaoh, Thisisthefingerof God: and Pharaohs heart was hardened, and he hearkened not unto them; as theLordhad said.\n20. And theLordsaid unto Moses, Rise up early in the morning, and stand before Pharaoh;lo, he cometh forth to the water; and say unto him, Thus saith theLord, Let my people go, that they may serve me.\n21. Else, if thou wilt not let my people go, behold, I will send swarmsoffliesupon thee, and upon thy servants, and upon thy people, and into thy houses: and the houses of the Egyptians shall be full of swarmsof flies,and also the ground whereon theyare.\n22. And I willseverin that day the land of Goshen, in which my people dwell, thatnoswarmsof fliesshall be there; to the end thou mayest know that IamtheLordin the midst of the earth.\n23. And I will put division between my people and thy people: to morrow shall this sign be.\n24. And theLorddid so; and there came grievous swarmof fliesinto the house of Pharaoh, andintohis servants houses, and into all the land of Egypt: the land wascorruptedby reason of the swarmof flies.\n25. And Pharaoh called for Moses and for Aaron, and said, Go ye, sacrifice to your God in the land.\n26. And Moses said, Itis not meetso to do; for we shall sacrificethe abomination ofthe Egyptians to theLordour God: lo, shall we sacrifice the abomination of the Egyptians before their eyes, and will they not stone us?\n27. We will go three days journey into the wilderness, and sacrifice to theLordour God, as he shall command us.\n28. And Pharaoh said, I will let you go, that ye may sacrifice to theLordyour God in the wilderness; only ye shall not go very far away: entreat for me.\n29. And Moses said, Behold, I go out from thee, and I will entreat theLordthat the swarmsof fliesmay depart from Pharaoh, from his servants, and from his people, to morrow: but let not Pharaoh deal deceitfully any more in not letting the people go to sacrifice to theLord.\n30. And Moses went out from Pharaoh, and entreated theLord.\n31. And theLorddid according to the word of Moses; and he removedthe swarmsof fliesfrom Pharaoh, from his servants, and from his people; there remained not one.\n32. And Pharaoh hardened his heart at this time also, neither would he let the people go.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 9",
      "content": "1. Then theLordsaid unto Moses, Go in unto Pharaoh, and tell him, Thus saith theLordGod of the Hebrews, Let my people go, that they may serve me.\n2. For if thou refuse to letthemgo, and wilt hold them still,\n3. Behold, the hand of theLordis upon thy cattle whichisin the field, upon the horses, upon the asses, upon the camels, upon the oxen, and upon the sheep:there shall bea verygrievousmurrain.\n4. And theLordshallsever betweenthe cattle of Israel and the cattle of Egypt: and there shall nothing die of allthat isthe childrens of Israel.\n5. And theLordappointed set time, saying, To morrow theLordshall do this thing in the land.\n6. And theLorddid that thing on the morrow, and all the cattle of Egypt died: but of the cattle of the children of Israel died not one.\n7. And Pharaoh sent, and, behold, there was not one of the cattle of the Israelites dead. And the heart of Pharaoh was hardened, and he did not let the people go.\n8. And theLordsaid unto Moses and unto Aaron, Take to you handfuls of ashes of the furnace, and let Moses sprinkle it toward the heaven in the sight of Pharaoh.\n9. And it shall become small dust in all the land of Egypt, and shall beaboilbreaking forthwithblainsupon man, and upon beast, throughout all the land of Egypt.\n10. And they took ashes of the furnace, and stood before Pharaoh; and Moses sprinkled it up toward heaven; and it became boil breaking forthwithblains upon man, and upon beast.\n11. And the magicians could not stand before Moses because of the boils; for the boil was upon the magicians, and upon all the Egyptians.\n12. AndtheLordhardened the heart of Pharaoh, and he hearkened not unto them; as theLordhad spoken unto Moses.\n13. And theLordsaid unto Moses, Rise up early in the morning, and stand before Pharaoh, and say unto him, Thus saith theLordGod of the Hebrews, Let my people go, that they may serve me.\n14. For I will at this time send all myplaguesupon thine heart, and upon thy servants, and upon thy people; that thou mayest know thatthere isnone like me in all the earth.\n15. For now I will stretch out my hand, that I may smite thee and thy people with pestilence; and thou shalt be cut off from the earth.\n16. And in very deed for thiscausehave Iraised thee up, for toshewintheemy power; and that mynamemay bedeclaredthroughout all the earth.\n17. As yetexaltestthou thyself against my people, that thou wilt not let them go?\n18. Behold, to morrow about this time I will cause it to rain very grievoushail, such as hath not beenin Egypt since the foundation thereof even until now.\n19. Send therefore now,andgather thy cattle, and all that thou hast in the field;for uponevery man and beast which shall be found in the field, and shall not be brought home, the hail shall come down upon them, and they shall die.\n20. He that feared the word of theLordamong the servants of Pharaoh made his servants and his cattle flee into the houses:\n21. And he that regarded not the word of theLordleft his servants and his cattle in the field.\n22. And theLordsaid unto Moses, Stretch forth thine hand toward heaven, that there may be hail in all the land of Egypt, upon man, and upon beast, and upon every herb of the field, throughout the land of Egypt.\n23. And Moses stretched forth his rod toward heaven: and theLordsent thunder andhail, and the fire ran along upon the ground; and theLordrained hail upon the land of Egypt.\n24. So there was hail, andfiremingled with the hail, very grievous, such as there was none like it in all the land of Egypt since it became nation.\n25. And thehailsmote throughout all the land of Egypt all thatwasin the field, both man and beast; and the hail smote every herb of the field, and brake every tree of the field.\n26. Only in the land of Goshen, where the children of Israelwere,was there no hail.\n27. And Pharaoh sent, and called for Moses and Aaron, and said unto them, I have sinned this time: theLordisrighteous, and I and my peoplearewicked.\n28. Entreat theLord(forit isenough) that there be nomoremighty thunderings and hail; and I will let you go, and ye shall stay no longer.\n29. And Moses said unto him, As soon as I am gone out of the city, I willspread abroadmy hands unto theLord;andthe thunder shall cease, neither shall there be any more hail; that thou mayest know how that theearthistheLords.\n30. But as for thee and thy servants, I know that ye will not yet fear theLordGod.\n31. And the flax and the barley was smitten: for the barleywasin the ear, and the flaxwasbolled.\n32. But thewheatand theriewere not smitten: for theywerenot grown up.\n33. And Moses went out of the city from Pharaoh, and spread abroad his hands unto theLord: and the thunders and hail ceased, and the rain was not poured upon the earth.\n34. And when Pharaoh saw that the rain and the hail and the thunders were ceased, he sinned yet more, and hardened his heart, he and his servants.\n35. And the heart of Pharaoh was hardened, neither would he let the children of Israel go; as theLordhad spoken by Moses.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 10",
      "content": "1. And theLordsaid unto Moses, Go in unto Pharaoh:forI have hardened his heart, and the heart of his servants, that I might shew these my signs before him:\n2. And that thou mayesttellin the ears of thy son, and of thy sons son, what things I have wrought inEgypt, and my signs which I have done among them; that ye may know how that IamtheLord.\n3. And Moses and Aaron came in unto Pharaoh, and said unto him, Thus saith theLordGod of the Hebrews, How long wilt thou refuse tohumblethyself before me? let my people go, that they may serve me.\n4. Else, if thou refuse to let my people go, behold, to morrow will I bring thelocustsinto thy coast:\n5. And they shall cover the face of the earth, that one cannot be able to see the earth: and they shall eat theresidueof that which is escaped, which remaineth unto you from the hail, and shall eat every tree which groweth for you out of the field:\n6. And they shall fill thy houses, and the houses of all thy servants, and the houses of all the Egyptians; which neither thy fathers, nor thy fathers fathers have seen, since the day that they were upon the earth unto this day. And he turned himself, and went out from Pharaoh.\n7. And Pharaohs servants said unto him, How long shall this man be asnareunto us? let the men go, that they may serve theLordtheir God: knowest thou not yet that Egypt isdestroyed?\n8. And Moses and Aaron were brought again unto Pharaoh: and he said unto them, Go, serve theLordyour God:butwhoarethey that shall go?\n9. And Moses said, We will go with our young and with ourold, with our sons and with our daughters, with our flocks and with our herds will we go; for wemust holdafeastunto theLord.\n10. And he said unto them, Let theLordbe so with you,asI will let you go, and your little ones: lookto it;forevilisbefore you.\n11. Not so: go now yethat aremen, and serve theLord; for that ye did desire. And they were driven out from Pharaohs presence.\n12. And theLordsaid unto Moses, Stretch out thine hand over the land of Egypt for the locusts, that they may come up upon the land of Egypt, and eat every herb of the land,evenall that the hail hath left.\n13. And Moses stretched forth his rod over the land of Egypt, and theLordbrought an east wind upon the land all that day, and allthatnight;andwhen it was morning, the east wind brought the locusts.\n14. And thelocustswent up over all the land of Egypt, and restedin all the coastsof Egypt: very grievouswere they;before them there were no such locusts as they, neither after them shall be such.\n15. For they covered the face of the whole earth, so that the land was darkened; and they did eat every herb of the land, and all the fruit of the trees which the hail had left: and there remained not any green thing in the trees, or in the herbs of the field, through all the land of Egypt.\n16. Then Pharaoh called for Moses and Aaron in haste; and he said, I have sinned against theLordyour God, and against you.\n17. Now therefore forgive, I pray thee, my sin only this once, and entreat theLordyour God, that he may take away from me this death only.\n18. And he went out from Pharaoh, and entreated theLord.\n19. And theLordturned mighty strong west wind, which took away the locusts, and cast them into theRed sea; there remained not one locust in all the coasts of Egypt.\n20. ButtheLordhardened Pharaohs heart, so that he would not let the children of Israel go.\n21. And theLordsaid untoMoses, Stretch out thine hand toward heaven, that there may bedarknessover the land of Egypt, even darknesswhichmay befelt.\n22. And Moses stretched forth his hand toward heaven; and there was thickdarknessin all the land of Egypt three days:\n23. They saw not one another, neither rose any from his place for three days: but all the children of Israel had light in their dwellings.\n24. And Pharaoh called unto Moses, and said, Go ye, serve theLord; only let your flocks and your herdsbe stayed: let your little ones also go with you.\n25. And Moses said, Thou mustgive us alsosacrifices and burnt offerings, that we may sacrifice unto theLordour God.\n26. Our cattle also shall go with us; there shall not an hoof be left behind; for thereof must we take to serve theLordour God; and we know not with what we must serve theLord, until we come thither.\n27. ButtheLordhardened Pharaohs heart, and he would not let them go.\n28. And Pharaoh said unto him, Get thee from me, take heed to thyself, see my face no more; for inthatday thou seest my face thou shalt die.\n29. And Moses said,Thou hast spoken well, I will see thy face again no more.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 11",
      "content": "1. And theLordsaid unto Moses, Yet will I bring one plaguemoreupon Pharaoh, and upon Egypt; afterwards he will let you go hence: when he shall letyougo, he shall surelythrustyou out hence altogether.\n2. Speak now in the ears of the people, and let every manborrowof his neighbour, and every woman of her neighbour,jewelsof silver, and jewels of gold.\n3. And theLordgave the peoplefavourin the sight of the Egyptians. Moreover the man Moseswasvery great in the land of Egypt, in the sight of Pharaohs servants, and in the sight of the people.\n4. And Moses said, Thus saith theLord, About midnight will I go out into the midst of Egypt:\n5. And all thefirstbornin the land of Egypt shall die, from thefirstbornof Pharaoh that sitteth upon his throne, even unto the firstborn of the maidservant thatisbehind the mill; and all the firstborn of beasts.\n6. And there shall be great cry throughout all the land of Egypt, such as there was none like it, nor shall be like it any more.\n7. But against any of the children of Israel shall not dog move his tongue, against man or beast: that ye may know how that theLorddoth put adifferencebetween the Egyptians and Israel.\n8. And all these thy servants shall come down unto me, and bow down themselves unto me, saying, Get thee out, and all the people that follow thee: and after that I will go out. And he went out from Pharaoh in greatanger.\n9. And theLordsaid unto Moses, Pharaoh shall not hearken unto you; that my wonders may be multiplied in the land of Egypt.\n10. And Moses and Aaron did all these wonders before Pharaoh:andtheLordhardened Pharaohs heart,so that he would not let the children of Israel go out of his land.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 12",
      "content": "1. And theLordspake unto Moses and Aaron in the land of Egypt, saying,\n2. Thismonthshall beunto you thebeginningof months: itshall bethe first month of the year to you.\n3. Speak ye unto all the congregation of Israel, saying, In the tenthdayof this month they shall take to them every man lamb, according to the house oftheirfathers, lamb for an house:\n4. And if the household be too little for the lamb, let him and his neighbour next unto his house takeitaccording to the number of the souls; every man according to hiseatingshall make your count for the lamb.\n5. Yourlambshall be without blemish, maleof the first year: ye shall takeitout from the sheep, or from the goats:\n6. And ye shall keep it up until thefourteenthday of the same month: and the whole assembly of the congregation of Israel shall kill it in the evening.\n7. And they shall take of the blood, and strikeiton the two side posts and on the upper door post of the houses, wherein they shall eat it.\n8. And they shall eat the flesh in that night, roast with fire, andunleavenedbread;andwith bitterherbsthey shall eat it.\n9. Eat not of it raw, norsoddenat all with water, but roastwithfire; his head with his legs, and with thepurtenancethereof.\n10. And ye shall let nothing of itremainuntil the morning; and that which remaineth of it until the morning ye shall burn with fire.\n11. And thus shall ye eat it;withyour loinsgirded, your shoes on your feet, and your staff in your hand; and ye shall eat it inhaste: itistheLords passover.\n12. For I will pass through the land of Egypt this night, and will smite all thefirstbornin the land of Egypt, both man and beast; and against all thegodsof Egypt I will executejudgment: IamtheLord.\n13. And the blood shall be to you for atokenupon the houses where yeare:and when I see the blood, I will pass over you, and the plague shall not be upon you to destroyyou,when I smite the land of Egypt.\n14. And thisdayshall be unto you for amemorial; and ye shall keep it afeastto theLordthroughout your generations; ye shall keep it afeastby an ordinancefor ever.\n15. Seven days shall ye eatunleavenedbread; even the first day ye shall put away leaven out of your houses: for whosoever eateth leavened bread from the first day until the seventh day, that soul shall becut offfrom Israel.\n16. And in the first daythere shall bean holyconvocation, and in theseventh daythere shall be an holy convocation to you; no manner of work shall be done in them, savethatwhich every man must eat, that only may be done of you.\n17. And ye shall observethefeastofunleavenedbread; for in this selfsame day have I brought yourarmiesout of the land of Egypt: therefore shall ye observe this day in your generationsbyan ordinance for ever.\n18. In the firstmonth,on the fourteenth day of the month at even, ye shall eat unleavened bread, until the one and twentieth day of the month at even.\n19. Seven days shall there be no leaven found in your houses: for whosoever eateth that which is leavened, even that soul shall be cut off from the congregation of Israel, whether he be astranger, or born in the land.\n20. Ye shall eat nothing leavened; in all your habitations shall ye eat unleavened bread.\n21. Then Moses called for all the elders of Israel, and said unto them,Drawout and take you alambaccording to yourfamilies, and kill thepassover.\n22. And ye shall take bunch of hyssop, and dipitin the blood thatisin the basin, and strike the lintel and the two side posts with thebloodthatisin the basin; and none of you shall go out at the door of his house until the morning.\n23. For theLordwillpassthrough to smite the Egyptians; and when he seeth the blood upon the lintel, and on the two side posts, theLordwillpassover the door, and will notsufferthedestroyerto come in unto your houses to smiteyou.\n24. And ye shall observe this thing for an ordinance to thee and to thy sons for ever.\n25. And it shall come to pass, when ye be come to the land which theLordwill give you, according as he hath promised, that ye shall keep this service.\n26. And it shall come to pass, when yourchildrenshall say unto you, What mean ye by this service?\n27. That ye shall say, Itisthesacrificeof theLordspassover, who passed over the houses of the children of Israel in Egypt, when he smote the Egyptians, anddeliveredour houses. And the people bowed the head and worshipped.\n28. And the children of Israel went away, and did as theLordhadcommandedMoses and Aaron, so did they.\n29. And it came to pass, that at midnight theLordsmoteall thefirstbornin the land of Egypt, from the firstborn of Pharaoh that sat on his throne unto the firstborn of the captive thatwasin the dungeon; and all the firstborn of cattle.\n30. And Pharaoh rose up in the night, he, and all his servants, and all the Egyptians; and there was great cry in Egypt; forthere wasnot house wherethere wasnot onedead.\n31. And he called for Moses and Aaron by night, and said, Rise up,andget youforthfrom among my people, both ye and the children of Israel; and go, serve theLord, as ye have said.\n32. Also take your flocks and yourherds, as ye have said, and be gone; and bless me also.\n33. And the Egyptians wereurgentupon the people, that they might send them out of the land in haste; for they said, Webeall deadmen.\n34. And the people took their dough before it was leavened, their kneadingtroughs being bound up in their clothes upon their shoulders.\n35. And the children of Israel did according to the word of Moses; and theyborrowedof the Egyptians jewels ofsilver, and jewels of gold, andraiment:\n36. And theLordgave the peoplefavourin the sight of the Egyptians, so that theylent unto themsuch things as they required.And theyspoiledthe Egyptians.\n37. And the children of IsraeljourneyedfromRamesesto Succoth, aboutsix hundred thousandon footthat weremen, beside children.\n38. Anda mixed multitudewent up also with them; and flocks, and herds,evenvery much cattle.\n39. And they bakedunleavenedcakes of the dough which they brought forth out of Egypt, for it was not leavened; because they werethrustout of Egypt, and could not tarry, neither had they prepared for themselves anyvictual.\n40. Now thesojourningof the children of Israel, who dwelt in Egypt,wasfour hundred and thirty years.\n41. And it came to pass at the end of the four hundred and thirty years, even the selfsame day it came to pass, that all the hosts of theLordwent out from the land of Egypt.\n42. Itisa nighttobe muchobservedunto theLordfor bringing them out from the land of Egypt: thisisthat night of theLordto be observed of all the children ofIsraelin their generations.\n43. And theLordsaid unto Moses and Aaron, Thisisthe ordinance of thepassover: There shall nostrangereat thereof:\n44. But every mans servant that isboughtfor money, when thou hast circumcised him, then shall he eat thereof.\n45. A foreigner and an hired servant shall not eat thereof.\n46. In one house shall it be eaten; thou shalt not carry forthoughtof the fleshabroadout of the house; neither shall yebreakabonethereof.\n47. All the congregation of Israel shall keep it.\n48. And when stranger shall sojourn with thee, and will keep the passover to theLord, let all his males becircumcised, and then let him come near and keep it; and he shall be as one that isbornin the land: for no uncircumcised person shall eat thereof.\n49. One law shall be to him that is homeborn, and unto the stranger that sojourneth among you.\n50. Thus did all the children of Israel; as theLordcommanded Moses and Aaron, so did they.\n51. And it came to pass the selfsame day,thattheLorddidbringthe children of Israel out of the land of Egypt by their armies.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Exodus 13",
      "content": "1. And theLordspake unto Moses, saying,\n2. Sanctifyunto me all thefirstborn, whatsoeveropeneththewombamong the children of Israel,bothof man and of beast: itismine.\n3. And Moses said unto the people, Remember this day, in which ye came out fromEgypt, out of the house of bondage; for by strength of hand theLordbrought you out from thisplace:there shall no leavened bread be eaten.\n4. This daycame ye outinthemonthAbib.\n5. And it shall be when theLordshallbringthee into the land of theCanaanites, and the Hittites, and the Amorites, and the Hivites, and the Jebusites, which heswareunto thy fathers to give thee, landflowingwith milk and honey, that thou shalt keep this service in this month.\n6. Seven days thou shalt eat unleavened bread, and in the seventh dayshall bea feast to theLord.\n7. Unleavened bread shall be eaten seven days; and there shall noleavenedbread be seen with thee, neither shall there beleavenseen with theein all thy quarters.\n8. And thou shaltshewthy son in that day, saying,This is donebecause of thatwhichtheLorddid unto me when I came forth out of Egypt.\n9. And it shall be for asignunto thee upon thine hand, and for amemorialbetween thine eyes, that theLords law may be in thy mouth: for with strong hand hath theLordbrought thee out of Egypt.\n10. Thou shalt therefore keep this ordinancein his seasonfrom year to year.\n11. And it shall be when theLordshall bring thee into the land of theCanaanites, as heswareunto thee and to thy fathers, and shall give it thee,\n12. That thou shalt set apart unto theLordallthat openeth the matrix, and everyfirstlingthat cometh of beast which thou hast; the malesshall betheLords.\n13. And every firstling of an ass thou shalt redeem with lamb; and if thou wilt not redeem it, then thou shalt break his neck: and all thefirstbornof man among thy children shalt thou redeem.\n14. And it shall be when thysonaskeththee in time to come, saying, Whatisthis? that thou shalt say unto him, By strength of hand theLordbroughtus out from Egypt, from the house ofbondage:\n15. And it came to pass, when Pharaoh would hardly let us go, that theLordslewall the firstborn in the land of Egypt, both the firstborn of man, and the firstborn of beast: therefore I sacrifice to theLordall that openeth the matrix, being males; but all the firstborn of my children I redeem.\n16. And it shall be for token upon thine hand, and forfrontletsbetween thine eyes: for by strength of hand theLordbrought us forth out of Egypt.\n17. And it came to pass, when Pharaoh had let the people go, that God led them notthroughthe way of the land of the Philistines, although thatwasnear; for God said, Lestperadventurethe peoplerepentwhen they see war, and theyreturnto Egypt:\n18. But Godledthe people about,throughthe way of the wilderness of the Red sea: and the children ofIsraelwent upharnessedout of the land of Egypt.\n19. And Moses took the bones ofJosephwith him: for he had straitly sworn the children of Israel, saying, God will surely visit you; and ye shall carry up mybonesaway hence with you.\n20. And they took their journey fromSuccoth, and encamped in Etham, in the edge of the wilderness.\n21. And theLordwent before them by day in pillar of acloud, toleadthem the way; and by night in apillarof fire, to give them light; to go by day and night:\n22. He took not away the pillar of the cloud by day, nor the pillar of fire by night,frombefore the people.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Exodus": {
      "7": {
        "verses": {
          "1": {
            "text": "And theLordsaid unto Moses, See, I have made theeagodto Pharaoh: and Aaron thy brother shall be thyprophet.",
            "citation": "(Exodus 7:1)"
          },
          "2": {
            "text": "Thou shalt speak all that Icommandthee: and Aaron thy brother shall speak unto Pharaoh, that he send the children of Israel out of his land.",
            "citation": "(Exodus 7:2)"
          },
          "3": {
            "text": "AndI will harden Pharaohs heart, and multiply my signs and mywondersin the land of Egypt.",
            "citation": "(Exodus 7:3)"
          },
          "4": {
            "text": "ButPharaoh shall not hearken unto you, that I may lay my hand upon Egypt, and bring forth minearmies,andmy people the children of Israel, out of the land of Egypt by great judgments.",
            "citation": "(Exodus 7:4)"
          },
          "5": {
            "text": "And the Egyptians shallknowthatIamtheLord, when I stretch forth mine hand upon Egypt, and bring out the children of Israel from among them.",
            "citation": "(Exodus 7:5)"
          },
          "6": {
            "text": "And Moses and Aaron did as theLordcommanded them, so did they.",
            "citation": "(Exodus 7:6)"
          },
          "7": {
            "text": "And Moseswasfourscoreyears old, andAaronfourscore and three years old, when they spake unto Pharaoh.",
            "citation": "(Exodus 7:7)"
          },
          "8": {
            "text": "And theLordspake unto Moses and unto Aaron, saying,",
            "citation": "(Exodus 7:8)"
          },
          "9": {
            "text": "When Pharaoh shall speak unto you, saying,Shewamiraclefor you: then thou shalt say unto Aaron, Take thy rod, and castitbefore Pharaoh,andit shall become serpent.",
            "citation": "(Exodus 7:9)"
          },
          "10": {
            "text": "And Moses and Aaron went in unto Pharaoh, and they did so as theLordhad commanded: and Aaron cast down his rod before Pharaoh, and before his servants, and it became serpent.",
            "citation": "(Exodus 7:10)"
          },
          "11": {
            "text": "Then Pharaoh also called the wise men and thesorcerers: now themagiciansof Egypt, they also did in like manner with their enchantments.",
            "citation": "(Exodus 7:11)"
          },
          "12": {
            "text": "For they cast down every man his rod, and they became serpents: but Aarons rod swallowed up their rods.",
            "citation": "(Exodus 7:12)"
          },
          "13": {
            "text": "Andhe hardened Pharaohs heart, that he hearkened not unto them; as theLordhad said.",
            "citation": "(Exodus 7:13)"
          },
          "14": {
            "text": "And theLordsaid unto Moses, Pharaohs heartishardened, he refuseth to let the people go.",
            "citation": "(Exodus 7:14)"
          },
          "15": {
            "text": "Get thee unto Pharaoh in the morning; lo, he goeth out unto the water; and thou shalt stand by the rivers brinkagainst he come; and therodwhich was turned to serpent shalt thou take in thine hand.",
            "citation": "(Exodus 7:15)"
          },
          "16": {
            "text": "And thou shalt say unto him, TheLordGodof the Hebrews hath sent me unto thee, saying, Let my people go, that they mayserveme in the wilderness: and, behold, hitherto thou wouldest not hear.",
            "citation": "(Exodus 7:16)"
          },
          "17": {
            "text": "Thus saith theLord, In this thou shalt know that IamtheLord: behold, I will smite with the rod thatisin mine hand upon the waters whicharein theriver, and they shall beturnedtoblood.",
            "citation": "(Exodus 7:17)"
          },
          "18": {
            "text": "And the fish thatisin the river shall die, and the river shall stink; and the Egyptians shall lothe to drink of the water of the river.",
            "citation": "(Exodus 7:18)"
          },
          "19": {
            "text": "And theLordspake unto Moses, Say unto Aaron, Take thy rod, and stretch out thine hand upon the waters of Egypt, upon their streams, upon their rivers, and upon their ponds, and upon all their pools of water, that they may becomeblood; andthatthere may be blood throughout all the land of Egypt, both invessels ofwood, and invessels ofstone.",
            "citation": "(Exodus 7:19)"
          },
          "20": {
            "text": "And Moses and Aaron did so, as theLordcommanded; and he lifted up therod, and smote the waters thatwerein the river, in the sight of Pharaoh, and in the sight of his servants; and all the waters thatwerein the river were turned toblood.",
            "citation": "(Exodus 7:20)"
          },
          "21": {
            "text": "And the fish thatwasin the river died; and the river stank, and the Egyptians could not drink of the water of the river; and there was blood throughout all the land of Egypt.",
            "citation": "(Exodus 7:21)"
          },
          "22": {
            "text": "And the magicians of Egypt did so with their enchantments: and Pharaohs heart was hardened, neither did he hearken unto them; as theLordhad said.",
            "citation": "(Exodus 7:22)"
          },
          "23": {
            "text": "And Pharaoh turned and went into his house,neitherdid he set his heart to this also.",
            "citation": "(Exodus 7:23)"
          },
          "24": {
            "text": "And all the Egyptians digged round about the river for water to drink; for they could not drink of the water of the river.",
            "citation": "(Exodus 7:24)"
          },
          "25": {
            "text": "And seven days were fulfilled, after that theLordhad smitten the river.",
            "citation": "(Exodus 7:25)"
          }
        }
      },
      "8": {
        "verses": {
          "1": {
            "text": "And theLordspake unto Moses, Go unto Pharaoh, and say unto him, Thus saith theLord, Let my people go, that they mayserveme.",
            "citation": "(Exodus 8:1)"
          },
          "2": {
            "text": "And if thou refuse to letthemgo, behold, I will smiteall thy borderswithfrogs:",
            "citation": "(Exodus 8:2)"
          },
          "3": {
            "text": "And the river shall bring forth frogs abundantly, which shall go up and come into thine house, and into thy bedchamber, and upon thy bed, and into the house of thy servants, and upon thy people, and into thine ovens, and into thy kneadingtroughs:",
            "citation": "(Exodus 8:3)"
          },
          "4": {
            "text": "And the frogs shall come up both on thee, and upon thy people, and upon all thy servants.",
            "citation": "(Exodus 8:4)"
          },
          "5": {
            "text": "And theLordspake unto Moses, Say unto Aaron, Stretch forth thine hand with thy rod over the streams, over therivers, and over the ponds, and cause frogs to come up upon the land of Egypt.",
            "citation": "(Exodus 8:5)"
          },
          "6": {
            "text": "And Aaron stretched out his hand over the waters of Egypt; and thefrogscame up, and covered the land of Egypt.",
            "citation": "(Exodus 8:6)"
          },
          "7": {
            "text": "And the magicians did so with their enchantments, and brought up frogs upon the land of Egypt.",
            "citation": "(Exodus 8:7)"
          },
          "8": {
            "text": "Then Pharaoh called for Moses and Aaron, and said, Entreat theLord, that he may take away the frogs from me, and from my people; and I will let the people go, that they may do sacrifice unto theLord.",
            "citation": "(Exodus 8:8)"
          },
          "9": {
            "text": "And Moses said unto Pharaoh,Glory over me: whenshall I entreat for thee, and for thy servants, and for thy people, to destroy the frogs from thee and thy houses,thatthey may remain in the river only?",
            "citation": "(Exodus 8:9)"
          },
          "10": {
            "text": "And he said, To morrow. And he said,Be itaccording to thy word: that thou mayest know thatthere isnonelikeunto theLordour God.",
            "citation": "(Exodus 8:10)"
          },
          "11": {
            "text": "And the frogs shall depart from thee, and from thy houses, and fromthy servants, and from thy people; they shall remain in the river only.",
            "citation": "(Exodus 8:11)"
          },
          "12": {
            "text": "And Moses and Aaron went out from Pharaoh: and Moses cried unto theLordbecause of the frogs which he had brought against Pharaoh.",
            "citation": "(Exodus 8:12)"
          },
          "13": {
            "text": "And theLorddid according to the word of Moses; and the frogs died out of the houses, out of the villages, and out of the fields.",
            "citation": "(Exodus 8:13)"
          },
          "14": {
            "text": "And they gathered them together upon heaps: and the land stank.",
            "citation": "(Exodus 8:14)"
          },
          "15": {
            "text": "But when Pharaoh saw that there was respite, hehardenedhis heart, and hearkened not unto them; as theLordhad said.",
            "citation": "(Exodus 8:15)"
          },
          "16": {
            "text": "And theLordsaid unto Moses, Say unto Aaron, Stretch out thy rod, and smite the dust of the land, that it may becomelicethroughout all the land of Egypt.",
            "citation": "(Exodus 8:16)"
          },
          "17": {
            "text": "And they did so; for Aaron stretched out his hand with his rod, and smote the dust of the earth, and it became lice in man, and in beast; all the dust of the land becamelicethroughout all the land of Egypt.",
            "citation": "(Exodus 8:17)"
          },
          "18": {
            "text": "And the magicians did so with their enchantments tobring forth lice, but they could not: so there were lice upon man, and upon beast.",
            "citation": "(Exodus 8:18)"
          },
          "19": {
            "text": "Then the magicians said unto Pharaoh, Thisisthefingerof God: and Pharaohs heart was hardened, and he hearkened not unto them; as theLordhad said.",
            "citation": "(Exodus 8:19)"
          },
          "20": {
            "text": "And theLordsaid unto Moses, Rise up early in the morning, and stand before Pharaoh;lo, he cometh forth to the water; and say unto him, Thus saith theLord, Let my people go, that they may serve me.",
            "citation": "(Exodus 8:20)"
          },
          "21": {
            "text": "Else, if thou wilt not let my people go, behold, I will send swarmsoffliesupon thee, and upon thy servants, and upon thy people, and into thy houses: and the houses of the Egyptians shall be full of swarmsof flies,and also the ground whereon theyare.",
            "citation": "(Exodus 8:21)"
          },
          "22": {
            "text": "And I willseverin that day the land of Goshen, in which my people dwell, thatnoswarmsof fliesshall be there; to the end thou mayest know that IamtheLordin the midst of the earth.",
            "citation": "(Exodus 8:22)"
          },
          "23": {
            "text": "And I will put division between my people and thy people: to morrow shall this sign be.",
            "citation": "(Exodus 8:23)"
          },
          "24": {
            "text": "And theLorddid so; and there came grievous swarmof fliesinto the house of Pharaoh, andintohis servants houses, and into all the land of Egypt: the land wascorruptedby reason of the swarmof flies.",
            "citation": "(Exodus 8:24)"
          },
          "25": {
            "text": "And Pharaoh called for Moses and for Aaron, and said, Go ye, sacrifice to your God in the land.",
            "citation": "(Exodus 8:25)"
          },
          "26": {
            "text": "And Moses said, Itis not meetso to do; for we shall sacrificethe abomination ofthe Egyptians to theLordour God: lo, shall we sacrifice the abomination of the Egyptians before their eyes, and will they not stone us?",
            "citation": "(Exodus 8:26)"
          },
          "27": {
            "text": "We will go three days journey into the wilderness, and sacrifice to theLordour God, as he shall command us.",
            "citation": "(Exodus 8:27)"
          },
          "28": {
            "text": "And Pharaoh said, I will let you go, that ye may sacrifice to theLordyour God in the wilderness; only ye shall not go very far away: entreat for me.",
            "citation": "(Exodus 8:28)"
          },
          "29": {
            "text": "And Moses said, Behold, I go out from thee, and I will entreat theLordthat the swarmsof fliesmay depart from Pharaoh, from his servants, and from his people, to morrow: but let not Pharaoh deal deceitfully any more in not letting the people go to sacrifice to theLord.",
            "citation": "(Exodus 8:29)"
          },
          "30": {
            "text": "And Moses went out from Pharaoh, and entreated theLord.",
            "citation": "(Exodus 8:30)"
          },
          "31": {
            "text": "And theLorddid according to the word of Moses; and he removedthe swarmsof fliesfrom Pharaoh, from his servants, and from his people; there remained not one.",
            "citation": "(Exodus 8:31)"
          },
          "32": {
            "text": "And Pharaoh hardened his heart at this time also, neither would he let the people go.",
            "citation": "(Exodus 8:32)"
          }
        }
      },
      "9": {
        "verses": {
          "1": {
            "text": "Then theLordsaid unto Moses, Go in unto Pharaoh, and tell him, Thus saith theLordGod of the Hebrews, Let my people go, that they may serve me.",
            "citation": "(Exodus 9:1)"
          },
          "2": {
            "text": "For if thou refuse to letthemgo, and wilt hold them still,",
            "citation": "(Exodus 9:2)"
          },
          "3": {
            "text": "Behold, the hand of theLordis upon thy cattle whichisin the field, upon the horses, upon the asses, upon the camels, upon the oxen, and upon the sheep:there shall bea verygrievousmurrain.",
            "citation": "(Exodus 9:3)"
          },
          "4": {
            "text": "And theLordshallsever betweenthe cattle of Israel and the cattle of Egypt: and there shall nothing die of allthat isthe childrens of Israel.",
            "citation": "(Exodus 9:4)"
          },
          "5": {
            "text": "And theLordappointed set time, saying, To morrow theLordshall do this thing in the land.",
            "citation": "(Exodus 9:5)"
          },
          "6": {
            "text": "And theLorddid that thing on the morrow, and all the cattle of Egypt died: but of the cattle of the children of Israel died not one.",
            "citation": "(Exodus 9:6)"
          },
          "7": {
            "text": "And Pharaoh sent, and, behold, there was not one of the cattle of the Israelites dead. And the heart of Pharaoh was hardened, and he did not let the people go.",
            "citation": "(Exodus 9:7)"
          },
          "8": {
            "text": "And theLordsaid unto Moses and unto Aaron, Take to you handfuls of ashes of the furnace, and let Moses sprinkle it toward the heaven in the sight of Pharaoh.",
            "citation": "(Exodus 9:8)"
          },
          "9": {
            "text": "And it shall become small dust in all the land of Egypt, and shall beaboilbreaking forthwithblainsupon man, and upon beast, throughout all the land of Egypt.",
            "citation": "(Exodus 9:9)"
          },
          "10": {
            "text": "And they took ashes of the furnace, and stood before Pharaoh; and Moses sprinkled it up toward heaven; and it became boil breaking forthwithblains upon man, and upon beast.",
            "citation": "(Exodus 9:10)"
          },
          "11": {
            "text": "And the magicians could not stand before Moses because of the boils; for the boil was upon the magicians, and upon all the Egyptians.",
            "citation": "(Exodus 9:11)"
          },
          "12": {
            "text": "AndtheLordhardened the heart of Pharaoh, and he hearkened not unto them; as theLordhad spoken unto Moses.",
            "citation": "(Exodus 9:12)"
          },
          "13": {
            "text": "And theLordsaid unto Moses, Rise up early in the morning, and stand before Pharaoh, and say unto him, Thus saith theLordGod of the Hebrews, Let my people go, that they may serve me.",
            "citation": "(Exodus 9:13)"
          },
          "14": {
            "text": "For I will at this time send all myplaguesupon thine heart, and upon thy servants, and upon thy people; that thou mayest know thatthere isnone like me in all the earth.",
            "citation": "(Exodus 9:14)"
          },
          "15": {
            "text": "For now I will stretch out my hand, that I may smite thee and thy people with pestilence; and thou shalt be cut off from the earth.",
            "citation": "(Exodus 9:15)"
          },
          "16": {
            "text": "And in very deed for thiscausehave Iraised thee up, for toshewintheemy power; and that mynamemay bedeclaredthroughout all the earth.",
            "citation": "(Exodus 9:16)"
          },
          "17": {
            "text": "As yetexaltestthou thyself against my people, that thou wilt not let them go?",
            "citation": "(Exodus 9:17)"
          },
          "18": {
            "text": "Behold, to morrow about this time I will cause it to rain very grievoushail, such as hath not beenin Egypt since the foundation thereof even until now.",
            "citation": "(Exodus 9:18)"
          },
          "19": {
            "text": "Send therefore now,andgather thy cattle, and all that thou hast in the field;for uponevery man and beast which shall be found in the field, and shall not be brought home, the hail shall come down upon them, and they shall die.",
            "citation": "(Exodus 9:19)"
          },
          "20": {
            "text": "He that feared the word of theLordamong the servants of Pharaoh made his servants and his cattle flee into the houses:",
            "citation": "(Exodus 9:20)"
          },
          "21": {
            "text": "And he that regarded not the word of theLordleft his servants and his cattle in the field.",
            "citation": "(Exodus 9:21)"
          },
          "22": {
            "text": "And theLordsaid unto Moses, Stretch forth thine hand toward heaven, that there may be hail in all the land of Egypt, upon man, and upon beast, and upon every herb of the field, throughout the land of Egypt.",
            "citation": "(Exodus 9:22)"
          },
          "23": {
            "text": "And Moses stretched forth his rod toward heaven: and theLordsent thunder andhail, and the fire ran along upon the ground; and theLordrained hail upon the land of Egypt.",
            "citation": "(Exodus 9:23)"
          },
          "24": {
            "text": "So there was hail, andfiremingled with the hail, very grievous, such as there was none like it in all the land of Egypt since it became nation.",
            "citation": "(Exodus 9:24)"
          },
          "25": {
            "text": "And thehailsmote throughout all the land of Egypt all thatwasin the field, both man and beast; and the hail smote every herb of the field, and brake every tree of the field.",
            "citation": "(Exodus 9:25)"
          },
          "26": {
            "text": "Only in the land of Goshen, where the children of Israelwere,was there no hail.",
            "citation": "(Exodus 9:26)"
          },
          "27": {
            "text": "And Pharaoh sent, and called for Moses and Aaron, and said unto them, I have sinned this time: theLordisrighteous, and I and my peoplearewicked.",
            "citation": "(Exodus 9:27)"
          },
          "28": {
            "text": "Entreat theLord(forit isenough) that there be nomoremighty thunderings and hail; and I will let you go, and ye shall stay no longer.",
            "citation": "(Exodus 9:28)"
          },
          "29": {
            "text": "And Moses said unto him, As soon as I am gone out of the city, I willspread abroadmy hands unto theLord;andthe thunder shall cease, neither shall there be any more hail; that thou mayest know how that theearthistheLords.",
            "citation": "(Exodus 9:29)"
          },
          "30": {
            "text": "But as for thee and thy servants, I know that ye will not yet fear theLordGod.",
            "citation": "(Exodus 9:30)"
          },
          "31": {
            "text": "And the flax and the barley was smitten: for the barleywasin the ear, and the flaxwasbolled.",
            "citation": "(Exodus 9:31)"
          },
          "32": {
            "text": "But thewheatand theriewere not smitten: for theywerenot grown up.",
            "citation": "(Exodus 9:32)"
          },
          "33": {
            "text": "And Moses went out of the city from Pharaoh, and spread abroad his hands unto theLord: and the thunders and hail ceased, and the rain was not poured upon the earth.",
            "citation": "(Exodus 9:33)"
          },
          "34": {
            "text": "And when Pharaoh saw that the rain and the hail and the thunders were ceased, he sinned yet more, and hardened his heart, he and his servants.",
            "citation": "(Exodus 9:34)"
          },
          "35": {
            "text": "And the heart of Pharaoh was hardened, neither would he let the children of Israel go; as theLordhad spoken by Moses.",
            "citation": "(Exodus 9:35)"
          }
        }
      },
      "10": {
        "verses": {
          "1": {
            "text": "And theLordsaid unto Moses, Go in unto Pharaoh:forI have hardened his heart, and the heart of his servants, that I might shew these my signs before him:",
            "citation": "(Exodus 10:1)"
          },
          "2": {
            "text": "And that thou mayesttellin the ears of thy son, and of thy sons son, what things I have wrought inEgypt, and my signs which I have done among them; that ye may know how that IamtheLord.",
            "citation": "(Exodus 10:2)"
          },
          "3": {
            "text": "And Moses and Aaron came in unto Pharaoh, and said unto him, Thus saith theLordGod of the Hebrews, How long wilt thou refuse tohumblethyself before me? let my people go, that they may serve me.",
            "citation": "(Exodus 10:3)"
          },
          "4": {
            "text": "Else, if thou refuse to let my people go, behold, to morrow will I bring thelocustsinto thy coast:",
            "citation": "(Exodus 10:4)"
          },
          "5": {
            "text": "And they shall cover the face of the earth, that one cannot be able to see the earth: and they shall eat theresidueof that which is escaped, which remaineth unto you from the hail, and shall eat every tree which groweth for you out of the field:",
            "citation": "(Exodus 10:5)"
          },
          "6": {
            "text": "And they shall fill thy houses, and the houses of all thy servants, and the houses of all the Egyptians; which neither thy fathers, nor thy fathers fathers have seen, since the day that they were upon the earth unto this day. And he turned himself, and went out from Pharaoh.",
            "citation": "(Exodus 10:6)"
          },
          "7": {
            "text": "And Pharaohs servants said unto him, How long shall this man be asnareunto us? let the men go, that they may serve theLordtheir God: knowest thou not yet that Egypt isdestroyed?",
            "citation": "(Exodus 10:7)"
          },
          "8": {
            "text": "And Moses and Aaron were brought again unto Pharaoh: and he said unto them, Go, serve theLordyour God:butwhoarethey that shall go?",
            "citation": "(Exodus 10:8)"
          },
          "9": {
            "text": "And Moses said, We will go with our young and with ourold, with our sons and with our daughters, with our flocks and with our herds will we go; for wemust holdafeastunto theLord.",
            "citation": "(Exodus 10:9)"
          },
          "10": {
            "text": "And he said unto them, Let theLordbe so with you,asI will let you go, and your little ones: lookto it;forevilisbefore you.",
            "citation": "(Exodus 10:10)"
          },
          "11": {
            "text": "Not so: go now yethat aremen, and serve theLord; for that ye did desire. And they were driven out from Pharaohs presence.",
            "citation": "(Exodus 10:11)"
          },
          "12": {
            "text": "And theLordsaid unto Moses, Stretch out thine hand over the land of Egypt for the locusts, that they may come up upon the land of Egypt, and eat every herb of the land,evenall that the hail hath left.",
            "citation": "(Exodus 10:12)"
          },
          "13": {
            "text": "And Moses stretched forth his rod over the land of Egypt, and theLordbrought an east wind upon the land all that day, and allthatnight;andwhen it was morning, the east wind brought the locusts.",
            "citation": "(Exodus 10:13)"
          },
          "14": {
            "text": "And thelocustswent up over all the land of Egypt, and restedin all the coastsof Egypt: very grievouswere they;before them there were no such locusts as they, neither after them shall be such.",
            "citation": "(Exodus 10:14)"
          },
          "15": {
            "text": "For they covered the face of the whole earth, so that the land was darkened; and they did eat every herb of the land, and all the fruit of the trees which the hail had left: and there remained not any green thing in the trees, or in the herbs of the field, through all the land of Egypt.",
            "citation": "(Exodus 10:15)"
          },
          "16": {
            "text": "Then Pharaoh called for Moses and Aaron in haste; and he said, I have sinned against theLordyour God, and against you.",
            "citation": "(Exodus 10:16)"
          },
          "17": {
            "text": "Now therefore forgive, I pray thee, my sin only this once, and entreat theLordyour God, that he may take away from me this death only.",
            "citation": "(Exodus 10:17)"
          },
          "18": {
            "text": "And he went out from Pharaoh, and entreated theLord.",
            "citation": "(Exodus 10:18)"
          },
          "19": {
            "text": "And theLordturned mighty strong west wind, which took away the locusts, and cast them into theRed sea; there remained not one locust in all the coasts of Egypt.",
            "citation": "(Exodus 10:19)"
          },
          "20": {
            "text": "ButtheLordhardened Pharaohs heart, so that he would not let the children of Israel go.",
            "citation": "(Exodus 10:20)"
          },
          "21": {
            "text": "And theLordsaid untoMoses, Stretch out thine hand toward heaven, that there may bedarknessover the land of Egypt, even darknesswhichmay befelt.",
            "citation": "(Exodus 10:21)"
          },
          "22": {
            "text": "And Moses stretched forth his hand toward heaven; and there was thickdarknessin all the land of Egypt three days:",
            "citation": "(Exodus 10:22)"
          },
          "23": {
            "text": "They saw not one another, neither rose any from his place for three days: but all the children of Israel had light in their dwellings.",
            "citation": "(Exodus 10:23)"
          },
          "24": {
            "text": "And Pharaoh called unto Moses, and said, Go ye, serve theLord; only let your flocks and your herdsbe stayed: let your little ones also go with you.",
            "citation": "(Exodus 10:24)"
          },
          "25": {
            "text": "And Moses said, Thou mustgive us alsosacrifices and burnt offerings, that we may sacrifice unto theLordour God.",
            "citation": "(Exodus 10:25)"
          },
          "26": {
            "text": "Our cattle also shall go with us; there shall not an hoof be left behind; for thereof must we take to serve theLordour God; and we know not with what we must serve theLord, until we come thither.",
            "citation": "(Exodus 10:26)"
          },
          "27": {
            "text": "ButtheLordhardened Pharaohs heart, and he would not let them go.",
            "citation": "(Exodus 10:27)"
          },
          "28": {
            "text": "And Pharaoh said unto him, Get thee from me, take heed to thyself, see my face no more; for inthatday thou seest my face thou shalt die.",
            "citation": "(Exodus 10:28)"
          },
          "29": {
            "text": "And Moses said,Thou hast spoken well, I will see thy face again no more.",
            "citation": "(Exodus 10:29)"
          }
        }
      },
      "11": {
        "verses": {
          "1": {
            "text": "And theLordsaid unto Moses, Yet will I bring one plaguemoreupon Pharaoh, and upon Egypt; afterwards he will let you go hence: when he shall letyougo, he shall surelythrustyou out hence altogether.",
            "citation": "(Exodus 11:1)"
          },
          "2": {
            "text": "Speak now in the ears of the people, and let every manborrowof his neighbour, and every woman of her neighbour,jewelsof silver, and jewels of gold.",
            "citation": "(Exodus 11:2)"
          },
          "3": {
            "text": "And theLordgave the peoplefavourin the sight of the Egyptians. Moreover the man Moseswasvery great in the land of Egypt, in the sight of Pharaohs servants, and in the sight of the people.",
            "citation": "(Exodus 11:3)"
          },
          "4": {
            "text": "And Moses said, Thus saith theLord, About midnight will I go out into the midst of Egypt:",
            "citation": "(Exodus 11:4)"
          },
          "5": {
            "text": "And all thefirstbornin the land of Egypt shall die, from thefirstbornof Pharaoh that sitteth upon his throne, even unto the firstborn of the maidservant thatisbehind the mill; and all the firstborn of beasts.",
            "citation": "(Exodus 11:5)"
          },
          "6": {
            "text": "And there shall be great cry throughout all the land of Egypt, such as there was none like it, nor shall be like it any more.",
            "citation": "(Exodus 11:6)"
          },
          "7": {
            "text": "But against any of the children of Israel shall not dog move his tongue, against man or beast: that ye may know how that theLorddoth put adifferencebetween the Egyptians and Israel.",
            "citation": "(Exodus 11:7)"
          },
          "8": {
            "text": "And all these thy servants shall come down unto me, and bow down themselves unto me, saying, Get thee out, and all the people that follow thee: and after that I will go out. And he went out from Pharaoh in greatanger.",
            "citation": "(Exodus 11:8)"
          },
          "9": {
            "text": "And theLordsaid unto Moses, Pharaoh shall not hearken unto you; that my wonders may be multiplied in the land of Egypt.",
            "citation": "(Exodus 11:9)"
          },
          "10": {
            "text": "And Moses and Aaron did all these wonders before Pharaoh:andtheLordhardened Pharaohs heart,so that he would not let the children of Israel go out of his land.",
            "citation": "(Exodus 11:10)"
          }
        }
      },
      "12": {
        "verses": {
          "1": {
            "text": "And theLordspake unto Moses and Aaron in the land of Egypt, saying,",
            "citation": "(Exodus 12:1)"
          },
          "2": {
            "text": "Thismonthshall beunto you thebeginningof months: itshall bethe first month of the year to you.",
            "citation": "(Exodus 12:2)"
          },
          "3": {
            "text": "Speak ye unto all the congregation of Israel, saying, In the tenthdayof this month they shall take to them every man lamb, according to the house oftheirfathers, lamb for an house:",
            "citation": "(Exodus 12:3)"
          },
          "4": {
            "text": "And if the household be too little for the lamb, let him and his neighbour next unto his house takeitaccording to the number of the souls; every man according to hiseatingshall make your count for the lamb.",
            "citation": "(Exodus 12:4)"
          },
          "5": {
            "text": "Yourlambshall be without blemish, maleof the first year: ye shall takeitout from the sheep, or from the goats:",
            "citation": "(Exodus 12:5)"
          },
          "6": {
            "text": "And ye shall keep it up until thefourteenthday of the same month: and the whole assembly of the congregation of Israel shall kill it in the evening.",
            "citation": "(Exodus 12:6)"
          },
          "7": {
            "text": "And they shall take of the blood, and strikeiton the two side posts and on the upper door post of the houses, wherein they shall eat it.",
            "citation": "(Exodus 12:7)"
          },
          "8": {
            "text": "And they shall eat the flesh in that night, roast with fire, andunleavenedbread;andwith bitterherbsthey shall eat it.",
            "citation": "(Exodus 12:8)"
          },
          "9": {
            "text": "Eat not of it raw, norsoddenat all with water, but roastwithfire; his head with his legs, and with thepurtenancethereof.",
            "citation": "(Exodus 12:9)"
          },
          "10": {
            "text": "And ye shall let nothing of itremainuntil the morning; and that which remaineth of it until the morning ye shall burn with fire.",
            "citation": "(Exodus 12:10)"
          },
          "11": {
            "text": "And thus shall ye eat it;withyour loinsgirded, your shoes on your feet, and your staff in your hand; and ye shall eat it inhaste: itistheLords passover.",
            "citation": "(Exodus 12:11)"
          },
          "12": {
            "text": "For I will pass through the land of Egypt this night, and will smite all thefirstbornin the land of Egypt, both man and beast; and against all thegodsof Egypt I will executejudgment: IamtheLord.",
            "citation": "(Exodus 12:12)"
          },
          "13": {
            "text": "And the blood shall be to you for atokenupon the houses where yeare:and when I see the blood, I will pass over you, and the plague shall not be upon you to destroyyou,when I smite the land of Egypt.",
            "citation": "(Exodus 12:13)"
          },
          "14": {
            "text": "And thisdayshall be unto you for amemorial; and ye shall keep it afeastto theLordthroughout your generations; ye shall keep it afeastby an ordinancefor ever.",
            "citation": "(Exodus 12:14)"
          },
          "15": {
            "text": "Seven days shall ye eatunleavenedbread; even the first day ye shall put away leaven out of your houses: for whosoever eateth leavened bread from the first day until the seventh day, that soul shall becut offfrom Israel.",
            "citation": "(Exodus 12:15)"
          },
          "16": {
            "text": "And in the first daythere shall bean holyconvocation, and in theseventh daythere shall be an holy convocation to you; no manner of work shall be done in them, savethatwhich every man must eat, that only may be done of you.",
            "citation": "(Exodus 12:16)"
          },
          "17": {
            "text": "And ye shall observethefeastofunleavenedbread; for in this selfsame day have I brought yourarmiesout of the land of Egypt: therefore shall ye observe this day in your generationsbyan ordinance for ever.",
            "citation": "(Exodus 12:17)"
          },
          "18": {
            "text": "In the firstmonth,on the fourteenth day of the month at even, ye shall eat unleavened bread, until the one and twentieth day of the month at even.",
            "citation": "(Exodus 12:18)"
          },
          "19": {
            "text": "Seven days shall there be no leaven found in your houses: for whosoever eateth that which is leavened, even that soul shall be cut off from the congregation of Israel, whether he be astranger, or born in the land.",
            "citation": "(Exodus 12:19)"
          },
          "20": {
            "text": "Ye shall eat nothing leavened; in all your habitations shall ye eat unleavened bread.",
            "citation": "(Exodus 12:20)"
          },
          "21": {
            "text": "Then Moses called for all the elders of Israel, and said unto them,Drawout and take you alambaccording to yourfamilies, and kill thepassover.",
            "citation": "(Exodus 12:21)"
          },
          "22": {
            "text": "And ye shall take bunch of hyssop, and dipitin the blood thatisin the basin, and strike the lintel and the two side posts with thebloodthatisin the basin; and none of you shall go out at the door of his house until the morning.",
            "citation": "(Exodus 12:22)"
          },
          "23": {
            "text": "For theLordwillpassthrough to smite the Egyptians; and when he seeth the blood upon the lintel, and on the two side posts, theLordwillpassover the door, and will notsufferthedestroyerto come in unto your houses to smiteyou.",
            "citation": "(Exodus 12:23)"
          },
          "24": {
            "text": "And ye shall observe this thing for an ordinance to thee and to thy sons for ever.",
            "citation": "(Exodus 12:24)"
          },
          "25": {
            "text": "And it shall come to pass, when ye be come to the land which theLordwill give you, according as he hath promised, that ye shall keep this service.",
            "citation": "(Exodus 12:25)"
          },
          "26": {
            "text": "And it shall come to pass, when yourchildrenshall say unto you, What mean ye by this service?",
            "citation": "(Exodus 12:26)"
          },
          "27": {
            "text": "That ye shall say, Itisthesacrificeof theLordspassover, who passed over the houses of the children of Israel in Egypt, when he smote the Egyptians, anddeliveredour houses. And the people bowed the head and worshipped.",
            "citation": "(Exodus 12:27)"
          },
          "28": {
            "text": "And the children of Israel went away, and did as theLordhadcommandedMoses and Aaron, so did they.",
            "citation": "(Exodus 12:28)"
          },
          "29": {
            "text": "And it came to pass, that at midnight theLordsmoteall thefirstbornin the land of Egypt, from the firstborn of Pharaoh that sat on his throne unto the firstborn of the captive thatwasin the dungeon; and all the firstborn of cattle.",
            "citation": "(Exodus 12:29)"
          },
          "30": {
            "text": "And Pharaoh rose up in the night, he, and all his servants, and all the Egyptians; and there was great cry in Egypt; forthere wasnot house wherethere wasnot onedead.",
            "citation": "(Exodus 12:30)"
          },
          "31": {
            "text": "And he called for Moses and Aaron by night, and said, Rise up,andget youforthfrom among my people, both ye and the children of Israel; and go, serve theLord, as ye have said.",
            "citation": "(Exodus 12:31)"
          },
          "32": {
            "text": "Also take your flocks and yourherds, as ye have said, and be gone; and bless me also.",
            "citation": "(Exodus 12:32)"
          },
          "33": {
            "text": "And the Egyptians wereurgentupon the people, that they might send them out of the land in haste; for they said, Webeall deadmen.",
            "citation": "(Exodus 12:33)"
          },
          "34": {
            "text": "And the people took their dough before it was leavened, their kneadingtroughs being bound up in their clothes upon their shoulders.",
            "citation": "(Exodus 12:34)"
          },
          "35": {
            "text": "And the children of Israel did according to the word of Moses; and theyborrowedof the Egyptians jewels ofsilver, and jewels of gold, andraiment:",
            "citation": "(Exodus 12:35)"
          },
          "36": {
            "text": "And theLordgave the peoplefavourin the sight of the Egyptians, so that theylent unto themsuch things as they required.And theyspoiledthe Egyptians.",
            "citation": "(Exodus 12:36)"
          },
          "37": {
            "text": "And the children of IsraeljourneyedfromRamesesto Succoth, aboutsix hundred thousandon footthat weremen, beside children.",
            "citation": "(Exodus 12:37)"
          },
          "38": {
            "text": "Anda mixed multitudewent up also with them; and flocks, and herds,evenvery much cattle.",
            "citation": "(Exodus 12:38)"
          },
          "39": {
            "text": "And they bakedunleavenedcakes of the dough which they brought forth out of Egypt, for it was not leavened; because they werethrustout of Egypt, and could not tarry, neither had they prepared for themselves anyvictual.",
            "citation": "(Exodus 12:39)"
          },
          "40": {
            "text": "Now thesojourningof the children of Israel, who dwelt in Egypt,wasfour hundred and thirty years.",
            "citation": "(Exodus 12:40)"
          },
          "41": {
            "text": "And it came to pass at the end of the four hundred and thirty years, even the selfsame day it came to pass, that all the hosts of theLordwent out from the land of Egypt.",
            "citation": "(Exodus 12:41)"
          },
          "42": {
            "text": "Itisa nighttobe muchobservedunto theLordfor bringing them out from the land of Egypt: thisisthat night of theLordto be observed of all the children ofIsraelin their generations.",
            "citation": "(Exodus 12:42)"
          },
          "43": {
            "text": "And theLordsaid unto Moses and Aaron, Thisisthe ordinance of thepassover: There shall nostrangereat thereof:",
            "citation": "(Exodus 12:43)"
          },
          "44": {
            "text": "But every mans servant that isboughtfor money, when thou hast circumcised him, then shall he eat thereof.",
            "citation": "(Exodus 12:44)"
          },
          "45": {
            "text": "A foreigner and an hired servant shall not eat thereof.",
            "citation": "(Exodus 12:45)"
          },
          "46": {
            "text": "In one house shall it be eaten; thou shalt not carry forthoughtof the fleshabroadout of the house; neither shall yebreakabonethereof.",
            "citation": "(Exodus 12:46)"
          },
          "47": {
            "text": "All the congregation of Israel shall keep it.",
            "citation": "(Exodus 12:47)"
          },
          "48": {
            "text": "And when stranger shall sojourn with thee, and will keep the passover to theLord, let all his males becircumcised, and then let him come near and keep it; and he shall be as one that isbornin the land: for no uncircumcised person shall eat thereof.",
            "citation": "(Exodus 12:48)"
          },
          "49": {
            "text": "One law shall be to him that is homeborn, and unto the stranger that sojourneth among you.",
            "citation": "(Exodus 12:49)"
          },
          "50": {
            "text": "Thus did all the children of Israel; as theLordcommanded Moses and Aaron, so did they.",
            "citation": "(Exodus 12:50)"
          },
          "51": {
            "text": "And it came to pass the selfsame day,thattheLorddidbringthe children of Israel out of the land of Egypt by their armies.",
            "citation": "(Exodus 12:51)"
          }
        }
      },
      "13": {
        "verses": {
          "1": {
            "text": "And theLordspake unto Moses, saying,",
            "citation": "(Exodus 13:1)"
          },
          "2": {
            "text": "Sanctifyunto me all thefirstborn, whatsoeveropeneththewombamong the children of Israel,bothof man and of beast: itismine.",
            "citation": "(Exodus 13:2)"
          },
          "3": {
            "text": "And Moses said unto the people, Remember this day, in which ye came out fromEgypt, out of the house of bondage; for by strength of hand theLordbrought you out from thisplace:there shall no leavened bread be eaten.",
            "citation": "(Exodus 13:3)"
          },
          "4": {
            "text": "This daycame ye outinthemonthAbib.",
            "citation": "(Exodus 13:4)"
          },
          "5": {
            "text": "And it shall be when theLordshallbringthee into the land of theCanaanites, and the Hittites, and the Amorites, and the Hivites, and the Jebusites, which heswareunto thy fathers to give thee, landflowingwith milk and honey, that thou shalt keep this service in this month.",
            "citation": "(Exodus 13:5)"
          },
          "6": {
            "text": "Seven days thou shalt eat unleavened bread, and in the seventh dayshall bea feast to theLord.",
            "citation": "(Exodus 13:6)"
          },
          "7": {
            "text": "Unleavened bread shall be eaten seven days; and there shall noleavenedbread be seen with thee, neither shall there beleavenseen with theein all thy quarters.",
            "citation": "(Exodus 13:7)"
          },
          "8": {
            "text": "And thou shaltshewthy son in that day, saying,This is donebecause of thatwhichtheLorddid unto me when I came forth out of Egypt.",
            "citation": "(Exodus 13:8)"
          },
          "9": {
            "text": "And it shall be for asignunto thee upon thine hand, and for amemorialbetween thine eyes, that theLords law may be in thy mouth: for with strong hand hath theLordbrought thee out of Egypt.",
            "citation": "(Exodus 13:9)"
          },
          "10": {
            "text": "Thou shalt therefore keep this ordinancein his seasonfrom year to year.",
            "citation": "(Exodus 13:10)"
          },
          "11": {
            "text": "And it shall be when theLordshall bring thee into the land of theCanaanites, as heswareunto thee and to thy fathers, and shall give it thee,",
            "citation": "(Exodus 13:11)"
          },
          "12": {
            "text": "That thou shalt set apart unto theLordallthat openeth the matrix, and everyfirstlingthat cometh of beast which thou hast; the malesshall betheLords.",
            "citation": "(Exodus 13:12)"
          },
          "13": {
            "text": "And every firstling of an ass thou shalt redeem with lamb; and if thou wilt not redeem it, then thou shalt break his neck: and all thefirstbornof man among thy children shalt thou redeem.",
            "citation": "(Exodus 13:13)"
          },
          "14": {
            "text": "And it shall be when thysonaskeththee in time to come, saying, Whatisthis? that thou shalt say unto him, By strength of hand theLordbroughtus out from Egypt, from the house ofbondage:",
            "citation": "(Exodus 13:14)"
          },
          "15": {
            "text": "And it came to pass, when Pharaoh would hardly let us go, that theLordslewall the firstborn in the land of Egypt, both the firstborn of man, and the firstborn of beast: therefore I sacrifice to theLordall that openeth the matrix, being males; but all the firstborn of my children I redeem.",
            "citation": "(Exodus 13:15)"
          },
          "16": {
            "text": "And it shall be for token upon thine hand, and forfrontletsbetween thine eyes: for by strength of hand theLordbrought us forth out of Egypt.",
            "citation": "(Exodus 13:16)"
          },
          "17": {
            "text": "And it came to pass, when Pharaoh had let the people go, that God led them notthroughthe way of the land of the Philistines, although thatwasnear; for God said, Lestperadventurethe peoplerepentwhen they see war, and theyreturnto Egypt:",
            "citation": "(Exodus 13:17)"
          },
          "18": {
            "text": "But Godledthe people about,throughthe way of the wilderness of the Red sea: and the children ofIsraelwent upharnessedout of the land of Egypt.",
            "citation": "(Exodus 13:18)"
          },
          "19": {
            "text": "And Moses took the bones ofJosephwith him: for he had straitly sworn the children of Israel, saying, God will surely visit you; and ye shall carry up mybonesaway hence with you.",
            "citation": "(Exodus 13:19)"
          },
          "20": {
            "text": "And they took their journey fromSuccoth, and encamped in Etham, in the edge of the wilderness.",
            "citation": "(Exodus 13:20)"
          },
          "21": {
            "text": "And theLordwent before them by day in pillar of acloud, toleadthem the way; and by night in apillarof fire, to give them light; to go by day and night:",
            "citation": "(Exodus 13:21)"
          },
          "22": {
            "text": "He took not away the pillar of the cloud by day, nor the pillar of fire by night,frombefore the people.",
            "citation": "(Exodus 13:22)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 61785,
  "total_sources": 9,
  "generated_at": "2025-12-14T04:01:27.377047"
}