{
  "week_number": 25,
  "date_range": "Samuel 17–181 ",
  "title": "1 ;24–26;2 Samuel 5–7",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: 1 ;24–26;2 Samuel 5–7 ---\nEver since the tribes of Israel had settled in the promised land, the Philistines had been an ongoing threat to their safety. The Lord had delivered them many times in the past, but now the elders of Israel demanded, “We will have a king … [to] go out before us, and fight our battles” (\n1 Samuel 8:19–20\n). So Saul was anointed king. And yet when the menacing giant Goliath hurled his challenge to the armies of Israel, Saul—like the rest of his army—was “greatly afraid” (\n1 Samuel 17:11\n). On that day, it wasn’t King Saul who saved Israel but a humble shepherd boy named David, who was wearing no armor but was clothed with impenetrable faith in the Lord. This battle proved to Israel, and to anyone who has spiritual battles to fight, that “the Lord saveth not with sword and spear” and that “the battle is the Lord’s” (\n1 Samuel 17:47\n).\nIdeas for Learning at Home and at Church\n1 Samuel 17\nWith the help of the Lord, I can overcome any challenge.\nThe story of David and Goliath is one of the best-known stories in the scriptures. Of course, we usually focus on David. But this time, as you study\n1 Samuel 17\n, ponder also the words of other people in this chapter (see the list below). What do you learn about them and their motives? What do you learn about David? How is he different?\nGoliath:\nverses 8–10, 43–44\nEliab:\nverse 28\nSaul:\nverse 33\nDavid:\nverses 26, 32, 34–37, 39, 45–47\nYour story, though not as well-known as David’s, is sure to include Goliath-size challenges to overcome and opportunities to exercise faith in the Lord. What does David’s example teach you about facing the adversity in your story? You might also read President Camille N. Johnson’s message “\nInvite Christ to Author Your Story\n” (\nLiahona\n, Nov. 2021, 80–82) with one of your challenges in mind. Look for answers to questions like these: How does the Lord want me to view my challenges? How has He helped me in the past? How can I show that I trust Him to write my story?\nYou may already know that there are some tragic chapters later in David’s story (see, for example,\n2 Samuel 11\n). If you had the opportunity to give David some advice after his battle with Goliath, what would you say? How might this advice apply to your life?\nSee also “The Lord Will Deliver Me” (video), Gospel Library.\n3:24\nThe Lord Will Deliver Me\n1 Samuel 17:26–50\nOne person with faith in Christ can make a difference.\nIn addition to personal challenges, we also face large, complex problems that affect the whole world. When forces of evil are “gathered together … to battle” against the forces of good (\n1 Samuel 17:1\n), we might wonder how our individual efforts could possibly make a difference. What do you find in David’s story that gives you hope? Sister Andrea M. Spannaus taught that the five stones David carried into his battle with Goliath could represent things we need to win our spiritual battles. Read her message “\nFaithful to the End\n” (\nLiahona\n, May 2024, 59–61). How can you access these sources of strength in your life?\nSee also “\nLet Us All Press On\n,”\nHymns\n, no. 243.\nTrue Friendship and Self-Respect\n, by Wilson Ong (detail)\n1 Samuel 18\n“Jonathan loved [David] as his own soul.”\nAs you read\n1 Samuel 18\n, consider contrasting Saul and his son Jonathan (who, if not for David, could have assumed he would be the next king). How did Saul and Jonathan react to David’s success? What can you learn from this experience?\nWhat do you find in Jonathan’s attitudes and actions that reminds you of Jesus Christ?\n“Liken the scriptures” (\n1 Nephi 19:23\n).\nThe scriptures provide great opportunities to learn from the motivations and actions of people like David, Jonathan, and Saul. You’ll find that no one in the scriptures is flawless. So as you read, for example, about David’s faithful choices, be open to learning also from his mistakes. Doing so can help us identify potential weaknesses in ourselves and “learn to be more wise than [others] have been” (\nMormon 9:31\n).\n1 Samuel 24–26\nForgiveness is the sure path to peace and healing.\nIn\n1 Samuel 24–26\n, look for lessons about pride, forgiveness, and self-control. You might also consider reading Elder Mark A. Bragg’s message “\nChristlike Poise\n” as part of your study (\nLiahona\n, May 2023, 60–63). How did David, Abigail, and others demonstrate—or fail to demonstrate—Christlike poise in these chapters? What opportunities do you have to show Christlike poise?\nSister Kristen Yee’s message “\nBeauty for Ashes: The Healing Path of Forgiveness\n” (\nLiahona\n, Nov. 2022, 36–39) can help you study\n1 Samuel 25\n. How is Abigail like Jesus Christ?\n2 Samuel 5:17–25\nThe Lord can give me direction.\nEven after David defeated Goliath, his problems with the Philistines were not over. As you read\n2 Samuel 5:17–25\n, consider how David’s example can help you in the challenges you face (see also\n1 Samuel 23:2, 10–11\n;\n30:8\n;\n2 Samuel 2:1\n). How are you being blessed by acting on the revelation you receive?\n2 Samuel 7\nWhat is the “house” the Lord promised to David?\nWhen David offered to build a house, meaning a temple, for the Lord (see\n2 Samuel 7:1–3\n), the Lord responded that David’s\nson\nwould build it (see\nverses 12–15\n; see also\n1 Chronicles 17:1–15\n). The Lord also said that He in turn would build David a “house,” meaning a posterity, and that his throne would last forever (see\n2 Samuel 7:11, 16, 25–29\n;\nPsalm 89:3–4, 35–37\n). This promise was fulfilled in Jesus Christ, our Eternal King, who was a descendant of David (see\nMatthew 1:1\n;\nLuke 1:32–33\n;\nJohn 18:33–37\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat is meant by the title “Lord of Hosts”?\nWhy was Uzzah smitten by God for trying to steady the ark?\nClick to see more.\nIdeas for Teaching Children\n1 Samuel 17:20–54\nFaith in Jesus Christ can help me have courage.\nYou may want to use “\nDavid and Goliath\n” in\nOld Testament Stories\n, 112–16, to help your children become familiar with what happened in\n1 Samuel 17:20–54\n. Then you could let them retell the story using the pictures or line drawings in this outline. Ask them what they think the Lord wants them to learn from this story.\n2:36\nDavid and Goliath\nYou and your children could also make a list of some difficult challenges they might face during their life. Then help them find things David said that can help with these challenges (see\n1 Samuel 17:26, 32, 34–37, 45–47\n). Share how Jesus Christ has helped you during challenges.\nYour children could march like they are David going to fight Goliath while singing a song about being courageous, such as “\nI Will Be Valiant\n” (\nChildren’s Songbook\n, 162).\n1 Samuel 18:1–4\nGood friends can be a blessing from God.\nHow can you help your children learn from Jonathan and David’s friendship? One way would be to give each child two paper hearts, one to represent David and the other to represent Jonathan. Then read together a few phrases from\n1 Samuel 18:1–4\nthat emphasize the love these two friends felt for each other. Your children could then write or draw on their paper hearts how they can show love to a friend.\n2 Samuel 5:19, 23\nIf I need guidance, I can ask Heavenly Father.\nIn these chapters, David became the king of Israel. It might be fun for your children to pretend to be a king or queen. What laws would they make? Where would they go for help? Help your children discover that when David needed help, he “inquired,” or prayed, for answers. For example, as you read\n2 Samuel 5:19, 23\n, invite the children to listen for the word “inquired” and to fold their arms when they hear it. Why would David need the Lord’s help in his new role?\nTell each other about times when you prayed for Heavenly Father’s help. What difference did it make to have Him help you?\n2 Samuel 7:16–17\nJesus Christ is my Eternal King.\nThe kings we read about in the Old Testament all had flaws, and their kingdoms all ended. But Jesus Christ is a perfect King and will reign forever. You can help your children discover this by reading together what the prophet Nathan told King David in\n2 Samuel 7:16–17\n. How could David’s kingdom have no end? Help your children find and read scripture passages that teach that Jesus Christ, a descendant of David, is our King, such as\nLuke 1:32–33\n;\nJohn 18:33–37\n; and\nRevelation 19:16\n. How is Jesus different from earthly kings? How do we honor Jesus Christ as our Eternal King?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 25: Lesson 68: Lesson 68—RuthThis lesson is intended to help students feel a greater desire to trust in Jesus Christ and His redeeming power. ---\n\n--- Lesson 68 ---\nBecause the price of salvation is too high for us alone to pay, we each need to be redeemed. The account of Ruth, Naomi, and Boaz in the Old Testament is a story of physical redemption that symbolizes Jesus Christ’s role as our personal Redeemer. This lesson is intended to help students feel a greater desire to trust in Jesus Christ and His redeeming power. Student preparation: Invite students to consider why one of Jesus Christ’s titles is Redeemer. Encourage them to ponder how Jesus Christ redeems us from physical and spiritual death. (They might refer to “ Redeem, Redeemed, Redemption ” in Guide to the Scriptures for help.) Encourage them to come prepared to share their thoughts with the class. Possible Learning Activities What does it mean that Jesus Christ is our Redeemer? You might begin class by displaying the following image of Jesus Christ or another of your choice and writing the word Redeemer on the board. Display the quote from Elder Christofferson and invite students to answer the two questions in their study journal. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles explained: Among the most significant of Jesus Christ’s descriptive titles is Redeemer. … The word redeem means to pay off an obligation or a debt. Redeem can also mean to rescue or set free. (“ Redemption ,” Ensign or Liahona , May 2013, 109) In what ways might you and others need to be redeemed by Jesus Christ? How much do you want to trust in Jesus Christ’s redeeming power in your life? Why? Invite students to consider how confident they are in their answers and what they might like to understand better or feel about the Savior and His redeeming power. You may want to summarize the next paragraph in your own words. You may also want to write the bolded truth on the board near the word Redeemer. Redemption is one of the prominent themes in the account of Ruth. As you study Ruth’s story, consider how likening this account to ourselves can help us learn that if we come to Jesus Christ, He will redeem us. Seek the help of the Holy Ghost to know ways we are like Ruth and need redemption and how Boaz is like the Savior Jesus Christ and redeems us. The account of Ruth You might read or explain the following summary. In a time of famine, an Israelite woman named Naomi, her husband, and her two sons moved from Bethlehem to Moab, a neighboring country with a different culture and religious beliefs. While there, the sons each married Moabite women, Ruth and Orpah. Tragically, Naomi’s husband and two sons died, leaving the three women widows. Naomi chose to return to Bethlehem. Unable to care for her daughters-in-law, Naomi encouraged them to return to their families in Moab. Orpah returned to her family. Read Ruth 1:8–9, 14–17 , looking for Ruth’s response to Naomi. What are some of the uncertainties and difficulties Ruth might face by going to Bethlehem with Naomi? After hearing what students share, you could explain some of the following: By going with Naomi, Ruth would leave behind family in Moab. Ruth would be a foreigner in an unfamiliar land with a different culture. Without husbands, Ruth and Naomi would face extreme poverty. Ruth’s choice showed her willingness to worship and rely on Jehovah (Jesus Christ), not the false gods of the Moabites. (You might invite students to mark the phrase “and thy God my God” in verse 16 .) Knowing Ruth’s circumstances, what stands out to you about her response? Boaz redeems Ruth To continue Ruth’s account, you could invite students to complete the handout “Ruth and Naomi Are Redeemed.” Students could work in pairs to write the important details of the story. Another option would be to give students the scripture blocks of the handout and have them summarize the verses in their own words with a partner. Open PDF After students complete the handout, you could explain any of the following that you feel would be useful: As part of the Law of Moses, Israelites were required to leave unharvested grain in the fields to care for the poor (see Leviticus 19:9–10 ). Naomi told Ruth that Boaz was one of their “next kinsmen” (see Ruth 2:20 ) or close relatives. The term “next kinsman” comes from the Hebrew word go-el , which means “redeemer.” A “next kinsman” was expected to care for (or even marry) widows in their family to restore them to safety and security. Because there was another kinsman more closely related who had the right to marry Ruth, Boaz purchased the right from him (see Ruth 3:12–13 ) before marrying Ruth (see Ruth 4:9–10, 13 ). It may be helpful to create a two-column chart on the board. Label the first column Ruth/Us and the second column Boaz/Jesus Christ . Students could list on the board what they find. In what ways might we be like Ruth? If students struggle to answer, consider asking them to think about how they may not have enough or be enough on their own. (This could include not having enough righteousness or obedience, not enough strength to overcome sin or weakness, not enough support to continue doing what is right, and so on.) You might also ask what Ruth did to seek redemption and how we may be similar. In what ways is Boaz like Jesus Christ? If students struggle to answer, consider inviting them to review Ruth 2:12, 15–16 . You might also point out that Boaz entered a covenant marriage or relationship with Ruth to always love and care for her. If needed, explain that the Savior redeems us in every way we need. Consider inviting students to read Mosiah 15:7–9 or Helaman 5:9–11 to identify how the Savior redeems us. You may also add that the Savior’s redemptive work includes helping us with our problems on earth (see D. Todd Christofferson, “ Redemption ,” Ensign or Liahona , May 2013, 109–110). How would you describe the difference in Ruth’s situation before and after Boaz helped and married her? What lessons can we learn about our relationship with Jesus Christ through the story of Ruth and Boaz? Jesus Christ is our Redeemer Providing students opportunities to answer the next three questions may invite the Holy Ghost. As students share and listen to each other share, the Holy Ghost can help students feel a greater desire to trust in Jesus Christ and His redeeming power. To help students prepare to answer the first question, you might show “ Finding Your Purpose in Life: Does Faith Matter? ” (5:08) or “ Moving on from Past Mistakes ” (3:43), both are available at ChurchofJesusChrist.org . 5:9 3:43 When have you or someone you know felt the redeeming power of Jesus Christ? Why might you, like Ruth, want to trust in Jesus Christ and His redeeming power in the future? What do you think someone could do to increase their desire to trust in the Savior’s redeeming power? To conclude, invite students to consider what thoughts or impressions they received from the Holy Ghost about trusting the Lord and His redeeming power. They may want to add thoughts to the questions they answered at the beginning of the lesson in their study journals.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "1 ;24–26;2 Samuel 5–7",
      "content": "Ever since the tribes of Israel had settled in the promised land, the Philistines had been an ongoing threat to their safety. The Lord had delivered them many times in the past, but now the elders of Israel demanded, “We will have a king … [to] go out before us, and fight our battles” (\n1 Samuel 8:19–20\n). So Saul was anointed king. And yet when the menacing giant Goliath hurled his challenge to the armies of Israel, Saul—like the rest of his army—was “greatly afraid” (\n1 Samuel 17:11\n). On that day, it wasn’t King Saul who saved Israel but a humble shepherd boy named David, who was wearing no armor but was clothed with impenetrable faith in the Lord. This battle proved to Israel, and to anyone who has spiritual battles to fight, that “the Lord saveth not with sword and spear” and that “the battle is the Lord’s” (\n1 Samuel 17:47\n).\nIdeas for Learning at Home and at Church\n1 Samuel 17\nWith the help of the Lord, I can overcome any challenge.\nThe story of David and Goliath is one of the best-known stories in the scriptures. Of course, we usually focus on David. But this time, as you study\n1 Samuel 17\n, ponder also the words of other people in this chapter (see the list below). What do you learn about them and their motives? What do you learn about David? How is he different?\nGoliath:\nverses 8–10, 43–44\nEliab:\nverse 28\nSaul:\nverse 33\nDavid:\nverses 26, 32, 34–37, 39, 45–47\nYour story, though not as well-known as David’s, is sure to include Goliath-size challenges to overcome and opportunities to exercise faith in the Lord. What does David’s example teach you about facing the adversity in your story? You might also read President Camille N. Johnson’s message “\nInvite Christ to Author Your Story\n” (\nLiahona\n, Nov. 2021, 80–82) with one of your challenges in mind. Look for answers to questions like these: How does the Lord want me to view my challenges? How has He helped me in the past? How can I show that I trust Him to write my story?\nYou may already know that there are some tragic chapters later in David’s story (see, for example,\n2 Samuel 11\n). If you had the opportunity to give David some advice after his battle with Goliath, what would you say? How might this advice apply to your life?\nSee also “The Lord Will Deliver Me” (video), Gospel Library.\n3:24\nThe Lord Will Deliver Me\n1 Samuel 17:26–50\nOne person with faith in Christ can make a difference.\nIn addition to personal challenges, we also face large, complex problems that affect the whole world. When forces of evil are “gathered together … to battle” against the forces of good (\n1 Samuel 17:1\n), we might wonder how our individual efforts could possibly make a difference. What do you find in David’s story that gives you hope? Sister Andrea M. Spannaus taught that the five stones David carried into his battle with Goliath could represent things we need to win our spiritual battles. Read her message “\nFaithful to the End\n” (\nLiahona\n, May 2024, 59–61). How can you access these sources of strength in your life?\nSee also “\nLet Us All Press On\n,”\nHymns\n, no. 243.\nTrue Friendship and Self-Respect\n, by Wilson Ong (detail)\n1 Samuel 18\n“Jonathan loved [David] as his own soul.”\nAs you read\n1 Samuel 18\n, consider contrasting Saul and his son Jonathan (who, if not for David, could have assumed he would be the next king). How did Saul and Jonathan react to David’s success? What can you learn from this experience?\nWhat do you find in Jonathan’s attitudes and actions that reminds you of Jesus Christ?\n“Liken the scriptures” (\n1 Nephi 19:23\n).\nThe scriptures provide great opportunities to learn from the motivations and actions of people like David, Jonathan, and Saul. You’ll find that no one in the scriptures is flawless. So as you read, for example, about David’s faithful choices, be open to learning also from his mistakes. Doing so can help us identify potential weaknesses in ourselves and “learn to be more wise than [others] have been” (\nMormon 9:31\n).\n1 Samuel 24–26\nForgiveness is the sure path to peace and healing.\nIn\n1 Samuel 24–26\n, look for lessons about pride, forgiveness, and self-control. You might also consider reading Elder Mark A. Bragg’s message “\nChristlike Poise\n” as part of your study (\nLiahona\n, May 2023, 60–63). How did David, Abigail, and others demonstrate—or fail to demonstrate—Christlike poise in these chapters? What opportunities do you have to show Christlike poise?\nSister Kristen Yee’s message “\nBeauty for Ashes: The Healing Path of Forgiveness\n” (\nLiahona\n, Nov. 2022, 36–39) can help you study\n1 Samuel 25\n. How is Abigail like Jesus Christ?\n2 Samuel 5:17–25\nThe Lord can give me direction.\nEven after David defeated Goliath, his problems with the Philistines were not over. As you read\n2 Samuel 5:17–25\n, consider how David’s example can help you in the challenges you face (see also\n1 Samuel 23:2, 10–11\n;\n30:8\n;\n2 Samuel 2:1\n). How are you being blessed by acting on the revelation you receive?\n2 Samuel 7\nWhat is the “house” the Lord promised to David?\nWhen David offered to build a house, meaning a temple, for the Lord (see\n2 Samuel 7:1–3\n), the Lord responded that David’s\nson\nwould build it (see\nverses 12–15\n; see also\n1 Chronicles 17:1–15\n). The Lord also said that He in turn would build David a “house,” meaning a posterity, and that his throne would last forever (see\n2 Samuel 7:11, 16, 25–29\n;\nPsalm 89:3–4, 35–37\n). This promise was fulfilled in Jesus Christ, our Eternal King, who was a descendant of David (see\nMatthew 1:1\n;\nLuke 1:32–33\n;\nJohn 18:33–37\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat is meant by the title “Lord of Hosts”?\nWhy was Uzzah smitten by God for trying to steady the ark?\nClick to see more.\nIdeas for Teaching Children\n1 Samuel 17:20–54\nFaith in Jesus Christ can help me have courage.\nYou may want to use “\nDavid and Goliath\n” in\nOld Testament Stories\n, 112–16, to help your children become familiar with what happened in\n1 Samuel 17:20–54\n. Then you could let them retell the story using the pictures or line drawings in this outline. Ask them what they think the Lord wants them to learn from this story.\n2:36\nDavid and Goliath\nYou and your children could also make a list of some difficult challenges they might face during their life. Then help them find things David said that can help with these challenges (see\n1 Samuel 17:26, 32, 34–37, 45–47\n). Share how Jesus Christ has helped you during challenges.\nYour children could march like they are David going to fight Goliath while singing a song about being courageous, such as “\nI Will Be Valiant\n” (\nChildren’s Songbook\n, 162).\n1 Samuel 18:1–4\nGood friends can be a blessing from God.\nHow can you help your children learn from Jonathan and David’s friendship? One way would be to give each child two paper hearts, one to represent David and the other to represent Jonathan. Then read together a few phrases from\n1 Samuel 18:1–4\nthat emphasize the love these two friends felt for each other. Your children could then write or draw on their paper hearts how they can show love to a friend.\n2 Samuel 5:19, 23\nIf I need guidance, I can ask Heavenly Father.\nIn these chapters, David became the king of Israel. It might be fun for your children to pretend to be a king or queen. What laws would they make? Where would they go for help? Help your children discover that when David needed help, he “inquired,” or prayed, for answers. For example, as you read\n2 Samuel 5:19, 23\n, invite the children to listen for the word “inquired” and to fold their arms when they hear it. Why would David need the Lord’s help in his new role?\nTell each other about times when you prayed for Heavenly Father’s help. What difference did it make to have Him help you?\n2 Samuel 7:16–17\nJesus Christ is my Eternal King.\nThe kings we read about in the Old Testament all had flaws, and their kingdoms all ended. But Jesus Christ is a perfect King and will reign forever. You can help your children discover this by reading together what the prophet Nathan told King David in\n2 Samuel 7:16–17\n. How could David’s kingdom have no end? Help your children find and read scripture passages that teach that Jesus Christ, a descendant of David, is our King, such as\nLuke 1:32–33\n;\nJohn 18:33–37\n; and\nRevelation 19:16\n. How is Jesus different from earthly kings? How do we honor Jesus Christ as our Eternal King?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 25: Lesson 68: Lesson 68—RuthThis lesson is intended to help students feel a greater desire to trust in Jesus Christ and His redeeming power.",
      "content": "\n--- Lesson 68 ---\nBecause the price of salvation is too high for us alone to pay, we each need to be redeemed. The account of Ruth, Naomi, and Boaz in the Old Testament is a story of physical redemption that symbolizes Jesus Christ’s role as our personal Redeemer. This lesson is intended to help students feel a greater desire to trust in Jesus Christ and His redeeming power. Student preparation: Invite students to consider why one of Jesus Christ’s titles is Redeemer. Encourage them to ponder how Jesus Christ redeems us from physical and spiritual death. (They might refer to “ Redeem, Redeemed, Redemption ” in Guide to the Scriptures for help.) Encourage them to come prepared to share their thoughts with the class. Possible Learning Activities What does it mean that Jesus Christ is our Redeemer? You might begin class by displaying the following image of Jesus Christ or another of your choice and writing the word Redeemer on the board. Display the quote from Elder Christofferson and invite students to answer the two questions in their study journal. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles explained: Among the most significant of Jesus Christ’s descriptive titles is Redeemer. … The word redeem means to pay off an obligation or a debt. Redeem can also mean to rescue or set free. (“ Redemption ,” Ensign or Liahona , May 2013, 109) In what ways might you and others need to be redeemed by Jesus Christ? How much do you want to trust in Jesus Christ’s redeeming power in your life? Why? Invite students to consider how confident they are in their answers and what they might like to understand better or feel about the Savior and His redeeming power. You may want to summarize the next paragraph in your own words. You may also want to write the bolded truth on the board near the word Redeemer. Redemption is one of the prominent themes in the account of Ruth. As you study Ruth’s story, consider how likening this account to ourselves can help us learn that if we come to Jesus Christ, He will redeem us. Seek the help of the Holy Ghost to know ways we are like Ruth and need redemption and how Boaz is like the Savior Jesus Christ and redeems us. The account of Ruth You might read or explain the following summary. In a time of famine, an Israelite woman named Naomi, her husband, and her two sons moved from Bethlehem to Moab, a neighboring country with a different culture and religious beliefs. While there, the sons each married Moabite women, Ruth and Orpah. Tragically, Naomi’s husband and two sons died, leaving the three women widows. Naomi chose to return to Bethlehem. Unable to care for her daughters-in-law, Naomi encouraged them to return to their families in Moab. Orpah returned to her family. Read Ruth 1:8–9, 14–17 , looking for Ruth’s response to Naomi. What are some of the uncertainties and difficulties Ruth might face by going to Bethlehem with Naomi? After hearing what students share, you could explain some of the following: By going with Naomi, Ruth would leave behind family in Moab. Ruth would be a foreigner in an unfamiliar land with a different culture. Without husbands, Ruth and Naomi would face extreme poverty. Ruth’s choice showed her willingness to worship and rely on Jehovah (Jesus Christ), not the false gods of the Moabites. (You might invite students to mark the phrase “and thy God my God” in verse 16 .) Knowing Ruth’s circumstances, what stands out to you about her response? Boaz redeems Ruth To continue Ruth’s account, you could invite students to complete the handout “Ruth and Naomi Are Redeemed.” Students could work in pairs to write the important details of the story. Another option would be to give students the scripture blocks of the handout and have them summarize the verses in their own words with a partner. Open PDF After students complete the handout, you could explain any of the following that you feel would be useful: As part of the Law of Moses, Israelites were required to leave unharvested grain in the fields to care for the poor (see Leviticus 19:9–10 ). Naomi told Ruth that Boaz was one of their “next kinsmen” (see Ruth 2:20 ) or close relatives. The term “next kinsman” comes from the Hebrew word go-el , which means “redeemer.” A “next kinsman” was expected to care for (or even marry) widows in their family to restore them to safety and security. Because there was another kinsman more closely related who had the right to marry Ruth, Boaz purchased the right from him (see Ruth 3:12–13 ) before marrying Ruth (see Ruth 4:9–10, 13 ). It may be helpful to create a two-column chart on the board. Label the first column Ruth/Us and the second column Boaz/Jesus Christ . Students could list on the board what they find. In what ways might we be like Ruth? If students struggle to answer, consider asking them to think about how they may not have enough or be enough on their own. (This could include not having enough righteousness or obedience, not enough strength to overcome sin or weakness, not enough support to continue doing what is right, and so on.) You might also ask what Ruth did to seek redemption and how we may be similar. In what ways is Boaz like Jesus Christ? If students struggle to answer, consider inviting them to review Ruth 2:12, 15–16 . You might also point out that Boaz entered a covenant marriage or relationship with Ruth to always love and care for her. If needed, explain that the Savior redeems us in every way we need. Consider inviting students to read Mosiah 15:7–9 or Helaman 5:9–11 to identify how the Savior redeems us. You may also add that the Savior’s redemptive work includes helping us with our problems on earth (see D. Todd Christofferson, “ Redemption ,” Ensign or Liahona , May 2013, 109–110). How would you describe the difference in Ruth’s situation before and after Boaz helped and married her? What lessons can we learn about our relationship with Jesus Christ through the story of Ruth and Boaz? Jesus Christ is our Redeemer Providing students opportunities to answer the next three questions may invite the Holy Ghost. As students share and listen to each other share, the Holy Ghost can help students feel a greater desire to trust in Jesus Christ and His redeeming power. To help students prepare to answer the first question, you might show “ Finding Your Purpose in Life: Does Faith Matter? ” (5:08) or “ Moving on from Past Mistakes ” (3:43), both are available at ChurchofJesusChrist.org . 5:9 3:43 When have you or someone you know felt the redeeming power of Jesus Christ? Why might you, like Ruth, want to trust in Jesus Christ and His redeeming power in the future? What do you think someone could do to increase their desire to trust in the Savior’s redeeming power? To conclude, invite students to consider what thoughts or impressions they received from the Holy Ghost about trusting the Lord and His redeeming power. They may want to add thoughts to the questions they answered at the beginning of the lesson in their study journals.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 15694,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.385356"
}