{
  "week_number": 45,
  "date_range": "Ezekiel 1–3",
  "title": ";33–34;36–37;47",
  "primary_scriptures": [
    {
      "book": "Ezekiel",
      "chapters": [
        "1",
        "2",
        "3"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Ezekiel",
      "chapters": [
        "1",
        "2",
        "3"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;33–34;36–37;47 ---\nEzekiel was a prophet in exile. Along with other Israelites, he had been captured and sent to Babylon. In Jerusalem, Ezekiel would have been a priest serving in the temple. In Babylon, he was among “them of the captivity,” and he “sat where they sat” (\nEzekiel 3:15\n), hundreds of miles from the beloved house of God and with little hope of returning. Then one day Ezekiel had a vision. He saw “the glory of the Lord” (\nEzekiel 1:28\n)—not back in the temple at Jerusalem but there in Babylon among the exiles. The wickedness in Jerusalem, he learned, had become so severe that God’s presence was no longer there (see\nEzekiel 8–11\n;\n33:21\n).\nAnd yet there’s something hopeful about Ezekiel’s message. Despite how far the covenant people had fallen, God had not totally abandoned them. If they would “hear the word of the Lord” (\nEzekiel 37:4\n), what was once dead could be revived. Their “stony heart” could be replaced with “a new heart” (\nEzekiel 36:26\n). And in the future, the Lord would establish a new temple and a new Jerusalem, “and the name of the city from that day shall be, The Lord is there” (\nEzekiel 48:35\n).\nFor an overview of the book of Ezekiel, see “\nEzekiel\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nEzekiel 3\n;\n34\nThe Lord invites me to feed His sheep.\nIn\nEzekiel 3\nand\n34\n, the Lord refers to leaders of His people as watchmen and shepherds. As you read these chapters, consider what these titles suggest about what it means to be a leader.\nWho are the “sheep” the Lord wants you to feed? What do you find in\nEzekiel 34\nthat could help someone preparing to serve a mission, raising children, or fulfilling a ministering assignment? How can you follow the Savior’s example as our shepherd? (see\nverses 11–31\n).\nYou might also ponder the symbolism you find in this chapter. What might the “good pasture” and “good fold” represent in\nverse 14\n? What’s the difference between a sheep who is “lost” and one who is “driven away”? (\nverse 16\n). What other symbols do you find?\nSee also\nJohn 21:15–17\n; Gerrit W. Gong, “\nMinistering\n,”\nLiahona\n, May 2023, 16–19.\nEzekiel 33:10–19\nThe Lord wants to forgive.\n“If our … sins be upon us,” the captive Israelites wondered, “how should we then live?” (\nEzekiel 33:10\n). In response, the Lord taught them about repentance and forgiveness. These questions might help you ponder what He taught:\nWhat do you think it means to “trust to [your] own righteousness”? (see\nEzekiel 33:12–13\n).\nWhat would you say to someone who feels that the people described in\nEzekiel 33:12–19\nare not being treated fairly? (see also\nMatthew 21:28–31\n;\nLuke 18:9–14\n).\nWhat do you find in these verses that helps you understand what it means to repent? What additional insights do you find in\nEzekiel 36:26–27\nand\nAlma 7:14–16\n?\nEzekiel 37\nThe Lord is gathering His people and giving them new life.\nThe gathering of Israel is portrayed in\nEzekiel 37\nthrough two symbols. As you read about the first one—dead bones being restored to life (see\nverses 1–14\n)—ponder what it suggests to you about gathering Israel on both sides of the veil (see also\nEzekiel 36:24–30\n). Consider questions like these:\nWhat is the Lord trying to accomplish through the gathering of Israel?\nHow is He accomplishing it?\nYou could ask yourself these same questions as you read about the second symbol, in\nverses 15–28\n. This symbol involves two sticks, which many scholars interpret as wooden writing boards joined by a hinge. The stick of Judah can represent the Bible (since much of the Bible was written by Judah’s descendants), and the stick of Joseph can represent the Book of Mormon (since Lehi’s family were descendants of Joseph of Egypt). With that in mind, what do these verses teach you about the role of the scriptures in the gathering of Israel?\nThink about how the Bible and Book of Mormon have worked together in your life—in particular, to help you come to Christ. What passages have been especially meaningful to you?\nSee also\n2 Nephi 3:11–13\n;\n29:14\n; “\nIsrael, Israel, God Is Calling\n,”\nHymns\n, no. 7; Topics and Questions, “\nBible\n,” “\nBook of Mormon\n,” Gospel Library; “The Book of Mormon Gathers Scattered Israel” (video), Gospel Library.\n1:31\nThe Book of Mormon Gathers Scattered Israel\nIn a vision, Ezekiel saw a river flow from the temple and heal the Dead Sea.\nEzekiel 47:1–12\nI can find spiritual healing in the house of the Lord.\nAs you read\nEzekiel 47:1–12\n, it might help to know that the Dead Sea is so salty that fish and plants can’t live in it. What impresses you about the waters described in\nverses 1–12\n? (see also\nRevelation 22:1\n). What might these waters symbolize? What could the trees described in\nverse 12\nrepresent?\nWhat does Elder Dale G. Renlund’s message “\nFamily History and Temple Work: Sealing and Healing\n” add to your understanding? (see\nEnsign\nor\nLiahona\n, May 2018, 47–48). Ponder how you have found spiritual life and healing because of the temple.\nIdeas for Teaching Children\nEzekiel 3:17\n;\n33:1–5\nProphets are like watchmen who warn us of danger.\nYoung children might enjoy doing actions that go with\nEzekiel 3:17\n. For example, they could point to their eyes, ears, and mouth when you read the words “watchman,” “hear,” and “mouth.” They might also like going on a hike—outdoors or just around the room. As they walk, warn them about things on the trail, like rivers to jump over, branches to duck under, or animals to avoid (real or pretend). This could lead to a conversation about how the Lord’s prophet warns us of dangers we cannot see.\nHere’s another way to illustrate\nEzekiel 3:17\n;\n33:1–5\n. One of your children could pretend to be a “watchman” by looking out a window and telling everyone else what is happening outside. You could also watch the video “Watchman on the Tower” (\nChurchofJesusChrist.org\n). How is our living prophet like a watchman for us?\n4:17\nWatchman on the Tower\nThe Prophet Ezekiel\n, by Lyle Beddes\nEzekiel 37:15–23\nThe Bible and the Book of Mormon help “gather” us to Jesus Christ.\nAfter reading\nEzekiel 37:15–23\ntogether, you and your children could find two sticks and write on one\nFor Judah (Bible)\nand on the other\nFor Joseph (Book of Mormon)\n. You could then share stories or scriptures from the Bible and Book of Mormon that help you feel closer to the Savior and become “[His] people” (\nverse 23\n). Why is it good to have both of these two books of scripture?\nDon’t try to cover everything.\nYou may not be able to explore every truth in Ezekiel with your children. Prayerfully consider what they need to understand, and seek spiritual guidance to determine what to focus on. (See\nTeaching in the Savior’s Way\n,\n17\n.)\nEzekiel 47:1–12\nOur hearts and families can find healing in the house of the Lord.\nEzekiel 47\ndescribes Ezekiel’s vision of water flowing from the temple and healing the Dead Sea—a sea so salty that fish and plants cannot live in it. Maybe your children could each draw one or two objects from the vision, like a temple, a river, a desert, the Dead Sea, a multitude of fish, or a fruitful tree. Then, as you read\nverses 1–12\ntogether, they could share their drawing when that object is mentioned. What blessings came from the river in this vision? Help the children see how these blessings are like the blessings the Savior offers those who keep temple covenants. The video “And the River Will Grow” (Gospel Library) can help.\n3:43\nAnd the River Will Grow\nYou could also sing together a song that describes temple blessings, such as “\nFamilies Can Be Together Forever\n” (\nChildren’s Songbook\n, 188). What does this song teach about how the Lord blesses us in His holy house?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 45: Lesson 138: Lesson 138—Ezekiel 1–3; 33This lesson can help students feel a greater desire to heed the warnings of the Lord’s prophets.; Lesson 139: Lesson 139—Ezekiel 34This lesson can help students follow the Savior’s example to seek out and care for others.... ---\n\n--- Lesson 138 ---\nHow can we stay safe with so many spiritual dangers in the world? The Lord calls prophets to serve as watchmen to warn and protect us. The Lord called Ezekiel to serve as a watchman for the Israelites while in Babylonian captivity (see Ezekiel 3:16–17 ). This lesson can help students feel a greater desire to heed the warnings of the Lord’s prophets. Student preparation: Invite students to read “ Prophet ” in Guide to the Scriptures or “ Prophets ” in Topics and Questions in Gospel Library. They could look for the role of prophets and reflect on how they see prophets fulfill this role. Possible Learning Activities Feelings about the Lord’s prophet Consider beginning class by inviting students to reflect on their feelings about the Lord’s prophet today. One way to do this could be to display an image of the President of the Church and invite students to sing or listen to “ We Thank Thee, O God, for a Prophet ” ( Hymns, no. 19 ). You could then provide the instructions below. Acknowledge that students’ feelings about the prophet might vary from one another, and that is OK. Encourage them to respond honestly. 96:16 In your study journal, complete the following statement with one or more responses: When I see the prophet, listen to him speak, or read his words, I feel … Invite willing students to share with the class what they wrote. You might explain that as they share and listen, the Holy Ghost can enlighten their minds and soften their hearts to follow the Lord’s prophet. The Lord calls Ezekiel as a prophet Ezekiel had been captured and taken to Babylon along with other Israelites. While in captivity, he was visited by the Lord and called to be a prophet (see Ezekiel 1–2 ). The Lord promised to strengthen Ezekiel as he preached to a rebellious and hard-hearted people (see Ezekiel 3:7–9 ). Ezekiel 3:16–17 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Ezekiel 3:10–11, 16–17 , looking for what the Lord taught Ezekiel about his role as a prophet. What did you find? To help students understand the imagery of a watchman, consider displaying the image of Carcassonne included in this lesson, along with this statement from Elder Neil L. Andersen. Elder Neil L. Andersen of the Quorum of the Twelve Apostles explained: 16:4 Carcassonne is a remarkable walled city in France that has stood since medieval times. Tall towers surge upward from its protected walls, built for watchmen who stood on those towers day and night, keeping their attention riveted in the distance for the enemy. When the watchman saw an enemy approaching, his warning voice protected the people of Carcassonne from the impending danger they could not see. A prophet is a watchman on the tower, protecting us from spiritual dangers we may not see. (“ The Prophet of God ,” Ensign or Liahona , May 2018, 25) How could you summarize what Ezekiel 3:16–17 and Elder Andersen teach about prophets? Help students identify that the Lord calls prophets who serve as watchmen to warn us of spiritual dangers . Explain that the First Presidency and Quorum of the Twelve Apostles serve as the Lord’s prophets today. If students completed the student preparation activity, they could share what they learned as part of the following discussion. Why is “watchmen” a good way to describe the role of prophets? In Ezekiel 33 , the Lord again taught Ezekiel his responsibility to serve as a watchman and share God’s message with Israel (see Ezekiel 33:1–7 ). Read Ezekiel 33:9–11 , looking for why the Lord wants to warn His people. What can verse 11 teach us about Heavenly Father and Jesus Christ? Elder D. Todd Christofferson of the Quorum of the Twelve Apostles shared how prophetic warnings are evidence of God’s love: 15:15 Far from being anxious to condemn, our Heavenly Father and our Savior seek our happiness and plead with us to repent, knowing full well that “wickedness never was [and never will be] happiness” [ Alma 41:10 ]. So Ezekiel and every prophet before and since, speaking the word of God out of a full heart, have warned all who will to turn away from Satan, the enemy of their souls, and “choose liberty and eternal life, through the great Mediator of all men” [ 2 Nephi 2:27 ]. (“ The Voice of Warning ,” Ensign or Liahona , May 2017, 108) How can understanding why the Lord calls His prophets to be watchmen influence our desires to follow them? Warnings from the watchmen The following activity is intended to help students see examples of warnings the Lord has given through His prophets. Consider inviting students to choose one of the following options to study: Recent talks from members of the First Presidency or Quorum of the Twelve Apostles These doctrinal mastery scripture passages or other passages of your choosing: Isaiah 5:20 ; 1 Corinthians 6:19–20 (see also verse 18 ); 2 Nephi 2:27 ; 2 Nephi 32:8–9 ; Alma 41:10 ; and Doctrine and Covenants 64:9–11 After students have chosen an option to study, display the following instructions: Study teachings from the Lord’s prophets and prepare to share the following: Warnings the Lord has given through His prophets. Blessings we can receive or challenges we can avoid by heeding these warnings. These could be from what you studied or from your thoughts and experiences. How you feel this warning is evidence of God’s love or His desire for us to be happy. You could invite each student to select one prophetic warning they found in step 1 of their study and write it on the board. As another option, students could write the warning on a piece of paper and post it around the room. Invite students to read the warnings others have written. The class could then select a few to discuss in greater detail. You could ask the students who wrote the selected warnings to share their answers to steps 2 or 3 from their study. As students listen and participate in the discussion, invite them to reflect on their personal circumstances and needs. Encourage them to consider whether the Lord has specific warnings or messages for them. Following the prophet Reflect on thoughts and feelings the Holy Ghost may have communicated to you throughout the lesson about the Lord and His prophets. Add one or both of the following lines to your study journal and complete them with your thoughts or feelings: Something I want to remember about the Lord and His prophets is … I want to follow the Lord’s prophet because … You could conclude by asking a few students to share what they wrote. You could also share feelings you have had about the Lord and His prophets as you prepared and taught the lesson. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Ezekiel 3:16–17 is “The prophet is ‘a watchman unto the house of Israel.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 139 ---\nWe all feel lost, broken, sick, or needy at times. Heavenly Father sent Jesus Christ to “bind up that which was broken” and “strengthen that which was sick” ( Ezekiel 34:16 ). In Ezekiel 34 , the prophet Ezekiel likens how a good shepherd cares for his flock to how Jesus Christ cares for Heavenly Father’s children. This lesson can help students follow the Savior’s example to seek out and care for others. Student preparation: Invite students to think of ways that “the Good Shepherd” ( John 10:11, 14 ) is an appropriate name for Jesus Christ. They could ponder how this name for the Savior helps them understand His love and desire to care for Heavenly Father’s children. Possible Learning Activities A symbol for the Savior Consider sharing the following experience and statement. Invite students to identify actions of the shepherd that are symbolic of the Savior’s love for them. Alternatively, you could show “ Shepherds of Israel ” from time code 1:07 to 4:09. 9:15 On a trip to Morocco, Elder John R. Lasater of the Seventy learned about Jesus Christ’s love for Heavenly Father’s children when a sheep was hit by a royal car, entitling the shepherd to a large compensation. Elder Lasater’s interpreter said the shepherd wouldn’t accept the money. Elder Lasater then shared what happened next: Startled, I asked him why. And he added, “Because of the love he has for each of his sheep.” It was then that I noticed the old shepherd reach down, lift the injured lamb in his arms, and place it in a large pouch on the front of his robe. He kept stroking its head, repeating the same word over and over again. When I asked the meaning of the word, I was informed, “Oh, he is calling it by name. All of his sheep have a name, for he is their shepherd, and the good shepherds know each one of their sheep by name.” (“ Shepherds of Israel ,” Ensign , May 1988, 74) What can you learn about Jesus Christ from the actions of the shepherd? As you study today, seek the help of the Holy Ghost to learn how we can follow the example of Jesus Christ to care for Heavenly Father’s children. Shepherds In Ezekiel 34 , the Lord compared the leaders of Israel to shepherds who were not taking care of their flocks. Read Ezekiel 34:1–6 , marking phrases the Lord used to describe the Israelite leaders. What do you learn about the Lord from His concerns expressed in these verses? To help the leaders of Israel better care for their flocks, Jesus Christ described how He cares for His flock (see John 10:11, 14 , where Jesus also describes Himself as “the Good Shepherd”). Consider displaying a picture of Jesus Christ depicting Him as a shepherd, like the picture at the beginning of this lesson. On the left side of the picture, consider writing “ As the Good Shepherd, the Savior … ” Students could summarize what they mark in Ezekiel 34:11–16 under this heading. Read Ezekiel 34:11–16 , marking phrases that describe what Jesus Christ does for Heavenly Father’s children. Summaries students provide from the verses could include: Seeks out those that are lost ( verses 11–12, 16 ) Delivers them from darkness ( verse 12 ) Nourishes them and provides for their needs ( verses 13–15 ) Binds up the broken ( verse 16 ) Strengthens the sick ( verse 16 ) You might invite students to share some stories from the scriptures of how the Savior demonstrated some of these actions toward Heavenly Father’s children. To help students reflect on their efforts in following the Savior’s example to care for others, consider displaying the following self-assessment. Compare what you have marked in the two sets of verses you have studied in Ezekiel 34 , then ponder how you would respond to the following questions: What are some ways you feel you are like the Savior? Are there ways where you might be more like the shepherds in Israel? What are possible obstacles you face in caring for others like the Savior? Caring for His sheep Consider writing “ I can follow the Savior’s example by … ” on the right side of the picture of the Savior. Place students in small groups and provide the following instructions. Using what you found in Ezekiel 34:11–16 , make a list of practical ways youth can care for others as the Savior does. Some possible ideas students might come up with could be the following: Visiting with someone they haven’t seen in a while (“I will both search my sheep, and seek them out” [ Ezekiel 34:11 ]) Being generous with their time or resources (“I will feed my flock” [ Ezekiel 34:15 ]) Inviting someone to participate in an activity with you (“I will… bring again that which was driven away” [ Ezekiel 34:16 ]) Being aware of physical or emotional needs of others (“I will… bind up that which was broken, and will strengthen that which was sick” [ Ezekiel 34:16 ]) After making this list in groups, you may want to have each group list one of their ideas on the board. After there are several ideas listed on the board, it may be helpful to have students discuss the following questions: What can make it difficult to do these things? How can the Savior help you overcome these difficulties? Consider displaying the following questions and inviting students to select at least one to answer. As students reflect on personal experiences, the Holy Ghost can help them feel the truth and importance of what they are learning. How has the Savior blessed you or your family by sending someone to seek out and care for you? How has the Savior used you or your family to seek out and care for others? If you feel it would help students to see an example of youth caring for others as Jesus does, consider showing “ Face to Face with President and Sister Oaks (Strive to Be) ” from time code 57:50 to 59:55, available at ChurchofJesusChrist.org . In this video, youth share ideas on how they seek out and care for others. 80:11 Make a plan Making a plan in class to act on what they have learned can help students deepen their conversion to Jesus Christ. Take a moment to think of people in your life who may be like the sheep (lost, scattered, broken, weak) in Ezekiel 34 . These might be people in your class or quorum, your family and friends, or people at school. Seek the Holy Ghost’s help in considering who might need your help. From the ideas we’ve discussed, or another you feel inspired to do, write how you can follow the Savior’s example to seek out and care for this individual. To remind yourself of your plan, you could write it down on a piece of paper or set it as a reminder on your phone. You may want to plan a few minutes in an upcoming lesson to follow up with students about their plans and check on their progress. To conclude, you could share how someone has cared for you or how you have cared for others as the Savior does.\n\n\n--- Lesson 140 ---\nIn Ezekiel 37 , Ezekiel saw a future gathering and reuniting of all the tribes of Israel to the Lord (see Ezekiel 37:20-28 ). Modern prophets have also interpreted Ezekiel’s vision as the stick of Judah (the Bible) and the stick of Joseph (the Book of Mormon) being united as companion testaments of Jesus Christ and His restored gospel (see Ezekiel 37:15–17 ). This lesson can help students understand ways the Bible and the Book of Mormon work together as witnesses of Jesus Christ and His gospel. Student preparation: Invite students to imagine they are asked, “Why do you need the Book of Mormon if you believe in the Bible?” and prepare to share how they would respond. They could ask a friend or family member how they would respond to the question. Possible Learning Activities A sure second witness Imagine you see a social media post that asks, “Why do you need the Book of Mormon if you believe in the Bible?” You could invite students to ponder this question while you write it on the board. Then, invite students to ask themselves: How confident do you feel in your ability to answer this question? If a friend were to ask you this question, what would you share? As you study Ezekiel 37 today, invite the Spirit to help you recognize ways the Bible and Book of Mormon testify of Jesus Christ and His gospel. At the end of the lesson, you will have a chance to practice responding to this question. The stick of Judah and the stick of Joseph The prophet Ezekiel was sent to preach repentance to the Israelites who were captives in Babylon. In Ezekiel 37 , the prophet recorded a vision in which the Lord taught that the House of Israel, spiritually dead because of apostasy, would return to life through the Restoration of the gospel. As part of the vision, Ezekiel saw two sticks or wooden tablets upon which messages would be written. As students study the following passage, you may want to point out that the “stick of Judah” refers to the Bible. The “stick of Joseph” refers to the Book of Mormon (see Guide to the Scriptures, “ Ephraim ”; “ Judah ”). Students could include this information as a note in their scriptures next to verse 16 . Ezekiel 37:15–17 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Ezekiel 37:15–20 , looking for the Lord’s promise about the scriptures in the latter days. What do you think the phrase “they shall become one in thine hand” ( verse 17 ) could mean? To help us understand how the Bible and the Book of Mormon would become “one” testament of the Savior, President Russell M. Nelson taught: 14:33 The Bible and the Book of Mormon are both witnesses of Jesus Christ. They teach that He is the Son of God, that He lived an exemplary life, that He atoned for all mankind, that He died upon the cross and rose again as the resurrected Lord. They teach that He is the Savior of the world. Scriptural witnesses authenticate each other. This concept was explained long ago when a prophet wrote that the Book of Mormon was “written for the intent that ye may believe [the Bible]; and if ye believe [the Bible] ye will believe [the Book of Mormon] also” ( Mormon 7:9 ). Each book refers to the other. Each book stands as evidence that God lives and speaks to His children by revelation to His prophets. … Today, Saints living in many nations of the earth gratefully hold the Bible (the stick of Judah) and the Book of Mormon (the stick of Ephraim) bound as one in their hands. (“ Scriptural Witnesses ,” Ensign or Liahona , Nov. 2007, 43, 44) How would you summarize what we learn from Ezekiel 37:15–20 and President Nelson? Although students may use different words, help them share a truth such as the Bible and the Book of Mormon both witness of Jesus Christ . Why do you think it’s important to have both the Bible and Book of Mormon witnessing of Jesus Christ? Companion witnesses of Jesus Christ The following activity could help students increase their understanding of how the Bible and the Book of Mormon both testify of Jesus Christ and His gospel. You could provide some or all of the chart below. Students could select one or more topics to study individually, with a partner, or in a small group. Gospel Topic Companion Scriptures Gospel Topic The Atonement of Jesus Christ Companion Scriptures Bible: Isaiah 53:3–5 Book of Mormon: Alma 7:11–13 Gospel Topic Resurrection of all because of Jesus Christ Companion Scriptures Bible: 1 Corinthians 15:20–22 Book of Mormon: Alma 11:42–45 Gospel Topic The Savior promises to gather and redeem His people Companion Scriptures Bible: Ezekiel 37:21–23, 26–27 Book of Mormon: 1 Nephi 10:14 Gospel Topic The attributes of Jesus Christ Companion Scriptures Bible: Isaiah 63:7 Book of Mormon: Mosiah 4:11 Gospel Topic The Savior’s ordinance of baptism Companion Scriptures Bible: Matthew 3:13–17 Book of Mormon: 2 Nephi 31:5–12 Gospel Topic You choose a topic Companion Scriptures Bible: Book of Mormon: Open PDF Think of a way to help students share what they have learned. One way to do this is to provide the accompanying handout for students to use to create a social media post. If students are unfamiliar with social media, you can adapt this activity to have students role-play what they would share with someone. The activity invites students to answer the question posed at the beginning of the lesson. Select one of the topics you studied and create a social media post that could be used to answer the question, “Why do you need the Book of Mormon if you believe in the Bible?” Include the verses from the Bible and Book of Mormon you studied. Explain the value you find and how they both teach about Jesus Christ and His gospel. Share what you have learned You could tape the students’ posts or posters on the wall around the room or place them on desks. Then, invite students to walk around the room and review their classmates’ work. Provide small papers or sticky notes for students to use as they complete the following instructions. Write a “comment” to one or more of the other social media posts. In your comment, complete at least one of the following options: Add an additional scripture reference from either the Bible or the Book of Mormon that could help someone understand more about the Savior and this topic. Include a few thoughts about the value of the scripture you shared. Share how the Bible and the Book of Mormon have helped you understand the Savior and this teaching. Write an experience you have had when scriptures from the Bible or Book of Mormon helped increase your testimony of the Savior and His gospel. Instead of writing your thoughts on a paper, share something you have learned today about the Savior and His gospel teachings on your personal social media account. Include scripture passages and how the Bible and Book of Mormon have helped you better understand the gospel of Jesus Christ. You could conclude the class by inviting students to continue to use the Bible and the Book of Mormon to increase their understanding of Jesus Christ and His gospel. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for “ Ezekiel 37:15–17 ” is “The Bible and the Book of Mormon shall become one in thine hand.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 141 ---\nThe Lord gives us many blessings through our worship in the temple. Ezekiel saw in a vision a latter-day temple that will be built in Jerusalem. He saw water flowing from this temple, healing the surrounding land and bringing life to the Dead Sea. The vision symbolizes the blessings the Lord gives us as we worship Him in His temple. This lesson can help students feel a greater desire to worship God in the temple. Student preparation: Consider giving students the following questions and inviting them to come prepared to share their answers: Possible Learning Activities Desire to worship in the temple Begin the lesson in a way that helps students think about their desire to attend and worship in the temple. To do this, you could display a picture of a temple. Then, write students’ answers to one of the following questions on one side of the temple and their answers to the other question on the other side. What are some reasons a teenager may want to attend and worship in the temple? What are some reasons they may not want to attend the temple? What might make it difficult? Self-assessment questions can help students identify opportunities for personal growth and learning. Invite students to take a moment to ponder the following questions about themselves. How strong is your desire to worship in the temple? Why? What may keep you from wanting to attend the temple? As you study Ezekiel today, seek the Lord’s help to increase your desire to attend and worship in the temple. Ezekiel’s vision of the temple Note: To help students feel the Lord’s love, it is important in this lesson to refer to blessings as coming from the Lord through the temple, not from the temple itself. In Ezekiel 47 , Ezekiel saw a vision that could symbolize the blessings the Lord gives to all who do temple and family history work. It began with a heavenly messenger bringing Ezekiel to the temple door in Jerusalem. Read Ezekiel 47:1 , looking for what Ezekiel saw coming from the temple. How might water be a fitting symbol for the blessings of the Lord? Some possible answers might include that water gives life, is needed by everyone, cleans, and is available to all. During His mortal ministry, the Savior compared Himself and the blessings He offers to living water (see John 4:10 ; 7:37–39 ). It may be useful for the following activity to explain that a cubit is a unit of measurement, from the elbow to the tips of the fingers, approximately 18 to 21 inches or 45 to 53 centimeters. Read Ezekiel 47:2–5 , looking for how deep the water became as it flowed out of the temple. Because the Lord’s teaching in this account is very visual, it can help to draw what we are learning. On the top half of a page in your study journal, draw a simple representation of a temple and the water coming from it. (You will draw more of where the water goes in the bottom half later.) If useful, students could watch “ And the River Will Grow ,” available at ChurchofJesusChrist.org , from time code 0:26–1:29. 3:43 What do you think the Lord was teaching in this vision about the blessings He gives through the temple? Ask students: If you were to draw something on your picture to symbolize where nothing lives or thrives, what would it be, and why? If the same question were asked to those in Jerusalem in Ezekiel’s day, the answer may likely be the Judean wilderness or the Dead Sea. The Dead Sea has its name because of its inability to sustain animal or plant life. It also contains salt water and is undrinkable. If useful, show or direct students to the picture “ Judean Wilderness ” (Bible Photographs, no. 3) in Study Helps in the Gospel Library or in the Bible Appendix to see the wilderness by the Dead Sea. They could also look at “ Physical Map of the Holy Land ” (Bible Maps, no. 1) and find the Wilderness of Judea and the Dead Sea. Read Ezekiel 47:8–9, 12 , looking for what would happen to everything the water from the temple touched, including the Dead Sea. Invite students to complete their picture, drawing what they just read in the bottom half of their paper. The following is an example of an open-ended question that helps learners discover gospel doctrine and principles for themselves. This approach can make students’ study of the scriptures more relevant and allow the Lord to teach and inspire them personally. (For additional training on this skill, see: “ Create open-ended search questions that help learners discover gospel doctrine and principles for themselves and do not lead students to a specific response ” in Teacher Development Skills .) How would you summarize what you learned from Ezekiel’s vision? Students may share a variety of principles. Thank them for their responses and ask why what they learned is important. One of the principles students could identify is: As we worship the Lord in the temple, He blesses us with healing, new life, and growth. Students may want to write this principle or one they identified in their scriptures next to Ezekiel 47:1–9 . If useful for further understanding, continue the video of Elder Dale G. Renlund of the Quorum of the Twelve Apostles and his family from time code 1:58–2:33. 3:43 Deepen your understanding Prepare a copy of the handout “ Blessings of the Temple ” for each student. Read the handout “ Blessings of the Temple ” and underline or circle any blessings that stand out to you. Open PDF On their drawings, students can write these blessings in the water coming from the temple. They can also add any additional blessings they can think of that the Lord gives us through the temple. Consider inviting students to share their drawings and written blessings with a partner or small group. Alternatively, you could draw the river on the board and ask students to write the blessings they thought of there. Students can then add to their drawings blessings they would like to remember from what others shared. What blessings stood out to you? Invite students to think of answers to the following questions for a few moments before you ask them. As they share, you might ask questions such as the following: “Why is that meaningful to you?” “Has anyone else had a similar experience?” and “What would you like to add to what has been shared?” If students live in an area where many have not attended the temple because of distance, and they do not know many people who have attended the temple, consider altering the second question to ask about blessings students or others have experienced as they have prepared to worship in the temple. How might any of the blessings you identified heal or give life? When have you or those you know experienced one of these blessings from the Lord through worshipping in the temple? If students would benefit from seeing other examples of some blessings available from temple worship, you could show one of the following videos: “ Temples Are a Beacon ” (2:50) 2:50 “ Family History and Temple Work: Healing and Sealing ” (14:43) from time code 7:36–12:20. 14:43 How you feel about the temple To conclude the lesson, consider finding a place on your picture or in your study journal to write your feelings about attending and worshipping in the temple and receiving the Lord’s blessings. Seek the help of the Holy Ghost to write your feelings well and accurately. Consider inviting any students who would like to share their thoughts and testimony. Consider sharing your own as well.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";33–34;36–37;47",
      "content": "Ezekiel was a prophet in exile. Along with other Israelites, he had been captured and sent to Babylon. In Jerusalem, Ezekiel would have been a priest serving in the temple. In Babylon, he was among “them of the captivity,” and he “sat where they sat” (\nEzekiel 3:15\n), hundreds of miles from the beloved house of God and with little hope of returning. Then one day Ezekiel had a vision. He saw “the glory of the Lord” (\nEzekiel 1:28\n)—not back in the temple at Jerusalem but there in Babylon among the exiles. The wickedness in Jerusalem, he learned, had become so severe that God’s presence was no longer there (see\nEzekiel 8–11\n;\n33:21\n).\nAnd yet there’s something hopeful about Ezekiel’s message. Despite how far the covenant people had fallen, God had not totally abandoned them. If they would “hear the word of the Lord” (\nEzekiel 37:4\n), what was once dead could be revived. Their “stony heart” could be replaced with “a new heart” (\nEzekiel 36:26\n). And in the future, the Lord would establish a new temple and a new Jerusalem, “and the name of the city from that day shall be, The Lord is there” (\nEzekiel 48:35\n).\nFor an overview of the book of Ezekiel, see “\nEzekiel\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nEzekiel 3\n;\n34\nThe Lord invites me to feed His sheep.\nIn\nEzekiel 3\nand\n34\n, the Lord refers to leaders of His people as watchmen and shepherds. As you read these chapters, consider what these titles suggest about what it means to be a leader.\nWho are the “sheep” the Lord wants you to feed? What do you find in\nEzekiel 34\nthat could help someone preparing to serve a mission, raising children, or fulfilling a ministering assignment? How can you follow the Savior’s example as our shepherd? (see\nverses 11–31\n).\nYou might also ponder the symbolism you find in this chapter. What might the “good pasture” and “good fold” represent in\nverse 14\n? What’s the difference between a sheep who is “lost” and one who is “driven away”? (\nverse 16\n). What other symbols do you find?\nSee also\nJohn 21:15–17\n; Gerrit W. Gong, “\nMinistering\n,”\nLiahona\n, May 2023, 16–19.\nEzekiel 33:10–19\nThe Lord wants to forgive.\n“If our … sins be upon us,” the captive Israelites wondered, “how should we then live?” (\nEzekiel 33:10\n). In response, the Lord taught them about repentance and forgiveness. These questions might help you ponder what He taught:\nWhat do you think it means to “trust to [your] own righteousness”? (see\nEzekiel 33:12–13\n).\nWhat would you say to someone who feels that the people described in\nEzekiel 33:12–19\nare not being treated fairly? (see also\nMatthew 21:28–31\n;\nLuke 18:9–14\n).\nWhat do you find in these verses that helps you understand what it means to repent? What additional insights do you find in\nEzekiel 36:26–27\nand\nAlma 7:14–16\n?\nEzekiel 37\nThe Lord is gathering His people and giving them new life.\nThe gathering of Israel is portrayed in\nEzekiel 37\nthrough two symbols. As you read about the first one—dead bones being restored to life (see\nverses 1–14\n)—ponder what it suggests to you about gathering Israel on both sides of the veil (see also\nEzekiel 36:24–30\n). Consider questions like these:\nWhat is the Lord trying to accomplish through the gathering of Israel?\nHow is He accomplishing it?\nYou could ask yourself these same questions as you read about the second symbol, in\nverses 15–28\n. This symbol involves two sticks, which many scholars interpret as wooden writing boards joined by a hinge. The stick of Judah can represent the Bible (since much of the Bible was written by Judah’s descendants), and the stick of Joseph can represent the Book of Mormon (since Lehi’s family were descendants of Joseph of Egypt). With that in mind, what do these verses teach you about the role of the scriptures in the gathering of Israel?\nThink about how the Bible and Book of Mormon have worked together in your life—in particular, to help you come to Christ. What passages have been especially meaningful to you?\nSee also\n2 Nephi 3:11–13\n;\n29:14\n; “\nIsrael, Israel, God Is Calling\n,”\nHymns\n, no. 7; Topics and Questions, “\nBible\n,” “\nBook of Mormon\n,” Gospel Library; “The Book of Mormon Gathers Scattered Israel” (video), Gospel Library.\n1:31\nThe Book of Mormon Gathers Scattered Israel\nIn a vision, Ezekiel saw a river flow from the temple and heal the Dead Sea.\nEzekiel 47:1–12\nI can find spiritual healing in the house of the Lord.\nAs you read\nEzekiel 47:1–12\n, it might help to know that the Dead Sea is so salty that fish and plants can’t live in it. What impresses you about the waters described in\nverses 1–12\n? (see also\nRevelation 22:1\n). What might these waters symbolize? What could the trees described in\nverse 12\nrepresent?\nWhat does Elder Dale G. Renlund’s message “\nFamily History and Temple Work: Sealing and Healing\n” add to your understanding? (see\nEnsign\nor\nLiahona\n, May 2018, 47–48). Ponder how you have found spiritual life and healing because of the temple.\nIdeas for Teaching Children\nEzekiel 3:17\n;\n33:1–5\nProphets are like watchmen who warn us of danger.\nYoung children might enjoy doing actions that go with\nEzekiel 3:17\n. For example, they could point to their eyes, ears, and mouth when you read the words “watchman,” “hear,” and “mouth.” They might also like going on a hike—outdoors or just around the room. As they walk, warn them about things on the trail, like rivers to jump over, branches to duck under, or animals to avoid (real or pretend). This could lead to a conversation about how the Lord’s prophet warns us of dangers we cannot see.\nHere’s another way to illustrate\nEzekiel 3:17\n;\n33:1–5\n. One of your children could pretend to be a “watchman” by looking out a window and telling everyone else what is happening outside. You could also watch the video “Watchman on the Tower” (\nChurchofJesusChrist.org\n). How is our living prophet like a watchman for us?\n4:17\nWatchman on the Tower\nThe Prophet Ezekiel\n, by Lyle Beddes\nEzekiel 37:15–23\nThe Bible and the Book of Mormon help “gather” us to Jesus Christ.\nAfter reading\nEzekiel 37:15–23\ntogether, you and your children could find two sticks and write on one\nFor Judah (Bible)\nand on the other\nFor Joseph (Book of Mormon)\n. You could then share stories or scriptures from the Bible and Book of Mormon that help you feel closer to the Savior and become “[His] people” (\nverse 23\n). Why is it good to have both of these two books of scripture?\nDon’t try to cover everything.\nYou may not be able to explore every truth in Ezekiel with your children. Prayerfully consider what they need to understand, and seek spiritual guidance to determine what to focus on. (See\nTeaching in the Savior’s Way\n,\n17\n.)\nEzekiel 47:1–12\nOur hearts and families can find healing in the house of the Lord.\nEzekiel 47\ndescribes Ezekiel’s vision of water flowing from the temple and healing the Dead Sea—a sea so salty that fish and plants cannot live in it. Maybe your children could each draw one or two objects from the vision, like a temple, a river, a desert, the Dead Sea, a multitude of fish, or a fruitful tree. Then, as you read\nverses 1–12\ntogether, they could share their drawing when that object is mentioned. What blessings came from the river in this vision? Help the children see how these blessings are like the blessings the Savior offers those who keep temple covenants. The video “And the River Will Grow” (Gospel Library) can help.\n3:43\nAnd the River Will Grow\nYou could also sing together a song that describes temple blessings, such as “\nFamilies Can Be Together Forever\n” (\nChildren’s Songbook\n, 188). What does this song teach about how the Lord blesses us in His holy house?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 45: Lesson 138: Lesson 138—Ezekiel 1–3; 33This lesson can help students feel a greater desire to heed the warnings of the Lord’s prophets.; Lesson 139: Lesson 139—Ezekiel 34This lesson can help students follow the Savior’s example to seek out and care for others....",
      "content": "\n--- Lesson 138 ---\nHow can we stay safe with so many spiritual dangers in the world? The Lord calls prophets to serve as watchmen to warn and protect us. The Lord called Ezekiel to serve as a watchman for the Israelites while in Babylonian captivity (see Ezekiel 3:16–17 ). This lesson can help students feel a greater desire to heed the warnings of the Lord’s prophets. Student preparation: Invite students to read “ Prophet ” in Guide to the Scriptures or “ Prophets ” in Topics and Questions in Gospel Library. They could look for the role of prophets and reflect on how they see prophets fulfill this role. Possible Learning Activities Feelings about the Lord’s prophet Consider beginning class by inviting students to reflect on their feelings about the Lord’s prophet today. One way to do this could be to display an image of the President of the Church and invite students to sing or listen to “ We Thank Thee, O God, for a Prophet ” ( Hymns, no. 19 ). You could then provide the instructions below. Acknowledge that students’ feelings about the prophet might vary from one another, and that is OK. Encourage them to respond honestly. 96:16 In your study journal, complete the following statement with one or more responses: When I see the prophet, listen to him speak, or read his words, I feel … Invite willing students to share with the class what they wrote. You might explain that as they share and listen, the Holy Ghost can enlighten their minds and soften their hearts to follow the Lord’s prophet. The Lord calls Ezekiel as a prophet Ezekiel had been captured and taken to Babylon along with other Israelites. While in captivity, he was visited by the Lord and called to be a prophet (see Ezekiel 1–2 ). The Lord promised to strengthen Ezekiel as he preached to a rebellious and hard-hearted people (see Ezekiel 3:7–9 ). Ezekiel 3:16–17 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Ezekiel 3:10–11, 16–17 , looking for what the Lord taught Ezekiel about his role as a prophet. What did you find? To help students understand the imagery of a watchman, consider displaying the image of Carcassonne included in this lesson, along with this statement from Elder Neil L. Andersen. Elder Neil L. Andersen of the Quorum of the Twelve Apostles explained: 16:4 Carcassonne is a remarkable walled city in France that has stood since medieval times. Tall towers surge upward from its protected walls, built for watchmen who stood on those towers day and night, keeping their attention riveted in the distance for the enemy. When the watchman saw an enemy approaching, his warning voice protected the people of Carcassonne from the impending danger they could not see. A prophet is a watchman on the tower, protecting us from spiritual dangers we may not see. (“ The Prophet of God ,” Ensign or Liahona , May 2018, 25) How could you summarize what Ezekiel 3:16–17 and Elder Andersen teach about prophets? Help students identify that the Lord calls prophets who serve as watchmen to warn us of spiritual dangers . Explain that the First Presidency and Quorum of the Twelve Apostles serve as the Lord’s prophets today. If students completed the student preparation activity, they could share what they learned as part of the following discussion. Why is “watchmen” a good way to describe the role of prophets? In Ezekiel 33 , the Lord again taught Ezekiel his responsibility to serve as a watchman and share God’s message with Israel (see Ezekiel 33:1–7 ). Read Ezekiel 33:9–11 , looking for why the Lord wants to warn His people. What can verse 11 teach us about Heavenly Father and Jesus Christ? Elder D. Todd Christofferson of the Quorum of the Twelve Apostles shared how prophetic warnings are evidence of God’s love: 15:15 Far from being anxious to condemn, our Heavenly Father and our Savior seek our happiness and plead with us to repent, knowing full well that “wickedness never was [and never will be] happiness” [ Alma 41:10 ]. So Ezekiel and every prophet before and since, speaking the word of God out of a full heart, have warned all who will to turn away from Satan, the enemy of their souls, and “choose liberty and eternal life, through the great Mediator of all men” [ 2 Nephi 2:27 ]. (“ The Voice of Warning ,” Ensign or Liahona , May 2017, 108) How can understanding why the Lord calls His prophets to be watchmen influence our desires to follow them? Warnings from the watchmen The following activity is intended to help students see examples of warnings the Lord has given through His prophets. Consider inviting students to choose one of the following options to study: Recent talks from members of the First Presidency or Quorum of the Twelve Apostles These doctrinal mastery scripture passages or other passages of your choosing: Isaiah 5:20 ; 1 Corinthians 6:19–20 (see also verse 18 ); 2 Nephi 2:27 ; 2 Nephi 32:8–9 ; Alma 41:10 ; and Doctrine and Covenants 64:9–11 After students have chosen an option to study, display the following instructions: Study teachings from the Lord’s prophets and prepare to share the following: Warnings the Lord has given through His prophets. Blessings we can receive or challenges we can avoid by heeding these warnings. These could be from what you studied or from your thoughts and experiences. How you feel this warning is evidence of God’s love or His desire for us to be happy. You could invite each student to select one prophetic warning they found in step 1 of their study and write it on the board. As another option, students could write the warning on a piece of paper and post it around the room. Invite students to read the warnings others have written. The class could then select a few to discuss in greater detail. You could ask the students who wrote the selected warnings to share their answers to steps 2 or 3 from their study. As students listen and participate in the discussion, invite them to reflect on their personal circumstances and needs. Encourage them to consider whether the Lord has specific warnings or messages for them. Following the prophet Reflect on thoughts and feelings the Holy Ghost may have communicated to you throughout the lesson about the Lord and His prophets. Add one or both of the following lines to your study journal and complete them with your thoughts or feelings: Something I want to remember about the Lord and His prophets is … I want to follow the Lord’s prophet because … You could conclude by asking a few students to share what they wrote. You could also share feelings you have had about the Lord and His prophets as you prepared and taught the lesson. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Ezekiel 3:16–17 is “The prophet is ‘a watchman unto the house of Israel.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 139 ---\nWe all feel lost, broken, sick, or needy at times. Heavenly Father sent Jesus Christ to “bind up that which was broken” and “strengthen that which was sick” ( Ezekiel 34:16 ). In Ezekiel 34 , the prophet Ezekiel likens how a good shepherd cares for his flock to how Jesus Christ cares for Heavenly Father’s children. This lesson can help students follow the Savior’s example to seek out and care for others. Student preparation: Invite students to think of ways that “the Good Shepherd” ( John 10:11, 14 ) is an appropriate name for Jesus Christ. They could ponder how this name for the Savior helps them understand His love and desire to care for Heavenly Father’s children. Possible Learning Activities A symbol for the Savior Consider sharing the following experience and statement. Invite students to identify actions of the shepherd that are symbolic of the Savior’s love for them. Alternatively, you could show “ Shepherds of Israel ” from time code 1:07 to 4:09. 9:15 On a trip to Morocco, Elder John R. Lasater of the Seventy learned about Jesus Christ’s love for Heavenly Father’s children when a sheep was hit by a royal car, entitling the shepherd to a large compensation. Elder Lasater’s interpreter said the shepherd wouldn’t accept the money. Elder Lasater then shared what happened next: Startled, I asked him why. And he added, “Because of the love he has for each of his sheep.” It was then that I noticed the old shepherd reach down, lift the injured lamb in his arms, and place it in a large pouch on the front of his robe. He kept stroking its head, repeating the same word over and over again. When I asked the meaning of the word, I was informed, “Oh, he is calling it by name. All of his sheep have a name, for he is their shepherd, and the good shepherds know each one of their sheep by name.” (“ Shepherds of Israel ,” Ensign , May 1988, 74) What can you learn about Jesus Christ from the actions of the shepherd? As you study today, seek the help of the Holy Ghost to learn how we can follow the example of Jesus Christ to care for Heavenly Father’s children. Shepherds In Ezekiel 34 , the Lord compared the leaders of Israel to shepherds who were not taking care of their flocks. Read Ezekiel 34:1–6 , marking phrases the Lord used to describe the Israelite leaders. What do you learn about the Lord from His concerns expressed in these verses? To help the leaders of Israel better care for their flocks, Jesus Christ described how He cares for His flock (see John 10:11, 14 , where Jesus also describes Himself as “the Good Shepherd”). Consider displaying a picture of Jesus Christ depicting Him as a shepherd, like the picture at the beginning of this lesson. On the left side of the picture, consider writing “ As the Good Shepherd, the Savior … ” Students could summarize what they mark in Ezekiel 34:11–16 under this heading. Read Ezekiel 34:11–16 , marking phrases that describe what Jesus Christ does for Heavenly Father’s children. Summaries students provide from the verses could include: Seeks out those that are lost ( verses 11–12, 16 ) Delivers them from darkness ( verse 12 ) Nourishes them and provides for their needs ( verses 13–15 ) Binds up the broken ( verse 16 ) Strengthens the sick ( verse 16 ) You might invite students to share some stories from the scriptures of how the Savior demonstrated some of these actions toward Heavenly Father’s children. To help students reflect on their efforts in following the Savior’s example to care for others, consider displaying the following self-assessment. Compare what you have marked in the two sets of verses you have studied in Ezekiel 34 , then ponder how you would respond to the following questions: What are some ways you feel you are like the Savior? Are there ways where you might be more like the shepherds in Israel? What are possible obstacles you face in caring for others like the Savior? Caring for His sheep Consider writing “ I can follow the Savior’s example by … ” on the right side of the picture of the Savior. Place students in small groups and provide the following instructions. Using what you found in Ezekiel 34:11–16 , make a list of practical ways youth can care for others as the Savior does. Some possible ideas students might come up with could be the following: Visiting with someone they haven’t seen in a while (“I will both search my sheep, and seek them out” [ Ezekiel 34:11 ]) Being generous with their time or resources (“I will feed my flock” [ Ezekiel 34:15 ]) Inviting someone to participate in an activity with you (“I will… bring again that which was driven away” [ Ezekiel 34:16 ]) Being aware of physical or emotional needs of others (“I will… bind up that which was broken, and will strengthen that which was sick” [ Ezekiel 34:16 ]) After making this list in groups, you may want to have each group list one of their ideas on the board. After there are several ideas listed on the board, it may be helpful to have students discuss the following questions: What can make it difficult to do these things? How can the Savior help you overcome these difficulties? Consider displaying the following questions and inviting students to select at least one to answer. As students reflect on personal experiences, the Holy Ghost can help them feel the truth and importance of what they are learning. How has the Savior blessed you or your family by sending someone to seek out and care for you? How has the Savior used you or your family to seek out and care for others? If you feel it would help students to see an example of youth caring for others as Jesus does, consider showing “ Face to Face with President and Sister Oaks (Strive to Be) ” from time code 57:50 to 59:55, available at ChurchofJesusChrist.org . In this video, youth share ideas on how they seek out and care for others. 80:11 Make a plan Making a plan in class to act on what they have learned can help students deepen their conversion to Jesus Christ. Take a moment to think of people in your life who may be like the sheep (lost, scattered, broken, weak) in Ezekiel 34 . These might be people in your class or quorum, your family and friends, or people at school. Seek the Holy Ghost’s help in considering who might need your help. From the ideas we’ve discussed, or another you feel inspired to do, write how you can follow the Savior’s example to seek out and care for this individual. To remind yourself of your plan, you could write it down on a piece of paper or set it as a reminder on your phone. You may want to plan a few minutes in an upcoming lesson to follow up with students about their plans and check on their progress. To conclude, you could share how someone has cared for you or how you have cared for others as the Savior does.\n\n\n--- Lesson 140 ---\nIn Ezekiel 37 , Ezekiel saw a future gathering and reuniting of all the tribes of Israel to the Lord (see Ezekiel 37:20-28 ). Modern prophets have also interpreted Ezekiel’s vision as the stick of Judah (the Bible) and the stick of Joseph (the Book of Mormon) being united as companion testaments of Jesus Christ and His restored gospel (see Ezekiel 37:15–17 ). This lesson can help students understand ways the Bible and the Book of Mormon work together as witnesses of Jesus Christ and His gospel. Student preparation: Invite students to imagine they are asked, “Why do you need the Book of Mormon if you believe in the Bible?” and prepare to share how they would respond. They could ask a friend or family member how they would respond to the question. Possible Learning Activities A sure second witness Imagine you see a social media post that asks, “Why do you need the Book of Mormon if you believe in the Bible?” You could invite students to ponder this question while you write it on the board. Then, invite students to ask themselves: How confident do you feel in your ability to answer this question? If a friend were to ask you this question, what would you share? As you study Ezekiel 37 today, invite the Spirit to help you recognize ways the Bible and Book of Mormon testify of Jesus Christ and His gospel. At the end of the lesson, you will have a chance to practice responding to this question. The stick of Judah and the stick of Joseph The prophet Ezekiel was sent to preach repentance to the Israelites who were captives in Babylon. In Ezekiel 37 , the prophet recorded a vision in which the Lord taught that the House of Israel, spiritually dead because of apostasy, would return to life through the Restoration of the gospel. As part of the vision, Ezekiel saw two sticks or wooden tablets upon which messages would be written. As students study the following passage, you may want to point out that the “stick of Judah” refers to the Bible. The “stick of Joseph” refers to the Book of Mormon (see Guide to the Scriptures, “ Ephraim ”; “ Judah ”). Students could include this information as a note in their scriptures next to verse 16 . Ezekiel 37:15–17 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Ezekiel 37:15–20 , looking for the Lord’s promise about the scriptures in the latter days. What do you think the phrase “they shall become one in thine hand” ( verse 17 ) could mean? To help us understand how the Bible and the Book of Mormon would become “one” testament of the Savior, President Russell M. Nelson taught: 14:33 The Bible and the Book of Mormon are both witnesses of Jesus Christ. They teach that He is the Son of God, that He lived an exemplary life, that He atoned for all mankind, that He died upon the cross and rose again as the resurrected Lord. They teach that He is the Savior of the world. Scriptural witnesses authenticate each other. This concept was explained long ago when a prophet wrote that the Book of Mormon was “written for the intent that ye may believe [the Bible]; and if ye believe [the Bible] ye will believe [the Book of Mormon] also” ( Mormon 7:9 ). Each book refers to the other. Each book stands as evidence that God lives and speaks to His children by revelation to His prophets. … Today, Saints living in many nations of the earth gratefully hold the Bible (the stick of Judah) and the Book of Mormon (the stick of Ephraim) bound as one in their hands. (“ Scriptural Witnesses ,” Ensign or Liahona , Nov. 2007, 43, 44) How would you summarize what we learn from Ezekiel 37:15–20 and President Nelson? Although students may use different words, help them share a truth such as the Bible and the Book of Mormon both witness of Jesus Christ . Why do you think it’s important to have both the Bible and Book of Mormon witnessing of Jesus Christ? Companion witnesses of Jesus Christ The following activity could help students increase their understanding of how the Bible and the Book of Mormon both testify of Jesus Christ and His gospel. You could provide some or all of the chart below. Students could select one or more topics to study individually, with a partner, or in a small group. Gospel Topic Companion Scriptures Gospel Topic The Atonement of Jesus Christ Companion Scriptures Bible: Isaiah 53:3–5 Book of Mormon: Alma 7:11–13 Gospel Topic Resurrection of all because of Jesus Christ Companion Scriptures Bible: 1 Corinthians 15:20–22 Book of Mormon: Alma 11:42–45 Gospel Topic The Savior promises to gather and redeem His people Companion Scriptures Bible: Ezekiel 37:21–23, 26–27 Book of Mormon: 1 Nephi 10:14 Gospel Topic The attributes of Jesus Christ Companion Scriptures Bible: Isaiah 63:7 Book of Mormon: Mosiah 4:11 Gospel Topic The Savior’s ordinance of baptism Companion Scriptures Bible: Matthew 3:13–17 Book of Mormon: 2 Nephi 31:5–12 Gospel Topic You choose a topic Companion Scriptures Bible: Book of Mormon: Open PDF Think of a way to help students share what they have learned. One way to do this is to provide the accompanying handout for students to use to create a social media post. If students are unfamiliar with social media, you can adapt this activity to have students role-play what they would share with someone. The activity invites students to answer the question posed at the beginning of the lesson. Select one of the topics you studied and create a social media post that could be used to answer the question, “Why do you need the Book of Mormon if you believe in the Bible?” Include the verses from the Bible and Book of Mormon you studied. Explain the value you find and how they both teach about Jesus Christ and His gospel. Share what you have learned You could tape the students’ posts or posters on the wall around the room or place them on desks. Then, invite students to walk around the room and review their classmates’ work. Provide small papers or sticky notes for students to use as they complete the following instructions. Write a “comment” to one or more of the other social media posts. In your comment, complete at least one of the following options: Add an additional scripture reference from either the Bible or the Book of Mormon that could help someone understand more about the Savior and this topic. Include a few thoughts about the value of the scripture you shared. Share how the Bible and the Book of Mormon have helped you understand the Savior and this teaching. Write an experience you have had when scriptures from the Bible or Book of Mormon helped increase your testimony of the Savior and His gospel. Instead of writing your thoughts on a paper, share something you have learned today about the Savior and His gospel teachings on your personal social media account. Include scripture passages and how the Bible and Book of Mormon have helped you better understand the gospel of Jesus Christ. You could conclude the class by inviting students to continue to use the Bible and the Book of Mormon to increase their understanding of Jesus Christ and His gospel. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for “ Ezekiel 37:15–17 ” is “The Bible and the Book of Mormon shall become one in thine hand.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 141 ---\nThe Lord gives us many blessings through our worship in the temple. Ezekiel saw in a vision a latter-day temple that will be built in Jerusalem. He saw water flowing from this temple, healing the surrounding land and bringing life to the Dead Sea. The vision symbolizes the blessings the Lord gives us as we worship Him in His temple. This lesson can help students feel a greater desire to worship God in the temple. Student preparation: Consider giving students the following questions and inviting them to come prepared to share their answers: Possible Learning Activities Desire to worship in the temple Begin the lesson in a way that helps students think about their desire to attend and worship in the temple. To do this, you could display a picture of a temple. Then, write students’ answers to one of the following questions on one side of the temple and their answers to the other question on the other side. What are some reasons a teenager may want to attend and worship in the temple? What are some reasons they may not want to attend the temple? What might make it difficult? Self-assessment questions can help students identify opportunities for personal growth and learning. Invite students to take a moment to ponder the following questions about themselves. How strong is your desire to worship in the temple? Why? What may keep you from wanting to attend the temple? As you study Ezekiel today, seek the Lord’s help to increase your desire to attend and worship in the temple. Ezekiel’s vision of the temple Note: To help students feel the Lord’s love, it is important in this lesson to refer to blessings as coming from the Lord through the temple, not from the temple itself. In Ezekiel 47 , Ezekiel saw a vision that could symbolize the blessings the Lord gives to all who do temple and family history work. It began with a heavenly messenger bringing Ezekiel to the temple door in Jerusalem. Read Ezekiel 47:1 , looking for what Ezekiel saw coming from the temple. How might water be a fitting symbol for the blessings of the Lord? Some possible answers might include that water gives life, is needed by everyone, cleans, and is available to all. During His mortal ministry, the Savior compared Himself and the blessings He offers to living water (see John 4:10 ; 7:37–39 ). It may be useful for the following activity to explain that a cubit is a unit of measurement, from the elbow to the tips of the fingers, approximately 18 to 21 inches or 45 to 53 centimeters. Read Ezekiel 47:2–5 , looking for how deep the water became as it flowed out of the temple. Because the Lord’s teaching in this account is very visual, it can help to draw what we are learning. On the top half of a page in your study journal, draw a simple representation of a temple and the water coming from it. (You will draw more of where the water goes in the bottom half later.) If useful, students could watch “ And the River Will Grow ,” available at ChurchofJesusChrist.org , from time code 0:26–1:29. 3:43 What do you think the Lord was teaching in this vision about the blessings He gives through the temple? Ask students: If you were to draw something on your picture to symbolize where nothing lives or thrives, what would it be, and why? If the same question were asked to those in Jerusalem in Ezekiel’s day, the answer may likely be the Judean wilderness or the Dead Sea. The Dead Sea has its name because of its inability to sustain animal or plant life. It also contains salt water and is undrinkable. If useful, show or direct students to the picture “ Judean Wilderness ” (Bible Photographs, no. 3) in Study Helps in the Gospel Library or in the Bible Appendix to see the wilderness by the Dead Sea. They could also look at “ Physical Map of the Holy Land ” (Bible Maps, no. 1) and find the Wilderness of Judea and the Dead Sea. Read Ezekiel 47:8–9, 12 , looking for what would happen to everything the water from the temple touched, including the Dead Sea. Invite students to complete their picture, drawing what they just read in the bottom half of their paper. The following is an example of an open-ended question that helps learners discover gospel doctrine and principles for themselves. This approach can make students’ study of the scriptures more relevant and allow the Lord to teach and inspire them personally. (For additional training on this skill, see: “ Create open-ended search questions that help learners discover gospel doctrine and principles for themselves and do not lead students to a specific response ” in Teacher Development Skills .) How would you summarize what you learned from Ezekiel’s vision? Students may share a variety of principles. Thank them for their responses and ask why what they learned is important. One of the principles students could identify is: As we worship the Lord in the temple, He blesses us with healing, new life, and growth. Students may want to write this principle or one they identified in their scriptures next to Ezekiel 47:1–9 . If useful for further understanding, continue the video of Elder Dale G. Renlund of the Quorum of the Twelve Apostles and his family from time code 1:58–2:33. 3:43 Deepen your understanding Prepare a copy of the handout “ Blessings of the Temple ” for each student. Read the handout “ Blessings of the Temple ” and underline or circle any blessings that stand out to you. Open PDF On their drawings, students can write these blessings in the water coming from the temple. They can also add any additional blessings they can think of that the Lord gives us through the temple. Consider inviting students to share their drawings and written blessings with a partner or small group. Alternatively, you could draw the river on the board and ask students to write the blessings they thought of there. Students can then add to their drawings blessings they would like to remember from what others shared. What blessings stood out to you? Invite students to think of answers to the following questions for a few moments before you ask them. As they share, you might ask questions such as the following: “Why is that meaningful to you?” “Has anyone else had a similar experience?” and “What would you like to add to what has been shared?” If students live in an area where many have not attended the temple because of distance, and they do not know many people who have attended the temple, consider altering the second question to ask about blessings students or others have experienced as they have prepared to worship in the temple. How might any of the blessings you identified heal or give life? When have you or those you know experienced one of these blessings from the Lord through worshipping in the temple? If students would benefit from seeing other examples of some blessings available from temple worship, you could show one of the following videos: “ Temples Are a Beacon ” (2:50) 2:50 “ Family History and Temple Work: Healing and Sealing ” (14:43) from time code 7:36–12:20. 14:43 How you feel about the temple To conclude the lesson, consider finding a place on your picture or in your study journal to write your feelings about attending and worshipping in the temple and receiving the Lord’s blessings. Seek the help of the Holy Ghost to write your feelings well and accurately. Consider inviting any students who would like to share their thoughts and testimony. Consider sharing your own as well.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 36802,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.399305"
}