{
  "week_number": 32,
  "date_range": "",
  "title": "Esther",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: Esther ---\nMany events in the book of Esther might seem like luck or coincidence. How else do you explain how an orphaned Jewish girl became the queen of Persia at just the right time to save her people from slaughter? What are the chances that Esther’s cousin Mordecai would happen to overhear a plot to assassinate the king? Were these coincidences, or were they part of a divine plan? Elder Ronald A. Rasband noted: “What may appear to be a random chance is, in fact, overseen by a loving Father in Heaven. … The Lord is in the small details of our lives” (“\nBy Divine Design\n,”\nEnsign\nor\nLiahona\n, Nov. 2017, 56). We might not always recognize the Lord’s influence in these “small details.” But we learn from Esther’s experience that He can guide our path and prepare us “for such a time” (\nEsther 4:14\n) when we can be instruments in His hands to fulfill His purposes.\nFor an overview of the book of Esther, see “\nEsther, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nEsther\nThe Lord puts me in situations where I can bless others.\nPresident Dieter F. Uchtdorf taught that each of us “stands at a unique place and has an important task that only [we] can perform. … The Lord gave you your responsibilities for a reason. There may be people and hearts only you can reach and touch. Perhaps no one else could do it in quite the same way” (“\nLift Where You Stand\n,”\nEnsign\nor\nLiahona\n, Nov. 2008, 56).\nAs you read the story of Esther, ponder how this statement applies to her. Look for ways the Lord made it possible for her to save the Jews (see, for example,\nEsther 2:21–23\n;\n3:10–14\n;\n4:14–16\n). Then ponder how He has given you opportunities to bless others. What are some circumstances or relationships that He has guided you to “for such a time as this”? (\nEsther 4:14\n). If you have a patriarchal blessing, consider reading it to learn more about the work the Lord has for you to do. What can you do to accomplish this work?\nSee also “For Such a Time as This” (video),\nChurchofJesusChrist.org\n.\n13:44\nFor Such a Time as This\nWe learn more by doing than by listening.\nElder David A. Bednar counseled teachers: “Our intent ought not to be ‘What do I tell them?’ Instead, the questions to ask ourselves are ‘What can I invite them to do? What inspired questions can I ask that, if they are willing to respond, will begin to invite the Holy Ghost into their lives?’” (in\nTeaching in the Savior’s Way\n,\n25\n). If you are teaching your family or a class about Esther, what could you ask them to do that will help them learn?\n“When Haman saw that Mordecai bowed not … then was Haman full of wrath” (\nEsther 3:5\n).\nEsther 3\n;\n5:9–14\n;\n7\nPride and anger can lead to downfall.\nIn the book of Esther, we learn from the faithfulness of Esther and Mordecai, but we also learn from the pride and anger of Haman. As you read\nEsther 3\n;\n5:9–14\n, note Haman’s feelings, words, and actions. What do they reveal about him and his motivations? What consequences did he face? (see\nEsther 7\n). Reading about Haman may prompt you to evaluate what motivates your feelings and actions. Are you inspired to make any changes? How can you turn to Heavenly Father for help?\nSee also\nProverbs 16:32\n;\nAlma 5:28\n.\nEsther 3–4\n;\n5:2–3\n;\n8:11–12\nFasting shows that I trust and rely on the Lord.\nNotice why Esther and the rest of the Jews decided to fast (see\nEsther 3:13\n;\n4:1–3, 10–17\n). How did fasting bless them? (see\nEsther 5:2–3\n;\n8:11–12\n). Why does the Lord ask us to fast? (see Topics and Questions, “\nFasting and Fast Offerings\n,” Gospel Library). Consider how you can make fasting a greater blessing in your life.\nSee also\nIsaiah 58:6–12\n; “Fasting: Young Single Adult Ward, Amanda” (video),\nChurchofJesusChrist.org\n.\n2:41\nFasting: Young Single Adult Ward, Amanda\nEsther 3:1–11\n;\n4:10–17\n;\n5:1–4\n;\n9:17–19\nDoing the right thing often requires great courage.\nWhen Mordecai and Esther stood up for their beliefs and their people, they put their lives at risk. Our choices might have less severe consequences, but doing the right thing can still require courage. What do you learn from\nEsther 3:1–4\n;\n4:10–17\nabout having courage to do the right thing? Note the different consequences Mordecai and Esther experienced after showing courage (see\nEsther 3:5–11\n;\n5:1–4\n). What did Esther and Mordecai need to know about God to make the choices they made?\nThink of situations where you need courage to stand up for what’s right. What do you learn from Esther and Mordecai that can help you find courage in the Lord?\nEsther’s courage led to “a day of gladness” (see\nEsther 9:17–19\n). How has Christlike courage given you “a day of gladness”?\nSee also “Courage,” “Dare to Stand Alone” (videos), Gospel Library; “\nTrue to the Faith\n,”\nHymns\n, no. 254.\n3:19\nCourage\n4:20\nDare to Stand Alone\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nEsther 2:5–7\nI can serve my family.\nYou might feel inspired to use\nEsther 2:7\nto teach your children about helping family members in need, as Mordecai did for Esther. You could read the verse together or summarize it in your own words. Then you and your children could think of family members who might need your help. Make a plan to help them.\nEsther 3:1–11\n;\n4:10–17\nThe Lord can help me be brave.\nThe examples of Esther and Mordecai can help your children understand that bravery means doing what is right even when you are afraid. Consider writing the phrases\nMordecai was brave when he …\nand\nEsther was brave when she …\n. As you learn the story of Esther together, your children could suggest ways to finish the sentences. You could read\nEsther 3:1–11\n;\n4:10–17\nor “\nQueen Esther\n” (in\nOld Testament Stories\n, 166–70) or look at the pictures in this outline. Then write\nI will be brave by …\n, and invite your children to list things Heavenly Father wants them to do that require courage. A song about courage, such as “\nDare to Do Right\n” (\nChildren’s Songbook\n, 158), could help.\n2:45\nQueen Esther\nYou could also learn about times when Jesus Christ was brave—for example, when He suffered for our sins in Gethsemane and on the cross (see\nMatthew 26:36–39\n;\n27:33–35\n). Ask your children to share a time when they were brave, and share your own experiences as well.\nEsther 4:1–3, 10–17\nFasting brings the Lord’s blessings.\nReading\nEsther 4:1–3, 10–17\ncould help you teach your children about fasting. Why did Esther and the Jews fast? Tell your children why you fast. You could also ask them how they would explain fasting to a friend who has never done it before. How could we help our friends understand the blessings that come from fasting?\nEncourage your children to think of something they might need the Lord’s help with. Suggest they make that part of their fast during the next fast Sunday.\nBecause Esther was brave, she was able to save the Lord’s people.\nEsther 4:14\nI can be an instrument in God’s hands.\nHelp your children understand that when Esther was afraid, Mordecai encouraged her by explaining that the Lord had helped her become the queen “for such a time as this” (\nEsther 4:14\n). What did Mordecai mean by this? Talk with each other about how Esther was an instrument for the Lord. How can we be instruments for the Lord?\nHow could you help your children understand what an instrument is? Maybe you could invite someone to play a song on a musical instrument or show a picture of someone using a tool. You could then talk about what it means to be an instrument in God’s hands.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 32: Lesson 94: Lesson 94—Esther, Part 1This lesson can help students recognize how Heavenly Father places us in situations to help Him accomplish His work.; Lesson 95: Lesson 95—Esther, Part 2This lesson can help students act with courage to do the Lord’s will. ---\n\n--- Lesson 94 ---\nHave you ever wondered why Heavenly Father has led you to this place, at this time, and what work He has for you to do? An orphaned Jewish woman named Esther might have had similar questions. Esther’s captivity in Persia placed her in a position to assist the Lord in saving His people, the Jews. This lesson can help students recognize how Heavenly Father places us in situations to help Him accomplish His work. Student preparation: Consider asking students to prayerfully ponder how Heavenly Father might accomplish His work through them in this seminary class or their ward or branch, school, city, or family Possible Learning Activities Divine design Consider beginning class by showing a chessboard and pieces or a picture of a chessboard. Invite students to share what they know about the game of chess. If needed, explain that the game works as players move their pieces into strategic positions to win the game. You could ask students what they think makes a skilled chess player. If students do not mention it, consider sharing that skilled players map out their winning strategy several moves ahead as the game progresses. You could then ask students to think about how our lives could be like a game of chess, sharing Elder Rasband’s explanation. Elder Ronald A. Rasband of the Quorum of the Twelve Apostles taught: Our lives are like a chessboard, and the Lord moves us from one place to another—if we are responsive to spiritual promptings. Looking back, we can see His hand in our lives. (“ By Divine Design ,” Ensign or Liahona , Nov. 2017, 55) Why do you think it can be easier to notice God’s influence in our lives looking into the past, rather than right now? The account of Esther demonstrates how God’s influence in Esther’s life put her in a position to accomplish His work. In this lesson, you will study the first part of this account. As you study, prayerfully seek the Holy Ghost to help you recognize how Heavenly Father may be placing you in situations to help Him accomplish His work. For such a time as this After the Persians conquered Babylon, many Jews remained in Persia, including Esther and her guardian, Mordecai. The king of Persia, Ahasuerus, became dissatisfied with his wife Vashti and sent her away (see Esther 1:1–12 ). Seeking a new bride, Ahasuerus called for all the women of Persia to be brought before him (see Esther 2:1–4 ). To help students understand the story of Esther, you could organize students into small groups to study one of the following scripture blocks. Invite groups to summarize their part of the story for the class. You may want to think of an interesting way students could summarize their account. They could draw a symbol on a sheet of paper to represent the story (for example, a crown or wedding veil, a royal ring, a sword, or a weeping emoji). Students could act out the story while others narrate it. Read your assigned passage looking for the difficult circumstances Esther and Mordecai faced. Esther 2:5–11, 15–17 Esther 3:1–13 Esther 4:1–9 As students share, be conscious of time so that students do not spend too long summarizing these accounts. How do you think Heavenly Father and Jesus Christ felt about the events in these verses? About Mordecai? About Esther? Read Esther 4:10–14 , looking for how Mordecai helped Esther see the influence Heavenly Father may have had on the circumstances of her life. You may want to have students mark the question “who knoweth whether thou art come to the kingdom for such a time as this?” ( verse 14 ). Elder Rasband testified that God does influence the circumstances of our lives to accomplish His work. I know that the Lord will move us on that seeming chessboard to do His work. What may appear to be a random chance is, in fact, overseen by a loving Father in Heaven who can number the hairs of every head. Not even a sparrow falls to the ground without our Father’s notice. The Lord is in the small details of our lives, and those incidents and opportunities are to prepare us to lift our families and others as we build the kingdom of God on earth. … Heavenly Father can put us in situations with specific intent in mind. He has done so in my life, and He is doing so in yours. (“ By Divine Design ,” Ensign or Liahona , Nov. 2017, 55–56) What truths can we learn about Heavenly Father from the account of Esther and Elder Rasband? As students share their responses, write a truth on the board using students’ words like Heavenly Father places us in situations where we can help accomplish His work . Note : Esther’s courage to go before the king to save her people will be studied in Lesson 95: “ Esther, Part 2 .” Recognizing Heavenly Father’s guidance It may be helpful to point out that accomplishing the Lord’s work is often not a dramatic experience. It may be small but still significant. For a few examples of these small but significant experiences, you could share either Sister Michelle Craig’s story in “ Eyes to See ” time code 2:23 to 4:54 ( Ensign or Liahona , Nov. 2020, 16) or Elder Brook P. Hales account in “ Answers to Prayers ,” time code 2:16 to 4:32. You can find videos of these accounts at ChurchofJesusChrist.org . 6:27 12:39 How has the Lord given you or someone you know an opportunity to be an instrument in His hands? Consider sharing an experience when you have recognized opportunities Heavenly Father has given you to help accomplish His work. To help students reflect on how Heavenly Father has placed them in situations to accomplish His work, you could give them time to silently ponder their answers to the following question. They could record their thoughts in their study journal. How do you think Mordecai’s statement in verse 14 might describe you? If you feel students need more help to recognize these opportunities in their lives, you could instead have students complete the following activity. In your study journal, write down the name of someone in your life (family, school, church, or other setting). Then answer at least one of the following in your journal. What evidence have you seen that Heavenly Father has placed that person in your life “for such a time as this?” ( Esther 4:14 )? When have you seen Heavenly Father’s hand placing you around specific people or in certain situations “for such a time as this?” ( Esther 4:14 )? As appropriate, you might invite willing students to share what they wrote with the class. Consider encouraging students to act on any spiritual impressions they may have had during the lesson.\n\n\n--- Lesson 95 ---\nAs followers of Jesus Christ, we all will have times when we need to demonstrate courage, even though our circumstances may be different. Esther demonstrated courage as she relied on the Lord while facing potential death in order to save her people. This lesson can help students act with courage to do the Lord’s will. Student preparation: Invite students to prepare to share an example of when someone they know demonstrated courage to do the Lord’s will Possible Learning Activities A call for courage Consider beginning class by sharing an experience of when someone demonstrated courage, such as in the following story. President Thomas S. Monson shared the following story: 16:18 While serving in the United States Navy in World War II, I learned of brave deeds, instances of valor, and examples of courage. One which I shall never forget was the quiet courage of an 18-year-old seaman—not of our faith—who was not too proud to pray. Of 250 men in the company, he was the only one who each night knelt down by the side of his bunk, at times amidst the jeers of bullies and the jests of unbelievers. With bowed head, he prayed to God. He never wavered. He never faltered. He had courage. (“ Be Strong and of a Good Courage ,” Ensign or Liahona , May 2014, 67) Who do you think of when you hear the word courage ? What are situations where Latter-day Saint teenagers might need to demonstrate courage? Ponder a specific situation, such as at school, at home, or with friends, where you feel Heavenly Father might want you to demonstrate greater courage. Write this situation in your study journal. As you study the remainder of the story of Esther, invite the Holy Ghost to help you know how Heavenly Father and Jesus Christ can help you face that situation with courage. Esther’s courage To help students share what they remember about the story of Esther, consider displaying a picture of Esther and the following names. Invite students to share what they remember about each person. Esther Mordecai King Ahasuerus Haman Or you could show a video such as “ For Such a Time as This ” from time codes 5:12 to 9:41. This video is available at ChurchofJesusChrist.org . 13:44 The following summary could be used to add any important details students may have missed. Esther became the queen to King Ahasuerus of Persia. Esther’s guardian, Mordecai, refused to bow to Haman, the king’s chief minister. Haman was angered and received permission from the king to destroy all of the Jews in the kingdom. Mordecai asked Esther to seek intervention from the king, telling her that perhaps God placed her in this position “for such a time as this” ( Esther 4:14 ). If students need help answering the following question, you could invite them to read Esther 4:10–11 . Why would approaching the king require great courage? Read Esther 4:15–17 , looking for how Esther demonstrated courage as she prepared to approach the king. You could also show the remainder of the video “ For Such a Time as This ” from time codes 11:10 to 13:44. 13:44 As you discuss the following questions, it may be helpful to remember that validating students’ comments can help students be more willing to participate in the future. What stands out to you about Esther? What principles can we learn from verses 15–17 that can help us when we need courage? Thank students for the meaningful principles they shared. If not already mentioned, you could help them identify the following principle: As I rely on Heavenly Father and Jesus Christ, They will give me courage. What evidence do you see that Esther relied on the Lord? How might this have helped her? Courageous acts The following scripture passages can help students see how the Lord continued to bless Esther with courage. Consider organizing students into small groups or pairs. Assign each group or pair one of the following passages of scripture. Or students within the same group could each study one of the passages and prepare to share with each other. Study one of the following passages of scripture, looking for how Esther demonstrated courage. Esther 5:1–4 . Esther approached the king. Esther 7:1–4 . Esther, the king, and Haman held a private banquet. Esther 8:3–6 . Esther discussed with the king his edict to slay the Jews. Then, discuss the following questions: How were Esther’s actions a demonstration of courage? What do you think a person needs to know about God to make the choice Esther made? Invite willing students to share what they discussed with the class. Helping students place Jesus Christ at the center of their learning invites the Holy Ghost to testify of Him. This can help students have a more personal and powerful learning experience. One way we can do this is by connecting the story of Esther to the life and example of Jesus Christ. (For additional training on helping students connect what they are learning to the life and example of Jesus Christ, see “ Emphasize the example of Jesus Christ ” in Teacher Development Skills [2022], 5.) Display a picture of Jesus Christ on the board. Consider asking one or both of the following questions. How does Esther remind you of the Savior? What are examples from the Savior’s life where He demonstrated courage? To prepare students to share their own experiences, consider showing students a video such as “ Having Courage and Trusting the Lord ” (3:18), available at ChurchofJesusChrist.org . 3:18 When is a time you, or someone you know, relied on the Lord and were blessed with courage? My personal act of courage The following suggestions can help students apply what they learned from the account of Esther. Reflect on the situation you thought about at the beginning of the lesson. Seek guidance from the Spirit as you ponder how you can demonstrate courage and rely on the Lord in that situation. Read Esther 4:16 again, emphasizing the following statement: “… and so will I go in unto the king, which is not according to the law: and if I perish, I perish.” To help students emphasize the statement in verse 16 , they could mark or highlight it if desired. Then, consider inviting them to rewrite the statement in their study journal using the prompts below. Reword this statement to reflect your commitment to show courage and rely on the Lord with your situation. To help you do this, consider completing the following prompts: And so I will (the action you would like to do to demonstrate courage). And if (a possible consequence), I (something you will do to rely on the Lord). It might be helpful to provide an example, such as the following: Imagine you feel that Heavenly Father wants you to have the courage to stop using crude and offensive language with your friends. You could reword Esther 4:16 to say: “And so I will not use bad language anymore, even when joking. And if my friends tease or mock me, then I will pray for the strength to keep trying.” Invite willing students to share what they wrote. If time permits, students could share advice with each other regarding the situations they share. Testify of the Lord’s example of courage. Express your belief in your students’ ability to face their challenges with courage as they rely on the Lord to do His will.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Esther",
      "content": "Many events in the book of Esther might seem like luck or coincidence. How else do you explain how an orphaned Jewish girl became the queen of Persia at just the right time to save her people from slaughter? What are the chances that Esther’s cousin Mordecai would happen to overhear a plot to assassinate the king? Were these coincidences, or were they part of a divine plan? Elder Ronald A. Rasband noted: “What may appear to be a random chance is, in fact, overseen by a loving Father in Heaven. … The Lord is in the small details of our lives” (“\nBy Divine Design\n,”\nEnsign\nor\nLiahona\n, Nov. 2017, 56). We might not always recognize the Lord’s influence in these “small details.” But we learn from Esther’s experience that He can guide our path and prepare us “for such a time” (\nEsther 4:14\n) when we can be instruments in His hands to fulfill His purposes.\nFor an overview of the book of Esther, see “\nEsther, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nEsther\nThe Lord puts me in situations where I can bless others.\nPresident Dieter F. Uchtdorf taught that each of us “stands at a unique place and has an important task that only [we] can perform. … The Lord gave you your responsibilities for a reason. There may be people and hearts only you can reach and touch. Perhaps no one else could do it in quite the same way” (“\nLift Where You Stand\n,”\nEnsign\nor\nLiahona\n, Nov. 2008, 56).\nAs you read the story of Esther, ponder how this statement applies to her. Look for ways the Lord made it possible for her to save the Jews (see, for example,\nEsther 2:21–23\n;\n3:10–14\n;\n4:14–16\n). Then ponder how He has given you opportunities to bless others. What are some circumstances or relationships that He has guided you to “for such a time as this”? (\nEsther 4:14\n). If you have a patriarchal blessing, consider reading it to learn more about the work the Lord has for you to do. What can you do to accomplish this work?\nSee also “For Such a Time as This” (video),\nChurchofJesusChrist.org\n.\n13:44\nFor Such a Time as This\nWe learn more by doing than by listening.\nElder David A. Bednar counseled teachers: “Our intent ought not to be ‘What do I tell them?’ Instead, the questions to ask ourselves are ‘What can I invite them to do? What inspired questions can I ask that, if they are willing to respond, will begin to invite the Holy Ghost into their lives?’” (in\nTeaching in the Savior’s Way\n,\n25\n). If you are teaching your family or a class about Esther, what could you ask them to do that will help them learn?\n“When Haman saw that Mordecai bowed not … then was Haman full of wrath” (\nEsther 3:5\n).\nEsther 3\n;\n5:9–14\n;\n7\nPride and anger can lead to downfall.\nIn the book of Esther, we learn from the faithfulness of Esther and Mordecai, but we also learn from the pride and anger of Haman. As you read\nEsther 3\n;\n5:9–14\n, note Haman’s feelings, words, and actions. What do they reveal about him and his motivations? What consequences did he face? (see\nEsther 7\n). Reading about Haman may prompt you to evaluate what motivates your feelings and actions. Are you inspired to make any changes? How can you turn to Heavenly Father for help?\nSee also\nProverbs 16:32\n;\nAlma 5:28\n.\nEsther 3–4\n;\n5:2–3\n;\n8:11–12\nFasting shows that I trust and rely on the Lord.\nNotice why Esther and the rest of the Jews decided to fast (see\nEsther 3:13\n;\n4:1–3, 10–17\n). How did fasting bless them? (see\nEsther 5:2–3\n;\n8:11–12\n). Why does the Lord ask us to fast? (see Topics and Questions, “\nFasting and Fast Offerings\n,” Gospel Library). Consider how you can make fasting a greater blessing in your life.\nSee also\nIsaiah 58:6–12\n; “Fasting: Young Single Adult Ward, Amanda” (video),\nChurchofJesusChrist.org\n.\n2:41\nFasting: Young Single Adult Ward, Amanda\nEsther 3:1–11\n;\n4:10–17\n;\n5:1–4\n;\n9:17–19\nDoing the right thing often requires great courage.\nWhen Mordecai and Esther stood up for their beliefs and their people, they put their lives at risk. Our choices might have less severe consequences, but doing the right thing can still require courage. What do you learn from\nEsther 3:1–4\n;\n4:10–17\nabout having courage to do the right thing? Note the different consequences Mordecai and Esther experienced after showing courage (see\nEsther 3:5–11\n;\n5:1–4\n). What did Esther and Mordecai need to know about God to make the choices they made?\nThink of situations where you need courage to stand up for what’s right. What do you learn from Esther and Mordecai that can help you find courage in the Lord?\nEsther’s courage led to “a day of gladness” (see\nEsther 9:17–19\n). How has Christlike courage given you “a day of gladness”?\nSee also “Courage,” “Dare to Stand Alone” (videos), Gospel Library; “\nTrue to the Faith\n,”\nHymns\n, no. 254.\n3:19\nCourage\n4:20\nDare to Stand Alone\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nEsther 2:5–7\nI can serve my family.\nYou might feel inspired to use\nEsther 2:7\nto teach your children about helping family members in need, as Mordecai did for Esther. You could read the verse together or summarize it in your own words. Then you and your children could think of family members who might need your help. Make a plan to help them.\nEsther 3:1–11\n;\n4:10–17\nThe Lord can help me be brave.\nThe examples of Esther and Mordecai can help your children understand that bravery means doing what is right even when you are afraid. Consider writing the phrases\nMordecai was brave when he …\nand\nEsther was brave when she …\n. As you learn the story of Esther together, your children could suggest ways to finish the sentences. You could read\nEsther 3:1–11\n;\n4:10–17\nor “\nQueen Esther\n” (in\nOld Testament Stories\n, 166–70) or look at the pictures in this outline. Then write\nI will be brave by …\n, and invite your children to list things Heavenly Father wants them to do that require courage. A song about courage, such as “\nDare to Do Right\n” (\nChildren’s Songbook\n, 158), could help.\n2:45\nQueen Esther\nYou could also learn about times when Jesus Christ was brave—for example, when He suffered for our sins in Gethsemane and on the cross (see\nMatthew 26:36–39\n;\n27:33–35\n). Ask your children to share a time when they were brave, and share your own experiences as well.\nEsther 4:1–3, 10–17\nFasting brings the Lord’s blessings.\nReading\nEsther 4:1–3, 10–17\ncould help you teach your children about fasting. Why did Esther and the Jews fast? Tell your children why you fast. You could also ask them how they would explain fasting to a friend who has never done it before. How could we help our friends understand the blessings that come from fasting?\nEncourage your children to think of something they might need the Lord’s help with. Suggest they make that part of their fast during the next fast Sunday.\nBecause Esther was brave, she was able to save the Lord’s people.\nEsther 4:14\nI can be an instrument in God’s hands.\nHelp your children understand that when Esther was afraid, Mordecai encouraged her by explaining that the Lord had helped her become the queen “for such a time as this” (\nEsther 4:14\n). What did Mordecai mean by this? Talk with each other about how Esther was an instrument for the Lord. How can we be instruments for the Lord?\nHow could you help your children understand what an instrument is? Maybe you could invite someone to play a song on a musical instrument or show a picture of someone using a tool. You could then talk about what it means to be an instrument in God’s hands.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 32: Lesson 94: Lesson 94—Esther, Part 1This lesson can help students recognize how Heavenly Father places us in situations to help Him accomplish His work.; Lesson 95: Lesson 95—Esther, Part 2This lesson can help students act with courage to do the Lord’s will.",
      "content": "\n--- Lesson 94 ---\nHave you ever wondered why Heavenly Father has led you to this place, at this time, and what work He has for you to do? An orphaned Jewish woman named Esther might have had similar questions. Esther’s captivity in Persia placed her in a position to assist the Lord in saving His people, the Jews. This lesson can help students recognize how Heavenly Father places us in situations to help Him accomplish His work. Student preparation: Consider asking students to prayerfully ponder how Heavenly Father might accomplish His work through them in this seminary class or their ward or branch, school, city, or family Possible Learning Activities Divine design Consider beginning class by showing a chessboard and pieces or a picture of a chessboard. Invite students to share what they know about the game of chess. If needed, explain that the game works as players move their pieces into strategic positions to win the game. You could ask students what they think makes a skilled chess player. If students do not mention it, consider sharing that skilled players map out their winning strategy several moves ahead as the game progresses. You could then ask students to think about how our lives could be like a game of chess, sharing Elder Rasband’s explanation. Elder Ronald A. Rasband of the Quorum of the Twelve Apostles taught: Our lives are like a chessboard, and the Lord moves us from one place to another—if we are responsive to spiritual promptings. Looking back, we can see His hand in our lives. (“ By Divine Design ,” Ensign or Liahona , Nov. 2017, 55) Why do you think it can be easier to notice God’s influence in our lives looking into the past, rather than right now? The account of Esther demonstrates how God’s influence in Esther’s life put her in a position to accomplish His work. In this lesson, you will study the first part of this account. As you study, prayerfully seek the Holy Ghost to help you recognize how Heavenly Father may be placing you in situations to help Him accomplish His work. For such a time as this After the Persians conquered Babylon, many Jews remained in Persia, including Esther and her guardian, Mordecai. The king of Persia, Ahasuerus, became dissatisfied with his wife Vashti and sent her away (see Esther 1:1–12 ). Seeking a new bride, Ahasuerus called for all the women of Persia to be brought before him (see Esther 2:1–4 ). To help students understand the story of Esther, you could organize students into small groups to study one of the following scripture blocks. Invite groups to summarize their part of the story for the class. You may want to think of an interesting way students could summarize their account. They could draw a symbol on a sheet of paper to represent the story (for example, a crown or wedding veil, a royal ring, a sword, or a weeping emoji). Students could act out the story while others narrate it. Read your assigned passage looking for the difficult circumstances Esther and Mordecai faced. Esther 2:5–11, 15–17 Esther 3:1–13 Esther 4:1–9 As students share, be conscious of time so that students do not spend too long summarizing these accounts. How do you think Heavenly Father and Jesus Christ felt about the events in these verses? About Mordecai? About Esther? Read Esther 4:10–14 , looking for how Mordecai helped Esther see the influence Heavenly Father may have had on the circumstances of her life. You may want to have students mark the question “who knoweth whether thou art come to the kingdom for such a time as this?” ( verse 14 ). Elder Rasband testified that God does influence the circumstances of our lives to accomplish His work. I know that the Lord will move us on that seeming chessboard to do His work. What may appear to be a random chance is, in fact, overseen by a loving Father in Heaven who can number the hairs of every head. Not even a sparrow falls to the ground without our Father’s notice. The Lord is in the small details of our lives, and those incidents and opportunities are to prepare us to lift our families and others as we build the kingdom of God on earth. … Heavenly Father can put us in situations with specific intent in mind. He has done so in my life, and He is doing so in yours. (“ By Divine Design ,” Ensign or Liahona , Nov. 2017, 55–56) What truths can we learn about Heavenly Father from the account of Esther and Elder Rasband? As students share their responses, write a truth on the board using students’ words like Heavenly Father places us in situations where we can help accomplish His work . Note : Esther’s courage to go before the king to save her people will be studied in Lesson 95: “ Esther, Part 2 .” Recognizing Heavenly Father’s guidance It may be helpful to point out that accomplishing the Lord’s work is often not a dramatic experience. It may be small but still significant. For a few examples of these small but significant experiences, you could share either Sister Michelle Craig’s story in “ Eyes to See ” time code 2:23 to 4:54 ( Ensign or Liahona , Nov. 2020, 16) or Elder Brook P. Hales account in “ Answers to Prayers ,” time code 2:16 to 4:32. You can find videos of these accounts at ChurchofJesusChrist.org . 6:27 12:39 How has the Lord given you or someone you know an opportunity to be an instrument in His hands? Consider sharing an experience when you have recognized opportunities Heavenly Father has given you to help accomplish His work. To help students reflect on how Heavenly Father has placed them in situations to accomplish His work, you could give them time to silently ponder their answers to the following question. They could record their thoughts in their study journal. How do you think Mordecai’s statement in verse 14 might describe you? If you feel students need more help to recognize these opportunities in their lives, you could instead have students complete the following activity. In your study journal, write down the name of someone in your life (family, school, church, or other setting). Then answer at least one of the following in your journal. What evidence have you seen that Heavenly Father has placed that person in your life “for such a time as this?” ( Esther 4:14 )? When have you seen Heavenly Father’s hand placing you around specific people or in certain situations “for such a time as this?” ( Esther 4:14 )? As appropriate, you might invite willing students to share what they wrote with the class. Consider encouraging students to act on any spiritual impressions they may have had during the lesson.\n\n\n--- Lesson 95 ---\nAs followers of Jesus Christ, we all will have times when we need to demonstrate courage, even though our circumstances may be different. Esther demonstrated courage as she relied on the Lord while facing potential death in order to save her people. This lesson can help students act with courage to do the Lord’s will. Student preparation: Invite students to prepare to share an example of when someone they know demonstrated courage to do the Lord’s will Possible Learning Activities A call for courage Consider beginning class by sharing an experience of when someone demonstrated courage, such as in the following story. President Thomas S. Monson shared the following story: 16:18 While serving in the United States Navy in World War II, I learned of brave deeds, instances of valor, and examples of courage. One which I shall never forget was the quiet courage of an 18-year-old seaman—not of our faith—who was not too proud to pray. Of 250 men in the company, he was the only one who each night knelt down by the side of his bunk, at times amidst the jeers of bullies and the jests of unbelievers. With bowed head, he prayed to God. He never wavered. He never faltered. He had courage. (“ Be Strong and of a Good Courage ,” Ensign or Liahona , May 2014, 67) Who do you think of when you hear the word courage ? What are situations where Latter-day Saint teenagers might need to demonstrate courage? Ponder a specific situation, such as at school, at home, or with friends, where you feel Heavenly Father might want you to demonstrate greater courage. Write this situation in your study journal. As you study the remainder of the story of Esther, invite the Holy Ghost to help you know how Heavenly Father and Jesus Christ can help you face that situation with courage. Esther’s courage To help students share what they remember about the story of Esther, consider displaying a picture of Esther and the following names. Invite students to share what they remember about each person. Esther Mordecai King Ahasuerus Haman Or you could show a video such as “ For Such a Time as This ” from time codes 5:12 to 9:41. This video is available at ChurchofJesusChrist.org . 13:44 The following summary could be used to add any important details students may have missed. Esther became the queen to King Ahasuerus of Persia. Esther’s guardian, Mordecai, refused to bow to Haman, the king’s chief minister. Haman was angered and received permission from the king to destroy all of the Jews in the kingdom. Mordecai asked Esther to seek intervention from the king, telling her that perhaps God placed her in this position “for such a time as this” ( Esther 4:14 ). If students need help answering the following question, you could invite them to read Esther 4:10–11 . Why would approaching the king require great courage? Read Esther 4:15–17 , looking for how Esther demonstrated courage as she prepared to approach the king. You could also show the remainder of the video “ For Such a Time as This ” from time codes 11:10 to 13:44. 13:44 As you discuss the following questions, it may be helpful to remember that validating students’ comments can help students be more willing to participate in the future. What stands out to you about Esther? What principles can we learn from verses 15–17 that can help us when we need courage? Thank students for the meaningful principles they shared. If not already mentioned, you could help them identify the following principle: As I rely on Heavenly Father and Jesus Christ, They will give me courage. What evidence do you see that Esther relied on the Lord? How might this have helped her? Courageous acts The following scripture passages can help students see how the Lord continued to bless Esther with courage. Consider organizing students into small groups or pairs. Assign each group or pair one of the following passages of scripture. Or students within the same group could each study one of the passages and prepare to share with each other. Study one of the following passages of scripture, looking for how Esther demonstrated courage. Esther 5:1–4 . Esther approached the king. Esther 7:1–4 . Esther, the king, and Haman held a private banquet. Esther 8:3–6 . Esther discussed with the king his edict to slay the Jews. Then, discuss the following questions: How were Esther’s actions a demonstration of courage? What do you think a person needs to know about God to make the choice Esther made? Invite willing students to share what they discussed with the class. Helping students place Jesus Christ at the center of their learning invites the Holy Ghost to testify of Him. This can help students have a more personal and powerful learning experience. One way we can do this is by connecting the story of Esther to the life and example of Jesus Christ. (For additional training on helping students connect what they are learning to the life and example of Jesus Christ, see “ Emphasize the example of Jesus Christ ” in Teacher Development Skills [2022], 5.) Display a picture of Jesus Christ on the board. Consider asking one or both of the following questions. How does Esther remind you of the Savior? What are examples from the Savior’s life where He demonstrated courage? To prepare students to share their own experiences, consider showing students a video such as “ Having Courage and Trusting the Lord ” (3:18), available at ChurchofJesusChrist.org . 3:18 When is a time you, or someone you know, relied on the Lord and were blessed with courage? My personal act of courage The following suggestions can help students apply what they learned from the account of Esther. Reflect on the situation you thought about at the beginning of the lesson. Seek guidance from the Spirit as you ponder how you can demonstrate courage and rely on the Lord in that situation. Read Esther 4:16 again, emphasizing the following statement: “… and so will I go in unto the king, which is not according to the law: and if I perish, I perish.” To help students emphasize the statement in verse 16 , they could mark or highlight it if desired. Then, consider inviting them to rewrite the statement in their study journal using the prompts below. Reword this statement to reflect your commitment to show courage and rely on the Lord with your situation. To help you do this, consider completing the following prompts: And so I will (the action you would like to do to demonstrate courage). And if (a possible consequence), I (something you will do to rely on the Lord). It might be helpful to provide an example, such as the following: Imagine you feel that Heavenly Father wants you to have the courage to stop using crude and offensive language with your friends. You could reword Esther 4:16 to say: “And so I will not use bad language anymore, even when joking. And if my friends tease or mock me, then I will pray for the strength to keep trying.” Invite willing students to share what they wrote. If time permits, students could share advice with each other regarding the situations they share. Testify of the Lord’s example of courage. Express your belief in your students’ ability to face their challenges with courage as they rely on the Lord to do His will.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 21646,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.388648"
}