{
  "week_number": 18,
  "date_range": "Exodus 35–40",
  "title": ";Leviticus 1;4;16;19",
  "primary_scriptures": [
    {
      "book": "Leviticus",
      "chapters": [
        "1"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;Leviticus 1;4;16;19 ---\nLeaving Egypt—as important as that was—didn’t fully accomplish God’s purposes for the children of Israel. Even a comfortable life in the promised land wasn’t God’s ultimate goal for them. These were only steps toward what God really wanted for His people: “Ye shall be holy: for I the Lord your God am holy” (\nLeviticus 19:2\n). How did God plan to make His people holy after they had lived in captivity for generations? He commanded them to create a place of holiness in the wilderness—a tabernacle. He gave them covenants and laws to guide their actions and change their hearts. And He commanded them to make animal sacrifices to teach them about atonement for their sins. All of this was meant to point their minds, hearts, and lives toward the Savior. He is the true path to holiness, for the Israelites and for us. We have all spent some time in the captivity of sin, and we are all invited to leave sin behind and follow Jesus Christ, who has promised, “I am able to make you holy” (\nDoctrine and Covenants 60:7\n).\nFor an overview of the book of Leviticus, see “\nLeviticus\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nExodus 35–40\n;\nLeviticus 19\nThe Lord wants me to become holy.\nExodus 35–40\ndescribes the Israelites’ efforts to build a tabernacle, where sacred ordinances would help them become a holy people. As you read these chapters, look for the things the Lord asked His people to place in the tabernacle. What might these items represent? What do they suggest to you about increasing in holiness? Especially consider how these items turn your thoughts toward the Savior. A table like this might help you:\nWhat object did you find?\nWhat can this represent?\nWhat object did you find?\nArk of the covenant (\nExodus 37:1–9\n;\n40:20–21\n)\nWhat can this represent?\n(See\nExodus 25:20–22\n; Guide to the Scriptures, “\nArk of the Covenant\n”)\nWhat object did you find?\nAltar of incense (\nExodus 40:26–27\n; see also\nExodus 30:1, 6–8\n)\nWhat can this represent?\n(See\nRevelation 8:3–4\n)\nWhat object did you find?\nCandlestick or lampstand (\nExodus 37:17–24\n)\nWhat can this represent?\n(See\nMatthew 5:14–16\n;\nJohn 8:12\n)\nWhat object did you find?\nAltar of sacrifice (\nExodus 38:1–7\n; see also\nExodus 27:1\n;\n29:10–14\n)\nWhat can this represent?\n(See Guide to the Scriptures, “\nSacrifice\n”)\nWhat object did you find?\nLaver (basin) of water (\nExodus 30:17–21\n)\nWhat can this represent?\n(See\n2 Chronicles 4:6\n;\nIsaiah 1:16\n;\nJeremiah 33:8\n)\nOf course, simply being in holy places doesn’t make us holy.\nLeviticus 19\ndescribes laws and commandments the Lord gave to help the Israelites increase in holiness. What do you find in these commandments that could help you seek holiness from the Lord? What do you feel impressed to do to more fully live these principles?\nSee also Henry B. Eyring, “\nHoliness and the Plan of Happiness\n,”\nLiahona\n, Nov. 2019, 100–103; “The Tabernacle” (video), Gospel Library.\n7:19\nThe Tabernacle\nUse sacred music.\nMusic has great power to invite the influence of the Spirit and build faith in Jesus Christ. The messages in hymns often reinforce the doctrine in the scriptures. For instance, singing a hymn like “\nMore Holiness Give Me\n” (\nHymns\n, no. 131) can reinforce some of the messages taught in\nLeviticus 19\n. It can also help you think about what it means to become more holy like the Savior and ponder how He is helping you increase in holiness.\nExodus 35:4–35\n;\n36:1–7\nThe Lord asks me to make my offerings with a willing heart.\nIn the year after leaving Egypt, the relationship of the children of Israel with Jehovah could be described as inconsistent. And yet, as you read\nExodus 35:4–35\nand\n36:1–7\n, notice how the Israelites responded to the commandment to build the tabernacle. What do you learn from the Israelites that could help you better serve the Lord?\nHe may not ask you for precious metals, linens, or wood for a tabernacle. What has the Lord given you, and what is He asking you to offer? When has your “heart stirred [you] up to come unto the work”?\nSee also Topics and Questions, “\nSacrifice\n,” Gospel Library.\nThe children of Israel gave offerings for the tabernacle with “a willing heart” (\nExodus 35:5\n). Illustration by Corbert Gauthier, © Lifeway Collection/licensed from\ngoodsalt.com\nExodus 40:12–14\nTemple ordinances were given anciently.\nExodus 40:12–14\nrefers to ancient ordinances that are also administered in our day in the house of the Lord. Here are some additional verses that can help you learn about how these ordinances testify of Jesus Christ:\nWashing:\nPsalm 51:2\n;\nEzekiel 36:25–27\nClothing in holy garments:\nIsaiah 61:10\n;\nMatthew 22:11–14\n;\nRevelation 19:7–8\nAnointing:\nLuke 4:18–19\n;\nActs 10:38\nLeviticus 1:1–9\n;\n4\n;\n16\nBecause of the sacrifice of Jesus Christ, I can be forgiven.\nMuch of the book of Leviticus may seem strange to us—animal sacrifices, rituals involving blood and water, and laws governing small details of life. But these rituals and laws were meant to teach principles that are familiar—repentance, holiness, and the Savior’s Atonement. To find these principles as you read\nLeviticus 1:1–9\n;\n4\n;\n16\n, consider questions like these:\nWhat words or phrases do I find that remind me of Jesus Christ and His atoning sacrifice?\nWhat do I learn from these sacrifices about the Savior’s sacrifice?\nHow am I like the people who made these sacrifices?\nThe Lord doesn’t require animal sacrifices anymore. But sacrifice is still an important principle of the gospel. To learn about the kinds of sacrifice the Lord does require, study\n3 Nephi 9:19–20\n;\nDoctrine and Covenants 64:34\n. How are you offering these kinds of sacrifices? What does\nMoses 5:7\nteach you about how you should view your sacrifices?\nSee also “\nThoughts to Keep in Mind: The Tabernacle and Sacrifice\n.”\nStudy Helps\nWhy did the Lord command Moses to wash, anoint, and clothe Aaron and his sons?\nWhat as the Day of Atonement?\nClick to see more.\nIdeas for Teaching Children\nExodus 35:20–29\n;\n36:1\nGod has given me gifts to help with His work.\nAt the end of this outline is a picture of the Israelites’ wilderness tabernacle. You might want to look at it with your children and ask them what materials would have been needed to build the tabernacle. Then you could read together\nExodus 35:20–29\nto find out how these materials were provided. How has the Lord invited us to contribute to building His kingdom?\nConsider reading with them\nExodus 36:1\nto find out what the Lord gave Bezaleel and Aholiab to help build the tabernacle. You could then talk with your children about what you feel the Lord has given them to help build His kingdom. How can we use these things to bless others?\nRome Italy Temple\nExodus 40:17–34\nI can feel the Lord’s presence in holy places.\nExodus 40:17–34\nlists things that were part of the Israelites’ tabernacle. Maybe you and your children could find them in these verses and in the picture of the tabernacle at the end of this outline. Talk about how each part of the tabernacle could teach about the Savior or Heavenly Father. For example, the ark of testimony could remind us of God’s commandments, the altar could remind us of Jesus Christ’s sacrifice, and so on.\nWhat holy places do we have today that help us feel closer to Jesus Christ? As part of this conversation, you could watch together the video “Temples” (Gospel Library). You could also sing a song like “Holy Places” (Gospel Library). Share with each other how you feel about sacred places like the temple.\n5:41\nWhat Is a Temple?\nLeviticus 1:1–4\nBecause of the sacrifice of Jesus Christ, I can be forgiven.\nThe animal sacrifices described in the Old Testament were meant to teach the children of Israel about forgiveness through Jesus Christ. Consider how reading about these sacrifices could do the same for your children. You could show pictures of Jesus Christ in Gethsemane and on the cross (see\nGospel Art Book\n,\nnos. 56\n,\n57\n) as you read with the children\nLeviticus 1:1–4\n. Help them find words or phrases that remind them of the sacrifice of Jesus Christ.\nYou might also read together\n3 Nephi 9:19–20\nto find out what we are commanded to sacrifice instead of animals. What does it mean to offer a broken heart and contrite spirit to the Lord? See Guide to the Scriptures, “\nBroken Heart\n” (Gospel Library) for help answering this question.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 18: Lesson 52: Lesson 52—Exodus 25; 35–40This lesson can help students feel an increased desire to worship the Lord in His temple.; Lesson 53: Lesson 53—Leviticus, Part 1This lesson can help students feel gratitude for Jesus Christ and His atoning sacrifice.... ---\n\n--- Lesson 52 ---\nIn obedience to the Lord’s command, the Israelites built a tabernacle, or temple, in the wilderness. This tabernacle was a portable sanctuary where the Lord could dwell among His people as they traveled. This lesson can help students feel an increased desire to worship the Lord in His temple. Student preparation: Consider inviting students to use the Gospel Library or temples.ChurchofJesusChrist.org to find pictures of temples or videos related to the temple. Ask students to think about how they feel about the Lord’s temple. Invite them to consider how modern-day temples help them remember Heavenly Father and Jesus Christ. Possible Learning Activities What is the purpose of temples? Consider beginning the lesson by sharing the following scenario. You could then display the questions after the scenario and invite students to discuss them with a partner. Imagine that a temple will soon be dedicated in your area. You invite a friend to attend the temple open house with you. Your friend accepts your invitation but mentions that she does not know anything about temples. What would you want your friend to understand about temples and their purpose? How might you respond if your friend asked you why temples are important to you? After students have discussed their responses with their partners, invite them to think about their answers to the following question. Using a scale from 1 (low) to 5 (high), how would you rate your desire to consistently worship the Lord in the temple? Consider inviting the students to think about why they responded the way they did to the previous question. As you study today, pay attention to what the Holy Ghost can teach you about temples and how they connect us to Heavenly Father and Jesus Christ. Seek inspiration to help you feel an increased desire to worship the Lord in His temples. The Lord commands the Israelites to build a tabernacle While speaking with Moses on Mount Sinai, the Lord asked that the Israelites offer their gold, silver, and other valuable materials to build a sanctuary, or tabernacle, for Him. In our time, we have also been asked to build temples to serve as a sanctuary or a place of holiness. Read Exodus 25:8 , looking for why the Lord wanted the Israelites to build a sanctuary. What did you find? What does the Lord’s reason for this commandment teach you about Him and the way He feels about us? Symbolism of the tabernacle Remind students that there are many symbols in the scriptures that can teach us about Heavenly Father and Jesus Christ. Learning from symbols is a study skill that can help them learn more from the scriptures. For additional training on using symbolism, see “ Look for symbols that testify of Jesus Christ ” in Teacher Development Skills (2022), 9. The objects and ordinances in the tabernacle were symbolic. They were meant to teach Israel about Heavenly Father and Jesus Christ and how to journey through life back to Them. To help students learn about the symbols of the tabernacle, consider distributing the handout titled “ The Old Testament Tabernacle .” You could also place tape or string on the floor of the classroom to re-create the diagram from the handout. Consider inviting students to study the objects in the tabernacle in small groups. Each group could be assigned different objects to study. Groups could then share their findings with the class. Remind students to seek guidance from the Spirit as they consider what the objects teach them about Heavenly Father and Jesus Christ. You can provide help as needed, but in general, it may be best to allow students to discover and make connections on their own as they learn for themselves through the Holy Ghost. 7:19 Instead of the handout, you could have students study the article “ Journey through the Ancient Tabernacle ” ( Ensign , Mar. 2018, 52–53) or watch the video “ The Tabernacle ” (7:18), available on ChurchofJesusChrist.org . Open PDF After students have had enough time to study, invite them to share what they learned. You could ask questions like the following as part of this discussion. What symbols seemed especially meaningful or interesting to you? What did the symbols from the tabernacle teach you about Heavenly Father and Jesus Christ? Modern-day temples Consider displaying an image of a modern-day temple . Explain that temples today include Melchizedek Priesthood ordinances that God withheld from the ancient Israelites because of their rebellion. Despite this difference, there are many similarities that our temples share with the ancient tabernacle. What similarities do you see between our temples and the ancient tabernacle? What truths do you learn from these similarities? Encourage students to share a variety of answers to the previous question. You could list on the board the truths that students identify. Using their own words, students may identify truths such as the following: The Lord commands us to build temples so He can dwell among us. The ordinances and symbols of the temple teach about Heavenly Father and Jesus Christ. The temple helps us prepare to return to Heavenly Father and Jesus Christ. Explain that, like the ancient tabernacle, modern-day temples contain symbols that teach us about Heavenly Father and Jesus Christ. What are ways that modern-day temples help you remember Heavenly Father and Jesus Christ? As part of your discussion of the previous question, consider showing pictures of specific rooms inside modern-day temples. For example, after pointing out a picture of a baptistry in the temple, you could ask the students what the ordinance of baptisms for the dead can teach us about Heavenly Father and Jesus Christ. You might want to use the images above or the images included in the article “ Inside Temples ,” available at ChurchofJesusChrist.org . You could also watch the video “ Welcome to the Washington D.C. Temple ” (11:46), available at ChurchofJesusChrist.org . This video is another resource to help students see how modern-day temples teach us about Heavenly Father and Jesus Christ. If time is limited, consider watching one of the following portions: time code 0:00 to 3:49, time code 4:37 to 7:44, or time code 8:16 to 9:04. 11:45 How can knowing that temples teach us about Heavenly Father and Jesus Christ affect our desire to worship there? When have you felt closer to Heavenly Father and Jesus Christ because of the temple or by participating in temple and family history work? Record your impressions To help students reflect on what they have learned and felt from the Holy Ghost today, consider inviting them to answer the following question in their study journals. What have you learned or felt today from the Holy Ghost that has influenced your desire to worship the Lord in the temple? You could invite a few willing students to share what they wrote. Let students know they will have an opportunity to reflect on their desire to worship the Lord in the temple in Lesson 80: “ Assess Your Learning 5 ”. Testify of the truths you have discussed today.\n\n\n--- Lesson 53 ---\nWhile the practice of sacrificing animals may seem strange today, these sacrifices helped ancient Israel know and appreciate what the Savior had covenanted to do for them. Learning about these ancient sacrifices can likewise help us know and appreciate what the Savior did for us. This lesson can help students feel gratitude for Jesus Christ and His atoning sacrifice. Student preparation: Invite students to ponder advice they would give someone who is struggling to understand what Jesus Christ has done for them. You could also invite students to ask a family member or friend what advice they would give. Possible Learning Activities What has He done for me? To prepare students to talk about Jesus Christ, consider sharing the following experience. President Dallin H. Oaks of the First Presidency shared the following interaction he had with a member of the Church: 12:44 In a Saturday evening meeting at a stake conference many years ago, I met a woman who said her friends had asked her to come back to church after many years of inactivity, but she could not think of any reason why she should. To encourage her, I said, “When you consider all of the things the Savior has done for you, you have many reasons to come back to worship and serve Him.” I was astonished when she replied, “What’s He done for me?” (“ What Has Our Savior Done for Us? ,” Liahona , May 2021, 75) Ponder what you would say to the woman if she asked you this question. How might our lives be affected if we fail to recognize or remember what the Savior has done for us? To help students personalize today’s lesson, consider displaying the following questions. Give students time to record their answers in their study journals. What has the Savior done for you? How do you feel about Jesus Christ for what He has done for you? As you study Leviticus today, seek guidance from the Holy Ghost about how you can deepen your gratitude for what the Lord has done for you. Finding Christ in sacrifices To prepare students to study Leviticus, consider displaying the images from the beginning of the lesson. Invite the students to discuss what they know about the ancient ordinance of animal sacrifice. For example, you could ask them when God first commanded His children to perform animal sacrifices and why He gave that commandment. If needed, you could refer students to Moses 5:6–7 . Then ask the following question. What did these sacrifices represent? Help students understand that from the time of Adam and Eve, God commanded His people to perform animal sacrifice to help them look forward to the Savior and His atoning sacrifice. This practice ended with the death of Jesus Christ, who was the “great and last sacrifice” ( Alma 34:10 ). The book of Leviticus contains the Lord’s directions for animal and other types of sacrifices that He required of His people. Leviticus is like a handbook that provides instructions for ancient Israel’s ordinances, rituals, and sacred responsibilities. Give students an opportunity to study some of the sacrifices described in Leviticus. One way to do this is to distribute the handout titled “ Ancient Sacrifice: A Symbol of Jesus Christ .” You could distribute the two activities from the handout separately, or you could distribute it as one handout. Consider organizing students into pairs. You could assign each pair to complete one of the activities. The students could then teach what they learned to another pair that completed a different activity. Or you could invite one partner in each pair to complete Study Activity 1 and the other partner to complete Study Activity 2. After students individually complete their activities, they could teach one another. Open PDF After students have completed their study, invite them to share some of their responses to the handout questions. You could use the following question to help students summarize what they learned. How would you summarize in a simple statement what you learned today about the Savior and His atoning sacrifice? Students may share a variety of truths, such as: Jesus Christ willingly offered Himself as a sacrifice for us. We can be forgiven of our sins because of Jesus Christ. Through His atoning sacrifice, Jesus Christ paid for our sins by taking them upon Himself. To deepen students’ gratitude for these truths, consider using the following statement and questions. You may have used this statement in Lesson 27: “ Genesis 22 .” President Dallin H. Oaks of the First Presidency explained why Jesus Christ performed the Atonement: Jesus Christ did all of this because He loves all of the children of God. Love is the motivation for it all, and it was so from the very beginning. … I … pray that we all will remember what our Savior has done for each of us. (“ What Has Our Savior Done for Us? ,” Liahona , May 2021, 77) How does it help you to know that Jesus Christ allowed Himself to be sacrificed because of His love for you? What are some ways we can remember the Lord and His sacrifice? Help students understand that one way we remember the Savior’s sacrifice is by partaking of the sacrament weekly. To help students see the connection between ancient sacrifice and the sacrament, consider showing the video “ Always Remember Him ” (5:27), available at ChurchofJesusChrist.org . You could then ask the following questions. 5:27 How is the sacrament similar to the ancient sacrifices? How do you strive to remember the Savior in your daily life? What Jesus did for me Give students time to reflect on their feelings toward Jesus Christ. To prepare them to do this, you could invite the class to sing “ I Stand All Amazed ” ( Hymns , no. 193). Students could identify phrases from the hymn that reflect their feelings toward the Savior. Alternatively, you could invite students to choose a different hymn or a scripture about the Savior and His Atonement. They could share phrases that reflect their feelings toward Him. Then, invite students to respond to the following question in their journals. How do you feel about the Savior and what He has done for you? Willing students could express their thoughts and feelings about the Savior. Consider sharing your own feelings and testimony about Him.\n\n\n--- Lesson 54 ---\nAncient Israel performed rituals that symbolized Jesus Christ and His Atonement. Among these rituals was the sacrifice of burnt offerings. These offerings also demonstrated Israel’s continual commitment to sacrifice anything the Lord asked of them. This lesson can help students recognize sacrifices they can make to become more like Heavenly Father and Jesus Christ. Student preparation: Invite students to do something that they feel would be a good sacrifice for the Lord. Some examples might include paying tithing or fast offerings, sacrificing time to help someone in need, or sacrificing a few extra minutes of sleep to study the scriptures. Invite students to reflect on how this sacrifice affects their relationship with the Lord. Possible Learning Activities Willingness to sacrifice Consider beginning class by helping students see the value of being willing to make sacrifices for the Lord. You could do this by writing the following statement on the board. Invite students to discuss the accompanying questions. The key to making our day successful is … How would you finish this statement? Why do you feel your answer could help someone have a successful day? Elder Taylor G. Godoy of the Seventy shared the following about a successful day: The key to making our day successful is to be willing to sacrifice. (“ One More Day ,” Ensign or Liahona , May 2018, 34) Why do you think being willing to sacrifice can make our day successful? Consider writing students’ responses to the following question on the board. You could reference these answers at various points throughout the lesson. What are some sacrifices the Lord asks of us that you feel could lead to a successful day, week, or life? Consider inviting students to reflect on their willingness to make sacrifices for the Lord. One way you could do this is to show students a pie chart. Provide the following instructions. Create a pie chart in your study journal. Fill in a percentage (0 percent to 100 percent) that you feel reflects your willingness over the past week to sacrifice for the Lord. Then ponder the following questions: If you feel your percentage is high, why have you been willing to sacrifice for the Lord? If you feel your percentage is low, what may have kept you from being more willing to sacrifice? Consider offering a silent prayer. Ask Heavenly Father to help you understand what He would have you know and do regarding your personal sacrifices. During this lesson, pay attention to thoughts and feelings that might come to you through the Holy Ghost. Burnt offerings In Leviticus 1 , the Lord instructs the Israelites to make burnt offerings. Priests made these offerings daily. The offerings were symbolic of the Savior’s Atonement. These offerings were also a sign of Israel’s continual commitment to the Lord. Read Leviticus 1:3, 8–9 , looking for words and phrases that could relate to sacrifices we might make for the Lord today. What did you find? If students need help, you could point out some of the following: “He shall offer it of his own voluntary will” ( verse 3 ). “Head,” “fat,” “inwards,” and “legs” ( verses 8–9 ). These different parts of the animal could be symbolic of offering the Lord anything He asks of us, including our hearts, minds, and bodies. “Burn all on the altar” ( verse 9 ). Burning the whole animal on the altar represented total commitment to the Lord. “Sweet savour unto the Lord” ( verse 9 ). This can mean that our sacrifices are sweet and pleasing to Heavenly Father and the Savior. Jesus Christ is the perfect example of offering sacrifice. How can our willingness to sacrifice help us become more like the Savior? One lesson we can learn by understanding burnt offerings is that we can become more like our Savior as we are willing to sacrifice anything Heavenly Father asks of us . Living the law of sacrifice in our time After the atoning sacrifice of Jesus Christ was completed, He adjusted the type of sacrifice He asked His people to make (see 3 Nephi 9:19–20 ). Though we currently do not sacrifice animals, the Lord still asks His people to make sacrifices. These sacrifices include more than giving up our temporal possessions. Display the following instructions, scripture passages, and questions. You might invite students to complete this on their own. Study two or more of the following passages, looking for insights that can help you answer the questions below. Romans 12:1–2 Omni 1:26 3 Nephi 9:19–20 Doctrine and Covenants 4:2 How could you use these passages to help someone understand what the Lord wants us to sacrifice in our time? How could sacrificing in these ways help us become more like the Savior? Why do you think it can be difficult for some people to be willing to sacrifice what the Lord asks of them? Invite volunteers to share what they learned and how they would answer the two questions above. You might also discuss how these verses could apply to the sacrifices they listed on the board earlier in the lesson. This discussion could lead into the next question. Blessings of sacrifice Consider putting students into small groups. Invite them to use their answers to the previous question to create a scenario where someone might hesitate to sacrifice what the Lord asks of them. Following is one simple example. Invite students to discuss the accompanying question in their groups. To help with this discussion, students could study “ Sacrifice ” in the Guide to the Scriptures. Imagine you have a friend who feels they don’t have enough time to make some of the sacrifices the Lord asks of them. What could you share that might help resolve some of your friend’s concerns? Invite a few groups to share some of their insights. As they share, consider asking follow-up questions like “What would you want your friend to know about Heavenly Father and Jesus Christ that could help them be more willing to make sacrifices for Them?” or “What personal experiences could you share that have taught you the value of making sacrifices for the Lord?” To deepen understanding about sacrifice, you could display the following statement. Elder Ulisses Soares of the Quorum of the Twelve Apostles shared some of the blessings the Lord gives as we make sacrifices for Him: 14:48 Our determination to cast off all that is contrary to God’s will and to sacrifice all we are asked to give and to strive to follow His teachings will help us to endure in the path of Jesus Christ’s gospel—even in the face of tribulation, the weakness of our souls, or the social pressure and worldly philosophies that oppose His teachings. (“ Take Up Our Cross ,” Ensign or Liahona , Nov. 2019, 114) What have you learned about the Lord and His reasons for asking us to sacrifice? Personal sacrifice Invite students to reflect on impressions they have received. Consider displaying the following instructions. If helpful, students could refer to the list of sacrifices on the board as they complete this activity. Complete one of the following in your study journal: One sacrifice I am already making for Heavenly Father is … Something I learned today that will help me continue or improve on this sacrifice is … One thing I will start or stop doing to show my willingness to sacrifice for the Lord is … Something I learned today that will help me make this change is … You could invite students to share what they wrote along with their testimony of what they have learned or felt.\n\n--- SCRIPTURE: Leviticus 1 ---\n1. And theLordcalleduntoMoses, and spake unto him out of thetabernacle of the congregation, saying,\n2. Speak unto the children of Israel, and say unto them, If any man of you bring an offering unto theLord, ye shall bring your offering of the cattle,evenof the herd, and of the flock.\n3. If his offeringbeaburntsacrificeof the herd, let him offer malewithoutblemish: he shall offer it of his ownvoluntarywill at the door of the tabernacle of the congregation before theLord.\n4. And he shall put hishandupon the head of the burnt offering; and it shall beacceptedfor him to makeatonementfor him.\n5. And he shall kill thebullockbefore theLord: and the priests, Aarons sons, shall bring the blood, andsprinklethe blood round about upon the altar thatis bythe door of the tabernacle of the congregation.\n6. And he shall flay the burnt offering, and cut it into his pieces.\n7. And the sons ofAaronthe priest shall put fire upon the altar, and lay the wood inorderupon the fire:\n8. And the priests, Aarons sons, shall lay the parts, the head, and the fat, in order upon the wood thatison the fire whichisupon the altar:\n9. But his inwards and his legs shall he wash in water: and thepriestshall burn all on the altar,to bea burnt sacrifice, an offering made by fire, of asweet savourunto theLord.\n10. And if his offeringbeof the flocks,namely,of the sheep, or of the goats, for burnt sacrifice; he shall bring it malewithout blemish.\n11. And he shall kill it on the side of the altar northward before theLord: and the priests, Aarons sons, shall sprinkle his blood round about upon the altar.\n12. And he shall cut it into his pieces, with his head and his fat: and the priest shall lay them in order on the wood thatison the fire whichisupon the altar:\n13. But he shall wash the inwards and the legs with water: and the priest shall bringitall, and burnitupon the altar: itisaburntsacrifice, an offering made by fire, of sweet savour unto theLord.\n14. And if the burnt sacrifice for his offering to theLordbeof fowls, then he shall bring his offering ofturtledoves, or of young pigeons.\n15. And the priest shall bring it unto the altar, and wring off his head, and burniton the altar; and the blood thereof shall be wrung out at the side of the altar:\n16. And he shall pluck away his crop with his feathers, and cast it beside the altar on the east part, by the place of the ashes:\n17. And he shall cleave it with the wings thereof,butshall not divideitasunder: and the priest shall burn it upon the altar, upon the wood thatisupon the fire: itisa burnt sacrifice, an offering made by fire, of sweet savour unto theLord.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";Leviticus 1;4;16;19",
      "content": "Leaving Egypt—as important as that was—didn’t fully accomplish God’s purposes for the children of Israel. Even a comfortable life in the promised land wasn’t God’s ultimate goal for them. These were only steps toward what God really wanted for His people: “Ye shall be holy: for I the Lord your God am holy” (\nLeviticus 19:2\n). How did God plan to make His people holy after they had lived in captivity for generations? He commanded them to create a place of holiness in the wilderness—a tabernacle. He gave them covenants and laws to guide their actions and change their hearts. And He commanded them to make animal sacrifices to teach them about atonement for their sins. All of this was meant to point their minds, hearts, and lives toward the Savior. He is the true path to holiness, for the Israelites and for us. We have all spent some time in the captivity of sin, and we are all invited to leave sin behind and follow Jesus Christ, who has promised, “I am able to make you holy” (\nDoctrine and Covenants 60:7\n).\nFor an overview of the book of Leviticus, see “\nLeviticus\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nExodus 35–40\n;\nLeviticus 19\nThe Lord wants me to become holy.\nExodus 35–40\ndescribes the Israelites’ efforts to build a tabernacle, where sacred ordinances would help them become a holy people. As you read these chapters, look for the things the Lord asked His people to place in the tabernacle. What might these items represent? What do they suggest to you about increasing in holiness? Especially consider how these items turn your thoughts toward the Savior. A table like this might help you:\nWhat object did you find?\nWhat can this represent?\nWhat object did you find?\nArk of the covenant (\nExodus 37:1–9\n;\n40:20–21\n)\nWhat can this represent?\n(See\nExodus 25:20–22\n; Guide to the Scriptures, “\nArk of the Covenant\n”)\nWhat object did you find?\nAltar of incense (\nExodus 40:26–27\n; see also\nExodus 30:1, 6–8\n)\nWhat can this represent?\n(See\nRevelation 8:3–4\n)\nWhat object did you find?\nCandlestick or lampstand (\nExodus 37:17–24\n)\nWhat can this represent?\n(See\nMatthew 5:14–16\n;\nJohn 8:12\n)\nWhat object did you find?\nAltar of sacrifice (\nExodus 38:1–7\n; see also\nExodus 27:1\n;\n29:10–14\n)\nWhat can this represent?\n(See Guide to the Scriptures, “\nSacrifice\n”)\nWhat object did you find?\nLaver (basin) of water (\nExodus 30:17–21\n)\nWhat can this represent?\n(See\n2 Chronicles 4:6\n;\nIsaiah 1:16\n;\nJeremiah 33:8\n)\nOf course, simply being in holy places doesn’t make us holy.\nLeviticus 19\ndescribes laws and commandments the Lord gave to help the Israelites increase in holiness. What do you find in these commandments that could help you seek holiness from the Lord? What do you feel impressed to do to more fully live these principles?\nSee also Henry B. Eyring, “\nHoliness and the Plan of Happiness\n,”\nLiahona\n, Nov. 2019, 100–103; “The Tabernacle” (video), Gospel Library.\n7:19\nThe Tabernacle\nUse sacred music.\nMusic has great power to invite the influence of the Spirit and build faith in Jesus Christ. The messages in hymns often reinforce the doctrine in the scriptures. For instance, singing a hymn like “\nMore Holiness Give Me\n” (\nHymns\n, no. 131) can reinforce some of the messages taught in\nLeviticus 19\n. It can also help you think about what it means to become more holy like the Savior and ponder how He is helping you increase in holiness.\nExodus 35:4–35\n;\n36:1–7\nThe Lord asks me to make my offerings with a willing heart.\nIn the year after leaving Egypt, the relationship of the children of Israel with Jehovah could be described as inconsistent. And yet, as you read\nExodus 35:4–35\nand\n36:1–7\n, notice how the Israelites responded to the commandment to build the tabernacle. What do you learn from the Israelites that could help you better serve the Lord?\nHe may not ask you for precious metals, linens, or wood for a tabernacle. What has the Lord given you, and what is He asking you to offer? When has your “heart stirred [you] up to come unto the work”?\nSee also Topics and Questions, “\nSacrifice\n,” Gospel Library.\nThe children of Israel gave offerings for the tabernacle with “a willing heart” (\nExodus 35:5\n). Illustration by Corbert Gauthier, © Lifeway Collection/licensed from\ngoodsalt.com\nExodus 40:12–14\nTemple ordinances were given anciently.\nExodus 40:12–14\nrefers to ancient ordinances that are also administered in our day in the house of the Lord. Here are some additional verses that can help you learn about how these ordinances testify of Jesus Christ:\nWashing:\nPsalm 51:2\n;\nEzekiel 36:25–27\nClothing in holy garments:\nIsaiah 61:10\n;\nMatthew 22:11–14\n;\nRevelation 19:7–8\nAnointing:\nLuke 4:18–19\n;\nActs 10:38\nLeviticus 1:1–9\n;\n4\n;\n16\nBecause of the sacrifice of Jesus Christ, I can be forgiven.\nMuch of the book of Leviticus may seem strange to us—animal sacrifices, rituals involving blood and water, and laws governing small details of life. But these rituals and laws were meant to teach principles that are familiar—repentance, holiness, and the Savior’s Atonement. To find these principles as you read\nLeviticus 1:1–9\n;\n4\n;\n16\n, consider questions like these:\nWhat words or phrases do I find that remind me of Jesus Christ and His atoning sacrifice?\nWhat do I learn from these sacrifices about the Savior’s sacrifice?\nHow am I like the people who made these sacrifices?\nThe Lord doesn’t require animal sacrifices anymore. But sacrifice is still an important principle of the gospel. To learn about the kinds of sacrifice the Lord does require, study\n3 Nephi 9:19–20\n;\nDoctrine and Covenants 64:34\n. How are you offering these kinds of sacrifices? What does\nMoses 5:7\nteach you about how you should view your sacrifices?\nSee also “\nThoughts to Keep in Mind: The Tabernacle and Sacrifice\n.”\nStudy Helps\nWhy did the Lord command Moses to wash, anoint, and clothe Aaron and his sons?\nWhat as the Day of Atonement?\nClick to see more.\nIdeas for Teaching Children\nExodus 35:20–29\n;\n36:1\nGod has given me gifts to help with His work.\nAt the end of this outline is a picture of the Israelites’ wilderness tabernacle. You might want to look at it with your children and ask them what materials would have been needed to build the tabernacle. Then you could read together\nExodus 35:20–29\nto find out how these materials were provided. How has the Lord invited us to contribute to building His kingdom?\nConsider reading with them\nExodus 36:1\nto find out what the Lord gave Bezaleel and Aholiab to help build the tabernacle. You could then talk with your children about what you feel the Lord has given them to help build His kingdom. How can we use these things to bless others?\nRome Italy Temple\nExodus 40:17–34\nI can feel the Lord’s presence in holy places.\nExodus 40:17–34\nlists things that were part of the Israelites’ tabernacle. Maybe you and your children could find them in these verses and in the picture of the tabernacle at the end of this outline. Talk about how each part of the tabernacle could teach about the Savior or Heavenly Father. For example, the ark of testimony could remind us of God’s commandments, the altar could remind us of Jesus Christ’s sacrifice, and so on.\nWhat holy places do we have today that help us feel closer to Jesus Christ? As part of this conversation, you could watch together the video “Temples” (Gospel Library). You could also sing a song like “Holy Places” (Gospel Library). Share with each other how you feel about sacred places like the temple.\n5:41\nWhat Is a Temple?\nLeviticus 1:1–4\nBecause of the sacrifice of Jesus Christ, I can be forgiven.\nThe animal sacrifices described in the Old Testament were meant to teach the children of Israel about forgiveness through Jesus Christ. Consider how reading about these sacrifices could do the same for your children. You could show pictures of Jesus Christ in Gethsemane and on the cross (see\nGospel Art Book\n,\nnos. 56\n,\n57\n) as you read with the children\nLeviticus 1:1–4\n. Help them find words or phrases that remind them of the sacrifice of Jesus Christ.\nYou might also read together\n3 Nephi 9:19–20\nto find out what we are commanded to sacrifice instead of animals. What does it mean to offer a broken heart and contrite spirit to the Lord? See Guide to the Scriptures, “\nBroken Heart\n” (Gospel Library) for help answering this question.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 18: Lesson 52: Lesson 52—Exodus 25; 35–40This lesson can help students feel an increased desire to worship the Lord in His temple.; Lesson 53: Lesson 53—Leviticus, Part 1This lesson can help students feel gratitude for Jesus Christ and His atoning sacrifice....",
      "content": "\n--- Lesson 52 ---\nIn obedience to the Lord’s command, the Israelites built a tabernacle, or temple, in the wilderness. This tabernacle was a portable sanctuary where the Lord could dwell among His people as they traveled. This lesson can help students feel an increased desire to worship the Lord in His temple. Student preparation: Consider inviting students to use the Gospel Library or temples.ChurchofJesusChrist.org to find pictures of temples or videos related to the temple. Ask students to think about how they feel about the Lord’s temple. Invite them to consider how modern-day temples help them remember Heavenly Father and Jesus Christ. Possible Learning Activities What is the purpose of temples? Consider beginning the lesson by sharing the following scenario. You could then display the questions after the scenario and invite students to discuss them with a partner. Imagine that a temple will soon be dedicated in your area. You invite a friend to attend the temple open house with you. Your friend accepts your invitation but mentions that she does not know anything about temples. What would you want your friend to understand about temples and their purpose? How might you respond if your friend asked you why temples are important to you? After students have discussed their responses with their partners, invite them to think about their answers to the following question. Using a scale from 1 (low) to 5 (high), how would you rate your desire to consistently worship the Lord in the temple? Consider inviting the students to think about why they responded the way they did to the previous question. As you study today, pay attention to what the Holy Ghost can teach you about temples and how they connect us to Heavenly Father and Jesus Christ. Seek inspiration to help you feel an increased desire to worship the Lord in His temples. The Lord commands the Israelites to build a tabernacle While speaking with Moses on Mount Sinai, the Lord asked that the Israelites offer their gold, silver, and other valuable materials to build a sanctuary, or tabernacle, for Him. In our time, we have also been asked to build temples to serve as a sanctuary or a place of holiness. Read Exodus 25:8 , looking for why the Lord wanted the Israelites to build a sanctuary. What did you find? What does the Lord’s reason for this commandment teach you about Him and the way He feels about us? Symbolism of the tabernacle Remind students that there are many symbols in the scriptures that can teach us about Heavenly Father and Jesus Christ. Learning from symbols is a study skill that can help them learn more from the scriptures. For additional training on using symbolism, see “ Look for symbols that testify of Jesus Christ ” in Teacher Development Skills (2022), 9. The objects and ordinances in the tabernacle were symbolic. They were meant to teach Israel about Heavenly Father and Jesus Christ and how to journey through life back to Them. To help students learn about the symbols of the tabernacle, consider distributing the handout titled “ The Old Testament Tabernacle .” You could also place tape or string on the floor of the classroom to re-create the diagram from the handout. Consider inviting students to study the objects in the tabernacle in small groups. Each group could be assigned different objects to study. Groups could then share their findings with the class. Remind students to seek guidance from the Spirit as they consider what the objects teach them about Heavenly Father and Jesus Christ. You can provide help as needed, but in general, it may be best to allow students to discover and make connections on their own as they learn for themselves through the Holy Ghost. 7:19 Instead of the handout, you could have students study the article “ Journey through the Ancient Tabernacle ” ( Ensign , Mar. 2018, 52–53) or watch the video “ The Tabernacle ” (7:18), available on ChurchofJesusChrist.org . Open PDF After students have had enough time to study, invite them to share what they learned. You could ask questions like the following as part of this discussion. What symbols seemed especially meaningful or interesting to you? What did the symbols from the tabernacle teach you about Heavenly Father and Jesus Christ? Modern-day temples Consider displaying an image of a modern-day temple . Explain that temples today include Melchizedek Priesthood ordinances that God withheld from the ancient Israelites because of their rebellion. Despite this difference, there are many similarities that our temples share with the ancient tabernacle. What similarities do you see between our temples and the ancient tabernacle? What truths do you learn from these similarities? Encourage students to share a variety of answers to the previous question. You could list on the board the truths that students identify. Using their own words, students may identify truths such as the following: The Lord commands us to build temples so He can dwell among us. The ordinances and symbols of the temple teach about Heavenly Father and Jesus Christ. The temple helps us prepare to return to Heavenly Father and Jesus Christ. Explain that, like the ancient tabernacle, modern-day temples contain symbols that teach us about Heavenly Father and Jesus Christ. What are ways that modern-day temples help you remember Heavenly Father and Jesus Christ? As part of your discussion of the previous question, consider showing pictures of specific rooms inside modern-day temples. For example, after pointing out a picture of a baptistry in the temple, you could ask the students what the ordinance of baptisms for the dead can teach us about Heavenly Father and Jesus Christ. You might want to use the images above or the images included in the article “ Inside Temples ,” available at ChurchofJesusChrist.org . You could also watch the video “ Welcome to the Washington D.C. Temple ” (11:46), available at ChurchofJesusChrist.org . This video is another resource to help students see how modern-day temples teach us about Heavenly Father and Jesus Christ. If time is limited, consider watching one of the following portions: time code 0:00 to 3:49, time code 4:37 to 7:44, or time code 8:16 to 9:04. 11:45 How can knowing that temples teach us about Heavenly Father and Jesus Christ affect our desire to worship there? When have you felt closer to Heavenly Father and Jesus Christ because of the temple or by participating in temple and family history work? Record your impressions To help students reflect on what they have learned and felt from the Holy Ghost today, consider inviting them to answer the following question in their study journals. What have you learned or felt today from the Holy Ghost that has influenced your desire to worship the Lord in the temple? You could invite a few willing students to share what they wrote. Let students know they will have an opportunity to reflect on their desire to worship the Lord in the temple in Lesson 80: “ Assess Your Learning 5 ”. Testify of the truths you have discussed today.\n\n\n--- Lesson 53 ---\nWhile the practice of sacrificing animals may seem strange today, these sacrifices helped ancient Israel know and appreciate what the Savior had covenanted to do for them. Learning about these ancient sacrifices can likewise help us know and appreciate what the Savior did for us. This lesson can help students feel gratitude for Jesus Christ and His atoning sacrifice. Student preparation: Invite students to ponder advice they would give someone who is struggling to understand what Jesus Christ has done for them. You could also invite students to ask a family member or friend what advice they would give. Possible Learning Activities What has He done for me? To prepare students to talk about Jesus Christ, consider sharing the following experience. President Dallin H. Oaks of the First Presidency shared the following interaction he had with a member of the Church: 12:44 In a Saturday evening meeting at a stake conference many years ago, I met a woman who said her friends had asked her to come back to church after many years of inactivity, but she could not think of any reason why she should. To encourage her, I said, “When you consider all of the things the Savior has done for you, you have many reasons to come back to worship and serve Him.” I was astonished when she replied, “What’s He done for me?” (“ What Has Our Savior Done for Us? ,” Liahona , May 2021, 75) Ponder what you would say to the woman if she asked you this question. How might our lives be affected if we fail to recognize or remember what the Savior has done for us? To help students personalize today’s lesson, consider displaying the following questions. Give students time to record their answers in their study journals. What has the Savior done for you? How do you feel about Jesus Christ for what He has done for you? As you study Leviticus today, seek guidance from the Holy Ghost about how you can deepen your gratitude for what the Lord has done for you. Finding Christ in sacrifices To prepare students to study Leviticus, consider displaying the images from the beginning of the lesson. Invite the students to discuss what they know about the ancient ordinance of animal sacrifice. For example, you could ask them when God first commanded His children to perform animal sacrifices and why He gave that commandment. If needed, you could refer students to Moses 5:6–7 . Then ask the following question. What did these sacrifices represent? Help students understand that from the time of Adam and Eve, God commanded His people to perform animal sacrifice to help them look forward to the Savior and His atoning sacrifice. This practice ended with the death of Jesus Christ, who was the “great and last sacrifice” ( Alma 34:10 ). The book of Leviticus contains the Lord’s directions for animal and other types of sacrifices that He required of His people. Leviticus is like a handbook that provides instructions for ancient Israel’s ordinances, rituals, and sacred responsibilities. Give students an opportunity to study some of the sacrifices described in Leviticus. One way to do this is to distribute the handout titled “ Ancient Sacrifice: A Symbol of Jesus Christ .” You could distribute the two activities from the handout separately, or you could distribute it as one handout. Consider organizing students into pairs. You could assign each pair to complete one of the activities. The students could then teach what they learned to another pair that completed a different activity. Or you could invite one partner in each pair to complete Study Activity 1 and the other partner to complete Study Activity 2. After students individually complete their activities, they could teach one another. Open PDF After students have completed their study, invite them to share some of their responses to the handout questions. You could use the following question to help students summarize what they learned. How would you summarize in a simple statement what you learned today about the Savior and His atoning sacrifice? Students may share a variety of truths, such as: Jesus Christ willingly offered Himself as a sacrifice for us. We can be forgiven of our sins because of Jesus Christ. Through His atoning sacrifice, Jesus Christ paid for our sins by taking them upon Himself. To deepen students’ gratitude for these truths, consider using the following statement and questions. You may have used this statement in Lesson 27: “ Genesis 22 .” President Dallin H. Oaks of the First Presidency explained why Jesus Christ performed the Atonement: Jesus Christ did all of this because He loves all of the children of God. Love is the motivation for it all, and it was so from the very beginning. … I … pray that we all will remember what our Savior has done for each of us. (“ What Has Our Savior Done for Us? ,” Liahona , May 2021, 77) How does it help you to know that Jesus Christ allowed Himself to be sacrificed because of His love for you? What are some ways we can remember the Lord and His sacrifice? Help students understand that one way we remember the Savior’s sacrifice is by partaking of the sacrament weekly. To help students see the connection between ancient sacrifice and the sacrament, consider showing the video “ Always Remember Him ” (5:27), available at ChurchofJesusChrist.org . You could then ask the following questions. 5:27 How is the sacrament similar to the ancient sacrifices? How do you strive to remember the Savior in your daily life? What Jesus did for me Give students time to reflect on their feelings toward Jesus Christ. To prepare them to do this, you could invite the class to sing “ I Stand All Amazed ” ( Hymns , no. 193). Students could identify phrases from the hymn that reflect their feelings toward the Savior. Alternatively, you could invite students to choose a different hymn or a scripture about the Savior and His Atonement. They could share phrases that reflect their feelings toward Him. Then, invite students to respond to the following question in their journals. How do you feel about the Savior and what He has done for you? Willing students could express their thoughts and feelings about the Savior. Consider sharing your own feelings and testimony about Him.\n\n\n--- Lesson 54 ---\nAncient Israel performed rituals that symbolized Jesus Christ and His Atonement. Among these rituals was the sacrifice of burnt offerings. These offerings also demonstrated Israel’s continual commitment to sacrifice anything the Lord asked of them. This lesson can help students recognize sacrifices they can make to become more like Heavenly Father and Jesus Christ. Student preparation: Invite students to do something that they feel would be a good sacrifice for the Lord. Some examples might include paying tithing or fast offerings, sacrificing time to help someone in need, or sacrificing a few extra minutes of sleep to study the scriptures. Invite students to reflect on how this sacrifice affects their relationship with the Lord. Possible Learning Activities Willingness to sacrifice Consider beginning class by helping students see the value of being willing to make sacrifices for the Lord. You could do this by writing the following statement on the board. Invite students to discuss the accompanying questions. The key to making our day successful is … How would you finish this statement? Why do you feel your answer could help someone have a successful day? Elder Taylor G. Godoy of the Seventy shared the following about a successful day: The key to making our day successful is to be willing to sacrifice. (“ One More Day ,” Ensign or Liahona , May 2018, 34) Why do you think being willing to sacrifice can make our day successful? Consider writing students’ responses to the following question on the board. You could reference these answers at various points throughout the lesson. What are some sacrifices the Lord asks of us that you feel could lead to a successful day, week, or life? Consider inviting students to reflect on their willingness to make sacrifices for the Lord. One way you could do this is to show students a pie chart. Provide the following instructions. Create a pie chart in your study journal. Fill in a percentage (0 percent to 100 percent) that you feel reflects your willingness over the past week to sacrifice for the Lord. Then ponder the following questions: If you feel your percentage is high, why have you been willing to sacrifice for the Lord? If you feel your percentage is low, what may have kept you from being more willing to sacrifice? Consider offering a silent prayer. Ask Heavenly Father to help you understand what He would have you know and do regarding your personal sacrifices. During this lesson, pay attention to thoughts and feelings that might come to you through the Holy Ghost. Burnt offerings In Leviticus 1 , the Lord instructs the Israelites to make burnt offerings. Priests made these offerings daily. The offerings were symbolic of the Savior’s Atonement. These offerings were also a sign of Israel’s continual commitment to the Lord. Read Leviticus 1:3, 8–9 , looking for words and phrases that could relate to sacrifices we might make for the Lord today. What did you find? If students need help, you could point out some of the following: “He shall offer it of his own voluntary will” ( verse 3 ). “Head,” “fat,” “inwards,” and “legs” ( verses 8–9 ). These different parts of the animal could be symbolic of offering the Lord anything He asks of us, including our hearts, minds, and bodies. “Burn all on the altar” ( verse 9 ). Burning the whole animal on the altar represented total commitment to the Lord. “Sweet savour unto the Lord” ( verse 9 ). This can mean that our sacrifices are sweet and pleasing to Heavenly Father and the Savior. Jesus Christ is the perfect example of offering sacrifice. How can our willingness to sacrifice help us become more like the Savior? One lesson we can learn by understanding burnt offerings is that we can become more like our Savior as we are willing to sacrifice anything Heavenly Father asks of us . Living the law of sacrifice in our time After the atoning sacrifice of Jesus Christ was completed, He adjusted the type of sacrifice He asked His people to make (see 3 Nephi 9:19–20 ). Though we currently do not sacrifice animals, the Lord still asks His people to make sacrifices. These sacrifices include more than giving up our temporal possessions. Display the following instructions, scripture passages, and questions. You might invite students to complete this on their own. Study two or more of the following passages, looking for insights that can help you answer the questions below. Romans 12:1–2 Omni 1:26 3 Nephi 9:19–20 Doctrine and Covenants 4:2 How could you use these passages to help someone understand what the Lord wants us to sacrifice in our time? How could sacrificing in these ways help us become more like the Savior? Why do you think it can be difficult for some people to be willing to sacrifice what the Lord asks of them? Invite volunteers to share what they learned and how they would answer the two questions above. You might also discuss how these verses could apply to the sacrifices they listed on the board earlier in the lesson. This discussion could lead into the next question. Blessings of sacrifice Consider putting students into small groups. Invite them to use their answers to the previous question to create a scenario where someone might hesitate to sacrifice what the Lord asks of them. Following is one simple example. Invite students to discuss the accompanying question in their groups. To help with this discussion, students could study “ Sacrifice ” in the Guide to the Scriptures. Imagine you have a friend who feels they don’t have enough time to make some of the sacrifices the Lord asks of them. What could you share that might help resolve some of your friend’s concerns? Invite a few groups to share some of their insights. As they share, consider asking follow-up questions like “What would you want your friend to know about Heavenly Father and Jesus Christ that could help them be more willing to make sacrifices for Them?” or “What personal experiences could you share that have taught you the value of making sacrifices for the Lord?” To deepen understanding about sacrifice, you could display the following statement. Elder Ulisses Soares of the Quorum of the Twelve Apostles shared some of the blessings the Lord gives as we make sacrifices for Him: 14:48 Our determination to cast off all that is contrary to God’s will and to sacrifice all we are asked to give and to strive to follow His teachings will help us to endure in the path of Jesus Christ’s gospel—even in the face of tribulation, the weakness of our souls, or the social pressure and worldly philosophies that oppose His teachings. (“ Take Up Our Cross ,” Ensign or Liahona , Nov. 2019, 114) What have you learned about the Lord and His reasons for asking us to sacrifice? Personal sacrifice Invite students to reflect on impressions they have received. Consider displaying the following instructions. If helpful, students could refer to the list of sacrifices on the board as they complete this activity. Complete one of the following in your study journal: One sacrifice I am already making for Heavenly Father is … Something I learned today that will help me continue or improve on this sacrifice is … One thing I will start or stop doing to show my willingness to sacrifice for the Lord is … Something I learned today that will help me make this change is … You could invite students to share what they wrote along with their testimony of what they have learned or felt.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Leviticus 1",
      "content": "1. And theLordcalleduntoMoses, and spake unto him out of thetabernacle of the congregation, saying,\n2. Speak unto the children of Israel, and say unto them, If any man of you bring an offering unto theLord, ye shall bring your offering of the cattle,evenof the herd, and of the flock.\n3. If his offeringbeaburntsacrificeof the herd, let him offer malewithoutblemish: he shall offer it of his ownvoluntarywill at the door of the tabernacle of the congregation before theLord.\n4. And he shall put hishandupon the head of the burnt offering; and it shall beacceptedfor him to makeatonementfor him.\n5. And he shall kill thebullockbefore theLord: and the priests, Aarons sons, shall bring the blood, andsprinklethe blood round about upon the altar thatis bythe door of the tabernacle of the congregation.\n6. And he shall flay the burnt offering, and cut it into his pieces.\n7. And the sons ofAaronthe priest shall put fire upon the altar, and lay the wood inorderupon the fire:\n8. And the priests, Aarons sons, shall lay the parts, the head, and the fat, in order upon the wood thatison the fire whichisupon the altar:\n9. But his inwards and his legs shall he wash in water: and thepriestshall burn all on the altar,to bea burnt sacrifice, an offering made by fire, of asweet savourunto theLord.\n10. And if his offeringbeof the flocks,namely,of the sheep, or of the goats, for burnt sacrifice; he shall bring it malewithout blemish.\n11. And he shall kill it on the side of the altar northward before theLord: and the priests, Aarons sons, shall sprinkle his blood round about upon the altar.\n12. And he shall cut it into his pieces, with his head and his fat: and the priest shall lay them in order on the wood thatison the fire whichisupon the altar:\n13. But he shall wash the inwards and the legs with water: and the priest shall bringitall, and burnitupon the altar: itisaburntsacrifice, an offering made by fire, of sweet savour unto theLord.\n14. And if the burnt sacrifice for his offering to theLordbeof fowls, then he shall bring his offering ofturtledoves, or of young pigeons.\n15. And the priest shall bring it unto the altar, and wring off his head, and burniton the altar; and the blood thereof shall be wrung out at the side of the altar:\n16. And he shall pluck away his crop with his feathers, and cast it beside the altar on the east part, by the place of the ashes:\n17. And he shall cleave it with the wings thereof,butshall not divideitasunder: and the priest shall burn it upon the altar, upon the wood thatisupon the fire: itisa burnt sacrifice, an offering made by fire, of sweet savour unto theLord.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Leviticus": {
      "1": {
        "verses": {
          "1": {
            "text": "And theLordcalleduntoMoses, and spake unto him out of thetabernacle of the congregation, saying,",
            "citation": "(Leviticus 1:1)"
          },
          "2": {
            "text": "Speak unto the children of Israel, and say unto them, If any man of you bring an offering unto theLord, ye shall bring your offering of the cattle,evenof the herd, and of the flock.",
            "citation": "(Leviticus 1:2)"
          },
          "3": {
            "text": "If his offeringbeaburntsacrificeof the herd, let him offer malewithoutblemish: he shall offer it of his ownvoluntarywill at the door of the tabernacle of the congregation before theLord.",
            "citation": "(Leviticus 1:3)"
          },
          "4": {
            "text": "And he shall put hishandupon the head of the burnt offering; and it shall beacceptedfor him to makeatonementfor him.",
            "citation": "(Leviticus 1:4)"
          },
          "5": {
            "text": "And he shall kill thebullockbefore theLord: and the priests, Aarons sons, shall bring the blood, andsprinklethe blood round about upon the altar thatis bythe door of the tabernacle of the congregation.",
            "citation": "(Leviticus 1:5)"
          },
          "6": {
            "text": "And he shall flay the burnt offering, and cut it into his pieces.",
            "citation": "(Leviticus 1:6)"
          },
          "7": {
            "text": "And the sons ofAaronthe priest shall put fire upon the altar, and lay the wood inorderupon the fire:",
            "citation": "(Leviticus 1:7)"
          },
          "8": {
            "text": "And the priests, Aarons sons, shall lay the parts, the head, and the fat, in order upon the wood thatison the fire whichisupon the altar:",
            "citation": "(Leviticus 1:8)"
          },
          "9": {
            "text": "But his inwards and his legs shall he wash in water: and thepriestshall burn all on the altar,to bea burnt sacrifice, an offering made by fire, of asweet savourunto theLord.",
            "citation": "(Leviticus 1:9)"
          },
          "10": {
            "text": "And if his offeringbeof the flocks,namely,of the sheep, or of the goats, for burnt sacrifice; he shall bring it malewithout blemish.",
            "citation": "(Leviticus 1:10)"
          },
          "11": {
            "text": "And he shall kill it on the side of the altar northward before theLord: and the priests, Aarons sons, shall sprinkle his blood round about upon the altar.",
            "citation": "(Leviticus 1:11)"
          },
          "12": {
            "text": "And he shall cut it into his pieces, with his head and his fat: and the priest shall lay them in order on the wood thatison the fire whichisupon the altar:",
            "citation": "(Leviticus 1:12)"
          },
          "13": {
            "text": "But he shall wash the inwards and the legs with water: and the priest shall bringitall, and burnitupon the altar: itisaburntsacrifice, an offering made by fire, of sweet savour unto theLord.",
            "citation": "(Leviticus 1:13)"
          },
          "14": {
            "text": "And if the burnt sacrifice for his offering to theLordbeof fowls, then he shall bring his offering ofturtledoves, or of young pigeons.",
            "citation": "(Leviticus 1:14)"
          },
          "15": {
            "text": "And the priest shall bring it unto the altar, and wring off his head, and burniton the altar; and the blood thereof shall be wrung out at the side of the altar:",
            "citation": "(Leviticus 1:15)"
          },
          "16": {
            "text": "And he shall pluck away his crop with his feathers, and cast it beside the altar on the east part, by the place of the ashes:",
            "citation": "(Leviticus 1:16)"
          },
          "17": {
            "text": "And he shall cleave it with the wings thereof,butshall not divideitasunder: and the priest shall burn it upon the altar, upon the wood thatisupon the fire: itisa burnt sacrifice, an offering made by fire, of sweet savour unto theLord.",
            "citation": "(Leviticus 1:17)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 32077,
  "total_sources": 3,
  "generated_at": "2025-12-14T04:01:27.380052"
}