{
  "week_number": 51,
  "date_range": "",
  "title": "Malachi",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: Malachi ---\n“I have loved you,” the Lord told His people through the prophet Malachi. But the Israelites, who had suffered generations of affliction and captivity, asked, “Wherein hast thou loved us?” (\nMalachi 1:2\n). After all Israel had been through, they may have wondered whether their history is really a story of God’s love for His covenant people. In some ways, it’s easier to see it as a story of human weakness and rebellion. Yet through it all, God never stopped reaching out in love. When the sons of Jacob mistreated their brother Joseph, the Lord still saved them from famine (see\nGenesis 45:4–8\n). When Israel murmured in the wilderness, He fed them with manna (see\nExodus 16:1–4\n). Even when Israel turned to other gods and were scattered, God promised that if they repented, He would gather and redeem them “with great mercies” (see\nIsaiah 54:7\n). Truly, the Old Testament is a story of God’s patient, enduring love. And this story continues today. Jesus Christ, “the Sun of Righteousness,” as Malachi called Him, has come “with healing in his wings” (\nMalachi 4:2\n). He is the greatest evidence of God’s love for ancient Israel and for all of us.\nFor more information about the book of Malachi, see “\nMalachi\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nMalachi 1–4\n“Return unto me, and I will return unto you.”\nIn Malachi’s day, the Israelites had already rebuilt the temple in Jerusalem, but as a people they still needed to rebuild their relationship with the Lord. As you study Malachi, look for questions that the Lord asked the Israelites or that they asked Him. Consider asking yourself similar questions (some examples are suggested below) to help you evaluate your relationship with the Lord and draw closer to Him.\nHow have I felt the Lord’s love for me? (see\nMalachi 1:2\n).\nDo my offerings to the Lord truly honor Him? (see\nMalachi 1:6–11\n)\nIn what ways do I need to “return” to the Lord? (see\nMalachi 3:7\n).\nAm I robbing God in any way? (see\nMalachi 3:8–11\n).\nHow does my attitude during difficult times reflect my feelings toward the Lord? (see\nMalachi 3:13–15\n; see also\n2:17\n).\nMalachi 1:6–14\nThe Lord asks for “a pure offering.”\nAs you read about the offerings described in\nMalachi 1\n, what do you notice about the sacrifices the priests were offering? What do these sacrifices suggest about the priests’ feelings toward the Lord? (see\nMalachi 1:13\n). Consider making a list of offerings, or sacrifices, that you make to the Lord. For each item on the list, ponder what might make it a “polluted” offering or a “pure” offering (\nMalachi 1:7, 11\n).\nMalachi 3:8–12\nThe Lord opens the windows of heaven as I show my faith by paying tithing.\nImagine you have a friend who just found out that you pay tithing. “Why do you do that?” your friend asks. Think about this as you read\nMalachi 3:8–12\n. What do you find there that could help answer your friend’s question? What else would you want your friend to understand about tithing? For more help, you could search Elder Neil L. Andersen’s message “\nTithing: Opening the Windows of Heaven\n” (\nLiahona\n, Nov. 2023, 32–35), looking for answers to questions like these:\nWhy does the Lord want us to pay tithing?\nWhat might keep someone from paying tithing, and how can we overcome those obstacles?\nHow does paying tithing strengthen our faith in Heavenly Father and Jesus Christ?\nYou could also share with your friend how the Lord has blessed you when you pay tithing. You can find ideas in the section titled “\nLesson Number 1—Significant but Subtle Blessings\n” in Elder David A. Bednar’s message “\nThe Windows of Heaven\n” (\nEnsign\nor\nLiahona\n, Nov. 2013, 17–18). What kind of people do we become by paying tithing?\nWhat do you think the phrase “open you the windows of heaven” (\nverse 10\n) might mean? Maybe you could look out a window and think about the purposes of windows. Why is “windows of heaven” a good way to describe how the Lord blesses us when we pay tithing?\nVision in the Kirtland Temple\n, by Gary Smith\nMalachi 4:5–6\n“I will send you Elijah the prophet.”\nWhen Moroni quoted\nMalachi 4:5–6\nto Joseph Smith, he did so “with a little variation from the way it reads” in the Bible (see\nJoseph Smith—History 1:36–39\n). What does Moroni’s variation add to your understanding of this prophecy? In particular, ponder questions like these:\nWho are “the fathers”? (see\nDeuteronomy 29:13\n). What promises have been made to them? (see\nAbraham 2:9–11\n). How do you help fulfill these promises?\nWhat experiences have helped you turn your heart to your ancestors? Why is that so important to Heavenly Father’s plan?\nTo learn more about the coming of Elijah and how this prophecy is being fulfilled today, see\nDoctrine and Covenants 110:13–16\nand D. Todd Christofferson, “\nThe Sealing Power\n” (\nLiahona\n, Nov. 2023, 19–22). Why are you grateful that Elijah has come?\nSee also Gerrit W. Gong, “\nWe Each Have a Story\n,”\nLiahona\n, May 2022, 43–46; “\nTurn Your Hearts\n,”\nHymns\n, no. 291; “The Sealing Power” (video),\nChurchofJesusChrist.org\n.\n3:38\nThe Sealing Power\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nMalachi 1:2\nThe Lord loves me.\nHow would you and your children answer the question in\nMalachi 1:2\n—“Wherein hast [the Lord] loved us?” Share with each other reasons you know He loves you. Maybe your children could draw pictures that remind them of His love.\nEngage children in gospel discussions.\nIf you are teaching younger children, you may need to think of creative ways to involve them in gospel discussions. For example, your children could pass around a ball; when they are holding the ball, they could share one reason they know Jesus loves them.\nMalachi 3:8–12\nThe Lord will bless me as I pay tithing.\nHow will you help your children learn about tithing? You could ask them to count 10 small objects, such as the coins on this week’s activity page. Then they could separate one of the objects from the rest—this is how much we give to the Lord as tithing. According to\nMalachi 3:8–12\n, why does the Lord want us to pay tithing? (see also “\nMalachi the Prophet\n” in\nOld Testament Stories\n, 171–72; “First Things First!” [video], Gospel Library).\n0:58\nMalachi the Prophet\n1:18\nFirst Things First!\nAs you read\nMalachi 3:10\ntogether, you could invite your children to stand by a window when you read the phrase “windows of heaven.” Or you could pour water into a cup until it overflows to illustrate the phrase “there shall not be room enough to receive it.” Tell the children about the blessings God has given you as you pay tithing. Your children could draw pictures representing these blessings and hang them on or near a window in your home.\nMalachi 4:5–6\nElijah came to turn our hearts to our families.\nIn\nMalachi 4:5–6\n, your children could look for answers to the following questions about Malachi’s prophecy:\nWho\ndid the Lord promise to send?\nWhen\ndid He say this person would come?\nWhat\ndid the Lord say that this person would do?\nWhy\nwould this person need to come?\nWhere\nwas this prophecy fulfilled? (see\nDoctrine and Covenants 110:13–16\n).\nTo find out how the promise in\nMalachi 4:5\nwas fulfilled, you can also review “Joseph and Oliver Receive Priesthood Keys” in\nDoctrine and Covenants Stories\n, 26–30. A song like “\nThe Hearts of the Children\n” (\nChildren’s Songbook\n, 92) can help your children learn why it was so important that Elijah came. You could also visit\nFamilySearch.org/discovery\n, the\nFamilySearch Tree app\n, or the\nMy Family\nbooklet\nfor activities that can help you and your children turn your hearts to your ancestors.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 51: Lesson 158: Lesson 158—Malachi 3This lesson can help students want to obey the Lord’s law of tithing.; Lesson 159: Lesson 159—Malachi 4This lesson can help students turn their hearts to their ancestors and future posterity. ---\n\n--- Lesson 158 ---\nSince ancient times, Heavenly Father has blessed His children for their willingness to obey His law of tithing. The Lord’s words through the prophet Malachi help us learn how He will bless us because of our obedience to His law. This lesson can help students feel a desire to obey the Lord’s law of tithing. Student preparation: Invite students to prepare to share a story where someone was blessed by obeying the Lord’s commandment to pay tithing. If helpful, students could ask their parents or Church leaders or look for stories in Gospel Library. Possible Learning Activities Paying tithing To begin the lesson, you might want to share part of a story that illustrates circumstances when it might be difficult to pay tithing. You could share Elder Cordón’s experience or one of your own. If needed, explain that tithing is donating “one-tenth of our income to the Church” ( Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ [2023], 85 ; see also Doctrine and Covenants 119:3–4 ). Read the following experience from Elder Valeri V. Cordón of the Seventy, looking for why it might have been difficult for his parents to obey the Lord’s law of tithing. 12:28 After some events related to a civil war in Central America, my father’s business went bankrupt. He went from about 200 full-time employees to fewer than five sewing operators who worked as needed in the garage of our home. One day during those difficult times, I heard my parents discussing whether they should pay tithing or buy food for the children. (“ The Language of the Gospel ,” Ensign or Liahona , May 2017, 56) What are other circumstances we might face where paying tithing could be challenging? The following graphic could help students organize their thoughts throughout this lesson. Invite students to draw the graphic, or something similar, on a blank page in their study journals. You might also draw something similar on the board. Point to the “My Feelings” circle. Inform students that at the end of the lesson, they will have an opportunity to write how they feel about tithing. They might want to ponder now about any concerns or challenges they face to paying tithing. They could also ponder how they could benefit from identifying blessings the Lord has promised to people who pay tithing. As you study the Lord’s law of tithing, the Holy Ghost can help you understand the blessings available to you and strengthen your desire to follow this law. Pouring out blessings To help students understand the context of Malachi 3 , share in your own words the following summary of Malachi 1–2 . Although the people in Malachi’s day continued to offer sacrifices to the Lord, they dishonored Him by offering “polluted bread” and blind, lame, and sick animals (see Malachi 1:7–8, 13 ) as sacrifices that were supposed to symbolize Jesus Christ. The Lord rebuked the priests, who had “departed out of the [Lord’s] way” and “caused many to stumble” ( Malachi 2:8 ) because of their bad examples. In Malachi 3 , the Lord taught one way we can make a willing sacrifice to Him. Malachi 3:8–10 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Malachi 3:7–12 , looking for the Lord’s promised blessings for people who offer Him their tithing. Write the blessings you find around “The Lord’s Blessings” on your graphic. It might help for students to know that the phrase “prove me now herewith” could mean that the Lord is saying, “Test Me in this.” What truths do you learn about tithing from the Lord’s words in Malachi 3:7–12 ? Allow students to share truths they identified. Invite students to write a truth like As we obey the Lord’s law of tithing, He will generously bless us as a note in their scriptures next to these verses. To help students understand this truth, consider bringing a pan, a cup, and pitcher of water to class. Place the cup in the pan. Explain that the water represents the blessings the Lord will give us as we pay tithing. Invite a student to pour the water from the pitcher into the cup until the water overflows into the pan. Relate this to what the Lord promised in Malachi 3:10 . The Lord’s law of tithing The accompanying handout, “ The Lord’s Law of Tithing ,” can deepen students’ understanding of the blessings the Lord provides us as we obey His law. Consider organizing students into small groups and providing each group with a copy of the handout. Students can take turns reading the quotes out loud. After reading each quote, students could add more blessings to the graphics in their study journals. Open PDF After groups have added blessings to their graphics, students could ponder how they have seen the Lord bless them or others for obeying His law of tithing. Students could then share some blessings they or others have experienced by obeying this law. Consider watching “ The Language of the Gospel ,” available at ChurchofJesusChrist.org , from time code 6:42 to 7:40. In this video, students can hear the remainder of Elder Cordón’s experience from the beginning of class. 12:28 What can we learn about Heavenly Father as He blesses us for paying tithing? After discussing the blessings of paying tithing, you might want to point out that some people who pay tithing might not receive the blessings they hope for and might still struggle financially. They might wonder why they should continue to pay their tithing. You could read Malachi 3:14, 16–17 , looking for what the Lord promised people who continue faithfully in their obedience to Him. Obeying the Lord’s law of tithing Next to “My Feelings” on your graphic, write about: How you feel about obeying the Lord’s law of tithing. Anything you studied or felt today that increases your desire to pay tithing. This could include promised blessings from the Lord you want to receive. Invite a few willing students to share their feelings about the Lord and His law of tithing. You might also share blessings you have received by obeying this law. Memorize You might want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Malachi 3:8–10 is “The blessings of paying tithing.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 159 ---\nIn sacred temples, the Savior unites families for eternity through sealing keys. Malachi prophesied that the Savior would restore these keys to “turn the heart of the fathers to the children, and the heart of the children to their fathers” ( Malachi 4:6 ). This lesson can help students turn their hearts to their parents, ancestors, and future posterity. Student preparation: Invite students to spend a few minutes exploring FamilySearch.org or the FamilySearch Tree app. For example, they could click on relatives in their family tree to learn more about them. Or they could complete some of the family history activities found on the website or in the “More” menu on the app. If students don’t have access to these resources, they could talk to a parent or family member to learn something new about an ancestor. Possible Learning Activities Roots and branches Consider inviting students to draw a tree with roots and branches in their study journals. You could also draw one on the board. Why are both roots and branches essential for the health of a tree? Invite students to write their name on the trunk of the tree they have drawn. If the trunk of a tree represents you, whom could the roots and branches represent? If needed, explain that in the scriptures, the Lord often uses the metaphor of a tree with roots and branches to teach about family. You could also watch “ By the Hand of Elijah the Prophet ” (3:32) from time code 0:00 to 0:35, available at ChurchofJesusChrist.org . 3:32 Invite students to label the roots ancestors and the branches posterity . Provide the following instructions: Next to the roots in your drawing, write a brief description of how you feel about your ancestors (parents, grandparents, and so on). Next to the branches in your drawing, write what you hope for your potential posterity or what you envision as you think about them (children, grandchildren, and so on). As you study Malachi 4 , consider what the Savior has done to strengthen and preserve the roots and branches of your family tree. You might offer a silent prayer, asking Heavenly Father to help you understand what you can do to strengthen your eternal family. Because students come from various home situations, it is important to talk about the doctrine of eternal families with sensitivity and understanding. Remind students that the Savior is fully aware of their circumstances and can provide needed hope and healing for their past, present, and future families through His Atonement. Malachi’s prophecies Read Malachi 4:1 , looking for what the Lord taught about roots and branches in this prophecy of His Second Coming. Based on what you have learned about roots and branches, what do you think the Savior is teaching? Elder D. Todd Christofferson of the Quorum of the Twelve Apostles explained the following: Without the sealings that create eternal families and link generations here and hereafter, we would be left in eternity with neither roots nor branches—that is, neither ancestry nor posterity. (“ The Sealing Power ,” Liahona , Nov. 2023, 21) Ponder how you would feel if you could not be sealed, or united forever, with a family that you love. Malachi 4:5–6 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Malachi 4:5–6 , looking for what the Savior promised to do so that families could be sealed together. Footnotes might help as you read. What do you understand about this prophecy? What questions do you have? If students need help understanding this prophecy, consider inviting them to link or cross-reference Malachi 4:5–6 to Doctrine and Covenants 110:13–16 ; 138:47–48 . Students could read these passages, looking for additional insights about Malachi’s prophecy. Help students identify that the Savior sent Elijah to restore the sealing keys and turn families’ hearts to each other . This promise was fulfilled on April 3, 1836, when Elijah appeared to Joseph Smith and Oliver Cowdery in the Kirtland Temple. The sealing keys he restored make sacred ordinances valid on earth and in heaven. This includes ordinances performed in holy temples. Consider displaying a picture of a temple and the following statement. Read the following statement from Elder Christofferson, looking for how the Savior blesses us with His sealing power in holy temples: [In the Lord’s temple] we see the majesty and sacredness of the sealing power—it makes individual salvation and family exaltation universally available to the children of God wherever and whenever they may have lived on the earth. No other theology or philosophy or authority can match such an all-inclusive opportunity. This sealing power is a perfect manifestation of the justice, mercy, and love of God. … The highest and holiest manifestation of the sealing power is in the eternal union of a man and a woman in marriage and the linking of humankind through all their generations. (“ The Sealing Power ,” Liahona , Nov. 2023, 20, 21) What impresses you from this statement? How has temple work helped you feel a connection with or turned your heart to past, present, or future family members? Turning our hearts The following activities can help students strengthen their relationships with their ancestors and make decisions that will bless their posterity. Depending on time available, you could invite students to complete one or both of these activities. Consider adjusting the instructions to meet the needs of your students. For example, you could remove or modify instructions that require the use of technology if it is unavailable to your students. Activity A: Turn your heart to your ancestors. Complete one or more of the following tasks. As you study, reflect on how the Savior and His sealing power strengthen your ancestors and your relationship with them. Record what you learn next to the “roots” of the drawing in your study journal. Write a positive memory you have about a parent or grandparent or read about an ancestor in the “Memories” section on FamilySearch.org or the FamilySearch Tree app. Think about why the Savior might want you to connect with this ancestor. Study Doctrine and Covenants 128:16–18 , looking for why doing baptisms for the dead and other temple work for your ancestors is an important part of God’s plan. Search for “family history” under Topics in the General Conference section of Gospel Library. Choose one of the talks, and study some or all of it. Search your family tree for ancestors who need the baptism ordinance. If possible, go to temples.ChurchofJesusChrist.org and make an appointment to complete the baptisms. Activity B: Turn your hearts to your posterity. Complete one or more of the following tasks. As you study, reflect on how the Savior and His sealing power help you strengthen your posterity. Record what you learn next to the “branches” of the drawing in your study journal. Review the questions asked in a temple recommend interview and reflect on how your answers can bless your family now and your future family. These questions can be found in the appendix of For the Strength of Youth: A Guide for Making Choices . Search the Young Women Theme or Aaronic Priesthood Quorum Theme , looking for phrases that can prepare you to bless your future spouse and children. Study Doctrine and Covenants 49:15–17 ; 68:25–28 , looking for what the Lord teaches about marriage and raising children. Think about how the choices you make now can influence your future marriage and how you will raise your children. Write a letter to your future spouse or children explaining what you are doing now to be worthy of the temple and to prepare for an eternal family. When they have finished, consider inviting willing students to share what they learned or felt from this activity. This could include things they wrote next to the roots or branches in their study journals. Students could also share their feelings about the Savior and His role in helping us receive the blessings of an eternal family. Memorize You might want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Malachi 4:5–6 is “Elijah ‘shall turn … the heart of the children to their fathers.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Malachi",
      "content": "“I have loved you,” the Lord told His people through the prophet Malachi. But the Israelites, who had suffered generations of affliction and captivity, asked, “Wherein hast thou loved us?” (\nMalachi 1:2\n). After all Israel had been through, they may have wondered whether their history is really a story of God’s love for His covenant people. In some ways, it’s easier to see it as a story of human weakness and rebellion. Yet through it all, God never stopped reaching out in love. When the sons of Jacob mistreated their brother Joseph, the Lord still saved them from famine (see\nGenesis 45:4–8\n). When Israel murmured in the wilderness, He fed them with manna (see\nExodus 16:1–4\n). Even when Israel turned to other gods and were scattered, God promised that if they repented, He would gather and redeem them “with great mercies” (see\nIsaiah 54:7\n). Truly, the Old Testament is a story of God’s patient, enduring love. And this story continues today. Jesus Christ, “the Sun of Righteousness,” as Malachi called Him, has come “with healing in his wings” (\nMalachi 4:2\n). He is the greatest evidence of God’s love for ancient Israel and for all of us.\nFor more information about the book of Malachi, see “\nMalachi\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nMalachi 1–4\n“Return unto me, and I will return unto you.”\nIn Malachi’s day, the Israelites had already rebuilt the temple in Jerusalem, but as a people they still needed to rebuild their relationship with the Lord. As you study Malachi, look for questions that the Lord asked the Israelites or that they asked Him. Consider asking yourself similar questions (some examples are suggested below) to help you evaluate your relationship with the Lord and draw closer to Him.\nHow have I felt the Lord’s love for me? (see\nMalachi 1:2\n).\nDo my offerings to the Lord truly honor Him? (see\nMalachi 1:6–11\n)\nIn what ways do I need to “return” to the Lord? (see\nMalachi 3:7\n).\nAm I robbing God in any way? (see\nMalachi 3:8–11\n).\nHow does my attitude during difficult times reflect my feelings toward the Lord? (see\nMalachi 3:13–15\n; see also\n2:17\n).\nMalachi 1:6–14\nThe Lord asks for “a pure offering.”\nAs you read about the offerings described in\nMalachi 1\n, what do you notice about the sacrifices the priests were offering? What do these sacrifices suggest about the priests’ feelings toward the Lord? (see\nMalachi 1:13\n). Consider making a list of offerings, or sacrifices, that you make to the Lord. For each item on the list, ponder what might make it a “polluted” offering or a “pure” offering (\nMalachi 1:7, 11\n).\nMalachi 3:8–12\nThe Lord opens the windows of heaven as I show my faith by paying tithing.\nImagine you have a friend who just found out that you pay tithing. “Why do you do that?” your friend asks. Think about this as you read\nMalachi 3:8–12\n. What do you find there that could help answer your friend’s question? What else would you want your friend to understand about tithing? For more help, you could search Elder Neil L. Andersen’s message “\nTithing: Opening the Windows of Heaven\n” (\nLiahona\n, Nov. 2023, 32–35), looking for answers to questions like these:\nWhy does the Lord want us to pay tithing?\nWhat might keep someone from paying tithing, and how can we overcome those obstacles?\nHow does paying tithing strengthen our faith in Heavenly Father and Jesus Christ?\nYou could also share with your friend how the Lord has blessed you when you pay tithing. You can find ideas in the section titled “\nLesson Number 1—Significant but Subtle Blessings\n” in Elder David A. Bednar’s message “\nThe Windows of Heaven\n” (\nEnsign\nor\nLiahona\n, Nov. 2013, 17–18). What kind of people do we become by paying tithing?\nWhat do you think the phrase “open you the windows of heaven” (\nverse 10\n) might mean? Maybe you could look out a window and think about the purposes of windows. Why is “windows of heaven” a good way to describe how the Lord blesses us when we pay tithing?\nVision in the Kirtland Temple\n, by Gary Smith\nMalachi 4:5–6\n“I will send you Elijah the prophet.”\nWhen Moroni quoted\nMalachi 4:5–6\nto Joseph Smith, he did so “with a little variation from the way it reads” in the Bible (see\nJoseph Smith—History 1:36–39\n). What does Moroni’s variation add to your understanding of this prophecy? In particular, ponder questions like these:\nWho are “the fathers”? (see\nDeuteronomy 29:13\n). What promises have been made to them? (see\nAbraham 2:9–11\n). How do you help fulfill these promises?\nWhat experiences have helped you turn your heart to your ancestors? Why is that so important to Heavenly Father’s plan?\nTo learn more about the coming of Elijah and how this prophecy is being fulfilled today, see\nDoctrine and Covenants 110:13–16\nand D. Todd Christofferson, “\nThe Sealing Power\n” (\nLiahona\n, Nov. 2023, 19–22). Why are you grateful that Elijah has come?\nSee also Gerrit W. Gong, “\nWe Each Have a Story\n,”\nLiahona\n, May 2022, 43–46; “\nTurn Your Hearts\n,”\nHymns\n, no. 291; “The Sealing Power” (video),\nChurchofJesusChrist.org\n.\n3:38\nThe Sealing Power\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nMalachi 1:2\nThe Lord loves me.\nHow would you and your children answer the question in\nMalachi 1:2\n—“Wherein hast [the Lord] loved us?” Share with each other reasons you know He loves you. Maybe your children could draw pictures that remind them of His love.\nEngage children in gospel discussions.\nIf you are teaching younger children, you may need to think of creative ways to involve them in gospel discussions. For example, your children could pass around a ball; when they are holding the ball, they could share one reason they know Jesus loves them.\nMalachi 3:8–12\nThe Lord will bless me as I pay tithing.\nHow will you help your children learn about tithing? You could ask them to count 10 small objects, such as the coins on this week’s activity page. Then they could separate one of the objects from the rest—this is how much we give to the Lord as tithing. According to\nMalachi 3:8–12\n, why does the Lord want us to pay tithing? (see also “\nMalachi the Prophet\n” in\nOld Testament Stories\n, 171–72; “First Things First!” [video], Gospel Library).\n0:58\nMalachi the Prophet\n1:18\nFirst Things First!\nAs you read\nMalachi 3:10\ntogether, you could invite your children to stand by a window when you read the phrase “windows of heaven.” Or you could pour water into a cup until it overflows to illustrate the phrase “there shall not be room enough to receive it.” Tell the children about the blessings God has given you as you pay tithing. Your children could draw pictures representing these blessings and hang them on or near a window in your home.\nMalachi 4:5–6\nElijah came to turn our hearts to our families.\nIn\nMalachi 4:5–6\n, your children could look for answers to the following questions about Malachi’s prophecy:\nWho\ndid the Lord promise to send?\nWhen\ndid He say this person would come?\nWhat\ndid the Lord say that this person would do?\nWhy\nwould this person need to come?\nWhere\nwas this prophecy fulfilled? (see\nDoctrine and Covenants 110:13–16\n).\nTo find out how the promise in\nMalachi 4:5\nwas fulfilled, you can also review “Joseph and Oliver Receive Priesthood Keys” in\nDoctrine and Covenants Stories\n, 26–30. A song like “\nThe Hearts of the Children\n” (\nChildren’s Songbook\n, 92) can help your children learn why it was so important that Elijah came. You could also visit\nFamilySearch.org/discovery\n, the\nFamilySearch Tree app\n, or the\nMy Family\nbooklet\nfor activities that can help you and your children turn your hearts to your ancestors.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 51: Lesson 158: Lesson 158—Malachi 3This lesson can help students want to obey the Lord’s law of tithing.; Lesson 159: Lesson 159—Malachi 4This lesson can help students turn their hearts to their ancestors and future posterity.",
      "content": "\n--- Lesson 158 ---\nSince ancient times, Heavenly Father has blessed His children for their willingness to obey His law of tithing. The Lord’s words through the prophet Malachi help us learn how He will bless us because of our obedience to His law. This lesson can help students feel a desire to obey the Lord’s law of tithing. Student preparation: Invite students to prepare to share a story where someone was blessed by obeying the Lord’s commandment to pay tithing. If helpful, students could ask their parents or Church leaders or look for stories in Gospel Library. Possible Learning Activities Paying tithing To begin the lesson, you might want to share part of a story that illustrates circumstances when it might be difficult to pay tithing. You could share Elder Cordón’s experience or one of your own. If needed, explain that tithing is donating “one-tenth of our income to the Church” ( Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ [2023], 85 ; see also Doctrine and Covenants 119:3–4 ). Read the following experience from Elder Valeri V. Cordón of the Seventy, looking for why it might have been difficult for his parents to obey the Lord’s law of tithing. 12:28 After some events related to a civil war in Central America, my father’s business went bankrupt. He went from about 200 full-time employees to fewer than five sewing operators who worked as needed in the garage of our home. One day during those difficult times, I heard my parents discussing whether they should pay tithing or buy food for the children. (“ The Language of the Gospel ,” Ensign or Liahona , May 2017, 56) What are other circumstances we might face where paying tithing could be challenging? The following graphic could help students organize their thoughts throughout this lesson. Invite students to draw the graphic, or something similar, on a blank page in their study journals. You might also draw something similar on the board. Point to the “My Feelings” circle. Inform students that at the end of the lesson, they will have an opportunity to write how they feel about tithing. They might want to ponder now about any concerns or challenges they face to paying tithing. They could also ponder how they could benefit from identifying blessings the Lord has promised to people who pay tithing. As you study the Lord’s law of tithing, the Holy Ghost can help you understand the blessings available to you and strengthen your desire to follow this law. Pouring out blessings To help students understand the context of Malachi 3 , share in your own words the following summary of Malachi 1–2 . Although the people in Malachi’s day continued to offer sacrifices to the Lord, they dishonored Him by offering “polluted bread” and blind, lame, and sick animals (see Malachi 1:7–8, 13 ) as sacrifices that were supposed to symbolize Jesus Christ. The Lord rebuked the priests, who had “departed out of the [Lord’s] way” and “caused many to stumble” ( Malachi 2:8 ) because of their bad examples. In Malachi 3 , the Lord taught one way we can make a willing sacrifice to Him. Malachi 3:8–10 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Malachi 3:7–12 , looking for the Lord’s promised blessings for people who offer Him their tithing. Write the blessings you find around “The Lord’s Blessings” on your graphic. It might help for students to know that the phrase “prove me now herewith” could mean that the Lord is saying, “Test Me in this.” What truths do you learn about tithing from the Lord’s words in Malachi 3:7–12 ? Allow students to share truths they identified. Invite students to write a truth like As we obey the Lord’s law of tithing, He will generously bless us as a note in their scriptures next to these verses. To help students understand this truth, consider bringing a pan, a cup, and pitcher of water to class. Place the cup in the pan. Explain that the water represents the blessings the Lord will give us as we pay tithing. Invite a student to pour the water from the pitcher into the cup until the water overflows into the pan. Relate this to what the Lord promised in Malachi 3:10 . The Lord’s law of tithing The accompanying handout, “ The Lord’s Law of Tithing ,” can deepen students’ understanding of the blessings the Lord provides us as we obey His law. Consider organizing students into small groups and providing each group with a copy of the handout. Students can take turns reading the quotes out loud. After reading each quote, students could add more blessings to the graphics in their study journals. Open PDF After groups have added blessings to their graphics, students could ponder how they have seen the Lord bless them or others for obeying His law of tithing. Students could then share some blessings they or others have experienced by obeying this law. Consider watching “ The Language of the Gospel ,” available at ChurchofJesusChrist.org , from time code 6:42 to 7:40. In this video, students can hear the remainder of Elder Cordón’s experience from the beginning of class. 12:28 What can we learn about Heavenly Father as He blesses us for paying tithing? After discussing the blessings of paying tithing, you might want to point out that some people who pay tithing might not receive the blessings they hope for and might still struggle financially. They might wonder why they should continue to pay their tithing. You could read Malachi 3:14, 16–17 , looking for what the Lord promised people who continue faithfully in their obedience to Him. Obeying the Lord’s law of tithing Next to “My Feelings” on your graphic, write about: How you feel about obeying the Lord’s law of tithing. Anything you studied or felt today that increases your desire to pay tithing. This could include promised blessings from the Lord you want to receive. Invite a few willing students to share their feelings about the Lord and His law of tithing. You might also share blessings you have received by obeying this law. Memorize You might want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Malachi 3:8–10 is “The blessings of paying tithing.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 159 ---\nIn sacred temples, the Savior unites families for eternity through sealing keys. Malachi prophesied that the Savior would restore these keys to “turn the heart of the fathers to the children, and the heart of the children to their fathers” ( Malachi 4:6 ). This lesson can help students turn their hearts to their parents, ancestors, and future posterity. Student preparation: Invite students to spend a few minutes exploring FamilySearch.org or the FamilySearch Tree app. For example, they could click on relatives in their family tree to learn more about them. Or they could complete some of the family history activities found on the website or in the “More” menu on the app. If students don’t have access to these resources, they could talk to a parent or family member to learn something new about an ancestor. Possible Learning Activities Roots and branches Consider inviting students to draw a tree with roots and branches in their study journals. You could also draw one on the board. Why are both roots and branches essential for the health of a tree? Invite students to write their name on the trunk of the tree they have drawn. If the trunk of a tree represents you, whom could the roots and branches represent? If needed, explain that in the scriptures, the Lord often uses the metaphor of a tree with roots and branches to teach about family. You could also watch “ By the Hand of Elijah the Prophet ” (3:32) from time code 0:00 to 0:35, available at ChurchofJesusChrist.org . 3:32 Invite students to label the roots ancestors and the branches posterity . Provide the following instructions: Next to the roots in your drawing, write a brief description of how you feel about your ancestors (parents, grandparents, and so on). Next to the branches in your drawing, write what you hope for your potential posterity or what you envision as you think about them (children, grandchildren, and so on). As you study Malachi 4 , consider what the Savior has done to strengthen and preserve the roots and branches of your family tree. You might offer a silent prayer, asking Heavenly Father to help you understand what you can do to strengthen your eternal family. Because students come from various home situations, it is important to talk about the doctrine of eternal families with sensitivity and understanding. Remind students that the Savior is fully aware of their circumstances and can provide needed hope and healing for their past, present, and future families through His Atonement. Malachi’s prophecies Read Malachi 4:1 , looking for what the Lord taught about roots and branches in this prophecy of His Second Coming. Based on what you have learned about roots and branches, what do you think the Savior is teaching? Elder D. Todd Christofferson of the Quorum of the Twelve Apostles explained the following: Without the sealings that create eternal families and link generations here and hereafter, we would be left in eternity with neither roots nor branches—that is, neither ancestry nor posterity. (“ The Sealing Power ,” Liahona , Nov. 2023, 21) Ponder how you would feel if you could not be sealed, or united forever, with a family that you love. Malachi 4:5–6 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Malachi 4:5–6 , looking for what the Savior promised to do so that families could be sealed together. Footnotes might help as you read. What do you understand about this prophecy? What questions do you have? If students need help understanding this prophecy, consider inviting them to link or cross-reference Malachi 4:5–6 to Doctrine and Covenants 110:13–16 ; 138:47–48 . Students could read these passages, looking for additional insights about Malachi’s prophecy. Help students identify that the Savior sent Elijah to restore the sealing keys and turn families’ hearts to each other . This promise was fulfilled on April 3, 1836, when Elijah appeared to Joseph Smith and Oliver Cowdery in the Kirtland Temple. The sealing keys he restored make sacred ordinances valid on earth and in heaven. This includes ordinances performed in holy temples. Consider displaying a picture of a temple and the following statement. Read the following statement from Elder Christofferson, looking for how the Savior blesses us with His sealing power in holy temples: [In the Lord’s temple] we see the majesty and sacredness of the sealing power—it makes individual salvation and family exaltation universally available to the children of God wherever and whenever they may have lived on the earth. No other theology or philosophy or authority can match such an all-inclusive opportunity. This sealing power is a perfect manifestation of the justice, mercy, and love of God. … The highest and holiest manifestation of the sealing power is in the eternal union of a man and a woman in marriage and the linking of humankind through all their generations. (“ The Sealing Power ,” Liahona , Nov. 2023, 20, 21) What impresses you from this statement? How has temple work helped you feel a connection with or turned your heart to past, present, or future family members? Turning our hearts The following activities can help students strengthen their relationships with their ancestors and make decisions that will bless their posterity. Depending on time available, you could invite students to complete one or both of these activities. Consider adjusting the instructions to meet the needs of your students. For example, you could remove or modify instructions that require the use of technology if it is unavailable to your students. Activity A: Turn your heart to your ancestors. Complete one or more of the following tasks. As you study, reflect on how the Savior and His sealing power strengthen your ancestors and your relationship with them. Record what you learn next to the “roots” of the drawing in your study journal. Write a positive memory you have about a parent or grandparent or read about an ancestor in the “Memories” section on FamilySearch.org or the FamilySearch Tree app. Think about why the Savior might want you to connect with this ancestor. Study Doctrine and Covenants 128:16–18 , looking for why doing baptisms for the dead and other temple work for your ancestors is an important part of God’s plan. Search for “family history” under Topics in the General Conference section of Gospel Library. Choose one of the talks, and study some or all of it. Search your family tree for ancestors who need the baptism ordinance. If possible, go to temples.ChurchofJesusChrist.org and make an appointment to complete the baptisms. Activity B: Turn your hearts to your posterity. Complete one or more of the following tasks. As you study, reflect on how the Savior and His sealing power help you strengthen your posterity. Record what you learn next to the “branches” of the drawing in your study journal. Review the questions asked in a temple recommend interview and reflect on how your answers can bless your family now and your future family. These questions can be found in the appendix of For the Strength of Youth: A Guide for Making Choices . Search the Young Women Theme or Aaronic Priesthood Quorum Theme , looking for phrases that can prepare you to bless your future spouse and children. Study Doctrine and Covenants 49:15–17 ; 68:25–28 , looking for what the Lord teaches about marriage and raising children. Think about how the choices you make now can influence your future marriage and how you will raise your children. Write a letter to your future spouse or children explaining what you are doing now to be worthy of the temple and to prepare for an eternal family. When they have finished, consider inviting willing students to share what they learned or felt from this activity. This could include things they wrote next to the roots or branches in their study journals. Students could also share their feelings about the Savior and His role in helping us receive the blessings of an eternal family. Memorize You might want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Malachi 4:5–6 is “Elijah ‘shall turn … the heart of the children to their fathers.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 22841,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.404221"
}