{
  "week_number": 47,
  "date_range": "Hosea 1–6",
  "title": ";10–14;Joel",
  "primary_scriptures": [
    {
      "book": "Hosea",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Hosea",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;10–14;Joel ---\nIsrael’s covenant with the Lord was meant to be so deep and meaningful that the Lord compared it to a marriage. The covenant, like a marriage, included eternal commitment, shared experiences, building a life together, exclusive loyalty, and, most of all, wholehearted love. Sadly, the Israelites were not faithful to their covenant. And yet the Lord’s message to them was not “I will reject you forever.” Instead it was “I will invite you back” (see\nHosea 2:14–15\n). “I will betroth thee unto me in righteousness,” He declared through the prophet Hosea (\nHosea 2:19\n). “I will heal their backsliding, I will love them freely” (\nHosea 14:4\n). This is the same message He gives us today as we seek to live our covenants with love and devotion.\nJoel shared a similar message: “Turn unto the Lord your God: for he is gracious and merciful, slow to anger, and of great kindness” (\nJoel 2:13\n). Reading these prophets’ words may prompt you to ponder your own relationship with the Lord—to think about how His faithfulness to you inspires you to be faithful to Him.\nFor an overview of the books of Hosea and Joel, see “\nHosea, or Hoshea\n” and “\nJoel\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nHosea 1–3\n;\n14\nThe Lord always invites me to return to Him.\nHosea’s wife, Gomer, was unfaithful to him, and God pointed to this sad event to teach the Israelites how He felt about them and their covenants with Him. As you read\nHosea 1–3\n, ponder how the Lord views His relationship with His covenant people. How is making a covenant with the Lord like entering into a marriage? How is failing to keep that covenant like being unfaithful to a spouse? (see\nHosea 2:5–7, 13\n). What does\nHosea 2:14–23\nteach you about the Lord’s love and mercy? How do you show Him your love and loyalty?\nIn\nHosea 14\n, look for the many beautiful promises the Lord makes to those who return to Him. What does the phrase “love them freely” mean to you? (\nverse 4\n). What do the plant metaphors in\nverses 5–8\nteach you about the Lord’s blessings, including the blessings of repentance? As part of your study, consider singing or listening to a hymn about the Savior’s mercy, such as “\nCome unto Jesus\n” (\nHymns\n, no. 117).\nGomer, who represents the house of Israel and their broken covenants, was offered redemption by the Lord. Illustration by Deb Minnard, licensed from\ngoodsalt.com\nHosea 6:4–7\n;\nJoel 2:12–13\nDevotion to God must be felt inwardly, not just expressed outwardly.\nThe people in Hosea’s day were offering animal sacrifices, but they were breaking more important commandments. What do you think it means that the Lord “desired mercy, and not sacrifice; and the knowledge of God more than burnt offerings”? (\nHosea 6:6\n). What do you think it means for righteousness to be like a cloud or like dew? (see\nHosea 6:4\n). What should our righteousness be like? (see\nIsaiah 48:18\n;\n1 Nephi 2:9–10\n).\nYou could also read\nMatthew 9:10–13\n;\n12:1–8\nto see how the Savior used\nHosea 6:6\nduring His ministry. How do these passages help you understand Hosea’s words?\nWhen reading\nJoel 2:12–13\n, it might help to know that rending or tearing one’s clothing was an outward sign of mourning or remorse. How is rending our hearts different from rending our garments?\nJoel 2\n“I will pour out my spirit upon all flesh.”\nWhat similarities do you see between our day and the day Joel foresaw? (see especially\nJoel 2:1–2, 11, 18–32\n). What impresses you about the blessings the Lord promised in\nverses 18–32\n? Why might these blessings be especially valuable today?\nIt might be interesting to read what Moroni said about\nJoel 2\nwhen he visited Joseph Smith in 1823 (see\nJoseph Smith—History 1:41\n). How do you feel the prophecies in\nJoel 2:28–32\nare being fulfilled in our day? (see also\nActs 2:1–21\n). What do you think it means that the Lord would “pour out [His] spirit upon all flesh”? (\nJoel 2:28\n).\nYou might ponder these words from President Russell M. Nelson: “In coming days, it will not be possible to survive spiritually without the guiding, directing, comforting, and constant influence of the Holy Ghost” (“\nRevelation for the Church, Revelation for Our Lives\n,”\nEnsign\nor\nLiahona\n, May 2018, 96). Why is revelation essential to your spiritual survival?\nWhat can you do if you feel like you aren’t receiving that outpouring? Here are some examples that might help. What did the people in these scriptures do to receive an outpouring of the Lord’s Spirit?\nMosiah 4:1–3, 19–20\n;\n18:7–11\nHelaman 6:34–36\nDoctrine and Covenants 19:37–41\nAs you read these words from Elder David A. Bednar, ponder what it means to you to feel an outpouring of the Holy Ghost in your daily life:\n“We often make it hard on ourselves to receive personal revelation. By that I mean the covenant promise is that as we honor our covenants, we may always have the Holy Ghost to be our constant companion. But we talk about it and we treat it as if hearing the voice of the Lord through His Spirit is the rare event. … [The Spirit] ought to be with us all of the time. Not every nanosecond, but if a person is doing his or her best—you don’t have to be perfect—but if you and I are doing our best and we’re not committing serious transgression, then we can count on the Holy Ghost guiding us. …\n“… We seem to believe that the Holy Ghost is dramatic and big and sudden, when it’s still and small and incremental over time” (“\nElder David A. Bednar Discussion\n” [evening with a General Authority, Feb. 7, 2020], broadcasts.ChurchofJesusChrist.org).\nSee also Gary E. Stevenson, “\nPromptings of the Spirit\n,”\nLiahona\n, Nov. 2023, 42–45; “Enemy Territory” (video), Gospel Library.\n3:38\nEnemy Territory\nCreate a spiritual environment.\n“What have you observed that contributes to a spiritual environment for learning the gospel? What detracts from it? … Think about the setting where you most often teach [or learn]. How do you feel when you are there? How can you more effectively invite the Spirit to be present there?” (\nTeaching in the Savior’s Way\n,\n7\n).\nIdeas for Teaching Children\nHosea 2:19–20\nI can faithfully keep my covenants.\nIn the book of Hosea, the Lord compared His covenants with His people to a marriage. To learn from this comparison, you and your children could look at a picture of a bride and groom and talk about how Heavenly Father wants a husband and wife to treat each other. Help your children find words in\nHosea 2:19–20\nthat describe how the Lord feels about us. How can we show the Lord that we love Him and will be faithful to Him?\nHosea 10:12\n“It is time to seek the Lord.”\nHosea 10:12\nrefers to sowing, reaping, time, and rain to invite us to seek the Lord. As you read this verse, what creative ideas come to mind that could inspire the children to seek Him? For example, maybe your children could draw a clock and write down ways they can seek the Lord at different times throughout the day. A song like “Anytime, Anywhere” (Gospel Library) could help you teach that it is always a good time to seek the Lord.\nOr your children could do simple actions that go with the verse, such as pretending to plant seeds, pick vegetables, or stand in the rain. Help your children compare planting a seed and reaping good food to living righteously and receiving the Lord’s blessings. Then you could tell each other about the blessings the Lord has rained upon you as you have tried to seek Him.\nHosea 13:4, 14\nJesus Christ is my Savior and Redeemer.\nTo emphasize the truth in\nHosea 13:4\nthat there is no Savior except Jesus Christ, you could show your children pictures of several people, including Jesus. Your children could take turns pointing to the person who has the power to save us from sin and death. Share your testimony of Jesus Christ and His Atonement.\nYour children could look for words in\nHosea 13:4, 14\nthat describe Jesus Christ. What do these words teach us about Him? Consider helping your children use the\nGuide to the Scriptures\nto find other scriptures that teach that Jesus is our Savior and Redeemer. Share with each other how you feel about Jesus Christ.\nJoel 2:28–29\nThe Holy Ghost can guide me.\nMaybe you could help your children understand\nJoel 2:28–29\nby letting them pour a liquid and then contrasting it with a drip or a trickle. What could it mean for the Spirit to be “poured out” upon us?\nAs you read\nJoel 2:28–29\ntogether, you might invite your children to insert each other’s names in place of the phrases “your sons” and “your daughters.” Then help them search scriptures like\nJohn 14:16\n;\nMoroni 10:5\n;\nDoctrine and Covenants 42:17\nto find out how the Spirit can help them.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 47: Lesson 146: Lesson 146—HoseaThis lesson can help students understand the Lord’s unfailing love and mercy for them.; Lesson 147: Lesson 147—JoelThis lesson can help students increase their capacity to receive personal revelation from the Lord through the Holy Ghost. ---\n\n--- Lesson 146 ---\nIn the book of Hosea, the Lord used the marriage of Hosea and Gomer as a symbol to teach Israel about His unfailing covenantal love. Like Israel, at times we might stray from the Lord and our covenants with Him. Even still, Jesus Christ remains faithful and loves us. This lesson can help students understand the Lord’s unfailing love and mercy for them. Student preparation: Invite students to think about what experiences have helped them feel the Lord’s love and mercy Possible Learning Activities Remembering Heavenly Father and Jesus Christ To begin class, prepare students to connect in a relevant way with the story of Hosea and Gomer. One way to do that is through a scenario like the following. Camille and Hannah have been good friends for a year. In that time, they have grown close and supported each other through hard times. Hannah shared some things she is struggling with. Camille promised not to share those things with other people. However, a few days ago, Hannah found out that Camille told some of their other friends about Hannah’s struggles. If you were Hannah, what thoughts and feelings might you have? Why might it be hard to forgive Camille? Consider explaining that this is one example of how we might feel betrayed or hurt when someone breaks a promise. While we might respond to these situations in unhelpful ways, the Lord responds differently. The book of Hosea teaches about a marriage relationship. In the scriptures, the Lord often uses marriage as a symbol for our covenant relationship with Him. President Russell M. Nelson taught that our covenants create “a covenant relationship in which [we and the Lord] are bound to be loyal and faithful to each other” (“ The Everlasting Covenant ,” Liahona , Oct. 2022, 6). Sometimes, God’s children are unfaithful to the Lord and stray from their covenants with Him. As you study the book of Hosea today, look for how the Lord feels about and responds to His covenant people even when they stray from Him. Hosea and Gomer To help students understand the story of Hosea and Gomer, display or summarize the following paragraph. See the Additional Resources section of this lesson in Gospel Library for more information about God’s commandment for Hosea to marry Gomer. Hosea was a prophet in the Northern Kingdom of Israel, prophesying around the same time as Isaiah. The Lord commanded Hosea to marry Gomer, in spite of the fact that she had been an adulteress and a harlot. Hosea and Gomer had three children together (see Hosea 1:2–8 ). You might want to explain that Hosea speaks for the Lord about Gomer, who represents the people of Israel. Consider making two columns on the board. Label one Hosea represents the Lord and the other Gomer represents Israel . Read Hosea 2:5 , looking for what Hosea said Gomer had done. “Their mother” refers to Gomer. How might Gomer’s actions represent the people of Israel? You might explain that Gomer’s unfaithfulness in her covenant marriage with Hosea represented Israel’s spiritual unfaithfulness in their covenant relationship with God. If helpful, students could read 2 Kings 17:14–16 , looking for how Israel had broken their covenants with the Lord. To help students relate the scriptures to themselves, you could ask a question like the following. List student responses on the board underneath Gomer represents Israel . How do people in our time sometimes stray from the Lord and their covenants with Him? Students might share things like being too busy for the Lord, using technology inappropriately, treating others poorly, putting other things before the Lord, or more serious sins. Students could reflect on this list or other things as they ponder the following prompt. Reflect on ways you might be tempted to break your covenants or ways you might be straying from your covenants with the Lord. To help students understand the Lord’s love and mercy for them, you could use the handout “Understanding the Lord’s Love and Mercy.” Students could work on their own to encourage quiet, prayerful pondering, or they could work in groups with an assigned group leader to guide their discussion. As students work, walk around the room and answer students’ questions as needed. Learning about the Lord Invite students to share the statements of truth they wrote on their handouts. They could share out loud or write their statements on the board underneath Hosea represents the Lord . They might write truths like the following: Jesus Christ is full of love and mercy, even when I stray from Him. Jesus Christ invites His covenant people to repent and keep their covenants. As students share, you could ask follow-up questions to help students make clear connections with the scriptures: “What part of the story helped you learn that about Him?” or “How did you see that truth about Him illustrated through Hosea?” Before asking the following question, you might refer students to the list on the board of ways we sometimes stray from the Lord and our covenants with Him. How can what you’re learning about the Lord help youth who feel discouraged or ashamed because they have strayed from the Lord? Before asking the next question, it might be wise to counsel students not to share anything too personal, such as previous sins. You could also share an experience from your own life. In what ways have you seen the Lord demonstrate His love and mercy in your life or the life of someone you know? Demonstrate understanding When students have a chance to explain or reflect on what they have learned, it can invite the Holy Ghost to teach them further. One way for them to do this is the following short writing activity. Choose one of the following. Write a message. Think about someone (it could be yourself) who might feel they have strayed too far from the Lord to be forgiven. Write an encouraging message to this person and share what you have learned about Heavenly Father and Jesus Christ that you think might help them. Write a description. How would you describe the character of Heavenly Father and Jesus Christ based on what you learned or felt today? You might share with students that we, like Gomer, can choose to accept the Lord’s loving invitation to repent and return to Him when we have strayed. Consider ending with your testimony of the Lord.\n\n\n--- Lesson 147 ---\nThis is an exciting time to live on the earth! Many prophecies and promises from the Lord are being fulfilled. Among these is the Lord’s promise “I will pour out my spirit upon all flesh” ( Joel 2:28 ; see also Joseph Smith—History 1:41 ). Think of it—the Creator of the world wants to bless you with His Spirit! This lesson can help students increase their capacity to receive personal revelation from the Lord through the Holy Ghost. Student preparation: Provide students with the question “What can I do to receive more personal revelation in my life?” Invite them to reflect on different ways they could answer. They could also look to the scriptures or teachings of Church leaders or ask people they trust for answers to the question. Possible Learning Activities Our capacity for personal revelation Consider bringing containers of various sizes to class or drawing some on the board. For example, you could bring (or draw on the board) a small cup and pitcher and a large bucket. You could ask students to share which container they would choose for collecting water, money, or other items and explain why they would choose that container. Display the following statement and invite students to discuss the accompanying question with a partner or small group. If needed, explain that capacity can mean the maximum amount something can contain. President Russell M. Nelson gave the following invitation: My beloved brothers and sisters, I plead with you to increase your spiritual capacity to receive revelation. … Choose to do the spiritual work required to enjoy the gift of the Holy Ghost and hear the voice of the Spirit more frequently and more clearly.“ Revelation for the Church, Revelation for Our Lives ,” Ensign or Liahona , May 2018, 96) How could you use the different containers to explain to someone what it means to “increase [our] spiritual capacity to receive revelation?” After discussing President Nelson’s invitation, you could point to the containers and invite students to quietly reflect on their personal spiritual capacity to receive revelation. They could record their responses to the following questions in their study journal. Which container do you feel best represents your current capacity to receive personal revelation? Why? What are you experiencing in your life that could benefit from receiving more personal revelation from God? You might explain that seminary provides opportunities to “do the spiritual work required” to receive personal revelation. Encourage students to put forth effort such as offering a silent prayer, making comments, marking scriptures, or recording thoughts in their study journals. As they engage and participate in these ways, the Holy Ghost can teach them how they might increase their capacity to receive personal revelation. God will pour out His spirit Joel prophesied of terrible events that would precede the second coming of Jesus Christ (see Joel 2:1–11 ). Joel also prophesied of great promises the Lord would fulfill to help His people in the last days. Read Joel 2:21 and the first line in verses 22 and 23 . Mark the counsel the Lord gave to His creations in the last days. What are some “great things” Heavenly Father and Jesus Christ have done that can help you “fear not” and “be glad”? Read Joel 2:27–29 , looking for the great things the Lord promised to do in the latter days. What did you see in these verses that could be considered “great”? Students might express many truths, including that the Lord will pour out His Spirit upon all people in the latter days . Consider sharing that the angel Moroni repeated this prophecy when he visited Joseph Smith (see Joseph Smith—History 1:41 ). What are some different ways the Lord might pour out His Spirit? This prophecy can have multiple meanings and fulfillments. One way the Lord pours His spirit upon us is by giving us personal revelation. If you brought containers to class, you could demonstrate the differences between pouring, dripping, and spraying water into a container. Discuss the significance of the Lord’s promise to pour out His spirit upon us. How can we recognize the revelation the Lord is pouring out upon us? If students need help answering the previous question, you could invite half the class to read Galatians 5:22–23 and the other half to read Doctrine and Covenants 11:12–13 then share what they found. Students might also benefit from discussing the significance of the phrase all flesh in Joel 2:28 and further explained in verse 29 . Help them understand that this promise is for all Heavenly Father’s children both women and men. What does this teach you about Heavenly Father’s desires for you? Increasing our capacity To help students learn how to “do the spiritual work” necessary to receive personal revelation, you could give them each a copy of the handout “ Increasing Your Capacity to Receive Revelation .” Consider placing students in groups of three and assigning every student a separate statement to study from the first part of the handout. Students could then share with their group what they learned. They could complete the second step on the handout as a group or individually. Open PDF When students have completed the handout, consider inviting them to choose one or two suggestions they feel would be most helpful for teenagers to receive personal revelation. Invite them to write these suggestions on separate pieces of paper and place them in the largest container you brought to class. You could express that the largest container can symbolize our need to increase our capacity to receive revelation. Consider writing the following instructions on the board. Share one of the following related to the suggestion: A personal experience Some advice A scripture or statement A question You could invite a few students, one at a time, to draw a paper from the container. They could read to the class the suggestion they drew and then choose one thing from the board they would like to share or ask the class to share. Consider the time you have available in class and the engagement level of your students as you determine how many suggestions to discuss. Be sure to leave enough time for students to apply what they have learned. Apply what you have learned To help students see the confidence Church leaders have in youth to receive revelation, consider watching “ 2020 Temple and Family History Leadership Instruction ” from timecode 56:06 to 58:29, available at ChurchofJesusChrist.org . Elder David A. Bednar of the Quorum of the Twelve Apostles speaks to youth presidencies about adjustments made to involve them more in the work of salvation. 59:35 Consider bearing your witness that the Lord wants to pour out His Spirit and speak to all people, including your students. Invite students to reflect on ways they can increase their capacity to receive revelation in their lives. You could do this by providing the following instructions: Reflect again on what you are experiencing in life that could benefit from more personal revelation from God. In your study journal, draw a container with something being poured into it. Label your container with one or two things you will do to increase your capacity to receive the revelation the Lord is pouring out upon you. You might add specific details of how you will try to do these things effectively. You could invite willing students to share what they wrote.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";10–14;Joel",
      "content": "Israel’s covenant with the Lord was meant to be so deep and meaningful that the Lord compared it to a marriage. The covenant, like a marriage, included eternal commitment, shared experiences, building a life together, exclusive loyalty, and, most of all, wholehearted love. Sadly, the Israelites were not faithful to their covenant. And yet the Lord’s message to them was not “I will reject you forever.” Instead it was “I will invite you back” (see\nHosea 2:14–15\n). “I will betroth thee unto me in righteousness,” He declared through the prophet Hosea (\nHosea 2:19\n). “I will heal their backsliding, I will love them freely” (\nHosea 14:4\n). This is the same message He gives us today as we seek to live our covenants with love and devotion.\nJoel shared a similar message: “Turn unto the Lord your God: for he is gracious and merciful, slow to anger, and of great kindness” (\nJoel 2:13\n). Reading these prophets’ words may prompt you to ponder your own relationship with the Lord—to think about how His faithfulness to you inspires you to be faithful to Him.\nFor an overview of the books of Hosea and Joel, see “\nHosea, or Hoshea\n” and “\nJoel\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nHosea 1–3\n;\n14\nThe Lord always invites me to return to Him.\nHosea’s wife, Gomer, was unfaithful to him, and God pointed to this sad event to teach the Israelites how He felt about them and their covenants with Him. As you read\nHosea 1–3\n, ponder how the Lord views His relationship with His covenant people. How is making a covenant with the Lord like entering into a marriage? How is failing to keep that covenant like being unfaithful to a spouse? (see\nHosea 2:5–7, 13\n). What does\nHosea 2:14–23\nteach you about the Lord’s love and mercy? How do you show Him your love and loyalty?\nIn\nHosea 14\n, look for the many beautiful promises the Lord makes to those who return to Him. What does the phrase “love them freely” mean to you? (\nverse 4\n). What do the plant metaphors in\nverses 5–8\nteach you about the Lord’s blessings, including the blessings of repentance? As part of your study, consider singing or listening to a hymn about the Savior’s mercy, such as “\nCome unto Jesus\n” (\nHymns\n, no. 117).\nGomer, who represents the house of Israel and their broken covenants, was offered redemption by the Lord. Illustration by Deb Minnard, licensed from\ngoodsalt.com\nHosea 6:4–7\n;\nJoel 2:12–13\nDevotion to God must be felt inwardly, not just expressed outwardly.\nThe people in Hosea’s day were offering animal sacrifices, but they were breaking more important commandments. What do you think it means that the Lord “desired mercy, and not sacrifice; and the knowledge of God more than burnt offerings”? (\nHosea 6:6\n). What do you think it means for righteousness to be like a cloud or like dew? (see\nHosea 6:4\n). What should our righteousness be like? (see\nIsaiah 48:18\n;\n1 Nephi 2:9–10\n).\nYou could also read\nMatthew 9:10–13\n;\n12:1–8\nto see how the Savior used\nHosea 6:6\nduring His ministry. How do these passages help you understand Hosea’s words?\nWhen reading\nJoel 2:12–13\n, it might help to know that rending or tearing one’s clothing was an outward sign of mourning or remorse. How is rending our hearts different from rending our garments?\nJoel 2\n“I will pour out my spirit upon all flesh.”\nWhat similarities do you see between our day and the day Joel foresaw? (see especially\nJoel 2:1–2, 11, 18–32\n). What impresses you about the blessings the Lord promised in\nverses 18–32\n? Why might these blessings be especially valuable today?\nIt might be interesting to read what Moroni said about\nJoel 2\nwhen he visited Joseph Smith in 1823 (see\nJoseph Smith—History 1:41\n). How do you feel the prophecies in\nJoel 2:28–32\nare being fulfilled in our day? (see also\nActs 2:1–21\n). What do you think it means that the Lord would “pour out [His] spirit upon all flesh”? (\nJoel 2:28\n).\nYou might ponder these words from President Russell M. Nelson: “In coming days, it will not be possible to survive spiritually without the guiding, directing, comforting, and constant influence of the Holy Ghost” (“\nRevelation for the Church, Revelation for Our Lives\n,”\nEnsign\nor\nLiahona\n, May 2018, 96). Why is revelation essential to your spiritual survival?\nWhat can you do if you feel like you aren’t receiving that outpouring? Here are some examples that might help. What did the people in these scriptures do to receive an outpouring of the Lord’s Spirit?\nMosiah 4:1–3, 19–20\n;\n18:7–11\nHelaman 6:34–36\nDoctrine and Covenants 19:37–41\nAs you read these words from Elder David A. Bednar, ponder what it means to you to feel an outpouring of the Holy Ghost in your daily life:\n“We often make it hard on ourselves to receive personal revelation. By that I mean the covenant promise is that as we honor our covenants, we may always have the Holy Ghost to be our constant companion. But we talk about it and we treat it as if hearing the voice of the Lord through His Spirit is the rare event. … [The Spirit] ought to be with us all of the time. Not every nanosecond, but if a person is doing his or her best—you don’t have to be perfect—but if you and I are doing our best and we’re not committing serious transgression, then we can count on the Holy Ghost guiding us. …\n“… We seem to believe that the Holy Ghost is dramatic and big and sudden, when it’s still and small and incremental over time” (“\nElder David A. Bednar Discussion\n” [evening with a General Authority, Feb. 7, 2020], broadcasts.ChurchofJesusChrist.org).\nSee also Gary E. Stevenson, “\nPromptings of the Spirit\n,”\nLiahona\n, Nov. 2023, 42–45; “Enemy Territory” (video), Gospel Library.\n3:38\nEnemy Territory\nCreate a spiritual environment.\n“What have you observed that contributes to a spiritual environment for learning the gospel? What detracts from it? … Think about the setting where you most often teach [or learn]. How do you feel when you are there? How can you more effectively invite the Spirit to be present there?” (\nTeaching in the Savior’s Way\n,\n7\n).\nIdeas for Teaching Children\nHosea 2:19–20\nI can faithfully keep my covenants.\nIn the book of Hosea, the Lord compared His covenants with His people to a marriage. To learn from this comparison, you and your children could look at a picture of a bride and groom and talk about how Heavenly Father wants a husband and wife to treat each other. Help your children find words in\nHosea 2:19–20\nthat describe how the Lord feels about us. How can we show the Lord that we love Him and will be faithful to Him?\nHosea 10:12\n“It is time to seek the Lord.”\nHosea 10:12\nrefers to sowing, reaping, time, and rain to invite us to seek the Lord. As you read this verse, what creative ideas come to mind that could inspire the children to seek Him? For example, maybe your children could draw a clock and write down ways they can seek the Lord at different times throughout the day. A song like “Anytime, Anywhere” (Gospel Library) could help you teach that it is always a good time to seek the Lord.\nOr your children could do simple actions that go with the verse, such as pretending to plant seeds, pick vegetables, or stand in the rain. Help your children compare planting a seed and reaping good food to living righteously and receiving the Lord’s blessings. Then you could tell each other about the blessings the Lord has rained upon you as you have tried to seek Him.\nHosea 13:4, 14\nJesus Christ is my Savior and Redeemer.\nTo emphasize the truth in\nHosea 13:4\nthat there is no Savior except Jesus Christ, you could show your children pictures of several people, including Jesus. Your children could take turns pointing to the person who has the power to save us from sin and death. Share your testimony of Jesus Christ and His Atonement.\nYour children could look for words in\nHosea 13:4, 14\nthat describe Jesus Christ. What do these words teach us about Him? Consider helping your children use the\nGuide to the Scriptures\nto find other scriptures that teach that Jesus is our Savior and Redeemer. Share with each other how you feel about Jesus Christ.\nJoel 2:28–29\nThe Holy Ghost can guide me.\nMaybe you could help your children understand\nJoel 2:28–29\nby letting them pour a liquid and then contrasting it with a drip or a trickle. What could it mean for the Spirit to be “poured out” upon us?\nAs you read\nJoel 2:28–29\ntogether, you might invite your children to insert each other’s names in place of the phrases “your sons” and “your daughters.” Then help them search scriptures like\nJohn 14:16\n;\nMoroni 10:5\n;\nDoctrine and Covenants 42:17\nto find out how the Spirit can help them.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 47: Lesson 146: Lesson 146—HoseaThis lesson can help students understand the Lord’s unfailing love and mercy for them.; Lesson 147: Lesson 147—JoelThis lesson can help students increase their capacity to receive personal revelation from the Lord through the Holy Ghost.",
      "content": "\n--- Lesson 146 ---\nIn the book of Hosea, the Lord used the marriage of Hosea and Gomer as a symbol to teach Israel about His unfailing covenantal love. Like Israel, at times we might stray from the Lord and our covenants with Him. Even still, Jesus Christ remains faithful and loves us. This lesson can help students understand the Lord’s unfailing love and mercy for them. Student preparation: Invite students to think about what experiences have helped them feel the Lord’s love and mercy Possible Learning Activities Remembering Heavenly Father and Jesus Christ To begin class, prepare students to connect in a relevant way with the story of Hosea and Gomer. One way to do that is through a scenario like the following. Camille and Hannah have been good friends for a year. In that time, they have grown close and supported each other through hard times. Hannah shared some things she is struggling with. Camille promised not to share those things with other people. However, a few days ago, Hannah found out that Camille told some of their other friends about Hannah’s struggles. If you were Hannah, what thoughts and feelings might you have? Why might it be hard to forgive Camille? Consider explaining that this is one example of how we might feel betrayed or hurt when someone breaks a promise. While we might respond to these situations in unhelpful ways, the Lord responds differently. The book of Hosea teaches about a marriage relationship. In the scriptures, the Lord often uses marriage as a symbol for our covenant relationship with Him. President Russell M. Nelson taught that our covenants create “a covenant relationship in which [we and the Lord] are bound to be loyal and faithful to each other” (“ The Everlasting Covenant ,” Liahona , Oct. 2022, 6). Sometimes, God’s children are unfaithful to the Lord and stray from their covenants with Him. As you study the book of Hosea today, look for how the Lord feels about and responds to His covenant people even when they stray from Him. Hosea and Gomer To help students understand the story of Hosea and Gomer, display or summarize the following paragraph. See the Additional Resources section of this lesson in Gospel Library for more information about God’s commandment for Hosea to marry Gomer. Hosea was a prophet in the Northern Kingdom of Israel, prophesying around the same time as Isaiah. The Lord commanded Hosea to marry Gomer, in spite of the fact that she had been an adulteress and a harlot. Hosea and Gomer had three children together (see Hosea 1:2–8 ). You might want to explain that Hosea speaks for the Lord about Gomer, who represents the people of Israel. Consider making two columns on the board. Label one Hosea represents the Lord and the other Gomer represents Israel . Read Hosea 2:5 , looking for what Hosea said Gomer had done. “Their mother” refers to Gomer. How might Gomer’s actions represent the people of Israel? You might explain that Gomer’s unfaithfulness in her covenant marriage with Hosea represented Israel’s spiritual unfaithfulness in their covenant relationship with God. If helpful, students could read 2 Kings 17:14–16 , looking for how Israel had broken their covenants with the Lord. To help students relate the scriptures to themselves, you could ask a question like the following. List student responses on the board underneath Gomer represents Israel . How do people in our time sometimes stray from the Lord and their covenants with Him? Students might share things like being too busy for the Lord, using technology inappropriately, treating others poorly, putting other things before the Lord, or more serious sins. Students could reflect on this list or other things as they ponder the following prompt. Reflect on ways you might be tempted to break your covenants or ways you might be straying from your covenants with the Lord. To help students understand the Lord’s love and mercy for them, you could use the handout “Understanding the Lord’s Love and Mercy.” Students could work on their own to encourage quiet, prayerful pondering, or they could work in groups with an assigned group leader to guide their discussion. As students work, walk around the room and answer students’ questions as needed. Learning about the Lord Invite students to share the statements of truth they wrote on their handouts. They could share out loud or write their statements on the board underneath Hosea represents the Lord . They might write truths like the following: Jesus Christ is full of love and mercy, even when I stray from Him. Jesus Christ invites His covenant people to repent and keep their covenants. As students share, you could ask follow-up questions to help students make clear connections with the scriptures: “What part of the story helped you learn that about Him?” or “How did you see that truth about Him illustrated through Hosea?” Before asking the following question, you might refer students to the list on the board of ways we sometimes stray from the Lord and our covenants with Him. How can what you’re learning about the Lord help youth who feel discouraged or ashamed because they have strayed from the Lord? Before asking the next question, it might be wise to counsel students not to share anything too personal, such as previous sins. You could also share an experience from your own life. In what ways have you seen the Lord demonstrate His love and mercy in your life or the life of someone you know? Demonstrate understanding When students have a chance to explain or reflect on what they have learned, it can invite the Holy Ghost to teach them further. One way for them to do this is the following short writing activity. Choose one of the following. Write a message. Think about someone (it could be yourself) who might feel they have strayed too far from the Lord to be forgiven. Write an encouraging message to this person and share what you have learned about Heavenly Father and Jesus Christ that you think might help them. Write a description. How would you describe the character of Heavenly Father and Jesus Christ based on what you learned or felt today? You might share with students that we, like Gomer, can choose to accept the Lord’s loving invitation to repent and return to Him when we have strayed. Consider ending with your testimony of the Lord.\n\n\n--- Lesson 147 ---\nThis is an exciting time to live on the earth! Many prophecies and promises from the Lord are being fulfilled. Among these is the Lord’s promise “I will pour out my spirit upon all flesh” ( Joel 2:28 ; see also Joseph Smith—History 1:41 ). Think of it—the Creator of the world wants to bless you with His Spirit! This lesson can help students increase their capacity to receive personal revelation from the Lord through the Holy Ghost. Student preparation: Provide students with the question “What can I do to receive more personal revelation in my life?” Invite them to reflect on different ways they could answer. They could also look to the scriptures or teachings of Church leaders or ask people they trust for answers to the question. Possible Learning Activities Our capacity for personal revelation Consider bringing containers of various sizes to class or drawing some on the board. For example, you could bring (or draw on the board) a small cup and pitcher and a large bucket. You could ask students to share which container they would choose for collecting water, money, or other items and explain why they would choose that container. Display the following statement and invite students to discuss the accompanying question with a partner or small group. If needed, explain that capacity can mean the maximum amount something can contain. President Russell M. Nelson gave the following invitation: My beloved brothers and sisters, I plead with you to increase your spiritual capacity to receive revelation. … Choose to do the spiritual work required to enjoy the gift of the Holy Ghost and hear the voice of the Spirit more frequently and more clearly.“ Revelation for the Church, Revelation for Our Lives ,” Ensign or Liahona , May 2018, 96) How could you use the different containers to explain to someone what it means to “increase [our] spiritual capacity to receive revelation?” After discussing President Nelson’s invitation, you could point to the containers and invite students to quietly reflect on their personal spiritual capacity to receive revelation. They could record their responses to the following questions in their study journal. Which container do you feel best represents your current capacity to receive personal revelation? Why? What are you experiencing in your life that could benefit from receiving more personal revelation from God? You might explain that seminary provides opportunities to “do the spiritual work required” to receive personal revelation. Encourage students to put forth effort such as offering a silent prayer, making comments, marking scriptures, or recording thoughts in their study journals. As they engage and participate in these ways, the Holy Ghost can teach them how they might increase their capacity to receive personal revelation. God will pour out His spirit Joel prophesied of terrible events that would precede the second coming of Jesus Christ (see Joel 2:1–11 ). Joel also prophesied of great promises the Lord would fulfill to help His people in the last days. Read Joel 2:21 and the first line in verses 22 and 23 . Mark the counsel the Lord gave to His creations in the last days. What are some “great things” Heavenly Father and Jesus Christ have done that can help you “fear not” and “be glad”? Read Joel 2:27–29 , looking for the great things the Lord promised to do in the latter days. What did you see in these verses that could be considered “great”? Students might express many truths, including that the Lord will pour out His Spirit upon all people in the latter days . Consider sharing that the angel Moroni repeated this prophecy when he visited Joseph Smith (see Joseph Smith—History 1:41 ). What are some different ways the Lord might pour out His Spirit? This prophecy can have multiple meanings and fulfillments. One way the Lord pours His spirit upon us is by giving us personal revelation. If you brought containers to class, you could demonstrate the differences between pouring, dripping, and spraying water into a container. Discuss the significance of the Lord’s promise to pour out His spirit upon us. How can we recognize the revelation the Lord is pouring out upon us? If students need help answering the previous question, you could invite half the class to read Galatians 5:22–23 and the other half to read Doctrine and Covenants 11:12–13 then share what they found. Students might also benefit from discussing the significance of the phrase all flesh in Joel 2:28 and further explained in verse 29 . Help them understand that this promise is for all Heavenly Father’s children both women and men. What does this teach you about Heavenly Father’s desires for you? Increasing our capacity To help students learn how to “do the spiritual work” necessary to receive personal revelation, you could give them each a copy of the handout “ Increasing Your Capacity to Receive Revelation .” Consider placing students in groups of three and assigning every student a separate statement to study from the first part of the handout. Students could then share with their group what they learned. They could complete the second step on the handout as a group or individually. Open PDF When students have completed the handout, consider inviting them to choose one or two suggestions they feel would be most helpful for teenagers to receive personal revelation. Invite them to write these suggestions on separate pieces of paper and place them in the largest container you brought to class. You could express that the largest container can symbolize our need to increase our capacity to receive revelation. Consider writing the following instructions on the board. Share one of the following related to the suggestion: A personal experience Some advice A scripture or statement A question You could invite a few students, one at a time, to draw a paper from the container. They could read to the class the suggestion they drew and then choose one thing from the board they would like to share or ask the class to share. Consider the time you have available in class and the engagement level of your students as you determine how many suggestions to discuss. Be sure to leave enough time for students to apply what they have learned. Apply what you have learned To help students see the confidence Church leaders have in youth to receive revelation, consider watching “ 2020 Temple and Family History Leadership Instruction ” from timecode 56:06 to 58:29, available at ChurchofJesusChrist.org . Elder David A. Bednar of the Quorum of the Twelve Apostles speaks to youth presidencies about adjustments made to involve them more in the work of salvation. 59:35 Consider bearing your witness that the Lord wants to pour out His Spirit and speak to all people, including your students. Invite students to reflect on ways they can increase their capacity to receive revelation in their lives. You could do this by providing the following instructions: Reflect again on what you are experiencing in life that could benefit from more personal revelation from God. In your study journal, draw a container with something being poured into it. Label your container with one or two things you will do to increase your capacity to receive the revelation the Lord is pouring out upon you. You might add specific details of how you will try to do these things effectively. You could invite willing students to share what they wrote.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 22732,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.402495"
}