{
  "week_number": 38,
  "date_range": "Isaiah 1–12",
  "title": "",
  "primary_scriptures": [
    {
      "book": "Isaiah",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        "10",
        "11",
        "12"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Isaiah",
      "chapters": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        "10",
        "11",
        "12"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM:  ---\nEven if this is your first time reading the book of Isaiah, you might find passages that sound familiar. That’s because, of all the Old Testament prophets, Isaiah is the one most often quoted in other books of scripture, including by the Savior Himself. Isaiah’s words also appear often in hymns and other sacred music.\nWhy is Isaiah quoted so often? Surely one reason is that Isaiah had a gift for expressing the word of God in vivid, memorable language. But it’s more than that. Isaiah has inspired prophets for generations because the truths he taught transcended his own generation (between 740 and 701 BC). He wrote of God’s great work of redemption, which is much bigger than one nation or one time period. From Isaiah, Nephi learned that he and his people, though separated from the rest of Israel, were still part of God’s covenant people. In Isaiah, New Testament writers found prophecies about the Messiah that were fulfilled right before their eyes. And in Isaiah, Joseph Smith found inspiration for the latter-day work of gathering Israel and building Zion. When you read Isaiah, what will you find?\nFor more about Isaiah and his writings, see “\nIsaiah\n” in the Bible Dictionary. For information about the time when Isaiah lived, see\n2 Kings 15–20\nand\n2 Chronicles 26–32\n.\nIdeas for Learning at Home and at Church\nIsaiah 1–12\nThe words of Isaiah will all be fulfilled.\nThe Savior taught that “all things that [Isaiah] spake have been and shall be, even according to the words which he spake” (\n3 Nephi 23:3\n). As you study the book of Isaiah, consider making a chart of prophecies with headings like these:\nIsaiah’s day\n,\nThe Savior’s mortal ministry\n, and\nThe latter days\n. Note that many of Isaiah’s prophecies are fulfilled in more than one way (see Bible Dictionary, “\nIsaiah\n”).\nPresident Dallin H. Oaks taught: “The book of Isaiah contains numerous prophecies that seem to have multiple fulfillments. One seems to involve the people of Isaiah’s day or the circumstances of the next generation. Another meaning, often symbolic, seems to refer to events in the meridian of time, when Jerusalem was destroyed and her people scattered after the crucifixion of the Son of God. Still another meaning or fulfillment of the same prophecy seems to relate to the events attending the Second Coming of the Savior. The fact that many of these prophecies can have multiple meanings underscores the importance of our seeking revelation from the Holy Ghost to help us interpret them” (“\nScripture Reading and Revelation\n,”\nEnsign\n, Jan. 1995, 8).\nUnderstanding Isaiah.\nThe Savior said, “Search these things diligently; for great are the words of Isaiah” (\n3 Nephi 23:1\n; see also\nverses 2–3\n). Yet to many, Isaiah can be difficult to understand. The following ideas might help:\nPonder the symbols and metaphors Isaiah used.\nAsk yourself, “What am I learning about Jesus Christ?” (see\n1 Nephi 19:23\n).\nLook for topics that feel relevant to our time.\nUse study helps, such as a dictionary, the footnotes, chapter headings, and the\nGuide to the Scriptures\n.\nIsaiah 1\n;\n3–5\nProphets warn about sin and promise hope through repentance.\nLike prophets in all times, Isaiah continually warned the people about their spiritual condition. As you read\nIsaiah 1\n;\n3\n;\n5\n, look for phrases that describe how the people were doing spiritually (see, for example,\nIsaiah 1:2–4, 21–23\n;\n3:9, 16–17\n;\n5:11–12, 20–23\n). What similar problems do you see in our time? You might also look for verses that warn about the consequences of the Israelites’ spiritual condition (such as\nIsaiah 1:7\n;\n3:17–26\n;\n5:5–7, 13–15\n).\nIn addition to warnings, Isaiah gave messages of hope for redemption through the Savior (see, for example,\nIsaiah 1:16–19, 25–27\n;\n3:10\n;\n4\n). What do you learn about the Lord from these messages? How is the Lord’s message in these verses different from what Satan wants us to believe?\nLike Isaiah, prophets today warn us about sin and its consequences, and they provide messages of hope through Jesus Christ. What examples can you think of? You might want to review a message from a past general conference, looking for such warnings and promises.\nIsaiah 2\n;\n4\n;\n11–12\nGod will do a great work in the latter days.\nMany of Isaiah’s prophecies have specific meaning for our day. To find them, look for future-tense verbs (such as “shall be” or “shall go”). For example, look for these verbs as you read\nIsaiah 2\n;\n4\n;\n11–12\n. You might even try replacing them with present-tense verbs (like\nis\nor\nis going\n). Which prophecies are especially inspiring to you? What do you learn from these prophecies about Zion, building temples, and gathering Israel?\nIsaiah 2:2–3\nis especially relevant for Latter-day Saints. How are these prophecies being fulfilled? What do you learn about the Lord’s “ways” and “paths” in His house? (\nverse 3\n).\nSee also\nIsaiah 5:26\n; “\nHigh on the Mountain Top\n,”\nHymns\n, no. 5.\nIsaiah 6\nProphets are called by God.\nIn\nIsaiah 6\n, Isaiah recounted his call to be a prophet. As you read this chapter, what impresses you about Isaiah’s experience? How does this chapter influence the way you think about the Lord, His prophets, and the work they are called to do?\n“For unto us a child is born, unto us a son is given” (\nIsaiah 9:6\n).\nIsaiah 7–9\nGod promised to send Jesus Christ to be my Savior.\nDuring Isaiah’s ministry, Israel formed an alliance with Syria to defend itself against Assyria. Israel and Syria wanted to force Ahaz, the king of Judah, to join them. But Isaiah prophesied that the alliance would fail and counseled Ahaz to trust in the Lord (\nIsaiah 7:7–9\n;\n8:12–13\n).\nWhile Isaiah counseled Ahaz, he made several well-known prophecies, such as those found in\nIsaiah 7:14\n;\n8:13–14\n;\n9:2, 6–7\n. Whatever these prophecies meant to Ahaz, they clearly apply to Jesus Christ (see also\nMatthew 1:21–23\n;\n4:16\n;\n21:44\n;\nLuke 1:31–33\n). Why is “Immanuel” a good title for the Savior? (see\nMatthew 1:23\n). How has He been a “Counsellor” or “Prince of Peace” to you? (\nIsaiah 9:7\n). What else do you learn about the Savior from these verses?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 1:2–4, 16–19\nBecause of Jesus Christ, I can repent and be clean.\nIn\nIsaiah 1:2–4\n, you and your children could find reasons that the Lord was not happy with the people. Note the comparison with animals in\nverse 3\n—who is our “master”? How do we show that we know Him?\nTo visualize\nIsaiah 1:16–18\n, you and your children could look at something bright red and something pure white. Or maybe you could work together to wash something. How do we become unclean spiritually? How does Jesus help us become clean? What do we learn about the Savior from these verses? Share with your children how you feel about Him and what He has done for you.\nIsaiah 2:2–4\nIn the temple, I learn about Jesus Christ.\nIsaiah foresaw a time when “the mountain of the Lord’s house” would attract people from “all nations” (\nIsaiah 2:2\n). How can you help your children feel excited about going to the Lord’s house? You could invite them to draw a picture of their home. Then read together\nIsaiah 2:2\n, and invite them to draw a picture of “the Lord’s house,” which is a temple. Read\nIsaiah 2:3\ntogether. Invite them to add to their pictures many people coming to the temple, including their families.\nYou could also read\nIsaiah 2:2–3\ntogether and identify something that inspires you and your children to go to the temple. Then, after reading\nIsaiah 2:4\ntogether, you could discuss how the temple brings them peace. Consider singing a song about the temple, such as “\nI Love to See the Temple\n” (\nChildren’s Songbook\n, 95). Help your children find words in the song that teach what the temple is and what we do there.\nSalt Lake Temple\nIsaiah 7:14\n;\n9:6–7\nJesus Christ came to earth to be my Savior.\nTo introduce Isaiah’s prophecies of Christ, you and your children could talk about titles of people, like president, bishop, or teacher. What do these titles tell us about these people? Help your children find titles of Jesus Christ in\nIsaiah 7:14\nand\n9:6–7\n(see also this week’s activity page). What do each of these titles teach about Him? What else do we learn about Jesus Christ from these verses?\nYou could also share with your children “\nIsaiah the Prophet\n” (in\nOld Testament Stories\n, 150–51). Pause periodically to ask what Isaiah knew about Jesus Christ many years before He was born. You can then use\nMatthew 1:21–23\n;\nLuke 1:31–33\nto talk about how Isaiah’s prophecies in\nIsaiah 7:14\n;\n9:6–7\nwere fulfilled.\n1:18\nIsaiah the Prophet\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 38: Lesson 113: Lesson 113—Introduction to IsaiahThis lesson can help students feel motivated to learn about Jesus Christ through studying Isaiah.; Lesson 114: Lesson 114—Isaiah 1This lesson can help students feel confident that the Savior can cleanse them from their sins.... ---\n\n--- Lesson 113 ---\nThe prophet Isaiah had the very important responsibility to teach about redemption through Jesus Christ. This message was intended for the people in Isaiah’s time, as well as for us in our time. It is worth the effort to diligently study Isaiah’s teachings about Jesus Christ. This lesson can help students feel motivated to learn about Jesus Christ through studying Isaiah. Student preparation: Consider inviting students to come to class prepared to share a significant fact about Isaiah. They could look up Isaiah in the Bible Dictionary or Guide to the Scriptures. Possible Learning Activities A book recommendation Consider beginning class by displaying the following statements and inviting students to put them in order from most likely to least likely to persuade them to read a certain book. Looks very interesting Recommended by a family member or friend Assigned for a class at school Has great online reviews You might invite a few students to share what their top reason was and why. Read 3 Nephi 23:1–3 , looking for what book the Savior invited us to study. What thoughts do you have about the Savior’s commandment to search the words of Isaiah diligently? How might the Savior’s commandment influence how you approach your study of Isaiah? You might ask students to demonstrate their confidence in their ability to study the words of Isaiah diligently. One way to do this is to label one wall of the classroom as “very confident” and another wall as “not very confident.” Invite students to stand in between the walls according to their confidence level. Willing students could explain their level of confidence. Share with students that the Holy Ghost can help them gain confidence that the teachings of Isaiah can help them come closer to Jesus Christ. What is helpful to know about the prophet Isaiah? To help students gain some understanding about the prophet Isaiah, consider displaying the infographic “ The Kingdoms of Israel and Judah at a Glance .” Invite students to locate Isaiah. You might ask students to find answers to the following questions in the infographic: What kingdom did Isaiah live in? (Judah) What other prophets preached around the same time as Isaiah? (Micah, Hosea, Jonah) What significant event happened about a century after Isaiah prophesied it? (Judah was taken captive by Babylon) For more information, see entries for “Isaiah” in the Bible Dictionary or Guide to the Scriptures . You could invite students to share anything else they learned about Isaiah in their student preparation. Read or summarize the following paragraph. During his life, the prophet Isaiah preached to people who had turned away from faith in Jehovah (Jesus Christ). Isaiah’s message to them is reflected in his own name which means, “The Lord is salvation.” Isaiah’s teachings also apply to other periods when people would turn away from Jesus Christ—such as the time of Christ and the present day, as we prepare for His Second Coming. Isaiah’s words can help us believe more fully in Jesus Christ Students might be interested to know that “Jesus quoted Isaiah more frequently than He quoted any other prophet. Isaiah is also quoted frequently by Peter, John, and Paul in the New Testament. The Book of Mormon and the Doctrine and Covenants contain more quotes from Isaiah than from any other prophet and provide much help in interpreting Isaiah” (Guide to the Scriptures, “ Isaiah ,” Gospel Library). Read 1 Nephi 19:23 , looking for why Nephi read the words of Isaiah to his brothers. What did you find? If students do not point it out, help them understand this truth: Studying the words of Isaiah can help us believe more fully in Jesus Christ. This could be a good opportunity for students to reflect on the value of coming to know Jesus Christ better through Isaiah’s words. One way you could do this is to invite students to complete the following sentence in their journals: “Believing more deeply in Jesus Christ could impact my life by …” Once students have had a chance to write, you might invite volunteers to share what they wrote with the class. Remember to express appreciation for each student who shares. Alternatively, rather than having them write in journals, you could invite students to turn to a partner and share their thoughts. Names and titles of Jesus Christ Help students understand that one of the ways Isaiah leads us to believe more fully in Jesus Christ is by teaching about His titles and roles. One way to study these titles and roles is to use a diagram. You could draw the following diagram on the board. Or, organize students into small groups and invite them to draw it on a piece of paper. Write “Jesus Christ” in the center circle. Students could then be invited to write the titles and roles of Jesus Christ that they discover in the other circles. Read the following verses and identify and consider marking the titles or roles of Jesus Christ. Isaiah 7:14 Isaiah 9:6–7 Isaiah 33:22 Isaiah 40:28 After students have read, you could display several pictures of Jesus Christ selected from the Church media library. Students could then share what titles or roles they see being fulfilled in the image. Consider inviting group members to select a title or role and learn more about it by using footnotes or looking up “Jesus Christ” in the Guide to the Scriptures or Topical Guide . You could invite students to add to the diagram by creating circles branching out from the title or role they focused on. They could list insights they learned about that title or role. (Note: this activity will be referred to in Lesson 133: “Assess Your Learning 8 .”) You might invite them to share what they learn about the Savior with their group. Why do you need the Savior to fulfill one or more of these roles in your life? How have you seen the Savior fulfill one of these roles in your life or the life of someone you know?\n\n\n--- Lesson 114 ---\nEven though we all sin and need forgiveness, sometimes we may believe we cannot be forgiven. Our Savior’s message is clear: “though your sins be as scarlet, they shall be as white as snow” ( Isaiah 1:18 ). This lesson can help students feel confident that the Savior can cleanse them from their sins. Student preparation: Invite students to read the doctrinal mastery passage Isaiah 1:18 and look for the imagery that Isaiah used. Encourage students to ponder and prepare to share what the passage means to them. Students could also practice memorizing the key scripture phrase: “though your sins be as scarlet, they shall be as white as snow” ( Isaiah 1:18 ). Possible Learning Activities The stain of sin Consider beginning class by displaying the following image or an article of stained clothing. Think about times when you had a stain on your clothing that would not come out. How might our sins be compared to stains? What are some reasons people might think they cannot be cleansed of their sins? You might want to display the following prompt, so students can reflect on their feelings. Reflect on which of the following statements you relate with most. You might ask yourself why you feel that way. I am confident the Savior can cleanse me of all my sins. I believe the Savior can cleanse me of some of my sins, but not all of them. I believe the Savior can cleanse other people’s sins, but not mine. I do not believe the Savior can cleanse sins. One of the many roles of the Holy Ghost is to testify of Jesus Christ (see 3 Nephi 28:11 ). As you study Isaiah 1 , pay attention to what Heavenly Father would have you learn through the Holy Ghost about Jesus Christ and His power to cleanse sins. A sinful nation Read Isaiah 1:2–4 , looking for the spiritual condition of the Israelites. Invite students to report what they find. The following can help students learn important skills for studying Isaiah. As you study Isaiah’s teachings, it is helpful to understand that he often recorded the Lord’s words in a poetic form called parallelism . Parallelism occurs when a writer expresses an idea and then repeats or contrasts the idea using different words. For example, find the related phrases in verse 2 . You could help students identify the combined phrases “Hear, O heavens” and “give ear, O earth” ( Isaiah 1:2 ). This is an example of parallelism. Isaiah also used imagery to illustrate his teachings. For example, read verse 3 , looking for the different images Isaiah used to teach the Israelites. You could ask students what Isaiah taught the Israelites by using the images of an ox and donkey. If needed, explain that unlike an ox and donkey, the Israelites did not recognize their Master. Consider summarizing verses 5–15 by sharing the following paragraph. The Lord warned the Israelites that their sins were having negative effects on them (see Isaiah 1:5–9 ). He also explained that He was not pleased with their religious acts of worship because they were being offered without sincerity (see Isaiah 1:10–15 ). From scarlet to white Read Isaiah 1:16–17 , looking for the Lord’s invitations to the people. What did the Lord invite them to do? Read Isaiah 1:18 , looking for the Lord’s promise as we repent. Please note that Isaiah used both parallelism and imagery to illustrate this promise. Isaiah 1:18 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. To help students better understand the imagery used in verse 18 , consider displaying the following images. Open PDF Open PDF What can the images of scarlet and crimson teach us about sin? Sister Sharon Eubank, formerly of the Relief Society General Presidency, explained: 11:29 The scarlet dye of the Old Testament was not only colorful but also colorfast, meaning that its vivid color stuck to the wool and would not fade no matter how many times it was washed. Satan wields this reasoning like a club: white wool stained scarlet can never go back to being white. But Jesus Christ declares, “My ways [are] higher than your ways,” and the miracle of His grace is that when we repent of our sins, His scarlet blood returns us to purity. It isn’t logical, but it is nevertheless true. (“ Christ: The Light That Shines in Darkness ,” Ensign or Liahona , May 2019, 75) What can the images of snow and wool teach us about the Savior’s promise as we repent? How might you summarize verses 16–18 into a statement of truth? Though students may use different words, help them identify the following truth: If we sincerely repent, Jesus Christ will cleanse us from our sins. What the Savior experienced so we can repent The following scriptures can help students reflect on what the Savior experienced so they can be cleansed from their sins. Consider organizing students into pairs. Each pair could read the following scriptures and discuss what they learned with each other. The accompanying questions could help. Willing students could then share with the class. Read Alma 7:13–14 and Doctrine and Covenants 19:16–19 , looking for what the Savior experienced so you can repent and be cleansed from your sins. What did you find? What did you learn about Heavenly Father and Jesus Christ from these verses that could help someone choose to repent? To help students feel that they can be cleansed by the Savior, consider showing a video, such as “ There Is No Limit to God’s Love ” (from time codes 0:00 to 4:54). This video is available at ChurchofJesusChrist.org . Students could ponder how the girl in the video felt because of her sins and evidence of the truth taught in Isaiah 1:18 . You could then invite students to share what they found. 5:37 One way to invite the Holy Ghost is to give students opportunities to share feelings, testimonies, and experiences. The following question is one way students can do this. Consider inviting students to respond to the question first in their journal, and then willing students can share what they wrote with the class. As students share, remind them not to share names or anything too personal. What have you felt about Jesus Christ and His ability to cleanse you from sin? Consider concluding with your feelings about the Savior and His power to cleanse us when we repent. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Isaiah 1:18 is “Though your sins be as scarlet, they shall be as white as snow.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 115 ---\nThrough the prophet Isaiah, the Lord warned Israel against their sinful choices, including calling “evil good, and good evil” ( Isaiah 5:20 ). Today, there are many destructive ideas and practices that appear to be good. This lesson can increase students’ ability to discern between good and evil. Student preparation: Invite students to come to class prepared to share an example of something that was assumed to be harmless, or even good, that eventually was shown to be harmful. Possible Learning Activities Spiritually dangerous ideas and actions Consider beginning class by displaying a picture of a camouflaged cheetah, like the one at the start of this lesson. Then, you could ask the following question and display the statement by Elder David A. Bednar. What makes a cheetah dangerous to its prey? Elder David A. Bednar of the Quorum of the Twelve Apostles compared cheetahs to dangerous ideas and actions. 15:59 To me, cheetahs are sleek, alluring, and captivating creatures. A cheetah’s yellowish-tan to greyish-white coat with black spots acts as a beautiful disguise that makes these animals almost invisible as they stalk their prey in the African grasslands. In a similar way, spiritually dangerous ideas and actions frequently can appear to be attractive, desirable, or pleasurable. Thus, in our contemporary world, each of us needs to be aware of beguiling bad that pretends to be good. (“ Watchful unto Prayer Continually ,” Ensign or Liahona , Nov. 2019, 33) What are some examples of “spiritually dangerous ideas and actions” that “can appear to be attractive, desirable, or pleasurable”? It will be helpful to write students’ responses on the board. Students might say things such as, “It’s my body. I can do what I want with it” or “It’s fine as long as you don’t get caught.” You will refer to these ideas on the board later in the lesson. Why is it important for you to recognize beguiling bad pretending to be good? The following explanation and invitation can help students begin to see how what they will study in this lesson is important in their lives. It can be hard to recognize these deceptive ideas and actions, particularly when we may be influenced by them. Each of us thinks or acts in ways that are not fully aligned with the teachings of Jesus Christ (see Romans 3:23 ). Heavenly Father and Jesus Christ will help us recognize this in ourselves as we seek Their help through the Holy Ghost. As you study today, pay close attention to how the Holy Ghost may be helping you discern truth from error. Camouflaged deceptions Summarize the following paragraph to introduce students to the overall message of Isaiah 5 . In Isaiah 5 , the Lord taught the Israelites about His love for them and the consequences of their sinful choices through the analogy of a vineyard. Even though the Lord tried to help them grow, the Israelites’ sinful choices led them to become “wild grapes” (see Isaiah 5:2 ), a symbol for their corruption and bitter character. Because they chose to “cast away” and despise the Lord and His teachings (see Isaiah 5:24 ), they would be left without the Lord’s help. You could invite students to glance through Isaiah 5:8–23 and count the number of times the Lord used the word “woe” (six times). Explain that “woe” means intense sorrow or suffering. The Lord tried to teach the Israelites that their sinful choices were turning them away from Him and leading to sorrow and suffering. While there are many truths this lesson could focus on, the rest of this lesson will focus on the doctrinal mastery passage Isaiah 5:20 . Isaiah 5:20 is a doctrinal mastery passage. Consider inviting students to consider marking doctrinal mastery passages in a distinctive way, so they can locate them easily. Read Isaiah 5:20 , looking for what brings woe, or sadness and suffering. What did you find? Help students identify a truth, such as If we call evil good and good evil, we will eventually experience sorrow and suffering. You might invite students to consider marking the three pairs in the verse, evil and good , darkness and light , and bitter and sweet . Explain that Isaiah often provided multiple examples to help bring greater clarity to his teachings. How is it that calling evil good and good evil eventually leads to sorrow and suffering? Acknowledging the difficulty in identifying these deceptions can help students feel understood, recognize obstacles, and see their need for God. Refer to the list of “spiritually dangerous ideas and actions” on the board, and ask the following question. What can make it difficult to identify these spiritually dangerous ideas and actions? Think if there are any spiritually dangerous ideas or actions you might see as attractive, desirable, or pleasurable. Jesus Christ is the truth After identifying difficulties, help students see Jesus Christ as the solution. Read John 14:6 , looking for what Jesus said about who He is. What do you think Jesus means when He says that He is the truth? What have Heavenly Father and Jesus Christ given to help us recognize the deceptive ideas and actions we listed earlier? Although this is not a comprehensive list, students might share some things like the following: The Spirit (see Doctrine and Covenants 11:12–13 ) The Light of Christ (see Moroni 7:16–19 ) Prophets (see Doctrine and Covenants 21:1, 4–6 ) Scriptures (see 2 Timothy 3:15–17 ) If you perceive a need in your students, you might read and discuss some of the scriptures provided. The next activity gives students an opportunity to study the Savior’s teachings to help them recognize His truth. Refer students to the list of spiritually dangerous ideas and actions on the board. Display the following instructions. To help us discern truth from error, we can turn to the teachings of Jesus Christ and His prophets. One place we can “find the teachings of Jesus Christ and His prophets” is in For the Strength of Youth: A Guide for Making Choices (“ Make Inspired Choices ,” For the Strength of Youth: A Guide for Making Choices [2022]). Pick one idea or action that is evil pretending to be good or good being portrayed as or labeled evil. Study the For the Strength of Youth guide, looking for the teachings of Jesus Christ and His prophets that can help you choose to follow Jesus Christ instead of the devil’s deceptive messages. Write how the Savior’s teachings correct the false ideas. Invite students to share what they have found. To do so, a student could choose an idea or action from the board. Ask the class to explain how something they learned shows that idea or action as spiritually destructive. For example, if a student chose “It’s fine as long as you don’t get caught,” students might share something they learned in the section “ Truth will make you free ” in the For the Strength of Youth guide, such as the paragraphs that begin “ Living with integrity means that you love truth will all your heart ” or “ Love the truth .” Reflecting on learning Give students an opportunity to reflect on what they have learned by displaying a question such as the following. Write an answer to the following question in your study journal: What have you learned today that can help you recognize the truth and better follow Jesus Christ? You could invite students to share their feelings and testimony by sharing what they wrote. Consider testifying of Jesus Christ and His title as the Truth. Memorize You may want to help students memorize the doctrinal mastery passage and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Isaiah 5:20 is “Woe unto them that call evil good, and good evil.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 116 ---\nGod’s children have been spiritually scattered, and He wants to gather them to the safety of His gospel. Using the imagery of a tree and an ensign, Isaiah prophesied of the gathering of Israel. This lesson can help students feel more motivated to share the gospel with others. Student preparation: Consider giving each student the two self-evaluation questions from the beginning of the lesson and inviting them to ponder how they would answer. Possible Learning Activities How do you feel about sharing the gospel? Consider preparing one of the following and, as they listen, invite students to ponder how they feel about sharing the gospel: An account from a student about when they, or someone they know, shared the gospel (You can ask if a student would be willing to share an experience at this point of the lesson, or you may set this up in advance.) One of your own experiences One of the following stories from Elder Gary E. Stevenson, “ Love, Share, Invite ,” May 2022 Brother Wisan ( pg 86 , or time code 5:40–7:06) 13:3 Mayra ( pg 86 , or time code 8:33–9:42) 13:3 Invite students to ponder how likely they are to share the gospel. It may be helpful to have them answer the following in their study journals: How do you feel about sharing the gospel? Why do you feel the way you do? If students are comfortable, they can express some of their thoughts or feelings to the class. As you study today, seek help through the Holy Ghost to increase your desire to share the gospel. Also seek help with any questions or concerns you may have. Isaiah’s prophecy Consider drawing or displaying something like the following, but do not include the labels. If you would like, invite students to make a similar drawing in their journals. In Isaiah 11 , Isaiah taught by symbolically using the parts of a tree. Read Isaiah 11:1 and label the drawing. (It may be helpful to know that the stem could also be translated stump and rod as a small branch or shoot.) What tools and skills can you use to discover who or what the stem symbolizes? Some possible answers are the chapter heading and footnotes. Help students use these to find the symbolism. For example, footnote 1c leads to the following Doctrine and Covenants verses. Read Doctrine and Covenants 113:1–2 , looking for the inspired answers to what the stem symbolizes. On the board, label the stem or trunk Jesus Christ . Students could also write this in their scriptures next to Isaiah 11:1 . If the Savior is the trunk, what might the part of the tree that was cut down symbolize? A possible answer is that the Savior built a great kingdom or tree through David (the son of Jesse), but they fell into wickedness, divided into kingdoms, and would eventually be conquered (like a tree being cut down). However, the Savior would remember His covenant and help the descendants of David to grow, promising to gather them again. Isaiah then prophesied of the Savior through the Second Coming and Millennium. Read one or two of the following sets of verses, looking for descriptions of the Savior and His influence. Isaiah 11:2–5 . Isaiah 11:6–9 . ( Note : These verses describe the Millennium and how the knowledge of the Lord will affect the world. Both asp and cockatrice refer to venomous snakes.) Isaiah 12:1–6 . Invite students to share phrases they found about the Savior or His influence that motivate them to want to come closer to the Savior, or help others gather to Him. If needed, consider explaining that Isaiah 11:6–9 illustrates the peace the Savior will bring to the world. A prophecy of Joseph Smith Show a picture of Moroni appearing before the young Joseph Smith and explain the following: Moroni quoted Isaiah 11 to Joseph Smith several times (see Joseph Smith—History 1:40, 45–46, 49 ). Isaiah prophesied not only of the Savior in the last days but also of Joseph Smith. You may want to write Joseph Smith next to “rod” in Isaiah 11:1 and “root” in Isaiah 11:10 . (See also Doctrine and Covenants 113:3–6 .) Read Isaiah 11:10–12 , looking for the work the Lord would do through the Prophet Joseph Smith. Listen carefully as students share what they found. If useful, explain the following: The phrase “set his hand again the second time to recover the remnant of his people” ( Isaiah 11:11 ) refers to the latter-day gathering of Israel (see Doctrine and Covenants 137:6 ). An ensign is a flag or banner that an army may gather under or march behind. “ Ensign for the nations” ( Isaiah 11:12 ) refers to the Restoration of The Church of Jesus Christ of Latter-day Saints, including all its ordinances and covenants (see Doctrine and Covenants 45:9 ). Write the following phrase on the board: The Lord’s restored Church is an ensign to gather people to the gospel of Jesus Christ. An ensign for the nations To help students better understand this principle, pass out the handout “ An Ensign for the Nations .” Display the following instructions and invite students to fill them in on the handout individually or in small groups. Open PDF Question 1: Why would others want to gather to the Savior and His Church? On the flag, write several things you know about Jesus Christ and His restored Church that you think would attract others to gather to Him and join His Church. You might include things that are unique to The Church of Jesus Christ of Latter-day Saints (such as the Book of Mormon, modern-day prophets, the priesthood of God, and latter-day temples). Write about how the Lord blesses us through these things. Question 2: Why gather with others to the Lord? Next to the figures gathered around the flag, write some of the blessings we can receive as we gather with others to the Lord. You may think about the advantages of an army gathering together and how it may apply to us, how the various people in your ward or branch strengthen each other, or how Moses 7:18 illustrates some advantages. Question 3: How can we invite others to come to the Savior? Below the figures gathered around the flag, write several ways we can share the gospel of Jesus Christ with others. You might include ways you have tried. After completing the handout, invite students to share what they wrote on the handout and how they feel about what they wrote. If they do not do it naturally, invite them to share how what they learned today could help them feel more motivated to share the gospel.\n\n--- SCRIPTURE: Isaiah 1 ---\n1. ThevisionofIsaiahthe son of Amoz, which he saw concerningJudahand Jerusalem in the days ofUzziah,Jotham,Ahaz,andHezekiah, kings of Judah.\n2. Hear, O heavens, and give ear, O earth: for theLordhath spoken, I have nourished and brought up children, and they haverebelledagainst me.\n3. The ox knoweth his owner, and the ass his masterscrib:butIsrael doth notknow, my people doth not consider.\n4. Ahsinfulnation, people laden with iniquity, seed of evildoers,childrenthat arecorrupters: they have forsaken theLord, they have provoked the Holy One of Israel untoanger, they are gone away backward.\n5. Why should ye bestrickenany more? ye willrevoltmore and more: the whole head is sick, and the whole heartfaint.\n6. From the sole of the foot even unto the headthere isno soundness in it;butwounds, and bruises, and putrifying sores: they have not beenclosed, neither bound up, neithermollifiedwith ointment.\n7. Yourcountryisdesolate, your citiesareburned with fire: your land,strangersdevour it in your presence, andit isdesolate, as overthrown by strangers.\n8. And the daughter of Zion is left as cottage in avineyard, asalodge in garden of cucumbers, as besieged city.\n9. Except theLordof hosts had left unto us very smallremnant, we should have been as Sodom,andwe should have been like unto Gomorrah.\n10. Hear the word of theLord, ye rulers ofSodom; give ear unto the law of our God, ye people of Gomorrah.\n11. To what purposeisthe multitude of yoursacrificesunto me? saith theLord: I am full of the burnt offerings of rams, and the fat of fed beasts; and Idelightnot in the blood of bullocks, or of lambs, or of he goats.\n12. When ye come to appear before me, who hath required this at your hand, to tread my courts?\n13. Bring no morevainoblations; incense is an abomination unto me; the new moons andsabbaths, the calling ofassemblies, I cannotaway with;it isiniquity, even thesolemn meeting.\n14. Your newmoonsand your appointedfeastsmy soul hateth: they are trouble unto me; I amwearyto bearthem.\n15. And when ye spread forth your hands, I will hide mine eyes from you: yea, when ye make manyprayers, I will not hear: your hands are full ofblood.\n16. Washyou, make youclean; put away theevilof your doings from before mine eyes;ceaseto do evil;\n17. Learnto dowell; seekjudgment,relievethe oppressed,judge the fatherless, plead for thewidow.\n18. Come now, and let usreasontogether, saith theLord: though yoursinsbe as scarlet, they shall be aswhiteas snow; though they be red like crimson, they shall be as wool.\n19. If ye bewillingandobedient, ye shall eat thegoodof the land:\n20. But if ye refuse andrebel, ye shall bedevouredwith the sword: for the mouth of theLordhath spokenit.\n21. How is the faithful city become anharlot! it was full ofjudgment; righteousness lodged in it; but now murderers.\n22. Thy silver is becomedross, thy wine mixed with water:\n23. Thyprincesarerebellious, andcompanions of thieves: every one lovethgifts, and followeth after rewards: theyjudge notthe fatherless, neither doth the cause of the widow come unto them.\n24. Therefore saith the Lord, theLordof hosts, the mighty One of Israel, Ah, I will ease me of mineadversaries, and avenge me of mine enemies:\n25. And I willturn my hand uponthee, and purelypurgeaway thy dross, and take away all thy tin:\n26. And I willrestorethy judges as at the first, and thycounsellorsas at the beginning: afterward thou shalt be called, Thecity of righteousness, the faithful city.\n27. Zionshall be redeemed withjudgment, and herconvertswith righteousness.\n28. And the destruction of the transgressors and of the sinnersshall betogether, and they that forsake theLordshall be consumed.\n29. For they shall be ashamed of theoakswhich ye have desired, and ye shall be confounded for the gardens that ye have chosen.\n30. For ye shall be as an oak whose leaf fadeth, and as garden that hath no water.\n31. And the strong shall beas tow, and the maker of it as spark, and they shall bothburntogether, and none shall quenchthem.\n\n--- SCRIPTURE: Isaiah 2 ---\n1. The word thatIsaiahthe son of Amozsawconcerning Judah and Jerusalem.\n2. And it shall come to pass in thelast days,thatthemountainof theLordshouseshall beestablishedin the top of the mountains, and shall be exalted above the hills; and allnationsshall flow unto it.\n3. And many people shall go and say, Come ye, and let usgoup to themountainof theLord, to thehouseof the God of Jacob; and he willteachus of his ways, and we will walk in his paths: for out ofZionshall go forth thelaw, and the word of theLordfrom Jerusalem.\n4. And he shalljudgeamong the nations, and shall rebuke many people: and they shall beat their swords into plowshares, and their spears into pruninghooks: nation shall not lift up sword against nation, neither shall they learnwarany more.\n5. O house of Jacob, come ye, and let uswalkin thelightof theLord.\n6. Therefore thou hast forsakenthy people the house of Jacob, because theybereplenished from the east, andaresoothsayerslike the Philistines, and theyplease themselves inthe children of strangers.\n7. Their land also is full of silver and gold, neitheris there anyend of their treasures; their land is also full of horses, neitheris there anyend of their chariots:\n8. Their land also is full ofidols; theyworshipthe work of their own hands, that which their own fingers have made:\n9. And themean manbowethdown, and the great man humbleth himself: therefore forgive them not.\n10. Enter into the rock, and hide thee in the dust, for fear of theLord, and for the glory of his majesty.\n11. The lofty looks of man shall be humbled, and the haughtiness of men shall be bowed down, and theLordalone shall beexaltedin thatday.\n12. For thedayof theLordof hostsshall beupon everyone that isproudand lofty, and upon everyone that islifted up; and he shall be broughtlow:\n13. And upon all thecedarsof Lebanon,that arehigh and lifted up, and upon all the oaks of Bashan,\n14. And upon all the high mountains, and upon all the hillsthat arelifted up,\n15. And upon every high tower, and upon every fenced wall,\n16. Andupon all the ships of Tarshish, and upon all pleasant pictures.\n17. And the loftiness of man shall be bowed down, and thehaughtinessof men shall be made low: and theLordalone shall be exalted in that day.\n18. And theidolshe shall utterly abolish.\n19. And they shall go into theholesof the rocks, and into the caves of the earth, forfearof theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth.\n20. In that day man shallcasthis idols of silver, and his idols of gold, which they madeeach onefor himself to worship, to the moles and to the bats;\n21. To go into the clefts of the rocks, and into the tops of the ragged rocks, for fear of theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth.\n22. Ceaseye from man, whose breathisin his nostrils: forwhereinis he to be accounted of?\n\n--- SCRIPTURE: Isaiah 3 ---\n1. For, behold, the Lord, theLordof hosts, doth take away fromJerusalemand from Judah the stay and the staff, the whole stay ofbread, and the whole stay of water,\n2. The mighty man, and the man ofwar, the judge, and the prophet, and the prudent, and theancient,\n3. The captain of fifty, and the honourable man, and the counsellor, andthe cunning artificer, and theeloquent orator.\n4. And I will givechildrento betheir princes, and babes shall rule over them.\n5. And the people shall be oppressed, every one by another, and every one by his neighbour: the child shall behave himself proudly against theancient, and the base against the honourable.\n6. When man shall take hold of his brother of the house of his father,saying,Thou hast clothing, be thou our ruler, andletthisruinbeunder thy hand:\n7. In that day shall he swear, saying, I will not bean healer; for in my houseisneither bread nor clothing: make me not ruler of the people.\n8. ForJerusalemis ruined, and Judah isfallen: because their tongue and their doingsareagainst theLord, to provoke the eyes of his glory.\n9. The shew of their countenance doth witness against them; and they declare theirsinasSodom, they hideitnot. Woe unto their soul! for they have rewarded evil unto themselves.\n10. Say ye to therighteous, thatit shall bewellwith him:for they shalleatthe fruit of their doings.\n11. Woe unto thewicked!it shall beillwith him:forthereward of his hands shall be given him.\n12. As formy people, childrenaretheir oppressors, andwomenrule over them. O my people, they whichleadthee causetheeto err, and destroy the way of thy paths.\n13. TheLordstandeth up toplead, and standeth to judge the people.\n14. TheLordwill enter intojudgmentwith theancientsof his people, and theprincesthereof: for ye haveeaten upthe vineyard; thespoilof thepoorisin your houses.\n15. What mean yethatyebeatmy people to pieces, and grind the faces of the poor? saith the LordGodof hosts.\n16. Moreover theLordsaith, Because thedaughtersof Zion arehaughty, andwalkwith stretched forth necks andwantoneyes, walking andmincingasthey go, and making tinkling with their feet:\n17. Therefore the Lord will smite with scab the crown of the head of the daughters of Zion, and theLordwilldiscover their secret parts.\n18. In that day the Lord will take away the bravery oftheirtinkling ornamentsabout their feet,andtheircauls, andtheirroundtires like the moon,\n19. The chains, and the bracelets, and themufflers,\n20. The bonnets, and the ornaments of the legs, and the headbands, and the tablets, and the earrings,\n21. The rings, and nose jewels,\n22. Thechangeable suitsofapparel, and the mantles, and the wimples, and the crisping pins,\n23. Theglasses, and the fine linen, and the hoods, and the veils.\n24. And it shall come to pass,thatinstead of sweet smell there shall be stink; and instead of girdlea rent; and instead of well set hairbaldness; and instead ofa stomachera girding of sackcloth;andburninginstead ofbeauty.\n25. Thymenshall fall by the sword, and thy mighty in the war.\n26. And hergatesshalllamentandmourn; and shebeingdesolateshall sit upon theground.\n\n--- SCRIPTURE: Isaiah 4 ---\n1. And in that daysevenwomen shall take hold of oneman, saying, We will eat our own bread, and wear our own apparel: only let us be called by thyname, to take away ourreproach.\n2. In that day shall thebranchof theLordbebeautifuland glorious, and thefruitof the earthshall beexcellent and comely for them that areescapedof Israel.\n3. And it shall come to pass,that he that isleftinZion, andhe thatremaineth inJerusalem, shall be called holy,evenevery one that iswritten among the livingin Jerusalem:\n4. Whenthe Lord shall havewashedaway the filth of the daughters of Zion, and shall havepurgedthe blood of Jerusalem from the midst thereof by the spirit of judgment, and by the spirit ofburning.\n5. And theLordwill create upon every dwelling place of mountZion, and upon her assemblies, acloudand smoke by day, and the shining of flamingfireby night: for upon all the gloryshall bea defence.\n6. And there shall be tabernacle for shadow in the daytime from the heat, and for place ofrefuge, and for covert from storm and from rain.\n\n--- SCRIPTURE: Isaiah 5 ---\n1. Nowwill Isingto my wellbeloved song of my beloved touching hisvineyard. My wellbeloved hath vineyardina very fruitful hill:\n2. And he fenced it, and gathered out the stones thereof, and planted it with the choicest vine, and built tower in the midst of it, and also made winepress therein: and he looked that it should bring forth grapes, and it brought forth wild grapes.\n3. And now, O inhabitants of Jerusalem, and men of Judah, judge, I pray you, betwixt me and my vineyard.\n4. What could have been done more to my vineyard, that I have not done in it? wherefore, when I looked that it should bring forth grapes, brought it forthwild grapes?\n5. And now go to; I will tell you what I will do to myvineyard: I willtake awaythe hedge thereof, and it shall be eaten up;andbreak down thewallthereof, and it shall be trodden down:\n6. And I will lay it waste: it shall not be pruned, nor digged; but there shall come up briers and thorns: I will also command the clouds that they rain no rain upon it.\n7. For thevineyardof theLordof hostsisthe house of Israel, and the men of Judah his pleasant plant: and he looked forjudgment, but behold oppression; for righteousness, but beholda cry.\n8. Woe unto them thatjoinhouse to house,thatlay field to field, tillthere beno place, that they maybe placed alonein the midst of the earth!\n9. In mine earssaidtheLordof hosts, Of truth many houses shall be desolate,evengreat and fair, without inhabitant.\n10. Yea, ten acres of vineyard shall yield onebath, and the seed of an homer shall yield an ephah.\n11. Woe unto them that rise up early in the morning,thatthey may follow strong drink; that continue until night,tillwineinflame them!\n12. And the harp, and theviol, thetabret, and pipe, and wine, are in their feasts: but theyregardnot theworkof theLord, neither consider the operation of his hands.\n13. Therefore my people are gone intocaptivity, becausethey havenoknowledge: and their honourable menarefamished, and their multitude dried up with thirst.\n14. Therefore hell hath enlarged herself, and opened her mouth without measure: and their glory, and their multitude, and theirpomp, and he that rejoiceth, shall descend into it.\n15. And the mean man shall be brought down, and the mighty man shall be humbled, and the eyes of theloftyshall be humbled:\n16. But theLordof hosts shall be exalted injudgment, and God that isholyshall be sanctified in righteousness.\n17. Then shall the lambs feed after their manner, and the waste places of the fat ones shall strangers eat.\n18. Woe unto them thatdrawiniquity with cords ofvanity, and sinasit were with cart rope:\n19. That say,Lethim makespeed,andhastenhis work, that we mayseeit:and let the counsel of the Holy One of Israel draw nigh and come, that we may knowit!\n20. Woe unto them that callevilgood, and good evil; that putdarknessforlight, and light for darkness; that put bitter for sweet, and sweet for bitter!\n21. Woe untothem that arewisein their owneyes, andprudentin their own sight!\n22. Woe untothem that aremighty todrinkwine, and men of strength to mingle strong drink:\n23. Whichjustifythewickedfor reward, andtakeaway the righteousness of the righteous from him!\n24. Therefore as the fire devoureth thestubble, and the flame consumeth the chaff,sotheirrootshall be as rottenness, and their blossom shall go up as dust: because they have cast away the law of theLordof hosts, and despised the word of the Holy One of Israel.\n25. Therefore is theangerof theLordkindled against his people, and he hathstretchedforth his hand against them, and hath smitten them: and the hills did tremble, and their carcasesweretorn in the midst of the streets. For all this his anger is not turned away, but his handisstretched out still.\n26. And he will lift up anensignto the nations from far, and willhissunto them from theendof the earth: and, behold, they shallcomewith speed swiftly:\n27. None shall be weary nor stumble among them; none shall slumber nor sleep; neither shall the girdle of their loins be loosed, nor the latchet of their shoes be broken:\n28. Whose arrowsaresharp, and all their bows bent, their horses hoofs shall be counted like flint, and their wheels like whirlwind:\n29. Their roaringshall belike lion, they shall roar like younglions: yea, they shall roar, and lay hold of theprey, and shall carryitaway safe, and none shall deliverit.\n30. And in that day they shall roar against them like the roaring of the sea: and ifonelook unto the land, behold darknessandsorrow, and thelightisdarkenedin the heavens thereof.\n\n--- SCRIPTURE: Isaiah 6 ---\n1. Inthe year that king Uzziah died Isawalso theLordsitting upon athrone, high and lifted up, andhis trainfilled the temple.\n2. Above it stood theseraphims:each one had six wings; with twain he covered his face, and with twain he covered his feet, and with twain he did fly.\n3. And one cried unto another, and said, Holy, holy, holy,istheLordof hosts: the whole earthisfull of hisglory.\n4. And thepostsof the door moved at the voice of him that cried, and the house was filled withsmoke.\n5. Then said I, Woeisme! for I amundone; because Iama man ofuncleanlips, and I dwell in the midst of people of unclean lips: for mine eyes haveseentheKing, theLordof hosts.\n6. Then flew one of the seraphims unto me, having livecoalin his hand,whichhe had taken with the tongs from off the altar:\n7. And he laiditupon mymouth, and said, Lo, this hath touched thy lips; and thine iniquity istakenaway, and thy sin purged.\n8. Also I heard the voice of the Lord, saying, Whom shall Isend, and who will go for us? Then said I, HereamI;sendme.\n9. And he said, Go, and tell this people,Hearye indeed, butunderstandnot; and see ye indeed, butperceivenot.\n10. Make theheartof this people fat, and make their ears heavy, andshuttheir eyes; lest they see with their eyes, and hear with their ears, and understand with their heart, and convert, and be healed.\n11. Then said I, Lord,howlong? And he answered, Until the cities be wasted without inhabitant, and the houses without man, and the land be utterly desolate,\n12. And theLordhave removed men far away, andthere bea great forsaking in the midst of the land.\n13. But yet in itshall bea tenth, anditshall return, and shall be eaten: as teil tree, and as an oak, whose substanceisin them, when they casttheir leaves: sothe holy seedshall bethesubstancethereof.\n\n--- SCRIPTURE: Isaiah 7 ---\n1. Andit came to pass in the days of Ahaz the son of Jotham, the son of Uzziah, king of Judah,thatRezinthekingof Syria, andPekahthe son of Remaliah, king of Israel, went up toward Jerusalem to war against it, but could not prevail against it.\n2. And it was told the house of David, saying, Syria is confederate withEphraim. And his heart was moved, and the heart of his people, as the trees of the wood are moved with the wind.\n3. Then said theLordunto Isaiah, Go forth now to meet Ahaz, thou,andShear-jashubthy son, at the end of theconduitof the upper poolinthe highway of the fullers field;\n4. And say unto him,Take heed, and be quiet; fear not, neither be fainthearted for the two tails of these smoking firebrands, for the fierce anger of Rezin with Syria, and of the son of Remaliah.\n5. Because Syria, Ephraim, and the son of Remaliah, have taken evil counsel against thee, saying,\n6. Let us go up against Judah, and vex it, and let usmake breachtherein for us, and set king in the midst of it,eventhe son of Tabeal:\n7. Thus saith the LordGod, It shall not stand, neither shall it come to pass.\n8. For the head of SyriaisDamascus, and the head of DamascusisRezin; and within threescore and five years shallEphraimbe broken, that it be not people.\n9. And the head of EphraimisSamaria, and the head of SamariaisRemaliahs son.Ifye will not believe, surely ye shall not be established.\n10. Moreover theLordspake again unto Ahaz, saying,\n11. Ask thee sign of theLordthy God; ask it either in the depth, or in the height above.\n12. But Ahaz said, I will not ask, neither will ItempttheLord.\n13. And he said, Hear ye now, O house of David;Is ita small thing for you to weary men, but will ye weary my God also?\n14. Therefore the Lord himself shall give you asign;Behold, avirginshall conceive, and bear ason, and shall call his nameImmanuel.\n15. Butter and honeyshall he eat, that he may know to refuse the evil, and choose the good.\n16. Forbeforethe child shall know to refuse theevil, and choose the good, the land that thou abhorrest shall be forsaken of both her kings.\n17. TheLordshall bring upon thee, and upon thy people, and upon thy fathers house, days that have not come, from the day thatEphraimdeparted fromJudah;eventhe king of Assyria.\n18. And it shall come to pass in that day,thattheLordshallhissfor the flythatisin the uttermost part of the rivers of Egypt, and for the bee thatisin the land of Assyria.\n19. And they shall come, and shall rest all of them in the desolate valleys, and in the holes of the rocks, and upon all thorns, and upon all bushes.\n20. In the same day shall the Lordshavewith razor that is hired,namely,by them beyond the river, by the king of Assyria, the head, and the hair of the feet: and it shall also consume the beard.\n21. And it shall come to pass in that day,thataman shall nourish young cow, and two sheep;\n22. And it shall come to pass, for the abundance of milkthattheyshall give he shall eat butter: forbutter and honeyshall every one eat that is left in the land.\n23. And it shall come to pass in that day,thatevery place shall be, where there were thousand vines at thousandsilverlings, it shallevenbe for briers and thorns.\n24. With arrows and with bows shallmencome thither; because all the land shall become briers and thorns.\n25. Andonall hills that shall bedigged with the mattock, there shall not come thither the fear of briers and thorns: but it shall be for the sending forth of oxen, and for the treading oflesser cattle.\n\n--- SCRIPTURE: Isaiah 8 ---\n1. Moreover theLordsaid unto me, Take thee greatroll, andwritein it witha mans penconcerningMaher-shalal-hash-baz.\n2. And I took unto me faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah.\n3. And I went untothe prophetess; and she conceived, and bare son. Then said theLordto me, Call his nameMaher-shalal-hash-baz.\n4. Forbeforethe child shallhaveknowledge to cry, My father, and my mother, the riches of Damascus and the spoil ofSamariashall betakenaway before the king of Assyria.\n5. TheLordspake also unto me again, saying,\n6. Forasmuch as this people refuseth the waters ofShiloahthat go softly, and rejoice inRezinand Remaliahs son;\n7. Now therefore, behold, the Lord bringeth up uponthemthewatersof the river, strong and many,eventhe king ofAssyria, and all his glory: and he shall come up over all his channels, and go over all his banks:\n8. And he shallpass through Judah; he shall overflow and go over, he shall reachevento theneck; and the stretching out of his wings shall fill the breadth of thy land, OImmanuel.\n9. Associate yourselves, O ye people, and ye shall be broken in pieces; and give ear, all ye of far countries: gird yourselves, and ye shall be broken in pieces; gird yourselves, and ye shall be broken in pieces.\n10. Takecounseltogether, and it shall come to nought; speak the word, and it shall not stand: forGodiswith us.\n11. For theLordspake thus to mewith strong hand, and instructed me that I should not walk in the way of this people, saying,\n12. Say ye not, Aconfederacy, to allthem towhom this people shall say, A confederacy; neither fear ye their fear, nor be afraid.\n13. Sanctify theLordof hostshimself; andlethimbeyour fear, andlethimbeyour dread.\n14. And he shall be for asanctuary; but for astoneofstumblingand for arockofoffenceto both the houses of Israel, for gin and for asnareto the inhabitants of Jerusalem.\n15. And many among them shall stumble, and fall, and be broken, and be snared, and be taken.\n16. Bindup the testimony,sealthelawamong my disciples.\n17. And I will wait upon theLord, thathidethhisfacefrom the house of Jacob, and I will look for him.\n18. Behold, I and the children whom theLordhath given meareforsignsand for wonders in Israel from theLordof hosts, which dwelleth in mount Zion.\n19. And when they shall say unto you, Seek unto them that havefamiliar spirits, and untowizardsthat peep, and that mutter: should not people seek unto their God?forthe living to the dead?\n20. To thelawand to the testimony: iftheyspeak not according to this word,it isbecausethere isnolightin them.\n21. Andtheyshall pass through it, hardly bestead and hungry: and it shall come to pass, that when they shall be hungry, they shall fret themselves, andcursetheir king and their God, and look upward.\n22. And they shall look unto the earth; and behold trouble anddarkness,dimness of anguish; andthey shall bedriven to darkness.\n\n--- SCRIPTURE: Isaiah 9 ---\n1. Neverthelessthe dimnessshallnotbesuch aswasin her vexation,whenat the first he lightly afflicted the land ofZebulunand the land of Naphtali, and afterward did more grievously afflicther bythe way of the sea, beyond Jordan, in Galilee of the nations.\n2. The people that walked indarknesshave seen greatlight: they that dwell in the land of the shadow of death, upon them hath the light shined.\n3. Thou hastmultipliedthenation,andnot increased the joy: they joy before thee according to the joy in harvest,andasmenrejoicewhen they divide the spoil.\n4. For thou hast broken theyokeof hisburden, and the staff of hisshoulder, therodof his oppressor, asinthe day ofMidian.\n5. Forevery battle of the warrioriswith confused noise, and garments rolled in blood; butthisshall be withburningandfuel of fire.\n6. For unto us achildisborn, unto us asonis given: and thegovernmentshall be upon his shoulder: and his name shall be called Wonderful,Counsellor, ThemightyGod, TheeverlastingFather, The Prince ofPeace.\n7. Of the increase ofhisgovernmentand peacethere shall benoend, upon the throne ofDavid, and upon his kingdom, to order it, and to establish it with judgment and withjusticefrom henceforth even for ever. Thezealof theLordof hosts will perform this.\n8. The Lord sent word into Jacob, and it hath lighted uponIsrael.\n9. And all the people shall know,evenEphraim and the inhabitant of Samaria, that say in theprideand stoutness of heart,\n10. The bricks are fallen down, but we will build with hewn stones: the sycomores are cut down, but we will changethem intocedars.\n11. Therefore theLordshall set up the adversaries ofRezinagainst him, and join his enemies together;\n12. The Syriansbefore, and the Philistinesbehind; and they shall devour Israel with open mouth. For all this hisangeris not turned away, buthishandisstretchedout still.\n13. For the peopleturneth notunto him that smiteth them, neither do theyseektheLordof hosts.\n14. Therefore theLordwill cut off from Israel head and tail, branch and rush, in one day.\n15. Theancient and honourable, heisthe head; and theprophetthat teacheth lies, heisthe tail.\n16. For theleadersof this people causethemto err; andthey that areled of themaredestroyed.\n17. Therefore the Lord shall have no joy in their young men, neither shall have mercy on their fatherless and widows: for every oneisanhypocriteand an evildoer, and every mouthspeakethfolly. For all this his anger is not turned away, but his handisstretched out still.\n18. For wickedness burneth as the fire: it shall devour the briers andthorns, and shall kindle in thethicketsof the forest, and they shall mount uplikethe lifting up of smoke.\n19. Through the wrath of theLordof hosts is the land darkened, andthe people shall be as the fuel of the fire: no man shallsparehisbrother.\n20. And he shall snatch on the right hand, and be hungry; and he shall eat on the left hand, and they shall not be satisfied: they shalleatevery man thefleshof his own arm:\n21. Manasseh, Ephraim; and Ephraim, Manasseh:andthey togethershall beagainst Judah. For all this his anger is not turned away, but his handisstretched out still.\n\n--- SCRIPTURE: Isaiah 10 ---\n1. Woeunto them that decreeunrighteousdecrees, and that write grievousnesswhichthey have prescribed;\n2. To turn aside the needy fromjudgment, and to take away the right from thepoorof my people, that widows may be their prey, andthatthey may rob the fatherless!\n3. And what will ye do in the day ofvisitation, and in the desolationwhichshall come from far? to whom will ye flee for help? and where will ye leave your glory?\n4. Without me they shall bow down under the prisoners, and they shall fall under the slain. For all this his anger is not turned away, but his handisstretched out still.\n5. OAssyrian, the rod of mine anger, and the staff in their hand is mine indignation.\n6. I will send him against anhypocriticalnation, and against the people of my wrath will I give him charge, to take the spoil, and to take the prey, and to tread them down like the mire of the streets.\n7. Howbeit he meaneth not so, neitherdothhis heart think so; butit isin his heart to destroy and cut off nations not few.\n8. For he saith,Arenot my princes altogether kings?\n9. Isnot Calno as Carchemish?isnot Hamath as Arpad?isnot Samaria as Damascus?\n10. As my hand hath found the kingdoms of the idols, and whose graven images did excel them of Jerusalem and of Samaria;\n11. Shall I not, as I have done unto Samaria and her idols, so do to Jerusalem and her idols?\n12. Wherefore it shall come to pass,thatwhen the Lord hath performed his whole work upon mount Zion and on Jerusalem, I willpunishthe fruitof the stout heart of the king ofAssyria, and the glory of his high looks.\n13. For he saith, By thestrengthof my hand I have doneit,and by my wisdom; for I am prudent: and I have removed the bounds of the people, and have robbed their treasures, and I have put down the inhabitants like valiantman:\n14. And my hand hath found as nest the riches of the people: and as one gathereth eggsthat areleft, have I gathered all the earth; and there was none that moved the wing, or opened the mouth, or peeped.\n15. Shallthe axeboastitself against him that heweth therewith?orshall the saw magnify itself against him thatshakethit? as if the rod should shakeitselfagainst themthat lift it up,oras if the staff should lift upitself, as if it wereno wood.\n16. Therefore shall the Lord, the Lord of hosts, send among hisfatones leanness; and underhisglory he shall kindle burning like the burning of fire.\n17. And the light of Israel shall be for fire, and his Holy One for flame: and it shall burn and devour histhornsand his briers in one day;\n18. And shall consume the glory of his forest, and of his fruitful field, bothsoul and body: and they shall be as when standardbearer fainteth.\n19. And the rest of the trees of his forest shall be few, that child may write them.\n20. And it shall come to pass inthat day,thatthe remnant of Israel, and such as areescapedof the house of Jacob, shall no more againstay uponhim that smote them; but shall stay upon theLord, the Holy One of Israel, in truth.\n21. Theremnantshallreturn,eventhe remnant of Jacob, unto the mighty God.\n22. For though thy people Israel be as thesandof the sea,yeta remnant of them shallreturn:theconsumptiondecreedshall overflow with righteousness.\n23. For the LordGodof hosts shallmake consumption, even determined, in the midst of all the land.\n24. Therefore thus saith the LordGodof hosts, O my people that dwellest in Zion, be not afraid of the Assyrian: he shallsmitethee with rod, and shall lift up his staff against thee, after the manner ofEgypt.\n25. For yet very littlewhile, and theindignationshall cease, and mine anger in their destruction.\n26. And theLordof hosts shall stir up scourge for him according to the slaughter ofMidianat the rock ofOreb: andashisrodwasupon the sea, so shall he lift it up after the manner ofEgypt.\n27. And it shall come to pass in that day,thathisburdenshall be taken away from off thy shoulder, and his yoke from off thy neck, and theyokeshall be destroyed because of theanointing.\n28. Heis come to Aiath, he is passed to Migron; at Michmash he hath laid up his carriages:\n29. They are gone over the passage: they have taken up their lodging at Geba; Ramah is afraid; Gibeah of Saul is fled.\n30. Lift up thy voice, O daughter of Gallim: cause it to be heard unto Laish, O poor Anathoth.\n31. Madmenah is removed; the inhabitants of Gebim gather themselves to flee.\n32. As yet shall he remain at Nob that day: he shall shake his handagainstthe mount of the daughter of Zion, the hill of Jerusalem.\n33. Behold, the Lord, theLordof hosts, shall lop the bough withterror: and the high ones of statureshall behewn down, and thehaughtyshall be humbled.\n34. And he shall cut down thethicketsof the forest with iron, and Lebanon shall fallbya mighty one.\n\n--- SCRIPTURE: Isaiah 11 ---\n1. Andthere shall come forth arodout of thestemofJesse, and aBranchshall grow out of his roots:\n2. And thespiritof theLordshall rest upon him, the spirit ofwisdomandunderstanding, the spirit ofcounseland might, the spirit of knowledge and of the fear of theLord;\n3. And shall make him of quick understanding in the fear of theLord: and he shall notjudgeafterthe sight of his eyes, neither reprove after the hearing of his ears:\n4. But with righteousness shallhejudgethe poor, andreprove with equityfor themeekof the earth: and he shallsmitethe earth with the rod of his mouth, and with thebreathof his lips shall heslaythe wicked.\n5. And righteousness shall be thegirdleof his loins, and faithfulness the girdle of hisreins.\n6. Thewolfalso shall dwell with the lamb, and the leopard shall lie down with the kid; and the calf and the young lion and the fatling together; and little child shall lead them.\n7. And the cow and the bear shall feed; their young ones shall lie down together: and the lion shall eat straw like the ox.\n8. And the sucking child shall play on the hole ofthe asp, and the weaned child shall put his hand on thecockatriceden.\n9. They shall nothurtnordestroyin all my holymountain: for theearthshall be full of theknowledgeof theLord, as the waters cover the sea.\n10. And inthat daythere shall be aroot of Jesse, which shall stand for anensignof the people;to itshall theGentilesseek: and hisrestshall be glorious.\n11. And it shall come to pass in that day,thatthe Lord shall set his hand again thesecondtime torecovertheremnantof his people, which shall be left, from Assyria, and from Egypt, and from Pathros, and from Cush, and from Elam, and from Shinar, and from Hamath, and from theislandsof the sea.\n12. And he shall set up anensignfor the nations, and shall assemble the outcasts of Israel, and gather together the dispersed of Judah from the four corners of the earth.\n13. The envy also of Ephraim shall depart, and the adversaries of Judah shall be cut off: Ephraim shall notenvyJudah, and Judah shall not vex Ephraim.\n14. But they shallflyupon theshouldersof the Philistines toward the west;they shall spoilthem of the east together: they shall lay their hand upon Edom and Moab; and the children of Ammon shall obey them.\n15. And theLordshall utterlydestroythe tongue of theEgyptiansea; and with his mighty wind shall he shake his hand over the river, and shall smite it in the seven streams, and makemengo over dryshod.\n16. And there shall beanhighwayfor the remnant of his people, which shall be left, from Assyria; like as it was to Israel in the day that he came up out of the land of Egypt.\n\n--- SCRIPTURE: Isaiah 12 ---\n1. Andin that daythou shalt say,OLord, I will praise thee: though thou wast angry with me, thine anger is turned away, and thou comfortedst me.\n2. Behold, Godismy salvation; I will trust, and not be afraid: for theLordJehovahismystrengthandmysong; he also is become mysalvation.\n3. Therefore withjoyshall ye draw water out of the wells of salvation.\n4. And in that day shall ye say,PraisetheLord,call uponhis name, declare his doings among the people, make mention that his name is exalted.\n5. Singunto theLord; for he hath done excellent things: thisisknown in all the earth.\n6. Cry out and shout, thouinhabitantof Zion: for greatisthe Holy One of Israel in themidstof thee.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "",
      "content": "Even if this is your first time reading the book of Isaiah, you might find passages that sound familiar. That’s because, of all the Old Testament prophets, Isaiah is the one most often quoted in other books of scripture, including by the Savior Himself. Isaiah’s words also appear often in hymns and other sacred music.\nWhy is Isaiah quoted so often? Surely one reason is that Isaiah had a gift for expressing the word of God in vivid, memorable language. But it’s more than that. Isaiah has inspired prophets for generations because the truths he taught transcended his own generation (between 740 and 701 BC). He wrote of God’s great work of redemption, which is much bigger than one nation or one time period. From Isaiah, Nephi learned that he and his people, though separated from the rest of Israel, were still part of God’s covenant people. In Isaiah, New Testament writers found prophecies about the Messiah that were fulfilled right before their eyes. And in Isaiah, Joseph Smith found inspiration for the latter-day work of gathering Israel and building Zion. When you read Isaiah, what will you find?\nFor more about Isaiah and his writings, see “\nIsaiah\n” in the Bible Dictionary. For information about the time when Isaiah lived, see\n2 Kings 15–20\nand\n2 Chronicles 26–32\n.\nIdeas for Learning at Home and at Church\nIsaiah 1–12\nThe words of Isaiah will all be fulfilled.\nThe Savior taught that “all things that [Isaiah] spake have been and shall be, even according to the words which he spake” (\n3 Nephi 23:3\n). As you study the book of Isaiah, consider making a chart of prophecies with headings like these:\nIsaiah’s day\n,\nThe Savior’s mortal ministry\n, and\nThe latter days\n. Note that many of Isaiah’s prophecies are fulfilled in more than one way (see Bible Dictionary, “\nIsaiah\n”).\nPresident Dallin H. Oaks taught: “The book of Isaiah contains numerous prophecies that seem to have multiple fulfillments. One seems to involve the people of Isaiah’s day or the circumstances of the next generation. Another meaning, often symbolic, seems to refer to events in the meridian of time, when Jerusalem was destroyed and her people scattered after the crucifixion of the Son of God. Still another meaning or fulfillment of the same prophecy seems to relate to the events attending the Second Coming of the Savior. The fact that many of these prophecies can have multiple meanings underscores the importance of our seeking revelation from the Holy Ghost to help us interpret them” (“\nScripture Reading and Revelation\n,”\nEnsign\n, Jan. 1995, 8).\nUnderstanding Isaiah.\nThe Savior said, “Search these things diligently; for great are the words of Isaiah” (\n3 Nephi 23:1\n; see also\nverses 2–3\n). Yet to many, Isaiah can be difficult to understand. The following ideas might help:\nPonder the symbols and metaphors Isaiah used.\nAsk yourself, “What am I learning about Jesus Christ?” (see\n1 Nephi 19:23\n).\nLook for topics that feel relevant to our time.\nUse study helps, such as a dictionary, the footnotes, chapter headings, and the\nGuide to the Scriptures\n.\nIsaiah 1\n;\n3–5\nProphets warn about sin and promise hope through repentance.\nLike prophets in all times, Isaiah continually warned the people about their spiritual condition. As you read\nIsaiah 1\n;\n3\n;\n5\n, look for phrases that describe how the people were doing spiritually (see, for example,\nIsaiah 1:2–4, 21–23\n;\n3:9, 16–17\n;\n5:11–12, 20–23\n). What similar problems do you see in our time? You might also look for verses that warn about the consequences of the Israelites’ spiritual condition (such as\nIsaiah 1:7\n;\n3:17–26\n;\n5:5–7, 13–15\n).\nIn addition to warnings, Isaiah gave messages of hope for redemption through the Savior (see, for example,\nIsaiah 1:16–19, 25–27\n;\n3:10\n;\n4\n). What do you learn about the Lord from these messages? How is the Lord’s message in these verses different from what Satan wants us to believe?\nLike Isaiah, prophets today warn us about sin and its consequences, and they provide messages of hope through Jesus Christ. What examples can you think of? You might want to review a message from a past general conference, looking for such warnings and promises.\nIsaiah 2\n;\n4\n;\n11–12\nGod will do a great work in the latter days.\nMany of Isaiah’s prophecies have specific meaning for our day. To find them, look for future-tense verbs (such as “shall be” or “shall go”). For example, look for these verbs as you read\nIsaiah 2\n;\n4\n;\n11–12\n. You might even try replacing them with present-tense verbs (like\nis\nor\nis going\n). Which prophecies are especially inspiring to you? What do you learn from these prophecies about Zion, building temples, and gathering Israel?\nIsaiah 2:2–3\nis especially relevant for Latter-day Saints. How are these prophecies being fulfilled? What do you learn about the Lord’s “ways” and “paths” in His house? (\nverse 3\n).\nSee also\nIsaiah 5:26\n; “\nHigh on the Mountain Top\n,”\nHymns\n, no. 5.\nIsaiah 6\nProphets are called by God.\nIn\nIsaiah 6\n, Isaiah recounted his call to be a prophet. As you read this chapter, what impresses you about Isaiah’s experience? How does this chapter influence the way you think about the Lord, His prophets, and the work they are called to do?\n“For unto us a child is born, unto us a son is given” (\nIsaiah 9:6\n).\nIsaiah 7–9\nGod promised to send Jesus Christ to be my Savior.\nDuring Isaiah’s ministry, Israel formed an alliance with Syria to defend itself against Assyria. Israel and Syria wanted to force Ahaz, the king of Judah, to join them. But Isaiah prophesied that the alliance would fail and counseled Ahaz to trust in the Lord (\nIsaiah 7:7–9\n;\n8:12–13\n).\nWhile Isaiah counseled Ahaz, he made several well-known prophecies, such as those found in\nIsaiah 7:14\n;\n8:13–14\n;\n9:2, 6–7\n. Whatever these prophecies meant to Ahaz, they clearly apply to Jesus Christ (see also\nMatthew 1:21–23\n;\n4:16\n;\n21:44\n;\nLuke 1:31–33\n). Why is “Immanuel” a good title for the Savior? (see\nMatthew 1:23\n). How has He been a “Counsellor” or “Prince of Peace” to you? (\nIsaiah 9:7\n). What else do you learn about the Savior from these verses?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 1:2–4, 16–19\nBecause of Jesus Christ, I can repent and be clean.\nIn\nIsaiah 1:2–4\n, you and your children could find reasons that the Lord was not happy with the people. Note the comparison with animals in\nverse 3\n—who is our “master”? How do we show that we know Him?\nTo visualize\nIsaiah 1:16–18\n, you and your children could look at something bright red and something pure white. Or maybe you could work together to wash something. How do we become unclean spiritually? How does Jesus help us become clean? What do we learn about the Savior from these verses? Share with your children how you feel about Him and what He has done for you.\nIsaiah 2:2–4\nIn the temple, I learn about Jesus Christ.\nIsaiah foresaw a time when “the mountain of the Lord’s house” would attract people from “all nations” (\nIsaiah 2:2\n). How can you help your children feel excited about going to the Lord’s house? You could invite them to draw a picture of their home. Then read together\nIsaiah 2:2\n, and invite them to draw a picture of “the Lord’s house,” which is a temple. Read\nIsaiah 2:3\ntogether. Invite them to add to their pictures many people coming to the temple, including their families.\nYou could also read\nIsaiah 2:2–3\ntogether and identify something that inspires you and your children to go to the temple. Then, after reading\nIsaiah 2:4\ntogether, you could discuss how the temple brings them peace. Consider singing a song about the temple, such as “\nI Love to See the Temple\n” (\nChildren’s Songbook\n, 95). Help your children find words in the song that teach what the temple is and what we do there.\nSalt Lake Temple\nIsaiah 7:14\n;\n9:6–7\nJesus Christ came to earth to be my Savior.\nTo introduce Isaiah’s prophecies of Christ, you and your children could talk about titles of people, like president, bishop, or teacher. What do these titles tell us about these people? Help your children find titles of Jesus Christ in\nIsaiah 7:14\nand\n9:6–7\n(see also this week’s activity page). What do each of these titles teach about Him? What else do we learn about Jesus Christ from these verses?\nYou could also share with your children “\nIsaiah the Prophet\n” (in\nOld Testament Stories\n, 150–51). Pause periodically to ask what Isaiah knew about Jesus Christ many years before He was born. You can then use\nMatthew 1:21–23\n;\nLuke 1:31–33\nto talk about how Isaiah’s prophecies in\nIsaiah 7:14\n;\n9:6–7\nwere fulfilled.\n1:18\nIsaiah the Prophet\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 38: Lesson 113: Lesson 113—Introduction to IsaiahThis lesson can help students feel motivated to learn about Jesus Christ through studying Isaiah.; Lesson 114: Lesson 114—Isaiah 1This lesson can help students feel confident that the Savior can cleanse them from their sins....",
      "content": "\n--- Lesson 113 ---\nThe prophet Isaiah had the very important responsibility to teach about redemption through Jesus Christ. This message was intended for the people in Isaiah’s time, as well as for us in our time. It is worth the effort to diligently study Isaiah’s teachings about Jesus Christ. This lesson can help students feel motivated to learn about Jesus Christ through studying Isaiah. Student preparation: Consider inviting students to come to class prepared to share a significant fact about Isaiah. They could look up Isaiah in the Bible Dictionary or Guide to the Scriptures. Possible Learning Activities A book recommendation Consider beginning class by displaying the following statements and inviting students to put them in order from most likely to least likely to persuade them to read a certain book. Looks very interesting Recommended by a family member or friend Assigned for a class at school Has great online reviews You might invite a few students to share what their top reason was and why. Read 3 Nephi 23:1–3 , looking for what book the Savior invited us to study. What thoughts do you have about the Savior’s commandment to search the words of Isaiah diligently? How might the Savior’s commandment influence how you approach your study of Isaiah? You might ask students to demonstrate their confidence in their ability to study the words of Isaiah diligently. One way to do this is to label one wall of the classroom as “very confident” and another wall as “not very confident.” Invite students to stand in between the walls according to their confidence level. Willing students could explain their level of confidence. Share with students that the Holy Ghost can help them gain confidence that the teachings of Isaiah can help them come closer to Jesus Christ. What is helpful to know about the prophet Isaiah? To help students gain some understanding about the prophet Isaiah, consider displaying the infographic “ The Kingdoms of Israel and Judah at a Glance .” Invite students to locate Isaiah. You might ask students to find answers to the following questions in the infographic: What kingdom did Isaiah live in? (Judah) What other prophets preached around the same time as Isaiah? (Micah, Hosea, Jonah) What significant event happened about a century after Isaiah prophesied it? (Judah was taken captive by Babylon) For more information, see entries for “Isaiah” in the Bible Dictionary or Guide to the Scriptures . You could invite students to share anything else they learned about Isaiah in their student preparation. Read or summarize the following paragraph. During his life, the prophet Isaiah preached to people who had turned away from faith in Jehovah (Jesus Christ). Isaiah’s message to them is reflected in his own name which means, “The Lord is salvation.” Isaiah’s teachings also apply to other periods when people would turn away from Jesus Christ—such as the time of Christ and the present day, as we prepare for His Second Coming. Isaiah’s words can help us believe more fully in Jesus Christ Students might be interested to know that “Jesus quoted Isaiah more frequently than He quoted any other prophet. Isaiah is also quoted frequently by Peter, John, and Paul in the New Testament. The Book of Mormon and the Doctrine and Covenants contain more quotes from Isaiah than from any other prophet and provide much help in interpreting Isaiah” (Guide to the Scriptures, “ Isaiah ,” Gospel Library). Read 1 Nephi 19:23 , looking for why Nephi read the words of Isaiah to his brothers. What did you find? If students do not point it out, help them understand this truth: Studying the words of Isaiah can help us believe more fully in Jesus Christ. This could be a good opportunity for students to reflect on the value of coming to know Jesus Christ better through Isaiah’s words. One way you could do this is to invite students to complete the following sentence in their journals: “Believing more deeply in Jesus Christ could impact my life by …” Once students have had a chance to write, you might invite volunteers to share what they wrote with the class. Remember to express appreciation for each student who shares. Alternatively, rather than having them write in journals, you could invite students to turn to a partner and share their thoughts. Names and titles of Jesus Christ Help students understand that one of the ways Isaiah leads us to believe more fully in Jesus Christ is by teaching about His titles and roles. One way to study these titles and roles is to use a diagram. You could draw the following diagram on the board. Or, organize students into small groups and invite them to draw it on a piece of paper. Write “Jesus Christ” in the center circle. Students could then be invited to write the titles and roles of Jesus Christ that they discover in the other circles. Read the following verses and identify and consider marking the titles or roles of Jesus Christ. Isaiah 7:14 Isaiah 9:6–7 Isaiah 33:22 Isaiah 40:28 After students have read, you could display several pictures of Jesus Christ selected from the Church media library. Students could then share what titles or roles they see being fulfilled in the image. Consider inviting group members to select a title or role and learn more about it by using footnotes or looking up “Jesus Christ” in the Guide to the Scriptures or Topical Guide . You could invite students to add to the diagram by creating circles branching out from the title or role they focused on. They could list insights they learned about that title or role. (Note: this activity will be referred to in Lesson 133: “Assess Your Learning 8 .”) You might invite them to share what they learn about the Savior with their group. Why do you need the Savior to fulfill one or more of these roles in your life? How have you seen the Savior fulfill one of these roles in your life or the life of someone you know?\n\n\n--- Lesson 114 ---\nEven though we all sin and need forgiveness, sometimes we may believe we cannot be forgiven. Our Savior’s message is clear: “though your sins be as scarlet, they shall be as white as snow” ( Isaiah 1:18 ). This lesson can help students feel confident that the Savior can cleanse them from their sins. Student preparation: Invite students to read the doctrinal mastery passage Isaiah 1:18 and look for the imagery that Isaiah used. Encourage students to ponder and prepare to share what the passage means to them. Students could also practice memorizing the key scripture phrase: “though your sins be as scarlet, they shall be as white as snow” ( Isaiah 1:18 ). Possible Learning Activities The stain of sin Consider beginning class by displaying the following image or an article of stained clothing. Think about times when you had a stain on your clothing that would not come out. How might our sins be compared to stains? What are some reasons people might think they cannot be cleansed of their sins? You might want to display the following prompt, so students can reflect on their feelings. Reflect on which of the following statements you relate with most. You might ask yourself why you feel that way. I am confident the Savior can cleanse me of all my sins. I believe the Savior can cleanse me of some of my sins, but not all of them. I believe the Savior can cleanse other people’s sins, but not mine. I do not believe the Savior can cleanse sins. One of the many roles of the Holy Ghost is to testify of Jesus Christ (see 3 Nephi 28:11 ). As you study Isaiah 1 , pay attention to what Heavenly Father would have you learn through the Holy Ghost about Jesus Christ and His power to cleanse sins. A sinful nation Read Isaiah 1:2–4 , looking for the spiritual condition of the Israelites. Invite students to report what they find. The following can help students learn important skills for studying Isaiah. As you study Isaiah’s teachings, it is helpful to understand that he often recorded the Lord’s words in a poetic form called parallelism . Parallelism occurs when a writer expresses an idea and then repeats or contrasts the idea using different words. For example, find the related phrases in verse 2 . You could help students identify the combined phrases “Hear, O heavens” and “give ear, O earth” ( Isaiah 1:2 ). This is an example of parallelism. Isaiah also used imagery to illustrate his teachings. For example, read verse 3 , looking for the different images Isaiah used to teach the Israelites. You could ask students what Isaiah taught the Israelites by using the images of an ox and donkey. If needed, explain that unlike an ox and donkey, the Israelites did not recognize their Master. Consider summarizing verses 5–15 by sharing the following paragraph. The Lord warned the Israelites that their sins were having negative effects on them (see Isaiah 1:5–9 ). He also explained that He was not pleased with their religious acts of worship because they were being offered without sincerity (see Isaiah 1:10–15 ). From scarlet to white Read Isaiah 1:16–17 , looking for the Lord’s invitations to the people. What did the Lord invite them to do? Read Isaiah 1:18 , looking for the Lord’s promise as we repent. Please note that Isaiah used both parallelism and imagery to illustrate this promise. Isaiah 1:18 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. To help students better understand the imagery used in verse 18 , consider displaying the following images. Open PDF Open PDF What can the images of scarlet and crimson teach us about sin? Sister Sharon Eubank, formerly of the Relief Society General Presidency, explained: 11:29 The scarlet dye of the Old Testament was not only colorful but also colorfast, meaning that its vivid color stuck to the wool and would not fade no matter how many times it was washed. Satan wields this reasoning like a club: white wool stained scarlet can never go back to being white. But Jesus Christ declares, “My ways [are] higher than your ways,” and the miracle of His grace is that when we repent of our sins, His scarlet blood returns us to purity. It isn’t logical, but it is nevertheless true. (“ Christ: The Light That Shines in Darkness ,” Ensign or Liahona , May 2019, 75) What can the images of snow and wool teach us about the Savior’s promise as we repent? How might you summarize verses 16–18 into a statement of truth? Though students may use different words, help them identify the following truth: If we sincerely repent, Jesus Christ will cleanse us from our sins. What the Savior experienced so we can repent The following scriptures can help students reflect on what the Savior experienced so they can be cleansed from their sins. Consider organizing students into pairs. Each pair could read the following scriptures and discuss what they learned with each other. The accompanying questions could help. Willing students could then share with the class. Read Alma 7:13–14 and Doctrine and Covenants 19:16–19 , looking for what the Savior experienced so you can repent and be cleansed from your sins. What did you find? What did you learn about Heavenly Father and Jesus Christ from these verses that could help someone choose to repent? To help students feel that they can be cleansed by the Savior, consider showing a video, such as “ There Is No Limit to God’s Love ” (from time codes 0:00 to 4:54). This video is available at ChurchofJesusChrist.org . Students could ponder how the girl in the video felt because of her sins and evidence of the truth taught in Isaiah 1:18 . You could then invite students to share what they found. 5:37 One way to invite the Holy Ghost is to give students opportunities to share feelings, testimonies, and experiences. The following question is one way students can do this. Consider inviting students to respond to the question first in their journal, and then willing students can share what they wrote with the class. As students share, remind them not to share names or anything too personal. What have you felt about Jesus Christ and His ability to cleanse you from sin? Consider concluding with your feelings about the Savior and His power to cleanse us when we repent. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Isaiah 1:18 is “Though your sins be as scarlet, they shall be as white as snow.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 115 ---\nThrough the prophet Isaiah, the Lord warned Israel against their sinful choices, including calling “evil good, and good evil” ( Isaiah 5:20 ). Today, there are many destructive ideas and practices that appear to be good. This lesson can increase students’ ability to discern between good and evil. Student preparation: Invite students to come to class prepared to share an example of something that was assumed to be harmless, or even good, that eventually was shown to be harmful. Possible Learning Activities Spiritually dangerous ideas and actions Consider beginning class by displaying a picture of a camouflaged cheetah, like the one at the start of this lesson. Then, you could ask the following question and display the statement by Elder David A. Bednar. What makes a cheetah dangerous to its prey? Elder David A. Bednar of the Quorum of the Twelve Apostles compared cheetahs to dangerous ideas and actions. 15:59 To me, cheetahs are sleek, alluring, and captivating creatures. A cheetah’s yellowish-tan to greyish-white coat with black spots acts as a beautiful disguise that makes these animals almost invisible as they stalk their prey in the African grasslands. In a similar way, spiritually dangerous ideas and actions frequently can appear to be attractive, desirable, or pleasurable. Thus, in our contemporary world, each of us needs to be aware of beguiling bad that pretends to be good. (“ Watchful unto Prayer Continually ,” Ensign or Liahona , Nov. 2019, 33) What are some examples of “spiritually dangerous ideas and actions” that “can appear to be attractive, desirable, or pleasurable”? It will be helpful to write students’ responses on the board. Students might say things such as, “It’s my body. I can do what I want with it” or “It’s fine as long as you don’t get caught.” You will refer to these ideas on the board later in the lesson. Why is it important for you to recognize beguiling bad pretending to be good? The following explanation and invitation can help students begin to see how what they will study in this lesson is important in their lives. It can be hard to recognize these deceptive ideas and actions, particularly when we may be influenced by them. Each of us thinks or acts in ways that are not fully aligned with the teachings of Jesus Christ (see Romans 3:23 ). Heavenly Father and Jesus Christ will help us recognize this in ourselves as we seek Their help through the Holy Ghost. As you study today, pay close attention to how the Holy Ghost may be helping you discern truth from error. Camouflaged deceptions Summarize the following paragraph to introduce students to the overall message of Isaiah 5 . In Isaiah 5 , the Lord taught the Israelites about His love for them and the consequences of their sinful choices through the analogy of a vineyard. Even though the Lord tried to help them grow, the Israelites’ sinful choices led them to become “wild grapes” (see Isaiah 5:2 ), a symbol for their corruption and bitter character. Because they chose to “cast away” and despise the Lord and His teachings (see Isaiah 5:24 ), they would be left without the Lord’s help. You could invite students to glance through Isaiah 5:8–23 and count the number of times the Lord used the word “woe” (six times). Explain that “woe” means intense sorrow or suffering. The Lord tried to teach the Israelites that their sinful choices were turning them away from Him and leading to sorrow and suffering. While there are many truths this lesson could focus on, the rest of this lesson will focus on the doctrinal mastery passage Isaiah 5:20 . Isaiah 5:20 is a doctrinal mastery passage. Consider inviting students to consider marking doctrinal mastery passages in a distinctive way, so they can locate them easily. Read Isaiah 5:20 , looking for what brings woe, or sadness and suffering. What did you find? Help students identify a truth, such as If we call evil good and good evil, we will eventually experience sorrow and suffering. You might invite students to consider marking the three pairs in the verse, evil and good , darkness and light , and bitter and sweet . Explain that Isaiah often provided multiple examples to help bring greater clarity to his teachings. How is it that calling evil good and good evil eventually leads to sorrow and suffering? Acknowledging the difficulty in identifying these deceptions can help students feel understood, recognize obstacles, and see their need for God. Refer to the list of “spiritually dangerous ideas and actions” on the board, and ask the following question. What can make it difficult to identify these spiritually dangerous ideas and actions? Think if there are any spiritually dangerous ideas or actions you might see as attractive, desirable, or pleasurable. Jesus Christ is the truth After identifying difficulties, help students see Jesus Christ as the solution. Read John 14:6 , looking for what Jesus said about who He is. What do you think Jesus means when He says that He is the truth? What have Heavenly Father and Jesus Christ given to help us recognize the deceptive ideas and actions we listed earlier? Although this is not a comprehensive list, students might share some things like the following: The Spirit (see Doctrine and Covenants 11:12–13 ) The Light of Christ (see Moroni 7:16–19 ) Prophets (see Doctrine and Covenants 21:1, 4–6 ) Scriptures (see 2 Timothy 3:15–17 ) If you perceive a need in your students, you might read and discuss some of the scriptures provided. The next activity gives students an opportunity to study the Savior’s teachings to help them recognize His truth. Refer students to the list of spiritually dangerous ideas and actions on the board. Display the following instructions. To help us discern truth from error, we can turn to the teachings of Jesus Christ and His prophets. One place we can “find the teachings of Jesus Christ and His prophets” is in For the Strength of Youth: A Guide for Making Choices (“ Make Inspired Choices ,” For the Strength of Youth: A Guide for Making Choices [2022]). Pick one idea or action that is evil pretending to be good or good being portrayed as or labeled evil. Study the For the Strength of Youth guide, looking for the teachings of Jesus Christ and His prophets that can help you choose to follow Jesus Christ instead of the devil’s deceptive messages. Write how the Savior’s teachings correct the false ideas. Invite students to share what they have found. To do so, a student could choose an idea or action from the board. Ask the class to explain how something they learned shows that idea or action as spiritually destructive. For example, if a student chose “It’s fine as long as you don’t get caught,” students might share something they learned in the section “ Truth will make you free ” in the For the Strength of Youth guide, such as the paragraphs that begin “ Living with integrity means that you love truth will all your heart ” or “ Love the truth .” Reflecting on learning Give students an opportunity to reflect on what they have learned by displaying a question such as the following. Write an answer to the following question in your study journal: What have you learned today that can help you recognize the truth and better follow Jesus Christ? You could invite students to share their feelings and testimony by sharing what they wrote. Consider testifying of Jesus Christ and His title as the Truth. Memorize You may want to help students memorize the doctrinal mastery passage and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Isaiah 5:20 is “Woe unto them that call evil good, and good evil.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 116 ---\nGod’s children have been spiritually scattered, and He wants to gather them to the safety of His gospel. Using the imagery of a tree and an ensign, Isaiah prophesied of the gathering of Israel. This lesson can help students feel more motivated to share the gospel with others. Student preparation: Consider giving each student the two self-evaluation questions from the beginning of the lesson and inviting them to ponder how they would answer. Possible Learning Activities How do you feel about sharing the gospel? Consider preparing one of the following and, as they listen, invite students to ponder how they feel about sharing the gospel: An account from a student about when they, or someone they know, shared the gospel (You can ask if a student would be willing to share an experience at this point of the lesson, or you may set this up in advance.) One of your own experiences One of the following stories from Elder Gary E. Stevenson, “ Love, Share, Invite ,” May 2022 Brother Wisan ( pg 86 , or time code 5:40–7:06) 13:3 Mayra ( pg 86 , or time code 8:33–9:42) 13:3 Invite students to ponder how likely they are to share the gospel. It may be helpful to have them answer the following in their study journals: How do you feel about sharing the gospel? Why do you feel the way you do? If students are comfortable, they can express some of their thoughts or feelings to the class. As you study today, seek help through the Holy Ghost to increase your desire to share the gospel. Also seek help with any questions or concerns you may have. Isaiah’s prophecy Consider drawing or displaying something like the following, but do not include the labels. If you would like, invite students to make a similar drawing in their journals. In Isaiah 11 , Isaiah taught by symbolically using the parts of a tree. Read Isaiah 11:1 and label the drawing. (It may be helpful to know that the stem could also be translated stump and rod as a small branch or shoot.) What tools and skills can you use to discover who or what the stem symbolizes? Some possible answers are the chapter heading and footnotes. Help students use these to find the symbolism. For example, footnote 1c leads to the following Doctrine and Covenants verses. Read Doctrine and Covenants 113:1–2 , looking for the inspired answers to what the stem symbolizes. On the board, label the stem or trunk Jesus Christ . Students could also write this in their scriptures next to Isaiah 11:1 . If the Savior is the trunk, what might the part of the tree that was cut down symbolize? A possible answer is that the Savior built a great kingdom or tree through David (the son of Jesse), but they fell into wickedness, divided into kingdoms, and would eventually be conquered (like a tree being cut down). However, the Savior would remember His covenant and help the descendants of David to grow, promising to gather them again. Isaiah then prophesied of the Savior through the Second Coming and Millennium. Read one or two of the following sets of verses, looking for descriptions of the Savior and His influence. Isaiah 11:2–5 . Isaiah 11:6–9 . ( Note : These verses describe the Millennium and how the knowledge of the Lord will affect the world. Both asp and cockatrice refer to venomous snakes.) Isaiah 12:1–6 . Invite students to share phrases they found about the Savior or His influence that motivate them to want to come closer to the Savior, or help others gather to Him. If needed, consider explaining that Isaiah 11:6–9 illustrates the peace the Savior will bring to the world. A prophecy of Joseph Smith Show a picture of Moroni appearing before the young Joseph Smith and explain the following: Moroni quoted Isaiah 11 to Joseph Smith several times (see Joseph Smith—History 1:40, 45–46, 49 ). Isaiah prophesied not only of the Savior in the last days but also of Joseph Smith. You may want to write Joseph Smith next to “rod” in Isaiah 11:1 and “root” in Isaiah 11:10 . (See also Doctrine and Covenants 113:3–6 .) Read Isaiah 11:10–12 , looking for the work the Lord would do through the Prophet Joseph Smith. Listen carefully as students share what they found. If useful, explain the following: The phrase “set his hand again the second time to recover the remnant of his people” ( Isaiah 11:11 ) refers to the latter-day gathering of Israel (see Doctrine and Covenants 137:6 ). An ensign is a flag or banner that an army may gather under or march behind. “ Ensign for the nations” ( Isaiah 11:12 ) refers to the Restoration of The Church of Jesus Christ of Latter-day Saints, including all its ordinances and covenants (see Doctrine and Covenants 45:9 ). Write the following phrase on the board: The Lord’s restored Church is an ensign to gather people to the gospel of Jesus Christ. An ensign for the nations To help students better understand this principle, pass out the handout “ An Ensign for the Nations .” Display the following instructions and invite students to fill them in on the handout individually or in small groups. Open PDF Question 1: Why would others want to gather to the Savior and His Church? On the flag, write several things you know about Jesus Christ and His restored Church that you think would attract others to gather to Him and join His Church. You might include things that are unique to The Church of Jesus Christ of Latter-day Saints (such as the Book of Mormon, modern-day prophets, the priesthood of God, and latter-day temples). Write about how the Lord blesses us through these things. Question 2: Why gather with others to the Lord? Next to the figures gathered around the flag, write some of the blessings we can receive as we gather with others to the Lord. You may think about the advantages of an army gathering together and how it may apply to us, how the various people in your ward or branch strengthen each other, or how Moses 7:18 illustrates some advantages. Question 3: How can we invite others to come to the Savior? Below the figures gathered around the flag, write several ways we can share the gospel of Jesus Christ with others. You might include ways you have tried. After completing the handout, invite students to share what they wrote on the handout and how they feel about what they wrote. If they do not do it naturally, invite them to share how what they learned today could help them feel more motivated to share the gospel.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 1",
      "content": "1. ThevisionofIsaiahthe son of Amoz, which he saw concerningJudahand Jerusalem in the days ofUzziah,Jotham,Ahaz,andHezekiah, kings of Judah.\n2. Hear, O heavens, and give ear, O earth: for theLordhath spoken, I have nourished and brought up children, and they haverebelledagainst me.\n3. The ox knoweth his owner, and the ass his masterscrib:butIsrael doth notknow, my people doth not consider.\n4. Ahsinfulnation, people laden with iniquity, seed of evildoers,childrenthat arecorrupters: they have forsaken theLord, they have provoked the Holy One of Israel untoanger, they are gone away backward.\n5. Why should ye bestrickenany more? ye willrevoltmore and more: the whole head is sick, and the whole heartfaint.\n6. From the sole of the foot even unto the headthere isno soundness in it;butwounds, and bruises, and putrifying sores: they have not beenclosed, neither bound up, neithermollifiedwith ointment.\n7. Yourcountryisdesolate, your citiesareburned with fire: your land,strangersdevour it in your presence, andit isdesolate, as overthrown by strangers.\n8. And the daughter of Zion is left as cottage in avineyard, asalodge in garden of cucumbers, as besieged city.\n9. Except theLordof hosts had left unto us very smallremnant, we should have been as Sodom,andwe should have been like unto Gomorrah.\n10. Hear the word of theLord, ye rulers ofSodom; give ear unto the law of our God, ye people of Gomorrah.\n11. To what purposeisthe multitude of yoursacrificesunto me? saith theLord: I am full of the burnt offerings of rams, and the fat of fed beasts; and Idelightnot in the blood of bullocks, or of lambs, or of he goats.\n12. When ye come to appear before me, who hath required this at your hand, to tread my courts?\n13. Bring no morevainoblations; incense is an abomination unto me; the new moons andsabbaths, the calling ofassemblies, I cannotaway with;it isiniquity, even thesolemn meeting.\n14. Your newmoonsand your appointedfeastsmy soul hateth: they are trouble unto me; I amwearyto bearthem.\n15. And when ye spread forth your hands, I will hide mine eyes from you: yea, when ye make manyprayers, I will not hear: your hands are full ofblood.\n16. Washyou, make youclean; put away theevilof your doings from before mine eyes;ceaseto do evil;\n17. Learnto dowell; seekjudgment,relievethe oppressed,judge the fatherless, plead for thewidow.\n18. Come now, and let usreasontogether, saith theLord: though yoursinsbe as scarlet, they shall be aswhiteas snow; though they be red like crimson, they shall be as wool.\n19. If ye bewillingandobedient, ye shall eat thegoodof the land:\n20. But if ye refuse andrebel, ye shall bedevouredwith the sword: for the mouth of theLordhath spokenit.\n21. How is the faithful city become anharlot! it was full ofjudgment; righteousness lodged in it; but now murderers.\n22. Thy silver is becomedross, thy wine mixed with water:\n23. Thyprincesarerebellious, andcompanions of thieves: every one lovethgifts, and followeth after rewards: theyjudge notthe fatherless, neither doth the cause of the widow come unto them.\n24. Therefore saith the Lord, theLordof hosts, the mighty One of Israel, Ah, I will ease me of mineadversaries, and avenge me of mine enemies:\n25. And I willturn my hand uponthee, and purelypurgeaway thy dross, and take away all thy tin:\n26. And I willrestorethy judges as at the first, and thycounsellorsas at the beginning: afterward thou shalt be called, Thecity of righteousness, the faithful city.\n27. Zionshall be redeemed withjudgment, and herconvertswith righteousness.\n28. And the destruction of the transgressors and of the sinnersshall betogether, and they that forsake theLordshall be consumed.\n29. For they shall be ashamed of theoakswhich ye have desired, and ye shall be confounded for the gardens that ye have chosen.\n30. For ye shall be as an oak whose leaf fadeth, and as garden that hath no water.\n31. And the strong shall beas tow, and the maker of it as spark, and they shall bothburntogether, and none shall quenchthem.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 2",
      "content": "1. The word thatIsaiahthe son of Amozsawconcerning Judah and Jerusalem.\n2. And it shall come to pass in thelast days,thatthemountainof theLordshouseshall beestablishedin the top of the mountains, and shall be exalted above the hills; and allnationsshall flow unto it.\n3. And many people shall go and say, Come ye, and let usgoup to themountainof theLord, to thehouseof the God of Jacob; and he willteachus of his ways, and we will walk in his paths: for out ofZionshall go forth thelaw, and the word of theLordfrom Jerusalem.\n4. And he shalljudgeamong the nations, and shall rebuke many people: and they shall beat their swords into plowshares, and their spears into pruninghooks: nation shall not lift up sword against nation, neither shall they learnwarany more.\n5. O house of Jacob, come ye, and let uswalkin thelightof theLord.\n6. Therefore thou hast forsakenthy people the house of Jacob, because theybereplenished from the east, andaresoothsayerslike the Philistines, and theyplease themselves inthe children of strangers.\n7. Their land also is full of silver and gold, neitheris there anyend of their treasures; their land is also full of horses, neitheris there anyend of their chariots:\n8. Their land also is full ofidols; theyworshipthe work of their own hands, that which their own fingers have made:\n9. And themean manbowethdown, and the great man humbleth himself: therefore forgive them not.\n10. Enter into the rock, and hide thee in the dust, for fear of theLord, and for the glory of his majesty.\n11. The lofty looks of man shall be humbled, and the haughtiness of men shall be bowed down, and theLordalone shall beexaltedin thatday.\n12. For thedayof theLordof hostsshall beupon everyone that isproudand lofty, and upon everyone that islifted up; and he shall be broughtlow:\n13. And upon all thecedarsof Lebanon,that arehigh and lifted up, and upon all the oaks of Bashan,\n14. And upon all the high mountains, and upon all the hillsthat arelifted up,\n15. And upon every high tower, and upon every fenced wall,\n16. Andupon all the ships of Tarshish, and upon all pleasant pictures.\n17. And the loftiness of man shall be bowed down, and thehaughtinessof men shall be made low: and theLordalone shall be exalted in that day.\n18. And theidolshe shall utterly abolish.\n19. And they shall go into theholesof the rocks, and into the caves of the earth, forfearof theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth.\n20. In that day man shallcasthis idols of silver, and his idols of gold, which they madeeach onefor himself to worship, to the moles and to the bats;\n21. To go into the clefts of the rocks, and into the tops of the ragged rocks, for fear of theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth.\n22. Ceaseye from man, whose breathisin his nostrils: forwhereinis he to be accounted of?",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 3",
      "content": "1. For, behold, the Lord, theLordof hosts, doth take away fromJerusalemand from Judah the stay and the staff, the whole stay ofbread, and the whole stay of water,\n2. The mighty man, and the man ofwar, the judge, and the prophet, and the prudent, and theancient,\n3. The captain of fifty, and the honourable man, and the counsellor, andthe cunning artificer, and theeloquent orator.\n4. And I will givechildrento betheir princes, and babes shall rule over them.\n5. And the people shall be oppressed, every one by another, and every one by his neighbour: the child shall behave himself proudly against theancient, and the base against the honourable.\n6. When man shall take hold of his brother of the house of his father,saying,Thou hast clothing, be thou our ruler, andletthisruinbeunder thy hand:\n7. In that day shall he swear, saying, I will not bean healer; for in my houseisneither bread nor clothing: make me not ruler of the people.\n8. ForJerusalemis ruined, and Judah isfallen: because their tongue and their doingsareagainst theLord, to provoke the eyes of his glory.\n9. The shew of their countenance doth witness against them; and they declare theirsinasSodom, they hideitnot. Woe unto their soul! for they have rewarded evil unto themselves.\n10. Say ye to therighteous, thatit shall bewellwith him:for they shalleatthe fruit of their doings.\n11. Woe unto thewicked!it shall beillwith him:forthereward of his hands shall be given him.\n12. As formy people, childrenaretheir oppressors, andwomenrule over them. O my people, they whichleadthee causetheeto err, and destroy the way of thy paths.\n13. TheLordstandeth up toplead, and standeth to judge the people.\n14. TheLordwill enter intojudgmentwith theancientsof his people, and theprincesthereof: for ye haveeaten upthe vineyard; thespoilof thepoorisin your houses.\n15. What mean yethatyebeatmy people to pieces, and grind the faces of the poor? saith the LordGodof hosts.\n16. Moreover theLordsaith, Because thedaughtersof Zion arehaughty, andwalkwith stretched forth necks andwantoneyes, walking andmincingasthey go, and making tinkling with their feet:\n17. Therefore the Lord will smite with scab the crown of the head of the daughters of Zion, and theLordwilldiscover their secret parts.\n18. In that day the Lord will take away the bravery oftheirtinkling ornamentsabout their feet,andtheircauls, andtheirroundtires like the moon,\n19. The chains, and the bracelets, and themufflers,\n20. The bonnets, and the ornaments of the legs, and the headbands, and the tablets, and the earrings,\n21. The rings, and nose jewels,\n22. Thechangeable suitsofapparel, and the mantles, and the wimples, and the crisping pins,\n23. Theglasses, and the fine linen, and the hoods, and the veils.\n24. And it shall come to pass,thatinstead of sweet smell there shall be stink; and instead of girdlea rent; and instead of well set hairbaldness; and instead ofa stomachera girding of sackcloth;andburninginstead ofbeauty.\n25. Thymenshall fall by the sword, and thy mighty in the war.\n26. And hergatesshalllamentandmourn; and shebeingdesolateshall sit upon theground.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 4",
      "content": "1. And in that daysevenwomen shall take hold of oneman, saying, We will eat our own bread, and wear our own apparel: only let us be called by thyname, to take away ourreproach.\n2. In that day shall thebranchof theLordbebeautifuland glorious, and thefruitof the earthshall beexcellent and comely for them that areescapedof Israel.\n3. And it shall come to pass,that he that isleftinZion, andhe thatremaineth inJerusalem, shall be called holy,evenevery one that iswritten among the livingin Jerusalem:\n4. Whenthe Lord shall havewashedaway the filth of the daughters of Zion, and shall havepurgedthe blood of Jerusalem from the midst thereof by the spirit of judgment, and by the spirit ofburning.\n5. And theLordwill create upon every dwelling place of mountZion, and upon her assemblies, acloudand smoke by day, and the shining of flamingfireby night: for upon all the gloryshall bea defence.\n6. And there shall be tabernacle for shadow in the daytime from the heat, and for place ofrefuge, and for covert from storm and from rain.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 5",
      "content": "1. Nowwill Isingto my wellbeloved song of my beloved touching hisvineyard. My wellbeloved hath vineyardina very fruitful hill:\n2. And he fenced it, and gathered out the stones thereof, and planted it with the choicest vine, and built tower in the midst of it, and also made winepress therein: and he looked that it should bring forth grapes, and it brought forth wild grapes.\n3. And now, O inhabitants of Jerusalem, and men of Judah, judge, I pray you, betwixt me and my vineyard.\n4. What could have been done more to my vineyard, that I have not done in it? wherefore, when I looked that it should bring forth grapes, brought it forthwild grapes?\n5. And now go to; I will tell you what I will do to myvineyard: I willtake awaythe hedge thereof, and it shall be eaten up;andbreak down thewallthereof, and it shall be trodden down:\n6. And I will lay it waste: it shall not be pruned, nor digged; but there shall come up briers and thorns: I will also command the clouds that they rain no rain upon it.\n7. For thevineyardof theLordof hostsisthe house of Israel, and the men of Judah his pleasant plant: and he looked forjudgment, but behold oppression; for righteousness, but beholda cry.\n8. Woe unto them thatjoinhouse to house,thatlay field to field, tillthere beno place, that they maybe placed alonein the midst of the earth!\n9. In mine earssaidtheLordof hosts, Of truth many houses shall be desolate,evengreat and fair, without inhabitant.\n10. Yea, ten acres of vineyard shall yield onebath, and the seed of an homer shall yield an ephah.\n11. Woe unto them that rise up early in the morning,thatthey may follow strong drink; that continue until night,tillwineinflame them!\n12. And the harp, and theviol, thetabret, and pipe, and wine, are in their feasts: but theyregardnot theworkof theLord, neither consider the operation of his hands.\n13. Therefore my people are gone intocaptivity, becausethey havenoknowledge: and their honourable menarefamished, and their multitude dried up with thirst.\n14. Therefore hell hath enlarged herself, and opened her mouth without measure: and their glory, and their multitude, and theirpomp, and he that rejoiceth, shall descend into it.\n15. And the mean man shall be brought down, and the mighty man shall be humbled, and the eyes of theloftyshall be humbled:\n16. But theLordof hosts shall be exalted injudgment, and God that isholyshall be sanctified in righteousness.\n17. Then shall the lambs feed after their manner, and the waste places of the fat ones shall strangers eat.\n18. Woe unto them thatdrawiniquity with cords ofvanity, and sinasit were with cart rope:\n19. That say,Lethim makespeed,andhastenhis work, that we mayseeit:and let the counsel of the Holy One of Israel draw nigh and come, that we may knowit!\n20. Woe unto them that callevilgood, and good evil; that putdarknessforlight, and light for darkness; that put bitter for sweet, and sweet for bitter!\n21. Woe untothem that arewisein their owneyes, andprudentin their own sight!\n22. Woe untothem that aremighty todrinkwine, and men of strength to mingle strong drink:\n23. Whichjustifythewickedfor reward, andtakeaway the righteousness of the righteous from him!\n24. Therefore as the fire devoureth thestubble, and the flame consumeth the chaff,sotheirrootshall be as rottenness, and their blossom shall go up as dust: because they have cast away the law of theLordof hosts, and despised the word of the Holy One of Israel.\n25. Therefore is theangerof theLordkindled against his people, and he hathstretchedforth his hand against them, and hath smitten them: and the hills did tremble, and their carcasesweretorn in the midst of the streets. For all this his anger is not turned away, but his handisstretched out still.\n26. And he will lift up anensignto the nations from far, and willhissunto them from theendof the earth: and, behold, they shallcomewith speed swiftly:\n27. None shall be weary nor stumble among them; none shall slumber nor sleep; neither shall the girdle of their loins be loosed, nor the latchet of their shoes be broken:\n28. Whose arrowsaresharp, and all their bows bent, their horses hoofs shall be counted like flint, and their wheels like whirlwind:\n29. Their roaringshall belike lion, they shall roar like younglions: yea, they shall roar, and lay hold of theprey, and shall carryitaway safe, and none shall deliverit.\n30. And in that day they shall roar against them like the roaring of the sea: and ifonelook unto the land, behold darknessandsorrow, and thelightisdarkenedin the heavens thereof.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 6",
      "content": "1. Inthe year that king Uzziah died Isawalso theLordsitting upon athrone, high and lifted up, andhis trainfilled the temple.\n2. Above it stood theseraphims:each one had six wings; with twain he covered his face, and with twain he covered his feet, and with twain he did fly.\n3. And one cried unto another, and said, Holy, holy, holy,istheLordof hosts: the whole earthisfull of hisglory.\n4. And thepostsof the door moved at the voice of him that cried, and the house was filled withsmoke.\n5. Then said I, Woeisme! for I amundone; because Iama man ofuncleanlips, and I dwell in the midst of people of unclean lips: for mine eyes haveseentheKing, theLordof hosts.\n6. Then flew one of the seraphims unto me, having livecoalin his hand,whichhe had taken with the tongs from off the altar:\n7. And he laiditupon mymouth, and said, Lo, this hath touched thy lips; and thine iniquity istakenaway, and thy sin purged.\n8. Also I heard the voice of the Lord, saying, Whom shall Isend, and who will go for us? Then said I, HereamI;sendme.\n9. And he said, Go, and tell this people,Hearye indeed, butunderstandnot; and see ye indeed, butperceivenot.\n10. Make theheartof this people fat, and make their ears heavy, andshuttheir eyes; lest they see with their eyes, and hear with their ears, and understand with their heart, and convert, and be healed.\n11. Then said I, Lord,howlong? And he answered, Until the cities be wasted without inhabitant, and the houses without man, and the land be utterly desolate,\n12. And theLordhave removed men far away, andthere bea great forsaking in the midst of the land.\n13. But yet in itshall bea tenth, anditshall return, and shall be eaten: as teil tree, and as an oak, whose substanceisin them, when they casttheir leaves: sothe holy seedshall bethesubstancethereof.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 7",
      "content": "1. Andit came to pass in the days of Ahaz the son of Jotham, the son of Uzziah, king of Judah,thatRezinthekingof Syria, andPekahthe son of Remaliah, king of Israel, went up toward Jerusalem to war against it, but could not prevail against it.\n2. And it was told the house of David, saying, Syria is confederate withEphraim. And his heart was moved, and the heart of his people, as the trees of the wood are moved with the wind.\n3. Then said theLordunto Isaiah, Go forth now to meet Ahaz, thou,andShear-jashubthy son, at the end of theconduitof the upper poolinthe highway of the fullers field;\n4. And say unto him,Take heed, and be quiet; fear not, neither be fainthearted for the two tails of these smoking firebrands, for the fierce anger of Rezin with Syria, and of the son of Remaliah.\n5. Because Syria, Ephraim, and the son of Remaliah, have taken evil counsel against thee, saying,\n6. Let us go up against Judah, and vex it, and let usmake breachtherein for us, and set king in the midst of it,eventhe son of Tabeal:\n7. Thus saith the LordGod, It shall not stand, neither shall it come to pass.\n8. For the head of SyriaisDamascus, and the head of DamascusisRezin; and within threescore and five years shallEphraimbe broken, that it be not people.\n9. And the head of EphraimisSamaria, and the head of SamariaisRemaliahs son.Ifye will not believe, surely ye shall not be established.\n10. Moreover theLordspake again unto Ahaz, saying,\n11. Ask thee sign of theLordthy God; ask it either in the depth, or in the height above.\n12. But Ahaz said, I will not ask, neither will ItempttheLord.\n13. And he said, Hear ye now, O house of David;Is ita small thing for you to weary men, but will ye weary my God also?\n14. Therefore the Lord himself shall give you asign;Behold, avirginshall conceive, and bear ason, and shall call his nameImmanuel.\n15. Butter and honeyshall he eat, that he may know to refuse the evil, and choose the good.\n16. Forbeforethe child shall know to refuse theevil, and choose the good, the land that thou abhorrest shall be forsaken of both her kings.\n17. TheLordshall bring upon thee, and upon thy people, and upon thy fathers house, days that have not come, from the day thatEphraimdeparted fromJudah;eventhe king of Assyria.\n18. And it shall come to pass in that day,thattheLordshallhissfor the flythatisin the uttermost part of the rivers of Egypt, and for the bee thatisin the land of Assyria.\n19. And they shall come, and shall rest all of them in the desolate valleys, and in the holes of the rocks, and upon all thorns, and upon all bushes.\n20. In the same day shall the Lordshavewith razor that is hired,namely,by them beyond the river, by the king of Assyria, the head, and the hair of the feet: and it shall also consume the beard.\n21. And it shall come to pass in that day,thataman shall nourish young cow, and two sheep;\n22. And it shall come to pass, for the abundance of milkthattheyshall give he shall eat butter: forbutter and honeyshall every one eat that is left in the land.\n23. And it shall come to pass in that day,thatevery place shall be, where there were thousand vines at thousandsilverlings, it shallevenbe for briers and thorns.\n24. With arrows and with bows shallmencome thither; because all the land shall become briers and thorns.\n25. Andonall hills that shall bedigged with the mattock, there shall not come thither the fear of briers and thorns: but it shall be for the sending forth of oxen, and for the treading oflesser cattle.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 8",
      "content": "1. Moreover theLordsaid unto me, Take thee greatroll, andwritein it witha mans penconcerningMaher-shalal-hash-baz.\n2. And I took unto me faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah.\n3. And I went untothe prophetess; and she conceived, and bare son. Then said theLordto me, Call his nameMaher-shalal-hash-baz.\n4. Forbeforethe child shallhaveknowledge to cry, My father, and my mother, the riches of Damascus and the spoil ofSamariashall betakenaway before the king of Assyria.\n5. TheLordspake also unto me again, saying,\n6. Forasmuch as this people refuseth the waters ofShiloahthat go softly, and rejoice inRezinand Remaliahs son;\n7. Now therefore, behold, the Lord bringeth up uponthemthewatersof the river, strong and many,eventhe king ofAssyria, and all his glory: and he shall come up over all his channels, and go over all his banks:\n8. And he shallpass through Judah; he shall overflow and go over, he shall reachevento theneck; and the stretching out of his wings shall fill the breadth of thy land, OImmanuel.\n9. Associate yourselves, O ye people, and ye shall be broken in pieces; and give ear, all ye of far countries: gird yourselves, and ye shall be broken in pieces; gird yourselves, and ye shall be broken in pieces.\n10. Takecounseltogether, and it shall come to nought; speak the word, and it shall not stand: forGodiswith us.\n11. For theLordspake thus to mewith strong hand, and instructed me that I should not walk in the way of this people, saying,\n12. Say ye not, Aconfederacy, to allthem towhom this people shall say, A confederacy; neither fear ye their fear, nor be afraid.\n13. Sanctify theLordof hostshimself; andlethimbeyour fear, andlethimbeyour dread.\n14. And he shall be for asanctuary; but for astoneofstumblingand for arockofoffenceto both the houses of Israel, for gin and for asnareto the inhabitants of Jerusalem.\n15. And many among them shall stumble, and fall, and be broken, and be snared, and be taken.\n16. Bindup the testimony,sealthelawamong my disciples.\n17. And I will wait upon theLord, thathidethhisfacefrom the house of Jacob, and I will look for him.\n18. Behold, I and the children whom theLordhath given meareforsignsand for wonders in Israel from theLordof hosts, which dwelleth in mount Zion.\n19. And when they shall say unto you, Seek unto them that havefamiliar spirits, and untowizardsthat peep, and that mutter: should not people seek unto their God?forthe living to the dead?\n20. To thelawand to the testimony: iftheyspeak not according to this word,it isbecausethere isnolightin them.\n21. Andtheyshall pass through it, hardly bestead and hungry: and it shall come to pass, that when they shall be hungry, they shall fret themselves, andcursetheir king and their God, and look upward.\n22. And they shall look unto the earth; and behold trouble anddarkness,dimness of anguish; andthey shall bedriven to darkness.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 9",
      "content": "1. Neverthelessthe dimnessshallnotbesuch aswasin her vexation,whenat the first he lightly afflicted the land ofZebulunand the land of Naphtali, and afterward did more grievously afflicther bythe way of the sea, beyond Jordan, in Galilee of the nations.\n2. The people that walked indarknesshave seen greatlight: they that dwell in the land of the shadow of death, upon them hath the light shined.\n3. Thou hastmultipliedthenation,andnot increased the joy: they joy before thee according to the joy in harvest,andasmenrejoicewhen they divide the spoil.\n4. For thou hast broken theyokeof hisburden, and the staff of hisshoulder, therodof his oppressor, asinthe day ofMidian.\n5. Forevery battle of the warrioriswith confused noise, and garments rolled in blood; butthisshall be withburningandfuel of fire.\n6. For unto us achildisborn, unto us asonis given: and thegovernmentshall be upon his shoulder: and his name shall be called Wonderful,Counsellor, ThemightyGod, TheeverlastingFather, The Prince ofPeace.\n7. Of the increase ofhisgovernmentand peacethere shall benoend, upon the throne ofDavid, and upon his kingdom, to order it, and to establish it with judgment and withjusticefrom henceforth even for ever. Thezealof theLordof hosts will perform this.\n8. The Lord sent word into Jacob, and it hath lighted uponIsrael.\n9. And all the people shall know,evenEphraim and the inhabitant of Samaria, that say in theprideand stoutness of heart,\n10. The bricks are fallen down, but we will build with hewn stones: the sycomores are cut down, but we will changethem intocedars.\n11. Therefore theLordshall set up the adversaries ofRezinagainst him, and join his enemies together;\n12. The Syriansbefore, and the Philistinesbehind; and they shall devour Israel with open mouth. For all this hisangeris not turned away, buthishandisstretchedout still.\n13. For the peopleturneth notunto him that smiteth them, neither do theyseektheLordof hosts.\n14. Therefore theLordwill cut off from Israel head and tail, branch and rush, in one day.\n15. Theancient and honourable, heisthe head; and theprophetthat teacheth lies, heisthe tail.\n16. For theleadersof this people causethemto err; andthey that areled of themaredestroyed.\n17. Therefore the Lord shall have no joy in their young men, neither shall have mercy on their fatherless and widows: for every oneisanhypocriteand an evildoer, and every mouthspeakethfolly. For all this his anger is not turned away, but his handisstretched out still.\n18. For wickedness burneth as the fire: it shall devour the briers andthorns, and shall kindle in thethicketsof the forest, and they shall mount uplikethe lifting up of smoke.\n19. Through the wrath of theLordof hosts is the land darkened, andthe people shall be as the fuel of the fire: no man shallsparehisbrother.\n20. And he shall snatch on the right hand, and be hungry; and he shall eat on the left hand, and they shall not be satisfied: they shalleatevery man thefleshof his own arm:\n21. Manasseh, Ephraim; and Ephraim, Manasseh:andthey togethershall beagainst Judah. For all this his anger is not turned away, but his handisstretched out still.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 10",
      "content": "1. Woeunto them that decreeunrighteousdecrees, and that write grievousnesswhichthey have prescribed;\n2. To turn aside the needy fromjudgment, and to take away the right from thepoorof my people, that widows may be their prey, andthatthey may rob the fatherless!\n3. And what will ye do in the day ofvisitation, and in the desolationwhichshall come from far? to whom will ye flee for help? and where will ye leave your glory?\n4. Without me they shall bow down under the prisoners, and they shall fall under the slain. For all this his anger is not turned away, but his handisstretched out still.\n5. OAssyrian, the rod of mine anger, and the staff in their hand is mine indignation.\n6. I will send him against anhypocriticalnation, and against the people of my wrath will I give him charge, to take the spoil, and to take the prey, and to tread them down like the mire of the streets.\n7. Howbeit he meaneth not so, neitherdothhis heart think so; butit isin his heart to destroy and cut off nations not few.\n8. For he saith,Arenot my princes altogether kings?\n9. Isnot Calno as Carchemish?isnot Hamath as Arpad?isnot Samaria as Damascus?\n10. As my hand hath found the kingdoms of the idols, and whose graven images did excel them of Jerusalem and of Samaria;\n11. Shall I not, as I have done unto Samaria and her idols, so do to Jerusalem and her idols?\n12. Wherefore it shall come to pass,thatwhen the Lord hath performed his whole work upon mount Zion and on Jerusalem, I willpunishthe fruitof the stout heart of the king ofAssyria, and the glory of his high looks.\n13. For he saith, By thestrengthof my hand I have doneit,and by my wisdom; for I am prudent: and I have removed the bounds of the people, and have robbed their treasures, and I have put down the inhabitants like valiantman:\n14. And my hand hath found as nest the riches of the people: and as one gathereth eggsthat areleft, have I gathered all the earth; and there was none that moved the wing, or opened the mouth, or peeped.\n15. Shallthe axeboastitself against him that heweth therewith?orshall the saw magnify itself against him thatshakethit? as if the rod should shakeitselfagainst themthat lift it up,oras if the staff should lift upitself, as if it wereno wood.\n16. Therefore shall the Lord, the Lord of hosts, send among hisfatones leanness; and underhisglory he shall kindle burning like the burning of fire.\n17. And the light of Israel shall be for fire, and his Holy One for flame: and it shall burn and devour histhornsand his briers in one day;\n18. And shall consume the glory of his forest, and of his fruitful field, bothsoul and body: and they shall be as when standardbearer fainteth.\n19. And the rest of the trees of his forest shall be few, that child may write them.\n20. And it shall come to pass inthat day,thatthe remnant of Israel, and such as areescapedof the house of Jacob, shall no more againstay uponhim that smote them; but shall stay upon theLord, the Holy One of Israel, in truth.\n21. Theremnantshallreturn,eventhe remnant of Jacob, unto the mighty God.\n22. For though thy people Israel be as thesandof the sea,yeta remnant of them shallreturn:theconsumptiondecreedshall overflow with righteousness.\n23. For the LordGodof hosts shallmake consumption, even determined, in the midst of all the land.\n24. Therefore thus saith the LordGodof hosts, O my people that dwellest in Zion, be not afraid of the Assyrian: he shallsmitethee with rod, and shall lift up his staff against thee, after the manner ofEgypt.\n25. For yet very littlewhile, and theindignationshall cease, and mine anger in their destruction.\n26. And theLordof hosts shall stir up scourge for him according to the slaughter ofMidianat the rock ofOreb: andashisrodwasupon the sea, so shall he lift it up after the manner ofEgypt.\n27. And it shall come to pass in that day,thathisburdenshall be taken away from off thy shoulder, and his yoke from off thy neck, and theyokeshall be destroyed because of theanointing.\n28. Heis come to Aiath, he is passed to Migron; at Michmash he hath laid up his carriages:\n29. They are gone over the passage: they have taken up their lodging at Geba; Ramah is afraid; Gibeah of Saul is fled.\n30. Lift up thy voice, O daughter of Gallim: cause it to be heard unto Laish, O poor Anathoth.\n31. Madmenah is removed; the inhabitants of Gebim gather themselves to flee.\n32. As yet shall he remain at Nob that day: he shall shake his handagainstthe mount of the daughter of Zion, the hill of Jerusalem.\n33. Behold, the Lord, theLordof hosts, shall lop the bough withterror: and the high ones of statureshall behewn down, and thehaughtyshall be humbled.\n34. And he shall cut down thethicketsof the forest with iron, and Lebanon shall fallbya mighty one.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 11",
      "content": "1. Andthere shall come forth arodout of thestemofJesse, and aBranchshall grow out of his roots:\n2. And thespiritof theLordshall rest upon him, the spirit ofwisdomandunderstanding, the spirit ofcounseland might, the spirit of knowledge and of the fear of theLord;\n3. And shall make him of quick understanding in the fear of theLord: and he shall notjudgeafterthe sight of his eyes, neither reprove after the hearing of his ears:\n4. But with righteousness shallhejudgethe poor, andreprove with equityfor themeekof the earth: and he shallsmitethe earth with the rod of his mouth, and with thebreathof his lips shall heslaythe wicked.\n5. And righteousness shall be thegirdleof his loins, and faithfulness the girdle of hisreins.\n6. Thewolfalso shall dwell with the lamb, and the leopard shall lie down with the kid; and the calf and the young lion and the fatling together; and little child shall lead them.\n7. And the cow and the bear shall feed; their young ones shall lie down together: and the lion shall eat straw like the ox.\n8. And the sucking child shall play on the hole ofthe asp, and the weaned child shall put his hand on thecockatriceden.\n9. They shall nothurtnordestroyin all my holymountain: for theearthshall be full of theknowledgeof theLord, as the waters cover the sea.\n10. And inthat daythere shall be aroot of Jesse, which shall stand for anensignof the people;to itshall theGentilesseek: and hisrestshall be glorious.\n11. And it shall come to pass in that day,thatthe Lord shall set his hand again thesecondtime torecovertheremnantof his people, which shall be left, from Assyria, and from Egypt, and from Pathros, and from Cush, and from Elam, and from Shinar, and from Hamath, and from theislandsof the sea.\n12. And he shall set up anensignfor the nations, and shall assemble the outcasts of Israel, and gather together the dispersed of Judah from the four corners of the earth.\n13. The envy also of Ephraim shall depart, and the adversaries of Judah shall be cut off: Ephraim shall notenvyJudah, and Judah shall not vex Ephraim.\n14. But they shallflyupon theshouldersof the Philistines toward the west;they shall spoilthem of the east together: they shall lay their hand upon Edom and Moab; and the children of Ammon shall obey them.\n15. And theLordshall utterlydestroythe tongue of theEgyptiansea; and with his mighty wind shall he shake his hand over the river, and shall smite it in the seven streams, and makemengo over dryshod.\n16. And there shall beanhighwayfor the remnant of his people, which shall be left, from Assyria; like as it was to Israel in the day that he came up out of the land of Egypt.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 12",
      "content": "1. Andin that daythou shalt say,OLord, I will praise thee: though thou wast angry with me, thine anger is turned away, and thou comfortedst me.\n2. Behold, Godismy salvation; I will trust, and not be afraid: for theLordJehovahismystrengthandmysong; he also is become mysalvation.\n3. Therefore withjoyshall ye draw water out of the wells of salvation.\n4. And in that day shall ye say,PraisetheLord,call uponhis name, declare his doings among the people, make mention that his name is exalted.\n5. Singunto theLord; for he hath done excellent things: thisisknown in all the earth.\n6. Cry out and shout, thouinhabitantof Zion: for greatisthe Holy One of Israel in themidstof thee.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Isaiah": {
      "1": {
        "verses": {
          "1": {
            "text": "ThevisionofIsaiahthe son of Amoz, which he saw concerningJudahand Jerusalem in the days ofUzziah,Jotham,Ahaz,andHezekiah, kings of Judah.",
            "citation": "(Isaiah 1:1)"
          },
          "2": {
            "text": "Hear, O heavens, and give ear, O earth: for theLordhath spoken, I have nourished and brought up children, and they haverebelledagainst me.",
            "citation": "(Isaiah 1:2)"
          },
          "3": {
            "text": "The ox knoweth his owner, and the ass his masterscrib:butIsrael doth notknow, my people doth not consider.",
            "citation": "(Isaiah 1:3)"
          },
          "4": {
            "text": "Ahsinfulnation, people laden with iniquity, seed of evildoers,childrenthat arecorrupters: they have forsaken theLord, they have provoked the Holy One of Israel untoanger, they are gone away backward.",
            "citation": "(Isaiah 1:4)"
          },
          "5": {
            "text": "Why should ye bestrickenany more? ye willrevoltmore and more: the whole head is sick, and the whole heartfaint.",
            "citation": "(Isaiah 1:5)"
          },
          "6": {
            "text": "From the sole of the foot even unto the headthere isno soundness in it;butwounds, and bruises, and putrifying sores: they have not beenclosed, neither bound up, neithermollifiedwith ointment.",
            "citation": "(Isaiah 1:6)"
          },
          "7": {
            "text": "Yourcountryisdesolate, your citiesareburned with fire: your land,strangersdevour it in your presence, andit isdesolate, as overthrown by strangers.",
            "citation": "(Isaiah 1:7)"
          },
          "8": {
            "text": "And the daughter of Zion is left as cottage in avineyard, asalodge in garden of cucumbers, as besieged city.",
            "citation": "(Isaiah 1:8)"
          },
          "9": {
            "text": "Except theLordof hosts had left unto us very smallremnant, we should have been as Sodom,andwe should have been like unto Gomorrah.",
            "citation": "(Isaiah 1:9)"
          },
          "10": {
            "text": "Hear the word of theLord, ye rulers ofSodom; give ear unto the law of our God, ye people of Gomorrah.",
            "citation": "(Isaiah 1:10)"
          },
          "11": {
            "text": "To what purposeisthe multitude of yoursacrificesunto me? saith theLord: I am full of the burnt offerings of rams, and the fat of fed beasts; and Idelightnot in the blood of bullocks, or of lambs, or of he goats.",
            "citation": "(Isaiah 1:11)"
          },
          "12": {
            "text": "When ye come to appear before me, who hath required this at your hand, to tread my courts?",
            "citation": "(Isaiah 1:12)"
          },
          "13": {
            "text": "Bring no morevainoblations; incense is an abomination unto me; the new moons andsabbaths, the calling ofassemblies, I cannotaway with;it isiniquity, even thesolemn meeting.",
            "citation": "(Isaiah 1:13)"
          },
          "14": {
            "text": "Your newmoonsand your appointedfeastsmy soul hateth: they are trouble unto me; I amwearyto bearthem.",
            "citation": "(Isaiah 1:14)"
          },
          "15": {
            "text": "And when ye spread forth your hands, I will hide mine eyes from you: yea, when ye make manyprayers, I will not hear: your hands are full ofblood.",
            "citation": "(Isaiah 1:15)"
          },
          "16": {
            "text": "Washyou, make youclean; put away theevilof your doings from before mine eyes;ceaseto do evil;",
            "citation": "(Isaiah 1:16)"
          },
          "17": {
            "text": "Learnto dowell; seekjudgment,relievethe oppressed,judge the fatherless, plead for thewidow.",
            "citation": "(Isaiah 1:17)"
          },
          "18": {
            "text": "Come now, and let usreasontogether, saith theLord: though yoursinsbe as scarlet, they shall be aswhiteas snow; though they be red like crimson, they shall be as wool.",
            "citation": "(Isaiah 1:18)"
          },
          "19": {
            "text": "If ye bewillingandobedient, ye shall eat thegoodof the land:",
            "citation": "(Isaiah 1:19)"
          },
          "20": {
            "text": "But if ye refuse andrebel, ye shall bedevouredwith the sword: for the mouth of theLordhath spokenit.",
            "citation": "(Isaiah 1:20)"
          },
          "21": {
            "text": "How is the faithful city become anharlot! it was full ofjudgment; righteousness lodged in it; but now murderers.",
            "citation": "(Isaiah 1:21)"
          },
          "22": {
            "text": "Thy silver is becomedross, thy wine mixed with water:",
            "citation": "(Isaiah 1:22)"
          },
          "23": {
            "text": "Thyprincesarerebellious, andcompanions of thieves: every one lovethgifts, and followeth after rewards: theyjudge notthe fatherless, neither doth the cause of the widow come unto them.",
            "citation": "(Isaiah 1:23)"
          },
          "24": {
            "text": "Therefore saith the Lord, theLordof hosts, the mighty One of Israel, Ah, I will ease me of mineadversaries, and avenge me of mine enemies:",
            "citation": "(Isaiah 1:24)"
          },
          "25": {
            "text": "And I willturn my hand uponthee, and purelypurgeaway thy dross, and take away all thy tin:",
            "citation": "(Isaiah 1:25)"
          },
          "26": {
            "text": "And I willrestorethy judges as at the first, and thycounsellorsas at the beginning: afterward thou shalt be called, Thecity of righteousness, the faithful city.",
            "citation": "(Isaiah 1:26)"
          },
          "27": {
            "text": "Zionshall be redeemed withjudgment, and herconvertswith righteousness.",
            "citation": "(Isaiah 1:27)"
          },
          "28": {
            "text": "And the destruction of the transgressors and of the sinnersshall betogether, and they that forsake theLordshall be consumed.",
            "citation": "(Isaiah 1:28)"
          },
          "29": {
            "text": "For they shall be ashamed of theoakswhich ye have desired, and ye shall be confounded for the gardens that ye have chosen.",
            "citation": "(Isaiah 1:29)"
          },
          "30": {
            "text": "For ye shall be as an oak whose leaf fadeth, and as garden that hath no water.",
            "citation": "(Isaiah 1:30)"
          },
          "31": {
            "text": "And the strong shall beas tow, and the maker of it as spark, and they shall bothburntogether, and none shall quenchthem.",
            "citation": "(Isaiah 1:31)"
          }
        }
      },
      "2": {
        "verses": {
          "1": {
            "text": "The word thatIsaiahthe son of Amozsawconcerning Judah and Jerusalem.",
            "citation": "(Isaiah 2:1)"
          },
          "2": {
            "text": "And it shall come to pass in thelast days,thatthemountainof theLordshouseshall beestablishedin the top of the mountains, and shall be exalted above the hills; and allnationsshall flow unto it.",
            "citation": "(Isaiah 2:2)"
          },
          "3": {
            "text": "And many people shall go and say, Come ye, and let usgoup to themountainof theLord, to thehouseof the God of Jacob; and he willteachus of his ways, and we will walk in his paths: for out ofZionshall go forth thelaw, and the word of theLordfrom Jerusalem.",
            "citation": "(Isaiah 2:3)"
          },
          "4": {
            "text": "And he shalljudgeamong the nations, and shall rebuke many people: and they shall beat their swords into plowshares, and their spears into pruninghooks: nation shall not lift up sword against nation, neither shall they learnwarany more.",
            "citation": "(Isaiah 2:4)"
          },
          "5": {
            "text": "O house of Jacob, come ye, and let uswalkin thelightof theLord.",
            "citation": "(Isaiah 2:5)"
          },
          "6": {
            "text": "Therefore thou hast forsakenthy people the house of Jacob, because theybereplenished from the east, andaresoothsayerslike the Philistines, and theyplease themselves inthe children of strangers.",
            "citation": "(Isaiah 2:6)"
          },
          "7": {
            "text": "Their land also is full of silver and gold, neitheris there anyend of their treasures; their land is also full of horses, neitheris there anyend of their chariots:",
            "citation": "(Isaiah 2:7)"
          },
          "8": {
            "text": "Their land also is full ofidols; theyworshipthe work of their own hands, that which their own fingers have made:",
            "citation": "(Isaiah 2:8)"
          },
          "9": {
            "text": "And themean manbowethdown, and the great man humbleth himself: therefore forgive them not.",
            "citation": "(Isaiah 2:9)"
          },
          "10": {
            "text": "Enter into the rock, and hide thee in the dust, for fear of theLord, and for the glory of his majesty.",
            "citation": "(Isaiah 2:10)"
          },
          "11": {
            "text": "The lofty looks of man shall be humbled, and the haughtiness of men shall be bowed down, and theLordalone shall beexaltedin thatday.",
            "citation": "(Isaiah 2:11)"
          },
          "12": {
            "text": "For thedayof theLordof hostsshall beupon everyone that isproudand lofty, and upon everyone that islifted up; and he shall be broughtlow:",
            "citation": "(Isaiah 2:12)"
          },
          "13": {
            "text": "And upon all thecedarsof Lebanon,that arehigh and lifted up, and upon all the oaks of Bashan,",
            "citation": "(Isaiah 2:13)"
          },
          "14": {
            "text": "And upon all the high mountains, and upon all the hillsthat arelifted up,",
            "citation": "(Isaiah 2:14)"
          },
          "15": {
            "text": "And upon every high tower, and upon every fenced wall,",
            "citation": "(Isaiah 2:15)"
          },
          "16": {
            "text": "Andupon all the ships of Tarshish, and upon all pleasant pictures.",
            "citation": "(Isaiah 2:16)"
          },
          "17": {
            "text": "And the loftiness of man shall be bowed down, and thehaughtinessof men shall be made low: and theLordalone shall be exalted in that day.",
            "citation": "(Isaiah 2:17)"
          },
          "18": {
            "text": "And theidolshe shall utterly abolish.",
            "citation": "(Isaiah 2:18)"
          },
          "19": {
            "text": "And they shall go into theholesof the rocks, and into the caves of the earth, forfearof theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth.",
            "citation": "(Isaiah 2:19)"
          },
          "20": {
            "text": "In that day man shallcasthis idols of silver, and his idols of gold, which they madeeach onefor himself to worship, to the moles and to the bats;",
            "citation": "(Isaiah 2:20)"
          },
          "21": {
            "text": "To go into the clefts of the rocks, and into the tops of the ragged rocks, for fear of theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth.",
            "citation": "(Isaiah 2:21)"
          },
          "22": {
            "text": "Ceaseye from man, whose breathisin his nostrils: forwhereinis he to be accounted of?",
            "citation": "(Isaiah 2:22)"
          }
        }
      },
      "3": {
        "verses": {
          "1": {
            "text": "For, behold, the Lord, theLordof hosts, doth take away fromJerusalemand from Judah the stay and the staff, the whole stay ofbread, and the whole stay of water,",
            "citation": "(Isaiah 3:1)"
          },
          "2": {
            "text": "The mighty man, and the man ofwar, the judge, and the prophet, and the prudent, and theancient,",
            "citation": "(Isaiah 3:2)"
          },
          "3": {
            "text": "The captain of fifty, and the honourable man, and the counsellor, andthe cunning artificer, and theeloquent orator.",
            "citation": "(Isaiah 3:3)"
          },
          "4": {
            "text": "And I will givechildrento betheir princes, and babes shall rule over them.",
            "citation": "(Isaiah 3:4)"
          },
          "5": {
            "text": "And the people shall be oppressed, every one by another, and every one by his neighbour: the child shall behave himself proudly against theancient, and the base against the honourable.",
            "citation": "(Isaiah 3:5)"
          },
          "6": {
            "text": "When man shall take hold of his brother of the house of his father,saying,Thou hast clothing, be thou our ruler, andletthisruinbeunder thy hand:",
            "citation": "(Isaiah 3:6)"
          },
          "7": {
            "text": "In that day shall he swear, saying, I will not bean healer; for in my houseisneither bread nor clothing: make me not ruler of the people.",
            "citation": "(Isaiah 3:7)"
          },
          "8": {
            "text": "ForJerusalemis ruined, and Judah isfallen: because their tongue and their doingsareagainst theLord, to provoke the eyes of his glory.",
            "citation": "(Isaiah 3:8)"
          },
          "9": {
            "text": "The shew of their countenance doth witness against them; and they declare theirsinasSodom, they hideitnot. Woe unto their soul! for they have rewarded evil unto themselves.",
            "citation": "(Isaiah 3:9)"
          },
          "10": {
            "text": "Say ye to therighteous, thatit shall bewellwith him:for they shalleatthe fruit of their doings.",
            "citation": "(Isaiah 3:10)"
          },
          "11": {
            "text": "Woe unto thewicked!it shall beillwith him:forthereward of his hands shall be given him.",
            "citation": "(Isaiah 3:11)"
          },
          "12": {
            "text": "As formy people, childrenaretheir oppressors, andwomenrule over them. O my people, they whichleadthee causetheeto err, and destroy the way of thy paths.",
            "citation": "(Isaiah 3:12)"
          },
          "13": {
            "text": "TheLordstandeth up toplead, and standeth to judge the people.",
            "citation": "(Isaiah 3:13)"
          },
          "14": {
            "text": "TheLordwill enter intojudgmentwith theancientsof his people, and theprincesthereof: for ye haveeaten upthe vineyard; thespoilof thepoorisin your houses.",
            "citation": "(Isaiah 3:14)"
          },
          "15": {
            "text": "What mean yethatyebeatmy people to pieces, and grind the faces of the poor? saith the LordGodof hosts.",
            "citation": "(Isaiah 3:15)"
          },
          "16": {
            "text": "Moreover theLordsaith, Because thedaughtersof Zion arehaughty, andwalkwith stretched forth necks andwantoneyes, walking andmincingasthey go, and making tinkling with their feet:",
            "citation": "(Isaiah 3:16)"
          },
          "17": {
            "text": "Therefore the Lord will smite with scab the crown of the head of the daughters of Zion, and theLordwilldiscover their secret parts.",
            "citation": "(Isaiah 3:17)"
          },
          "18": {
            "text": "In that day the Lord will take away the bravery oftheirtinkling ornamentsabout their feet,andtheircauls, andtheirroundtires like the moon,",
            "citation": "(Isaiah 3:18)"
          },
          "19": {
            "text": "The chains, and the bracelets, and themufflers,",
            "citation": "(Isaiah 3:19)"
          },
          "20": {
            "text": "The bonnets, and the ornaments of the legs, and the headbands, and the tablets, and the earrings,",
            "citation": "(Isaiah 3:20)"
          },
          "21": {
            "text": "The rings, and nose jewels,",
            "citation": "(Isaiah 3:21)"
          },
          "22": {
            "text": "Thechangeable suitsofapparel, and the mantles, and the wimples, and the crisping pins,",
            "citation": "(Isaiah 3:22)"
          },
          "23": {
            "text": "Theglasses, and the fine linen, and the hoods, and the veils.",
            "citation": "(Isaiah 3:23)"
          },
          "24": {
            "text": "And it shall come to pass,thatinstead of sweet smell there shall be stink; and instead of girdlea rent; and instead of well set hairbaldness; and instead ofa stomachera girding of sackcloth;andburninginstead ofbeauty.",
            "citation": "(Isaiah 3:24)"
          },
          "25": {
            "text": "Thymenshall fall by the sword, and thy mighty in the war.",
            "citation": "(Isaiah 3:25)"
          },
          "26": {
            "text": "And hergatesshalllamentandmourn; and shebeingdesolateshall sit upon theground.",
            "citation": "(Isaiah 3:26)"
          }
        }
      },
      "4": {
        "verses": {
          "1": {
            "text": "And in that daysevenwomen shall take hold of oneman, saying, We will eat our own bread, and wear our own apparel: only let us be called by thyname, to take away ourreproach.",
            "citation": "(Isaiah 4:1)"
          },
          "2": {
            "text": "In that day shall thebranchof theLordbebeautifuland glorious, and thefruitof the earthshall beexcellent and comely for them that areescapedof Israel.",
            "citation": "(Isaiah 4:2)"
          },
          "3": {
            "text": "And it shall come to pass,that he that isleftinZion, andhe thatremaineth inJerusalem, shall be called holy,evenevery one that iswritten among the livingin Jerusalem:",
            "citation": "(Isaiah 4:3)"
          },
          "4": {
            "text": "Whenthe Lord shall havewashedaway the filth of the daughters of Zion, and shall havepurgedthe blood of Jerusalem from the midst thereof by the spirit of judgment, and by the spirit ofburning.",
            "citation": "(Isaiah 4:4)"
          },
          "5": {
            "text": "And theLordwill create upon every dwelling place of mountZion, and upon her assemblies, acloudand smoke by day, and the shining of flamingfireby night: for upon all the gloryshall bea defence.",
            "citation": "(Isaiah 4:5)"
          },
          "6": {
            "text": "And there shall be tabernacle for shadow in the daytime from the heat, and for place ofrefuge, and for covert from storm and from rain.",
            "citation": "(Isaiah 4:6)"
          }
        }
      },
      "5": {
        "verses": {
          "1": {
            "text": "Nowwill Isingto my wellbeloved song of my beloved touching hisvineyard. My wellbeloved hath vineyardina very fruitful hill:",
            "citation": "(Isaiah 5:1)"
          },
          "2": {
            "text": "And he fenced it, and gathered out the stones thereof, and planted it with the choicest vine, and built tower in the midst of it, and also made winepress therein: and he looked that it should bring forth grapes, and it brought forth wild grapes.",
            "citation": "(Isaiah 5:2)"
          },
          "3": {
            "text": "And now, O inhabitants of Jerusalem, and men of Judah, judge, I pray you, betwixt me and my vineyard.",
            "citation": "(Isaiah 5:3)"
          },
          "4": {
            "text": "What could have been done more to my vineyard, that I have not done in it? wherefore, when I looked that it should bring forth grapes, brought it forthwild grapes?",
            "citation": "(Isaiah 5:4)"
          },
          "5": {
            "text": "And now go to; I will tell you what I will do to myvineyard: I willtake awaythe hedge thereof, and it shall be eaten up;andbreak down thewallthereof, and it shall be trodden down:",
            "citation": "(Isaiah 5:5)"
          },
          "6": {
            "text": "And I will lay it waste: it shall not be pruned, nor digged; but there shall come up briers and thorns: I will also command the clouds that they rain no rain upon it.",
            "citation": "(Isaiah 5:6)"
          },
          "7": {
            "text": "For thevineyardof theLordof hostsisthe house of Israel, and the men of Judah his pleasant plant: and he looked forjudgment, but behold oppression; for righteousness, but beholda cry.",
            "citation": "(Isaiah 5:7)"
          },
          "8": {
            "text": "Woe unto them thatjoinhouse to house,thatlay field to field, tillthere beno place, that they maybe placed alonein the midst of the earth!",
            "citation": "(Isaiah 5:8)"
          },
          "9": {
            "text": "In mine earssaidtheLordof hosts, Of truth many houses shall be desolate,evengreat and fair, without inhabitant.",
            "citation": "(Isaiah 5:9)"
          },
          "10": {
            "text": "Yea, ten acres of vineyard shall yield onebath, and the seed of an homer shall yield an ephah.",
            "citation": "(Isaiah 5:10)"
          },
          "11": {
            "text": "Woe unto them that rise up early in the morning,thatthey may follow strong drink; that continue until night,tillwineinflame them!",
            "citation": "(Isaiah 5:11)"
          },
          "12": {
            "text": "And the harp, and theviol, thetabret, and pipe, and wine, are in their feasts: but theyregardnot theworkof theLord, neither consider the operation of his hands.",
            "citation": "(Isaiah 5:12)"
          },
          "13": {
            "text": "Therefore my people are gone intocaptivity, becausethey havenoknowledge: and their honourable menarefamished, and their multitude dried up with thirst.",
            "citation": "(Isaiah 5:13)"
          },
          "14": {
            "text": "Therefore hell hath enlarged herself, and opened her mouth without measure: and their glory, and their multitude, and theirpomp, and he that rejoiceth, shall descend into it.",
            "citation": "(Isaiah 5:14)"
          },
          "15": {
            "text": "And the mean man shall be brought down, and the mighty man shall be humbled, and the eyes of theloftyshall be humbled:",
            "citation": "(Isaiah 5:15)"
          },
          "16": {
            "text": "But theLordof hosts shall be exalted injudgment, and God that isholyshall be sanctified in righteousness.",
            "citation": "(Isaiah 5:16)"
          },
          "17": {
            "text": "Then shall the lambs feed after their manner, and the waste places of the fat ones shall strangers eat.",
            "citation": "(Isaiah 5:17)"
          },
          "18": {
            "text": "Woe unto them thatdrawiniquity with cords ofvanity, and sinasit were with cart rope:",
            "citation": "(Isaiah 5:18)"
          },
          "19": {
            "text": "That say,Lethim makespeed,andhastenhis work, that we mayseeit:and let the counsel of the Holy One of Israel draw nigh and come, that we may knowit!",
            "citation": "(Isaiah 5:19)"
          },
          "20": {
            "text": "Woe unto them that callevilgood, and good evil; that putdarknessforlight, and light for darkness; that put bitter for sweet, and sweet for bitter!",
            "citation": "(Isaiah 5:20)"
          },
          "21": {
            "text": "Woe untothem that arewisein their owneyes, andprudentin their own sight!",
            "citation": "(Isaiah 5:21)"
          },
          "22": {
            "text": "Woe untothem that aremighty todrinkwine, and men of strength to mingle strong drink:",
            "citation": "(Isaiah 5:22)"
          },
          "23": {
            "text": "Whichjustifythewickedfor reward, andtakeaway the righteousness of the righteous from him!",
            "citation": "(Isaiah 5:23)"
          },
          "24": {
            "text": "Therefore as the fire devoureth thestubble, and the flame consumeth the chaff,sotheirrootshall be as rottenness, and their blossom shall go up as dust: because they have cast away the law of theLordof hosts, and despised the word of the Holy One of Israel.",
            "citation": "(Isaiah 5:24)"
          },
          "25": {
            "text": "Therefore is theangerof theLordkindled against his people, and he hathstretchedforth his hand against them, and hath smitten them: and the hills did tremble, and their carcasesweretorn in the midst of the streets. For all this his anger is not turned away, but his handisstretched out still.",
            "citation": "(Isaiah 5:25)"
          },
          "26": {
            "text": "And he will lift up anensignto the nations from far, and willhissunto them from theendof the earth: and, behold, they shallcomewith speed swiftly:",
            "citation": "(Isaiah 5:26)"
          },
          "27": {
            "text": "None shall be weary nor stumble among them; none shall slumber nor sleep; neither shall the girdle of their loins be loosed, nor the latchet of their shoes be broken:",
            "citation": "(Isaiah 5:27)"
          },
          "28": {
            "text": "Whose arrowsaresharp, and all their bows bent, their horses hoofs shall be counted like flint, and their wheels like whirlwind:",
            "citation": "(Isaiah 5:28)"
          },
          "29": {
            "text": "Their roaringshall belike lion, they shall roar like younglions: yea, they shall roar, and lay hold of theprey, and shall carryitaway safe, and none shall deliverit.",
            "citation": "(Isaiah 5:29)"
          },
          "30": {
            "text": "And in that day they shall roar against them like the roaring of the sea: and ifonelook unto the land, behold darknessandsorrow, and thelightisdarkenedin the heavens thereof.",
            "citation": "(Isaiah 5:30)"
          }
        }
      },
      "6": {
        "verses": {
          "1": {
            "text": "Inthe year that king Uzziah died Isawalso theLordsitting upon athrone, high and lifted up, andhis trainfilled the temple.",
            "citation": "(Isaiah 6:1)"
          },
          "2": {
            "text": "Above it stood theseraphims:each one had six wings; with twain he covered his face, and with twain he covered his feet, and with twain he did fly.",
            "citation": "(Isaiah 6:2)"
          },
          "3": {
            "text": "And one cried unto another, and said, Holy, holy, holy,istheLordof hosts: the whole earthisfull of hisglory.",
            "citation": "(Isaiah 6:3)"
          },
          "4": {
            "text": "And thepostsof the door moved at the voice of him that cried, and the house was filled withsmoke.",
            "citation": "(Isaiah 6:4)"
          },
          "5": {
            "text": "Then said I, Woeisme! for I amundone; because Iama man ofuncleanlips, and I dwell in the midst of people of unclean lips: for mine eyes haveseentheKing, theLordof hosts.",
            "citation": "(Isaiah 6:5)"
          },
          "6": {
            "text": "Then flew one of the seraphims unto me, having livecoalin his hand,whichhe had taken with the tongs from off the altar:",
            "citation": "(Isaiah 6:6)"
          },
          "7": {
            "text": "And he laiditupon mymouth, and said, Lo, this hath touched thy lips; and thine iniquity istakenaway, and thy sin purged.",
            "citation": "(Isaiah 6:7)"
          },
          "8": {
            "text": "Also I heard the voice of the Lord, saying, Whom shall Isend, and who will go for us? Then said I, HereamI;sendme.",
            "citation": "(Isaiah 6:8)"
          },
          "9": {
            "text": "And he said, Go, and tell this people,Hearye indeed, butunderstandnot; and see ye indeed, butperceivenot.",
            "citation": "(Isaiah 6:9)"
          },
          "10": {
            "text": "Make theheartof this people fat, and make their ears heavy, andshuttheir eyes; lest they see with their eyes, and hear with their ears, and understand with their heart, and convert, and be healed.",
            "citation": "(Isaiah 6:10)"
          },
          "11": {
            "text": "Then said I, Lord,howlong? And he answered, Until the cities be wasted without inhabitant, and the houses without man, and the land be utterly desolate,",
            "citation": "(Isaiah 6:11)"
          },
          "12": {
            "text": "And theLordhave removed men far away, andthere bea great forsaking in the midst of the land.",
            "citation": "(Isaiah 6:12)"
          },
          "13": {
            "text": "But yet in itshall bea tenth, anditshall return, and shall be eaten: as teil tree, and as an oak, whose substanceisin them, when they casttheir leaves: sothe holy seedshall bethesubstancethereof.",
            "citation": "(Isaiah 6:13)"
          }
        }
      },
      "7": {
        "verses": {
          "1": {
            "text": "Andit came to pass in the days of Ahaz the son of Jotham, the son of Uzziah, king of Judah,thatRezinthekingof Syria, andPekahthe son of Remaliah, king of Israel, went up toward Jerusalem to war against it, but could not prevail against it.",
            "citation": "(Isaiah 7:1)"
          },
          "2": {
            "text": "And it was told the house of David, saying, Syria is confederate withEphraim. And his heart was moved, and the heart of his people, as the trees of the wood are moved with the wind.",
            "citation": "(Isaiah 7:2)"
          },
          "3": {
            "text": "Then said theLordunto Isaiah, Go forth now to meet Ahaz, thou,andShear-jashubthy son, at the end of theconduitof the upper poolinthe highway of the fullers field;",
            "citation": "(Isaiah 7:3)"
          },
          "4": {
            "text": "And say unto him,Take heed, and be quiet; fear not, neither be fainthearted for the two tails of these smoking firebrands, for the fierce anger of Rezin with Syria, and of the son of Remaliah.",
            "citation": "(Isaiah 7:4)"
          },
          "5": {
            "text": "Because Syria, Ephraim, and the son of Remaliah, have taken evil counsel against thee, saying,",
            "citation": "(Isaiah 7:5)"
          },
          "6": {
            "text": "Let us go up against Judah, and vex it, and let usmake breachtherein for us, and set king in the midst of it,eventhe son of Tabeal:",
            "citation": "(Isaiah 7:6)"
          },
          "7": {
            "text": "Thus saith the LordGod, It shall not stand, neither shall it come to pass.",
            "citation": "(Isaiah 7:7)"
          },
          "8": {
            "text": "For the head of SyriaisDamascus, and the head of DamascusisRezin; and within threescore and five years shallEphraimbe broken, that it be not people.",
            "citation": "(Isaiah 7:8)"
          },
          "9": {
            "text": "And the head of EphraimisSamaria, and the head of SamariaisRemaliahs son.Ifye will not believe, surely ye shall not be established.",
            "citation": "(Isaiah 7:9)"
          },
          "10": {
            "text": "Moreover theLordspake again unto Ahaz, saying,",
            "citation": "(Isaiah 7:10)"
          },
          "11": {
            "text": "Ask thee sign of theLordthy God; ask it either in the depth, or in the height above.",
            "citation": "(Isaiah 7:11)"
          },
          "12": {
            "text": "But Ahaz said, I will not ask, neither will ItempttheLord.",
            "citation": "(Isaiah 7:12)"
          },
          "13": {
            "text": "And he said, Hear ye now, O house of David;Is ita small thing for you to weary men, but will ye weary my God also?",
            "citation": "(Isaiah 7:13)"
          },
          "14": {
            "text": "Therefore the Lord himself shall give you asign;Behold, avirginshall conceive, and bear ason, and shall call his nameImmanuel.",
            "citation": "(Isaiah 7:14)"
          },
          "15": {
            "text": "Butter and honeyshall he eat, that he may know to refuse the evil, and choose the good.",
            "citation": "(Isaiah 7:15)"
          },
          "16": {
            "text": "Forbeforethe child shall know to refuse theevil, and choose the good, the land that thou abhorrest shall be forsaken of both her kings.",
            "citation": "(Isaiah 7:16)"
          },
          "17": {
            "text": "TheLordshall bring upon thee, and upon thy people, and upon thy fathers house, days that have not come, from the day thatEphraimdeparted fromJudah;eventhe king of Assyria.",
            "citation": "(Isaiah 7:17)"
          },
          "18": {
            "text": "And it shall come to pass in that day,thattheLordshallhissfor the flythatisin the uttermost part of the rivers of Egypt, and for the bee thatisin the land of Assyria.",
            "citation": "(Isaiah 7:18)"
          },
          "19": {
            "text": "And they shall come, and shall rest all of them in the desolate valleys, and in the holes of the rocks, and upon all thorns, and upon all bushes.",
            "citation": "(Isaiah 7:19)"
          },
          "20": {
            "text": "In the same day shall the Lordshavewith razor that is hired,namely,by them beyond the river, by the king of Assyria, the head, and the hair of the feet: and it shall also consume the beard.",
            "citation": "(Isaiah 7:20)"
          },
          "21": {
            "text": "And it shall come to pass in that day,thataman shall nourish young cow, and two sheep;",
            "citation": "(Isaiah 7:21)"
          },
          "22": {
            "text": "And it shall come to pass, for the abundance of milkthattheyshall give he shall eat butter: forbutter and honeyshall every one eat that is left in the land.",
            "citation": "(Isaiah 7:22)"
          },
          "23": {
            "text": "And it shall come to pass in that day,thatevery place shall be, where there were thousand vines at thousandsilverlings, it shallevenbe for briers and thorns.",
            "citation": "(Isaiah 7:23)"
          },
          "24": {
            "text": "With arrows and with bows shallmencome thither; because all the land shall become briers and thorns.",
            "citation": "(Isaiah 7:24)"
          },
          "25": {
            "text": "Andonall hills that shall bedigged with the mattock, there shall not come thither the fear of briers and thorns: but it shall be for the sending forth of oxen, and for the treading oflesser cattle.",
            "citation": "(Isaiah 7:25)"
          }
        }
      },
      "8": {
        "verses": {
          "1": {
            "text": "Moreover theLordsaid unto me, Take thee greatroll, andwritein it witha mans penconcerningMaher-shalal-hash-baz.",
            "citation": "(Isaiah 8:1)"
          },
          "2": {
            "text": "And I took unto me faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah.",
            "citation": "(Isaiah 8:2)"
          },
          "3": {
            "text": "And I went untothe prophetess; and she conceived, and bare son. Then said theLordto me, Call his nameMaher-shalal-hash-baz.",
            "citation": "(Isaiah 8:3)"
          },
          "4": {
            "text": "Forbeforethe child shallhaveknowledge to cry, My father, and my mother, the riches of Damascus and the spoil ofSamariashall betakenaway before the king of Assyria.",
            "citation": "(Isaiah 8:4)"
          },
          "5": {
            "text": "TheLordspake also unto me again, saying,",
            "citation": "(Isaiah 8:5)"
          },
          "6": {
            "text": "Forasmuch as this people refuseth the waters ofShiloahthat go softly, and rejoice inRezinand Remaliahs son;",
            "citation": "(Isaiah 8:6)"
          },
          "7": {
            "text": "Now therefore, behold, the Lord bringeth up uponthemthewatersof the river, strong and many,eventhe king ofAssyria, and all his glory: and he shall come up over all his channels, and go over all his banks:",
            "citation": "(Isaiah 8:7)"
          },
          "8": {
            "text": "And he shallpass through Judah; he shall overflow and go over, he shall reachevento theneck; and the stretching out of his wings shall fill the breadth of thy land, OImmanuel.",
            "citation": "(Isaiah 8:8)"
          },
          "9": {
            "text": "Associate yourselves, O ye people, and ye shall be broken in pieces; and give ear, all ye of far countries: gird yourselves, and ye shall be broken in pieces; gird yourselves, and ye shall be broken in pieces.",
            "citation": "(Isaiah 8:9)"
          },
          "10": {
            "text": "Takecounseltogether, and it shall come to nought; speak the word, and it shall not stand: forGodiswith us.",
            "citation": "(Isaiah 8:10)"
          },
          "11": {
            "text": "For theLordspake thus to mewith strong hand, and instructed me that I should not walk in the way of this people, saying,",
            "citation": "(Isaiah 8:11)"
          },
          "12": {
            "text": "Say ye not, Aconfederacy, to allthem towhom this people shall say, A confederacy; neither fear ye their fear, nor be afraid.",
            "citation": "(Isaiah 8:12)"
          },
          "13": {
            "text": "Sanctify theLordof hostshimself; andlethimbeyour fear, andlethimbeyour dread.",
            "citation": "(Isaiah 8:13)"
          },
          "14": {
            "text": "And he shall be for asanctuary; but for astoneofstumblingand for arockofoffenceto both the houses of Israel, for gin and for asnareto the inhabitants of Jerusalem.",
            "citation": "(Isaiah 8:14)"
          },
          "15": {
            "text": "And many among them shall stumble, and fall, and be broken, and be snared, and be taken.",
            "citation": "(Isaiah 8:15)"
          },
          "16": {
            "text": "Bindup the testimony,sealthelawamong my disciples.",
            "citation": "(Isaiah 8:16)"
          },
          "17": {
            "text": "And I will wait upon theLord, thathidethhisfacefrom the house of Jacob, and I will look for him.",
            "citation": "(Isaiah 8:17)"
          },
          "18": {
            "text": "Behold, I and the children whom theLordhath given meareforsignsand for wonders in Israel from theLordof hosts, which dwelleth in mount Zion.",
            "citation": "(Isaiah 8:18)"
          },
          "19": {
            "text": "And when they shall say unto you, Seek unto them that havefamiliar spirits, and untowizardsthat peep, and that mutter: should not people seek unto their God?forthe living to the dead?",
            "citation": "(Isaiah 8:19)"
          },
          "20": {
            "text": "To thelawand to the testimony: iftheyspeak not according to this word,it isbecausethere isnolightin them.",
            "citation": "(Isaiah 8:20)"
          },
          "21": {
            "text": "Andtheyshall pass through it, hardly bestead and hungry: and it shall come to pass, that when they shall be hungry, they shall fret themselves, andcursetheir king and their God, and look upward.",
            "citation": "(Isaiah 8:21)"
          },
          "22": {
            "text": "And they shall look unto the earth; and behold trouble anddarkness,dimness of anguish; andthey shall bedriven to darkness.",
            "citation": "(Isaiah 8:22)"
          }
        }
      },
      "9": {
        "verses": {
          "1": {
            "text": "Neverthelessthe dimnessshallnotbesuch aswasin her vexation,whenat the first he lightly afflicted the land ofZebulunand the land of Naphtali, and afterward did more grievously afflicther bythe way of the sea, beyond Jordan, in Galilee of the nations.",
            "citation": "(Isaiah 9:1)"
          },
          "2": {
            "text": "The people that walked indarknesshave seen greatlight: they that dwell in the land of the shadow of death, upon them hath the light shined.",
            "citation": "(Isaiah 9:2)"
          },
          "3": {
            "text": "Thou hastmultipliedthenation,andnot increased the joy: they joy before thee according to the joy in harvest,andasmenrejoicewhen they divide the spoil.",
            "citation": "(Isaiah 9:3)"
          },
          "4": {
            "text": "For thou hast broken theyokeof hisburden, and the staff of hisshoulder, therodof his oppressor, asinthe day ofMidian.",
            "citation": "(Isaiah 9:4)"
          },
          "5": {
            "text": "Forevery battle of the warrioriswith confused noise, and garments rolled in blood; butthisshall be withburningandfuel of fire.",
            "citation": "(Isaiah 9:5)"
          },
          "6": {
            "text": "For unto us achildisborn, unto us asonis given: and thegovernmentshall be upon his shoulder: and his name shall be called Wonderful,Counsellor, ThemightyGod, TheeverlastingFather, The Prince ofPeace.",
            "citation": "(Isaiah 9:6)"
          },
          "7": {
            "text": "Of the increase ofhisgovernmentand peacethere shall benoend, upon the throne ofDavid, and upon his kingdom, to order it, and to establish it with judgment and withjusticefrom henceforth even for ever. Thezealof theLordof hosts will perform this.",
            "citation": "(Isaiah 9:7)"
          },
          "8": {
            "text": "The Lord sent word into Jacob, and it hath lighted uponIsrael.",
            "citation": "(Isaiah 9:8)"
          },
          "9": {
            "text": "And all the people shall know,evenEphraim and the inhabitant of Samaria, that say in theprideand stoutness of heart,",
            "citation": "(Isaiah 9:9)"
          },
          "10": {
            "text": "The bricks are fallen down, but we will build with hewn stones: the sycomores are cut down, but we will changethem intocedars.",
            "citation": "(Isaiah 9:10)"
          },
          "11": {
            "text": "Therefore theLordshall set up the adversaries ofRezinagainst him, and join his enemies together;",
            "citation": "(Isaiah 9:11)"
          },
          "12": {
            "text": "The Syriansbefore, and the Philistinesbehind; and they shall devour Israel with open mouth. For all this hisangeris not turned away, buthishandisstretchedout still.",
            "citation": "(Isaiah 9:12)"
          },
          "13": {
            "text": "For the peopleturneth notunto him that smiteth them, neither do theyseektheLordof hosts.",
            "citation": "(Isaiah 9:13)"
          },
          "14": {
            "text": "Therefore theLordwill cut off from Israel head and tail, branch and rush, in one day.",
            "citation": "(Isaiah 9:14)"
          },
          "15": {
            "text": "Theancient and honourable, heisthe head; and theprophetthat teacheth lies, heisthe tail.",
            "citation": "(Isaiah 9:15)"
          },
          "16": {
            "text": "For theleadersof this people causethemto err; andthey that areled of themaredestroyed.",
            "citation": "(Isaiah 9:16)"
          },
          "17": {
            "text": "Therefore the Lord shall have no joy in their young men, neither shall have mercy on their fatherless and widows: for every oneisanhypocriteand an evildoer, and every mouthspeakethfolly. For all this his anger is not turned away, but his handisstretched out still.",
            "citation": "(Isaiah 9:17)"
          },
          "18": {
            "text": "For wickedness burneth as the fire: it shall devour the briers andthorns, and shall kindle in thethicketsof the forest, and they shall mount uplikethe lifting up of smoke.",
            "citation": "(Isaiah 9:18)"
          },
          "19": {
            "text": "Through the wrath of theLordof hosts is the land darkened, andthe people shall be as the fuel of the fire: no man shallsparehisbrother.",
            "citation": "(Isaiah 9:19)"
          },
          "20": {
            "text": "And he shall snatch on the right hand, and be hungry; and he shall eat on the left hand, and they shall not be satisfied: they shalleatevery man thefleshof his own arm:",
            "citation": "(Isaiah 9:20)"
          },
          "21": {
            "text": "Manasseh, Ephraim; and Ephraim, Manasseh:andthey togethershall beagainst Judah. For all this his anger is not turned away, but his handisstretched out still.",
            "citation": "(Isaiah 9:21)"
          }
        }
      },
      "10": {
        "verses": {
          "1": {
            "text": "Woeunto them that decreeunrighteousdecrees, and that write grievousnesswhichthey have prescribed;",
            "citation": "(Isaiah 10:1)"
          },
          "2": {
            "text": "To turn aside the needy fromjudgment, and to take away the right from thepoorof my people, that widows may be their prey, andthatthey may rob the fatherless!",
            "citation": "(Isaiah 10:2)"
          },
          "3": {
            "text": "And what will ye do in the day ofvisitation, and in the desolationwhichshall come from far? to whom will ye flee for help? and where will ye leave your glory?",
            "citation": "(Isaiah 10:3)"
          },
          "4": {
            "text": "Without me they shall bow down under the prisoners, and they shall fall under the slain. For all this his anger is not turned away, but his handisstretched out still.",
            "citation": "(Isaiah 10:4)"
          },
          "5": {
            "text": "OAssyrian, the rod of mine anger, and the staff in their hand is mine indignation.",
            "citation": "(Isaiah 10:5)"
          },
          "6": {
            "text": "I will send him against anhypocriticalnation, and against the people of my wrath will I give him charge, to take the spoil, and to take the prey, and to tread them down like the mire of the streets.",
            "citation": "(Isaiah 10:6)"
          },
          "7": {
            "text": "Howbeit he meaneth not so, neitherdothhis heart think so; butit isin his heart to destroy and cut off nations not few.",
            "citation": "(Isaiah 10:7)"
          },
          "8": {
            "text": "For he saith,Arenot my princes altogether kings?",
            "citation": "(Isaiah 10:8)"
          },
          "9": {
            "text": "Isnot Calno as Carchemish?isnot Hamath as Arpad?isnot Samaria as Damascus?",
            "citation": "(Isaiah 10:9)"
          },
          "10": {
            "text": "As my hand hath found the kingdoms of the idols, and whose graven images did excel them of Jerusalem and of Samaria;",
            "citation": "(Isaiah 10:10)"
          },
          "11": {
            "text": "Shall I not, as I have done unto Samaria and her idols, so do to Jerusalem and her idols?",
            "citation": "(Isaiah 10:11)"
          },
          "12": {
            "text": "Wherefore it shall come to pass,thatwhen the Lord hath performed his whole work upon mount Zion and on Jerusalem, I willpunishthe fruitof the stout heart of the king ofAssyria, and the glory of his high looks.",
            "citation": "(Isaiah 10:12)"
          },
          "13": {
            "text": "For he saith, By thestrengthof my hand I have doneit,and by my wisdom; for I am prudent: and I have removed the bounds of the people, and have robbed their treasures, and I have put down the inhabitants like valiantman:",
            "citation": "(Isaiah 10:13)"
          },
          "14": {
            "text": "And my hand hath found as nest the riches of the people: and as one gathereth eggsthat areleft, have I gathered all the earth; and there was none that moved the wing, or opened the mouth, or peeped.",
            "citation": "(Isaiah 10:14)"
          },
          "15": {
            "text": "Shallthe axeboastitself against him that heweth therewith?orshall the saw magnify itself against him thatshakethit? as if the rod should shakeitselfagainst themthat lift it up,oras if the staff should lift upitself, as if it wereno wood.",
            "citation": "(Isaiah 10:15)"
          },
          "16": {
            "text": "Therefore shall the Lord, the Lord of hosts, send among hisfatones leanness; and underhisglory he shall kindle burning like the burning of fire.",
            "citation": "(Isaiah 10:16)"
          },
          "17": {
            "text": "And the light of Israel shall be for fire, and his Holy One for flame: and it shall burn and devour histhornsand his briers in one day;",
            "citation": "(Isaiah 10:17)"
          },
          "18": {
            "text": "And shall consume the glory of his forest, and of his fruitful field, bothsoul and body: and they shall be as when standardbearer fainteth.",
            "citation": "(Isaiah 10:18)"
          },
          "19": {
            "text": "And the rest of the trees of his forest shall be few, that child may write them.",
            "citation": "(Isaiah 10:19)"
          },
          "20": {
            "text": "And it shall come to pass inthat day,thatthe remnant of Israel, and such as areescapedof the house of Jacob, shall no more againstay uponhim that smote them; but shall stay upon theLord, the Holy One of Israel, in truth.",
            "citation": "(Isaiah 10:20)"
          },
          "21": {
            "text": "Theremnantshallreturn,eventhe remnant of Jacob, unto the mighty God.",
            "citation": "(Isaiah 10:21)"
          },
          "22": {
            "text": "For though thy people Israel be as thesandof the sea,yeta remnant of them shallreturn:theconsumptiondecreedshall overflow with righteousness.",
            "citation": "(Isaiah 10:22)"
          },
          "23": {
            "text": "For the LordGodof hosts shallmake consumption, even determined, in the midst of all the land.",
            "citation": "(Isaiah 10:23)"
          },
          "24": {
            "text": "Therefore thus saith the LordGodof hosts, O my people that dwellest in Zion, be not afraid of the Assyrian: he shallsmitethee with rod, and shall lift up his staff against thee, after the manner ofEgypt.",
            "citation": "(Isaiah 10:24)"
          },
          "25": {
            "text": "For yet very littlewhile, and theindignationshall cease, and mine anger in their destruction.",
            "citation": "(Isaiah 10:25)"
          },
          "26": {
            "text": "And theLordof hosts shall stir up scourge for him according to the slaughter ofMidianat the rock ofOreb: andashisrodwasupon the sea, so shall he lift it up after the manner ofEgypt.",
            "citation": "(Isaiah 10:26)"
          },
          "27": {
            "text": "And it shall come to pass in that day,thathisburdenshall be taken away from off thy shoulder, and his yoke from off thy neck, and theyokeshall be destroyed because of theanointing.",
            "citation": "(Isaiah 10:27)"
          },
          "28": {
            "text": "Heis come to Aiath, he is passed to Migron; at Michmash he hath laid up his carriages:",
            "citation": "(Isaiah 10:28)"
          },
          "29": {
            "text": "They are gone over the passage: they have taken up their lodging at Geba; Ramah is afraid; Gibeah of Saul is fled.",
            "citation": "(Isaiah 10:29)"
          },
          "30": {
            "text": "Lift up thy voice, O daughter of Gallim: cause it to be heard unto Laish, O poor Anathoth.",
            "citation": "(Isaiah 10:30)"
          },
          "31": {
            "text": "Madmenah is removed; the inhabitants of Gebim gather themselves to flee.",
            "citation": "(Isaiah 10:31)"
          },
          "32": {
            "text": "As yet shall he remain at Nob that day: he shall shake his handagainstthe mount of the daughter of Zion, the hill of Jerusalem.",
            "citation": "(Isaiah 10:32)"
          },
          "33": {
            "text": "Behold, the Lord, theLordof hosts, shall lop the bough withterror: and the high ones of statureshall behewn down, and thehaughtyshall be humbled.",
            "citation": "(Isaiah 10:33)"
          },
          "34": {
            "text": "And he shall cut down thethicketsof the forest with iron, and Lebanon shall fallbya mighty one.",
            "citation": "(Isaiah 10:34)"
          }
        }
      },
      "11": {
        "verses": {
          "1": {
            "text": "Andthere shall come forth arodout of thestemofJesse, and aBranchshall grow out of his roots:",
            "citation": "(Isaiah 11:1)"
          },
          "2": {
            "text": "And thespiritof theLordshall rest upon him, the spirit ofwisdomandunderstanding, the spirit ofcounseland might, the spirit of knowledge and of the fear of theLord;",
            "citation": "(Isaiah 11:2)"
          },
          "3": {
            "text": "And shall make him of quick understanding in the fear of theLord: and he shall notjudgeafterthe sight of his eyes, neither reprove after the hearing of his ears:",
            "citation": "(Isaiah 11:3)"
          },
          "4": {
            "text": "But with righteousness shallhejudgethe poor, andreprove with equityfor themeekof the earth: and he shallsmitethe earth with the rod of his mouth, and with thebreathof his lips shall heslaythe wicked.",
            "citation": "(Isaiah 11:4)"
          },
          "5": {
            "text": "And righteousness shall be thegirdleof his loins, and faithfulness the girdle of hisreins.",
            "citation": "(Isaiah 11:5)"
          },
          "6": {
            "text": "Thewolfalso shall dwell with the lamb, and the leopard shall lie down with the kid; and the calf and the young lion and the fatling together; and little child shall lead them.",
            "citation": "(Isaiah 11:6)"
          },
          "7": {
            "text": "And the cow and the bear shall feed; their young ones shall lie down together: and the lion shall eat straw like the ox.",
            "citation": "(Isaiah 11:7)"
          },
          "8": {
            "text": "And the sucking child shall play on the hole ofthe asp, and the weaned child shall put his hand on thecockatriceden.",
            "citation": "(Isaiah 11:8)"
          },
          "9": {
            "text": "They shall nothurtnordestroyin all my holymountain: for theearthshall be full of theknowledgeof theLord, as the waters cover the sea.",
            "citation": "(Isaiah 11:9)"
          },
          "10": {
            "text": "And inthat daythere shall be aroot of Jesse, which shall stand for anensignof the people;to itshall theGentilesseek: and hisrestshall be glorious.",
            "citation": "(Isaiah 11:10)"
          },
          "11": {
            "text": "And it shall come to pass in that day,thatthe Lord shall set his hand again thesecondtime torecovertheremnantof his people, which shall be left, from Assyria, and from Egypt, and from Pathros, and from Cush, and from Elam, and from Shinar, and from Hamath, and from theislandsof the sea.",
            "citation": "(Isaiah 11:11)"
          },
          "12": {
            "text": "And he shall set up anensignfor the nations, and shall assemble the outcasts of Israel, and gather together the dispersed of Judah from the four corners of the earth.",
            "citation": "(Isaiah 11:12)"
          },
          "13": {
            "text": "The envy also of Ephraim shall depart, and the adversaries of Judah shall be cut off: Ephraim shall notenvyJudah, and Judah shall not vex Ephraim.",
            "citation": "(Isaiah 11:13)"
          },
          "14": {
            "text": "But they shallflyupon theshouldersof the Philistines toward the west;they shall spoilthem of the east together: they shall lay their hand upon Edom and Moab; and the children of Ammon shall obey them.",
            "citation": "(Isaiah 11:14)"
          },
          "15": {
            "text": "And theLordshall utterlydestroythe tongue of theEgyptiansea; and with his mighty wind shall he shake his hand over the river, and shall smite it in the seven streams, and makemengo over dryshod.",
            "citation": "(Isaiah 11:15)"
          },
          "16": {
            "text": "And there shall beanhighwayfor the remnant of his people, which shall be left, from Assyria; like as it was to Israel in the day that he came up out of the land of Egypt.",
            "citation": "(Isaiah 11:16)"
          }
        }
      },
      "12": {
        "verses": {
          "1": {
            "text": "Andin that daythou shalt say,OLord, I will praise thee: though thou wast angry with me, thine anger is turned away, and thou comfortedst me.",
            "citation": "(Isaiah 12:1)"
          },
          "2": {
            "text": "Behold, Godismy salvation; I will trust, and not be afraid: for theLordJehovahismystrengthandmysong; he also is become mysalvation.",
            "citation": "(Isaiah 12:2)"
          },
          "3": {
            "text": "Therefore withjoyshall ye draw water out of the wells of salvation.",
            "citation": "(Isaiah 12:3)"
          },
          "4": {
            "text": "And in that day shall ye say,PraisetheLord,call uponhis name, declare his doings among the people, make mention that his name is exalted.",
            "citation": "(Isaiah 12:4)"
          },
          "5": {
            "text": "Singunto theLord; for he hath done excellent things: thisisknown in all the earth.",
            "citation": "(Isaiah 12:5)"
          },
          "6": {
            "text": "Cry out and shout, thouinhabitantof Zion: for greatisthe Holy One of Israel in themidstof thee.",
            "citation": "(Isaiah 12:6)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 70987,
  "total_sources": 14,
  "generated_at": "2025-12-14T04:01:27.391863"
}