{
  "week_number": 11,
  "date_range": "Genesis 37–41",
  "title": "",
  "primary_scriptures": [
    {
      "book": "Genesis",
      "chapters": [
        "37",
        "38",
        "39",
        "40",
        "41"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Genesis",
      "chapters": [
        "37",
        "38",
        "39",
        "40",
        "41"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM:  ---\nWe know that God blesses people who trust Him and keep His commandments. But sometimes it doesn’t seem that way. Sometimes the person who trusts God is abused and abandoned by family members. Sometimes the person who bravely refuses to violate the law of chastity gets falsely accused anyway. When things like that happen to us, we might be tempted to become angry with God. We might wonder, “What’s the point of trying to do the right thing if it only seems to make life harder?”\nJoseph, the son of Jacob, could have wondered that. At times, this faithful man prospered; at other times, it seemed that the more faithful he was, the more hardship he faced. But Joseph never left the Lord, and the Lord never left Joseph. That doesn’t mean the Lord prevented bad things from happening to Joseph, but through it all, “the Lord was with him” (\nGenesis 39:3\n).\nIdeas for Learning at Home and at Church\nGenesis 37:1–28\n;\n39\n;\n41:9–45\nThe Lord will be with me in my adversity.\nTime and again, good fortune seemed to abandon Joseph, but the Lord never did. As you read Joseph’s story, ponder questions such as these: What did Joseph do to stay close to the Lord? How was the Lord “with him”? (see\nGenesis 39\n;\n40:1–19\n;\n41:9–45\n). What do you learn from Joseph’s story that could help you recognize the Lord’s presence in your life?\nYou might also ask similar questions about your life. What evidence have you seen that the Lord has not forsaken you in times of trial? Consider how you can share your experiences with family members and future generations (see\n1 Nephi 5:14\n).\nOf course, you will have other trials in the future. What can you do now to help ensure that these trials don’t pull you away from the Lord? Consider writing a letter to encourage your future self to stay close to Him no matter what. You might include insights from Joseph’s life or from President D. Todd Christofferson’s message “\nOur Relationship with God\n” (\nLiahona\n, May 2022, 78–81).\nSee also\nJohn 14:18\n;\nRomans 8:28\n;\nAlma 36:3\n;\nDoctrine and Covenants 121:7–8\n; “\nAbide with Me!\n,”\nHymns\n, no. 166.\nGenesis 37:5–11\n;\n40\n;\n41:1–38\nIf I am faithful, the Lord will guide and inspire me.\nJoseph had a gift for discerning messages from the Lord through dreams. What can you learn from\nGenesis 37:5–11\n;\n40:5–8\n;\n41:14–25, 37–38\nabout receiving and understanding revelation from the Lord? For instance, what can you learn from Joseph’s example when revelation seems difficult to understand? (see\nGenesis 40:8\n;\n41:16\n).\nPonder how the Lord is revealing His will to you. What are you doing to act on revelation He has given you? How are you seeking additional guidance from Him?’\nJoseph Interpreting the Butler and Baker’s Dreams\n, by François Gérard\nGenesis 39:1–20\nWith the Lord’s help, I can flee temptation.\nIf Joseph were to give counsel on how to resist temptation to commit sexual sin, what do you think he would say? Think about this as you read about his experience in\nGenesis 39\n. For example, consider how Joseph might respond to concerns like these:\nIf no one else knows what I’m doing, what’s the big deal? (see\nverses 8–9\n).\nI try to resist, but the temptation just doesn’t seem to stop (see\nverse 10\n).\nWhat should I do when I’m in a situation where temptation is strong? (see\nverse 12\n).\nHow would you explain why obeying the law of chastity is important? (see\nFor the Strength of Youth: A Guide for Making Choices\n,\n23–28\n).\nJoseph’s example, of course, can apply to other kinds of temptation. With Joseph’s experience in mind, consider making a plan for avoiding and resisting temptation. For example, you could think of a temptation and write down situations to avoid and how you will “flee” when the temptation arises.\nTemptation\nSituations to avoid\nPlan to respond\nHere are some other scriptures that could inform your plan. What do you learn from each about how the Savior can help you resist temptation?\nMatthew 4:1–11\n;\n1 Corinthians 10:13\n;\n1 Nephi 15:23–24\n;\n3 Nephi 18:17–18\n.\nAs you make your plan, it might also help to think about times in the past when you successfully avoided or resisted temptation. How did the Savior help you? (see\n2 Nephi 4:18–33\n).\nGenesis 41:15–57\nThe Lord will help me prepare for possible hardships.\nJoseph’s interpretation of Pharaoh’s dream led to some very wise and practical counsel for surviving a famine (see\nGenesis 41:15–57\n). Consider what spiritual messages the Lord might have for you in this account. How do you feel He wants you to prepare for hardships in your future?\nSee also David A. Bednar, “\nWe Will Prove Them Herewith\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 8–11.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nHow was Joseph similar to Jesus Christ?\nWhat does the Book of Mormon teach about Joseph’s coat?\nWhat do we understand about what took place between Judah and Tamar?\nClick to see more.\nIdeas for Teaching Children\nGenesis 37\nI can be kind to my family.\nReading about the hard feelings in Joseph’s family could prompt a discussion about how we should treat family members. To tell the story of Joseph and his brothers from\nGenesis 37\n, you could use the pictures in this outline or in “\nJoseph’s Inspired Dreams\n” (in\nOld Testament Stories\n, 47–51). Let your children share details they know about the story. You might ask your children to imagine they were in Joseph’s family. What would they have said or done to be a peacemaker in the family? For example, what does it mean to “speak peaceably” in our family? (\nverse 4\n). How is Jesus Christ a peacemaker in God’s family?\n2:17\nJoseph’s Inspired Dreams\nGenesis 37:18–28\n;\n39:20–23\n;\n41:38\nGod can help me when bad things happen.\nWhen your children face hard times, they need to know that the Lord will be with them, as He was with Joseph. Perhaps you could help your children make a list of hard things that happened to Joseph (see\nGenesis 37:23–28\n;\n39:20\n; or “\nJoseph’s Inspired Dreams\n” and “\nJoseph in Egypt\n,” in\nOld Testament Stories\n, 47–51, 52–56). After each hardship they find, invite your children to repeat, “The Lord was with Joseph” (\nGenesis 39:2\n).\n2:17\nJoseph’s Inspired Dreams\n2:50\nJoseph in Egypt\nPerhaps your children could search\nGenesis 39:1–3, 20–23\nfor every instance of the phrase “The Lord was with Joseph” and similar phrases. Let them share what they think this phrase means. How do we know that the Lord is with us? Tell each other about how you felt God was with you during a challenging time.\nJoseph of Egypt in Prison\n, by Jeff Ward (detail)\nGenesis 39:7–12\nWith the Lord’s help, I can flee temptation.\nHere’s an object lesson that can help your children follow Joseph’s example of fleeing from Potiphar’s wife: Use two magnets to represent Jesus Christ and Satan. Use a small metal object, like a paper clip, to represent us. Then let your children see how the influence of a magnet on the metal object is stronger when they move the object closer to it. How does Joseph’s experience in\nGenesis 39:7–12\nillustrate this truth? What can we do to move away from sin and closer to Jesus? The video “Temptation Fades as We Seek Christ in Every Thought” (Gospel Library) and a song like “\nI Need Thee Every Hour\n” (\nHymns\n, no. 98) can help with this discussion.\n2:58\nTemptation Fades as We Seek Christ in Every Thought\nUse music.\n“Hymns and other sacred songs can help children feel God’s love, feel the Spirit, and learn gospel truths. The melodies, rhythms, and simple rhymes can help children remember gospel truths for years to come. As you sing with children, help them discover and understand the principles taught in the songs” (\nTeaching in the Savior’s Way\n,\n32\n).\nHelp your children think of temptations they might face. Let them role-play how they could “flee” from these temptations.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 11: Lesson 33: Lesson 33—Genesis 37–41This lesson can help students feel hope that God can use their trials to bless their lives.; Lesson 34: Lesson 34—Genesis 39This lesson can help students show their devotion to God by resisting the temptation to break the law of chastity. ---\n\n--- Lesson 33 ---\nDespite being sold as a slave, falsely accused, and imprisoned, Joseph lived righteously and exercised faith in God. As a result, the Lord blessed and helped him through his trials. This lesson can help students feel hope that God can use their trials to bless their lives. Student preparation: Invite students to think about trials or challenges they have faced or might face. Invite them to come to class prepared to share how the Lord can use or has used challenges to bless their life. Possible Learning Activities A donkey fable Consider displaying a picture of a donkey as a student reads the following paragraph. The fable has been told of a donkey that fell into a pit. Scared and trapped, the donkey whined and brayed. After searching for a way to rescue the donkey, the owner began to shovel dirt into the pit. Each shovel full of dirt landed on the donkey’s back, making it whine more. Before continuing the story, it may be helpful for students to pause and think about the fable by responding to questions like the following: Would you consider the shovels of dirt to be a good thing or a bad thing? Why? What could the shovels full of dirt represent in our lives? Invite a student to read the conclusion of the fable in the following paragraph. The donkey would shake the dirt off its back, causing mounds of dirt to pile underneath. Over and over, the donkey repeated the actions of shaking the dirt off and stepping onto the growing mound, until eventually the donkey rose high enough on the dirt to escape from the pit. How can this fable relate to the trials and challenges Heavenly Father allows us to experience? Consider displaying the following and inviting students to complete it on their own. Think about times in your life when you have had trials or times of discouragement. Record your responses to some of the following questions in your study journal: How have you responded to those experiences? Why can it be hard to remember the Lord when you are facing challenges? From an eternal perspective, how is it possible for Heavenly Father to use your challenges to bless your life? As you study the life of Joseph today, seek revelation from the Holy Ghost to give you hope that Heavenly Father and Jesus Christ can turn even difficult trials into blessings in your life. Overview of Genesis 37–41 To help students understand the storyline of Genesis 37–41 , you could display the five images included below in random order. Students could work together as a class or in small groups to place them in chronological order. You could then have a few students use the images to briefly summarize the story in Genesis 37–41 . Students could use the summaries below each image or chapter headings to help them summarize or to verify the order of the images. When Joseph was 17 years old, his older brothers envied his favored status with their father, Jacob. They hated Joseph for sharing dreams he had about them bowing before him in the future. In time, they sold Joseph as a slave (see Genesis 37 ). Joseph was sold to Potiphar, an officer to the Egyptian Pharaoh. Joseph eventually became the overseer of Potiphar’s house (see Genesis 39:1–4 ). Potiphar’s wife lusted after Joseph, but Joseph refused to break the law of chastity and fled from her. Potiphar’s wife falsely accused Joseph of mistreating her, and he was cast into prison (see Genesis 39:7–20 ). While in prison, Joseph interpreted the dreams of Pharaoh’s servants (see Genesis 40 ). Two years later, Pharaoh had dreams that he could not understand. One of Pharaoh’s servants, who had been released from prison, told Pharaoh that Joseph could interpret dreams. Joseph taught Pharaoh that his dreams represented seven years of good harvests and seven years of famine that would soon come to Egypt (see Genesis 41 ). Blessings from our trials To help students identify lessons we can learn from Joseph’s experience, consider placing the students in small groups and providing or displaying the following instructions and questions. Note : Lesson 34, “ Genesis 39 ,” will focus on the law of chastity. Read the following verses looking for how the Lord helped Joseph during his trials. Genesis 39:1–6 (After Joseph was sold as a slave by his brothers) Genesis 39:20–23 (After Joseph was cast into prison by Potiphar) Genesis 41:14–16, 25–32 (After Joseph was finally released from prison) Answer the following questions: What truths can we learn from how Joseph responded to his challenges? Why do you think Joseph had to wait so many years to receive the blessings he sought? What evidence do you see of God helping Joseph in his trials? How can Heavenly Father and Jesus Christ help us in similar ways when we go through hard times? Walk around and listen as students discuss their answers with their groups. Thank them for sharing what they found. Remind students that the Holy Ghost can teach people different truths from the same scripture passages. The remainder of this lesson will focus on the truth that if we are faithful, God can use our trials to bless our lives and others . Read Genesis 41:37–45 , looking for evidence of how God used Joseph’s trials to bless him and others. How did the Lord bless Joseph and others through his trials? Ask questions that can help students learn about God’s power and mercy from the truths being taught. The following questions are examples that you might use. (For additional training on helping students learn about the Lord’s love, power, and mercy, see “ Help learners recognize the Lord’s love, power, and mercy in their lives ” in Teacher Development Skills. What do you think Joseph might want you to know about the Lord after the experiences he went through? How could trials help us strengthen our relationship with Heavenly Father and Jesus Christ? Read Doctrine and Covenants 90:24 and the following statement by Elder Dieter F. Uchtdorf of the Quorum of the Twelve Apostles. Look for how they apply to Joseph and all who experience trials and challenges. It is my witness that though at times we may feel buried by the trials of life or surrounded by emotional darkness, the love of God and the blessings of the restored gospel of Jesus Christ will bring something unimaginable to spring forth. (“ God Will Do Something Unimaginable ,” Ensign or Liahona , Nov. 2020, 52) How do Doctrine and Covenants 90:24 and Elder Uchtdorf’s statement apply to Joseph? To you? Modern-day examples To prepare students to reflect on how Heavenly Father can bless us in our trials, consider showing “ Faith Murray’s Story: Overcoming Adversity through Service ” (4:52), available at ChurchofJesusChrist.org . Invite students to look for how the Lord used Faith’s challenges to bless her and others. 4:52 Think about experiences you, or others, have had when you have seen Heavenly Father use your trials to bless your life. Respond to at least two of the following questions in your study journal: How have you seen Heavenly Father use trials to bless the lives of people you know? What have you learned from those people? If someone were in the middle of a difficult trial right now, what would you want them to know about Heavenly Father and Jesus Christ? What has helped you remain faithful to God during the trials you have experienced in your life? Students could be invited to share their experiences along with their feelings for the Savior.\n\n\n--- Lesson 34 ---\nAfter Joseph became an overseer in Potiphar’s house, Potiphar’s wife tempted him to break the law of chastity. Joseph knew that succumbing to that temptation was a “sin against God” and chose to flee from the temptation (see Genesis 39:9, 12 ). This lesson can help students show their devotion to God by resisting the temptation to break the law of chastity. Student preparation: Invite students to imagine they were asked to lead a discussion in their Sunday School class about different ways they can resist Satan’s temptations. Invite students to think of three ways they would share with their class. Possible Learning Activities Temptations we face Consider having the class make a list on the board of temptations youth face today. To help students think more about the temptations they personally face and how they respond to them, you could invite each student to complete the following activity on a piece of paper. Choose a temptation and write a brief, realistic scenario where a teenager could face that temptation. Collect the scenarios and redistribute them among the class. Read through your new scenario. On the back of the paper, write what might make it difficult to resist that temptation. Also write two things you might encourage someone to do to help them resist or overcome that temptation. Point out to students that although they may not face the same temptation listed in the scenario, they may be able to apply similar counsel to their own situations. Help students assess their own ability to resist or overcome temptation. Think about the temptations you personally face. What have you done, or could you do, to gain strength from Heavenly Father and Jesus Christ to resist those temptations? You might invite students to add to what they wrote in the scenario with their own experiences. Encourage them to continue adding ideas to their scenario as they study Genesis 39 . Let them know that as they seek help from the Holy Ghost, He can inspire them with ideas to resist and even overcome the temptations that they face. Joseph’s experience with temptation If you used pictures to summarize the events of Joseph’s life in Lesson 33: “ Genesis 37–41 ,” consider displaying them again. Invite a student to summarize what they remember about how the Lord blessed Joseph in Potiphar’s house. If students need help, invite them to read and summarize Genesis 39:1–6 . Read Genesis 39:7–8 , looking for what happened to Joseph after he became overseer in Potiphar’s house. What temptation did Joseph face? Explain that Joseph faced the temptation to break the law of chastity. Help students reflect on what they understand about the law of chastity by inviting them to do the following. In your study journal, write how you would define the law of chastity and why it is important. When students are done writing, consider displaying the following statement. Invite students to read it on their own, looking for insights that they could add to what they wrote in their study journals. For the Strength of Youth: A Guide for Making Choices states the following about the law of chastity: The law of chastity states that God approves of sexual activity only between a man and a woman who are married. … Outside of marriage between a man and a woman, it is wrong to touch the private, sacred parts of another person’s body even if clothed. In your choices about what you do, look at, read, listen to, think about, post, or text, avoid anything that purposely arouses lustful emotions in others or yourself. This includes pornography in any form. ( For the Strength of Youth: A Guide for Making Choices , 23, 25) Why do you think Heavenly Father has given us the law of chastity? What are some ways Satan tempts youth to break the law of chastity? Possible answers students may give include taking or sending inappropriate pictures, viewing or listening to media that is sexually suggestive or explicit, not keeping sex or sexual feelings sacred. If students have questions about same-sex attraction, it may be helpful to explain that “feeling same-sex attraction is not a sin. If [someone has] these feelings and [does] not pursue or act on them, [they] are living Heavenly Father’s sacred law of chastity” ( For Strength of Youth: A Guide for Making Choices , 27). Read Genesis 39:9–12 , looking for how Joseph resisted the temptation to break the law of chastity. Genesis 39:9 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. What did you learn from Joseph’s example? Students may identify truths such as: Our devotion to God can give us strength to resist the temptation to break the law of chastity ( verse 9 ). Students could mark in their scriptures what Joseph’s devotion to God enabled him to do, for example, in verse 8 (“he refused”), verse 10 (“he hearkened not”), and verse 12 (“got him out”). To help students answer the following question, you may want to provide them with a scenario they can use to share how someone could do the three things Joseph did. A possible scenario could involve being invited to a movie, show, or concert where immoral images and words are used. Another possible scenario could involve feeling pressure to send inappropriate texts or pictures to peers. What are some ways we can follow Joseph’s example when we face temptation? Strengthening our ability to keep the law of chastity To help students deepen their understanding of this truth, distribute the accompanying handout to students. Consider placing students in pairs and assigning each partner to focus on one of the questions on the handout. Open PDF Invite students to share what they learned with their partners. The Savior can help us overcome temptation You may have students who are struggling with obeying the law of chastity and need to feel hope in repenting and overcoming addiction. Testify of the loving, patient, and forgiving nature of Heavenly Father and Jesus Christ. Consider showing the video “ Temptation Fades as We Seek Christ in Every Thought ” (2:57), available at ChurchofJesusChrist.org . Invite students to look for how the Savior can give us hope. 2:58 Elder Dale G. Renlund of the Quorum of the Twelve Apostles taught how the Savior can give hope to those who have struggled with keeping God’s commandments. No matter how long we have been off the path or how far away we have wandered, the moment we decide to change, God helps us return. From God’s perspective, through sincere repentance and pressing forward with a steadfastness in Christ, once back on the path, it will be as if we were never off. The Savior pays for our sins and frees us from the looming decrease in happiness and blessings. (“ Choose You This Day ,” Ensign or Liahona , Nov. 2018, 106) What would you want someone who feels hopeless because of their previous choices to understand from Elder Renlund’s statement? What has helped you to resist temptation that you might suggest to other people? Making a plan to keep the law of chastity To help students make a plan to act on what the Spirit has taught them about keeping the law of chastity, give them a few minutes to respond to the following questions in their study journals. What did you learn that can help you keep the law of chastity or resist other temptations? What did you learn about being devoted to God? How will you begin to apply what you have learned and felt today? Encourage students to involve Heavenly Father and Jesus Christ in their efforts to resist temptation. Consider sharing your testimony of the Savior’s ability to help us overcome temptation and His loving mercy in helping us repent. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase is “How then can I do this great wickedness, and sin against God?” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n--- SCRIPTURE: Genesis 37 ---\n1. And Jacob dwelt in the landwhereinhis father was astranger, in the land of Canaan.\n2. Thesearethegenerationsof Jacob.Joseph,beingseventeen years old, was feeding the flock with his brethren; and the ladwaswith the sons of Bilhah, and with the sons of Zilpah, his fathers wives: and Joseph brought unto his father their evil report.\n3. Now Israel lovedJosephmore than all his children, because hewasthe son of his old age: and he made him acoatofmanycolours.\n4. And when his brethren saw thattheir father loved him more than all his brethren, they hated him, and could not speak peaceably unto him.\n5. And Joseph dreamed adream, and he toldithis brethren: and they hated him yet the more.\n6. And he said unto them, Hear, I pray you, this dream which I have dreamed:\n7. For, behold, wewerebinding sheaves in the field, and, lo, my sheaf arose, and also stood upright; and, behold, your sheaves stood round about, and madeobeisanceto my sheaf.\n8. And his brethren said to him, Shalt thou indeed reign over us? or shalt thou indeed have dominion over us? And they hated him yet the more for his dreams, and for his words.\n9. And he dreamed yet another dream, and told it his brethren, and said, Behold, I have dreamed dream more; and, behold, the sun and the moon and the eleven stars made obeisance to me.\n10. And he tolditto his father, and to his brethren: and his father rebuked him, and said unto him, Whatisthis dream that thou hast dreamed? Shall I and thy mother and thy brethren indeed come tobowdown ourselves to thee to the earth?\n11. And his brethrenenviedhim; but his father observed the saying.\n12. And his brethren went to feed their fathersflockin Shechem.\n13. And Israel said unto Joseph, Do not thy brethren feedthe flockin Shechem? come, and I will send thee unto them. And he said to him, Heream I.\n14. And he said to him, Go, I pray thee, see whether it be well with thy brethren, and well with the flocks; and bring me word again. So he sent him out of the vale of Hebron, and he came to Shechem.\n15. And certain man found him, and, behold,he waswandering in the field: and the man asked him, saying, What seekest thou?\n16. And he said, I seek my brethren: tell me, I pray thee, where they feedtheir flocks.\n17. And the man said, They are departed hence; for I heard them say, Let us go to Dothan. And Joseph went after his brethren, and found them in Dothan.\n18. And when they saw him afar off, even before he came near unto them, theyconspiredagainst him to slay him.\n19. And they said one to another, Behold, thisdreamercometh.\n20. Come now therefore, and let us slay him, and cast him into some pit, and we will say, Some evil beast hath devoured him: and we shall see what will become of his dreams.\n21. AndReubenheardit,and he delivered him out of their hands; and said, Let us not kill him.\n22. And Reuben said unto them, Shed no blood,butcast him into this pit thatisin the wilderness, and lay no hand upon him; that he might rid him out of their hands, to deliver him to his father again.\n23. And it came to pass, when Joseph was come unto his brethren, that they stript Joseph out of hiscoat,hiscoat ofmanycolours thatwason him;\n24. And they took him, and cast him into pit: and the pitwasempty,there wasno water in it.\n25. And they sat down to eat bread: and they lifted up their eyes and looked, and, behold, company of Ishmeelites came from Gilead with their camels bearing spicery and balm and myrrh, going to carryitdown to Egypt.\n26. And Judah said unto his brethren, What profitis itif we slay our brother, and conceal his blood?\n27. Come, and let us sell him to the Ishmeelites, and let not our hand be upon him; for heisour brotherandour flesh. And his brethrenwere content.\n28. Then there passed by Midianites merchantmen; and they drew and lifted up Joseph out of the pit, and sold Joseph to theIshmeelitesfor twentypiecesof silver: and they brought Joseph into Egypt.\n29. And Reuben returned unto the pit; and, behold, Josephwasnot in the pit; and he rent his clothes.\n30. And he returned unto his brethren, and said, The childisnot; and I, whither shall I go?\n31. And they took Josephs coat, and killed kid of the goats, and dipped the coat in the blood;\n32. And they sent the coat ofmanycolours, and they broughtitto their father; and said, This have we found: know now whether itbethy sons coat or no.\n33. And he knew it, and said,It ismy sonscoat; an evil beast hath devoured him; Joseph is without doubtrentin pieces.\n34. And Jacob rent his clothes, and put sackcloth upon his loins, and mourned for his son many days.\n35. And all hissonsand all his daughters rose up to comfort him; but he refused to becomforted; and he said, For I will go down into the grave unto my sonmourning. Thus his father wept for him.\n36. And the Midianitessoldhim into Egypt untoPotiphar, anofficerof Pharaohs,andcaptain of the guard.\n\n--- SCRIPTURE: Genesis 38 ---\n1. And it came to pass at that time, that Judah went down from his brethren, and turned in to certain Adullamite, whose namewasHirah.\n2. And Judah saw there adaughterof certain Canaanite, whose namewasShuah; and he took her, and went in unto her.\n3. And she conceived, and bare son; and he called his nameEr.\n4. And she conceived again, and bare son; and she called his name Onan.\n5. And she yet again conceived, and bare son; and called his name Shelah: and he was at Chezib, when she bare him.\n6. And Judah took wife for Er his firstborn, whose namewasTamar.\n7. AndEr, Judahs firstborn, was wicked in the sight of theLord; and theLordslew him.\n8. And Judah said unto Onan, Go in unto thy brotherswife, and marry her, and raise up seed to thy brother.\n9. And Onan knew that the seed should not be his; and it came to pass, when he went in unto his brothers wife, that he spillediton the ground, lest that he should give seed to his brother.\n10. And the thing which he did displeased theLord: wherefore he slew him also.\n11. Then said Judah to Tamar his daughter in law, Remain widow at thy fathers house, till Shelah my son be grown: for he said, Lest peradventure he die also, as his brethrendid.And Tamar went and dwelt in her fathers house.\n12. And in process of time the daughter of Shuah Judahs wife died; and Judah was comforted, and went up unto his sheepshearers to Timnath, he and his friend Hirah the Adullamite.\n13. And it was told Tamar, saying,Behold thy father in law goeth up to Timnath to shear his sheep.\n14. And she put her widows garments off from her, and covered her with veil, and wrapped herself, and sat in an open place, whichisby the way to Timnath; for she saw that Shelah was grown, and she was not given unto him to wife.\n15. When Judah saw her, he thought herto bean harlot; because she had covered her face.\n16. And he turned unto her by the way, and said, Go to, I pray thee, let me come in unto thee; (for he knew not that shewashis daughter in law.) And she said, What wilt thou give me, that thou mayest come in unto me?\n17. And he said, I will sendtheea kid from the flock. And she said, Wilt thou givemea pledge, till thou sendit?\n18. And he said, What pledge shall I give thee? And she said, Thysignet, and thy bracelets, and thy staff thatisin thine hand. And he gaveither, and came in unto her, and she conceived by him.\n19. And she arose, and went away, and laid by her veil from her, and put on the garments of her widowhood.\n20. And Judah sent the kid by the hand of his friend the Adullamite, to receivehispledge from the womans hand: but he found her not.\n21. Then he asked the men of that place, saying, Whereisthe harlot, thatwasopenly by the way side? And they said, There was no harlot in thisplace.\n22. And he returned to Judah, and said, I cannot find her; and also the men of the place said,thatthere was no harlot in thisplace.\n23. And Judah said, Let her takeitto her, lest we be shamed: behold, I sent this kid, and thou hast not found her.\n24. And it came to pass about three months after, that it was told Judah, saying, Tamar thy daughter in law hath played the harlot; and also, behold, sheiswith child by whoredom. And Judah said, Bring her forth, and let her beburnt.\n25. When shewasbrought forth, she sent to her father in law, saying, By the man, whose theseare, amI with child: and she said, Discern, I pray thee, whosearethese, thesignet, and bracelets, and staff.\n26. And Judah acknowledgedthem,and said, She hath been more righteous than I; because that I gave her not to Shelah my son. And he knew her again no more.\n27. And it came to pass in the time of her travail, that, behold, twinswerein her womb.\n28. And it came to pass, when she travailed, thatthe oneput outhishand: and the midwife took and bound upon his hand scarlet thread, saying, This came out first.\n29. And it came to pass, as he drew back his hand, that, behold, his brother came out: and she said, How hast thou broken forth?thisbreachbeupon thee: therefore his name was calledPharez.\n30. And afterward came out his brother, that had the scarlet thread upon his hand: and his name was calledZarah.\n\n--- SCRIPTURE: Genesis 39 ---\n1. And Joseph was brought down to Egypt; andPotiphar, an officer of Pharaoh, captain of the guard, an Egyptian, bought him of the hands of theIshmeelites, which had brought him down thither.\n2. And theLordwas withJoseph,and he was prosperous man; and he was in the house of his master the Egyptian.\n3. And his master saw that theLordwaswith him, and that theLordmade all that he did toprosperin his hand.\n4. And Joseph found grace in his sight, and he served him: and he made him overseer over his house, and allthathe had he put into his hand.\n5. And it came to pass from the timethathe had made him overseer in his house, and over all that he had, that theLordblessed the Egyptians house for Josephssake; and the blessing of theLordwas upon all that he had in the house, and in the field.\n6. And he left all that he had in Josephs hand; and he knew not ought he had, save the bread which he did eat. And Joseph wasagoodlyperson,and wellfavoured.\n7. And it came to pass after these things, that his masters wife cast hereyesupon Joseph; and she said, Lie with me.\n8. But herefused, and said unto his masters wife, Behold, my masterwottethnot whatiswith me in the house, and he hathcommittedall that he hath to my hand;\n9. There isnone greater in this house than I; neither hath he kept back any thing from me but thee, because thouarthis wife: how then can I do this greatwickedness, andsinagainst God?\n10. And it came to pass, as she spake to Josephdayby day, that he hearkened not unto her, to lie by her,orto be with her.\n11. And it came to pass about this time, thatJosephwent into the house to do his business; andthere wasnone of the men of the house there within.\n12. And she caught him by his garment, saying, Lie with me: and he left his garment in her hand, andfled, and got him out.\n13. And it came to pass, when she saw that he had left his garment in her hand, and was fled forth,\n14. That she called unto the men of her house, and spake unto them, saying, See, he hath brought in an Hebrew unto us to mock us; he came in unto me to lie with me, and I cried with loud voice:\n15. And it came to pass, when he heard that I lifted up my voice and cried, that he left his garment with me, and fled, and got him out.\n16. And she laid up his garment by her, until his lord came home.\n17. And she spake unto him according to these words, saying, The Hebrew servant, which thou hast brought unto us, came in unto me to mock me:\n18. And it came to pass, as I lifted up my voice and cried, that he left his garment with me, and fled out.\n19. And it came to pass, when his master heard the words of his wife, which she spake unto him, saying, After this manner did thy servant to me; that his wrath was kindled.\n20. And Josephs master took him, and put him into theprison, place where the kings prisonerswerebound: and he was there in the prison.\n21. But theLordwas with Joseph, and shewed him mercy, and gave him favour in the sight of the keeper of the prison.\n22. And the keeper of the prison committed to Josephs hand all the prisoners thatwerein the prison; andwhatsoever they did there, he was thedoerof it.\n23. The keeper of the prison looked not to any thingthat wasunder his hand; because theLordwas with him, andthatwhich he did, theLordmadeittoprosper.\n\n--- SCRIPTURE: Genesis 40 ---\n1. And it came to pass after these things,thatthe butler of the king of Egypt andhisbaker had offended their lord the king of Egypt.\n2. And Pharaoh was wroth against twoofhis officers, against the chief of the butlers, and against the chief of the bakers.\n3. And he put them in ward in the house of the captain of the guard, into theprison, the place where Josephwasbound.\n4. And the captain of the guard charged Joseph with them, and he served them: and they continued season in ward.\n5. And they dreamed dream both of them, each man his dream in one night, each man according to the interpretation of his dream, the butler and the baker of the king of Egypt, whichwerebound in the prison.\n6. And Joseph came in unto them in the morning, and looked upon them, and, behold, theyweresad.\n7. And he asked Pharaohs officers thatwerewith him in the ward of his lords house, saying, Wherefore look yesosadly to day?\n8. And they said unto him, We have dreamed adream, andthere isno interpreter of it. And Joseph said unto them,Donotinterpretationsbelongto God? tell methem,I pray you.\n9. And the chief butler told his dream to Joseph, and said to him, In my dream, behold, vinewasbefore me;\n10. And in the vinewerethree branches: and itwasas though it budded,andher blossoms shot forth; and the clusters thereof brought forth ripe grapes:\n11. And Pharaohs cupwasin my hand: and I took the grapes, and pressed them into Pharaohs cup, and I gave the cup into Pharaohs hand.\n12. And Joseph said unto him, Thisisthe interpretation of it: The three branchesarethree days:\n13. Yet within three days shall Pharaoh lift up thine head, and restore thee unto thy place: and thou shalt deliver Pharaohs cup into his hand, after the former manner when thou wast his butler.\n14. But think on me when it shall be well with thee, and shew kindness, I pray thee, unto me, and make mention of me unto Pharaoh, and bring me out of this house:\n15. For indeed I was stolen away out of the land of the Hebrews: and here also have I done nothing that they should put me into the dungeon.\n16. When the chief baker saw that the interpretation was good, he said unto Joseph, I alsowasin my dream, and, behold,I hadthree white baskets on my head:\n17. And in the uppermost basketthere wasof all manner of bakemeats for Pharaoh; and the birds did eat them out of the basket upon my head.\n18. And Joseph answered and said, Thisisthe interpretation thereof: The three basketsarethree days:\n19. Yet within three days shall Pharaoh lift up thy head from off thee, and shall hang thee on tree; and the birds shall eat thy flesh from off thee.\n20. And it came to pass the third day,which wasPharaohs birthday, that he made feast unto all hisservants: and he lifted up the head of the chief butler and of the chief baker among his servants.\n21. And he restored the chief butler unto his butlership again; and he gave the cup into Pharaohs hand:\n22. But he hanged the chief baker: as Joseph had interpreted to them.\n23. Yet did not the chief butler remember Joseph, butforgathim.\n\n--- SCRIPTURE: Genesis 41 ---\n1. And it came to pass at the end of two full years, that Pharaohdreamed: and, behold, he stood by the river.\n2. And, behold, there came up out of the river seven well favoured kine and fatfleshed; and they fed in meadow.\n3. And, behold, seven other kine came up after them out of the river, ill favoured and leanfleshed; and stood by theotherkine upon the brink of the river.\n4. And the ill favoured and leanfleshed kine did eat up the seven well favoured and fat kine. So Pharaoh awoke.\n5. And he slept and dreamed the second time: and, behold, seven ears of corn came up upon one stalk, rank and good.\n6. And, behold, seven thin ears and blasted with the east wind sprung up after them.\n7. And the seven thin ears devoured the seven rank and full ears. And Pharaoh awoke, and, behold,it wasa dream.\n8. And it came to pass in the morning that his spirit wastroubled; and he sent and called for all themagiciansof Egypt, and all the wise men thereof: and Pharaoh told them his dream; butthere wasnone that could interpret them unto Pharaoh.\n9. Then spake the chief butler unto Pharaoh, saying, I do remember my faults this day:\n10. Pharaoh was wroth with his servants, and put me in ward in the captain of the guards house,bothme and the chief baker:\n11. And we dreamed dream in one night, I and he; we dreamed each man according to the interpretation of his dream.\n12. Andthere wasthere with us young man, an Hebrew, servant to the captain of the guard; and we told him, and he interpreted to us our dreams; to each man according to his dream he did interpret.\n13. And it came to pass, as he interpreted to us, so it was; me he restored unto mine office, and him he hanged.\n14. ThenPharaohsent and called Joseph, and they brought him hastily out of thedungeon: and he shavedhimself,and changed his raiment, and came in unto Pharaoh.\n15. And Pharaoh said unto Joseph, I have dreamed dream, andthere isnone that can interpret it: and I have heard say of thee,thatthou canst understand dream tointerpretit.\n16. And Joseph answered Pharaoh, saying,It isnot in me:Godshall give Pharaoh an answer ofpeace.\n17. And Pharaoh said unto Joseph, In my dream, behold, I stood upon the bank of the river:\n18. And, behold, there came up out of the river seven kine, fatfleshed and well favoured; and they fed in meadow:\n19. And, behold, seven other kine came up after them, poor and veryill favoured and leanfleshed, such as I never saw in all the land of Egypt for badness:\n20. And the lean and the ill favoured kine did eat up the first seven fat kine:\n21. And when they had eaten them up, it could not be known that they had eaten them; but theywerestill ill favoured, as at the beginning. So I awoke.\n22. And I saw in my dream, and, behold, seven ears came up in one stalk, full and good:\n23. And, behold, seven ears, withered, thin,andblasted with theeastwind, sprung up after them:\n24. And the thin ears devoured the seven good ears: and I toldthisunto the magicians; butthere wasnone that could declareitto me.\n25. And Joseph said unto Pharaoh, The dream of Pharaohisone: God hathshewedPharaoh what heisabout to do.\n26. The seven good kineareseven years; and the seven good earsareseven years: the dreamisone.\n27. And the seven thin and ill favoured kine that came up after themareseven years; and the seven empty ears blasted with the east wind shall be seven years offamine.\n28. Thisisthe thing which I have spoken unto Pharaoh: What Godisabout to do he sheweth unto Pharaoh.\n29. Behold, there come seven years of great plenty throughout all the land of Egypt:\n30. And there shall arise after them seven years of famine; and all the plenty shall be forgotten in the land of Egypt; and thefamineshall consume the land;\n31. And the plenty shall not be known in the land by reason of that famine following; for itshall bevery grievous.\n32. And for that the dream was doubled unto Pharaoh twice;it isbecause the thingisestablished by God, and God will shortly bring it to pass.\n33. Now therefore let Pharaoh look out man discreet and wise, and set him over the land of Egypt.\n34. Let Pharaoh dothis,and let him appoint officers over the land, and take up the fifth part of the land of Egypt in the seven plenteous years.\n35. And let them gather all the food of those good years that come, and lay up corn under the hand of Pharaoh, and let them keep food in the cities.\n36. And that food shall be forstoreto the land against the seven years of famine, which shall be in the land of Egypt; that the land perish not through the famine.\n37. And the thing wasgoodin the eyes of Pharaoh, and in the eyes of all his servants.\n38. And Pharaoh said unto his servants, Can we findsuch oneas thisis,a man in whom theSpiritof Godis?\n39. And Pharaoh said unto Joseph, Forasmuch as God hathshewedthee all this,there isnone so discreet andwiseas thouart:\n40. Thou shalt beovermy house, and according unto thy word shall all my people be ruled: only in the throne will I begreaterthan thou.\n41. And Pharaoh said unto Joseph, See, I havesetthee over all the land of Egypt.\n42. And Pharaoh took off hisringfrom his hand, and put it upon Josephs hand, andarrayedhim investuresof fine linen, and put gold chain about his neck;\n43. And he made him to ride in the second chariot which he had; and they cried before him, Bow the knee: and he made himrulerover all the land of Egypt.\n44. And Pharaoh said unto Joseph, IamPharaoh, and without thee shall no man lift up his hand or foot in all the land of Egypt.\n45. And Pharaoh called Josephs name Zaphnath-paaneah; and he gave him to wifeAsenaththe daughter of Poti-pherahpriestof On. And Joseph went out overallthe land of Egypt.\n46. AndJosephwasthirty years old when he stood before Pharaoh king of Egypt. And Joseph went out from the presence of Pharaoh, and went throughout all the land of Egypt.\n47. And in the seven plenteous years the earth brought forth by handfuls.\n48. And he gathered up all thefoodof the seven years, which were in the land of Egypt, and laid up the food in the cities: the food of the field, whichwasround about every city, laid he up in the same.\n49. And Joseph gathered corn as the sand of the sea, very much, until he left numbering; forit waswithout number.\n50. And unto Joseph were born two sons before the years of famine came, which Asenath the daughter of Poti-pherah priest of On bare unto him.\n51. And Joseph called the name of the firstbornManasseh: For God,said he,hath made me forget all my toil, and all my fathers house.\n52. And the name of the second called heEphraim: For God hath caused me to befruitfulin the land of my affliction.\n53. And the seven years of plenteousness, that was in the land of Egypt, were ended.\n54. And the seven years ofdearthbegan to come, according as Joseph had said: and the dearth was in all lands; but in all the land of Egypt there was bread.\n55. And when all the land of Egypt was famished, the people cried to Pharaoh for bread: and Pharaoh said unto all the Egyptians, Go unto Joseph; what he saith to you, do.\n56. And the famine was over all the face of the earth: And Joseph opened all the storehouses, andsoldunto the Egyptians; and the famine waxed sore in the land of Egypt.\n57. And all countries came into Egypt to Joseph for to buycorn;because that the famine wassosore in all lands.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "",
      "content": "We know that God blesses people who trust Him and keep His commandments. But sometimes it doesn’t seem that way. Sometimes the person who trusts God is abused and abandoned by family members. Sometimes the person who bravely refuses to violate the law of chastity gets falsely accused anyway. When things like that happen to us, we might be tempted to become angry with God. We might wonder, “What’s the point of trying to do the right thing if it only seems to make life harder?”\nJoseph, the son of Jacob, could have wondered that. At times, this faithful man prospered; at other times, it seemed that the more faithful he was, the more hardship he faced. But Joseph never left the Lord, and the Lord never left Joseph. That doesn’t mean the Lord prevented bad things from happening to Joseph, but through it all, “the Lord was with him” (\nGenesis 39:3\n).\nIdeas for Learning at Home and at Church\nGenesis 37:1–28\n;\n39\n;\n41:9–45\nThe Lord will be with me in my adversity.\nTime and again, good fortune seemed to abandon Joseph, but the Lord never did. As you read Joseph’s story, ponder questions such as these: What did Joseph do to stay close to the Lord? How was the Lord “with him”? (see\nGenesis 39\n;\n40:1–19\n;\n41:9–45\n). What do you learn from Joseph’s story that could help you recognize the Lord’s presence in your life?\nYou might also ask similar questions about your life. What evidence have you seen that the Lord has not forsaken you in times of trial? Consider how you can share your experiences with family members and future generations (see\n1 Nephi 5:14\n).\nOf course, you will have other trials in the future. What can you do now to help ensure that these trials don’t pull you away from the Lord? Consider writing a letter to encourage your future self to stay close to Him no matter what. You might include insights from Joseph’s life or from President D. Todd Christofferson’s message “\nOur Relationship with God\n” (\nLiahona\n, May 2022, 78–81).\nSee also\nJohn 14:18\n;\nRomans 8:28\n;\nAlma 36:3\n;\nDoctrine and Covenants 121:7–8\n; “\nAbide with Me!\n,”\nHymns\n, no. 166.\nGenesis 37:5–11\n;\n40\n;\n41:1–38\nIf I am faithful, the Lord will guide and inspire me.\nJoseph had a gift for discerning messages from the Lord through dreams. What can you learn from\nGenesis 37:5–11\n;\n40:5–8\n;\n41:14–25, 37–38\nabout receiving and understanding revelation from the Lord? For instance, what can you learn from Joseph’s example when revelation seems difficult to understand? (see\nGenesis 40:8\n;\n41:16\n).\nPonder how the Lord is revealing His will to you. What are you doing to act on revelation He has given you? How are you seeking additional guidance from Him?’\nJoseph Interpreting the Butler and Baker’s Dreams\n, by François Gérard\nGenesis 39:1–20\nWith the Lord’s help, I can flee temptation.\nIf Joseph were to give counsel on how to resist temptation to commit sexual sin, what do you think he would say? Think about this as you read about his experience in\nGenesis 39\n. For example, consider how Joseph might respond to concerns like these:\nIf no one else knows what I’m doing, what’s the big deal? (see\nverses 8–9\n).\nI try to resist, but the temptation just doesn’t seem to stop (see\nverse 10\n).\nWhat should I do when I’m in a situation where temptation is strong? (see\nverse 12\n).\nHow would you explain why obeying the law of chastity is important? (see\nFor the Strength of Youth: A Guide for Making Choices\n,\n23–28\n).\nJoseph’s example, of course, can apply to other kinds of temptation. With Joseph’s experience in mind, consider making a plan for avoiding and resisting temptation. For example, you could think of a temptation and write down situations to avoid and how you will “flee” when the temptation arises.\nTemptation\nSituations to avoid\nPlan to respond\nHere are some other scriptures that could inform your plan. What do you learn from each about how the Savior can help you resist temptation?\nMatthew 4:1–11\n;\n1 Corinthians 10:13\n;\n1 Nephi 15:23–24\n;\n3 Nephi 18:17–18\n.\nAs you make your plan, it might also help to think about times in the past when you successfully avoided or resisted temptation. How did the Savior help you? (see\n2 Nephi 4:18–33\n).\nGenesis 41:15–57\nThe Lord will help me prepare for possible hardships.\nJoseph’s interpretation of Pharaoh’s dream led to some very wise and practical counsel for surviving a famine (see\nGenesis 41:15–57\n). Consider what spiritual messages the Lord might have for you in this account. How do you feel He wants you to prepare for hardships in your future?\nSee also David A. Bednar, “\nWe Will Prove Them Herewith\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 8–11.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nHow was Joseph similar to Jesus Christ?\nWhat does the Book of Mormon teach about Joseph’s coat?\nWhat do we understand about what took place between Judah and Tamar?\nClick to see more.\nIdeas for Teaching Children\nGenesis 37\nI can be kind to my family.\nReading about the hard feelings in Joseph’s family could prompt a discussion about how we should treat family members. To tell the story of Joseph and his brothers from\nGenesis 37\n, you could use the pictures in this outline or in “\nJoseph’s Inspired Dreams\n” (in\nOld Testament Stories\n, 47–51). Let your children share details they know about the story. You might ask your children to imagine they were in Joseph’s family. What would they have said or done to be a peacemaker in the family? For example, what does it mean to “speak peaceably” in our family? (\nverse 4\n). How is Jesus Christ a peacemaker in God’s family?\n2:17\nJoseph’s Inspired Dreams\nGenesis 37:18–28\n;\n39:20–23\n;\n41:38\nGod can help me when bad things happen.\nWhen your children face hard times, they need to know that the Lord will be with them, as He was with Joseph. Perhaps you could help your children make a list of hard things that happened to Joseph (see\nGenesis 37:23–28\n;\n39:20\n; or “\nJoseph’s Inspired Dreams\n” and “\nJoseph in Egypt\n,” in\nOld Testament Stories\n, 47–51, 52–56). After each hardship they find, invite your children to repeat, “The Lord was with Joseph” (\nGenesis 39:2\n).\n2:17\nJoseph’s Inspired Dreams\n2:50\nJoseph in Egypt\nPerhaps your children could search\nGenesis 39:1–3, 20–23\nfor every instance of the phrase “The Lord was with Joseph” and similar phrases. Let them share what they think this phrase means. How do we know that the Lord is with us? Tell each other about how you felt God was with you during a challenging time.\nJoseph of Egypt in Prison\n, by Jeff Ward (detail)\nGenesis 39:7–12\nWith the Lord’s help, I can flee temptation.\nHere’s an object lesson that can help your children follow Joseph’s example of fleeing from Potiphar’s wife: Use two magnets to represent Jesus Christ and Satan. Use a small metal object, like a paper clip, to represent us. Then let your children see how the influence of a magnet on the metal object is stronger when they move the object closer to it. How does Joseph’s experience in\nGenesis 39:7–12\nillustrate this truth? What can we do to move away from sin and closer to Jesus? The video “Temptation Fades as We Seek Christ in Every Thought” (Gospel Library) and a song like “\nI Need Thee Every Hour\n” (\nHymns\n, no. 98) can help with this discussion.\n2:58\nTemptation Fades as We Seek Christ in Every Thought\nUse music.\n“Hymns and other sacred songs can help children feel God’s love, feel the Spirit, and learn gospel truths. The melodies, rhythms, and simple rhymes can help children remember gospel truths for years to come. As you sing with children, help them discover and understand the principles taught in the songs” (\nTeaching in the Savior’s Way\n,\n32\n).\nHelp your children think of temptations they might face. Let them role-play how they could “flee” from these temptations.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 11: Lesson 33: Lesson 33—Genesis 37–41This lesson can help students feel hope that God can use their trials to bless their lives.; Lesson 34: Lesson 34—Genesis 39This lesson can help students show their devotion to God by resisting the temptation to break the law of chastity.",
      "content": "\n--- Lesson 33 ---\nDespite being sold as a slave, falsely accused, and imprisoned, Joseph lived righteously and exercised faith in God. As a result, the Lord blessed and helped him through his trials. This lesson can help students feel hope that God can use their trials to bless their lives. Student preparation: Invite students to think about trials or challenges they have faced or might face. Invite them to come to class prepared to share how the Lord can use or has used challenges to bless their life. Possible Learning Activities A donkey fable Consider displaying a picture of a donkey as a student reads the following paragraph. The fable has been told of a donkey that fell into a pit. Scared and trapped, the donkey whined and brayed. After searching for a way to rescue the donkey, the owner began to shovel dirt into the pit. Each shovel full of dirt landed on the donkey’s back, making it whine more. Before continuing the story, it may be helpful for students to pause and think about the fable by responding to questions like the following: Would you consider the shovels of dirt to be a good thing or a bad thing? Why? What could the shovels full of dirt represent in our lives? Invite a student to read the conclusion of the fable in the following paragraph. The donkey would shake the dirt off its back, causing mounds of dirt to pile underneath. Over and over, the donkey repeated the actions of shaking the dirt off and stepping onto the growing mound, until eventually the donkey rose high enough on the dirt to escape from the pit. How can this fable relate to the trials and challenges Heavenly Father allows us to experience? Consider displaying the following and inviting students to complete it on their own. Think about times in your life when you have had trials or times of discouragement. Record your responses to some of the following questions in your study journal: How have you responded to those experiences? Why can it be hard to remember the Lord when you are facing challenges? From an eternal perspective, how is it possible for Heavenly Father to use your challenges to bless your life? As you study the life of Joseph today, seek revelation from the Holy Ghost to give you hope that Heavenly Father and Jesus Christ can turn even difficult trials into blessings in your life. Overview of Genesis 37–41 To help students understand the storyline of Genesis 37–41 , you could display the five images included below in random order. Students could work together as a class or in small groups to place them in chronological order. You could then have a few students use the images to briefly summarize the story in Genesis 37–41 . Students could use the summaries below each image or chapter headings to help them summarize or to verify the order of the images. When Joseph was 17 years old, his older brothers envied his favored status with their father, Jacob. They hated Joseph for sharing dreams he had about them bowing before him in the future. In time, they sold Joseph as a slave (see Genesis 37 ). Joseph was sold to Potiphar, an officer to the Egyptian Pharaoh. Joseph eventually became the overseer of Potiphar’s house (see Genesis 39:1–4 ). Potiphar’s wife lusted after Joseph, but Joseph refused to break the law of chastity and fled from her. Potiphar’s wife falsely accused Joseph of mistreating her, and he was cast into prison (see Genesis 39:7–20 ). While in prison, Joseph interpreted the dreams of Pharaoh’s servants (see Genesis 40 ). Two years later, Pharaoh had dreams that he could not understand. One of Pharaoh’s servants, who had been released from prison, told Pharaoh that Joseph could interpret dreams. Joseph taught Pharaoh that his dreams represented seven years of good harvests and seven years of famine that would soon come to Egypt (see Genesis 41 ). Blessings from our trials To help students identify lessons we can learn from Joseph’s experience, consider placing the students in small groups and providing or displaying the following instructions and questions. Note : Lesson 34, “ Genesis 39 ,” will focus on the law of chastity. Read the following verses looking for how the Lord helped Joseph during his trials. Genesis 39:1–6 (After Joseph was sold as a slave by his brothers) Genesis 39:20–23 (After Joseph was cast into prison by Potiphar) Genesis 41:14–16, 25–32 (After Joseph was finally released from prison) Answer the following questions: What truths can we learn from how Joseph responded to his challenges? Why do you think Joseph had to wait so many years to receive the blessings he sought? What evidence do you see of God helping Joseph in his trials? How can Heavenly Father and Jesus Christ help us in similar ways when we go through hard times? Walk around and listen as students discuss their answers with their groups. Thank them for sharing what they found. Remind students that the Holy Ghost can teach people different truths from the same scripture passages. The remainder of this lesson will focus on the truth that if we are faithful, God can use our trials to bless our lives and others . Read Genesis 41:37–45 , looking for evidence of how God used Joseph’s trials to bless him and others. How did the Lord bless Joseph and others through his trials? Ask questions that can help students learn about God’s power and mercy from the truths being taught. The following questions are examples that you might use. (For additional training on helping students learn about the Lord’s love, power, and mercy, see “ Help learners recognize the Lord’s love, power, and mercy in their lives ” in Teacher Development Skills. What do you think Joseph might want you to know about the Lord after the experiences he went through? How could trials help us strengthen our relationship with Heavenly Father and Jesus Christ? Read Doctrine and Covenants 90:24 and the following statement by Elder Dieter F. Uchtdorf of the Quorum of the Twelve Apostles. Look for how they apply to Joseph and all who experience trials and challenges. It is my witness that though at times we may feel buried by the trials of life or surrounded by emotional darkness, the love of God and the blessings of the restored gospel of Jesus Christ will bring something unimaginable to spring forth. (“ God Will Do Something Unimaginable ,” Ensign or Liahona , Nov. 2020, 52) How do Doctrine and Covenants 90:24 and Elder Uchtdorf’s statement apply to Joseph? To you? Modern-day examples To prepare students to reflect on how Heavenly Father can bless us in our trials, consider showing “ Faith Murray’s Story: Overcoming Adversity through Service ” (4:52), available at ChurchofJesusChrist.org . Invite students to look for how the Lord used Faith’s challenges to bless her and others. 4:52 Think about experiences you, or others, have had when you have seen Heavenly Father use your trials to bless your life. Respond to at least two of the following questions in your study journal: How have you seen Heavenly Father use trials to bless the lives of people you know? What have you learned from those people? If someone were in the middle of a difficult trial right now, what would you want them to know about Heavenly Father and Jesus Christ? What has helped you remain faithful to God during the trials you have experienced in your life? Students could be invited to share their experiences along with their feelings for the Savior.\n\n\n--- Lesson 34 ---\nAfter Joseph became an overseer in Potiphar’s house, Potiphar’s wife tempted him to break the law of chastity. Joseph knew that succumbing to that temptation was a “sin against God” and chose to flee from the temptation (see Genesis 39:9, 12 ). This lesson can help students show their devotion to God by resisting the temptation to break the law of chastity. Student preparation: Invite students to imagine they were asked to lead a discussion in their Sunday School class about different ways they can resist Satan’s temptations. Invite students to think of three ways they would share with their class. Possible Learning Activities Temptations we face Consider having the class make a list on the board of temptations youth face today. To help students think more about the temptations they personally face and how they respond to them, you could invite each student to complete the following activity on a piece of paper. Choose a temptation and write a brief, realistic scenario where a teenager could face that temptation. Collect the scenarios and redistribute them among the class. Read through your new scenario. On the back of the paper, write what might make it difficult to resist that temptation. Also write two things you might encourage someone to do to help them resist or overcome that temptation. Point out to students that although they may not face the same temptation listed in the scenario, they may be able to apply similar counsel to their own situations. Help students assess their own ability to resist or overcome temptation. Think about the temptations you personally face. What have you done, or could you do, to gain strength from Heavenly Father and Jesus Christ to resist those temptations? You might invite students to add to what they wrote in the scenario with their own experiences. Encourage them to continue adding ideas to their scenario as they study Genesis 39 . Let them know that as they seek help from the Holy Ghost, He can inspire them with ideas to resist and even overcome the temptations that they face. Joseph’s experience with temptation If you used pictures to summarize the events of Joseph’s life in Lesson 33: “ Genesis 37–41 ,” consider displaying them again. Invite a student to summarize what they remember about how the Lord blessed Joseph in Potiphar’s house. If students need help, invite them to read and summarize Genesis 39:1–6 . Read Genesis 39:7–8 , looking for what happened to Joseph after he became overseer in Potiphar’s house. What temptation did Joseph face? Explain that Joseph faced the temptation to break the law of chastity. Help students reflect on what they understand about the law of chastity by inviting them to do the following. In your study journal, write how you would define the law of chastity and why it is important. When students are done writing, consider displaying the following statement. Invite students to read it on their own, looking for insights that they could add to what they wrote in their study journals. For the Strength of Youth: A Guide for Making Choices states the following about the law of chastity: The law of chastity states that God approves of sexual activity only between a man and a woman who are married. … Outside of marriage between a man and a woman, it is wrong to touch the private, sacred parts of another person’s body even if clothed. In your choices about what you do, look at, read, listen to, think about, post, or text, avoid anything that purposely arouses lustful emotions in others or yourself. This includes pornography in any form. ( For the Strength of Youth: A Guide for Making Choices , 23, 25) Why do you think Heavenly Father has given us the law of chastity? What are some ways Satan tempts youth to break the law of chastity? Possible answers students may give include taking or sending inappropriate pictures, viewing or listening to media that is sexually suggestive or explicit, not keeping sex or sexual feelings sacred. If students have questions about same-sex attraction, it may be helpful to explain that “feeling same-sex attraction is not a sin. If [someone has] these feelings and [does] not pursue or act on them, [they] are living Heavenly Father’s sacred law of chastity” ( For Strength of Youth: A Guide for Making Choices , 27). Read Genesis 39:9–12 , looking for how Joseph resisted the temptation to break the law of chastity. Genesis 39:9 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. What did you learn from Joseph’s example? Students may identify truths such as: Our devotion to God can give us strength to resist the temptation to break the law of chastity ( verse 9 ). Students could mark in their scriptures what Joseph’s devotion to God enabled him to do, for example, in verse 8 (“he refused”), verse 10 (“he hearkened not”), and verse 12 (“got him out”). To help students answer the following question, you may want to provide them with a scenario they can use to share how someone could do the three things Joseph did. A possible scenario could involve being invited to a movie, show, or concert where immoral images and words are used. Another possible scenario could involve feeling pressure to send inappropriate texts or pictures to peers. What are some ways we can follow Joseph’s example when we face temptation? Strengthening our ability to keep the law of chastity To help students deepen their understanding of this truth, distribute the accompanying handout to students. Consider placing students in pairs and assigning each partner to focus on one of the questions on the handout. Open PDF Invite students to share what they learned with their partners. The Savior can help us overcome temptation You may have students who are struggling with obeying the law of chastity and need to feel hope in repenting and overcoming addiction. Testify of the loving, patient, and forgiving nature of Heavenly Father and Jesus Christ. Consider showing the video “ Temptation Fades as We Seek Christ in Every Thought ” (2:57), available at ChurchofJesusChrist.org . Invite students to look for how the Savior can give us hope. 2:58 Elder Dale G. Renlund of the Quorum of the Twelve Apostles taught how the Savior can give hope to those who have struggled with keeping God’s commandments. No matter how long we have been off the path or how far away we have wandered, the moment we decide to change, God helps us return. From God’s perspective, through sincere repentance and pressing forward with a steadfastness in Christ, once back on the path, it will be as if we were never off. The Savior pays for our sins and frees us from the looming decrease in happiness and blessings. (“ Choose You This Day ,” Ensign or Liahona , Nov. 2018, 106) What would you want someone who feels hopeless because of their previous choices to understand from Elder Renlund’s statement? What has helped you to resist temptation that you might suggest to other people? Making a plan to keep the law of chastity To help students make a plan to act on what the Spirit has taught them about keeping the law of chastity, give them a few minutes to respond to the following questions in their study journals. What did you learn that can help you keep the law of chastity or resist other temptations? What did you learn about being devoted to God? How will you begin to apply what you have learned and felt today? Encourage students to involve Heavenly Father and Jesus Christ in their efforts to resist temptation. Consider sharing your testimony of the Savior’s ability to help us overcome temptation and His loving mercy in helping us repent. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase is “How then can I do this great wickedness, and sin against God?” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 37",
      "content": "1. And Jacob dwelt in the landwhereinhis father was astranger, in the land of Canaan.\n2. Thesearethegenerationsof Jacob.Joseph,beingseventeen years old, was feeding the flock with his brethren; and the ladwaswith the sons of Bilhah, and with the sons of Zilpah, his fathers wives: and Joseph brought unto his father their evil report.\n3. Now Israel lovedJosephmore than all his children, because hewasthe son of his old age: and he made him acoatofmanycolours.\n4. And when his brethren saw thattheir father loved him more than all his brethren, they hated him, and could not speak peaceably unto him.\n5. And Joseph dreamed adream, and he toldithis brethren: and they hated him yet the more.\n6. And he said unto them, Hear, I pray you, this dream which I have dreamed:\n7. For, behold, wewerebinding sheaves in the field, and, lo, my sheaf arose, and also stood upright; and, behold, your sheaves stood round about, and madeobeisanceto my sheaf.\n8. And his brethren said to him, Shalt thou indeed reign over us? or shalt thou indeed have dominion over us? And they hated him yet the more for his dreams, and for his words.\n9. And he dreamed yet another dream, and told it his brethren, and said, Behold, I have dreamed dream more; and, behold, the sun and the moon and the eleven stars made obeisance to me.\n10. And he tolditto his father, and to his brethren: and his father rebuked him, and said unto him, Whatisthis dream that thou hast dreamed? Shall I and thy mother and thy brethren indeed come tobowdown ourselves to thee to the earth?\n11. And his brethrenenviedhim; but his father observed the saying.\n12. And his brethren went to feed their fathersflockin Shechem.\n13. And Israel said unto Joseph, Do not thy brethren feedthe flockin Shechem? come, and I will send thee unto them. And he said to him, Heream I.\n14. And he said to him, Go, I pray thee, see whether it be well with thy brethren, and well with the flocks; and bring me word again. So he sent him out of the vale of Hebron, and he came to Shechem.\n15. And certain man found him, and, behold,he waswandering in the field: and the man asked him, saying, What seekest thou?\n16. And he said, I seek my brethren: tell me, I pray thee, where they feedtheir flocks.\n17. And the man said, They are departed hence; for I heard them say, Let us go to Dothan. And Joseph went after his brethren, and found them in Dothan.\n18. And when they saw him afar off, even before he came near unto them, theyconspiredagainst him to slay him.\n19. And they said one to another, Behold, thisdreamercometh.\n20. Come now therefore, and let us slay him, and cast him into some pit, and we will say, Some evil beast hath devoured him: and we shall see what will become of his dreams.\n21. AndReubenheardit,and he delivered him out of their hands; and said, Let us not kill him.\n22. And Reuben said unto them, Shed no blood,butcast him into this pit thatisin the wilderness, and lay no hand upon him; that he might rid him out of their hands, to deliver him to his father again.\n23. And it came to pass, when Joseph was come unto his brethren, that they stript Joseph out of hiscoat,hiscoat ofmanycolours thatwason him;\n24. And they took him, and cast him into pit: and the pitwasempty,there wasno water in it.\n25. And they sat down to eat bread: and they lifted up their eyes and looked, and, behold, company of Ishmeelites came from Gilead with their camels bearing spicery and balm and myrrh, going to carryitdown to Egypt.\n26. And Judah said unto his brethren, What profitis itif we slay our brother, and conceal his blood?\n27. Come, and let us sell him to the Ishmeelites, and let not our hand be upon him; for heisour brotherandour flesh. And his brethrenwere content.\n28. Then there passed by Midianites merchantmen; and they drew and lifted up Joseph out of the pit, and sold Joseph to theIshmeelitesfor twentypiecesof silver: and they brought Joseph into Egypt.\n29. And Reuben returned unto the pit; and, behold, Josephwasnot in the pit; and he rent his clothes.\n30. And he returned unto his brethren, and said, The childisnot; and I, whither shall I go?\n31. And they took Josephs coat, and killed kid of the goats, and dipped the coat in the blood;\n32. And they sent the coat ofmanycolours, and they broughtitto their father; and said, This have we found: know now whether itbethy sons coat or no.\n33. And he knew it, and said,It ismy sonscoat; an evil beast hath devoured him; Joseph is without doubtrentin pieces.\n34. And Jacob rent his clothes, and put sackcloth upon his loins, and mourned for his son many days.\n35. And all hissonsand all his daughters rose up to comfort him; but he refused to becomforted; and he said, For I will go down into the grave unto my sonmourning. Thus his father wept for him.\n36. And the Midianitessoldhim into Egypt untoPotiphar, anofficerof Pharaohs,andcaptain of the guard.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 38",
      "content": "1. And it came to pass at that time, that Judah went down from his brethren, and turned in to certain Adullamite, whose namewasHirah.\n2. And Judah saw there adaughterof certain Canaanite, whose namewasShuah; and he took her, and went in unto her.\n3. And she conceived, and bare son; and he called his nameEr.\n4. And she conceived again, and bare son; and she called his name Onan.\n5. And she yet again conceived, and bare son; and called his name Shelah: and he was at Chezib, when she bare him.\n6. And Judah took wife for Er his firstborn, whose namewasTamar.\n7. AndEr, Judahs firstborn, was wicked in the sight of theLord; and theLordslew him.\n8. And Judah said unto Onan, Go in unto thy brotherswife, and marry her, and raise up seed to thy brother.\n9. And Onan knew that the seed should not be his; and it came to pass, when he went in unto his brothers wife, that he spillediton the ground, lest that he should give seed to his brother.\n10. And the thing which he did displeased theLord: wherefore he slew him also.\n11. Then said Judah to Tamar his daughter in law, Remain widow at thy fathers house, till Shelah my son be grown: for he said, Lest peradventure he die also, as his brethrendid.And Tamar went and dwelt in her fathers house.\n12. And in process of time the daughter of Shuah Judahs wife died; and Judah was comforted, and went up unto his sheepshearers to Timnath, he and his friend Hirah the Adullamite.\n13. And it was told Tamar, saying,Behold thy father in law goeth up to Timnath to shear his sheep.\n14. And she put her widows garments off from her, and covered her with veil, and wrapped herself, and sat in an open place, whichisby the way to Timnath; for she saw that Shelah was grown, and she was not given unto him to wife.\n15. When Judah saw her, he thought herto bean harlot; because she had covered her face.\n16. And he turned unto her by the way, and said, Go to, I pray thee, let me come in unto thee; (for he knew not that shewashis daughter in law.) And she said, What wilt thou give me, that thou mayest come in unto me?\n17. And he said, I will sendtheea kid from the flock. And she said, Wilt thou givemea pledge, till thou sendit?\n18. And he said, What pledge shall I give thee? And she said, Thysignet, and thy bracelets, and thy staff thatisin thine hand. And he gaveither, and came in unto her, and she conceived by him.\n19. And she arose, and went away, and laid by her veil from her, and put on the garments of her widowhood.\n20. And Judah sent the kid by the hand of his friend the Adullamite, to receivehispledge from the womans hand: but he found her not.\n21. Then he asked the men of that place, saying, Whereisthe harlot, thatwasopenly by the way side? And they said, There was no harlot in thisplace.\n22. And he returned to Judah, and said, I cannot find her; and also the men of the place said,thatthere was no harlot in thisplace.\n23. And Judah said, Let her takeitto her, lest we be shamed: behold, I sent this kid, and thou hast not found her.\n24. And it came to pass about three months after, that it was told Judah, saying, Tamar thy daughter in law hath played the harlot; and also, behold, sheiswith child by whoredom. And Judah said, Bring her forth, and let her beburnt.\n25. When shewasbrought forth, she sent to her father in law, saying, By the man, whose theseare, amI with child: and she said, Discern, I pray thee, whosearethese, thesignet, and bracelets, and staff.\n26. And Judah acknowledgedthem,and said, She hath been more righteous than I; because that I gave her not to Shelah my son. And he knew her again no more.\n27. And it came to pass in the time of her travail, that, behold, twinswerein her womb.\n28. And it came to pass, when she travailed, thatthe oneput outhishand: and the midwife took and bound upon his hand scarlet thread, saying, This came out first.\n29. And it came to pass, as he drew back his hand, that, behold, his brother came out: and she said, How hast thou broken forth?thisbreachbeupon thee: therefore his name was calledPharez.\n30. And afterward came out his brother, that had the scarlet thread upon his hand: and his name was calledZarah.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 39",
      "content": "1. And Joseph was brought down to Egypt; andPotiphar, an officer of Pharaoh, captain of the guard, an Egyptian, bought him of the hands of theIshmeelites, which had brought him down thither.\n2. And theLordwas withJoseph,and he was prosperous man; and he was in the house of his master the Egyptian.\n3. And his master saw that theLordwaswith him, and that theLordmade all that he did toprosperin his hand.\n4. And Joseph found grace in his sight, and he served him: and he made him overseer over his house, and allthathe had he put into his hand.\n5. And it came to pass from the timethathe had made him overseer in his house, and over all that he had, that theLordblessed the Egyptians house for Josephssake; and the blessing of theLordwas upon all that he had in the house, and in the field.\n6. And he left all that he had in Josephs hand; and he knew not ought he had, save the bread which he did eat. And Joseph wasagoodlyperson,and wellfavoured.\n7. And it came to pass after these things, that his masters wife cast hereyesupon Joseph; and she said, Lie with me.\n8. But herefused, and said unto his masters wife, Behold, my masterwottethnot whatiswith me in the house, and he hathcommittedall that he hath to my hand;\n9. There isnone greater in this house than I; neither hath he kept back any thing from me but thee, because thouarthis wife: how then can I do this greatwickedness, andsinagainst God?\n10. And it came to pass, as she spake to Josephdayby day, that he hearkened not unto her, to lie by her,orto be with her.\n11. And it came to pass about this time, thatJosephwent into the house to do his business; andthere wasnone of the men of the house there within.\n12. And she caught him by his garment, saying, Lie with me: and he left his garment in her hand, andfled, and got him out.\n13. And it came to pass, when she saw that he had left his garment in her hand, and was fled forth,\n14. That she called unto the men of her house, and spake unto them, saying, See, he hath brought in an Hebrew unto us to mock us; he came in unto me to lie with me, and I cried with loud voice:\n15. And it came to pass, when he heard that I lifted up my voice and cried, that he left his garment with me, and fled, and got him out.\n16. And she laid up his garment by her, until his lord came home.\n17. And she spake unto him according to these words, saying, The Hebrew servant, which thou hast brought unto us, came in unto me to mock me:\n18. And it came to pass, as I lifted up my voice and cried, that he left his garment with me, and fled out.\n19. And it came to pass, when his master heard the words of his wife, which she spake unto him, saying, After this manner did thy servant to me; that his wrath was kindled.\n20. And Josephs master took him, and put him into theprison, place where the kings prisonerswerebound: and he was there in the prison.\n21. But theLordwas with Joseph, and shewed him mercy, and gave him favour in the sight of the keeper of the prison.\n22. And the keeper of the prison committed to Josephs hand all the prisoners thatwerein the prison; andwhatsoever they did there, he was thedoerof it.\n23. The keeper of the prison looked not to any thingthat wasunder his hand; because theLordwas with him, andthatwhich he did, theLordmadeittoprosper.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 40",
      "content": "1. And it came to pass after these things,thatthe butler of the king of Egypt andhisbaker had offended their lord the king of Egypt.\n2. And Pharaoh was wroth against twoofhis officers, against the chief of the butlers, and against the chief of the bakers.\n3. And he put them in ward in the house of the captain of the guard, into theprison, the place where Josephwasbound.\n4. And the captain of the guard charged Joseph with them, and he served them: and they continued season in ward.\n5. And they dreamed dream both of them, each man his dream in one night, each man according to the interpretation of his dream, the butler and the baker of the king of Egypt, whichwerebound in the prison.\n6. And Joseph came in unto them in the morning, and looked upon them, and, behold, theyweresad.\n7. And he asked Pharaohs officers thatwerewith him in the ward of his lords house, saying, Wherefore look yesosadly to day?\n8. And they said unto him, We have dreamed adream, andthere isno interpreter of it. And Joseph said unto them,Donotinterpretationsbelongto God? tell methem,I pray you.\n9. And the chief butler told his dream to Joseph, and said to him, In my dream, behold, vinewasbefore me;\n10. And in the vinewerethree branches: and itwasas though it budded,andher blossoms shot forth; and the clusters thereof brought forth ripe grapes:\n11. And Pharaohs cupwasin my hand: and I took the grapes, and pressed them into Pharaohs cup, and I gave the cup into Pharaohs hand.\n12. And Joseph said unto him, Thisisthe interpretation of it: The three branchesarethree days:\n13. Yet within three days shall Pharaoh lift up thine head, and restore thee unto thy place: and thou shalt deliver Pharaohs cup into his hand, after the former manner when thou wast his butler.\n14. But think on me when it shall be well with thee, and shew kindness, I pray thee, unto me, and make mention of me unto Pharaoh, and bring me out of this house:\n15. For indeed I was stolen away out of the land of the Hebrews: and here also have I done nothing that they should put me into the dungeon.\n16. When the chief baker saw that the interpretation was good, he said unto Joseph, I alsowasin my dream, and, behold,I hadthree white baskets on my head:\n17. And in the uppermost basketthere wasof all manner of bakemeats for Pharaoh; and the birds did eat them out of the basket upon my head.\n18. And Joseph answered and said, Thisisthe interpretation thereof: The three basketsarethree days:\n19. Yet within three days shall Pharaoh lift up thy head from off thee, and shall hang thee on tree; and the birds shall eat thy flesh from off thee.\n20. And it came to pass the third day,which wasPharaohs birthday, that he made feast unto all hisservants: and he lifted up the head of the chief butler and of the chief baker among his servants.\n21. And he restored the chief butler unto his butlership again; and he gave the cup into Pharaohs hand:\n22. But he hanged the chief baker: as Joseph had interpreted to them.\n23. Yet did not the chief butler remember Joseph, butforgathim.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 41",
      "content": "1. And it came to pass at the end of two full years, that Pharaohdreamed: and, behold, he stood by the river.\n2. And, behold, there came up out of the river seven well favoured kine and fatfleshed; and they fed in meadow.\n3. And, behold, seven other kine came up after them out of the river, ill favoured and leanfleshed; and stood by theotherkine upon the brink of the river.\n4. And the ill favoured and leanfleshed kine did eat up the seven well favoured and fat kine. So Pharaoh awoke.\n5. And he slept and dreamed the second time: and, behold, seven ears of corn came up upon one stalk, rank and good.\n6. And, behold, seven thin ears and blasted with the east wind sprung up after them.\n7. And the seven thin ears devoured the seven rank and full ears. And Pharaoh awoke, and, behold,it wasa dream.\n8. And it came to pass in the morning that his spirit wastroubled; and he sent and called for all themagiciansof Egypt, and all the wise men thereof: and Pharaoh told them his dream; butthere wasnone that could interpret them unto Pharaoh.\n9. Then spake the chief butler unto Pharaoh, saying, I do remember my faults this day:\n10. Pharaoh was wroth with his servants, and put me in ward in the captain of the guards house,bothme and the chief baker:\n11. And we dreamed dream in one night, I and he; we dreamed each man according to the interpretation of his dream.\n12. Andthere wasthere with us young man, an Hebrew, servant to the captain of the guard; and we told him, and he interpreted to us our dreams; to each man according to his dream he did interpret.\n13. And it came to pass, as he interpreted to us, so it was; me he restored unto mine office, and him he hanged.\n14. ThenPharaohsent and called Joseph, and they brought him hastily out of thedungeon: and he shavedhimself,and changed his raiment, and came in unto Pharaoh.\n15. And Pharaoh said unto Joseph, I have dreamed dream, andthere isnone that can interpret it: and I have heard say of thee,thatthou canst understand dream tointerpretit.\n16. And Joseph answered Pharaoh, saying,It isnot in me:Godshall give Pharaoh an answer ofpeace.\n17. And Pharaoh said unto Joseph, In my dream, behold, I stood upon the bank of the river:\n18. And, behold, there came up out of the river seven kine, fatfleshed and well favoured; and they fed in meadow:\n19. And, behold, seven other kine came up after them, poor and veryill favoured and leanfleshed, such as I never saw in all the land of Egypt for badness:\n20. And the lean and the ill favoured kine did eat up the first seven fat kine:\n21. And when they had eaten them up, it could not be known that they had eaten them; but theywerestill ill favoured, as at the beginning. So I awoke.\n22. And I saw in my dream, and, behold, seven ears came up in one stalk, full and good:\n23. And, behold, seven ears, withered, thin,andblasted with theeastwind, sprung up after them:\n24. And the thin ears devoured the seven good ears: and I toldthisunto the magicians; butthere wasnone that could declareitto me.\n25. And Joseph said unto Pharaoh, The dream of Pharaohisone: God hathshewedPharaoh what heisabout to do.\n26. The seven good kineareseven years; and the seven good earsareseven years: the dreamisone.\n27. And the seven thin and ill favoured kine that came up after themareseven years; and the seven empty ears blasted with the east wind shall be seven years offamine.\n28. Thisisthe thing which I have spoken unto Pharaoh: What Godisabout to do he sheweth unto Pharaoh.\n29. Behold, there come seven years of great plenty throughout all the land of Egypt:\n30. And there shall arise after them seven years of famine; and all the plenty shall be forgotten in the land of Egypt; and thefamineshall consume the land;\n31. And the plenty shall not be known in the land by reason of that famine following; for itshall bevery grievous.\n32. And for that the dream was doubled unto Pharaoh twice;it isbecause the thingisestablished by God, and God will shortly bring it to pass.\n33. Now therefore let Pharaoh look out man discreet and wise, and set him over the land of Egypt.\n34. Let Pharaoh dothis,and let him appoint officers over the land, and take up the fifth part of the land of Egypt in the seven plenteous years.\n35. And let them gather all the food of those good years that come, and lay up corn under the hand of Pharaoh, and let them keep food in the cities.\n36. And that food shall be forstoreto the land against the seven years of famine, which shall be in the land of Egypt; that the land perish not through the famine.\n37. And the thing wasgoodin the eyes of Pharaoh, and in the eyes of all his servants.\n38. And Pharaoh said unto his servants, Can we findsuch oneas thisis,a man in whom theSpiritof Godis?\n39. And Pharaoh said unto Joseph, Forasmuch as God hathshewedthee all this,there isnone so discreet andwiseas thouart:\n40. Thou shalt beovermy house, and according unto thy word shall all my people be ruled: only in the throne will I begreaterthan thou.\n41. And Pharaoh said unto Joseph, See, I havesetthee over all the land of Egypt.\n42. And Pharaoh took off hisringfrom his hand, and put it upon Josephs hand, andarrayedhim investuresof fine linen, and put gold chain about his neck;\n43. And he made him to ride in the second chariot which he had; and they cried before him, Bow the knee: and he made himrulerover all the land of Egypt.\n44. And Pharaoh said unto Joseph, IamPharaoh, and without thee shall no man lift up his hand or foot in all the land of Egypt.\n45. And Pharaoh called Josephs name Zaphnath-paaneah; and he gave him to wifeAsenaththe daughter of Poti-pherahpriestof On. And Joseph went out overallthe land of Egypt.\n46. AndJosephwasthirty years old when he stood before Pharaoh king of Egypt. And Joseph went out from the presence of Pharaoh, and went throughout all the land of Egypt.\n47. And in the seven plenteous years the earth brought forth by handfuls.\n48. And he gathered up all thefoodof the seven years, which were in the land of Egypt, and laid up the food in the cities: the food of the field, whichwasround about every city, laid he up in the same.\n49. And Joseph gathered corn as the sand of the sea, very much, until he left numbering; forit waswithout number.\n50. And unto Joseph were born two sons before the years of famine came, which Asenath the daughter of Poti-pherah priest of On bare unto him.\n51. And Joseph called the name of the firstbornManasseh: For God,said he,hath made me forget all my toil, and all my fathers house.\n52. And the name of the second called heEphraim: For God hath caused me to befruitfulin the land of my affliction.\n53. And the seven years of plenteousness, that was in the land of Egypt, were ended.\n54. And the seven years ofdearthbegan to come, according as Joseph had said: and the dearth was in all lands; but in all the land of Egypt there was bread.\n55. And when all the land of Egypt was famished, the people cried to Pharaoh for bread: and Pharaoh said unto all the Egyptians, Go unto Joseph; what he saith to you, do.\n56. And the famine was over all the face of the earth: And Joseph opened all the storehouses, andsoldunto the Egyptians; and the famine waxed sore in the land of Egypt.\n57. And all countries came into Egypt to Joseph for to buycorn;because that the famine wassosore in all lands.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Genesis": {
      "37": {
        "verses": {
          "1": {
            "text": "And Jacob dwelt in the landwhereinhis father was astranger, in the land of Canaan.",
            "citation": "(Genesis 37:1)"
          },
          "2": {
            "text": "Thesearethegenerationsof Jacob.Joseph,beingseventeen years old, was feeding the flock with his brethren; and the ladwaswith the sons of Bilhah, and with the sons of Zilpah, his fathers wives: and Joseph brought unto his father their evil report.",
            "citation": "(Genesis 37:2)"
          },
          "3": {
            "text": "Now Israel lovedJosephmore than all his children, because hewasthe son of his old age: and he made him acoatofmanycolours.",
            "citation": "(Genesis 37:3)"
          },
          "4": {
            "text": "And when his brethren saw thattheir father loved him more than all his brethren, they hated him, and could not speak peaceably unto him.",
            "citation": "(Genesis 37:4)"
          },
          "5": {
            "text": "And Joseph dreamed adream, and he toldithis brethren: and they hated him yet the more.",
            "citation": "(Genesis 37:5)"
          },
          "6": {
            "text": "And he said unto them, Hear, I pray you, this dream which I have dreamed:",
            "citation": "(Genesis 37:6)"
          },
          "7": {
            "text": "For, behold, wewerebinding sheaves in the field, and, lo, my sheaf arose, and also stood upright; and, behold, your sheaves stood round about, and madeobeisanceto my sheaf.",
            "citation": "(Genesis 37:7)"
          },
          "8": {
            "text": "And his brethren said to him, Shalt thou indeed reign over us? or shalt thou indeed have dominion over us? And they hated him yet the more for his dreams, and for his words.",
            "citation": "(Genesis 37:8)"
          },
          "9": {
            "text": "And he dreamed yet another dream, and told it his brethren, and said, Behold, I have dreamed dream more; and, behold, the sun and the moon and the eleven stars made obeisance to me.",
            "citation": "(Genesis 37:9)"
          },
          "10": {
            "text": "And he tolditto his father, and to his brethren: and his father rebuked him, and said unto him, Whatisthis dream that thou hast dreamed? Shall I and thy mother and thy brethren indeed come tobowdown ourselves to thee to the earth?",
            "citation": "(Genesis 37:10)"
          },
          "11": {
            "text": "And his brethrenenviedhim; but his father observed the saying.",
            "citation": "(Genesis 37:11)"
          },
          "12": {
            "text": "And his brethren went to feed their fathersflockin Shechem.",
            "citation": "(Genesis 37:12)"
          },
          "13": {
            "text": "And Israel said unto Joseph, Do not thy brethren feedthe flockin Shechem? come, and I will send thee unto them. And he said to him, Heream I.",
            "citation": "(Genesis 37:13)"
          },
          "14": {
            "text": "And he said to him, Go, I pray thee, see whether it be well with thy brethren, and well with the flocks; and bring me word again. So he sent him out of the vale of Hebron, and he came to Shechem.",
            "citation": "(Genesis 37:14)"
          },
          "15": {
            "text": "And certain man found him, and, behold,he waswandering in the field: and the man asked him, saying, What seekest thou?",
            "citation": "(Genesis 37:15)"
          },
          "16": {
            "text": "And he said, I seek my brethren: tell me, I pray thee, where they feedtheir flocks.",
            "citation": "(Genesis 37:16)"
          },
          "17": {
            "text": "And the man said, They are departed hence; for I heard them say, Let us go to Dothan. And Joseph went after his brethren, and found them in Dothan.",
            "citation": "(Genesis 37:17)"
          },
          "18": {
            "text": "And when they saw him afar off, even before he came near unto them, theyconspiredagainst him to slay him.",
            "citation": "(Genesis 37:18)"
          },
          "19": {
            "text": "And they said one to another, Behold, thisdreamercometh.",
            "citation": "(Genesis 37:19)"
          },
          "20": {
            "text": "Come now therefore, and let us slay him, and cast him into some pit, and we will say, Some evil beast hath devoured him: and we shall see what will become of his dreams.",
            "citation": "(Genesis 37:20)"
          },
          "21": {
            "text": "AndReubenheardit,and he delivered him out of their hands; and said, Let us not kill him.",
            "citation": "(Genesis 37:21)"
          },
          "22": {
            "text": "And Reuben said unto them, Shed no blood,butcast him into this pit thatisin the wilderness, and lay no hand upon him; that he might rid him out of their hands, to deliver him to his father again.",
            "citation": "(Genesis 37:22)"
          },
          "23": {
            "text": "And it came to pass, when Joseph was come unto his brethren, that they stript Joseph out of hiscoat,hiscoat ofmanycolours thatwason him;",
            "citation": "(Genesis 37:23)"
          },
          "24": {
            "text": "And they took him, and cast him into pit: and the pitwasempty,there wasno water in it.",
            "citation": "(Genesis 37:24)"
          },
          "25": {
            "text": "And they sat down to eat bread: and they lifted up their eyes and looked, and, behold, company of Ishmeelites came from Gilead with their camels bearing spicery and balm and myrrh, going to carryitdown to Egypt.",
            "citation": "(Genesis 37:25)"
          },
          "26": {
            "text": "And Judah said unto his brethren, What profitis itif we slay our brother, and conceal his blood?",
            "citation": "(Genesis 37:26)"
          },
          "27": {
            "text": "Come, and let us sell him to the Ishmeelites, and let not our hand be upon him; for heisour brotherandour flesh. And his brethrenwere content.",
            "citation": "(Genesis 37:27)"
          },
          "28": {
            "text": "Then there passed by Midianites merchantmen; and they drew and lifted up Joseph out of the pit, and sold Joseph to theIshmeelitesfor twentypiecesof silver: and they brought Joseph into Egypt.",
            "citation": "(Genesis 37:28)"
          },
          "29": {
            "text": "And Reuben returned unto the pit; and, behold, Josephwasnot in the pit; and he rent his clothes.",
            "citation": "(Genesis 37:29)"
          },
          "30": {
            "text": "And he returned unto his brethren, and said, The childisnot; and I, whither shall I go?",
            "citation": "(Genesis 37:30)"
          },
          "31": {
            "text": "And they took Josephs coat, and killed kid of the goats, and dipped the coat in the blood;",
            "citation": "(Genesis 37:31)"
          },
          "32": {
            "text": "And they sent the coat ofmanycolours, and they broughtitto their father; and said, This have we found: know now whether itbethy sons coat or no.",
            "citation": "(Genesis 37:32)"
          },
          "33": {
            "text": "And he knew it, and said,It ismy sonscoat; an evil beast hath devoured him; Joseph is without doubtrentin pieces.",
            "citation": "(Genesis 37:33)"
          },
          "34": {
            "text": "And Jacob rent his clothes, and put sackcloth upon his loins, and mourned for his son many days.",
            "citation": "(Genesis 37:34)"
          },
          "35": {
            "text": "And all hissonsand all his daughters rose up to comfort him; but he refused to becomforted; and he said, For I will go down into the grave unto my sonmourning. Thus his father wept for him.",
            "citation": "(Genesis 37:35)"
          },
          "36": {
            "text": "And the Midianitessoldhim into Egypt untoPotiphar, anofficerof Pharaohs,andcaptain of the guard.",
            "citation": "(Genesis 37:36)"
          }
        }
      },
      "38": {
        "verses": {
          "1": {
            "text": "And it came to pass at that time, that Judah went down from his brethren, and turned in to certain Adullamite, whose namewasHirah.",
            "citation": "(Genesis 38:1)"
          },
          "2": {
            "text": "And Judah saw there adaughterof certain Canaanite, whose namewasShuah; and he took her, and went in unto her.",
            "citation": "(Genesis 38:2)"
          },
          "3": {
            "text": "And she conceived, and bare son; and he called his nameEr.",
            "citation": "(Genesis 38:3)"
          },
          "4": {
            "text": "And she conceived again, and bare son; and she called his name Onan.",
            "citation": "(Genesis 38:4)"
          },
          "5": {
            "text": "And she yet again conceived, and bare son; and called his name Shelah: and he was at Chezib, when she bare him.",
            "citation": "(Genesis 38:5)"
          },
          "6": {
            "text": "And Judah took wife for Er his firstborn, whose namewasTamar.",
            "citation": "(Genesis 38:6)"
          },
          "7": {
            "text": "AndEr, Judahs firstborn, was wicked in the sight of theLord; and theLordslew him.",
            "citation": "(Genesis 38:7)"
          },
          "8": {
            "text": "And Judah said unto Onan, Go in unto thy brotherswife, and marry her, and raise up seed to thy brother.",
            "citation": "(Genesis 38:8)"
          },
          "9": {
            "text": "And Onan knew that the seed should not be his; and it came to pass, when he went in unto his brothers wife, that he spillediton the ground, lest that he should give seed to his brother.",
            "citation": "(Genesis 38:9)"
          },
          "10": {
            "text": "And the thing which he did displeased theLord: wherefore he slew him also.",
            "citation": "(Genesis 38:10)"
          },
          "11": {
            "text": "Then said Judah to Tamar his daughter in law, Remain widow at thy fathers house, till Shelah my son be grown: for he said, Lest peradventure he die also, as his brethrendid.And Tamar went and dwelt in her fathers house.",
            "citation": "(Genesis 38:11)"
          },
          "12": {
            "text": "And in process of time the daughter of Shuah Judahs wife died; and Judah was comforted, and went up unto his sheepshearers to Timnath, he and his friend Hirah the Adullamite.",
            "citation": "(Genesis 38:12)"
          },
          "13": {
            "text": "And it was told Tamar, saying,Behold thy father in law goeth up to Timnath to shear his sheep.",
            "citation": "(Genesis 38:13)"
          },
          "14": {
            "text": "And she put her widows garments off from her, and covered her with veil, and wrapped herself, and sat in an open place, whichisby the way to Timnath; for she saw that Shelah was grown, and she was not given unto him to wife.",
            "citation": "(Genesis 38:14)"
          },
          "15": {
            "text": "When Judah saw her, he thought herto bean harlot; because she had covered her face.",
            "citation": "(Genesis 38:15)"
          },
          "16": {
            "text": "And he turned unto her by the way, and said, Go to, I pray thee, let me come in unto thee; (for he knew not that shewashis daughter in law.) And she said, What wilt thou give me, that thou mayest come in unto me?",
            "citation": "(Genesis 38:16)"
          },
          "17": {
            "text": "And he said, I will sendtheea kid from the flock. And she said, Wilt thou givemea pledge, till thou sendit?",
            "citation": "(Genesis 38:17)"
          },
          "18": {
            "text": "And he said, What pledge shall I give thee? And she said, Thysignet, and thy bracelets, and thy staff thatisin thine hand. And he gaveither, and came in unto her, and she conceived by him.",
            "citation": "(Genesis 38:18)"
          },
          "19": {
            "text": "And she arose, and went away, and laid by her veil from her, and put on the garments of her widowhood.",
            "citation": "(Genesis 38:19)"
          },
          "20": {
            "text": "And Judah sent the kid by the hand of his friend the Adullamite, to receivehispledge from the womans hand: but he found her not.",
            "citation": "(Genesis 38:20)"
          },
          "21": {
            "text": "Then he asked the men of that place, saying, Whereisthe harlot, thatwasopenly by the way side? And they said, There was no harlot in thisplace.",
            "citation": "(Genesis 38:21)"
          },
          "22": {
            "text": "And he returned to Judah, and said, I cannot find her; and also the men of the place said,thatthere was no harlot in thisplace.",
            "citation": "(Genesis 38:22)"
          },
          "23": {
            "text": "And Judah said, Let her takeitto her, lest we be shamed: behold, I sent this kid, and thou hast not found her.",
            "citation": "(Genesis 38:23)"
          },
          "24": {
            "text": "And it came to pass about three months after, that it was told Judah, saying, Tamar thy daughter in law hath played the harlot; and also, behold, sheiswith child by whoredom. And Judah said, Bring her forth, and let her beburnt.",
            "citation": "(Genesis 38:24)"
          },
          "25": {
            "text": "When shewasbrought forth, she sent to her father in law, saying, By the man, whose theseare, amI with child: and she said, Discern, I pray thee, whosearethese, thesignet, and bracelets, and staff.",
            "citation": "(Genesis 38:25)"
          },
          "26": {
            "text": "And Judah acknowledgedthem,and said, She hath been more righteous than I; because that I gave her not to Shelah my son. And he knew her again no more.",
            "citation": "(Genesis 38:26)"
          },
          "27": {
            "text": "And it came to pass in the time of her travail, that, behold, twinswerein her womb.",
            "citation": "(Genesis 38:27)"
          },
          "28": {
            "text": "And it came to pass, when she travailed, thatthe oneput outhishand: and the midwife took and bound upon his hand scarlet thread, saying, This came out first.",
            "citation": "(Genesis 38:28)"
          },
          "29": {
            "text": "And it came to pass, as he drew back his hand, that, behold, his brother came out: and she said, How hast thou broken forth?thisbreachbeupon thee: therefore his name was calledPharez.",
            "citation": "(Genesis 38:29)"
          },
          "30": {
            "text": "And afterward came out his brother, that had the scarlet thread upon his hand: and his name was calledZarah.",
            "citation": "(Genesis 38:30)"
          }
        }
      },
      "39": {
        "verses": {
          "1": {
            "text": "And Joseph was brought down to Egypt; andPotiphar, an officer of Pharaoh, captain of the guard, an Egyptian, bought him of the hands of theIshmeelites, which had brought him down thither.",
            "citation": "(Genesis 39:1)"
          },
          "2": {
            "text": "And theLordwas withJoseph,and he was prosperous man; and he was in the house of his master the Egyptian.",
            "citation": "(Genesis 39:2)"
          },
          "3": {
            "text": "And his master saw that theLordwaswith him, and that theLordmade all that he did toprosperin his hand.",
            "citation": "(Genesis 39:3)"
          },
          "4": {
            "text": "And Joseph found grace in his sight, and he served him: and he made him overseer over his house, and allthathe had he put into his hand.",
            "citation": "(Genesis 39:4)"
          },
          "5": {
            "text": "And it came to pass from the timethathe had made him overseer in his house, and over all that he had, that theLordblessed the Egyptians house for Josephssake; and the blessing of theLordwas upon all that he had in the house, and in the field.",
            "citation": "(Genesis 39:5)"
          },
          "6": {
            "text": "And he left all that he had in Josephs hand; and he knew not ought he had, save the bread which he did eat. And Joseph wasagoodlyperson,and wellfavoured.",
            "citation": "(Genesis 39:6)"
          },
          "7": {
            "text": "And it came to pass after these things, that his masters wife cast hereyesupon Joseph; and she said, Lie with me.",
            "citation": "(Genesis 39:7)"
          },
          "8": {
            "text": "But herefused, and said unto his masters wife, Behold, my masterwottethnot whatiswith me in the house, and he hathcommittedall that he hath to my hand;",
            "citation": "(Genesis 39:8)"
          },
          "9": {
            "text": "There isnone greater in this house than I; neither hath he kept back any thing from me but thee, because thouarthis wife: how then can I do this greatwickedness, andsinagainst God?",
            "citation": "(Genesis 39:9)"
          },
          "10": {
            "text": "And it came to pass, as she spake to Josephdayby day, that he hearkened not unto her, to lie by her,orto be with her.",
            "citation": "(Genesis 39:10)"
          },
          "11": {
            "text": "And it came to pass about this time, thatJosephwent into the house to do his business; andthere wasnone of the men of the house there within.",
            "citation": "(Genesis 39:11)"
          },
          "12": {
            "text": "And she caught him by his garment, saying, Lie with me: and he left his garment in her hand, andfled, and got him out.",
            "citation": "(Genesis 39:12)"
          },
          "13": {
            "text": "And it came to pass, when she saw that he had left his garment in her hand, and was fled forth,",
            "citation": "(Genesis 39:13)"
          },
          "14": {
            "text": "That she called unto the men of her house, and spake unto them, saying, See, he hath brought in an Hebrew unto us to mock us; he came in unto me to lie with me, and I cried with loud voice:",
            "citation": "(Genesis 39:14)"
          },
          "15": {
            "text": "And it came to pass, when he heard that I lifted up my voice and cried, that he left his garment with me, and fled, and got him out.",
            "citation": "(Genesis 39:15)"
          },
          "16": {
            "text": "And she laid up his garment by her, until his lord came home.",
            "citation": "(Genesis 39:16)"
          },
          "17": {
            "text": "And she spake unto him according to these words, saying, The Hebrew servant, which thou hast brought unto us, came in unto me to mock me:",
            "citation": "(Genesis 39:17)"
          },
          "18": {
            "text": "And it came to pass, as I lifted up my voice and cried, that he left his garment with me, and fled out.",
            "citation": "(Genesis 39:18)"
          },
          "19": {
            "text": "And it came to pass, when his master heard the words of his wife, which she spake unto him, saying, After this manner did thy servant to me; that his wrath was kindled.",
            "citation": "(Genesis 39:19)"
          },
          "20": {
            "text": "And Josephs master took him, and put him into theprison, place where the kings prisonerswerebound: and he was there in the prison.",
            "citation": "(Genesis 39:20)"
          },
          "21": {
            "text": "But theLordwas with Joseph, and shewed him mercy, and gave him favour in the sight of the keeper of the prison.",
            "citation": "(Genesis 39:21)"
          },
          "22": {
            "text": "And the keeper of the prison committed to Josephs hand all the prisoners thatwerein the prison; andwhatsoever they did there, he was thedoerof it.",
            "citation": "(Genesis 39:22)"
          },
          "23": {
            "text": "The keeper of the prison looked not to any thingthat wasunder his hand; because theLordwas with him, andthatwhich he did, theLordmadeittoprosper.",
            "citation": "(Genesis 39:23)"
          }
        }
      },
      "40": {
        "verses": {
          "1": {
            "text": "And it came to pass after these things,thatthe butler of the king of Egypt andhisbaker had offended their lord the king of Egypt.",
            "citation": "(Genesis 40:1)"
          },
          "2": {
            "text": "And Pharaoh was wroth against twoofhis officers, against the chief of the butlers, and against the chief of the bakers.",
            "citation": "(Genesis 40:2)"
          },
          "3": {
            "text": "And he put them in ward in the house of the captain of the guard, into theprison, the place where Josephwasbound.",
            "citation": "(Genesis 40:3)"
          },
          "4": {
            "text": "And the captain of the guard charged Joseph with them, and he served them: and they continued season in ward.",
            "citation": "(Genesis 40:4)"
          },
          "5": {
            "text": "And they dreamed dream both of them, each man his dream in one night, each man according to the interpretation of his dream, the butler and the baker of the king of Egypt, whichwerebound in the prison.",
            "citation": "(Genesis 40:5)"
          },
          "6": {
            "text": "And Joseph came in unto them in the morning, and looked upon them, and, behold, theyweresad.",
            "citation": "(Genesis 40:6)"
          },
          "7": {
            "text": "And he asked Pharaohs officers thatwerewith him in the ward of his lords house, saying, Wherefore look yesosadly to day?",
            "citation": "(Genesis 40:7)"
          },
          "8": {
            "text": "And they said unto him, We have dreamed adream, andthere isno interpreter of it. And Joseph said unto them,Donotinterpretationsbelongto God? tell methem,I pray you.",
            "citation": "(Genesis 40:8)"
          },
          "9": {
            "text": "And the chief butler told his dream to Joseph, and said to him, In my dream, behold, vinewasbefore me;",
            "citation": "(Genesis 40:9)"
          },
          "10": {
            "text": "And in the vinewerethree branches: and itwasas though it budded,andher blossoms shot forth; and the clusters thereof brought forth ripe grapes:",
            "citation": "(Genesis 40:10)"
          },
          "11": {
            "text": "And Pharaohs cupwasin my hand: and I took the grapes, and pressed them into Pharaohs cup, and I gave the cup into Pharaohs hand.",
            "citation": "(Genesis 40:11)"
          },
          "12": {
            "text": "And Joseph said unto him, Thisisthe interpretation of it: The three branchesarethree days:",
            "citation": "(Genesis 40:12)"
          },
          "13": {
            "text": "Yet within three days shall Pharaoh lift up thine head, and restore thee unto thy place: and thou shalt deliver Pharaohs cup into his hand, after the former manner when thou wast his butler.",
            "citation": "(Genesis 40:13)"
          },
          "14": {
            "text": "But think on me when it shall be well with thee, and shew kindness, I pray thee, unto me, and make mention of me unto Pharaoh, and bring me out of this house:",
            "citation": "(Genesis 40:14)"
          },
          "15": {
            "text": "For indeed I was stolen away out of the land of the Hebrews: and here also have I done nothing that they should put me into the dungeon.",
            "citation": "(Genesis 40:15)"
          },
          "16": {
            "text": "When the chief baker saw that the interpretation was good, he said unto Joseph, I alsowasin my dream, and, behold,I hadthree white baskets on my head:",
            "citation": "(Genesis 40:16)"
          },
          "17": {
            "text": "And in the uppermost basketthere wasof all manner of bakemeats for Pharaoh; and the birds did eat them out of the basket upon my head.",
            "citation": "(Genesis 40:17)"
          },
          "18": {
            "text": "And Joseph answered and said, Thisisthe interpretation thereof: The three basketsarethree days:",
            "citation": "(Genesis 40:18)"
          },
          "19": {
            "text": "Yet within three days shall Pharaoh lift up thy head from off thee, and shall hang thee on tree; and the birds shall eat thy flesh from off thee.",
            "citation": "(Genesis 40:19)"
          },
          "20": {
            "text": "And it came to pass the third day,which wasPharaohs birthday, that he made feast unto all hisservants: and he lifted up the head of the chief butler and of the chief baker among his servants.",
            "citation": "(Genesis 40:20)"
          },
          "21": {
            "text": "And he restored the chief butler unto his butlership again; and he gave the cup into Pharaohs hand:",
            "citation": "(Genesis 40:21)"
          },
          "22": {
            "text": "But he hanged the chief baker: as Joseph had interpreted to them.",
            "citation": "(Genesis 40:22)"
          },
          "23": {
            "text": "Yet did not the chief butler remember Joseph, butforgathim.",
            "citation": "(Genesis 40:23)"
          }
        }
      },
      "41": {
        "verses": {
          "1": {
            "text": "And it came to pass at the end of two full years, that Pharaohdreamed: and, behold, he stood by the river.",
            "citation": "(Genesis 41:1)"
          },
          "2": {
            "text": "And, behold, there came up out of the river seven well favoured kine and fatfleshed; and they fed in meadow.",
            "citation": "(Genesis 41:2)"
          },
          "3": {
            "text": "And, behold, seven other kine came up after them out of the river, ill favoured and leanfleshed; and stood by theotherkine upon the brink of the river.",
            "citation": "(Genesis 41:3)"
          },
          "4": {
            "text": "And the ill favoured and leanfleshed kine did eat up the seven well favoured and fat kine. So Pharaoh awoke.",
            "citation": "(Genesis 41:4)"
          },
          "5": {
            "text": "And he slept and dreamed the second time: and, behold, seven ears of corn came up upon one stalk, rank and good.",
            "citation": "(Genesis 41:5)"
          },
          "6": {
            "text": "And, behold, seven thin ears and blasted with the east wind sprung up after them.",
            "citation": "(Genesis 41:6)"
          },
          "7": {
            "text": "And the seven thin ears devoured the seven rank and full ears. And Pharaoh awoke, and, behold,it wasa dream.",
            "citation": "(Genesis 41:7)"
          },
          "8": {
            "text": "And it came to pass in the morning that his spirit wastroubled; and he sent and called for all themagiciansof Egypt, and all the wise men thereof: and Pharaoh told them his dream; butthere wasnone that could interpret them unto Pharaoh.",
            "citation": "(Genesis 41:8)"
          },
          "9": {
            "text": "Then spake the chief butler unto Pharaoh, saying, I do remember my faults this day:",
            "citation": "(Genesis 41:9)"
          },
          "10": {
            "text": "Pharaoh was wroth with his servants, and put me in ward in the captain of the guards house,bothme and the chief baker:",
            "citation": "(Genesis 41:10)"
          },
          "11": {
            "text": "And we dreamed dream in one night, I and he; we dreamed each man according to the interpretation of his dream.",
            "citation": "(Genesis 41:11)"
          },
          "12": {
            "text": "Andthere wasthere with us young man, an Hebrew, servant to the captain of the guard; and we told him, and he interpreted to us our dreams; to each man according to his dream he did interpret.",
            "citation": "(Genesis 41:12)"
          },
          "13": {
            "text": "And it came to pass, as he interpreted to us, so it was; me he restored unto mine office, and him he hanged.",
            "citation": "(Genesis 41:13)"
          },
          "14": {
            "text": "ThenPharaohsent and called Joseph, and they brought him hastily out of thedungeon: and he shavedhimself,and changed his raiment, and came in unto Pharaoh.",
            "citation": "(Genesis 41:14)"
          },
          "15": {
            "text": "And Pharaoh said unto Joseph, I have dreamed dream, andthere isnone that can interpret it: and I have heard say of thee,thatthou canst understand dream tointerpretit.",
            "citation": "(Genesis 41:15)"
          },
          "16": {
            "text": "And Joseph answered Pharaoh, saying,It isnot in me:Godshall give Pharaoh an answer ofpeace.",
            "citation": "(Genesis 41:16)"
          },
          "17": {
            "text": "And Pharaoh said unto Joseph, In my dream, behold, I stood upon the bank of the river:",
            "citation": "(Genesis 41:17)"
          },
          "18": {
            "text": "And, behold, there came up out of the river seven kine, fatfleshed and well favoured; and they fed in meadow:",
            "citation": "(Genesis 41:18)"
          },
          "19": {
            "text": "And, behold, seven other kine came up after them, poor and veryill favoured and leanfleshed, such as I never saw in all the land of Egypt for badness:",
            "citation": "(Genesis 41:19)"
          },
          "20": {
            "text": "And the lean and the ill favoured kine did eat up the first seven fat kine:",
            "citation": "(Genesis 41:20)"
          },
          "21": {
            "text": "And when they had eaten them up, it could not be known that they had eaten them; but theywerestill ill favoured, as at the beginning. So I awoke.",
            "citation": "(Genesis 41:21)"
          },
          "22": {
            "text": "And I saw in my dream, and, behold, seven ears came up in one stalk, full and good:",
            "citation": "(Genesis 41:22)"
          },
          "23": {
            "text": "And, behold, seven ears, withered, thin,andblasted with theeastwind, sprung up after them:",
            "citation": "(Genesis 41:23)"
          },
          "24": {
            "text": "And the thin ears devoured the seven good ears: and I toldthisunto the magicians; butthere wasnone that could declareitto me.",
            "citation": "(Genesis 41:24)"
          },
          "25": {
            "text": "And Joseph said unto Pharaoh, The dream of Pharaohisone: God hathshewedPharaoh what heisabout to do.",
            "citation": "(Genesis 41:25)"
          },
          "26": {
            "text": "The seven good kineareseven years; and the seven good earsareseven years: the dreamisone.",
            "citation": "(Genesis 41:26)"
          },
          "27": {
            "text": "And the seven thin and ill favoured kine that came up after themareseven years; and the seven empty ears blasted with the east wind shall be seven years offamine.",
            "citation": "(Genesis 41:27)"
          },
          "28": {
            "text": "Thisisthe thing which I have spoken unto Pharaoh: What Godisabout to do he sheweth unto Pharaoh.",
            "citation": "(Genesis 41:28)"
          },
          "29": {
            "text": "Behold, there come seven years of great plenty throughout all the land of Egypt:",
            "citation": "(Genesis 41:29)"
          },
          "30": {
            "text": "And there shall arise after them seven years of famine; and all the plenty shall be forgotten in the land of Egypt; and thefamineshall consume the land;",
            "citation": "(Genesis 41:30)"
          },
          "31": {
            "text": "And the plenty shall not be known in the land by reason of that famine following; for itshall bevery grievous.",
            "citation": "(Genesis 41:31)"
          },
          "32": {
            "text": "And for that the dream was doubled unto Pharaoh twice;it isbecause the thingisestablished by God, and God will shortly bring it to pass.",
            "citation": "(Genesis 41:32)"
          },
          "33": {
            "text": "Now therefore let Pharaoh look out man discreet and wise, and set him over the land of Egypt.",
            "citation": "(Genesis 41:33)"
          },
          "34": {
            "text": "Let Pharaoh dothis,and let him appoint officers over the land, and take up the fifth part of the land of Egypt in the seven plenteous years.",
            "citation": "(Genesis 41:34)"
          },
          "35": {
            "text": "And let them gather all the food of those good years that come, and lay up corn under the hand of Pharaoh, and let them keep food in the cities.",
            "citation": "(Genesis 41:35)"
          },
          "36": {
            "text": "And that food shall be forstoreto the land against the seven years of famine, which shall be in the land of Egypt; that the land perish not through the famine.",
            "citation": "(Genesis 41:36)"
          },
          "37": {
            "text": "And the thing wasgoodin the eyes of Pharaoh, and in the eyes of all his servants.",
            "citation": "(Genesis 41:37)"
          },
          "38": {
            "text": "And Pharaoh said unto his servants, Can we findsuch oneas thisis,a man in whom theSpiritof Godis?",
            "citation": "(Genesis 41:38)"
          },
          "39": {
            "text": "And Pharaoh said unto Joseph, Forasmuch as God hathshewedthee all this,there isnone so discreet andwiseas thouart:",
            "citation": "(Genesis 41:39)"
          },
          "40": {
            "text": "Thou shalt beovermy house, and according unto thy word shall all my people be ruled: only in the throne will I begreaterthan thou.",
            "citation": "(Genesis 41:40)"
          },
          "41": {
            "text": "And Pharaoh said unto Joseph, See, I havesetthee over all the land of Egypt.",
            "citation": "(Genesis 41:41)"
          },
          "42": {
            "text": "And Pharaoh took off hisringfrom his hand, and put it upon Josephs hand, andarrayedhim investuresof fine linen, and put gold chain about his neck;",
            "citation": "(Genesis 41:42)"
          },
          "43": {
            "text": "And he made him to ride in the second chariot which he had; and they cried before him, Bow the knee: and he made himrulerover all the land of Egypt.",
            "citation": "(Genesis 41:43)"
          },
          "44": {
            "text": "And Pharaoh said unto Joseph, IamPharaoh, and without thee shall no man lift up his hand or foot in all the land of Egypt.",
            "citation": "(Genesis 41:44)"
          },
          "45": {
            "text": "And Pharaoh called Josephs name Zaphnath-paaneah; and he gave him to wifeAsenaththe daughter of Poti-pherahpriestof On. And Joseph went out overallthe land of Egypt.",
            "citation": "(Genesis 41:45)"
          },
          "46": {
            "text": "AndJosephwasthirty years old when he stood before Pharaoh king of Egypt. And Joseph went out from the presence of Pharaoh, and went throughout all the land of Egypt.",
            "citation": "(Genesis 41:46)"
          },
          "47": {
            "text": "And in the seven plenteous years the earth brought forth by handfuls.",
            "citation": "(Genesis 41:47)"
          },
          "48": {
            "text": "And he gathered up all thefoodof the seven years, which were in the land of Egypt, and laid up the food in the cities: the food of the field, whichwasround about every city, laid he up in the same.",
            "citation": "(Genesis 41:48)"
          },
          "49": {
            "text": "And Joseph gathered corn as the sand of the sea, very much, until he left numbering; forit waswithout number.",
            "citation": "(Genesis 41:49)"
          },
          "50": {
            "text": "And unto Joseph were born two sons before the years of famine came, which Asenath the daughter of Poti-pherah priest of On bare unto him.",
            "citation": "(Genesis 41:50)"
          },
          "51": {
            "text": "And Joseph called the name of the firstbornManasseh: For God,said he,hath made me forget all my toil, and all my fathers house.",
            "citation": "(Genesis 41:51)"
          },
          "52": {
            "text": "And the name of the second called heEphraim: For God hath caused me to befruitfulin the land of my affliction.",
            "citation": "(Genesis 41:52)"
          },
          "53": {
            "text": "And the seven years of plenteousness, that was in the land of Egypt, were ended.",
            "citation": "(Genesis 41:53)"
          },
          "54": {
            "text": "And the seven years ofdearthbegan to come, according as Joseph had said: and the dearth was in all lands; but in all the land of Egypt there was bread.",
            "citation": "(Genesis 41:54)"
          },
          "55": {
            "text": "And when all the land of Egypt was famished, the people cried to Pharaoh for bread: and Pharaoh said unto all the Egyptians, Go unto Joseph; what he saith to you, do.",
            "citation": "(Genesis 41:55)"
          },
          "56": {
            "text": "And the famine was over all the face of the earth: And Joseph opened all the storehouses, andsoldunto the Egyptians; and the famine waxed sore in the land of Egypt.",
            "citation": "(Genesis 41:56)"
          },
          "57": {
            "text": "And all countries came into Egypt to Joseph for to buycorn;because that the famine wassosore in all lands.",
            "citation": "(Genesis 41:57)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 46406,
  "total_sources": 7,
  "generated_at": "2025-12-14T04:01:27.372564"
}