{
  "week_number": 8,
  "date_range": "Genesis 12–17",
  "title": ";Abraham 1–2",
  "primary_scriptures": [
    {
      "book": "Abraham",
      "chapters": [
        "1",
        "2"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    }
  ],
  "all_content": "\n\n--- CFM: ;Abraham 1–2 ---\nBecause of the covenant God made with him, Abraham has been called “the father of the faithful” (\nDoctrine and Covenants 138:41\n) and “the Friend of God” (\nJames 2:23\n). Millions today honor him as their direct ancestor, and others have been adopted into his family through conversion to the gospel of Jesus Christ. Yet Abraham himself came from a troubled family—his father, who had abandoned the true worship of God, tried to have Abraham sacrificed to false gods. In spite of this, Abraham’s desire was “to be a greater follower of righteousness” (\nAbraham 1:2\n), and the account of his life shows that God honored his desire. Abraham’s life stands as a testimony that no matter what a person’s family history has been, the future can be filled with hope.\nIdeas for Learning at Home and at Church\nAbraham 1:1–19\nGod will bless me for my faith and righteous desires.\n“We are all influenced by our families [and] our culture,” Elder Neil L. Andersen taught, “and yet I believe there is a place inside of us that we uniquely and individually control and create. … Eventually, our inner desires are given life and they are seen in our choices and in our actions” (“\nEducate Your Desires, Elder Andersen Counsels\n,”\nChurchofJesusChrist.org\n). Consider how\nAbraham 1:1–19\ndemonstrates what Elder Andersen taught. Questions like these might help:\nWhat did Abraham desire? How were his desires evident in his actions? How did God support his desires?\nWhat are your desires? How are they evident in your actions? How does God support you?\nWhat message do these verses have for people whose family members do not desire righteousness?\nOne of Abraham and Sarah’s greatest desires—to have a child—went unfulfilled for many years (see\nGenesis 15:1–6\n). What do you learn from\nHebrews 11:8–13\nabout how Abraham and Sarah faced this trial? How does the Savior help you “embrace” His promises, even if they are “afar off”?\nSee also “Deliverance of Abraham” (video), Gospel Library.\n1:38\nDeliverance of Abraham\nGenesis 12:1–3\n;\n13:15–16\n;\n15:1–6\n;\n17:1–8, 15–22\n;\nAbraham 2:6–11\nGod wants me to make and keep covenants with Him.\nWhy is it important for you to know about the covenant God made with Abraham? Because God wants to make a similar covenant with you. He promised that this covenant would continue in Abraham’s posterity, or “seed,” and that “as many as receive this Gospel shall be … accounted thy seed” (see\nAbraham 2:10–11\n). In other words, the covenant continues in you—when you are baptized and more completely when you make covenants in the temple (see\nGalatians 3:26–29\n;\nDoctrine and Covenants 132:30–32\n).\nFor that reason, you might want to study\nAbraham 2:6–11\nand make a list of what, exactly, God promised Abraham and Sarah (see also\nGenesis 12:1–3\n;\n13:15–16\n;\n15:1–6\n;\n17:1–8, 15–22\n). How might these blessings apply to you?\nSome of these promises have eternal parallels. How are promises like a land of inheritance or a large posterity fulfilled eternally? (see\nDoctrine and Covenants 131:1–4\n;\n132:20–24, 28–32\n).\nBesides promising blessings, God told Abraham to “\nbe\na blessing” (\nGenesis 12:2\n; emphasis added). What do you think that means? How will\nyou\nbe a blessing? (see\nAbraham 2:11\n).\nTo teach about covenants, Elder Dale G. Renlund spoke of tidal waves in the Amazon River, and President Emily Belle Freeman talked about walking a rocky path with a broken ankle (see “\nAccessing God’s Power through Covenants\n,”\nLiahona\n, May 2023, 35–37; “\nWalking in Covenant Relationship with Christ\n,”\nLiahona\n, Nov. 2023, 76–79). Search one or both of these messages for sentences that help answer the question “Why does God want me to make covenants with Him?”\nInvite people to teach each other.\nIf you’re teaching your family or a Church class about covenants, consider giving each person a portion of Elder Renlund’s or President Freeman’s message to study. Then they could share with the rest of the family or class what they learned. This allows people to testify to and learn from each other, and that invites the Spirit. (See\nTeaching in the Savior’s Way\n,\n26\n.)\nSee also Topics and Questions, “\nAbrahamic Covenant\n,” Gospel Library; “\nThoughts to Keep in Mind: The Covenant\n,” in this resource.\nThe Abrahamic Covenant\n, by Dilleen Marsh (detail)\nGenesis 14:18–19\n;\nJoseph Smith Translation, Genesis 14:25–40\n“Melchizedek was a man of faith.”\nImagine you were introducing Melchizedek to someone who didn’t know him. What would you say? Look for ideas in\nJoseph Smith Translation, Genesis 14:26–27, 33–38\n(in the Bible appendix);\nAlma 13:13–19\n;\nDoctrine and Covenants 107:1–4\n. What Christlike qualities do you find in these descriptions of Melchizedek? How does your study of Melchizedek’s life affect the way you view the Melchizedek Priesthood?\nGenesis 14:18–24\n;\nJoseph Smith Translation, Genesis 14:36–40\nAbraham paid tithing.\nWhat do you learn about Abraham’s attitude toward wealth from\nGenesis 14:18–24\nand\nJoseph Smith Translation, Genesis 14:36–40\n(in the Bible appendix)? For example, note his response to the king of Sodom in\nGenesis 14:23\n. How has obeying the law of tithing affected your view of money?\nGenesis 16\nGod hears me.\nAs you read\nGenesis 16\n, you might think about a time when you felt you were being treated unfairly, as Hagar did. Note that “Ishmael” means “God hears.” How has God shown you that He has heard you?\nSee also “\nSecret Prayer\n,”\nHymns\n, no. 144.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat are the facsimiles in the book of Abraham?\nWhy did Sarai give Hagar to Abram as a wife?\nHow was circumcision related to the Lord’s covenant with Abraham?\nClick to see more.\nIdeas for Teaching Children\nAbraham 1:18\n;\n2:8\nJesus Christ will lead me by the hand.\nAs you and your children read\nAbraham 1:18\nand\n2:8\n, you could invite them to listen for a part of the body that is mentioned in both verses. Maybe you could play a game in which a child closes their eyes and you lead the child somewhere by the hand. Then you could talk about how it feels to have Jesus Christ lead us by the hand or protect us.\nGenesis 13:5–12\nI can be a peacemaker.\nYour children might enjoy acting out the story from\nGenesis 13:5–12\n, pretending to be Abraham, Lot, and the herdsmen. How can we follow Abraham’s example of being a peacemaker with our family or friends? Try role-playing their answers.\nLot’s Choice\n, by William Fredericks © Providence Collection/licensed from goodsalt.com\nGenesis 13:16\n;\nGenesis 15:1–6\n;\n17:1–8\n;\nAbraham 2:9–11\nGod wants me to make covenants with Him.\nConsider showing your children a container of sand, the stars in the night sky, or the picture at the end of this outline. This could help them understand God’s promises in\nGenesis 13:16\n;\n15:1–6\n. Talk about how you’ve learned to trust God’s promises, even when they seemed impossible.\nTo teach your children about covenants, ask them to tell you about a time when they made a promise or someone made a promise to them. If it’s helpful, share some examples of your own—including covenants you’ve made with God at baptism or in the temple. How have your covenants affected your relationship with God? Choose a few phrases from\nGenesis 15:1–6\n;\n17:1–8\n;\nAbraham 2:9–11\nto share some of the blessings God promised to Abraham and Sarah.\nTo help your children prepare to make a covenant with God when they are baptized, you could use some of the activity ideas suggested in\nappendix A\nor\nappendix B\n.\nAbraham 1:12–17\n;\nGenesis 16:7–11\nGod hears me.\nWhen Abraham’s life was in danger, he called on God. When Hagar was alone in the wilderness, she learned that God heard her. Consider sharing these two stories with your children: “\nAbraham and Sarah\n” and “\nHagar\n” in\nOld Testament Stories\n, 28–31, 32–33. What do we learn about God from these stories? Then you could share with each other experiences when you felt that God heard you. A song like “\nA Child’s Prayer\n” (\nChildren’s Songbook\n, 12–13) could reinforce this principle.\n2:20\nAbraham and Sarah\n1:23\nHagar\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 8: Lesson 22: Lesson 22—Abraham 1This lesson can help students feel hope that Heavenly Father can help them obtain blessings that He wants them to receive.; Lesson 23: Lesson 23—Genesis 12; 17This lesson can help students explain the Abrahamic covenant and how it relates to them.... ---\n\n--- Lesson 22 ---\nAbraham grew up surrounded by wickedness and idolatry. Despite these circumstances, Abraham desired to follow Jesus Christ, who was known in the premortal life and to Abraham as Jehovah. As Abraham sought after his righteous desires, the Lord blessed him to obtain them. This lesson can help students feel hope that Heavenly Father can help them obtain blessings that He wants them to receive. Student preparation: Invite students to make a list of what they want most in life and to think about how Heavenly Father feels about what they want most. Possible Learning Activities What do you desire? Begin the lesson by helping students think of situations where they might have trouble believing that the Lord can help them obtain a righteous blessing that they desire. To do this, you could share the following incomplete scenarios and invite students to identify an obstacle that the individual might face. Samantha has a strong desire to follow Jesus Christ by preaching His gospel to other people. However, right now this seems difficult because … Yuchen has a strong desire to follow Jesus Christ by paying his tithing. However, right now this seems difficult because … Carlos has a strong desire to follow Jesus Christ by being baptized. However, right now this seems difficult because … Invite students to think about their own circumstances and the obstacles they might face to following Jesus Christ. Ask them to complete the following steps in their study journals. In your study journal: Record some of the blessings you most desire in life. List any obstacles you see to obtaining these blessings. As students study Abraham 1 , invite them to seek Heavenly Father’s help through the Holy Ghost. The Holy Ghost can help them feel hope that they can follow Jesus Christ and obtain His blessings no matter the obstacles they may face. Abraham’s circumstances In Lesson 3: Abraham 3 , students learned the origins of the book of Abraham. If you did not explain this in Lesson 3, you could do it now. If students have questions about the origins of the book of Abraham, you could show the video “ The Book of Abraham | Now You Know ” from time code 0:00 to 2:43. This video is located at ChurchofJesusChrist.org . 5:7 It may be helpful to have students create a two-column chart. They could title the first column “Blessings Abraham desired” and the second “Obstacles Abraham faced.” This can help organize what students learn from Abraham 1:1–7 . Blessings Abraham desired Obstacles Abraham faced Blessings Abraham desired Obstacles Abraham faced Read Abraham 1:1–7 , looking for what blessings Abraham desired and what obstacles he faced to receiving those blessings. What stands out to you from the blessings Abraham desired? Why might these blessings be something you also desire? How might Abraham’s desire to follow Jesus Christ have helped him in the difficult circumstances he faced? Jehovah helped Abraham overcome his obstacles Read Abraham 1:15–20 , looking for how Jehovah helped Abraham overcome the obstacles he faced. Alternatively, you may choose to show the video “ Deliverance of Abraham ” (1:38), available at ChurchofJesusChrist.org . 1:38 If time allows, you may want to spend some time discussing the miraculous way that Jehovah delivered Abraham. You could compare this deliverance to ways the Lord delivers us from our obstacles to righteous living. The Lord can deliver us from unhealthy habits such as excessive social media or technology use or pornography use. You could testify that Jehovah can deliver us from any obstacle that might otherwise make it difficult to follow Him. What do you think Abraham learned about Jehovah from this experience? How might Heavenly Father help us overcome obstacles to receiving righteous blessings we desire? Explain to students that after Abraham was delivered, he eventually went to Canaan. The Lord honored Abraham for acting on his desires by blessing him with the priesthood and other significant blessings. God promised Abraham these blessings as part of what we call the Abrahamic covenant. Students will learn more about this covenant in future lessons. Later in Abraham’s life, the Lord visited him and promised that He would fulfill all of Abraham’s righteous desires (see Abraham 2:9–11 ). Read Abraham 2:12–13 , looking for what Abraham said after this experience. What principles can we learn from Abraham’s experience? Students may identify a variety of principles including: If we seek to follow Jesus Christ, God will grant us the righteous blessings we desire. Read the following statement from President Jeffrey R. Holland of the Quorum of the Twelve Apostles, or watch the video “ A Perfect Brightness of Hope ” from time code 11:09 to 11:38. The video is located at ChurchofJesusChrist.org . 17:45 Why should we not hope that righteous desires and Christlike yearnings can still be marvelously, miraculously answered by the God of all hope? We all need to believe that what we desire in righteousness can someday, someway, somehow yet be ours. (“ A Perfect Brightness of Hope ,” Ensign or Liahona , May 2020, 83) Invite students to discuss the following questions in pairs or small groups, or have students record their answers in their study journals. After enough time, willing students could share one or both of their answers with the class. How do President Holland’s words and Abraham’s experience give you hope that the Lord can help you overcome obstacles to following Jesus Christ? When has Heavenly Father helped you or someone you know overcome obstacles to following Jesus Christ? Consider sharing your experience of when Heavenly Father has helped you overcome an obstacle to receiving a righteous blessing. Invite students to record what they learned today in their study journals. Consider inviting willing students to share what they wrote. Conclude by sharing your testimony of these truths.\n\n\n--- Lesson 23 ---\nThe Lord and Abraham entered a covenant that is now known as the Abrahamic covenant. As we make and keep covenants with God today, we can receive the same blessings from Him as Abraham did. This lesson can help students explain the Abrahamic covenant and how it relates to them. Student preparation: Invite students to search “ Abrahamic Covenant ” in the Gospel Library or Guide to the Scriptures, or “ Abraham, covenant of ” in the Bible Dictionary, and come prepared to share what they found. Possible Learning Activities The Abrahamic covenant Invite students to imagine they were asked to give a talk in sacrament meeting about the Abrahamic covenant. To help them assess how prepared they might be to do this, invite them to write down and answer the following questions in their study journals. What is the Abrahamic covenant? How can I receive the Abrahamic covenant? Why does the Abrahamic covenant matter to me? Assure students that it is okay if they do not know much about the Abrahamic covenant. Let them know that they will be able to add to their responses during class. Encourage them to seek confirmation from the Holy Ghost about the truthfulness of what they are learning. Note: This lesson focuses on what the blessings of the Abrahamic covenant are and why they matter to us. Lesson 24: “ Abraham 2:9–11 ” will focus on our responsibilities in the Abrahamic covenant. What is the Abrahamic covenant? Recall that Abraham desired “the blessings of the fathers” and to be a “follower of righteousness” ( Abraham 1:2 ). The Lord promised to put His name upon Abraham and to give him the priesthood (see Abraham 1:18 ). Consider creating the following chart on the board. Invite students to study the verses in the first column and list the blessings they find next to the corresponding verses on the board. They will study the verses in the second column later in the lesson. The Lord’s blessings promised to Abraham The Lord’s blessings promised to me Genesis 12:2 ; 17:1–2, 4–6 Genesis 12:3 ; 17:7 Genesis 12:7 ; 17:8 Abraham 2:11 Doctrine and Covenants 132:19–22, 30–31 Abraham 2:9–11 Doctrine and Covenants 88:18–20 Doctrine and Covenants 84:33–38 Read Genesis 12:2–3, 7 ; 17:1–8 ; Abraham 2:11 , looking for the blessings God extended to Abraham. As students read the scriptures, consider moving around the room. Some students are more likely to ask questions when a teacher is close by, so moving around the classroom while students read can make it easier for some students to ask you for help. When students have finished, invite them to share what they found. What did you find? What do these promises teach you about God? The following is a list of some of the blessings students might find: Genesis 12:2 ; 17:1–2, 4–6 : father of many nations; multiplied exceedingly; exceeding fruitful (In Hebrew, the name Abram means “exalted father,” and the name Abraham means “father of many.”) Genesis 12:3 ; 17:7 : all the families of the earth blessed by his posterity; God’s covenant to continue with Abraham’s posterity Genesis 12:7 ; 17:8 : land of Canaan Abraham 2:11 : priesthood Students may also identify the phrase “kings shall come out of thee” ( Genesis 17:6 ). This refers to the kings that would rule both Israel and Judah; but more importantly, it refers to Jesus Christ (see Matthew 1:1 ; Revelation 19:16 ). You may want to point out that the covenant God made with Abraham is known as the Abrahamic covenant. Explain that it is how God offers His greatest blessings to His children. God reaffirmed this covenant with Abraham multiple times in his life (see Genesis 13:14–17 ; 15:5, 18 ; 22:15–18 ; Abraham 2:8–12 ; 3:14 ). How can I receive the Abrahamic covenant? Share the following statement from President Nelson to help students see how the Abrahamic covenant relates to them (see also Galatians 3:27–29 ; Abraham 2:10 ). President Russell M. Nelson taught how each of us can also receive these same blessings that God promised Abraham: When we embrace the gospel and are baptized, we take upon ourselves the sacred name of Jesus Christ. Baptism is the gate that leads to becoming joint heirs to all the promises given anciently by the Lord to Abraham, Isaac, Jacob, and their posterity. “The new and everlasting covenant” ( Doctrine and Covenants 132:6 ) and the Abrahamic covenant are essentially the same—two ways of phrasing the covenant God made with mortal men and women at different times. … … [Y]ou and I personally entered the covenant path at baptism. Then we enter it more completely in the temple. The blessings of the Abrahamic covenant are conferred in holy temples. These blessings allow us, upon being resurrected, to “inherit thrones, kingdoms, powers, principalities, and dominions, to our ‘exaltation and glory in all things’ [ Doctrine and Covenants 132:19 ].” (“ The Everlasting Covenant ,” Liahona , Oct. 2022, 4, 6) How would you summarize what we can learn from President Nelson about the blessings of Abraham? Help students identify a truth like: As we make and keep covenants with God, we become heirs to the blessings given to Abraham. Why does the Abrahamic covenant matter to me? Invite students to study the references in the second column and to list in their study journals how the blessings promised to Abraham are also promised to them. These verses might be best for students to study in pairs or small groups. The following are some of the blessings students might find: Doctrine and Covenants 132:19–22, 30–31 : eternal families (“continuation of the seeds” and “continuation of the lives”) Abraham 2:9–11 : gospel shared with all the families of the earth; salvation and exaltation Doctrine and Covenants 88:18–20 (“it” refers to the earth): inheritance in the celestial kingdom (see also Hebrews 11:8, 13–16 ) Doctrine and Covenants 84:33–38 : the blessings of the priesthood, including all that the Father has In what ways are these promised blessings meaningful to you? What do these blessings teach you about God’s feelings for you? To place the Abrahamic covenant in the context of Heavenly Father’s plan, you might want to ask students what makes it possible for us to receive the blessings they listed. You could have students ponder or share some of their thoughts. You could also share this statement from President Nelson. President Russell M. Nelson pointed out what makes it possible for us to receive the blessings of the Abrahamic covenant: The Savior’s atoning sacrifice enabled the Father to fulfill His promises made to His children. … The fulfillment of the Abrahamic covenant becomes feasible because of the Atonement of our Savior, the Lord Jesus Christ. Jesus Christ is at the center of the Abrahamic covenant. (“ The Everlasting Covenant ,” Liahona , Oct. 2022, 7). Explain the Abrahamic covenant Invite students to add to their responses from the beginning of class: What is the Abrahamic covenant? How can I receive the Abrahamic covenant? Why does the Abrahamic covenant matter to me? To solidify their understanding, consider inviting students to get into pairs and explain the Abrahamic covenant to each other. Encourage them to see if they can be brief yet complete in their responses. Explaining this covenant in as few words as possible can help students to understand it more clearly. Testify of the blessings and promises God offers us through the Abrahamic covenant.\n\n\n--- Lesson 24 ---\nThe Lord made a covenant with Abraham and his posterity. As the seed of Abraham, we have a covenant responsibility to bring the blessings of the Savior’s gospel to all the families of the earth. This lesson will help students act on the responsibilities the Lord has given them as the seed of Abraham. Student preparation: Invite students to think about the following questions and to discuss them with a family member: Why does the gospel of Jesus Christ matter to you? Why do you think all people need it?” Possible Learning Activities The seed of Abraham You could begin class by giving students 30 seconds to list as many words as they can that describe themselves. Next, ask students to circle three words that best describe them. A few students could share with the class. In what ways do these identifiers influence your behavior? Elder David A. Bednar of the Quorum of the Twelve Apostles taught the following about our identity: 17:8 You may enjoy music, athletics, or be mechanically inclined, and someday you may work in a trade or a profession or in the arts. As important as such activities and occupations can be, they do not define who we are. First and foremost, we are spiritual beings. We are sons [and daughters] of God and the seed of Abraham. (“ Becoming a Missionary ,” Ensign or Liahona , Nov. 2005, 47) What stands out to you from what Elder Bednar taught about our foremost identities? If students studied Lesson 23: “ Genesis 12; 17 ,” invite them to summarize with a classmate what they remember about the Abrahamic covenant. Help students see that as the seed, or posterity, of Abraham, not only are we promised significant blessings, but we also covenant to fulfill significant responsibilities. Invite them to complete the following self-assessment. Select which of the following statements are true of you: I understand my responsibilities as the seed of Abraham. I am seeking to fulfill my responsibilities as the seed of Abraham. I have found great joy in fulfilling my responsibilities as the seed of Abraham. I do not understand what my responsibilities are as the seed of Abraham. I have questions about what my responsibilities are as the seed of Abraham. Invite students to record any questions they may have or impressions they felt as they considered these statements. Invite them to seek revelation from their Father in Heaven through the Holy Ghost to know how they can better fulfill their responsibilities as the seed of Abraham. Abraham 2:9–11 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Abraham 2:8–11 , looking for our responsibilities as the seed of Abraham. What does the Savior expect of us? You might invite students to ask any questions about the verses. As you discuss the responsibilities of the Abrahamic covenant, help students identify a truth similar to: As the seed of Abraham, the Savior has given us a responsibility to bless all the families of the earth with the blessings of His gospel. Students may benefit from knowing they can fulfill their covenant responsibility by helping gather Israel. What are some ways we can bless all the families of the earth with the Savior’s gospel? Read 1 Nephi 15:18 , looking for when the Abrahamic covenant will be fulfilled. President Russell M. Nelson testified: Ours is the responsibility to help fulfill the Abrahamic covenant. Ours is the seed foreordained and prepared to bless all people of the world. That is why priesthood duty includes missionary work. After some 4,000 years of anticipation and preparation, this is the appointed day when the gospel is to be taken to the kindreds of the earth. This is the time of the promised gathering of Israel. And we get to participate! Isn’t that exciting? (“ Covenants ,” Ensign or Liahona , Nov. 2011, 88) Anytime we do anything that helps anyone—on either side of the veil—to make and keep their covenants with God, we are helping to gather Israel. (“ Let God Prevail ,” Ensign or Liahona , Nov. 2020, 92–93) How do you feel about the gospel of Jesus Christ? Why do you think all people need it? What experiences have you (or people you know) had gathering Israel? Fulfilling our responsibilities This portion of the lesson gives students time in class to do something to fulfill their responsibilities in the Abrahamic covenant. You could create learning stations based on the following handout. Students could choose one activity to focus on, or they could rotate through different activities. You might assign student leaders for each station to help their peers complete the exercises. Invite students to seek inspiration when selecting what to focus on. Open PDF After enough time, allow students to share the activity they chose and what they felt inspired to do. As students respond to some or all of the following questions, think of ways to help students seek, recognize, and act on personal revelation. One way for you to do this is to ask yourself, “What else can I invite them to do?” Asking yourself this kind of question can invite inspiration from the Holy Ghost on how to help students act on the personal revelation they receive. For additional training on follow-up questions that invite personal revelation, see “ Help learners seek, recognize, and act on personal revelation ” in Teacher Development Skills. Students may benefit from time to reflect on and answer the following questions in their study journals. What did you do or what plans did you make to bless others with the Savior’s gospel? What have you felt prompted to do in the days and weeks ahead to: Help others make or keep covenants? Share the Savior’s gospel? Help people on the other side of the veil? Consider testifying of our important responsibility, as the seed of Abraham, to share the blessings of the Savior’s gospel with all people. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Abraham 2:9–11 is “The Lord promised Abraham that his seed would ‘bear this ministry and Priesthood unto all nations.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n--- SCRIPTURE: Abraham 1 ---\n1. In the land of theChaldeans, at the residence of my fathers, I,Abraham, saw that it was needful for me to obtain another place ofresidence;\n2. And, finding there was greaterhappinessand peace and rest for me, I sought for the blessings of the fathers, and the right whereunto I should be ordained to administer the same; having been myself follower ofrighteousness, desiring also to be one who possessed greatknowledge, and to be greater follower of righteousness, and to possess greater knowledge, and to be father of manynations, prince of peace, anddesiringto receive instructions, and to keep the commandments of God, I became rightful heir, aHigh Priest, holding the right belonging to the fathers.\n3. It wasconferredupon me from the fathers; it came down from the fathers, from the beginning of time, yea, even from the beginning, or before the foundation of the earth, down to the present time, even the right of thefirstborn, or the first man, who isAdam, or first father, through the fathers unto me.\n4. I sought for mineappointmentunto the Priesthood according to the appointment of God unto thefathersconcerning the seed.\n5. Myfathers, having turned from their righteousness, and from the holy commandments which the Lord their God had given unto them, unto the worshiping of thegodsof theheathen, utterly refused to hearken to my voice;\n6. For theirheartswere set to doevil, and were wholly turned to the god ofElkenah, and the god of Libnah, and the god of Mahmackrah, and the god of Korash, and the god of Pharaoh, king of Egypt;\n7. Therefore they turned their hearts to the sacrifice of theheathenin offering up their children unto these dumb idols, and hearkened not unto my voice, but endeavored totake away mylifeby the hand of the priest of Elkenah. The priest of Elkenah was also the priest of Pharaoh.\n8. Now, at this time it was the custom of the priest of Pharaoh, the king of Egypt, to offer up upon the altar which was built in the land of Chaldea, for the offering unto these strange gods, men, women, and children.\n9. And it came to pass that the priest made an offering unto the god of Pharaoh, and also unto the god of Shagreel, even after the manner of the Egyptians. Now the god of Shagreel was the sun.\n10. Even the thank-offering of child did thepriestof Pharaoh offer upon the altar which stood by the hill called Potiphars Hill, at the head of the plain of Olishem.\n11. Now, this priest had offered upon this altar three virgins at one time, who were the daughters of Onitah, one of the royal descent directly from the loins ofHam. These virgins were offered up because of their virtue; they would notbowdown to worship gods of wood or of stone, therefore they were killed upon this altar, and it was done after the manner of the Egyptians.\n12. And it came to pass that the priests laid violence upon me, that they might slay me also, as they did those virgins upon this altar; and that you may have knowledge of this altar, I will refer you to the representation at the commencement of this record.\n13. It was made after the form of bedstead, such as was had among the Chaldeans, and it stood before the gods of Elkenah, Libnah, Mahmackrah, Korash, and also god like unto that of Pharaoh, king of Egypt.\n14. That you may have an understanding of these gods, I have given you the fashion of them in the figures at the beginning, which manner of figures is called by the Chaldeans Rahleenos, which signifies hieroglyphics.\n15. And as they lifted up their hands upon me, that they might offer me up and take away my life, behold, I lifted up my voice unto the Lord my God, and the Lordhearkenedand heard, and he filled me with the vision of the Almighty, and the angel of his presence stood by me, and immediatelyunloosedmy bands;\n16. And his voice was unto me:Abraham, Abraham, behold, mynameis Jehovah, and I have heard thee, and have come down to deliver thee, and to take thee away from thyfathershouse, and from all thy kinsfolk, into strangelandwhich thou knowest not of;\n17. And this because they have turned theirheartsaway from me, to worship the god of Elkenah, and the god of Libnah, and the god of Mahmackrah, and the god of Korash, and the god of Pharaoh, king of Egypt; therefore I have come down tovisitthem, and to destroy him who hath lifted up his hand against thee, Abraham, my son, to take away thy life.\n18. Behold, I will lead thee by my hand, and I will take thee, to put upon thee my name, even the Priesthood of thy father, and my power shall be over thee.\n19. As it was withNoahso shall it be with thee; but through thy ministry mynameshall be known in the earthforever, for I am thy God.\n20. Behold, Potiphars Hill was in the land ofUr, of Chaldea. And the Lord broke down the altar of Elkenah, and of the gods of the land, and utterly destroyed them, and smote the priest that he died; and there was great mourning in Chaldea, and also in the court of Pharaoh; which Pharaoh signifies king by royal blood.\n21. Now this king of Egypt was descendant from theloinsofHam, and was partaker of the blood of theCanaanitesby birth.\n22. From this descent sprang all the Egyptians, and thus the blood of theCanaaniteswas preserved in the land.\n23. The land ofEgyptbeing first discovered by woman, who was the daughter of Ham, and the daughter of Egyptus, which in the Chaldean signifies Egypt, which signifies that which is forbidden;\n24. When this woman discovered the land it was under water, who afterward settled her sons in it; and thus, from Ham, sprang that race which preserved the curse in the land.\n25. Now the firstgovernmentof Egypt was established by Pharaoh, the eldest son of Egyptus, the daughter of Ham, and it was after the manner of the government of Ham, which was patriarchal.\n26. Pharaoh, being righteous man, established his kingdom and judged his people wisely and justly all his days, seeking earnestly to imitate thatorderestablished by the fathers in the first generations, in the days of the first patriarchal reign, even in the reign of Adam, and also of Noah, his father, who blessed him with theblessingsof the earth, and with the blessings of wisdom, but cursed him as pertaining to the Priesthood.\n27. Now, Pharaoh being of that lineage by which he could not have the right ofPriesthood, notwithstanding the Pharaohs would fainclaimit from Noah, through Ham, therefore my father was led away by their idolatry;\n28. But I shall endeavor, hereafter, to delineate the chronology running back from myself to the beginning of the creation, for therecordshave come into my hands, which I hold unto this present time.\n29. Now, after the priest of Elkenah was smitten that he died, there came fulfilment of those things which were said unto me concerning the land of Chaldea, that there should be afaminein the land.\n30. Accordingly famine prevailed throughout all the land of Chaldea, and my father was sorely tormented because of the famine, and he repented of the evil which he had determined against me, to take away mylife.\n31. But therecordsof the fathers, even the patriarchs, concerning the right of Priesthood, the Lord my God preserved in mine own hands; therefore knowledge of the beginning of the creation, and also of theplanets, and of the stars, as they were made known unto the fathers, have I kept even unto this day, and I shall endeavor to write some of these things upon thisrecord, for the benefit of my posterity that shall come after me.\n\n--- SCRIPTURE: Abraham 2 ---\n1. Now the Lord God caused thefamineto wax sore in the land of Ur, insomuch thatHaran, my brother, died; butTerah, my father, yet lived in the land of Ur, of the Chaldees.\n2. And it came to pass that I, Abraham, tookSaraito wife, andNahor, my brother, took Milcah to wife, who was thedaughterof Haran.\n3. Now the Lord hadsaidunto me: Abraham, get thee out of thy country, and from thy kindred, and from thy fathers house, unto land that I will show thee.\n4. Therefore I left the land ofUr, of the Chaldees, to go into the land of Canaan; and I took Lot, my brothers son, and his wife, and Sarai my wife; and also myfatherfollowed after me, unto the land which we denominated Haran.\n5. And the famine abated; and my father tarried in Haran and dwelt there, as there were many flocks in Haran; and my father turned again unto hisidolatry, therefore he continued in Haran.\n6. But I, Abraham, and Lot, my brothers son, prayed unto the Lord, and the Lordappearedunto me, and said unto me: Arise, and take Lot with thee; for I have purposed to take thee away out of Haran, and to make of thee aministerto bear mynamein strangelandwhich I will give unto thy seed after thee for an everlasting possession, when they hearken to my voice.\n7. For I am the Lord thy God; I dwell inheaven; the earth is myfootstool; I stretch my hand over the sea, and it obeys my voice; I cause the wind and the fire to be mychariot; I say to the mountainsDepart henceand behold, they are taken away by whirlwind, in an instant, suddenly.\n8. Mynameis Jehovah, and Iknowthe end from the beginning; therefore my hand shall be over thee.\n9. And I will make of thee greatnation, and I willblessthee above measure, and make thy name great among all nations, and thou shalt be blessing unto thy seed after thee, that in their hands they shall bear this ministry andPriesthoodunto all nations;\n10. And I willblessthem through thy name; for as many as receive thisGospelshall be called after thyname, and shall be accounted thyseed, and shall rise up and bless thee, as theirfather;\n11. And I willblessthem that bless thee, andcursethem that curse thee; and in thee (that is, in thy Priesthood) and in thyseed(that is, thy Priesthood), for I give unto thee promise that thisrightshall continue in thee, and in thy seed after thee (that is to say, the literal seed, or the seed of the body) shall all the families of the earth be blessed, even with the blessings of the Gospel, which are the blessings of salvation, even of life eternal.\n12. Now, after the Lord had withdrawn from speaking to me, and withdrawn his face from me, I said in my heart: Thy servant hassoughtthee earnestly; now I have found thee;\n13. Thou didst send thine angel todeliverme from the gods of Elkenah, and I will do well to hearken unto thy voice, therefore let thy servant rise up and depart in peace.\n14. So I, Abraham, departed as the Lord had said unto me, and Lot with me; and I, Abraham, wassixtyand two years old when I departed out of Haran.\n15. And I took Sarai, whom I took to wife when I was in Ur, in Chaldea, and Lot, my brothers son, and all our substance that we had gathered, and the souls that we hadwonin Haran, and came forth in the way to the land of Canaan, and dwelt in tents as we came on our way;\n16. Therefore,eternitywas our covering and ourrockand our salvation, as we journeyed from Haran by the way ofJershon, to come to the land of Canaan.\n17. Now I, Abraham, built analtarin the land of Jershon, and made an offering unto the Lord, and prayed that thefaminemight be turned away from my fathers house, that they might not perish.\n18. And then we passed from Jershon through the land unto the place of Sechem; it was situated in the plains of Moreh, and we had already come into the borders of the land of theCanaanites, and I offeredsacrificethere in the plains of Moreh, and called on the Lord devoutly, because we had already come into the land of this idolatrous nation.\n19. And the Lordappearedunto me in answer to my prayers, and said unto me: Unto thy seed will I give thisland.\n20. And I, Abraham, arose from the place of the altar which I had built unto the Lord, and removed from thence unto mountain on the east ofBethel, and pitched my tent there, Bethel on the west, andHaion the east; and there I built anotheraltarunto the Lord, andcalledagain upon the name of the Lord.\n21. And I, Abraham, journeyed, going on still towards the south; and there was continuation of famine in the land; and I, Abraham, concluded to go down into Egypt, to sojourn there, for the famine became very grievous.\n22. And it came to pass when I was come near to enter into Egypt, the Lordsaidunto me: Behold, Sarai, thy wife, is very fair woman to look upon;\n23. Therefore it shall come to pass, when the Egyptians shall see her, they will sayShe is his wife; and they will kill you, but they will save her alive; therefore see that ye do on this wise:\n24. Let her say unto the Egyptians, she is thy sister, and thy soul shall live.\n25. And it came to pass that I, Abraham, told Sarai, my wife, all that the Lord had said unto meTherefore say unto them, I pray thee, thou art mysister, that it may be well with me for thy sake, and my soul shall live because of thee.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";Abraham 1–2",
      "content": "Because of the covenant God made with him, Abraham has been called “the father of the faithful” (\nDoctrine and Covenants 138:41\n) and “the Friend of God” (\nJames 2:23\n). Millions today honor him as their direct ancestor, and others have been adopted into his family through conversion to the gospel of Jesus Christ. Yet Abraham himself came from a troubled family—his father, who had abandoned the true worship of God, tried to have Abraham sacrificed to false gods. In spite of this, Abraham’s desire was “to be a greater follower of righteousness” (\nAbraham 1:2\n), and the account of his life shows that God honored his desire. Abraham’s life stands as a testimony that no matter what a person’s family history has been, the future can be filled with hope.\nIdeas for Learning at Home and at Church\nAbraham 1:1–19\nGod will bless me for my faith and righteous desires.\n“We are all influenced by our families [and] our culture,” Elder Neil L. Andersen taught, “and yet I believe there is a place inside of us that we uniquely and individually control and create. … Eventually, our inner desires are given life and they are seen in our choices and in our actions” (“\nEducate Your Desires, Elder Andersen Counsels\n,”\nChurchofJesusChrist.org\n). Consider how\nAbraham 1:1–19\ndemonstrates what Elder Andersen taught. Questions like these might help:\nWhat did Abraham desire? How were his desires evident in his actions? How did God support his desires?\nWhat are your desires? How are they evident in your actions? How does God support you?\nWhat message do these verses have for people whose family members do not desire righteousness?\nOne of Abraham and Sarah’s greatest desires—to have a child—went unfulfilled for many years (see\nGenesis 15:1–6\n). What do you learn from\nHebrews 11:8–13\nabout how Abraham and Sarah faced this trial? How does the Savior help you “embrace” His promises, even if they are “afar off”?\nSee also “Deliverance of Abraham” (video), Gospel Library.\n1:38\nDeliverance of Abraham\nGenesis 12:1–3\n;\n13:15–16\n;\n15:1–6\n;\n17:1–8, 15–22\n;\nAbraham 2:6–11\nGod wants me to make and keep covenants with Him.\nWhy is it important for you to know about the covenant God made with Abraham? Because God wants to make a similar covenant with you. He promised that this covenant would continue in Abraham’s posterity, or “seed,” and that “as many as receive this Gospel shall be … accounted thy seed” (see\nAbraham 2:10–11\n). In other words, the covenant continues in you—when you are baptized and more completely when you make covenants in the temple (see\nGalatians 3:26–29\n;\nDoctrine and Covenants 132:30–32\n).\nFor that reason, you might want to study\nAbraham 2:6–11\nand make a list of what, exactly, God promised Abraham and Sarah (see also\nGenesis 12:1–3\n;\n13:15–16\n;\n15:1–6\n;\n17:1–8, 15–22\n). How might these blessings apply to you?\nSome of these promises have eternal parallels. How are promises like a land of inheritance or a large posterity fulfilled eternally? (see\nDoctrine and Covenants 131:1–4\n;\n132:20–24, 28–32\n).\nBesides promising blessings, God told Abraham to “\nbe\na blessing” (\nGenesis 12:2\n; emphasis added). What do you think that means? How will\nyou\nbe a blessing? (see\nAbraham 2:11\n).\nTo teach about covenants, Elder Dale G. Renlund spoke of tidal waves in the Amazon River, and President Emily Belle Freeman talked about walking a rocky path with a broken ankle (see “\nAccessing God’s Power through Covenants\n,”\nLiahona\n, May 2023, 35–37; “\nWalking in Covenant Relationship with Christ\n,”\nLiahona\n, Nov. 2023, 76–79). Search one or both of these messages for sentences that help answer the question “Why does God want me to make covenants with Him?”\nInvite people to teach each other.\nIf you’re teaching your family or a Church class about covenants, consider giving each person a portion of Elder Renlund’s or President Freeman’s message to study. Then they could share with the rest of the family or class what they learned. This allows people to testify to and learn from each other, and that invites the Spirit. (See\nTeaching in the Savior’s Way\n,\n26\n.)\nSee also Topics and Questions, “\nAbrahamic Covenant\n,” Gospel Library; “\nThoughts to Keep in Mind: The Covenant\n,” in this resource.\nThe Abrahamic Covenant\n, by Dilleen Marsh (detail)\nGenesis 14:18–19\n;\nJoseph Smith Translation, Genesis 14:25–40\n“Melchizedek was a man of faith.”\nImagine you were introducing Melchizedek to someone who didn’t know him. What would you say? Look for ideas in\nJoseph Smith Translation, Genesis 14:26–27, 33–38\n(in the Bible appendix);\nAlma 13:13–19\n;\nDoctrine and Covenants 107:1–4\n. What Christlike qualities do you find in these descriptions of Melchizedek? How does your study of Melchizedek’s life affect the way you view the Melchizedek Priesthood?\nGenesis 14:18–24\n;\nJoseph Smith Translation, Genesis 14:36–40\nAbraham paid tithing.\nWhat do you learn about Abraham’s attitude toward wealth from\nGenesis 14:18–24\nand\nJoseph Smith Translation, Genesis 14:36–40\n(in the Bible appendix)? For example, note his response to the king of Sodom in\nGenesis 14:23\n. How has obeying the law of tithing affected your view of money?\nGenesis 16\nGod hears me.\nAs you read\nGenesis 16\n, you might think about a time when you felt you were being treated unfairly, as Hagar did. Note that “Ishmael” means “God hears.” How has God shown you that He has heard you?\nSee also “\nSecret Prayer\n,”\nHymns\n, no. 144.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat are the facsimiles in the book of Abraham?\nWhy did Sarai give Hagar to Abram as a wife?\nHow was circumcision related to the Lord’s covenant with Abraham?\nClick to see more.\nIdeas for Teaching Children\nAbraham 1:18\n;\n2:8\nJesus Christ will lead me by the hand.\nAs you and your children read\nAbraham 1:18\nand\n2:8\n, you could invite them to listen for a part of the body that is mentioned in both verses. Maybe you could play a game in which a child closes their eyes and you lead the child somewhere by the hand. Then you could talk about how it feels to have Jesus Christ lead us by the hand or protect us.\nGenesis 13:5–12\nI can be a peacemaker.\nYour children might enjoy acting out the story from\nGenesis 13:5–12\n, pretending to be Abraham, Lot, and the herdsmen. How can we follow Abraham’s example of being a peacemaker with our family or friends? Try role-playing their answers.\nLot’s Choice\n, by William Fredericks © Providence Collection/licensed from goodsalt.com\nGenesis 13:16\n;\nGenesis 15:1–6\n;\n17:1–8\n;\nAbraham 2:9–11\nGod wants me to make covenants with Him.\nConsider showing your children a container of sand, the stars in the night sky, or the picture at the end of this outline. This could help them understand God’s promises in\nGenesis 13:16\n;\n15:1–6\n. Talk about how you’ve learned to trust God’s promises, even when they seemed impossible.\nTo teach your children about covenants, ask them to tell you about a time when they made a promise or someone made a promise to them. If it’s helpful, share some examples of your own—including covenants you’ve made with God at baptism or in the temple. How have your covenants affected your relationship with God? Choose a few phrases from\nGenesis 15:1–6\n;\n17:1–8\n;\nAbraham 2:9–11\nto share some of the blessings God promised to Abraham and Sarah.\nTo help your children prepare to make a covenant with God when they are baptized, you could use some of the activity ideas suggested in\nappendix A\nor\nappendix B\n.\nAbraham 1:12–17\n;\nGenesis 16:7–11\nGod hears me.\nWhen Abraham’s life was in danger, he called on God. When Hagar was alone in the wilderness, she learned that God heard her. Consider sharing these two stories with your children: “\nAbraham and Sarah\n” and “\nHagar\n” in\nOld Testament Stories\n, 28–31, 32–33. What do we learn about God from these stories? Then you could share with each other experiences when you felt that God heard you. A song like “\nA Child’s Prayer\n” (\nChildren’s Songbook\n, 12–13) could reinforce this principle.\n2:20\nAbraham and Sarah\n1:23\nHagar\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 8: Lesson 22: Lesson 22—Abraham 1This lesson can help students feel hope that Heavenly Father can help them obtain blessings that He wants them to receive.; Lesson 23: Lesson 23—Genesis 12; 17This lesson can help students explain the Abrahamic covenant and how it relates to them....",
      "content": "\n--- Lesson 22 ---\nAbraham grew up surrounded by wickedness and idolatry. Despite these circumstances, Abraham desired to follow Jesus Christ, who was known in the premortal life and to Abraham as Jehovah. As Abraham sought after his righteous desires, the Lord blessed him to obtain them. This lesson can help students feel hope that Heavenly Father can help them obtain blessings that He wants them to receive. Student preparation: Invite students to make a list of what they want most in life and to think about how Heavenly Father feels about what they want most. Possible Learning Activities What do you desire? Begin the lesson by helping students think of situations where they might have trouble believing that the Lord can help them obtain a righteous blessing that they desire. To do this, you could share the following incomplete scenarios and invite students to identify an obstacle that the individual might face. Samantha has a strong desire to follow Jesus Christ by preaching His gospel to other people. However, right now this seems difficult because … Yuchen has a strong desire to follow Jesus Christ by paying his tithing. However, right now this seems difficult because … Carlos has a strong desire to follow Jesus Christ by being baptized. However, right now this seems difficult because … Invite students to think about their own circumstances and the obstacles they might face to following Jesus Christ. Ask them to complete the following steps in their study journals. In your study journal: Record some of the blessings you most desire in life. List any obstacles you see to obtaining these blessings. As students study Abraham 1 , invite them to seek Heavenly Father’s help through the Holy Ghost. The Holy Ghost can help them feel hope that they can follow Jesus Christ and obtain His blessings no matter the obstacles they may face. Abraham’s circumstances In Lesson 3: Abraham 3 , students learned the origins of the book of Abraham. If you did not explain this in Lesson 3, you could do it now. If students have questions about the origins of the book of Abraham, you could show the video “ The Book of Abraham | Now You Know ” from time code 0:00 to 2:43. This video is located at ChurchofJesusChrist.org . 5:7 It may be helpful to have students create a two-column chart. They could title the first column “Blessings Abraham desired” and the second “Obstacles Abraham faced.” This can help organize what students learn from Abraham 1:1–7 . Blessings Abraham desired Obstacles Abraham faced Blessings Abraham desired Obstacles Abraham faced Read Abraham 1:1–7 , looking for what blessings Abraham desired and what obstacles he faced to receiving those blessings. What stands out to you from the blessings Abraham desired? Why might these blessings be something you also desire? How might Abraham’s desire to follow Jesus Christ have helped him in the difficult circumstances he faced? Jehovah helped Abraham overcome his obstacles Read Abraham 1:15–20 , looking for how Jehovah helped Abraham overcome the obstacles he faced. Alternatively, you may choose to show the video “ Deliverance of Abraham ” (1:38), available at ChurchofJesusChrist.org . 1:38 If time allows, you may want to spend some time discussing the miraculous way that Jehovah delivered Abraham. You could compare this deliverance to ways the Lord delivers us from our obstacles to righteous living. The Lord can deliver us from unhealthy habits such as excessive social media or technology use or pornography use. You could testify that Jehovah can deliver us from any obstacle that might otherwise make it difficult to follow Him. What do you think Abraham learned about Jehovah from this experience? How might Heavenly Father help us overcome obstacles to receiving righteous blessings we desire? Explain to students that after Abraham was delivered, he eventually went to Canaan. The Lord honored Abraham for acting on his desires by blessing him with the priesthood and other significant blessings. God promised Abraham these blessings as part of what we call the Abrahamic covenant. Students will learn more about this covenant in future lessons. Later in Abraham’s life, the Lord visited him and promised that He would fulfill all of Abraham’s righteous desires (see Abraham 2:9–11 ). Read Abraham 2:12–13 , looking for what Abraham said after this experience. What principles can we learn from Abraham’s experience? Students may identify a variety of principles including: If we seek to follow Jesus Christ, God will grant us the righteous blessings we desire. Read the following statement from President Jeffrey R. Holland of the Quorum of the Twelve Apostles, or watch the video “ A Perfect Brightness of Hope ” from time code 11:09 to 11:38. The video is located at ChurchofJesusChrist.org . 17:45 Why should we not hope that righteous desires and Christlike yearnings can still be marvelously, miraculously answered by the God of all hope? We all need to believe that what we desire in righteousness can someday, someway, somehow yet be ours. (“ A Perfect Brightness of Hope ,” Ensign or Liahona , May 2020, 83) Invite students to discuss the following questions in pairs or small groups, or have students record their answers in their study journals. After enough time, willing students could share one or both of their answers with the class. How do President Holland’s words and Abraham’s experience give you hope that the Lord can help you overcome obstacles to following Jesus Christ? When has Heavenly Father helped you or someone you know overcome obstacles to following Jesus Christ? Consider sharing your experience of when Heavenly Father has helped you overcome an obstacle to receiving a righteous blessing. Invite students to record what they learned today in their study journals. Consider inviting willing students to share what they wrote. Conclude by sharing your testimony of these truths.\n\n\n--- Lesson 23 ---\nThe Lord and Abraham entered a covenant that is now known as the Abrahamic covenant. As we make and keep covenants with God today, we can receive the same blessings from Him as Abraham did. This lesson can help students explain the Abrahamic covenant and how it relates to them. Student preparation: Invite students to search “ Abrahamic Covenant ” in the Gospel Library or Guide to the Scriptures, or “ Abraham, covenant of ” in the Bible Dictionary, and come prepared to share what they found. Possible Learning Activities The Abrahamic covenant Invite students to imagine they were asked to give a talk in sacrament meeting about the Abrahamic covenant. To help them assess how prepared they might be to do this, invite them to write down and answer the following questions in their study journals. What is the Abrahamic covenant? How can I receive the Abrahamic covenant? Why does the Abrahamic covenant matter to me? Assure students that it is okay if they do not know much about the Abrahamic covenant. Let them know that they will be able to add to their responses during class. Encourage them to seek confirmation from the Holy Ghost about the truthfulness of what they are learning. Note: This lesson focuses on what the blessings of the Abrahamic covenant are and why they matter to us. Lesson 24: “ Abraham 2:9–11 ” will focus on our responsibilities in the Abrahamic covenant. What is the Abrahamic covenant? Recall that Abraham desired “the blessings of the fathers” and to be a “follower of righteousness” ( Abraham 1:2 ). The Lord promised to put His name upon Abraham and to give him the priesthood (see Abraham 1:18 ). Consider creating the following chart on the board. Invite students to study the verses in the first column and list the blessings they find next to the corresponding verses on the board. They will study the verses in the second column later in the lesson. The Lord’s blessings promised to Abraham The Lord’s blessings promised to me Genesis 12:2 ; 17:1–2, 4–6 Genesis 12:3 ; 17:7 Genesis 12:7 ; 17:8 Abraham 2:11 Doctrine and Covenants 132:19–22, 30–31 Abraham 2:9–11 Doctrine and Covenants 88:18–20 Doctrine and Covenants 84:33–38 Read Genesis 12:2–3, 7 ; 17:1–8 ; Abraham 2:11 , looking for the blessings God extended to Abraham. As students read the scriptures, consider moving around the room. Some students are more likely to ask questions when a teacher is close by, so moving around the classroom while students read can make it easier for some students to ask you for help. When students have finished, invite them to share what they found. What did you find? What do these promises teach you about God? The following is a list of some of the blessings students might find: Genesis 12:2 ; 17:1–2, 4–6 : father of many nations; multiplied exceedingly; exceeding fruitful (In Hebrew, the name Abram means “exalted father,” and the name Abraham means “father of many.”) Genesis 12:3 ; 17:7 : all the families of the earth blessed by his posterity; God’s covenant to continue with Abraham’s posterity Genesis 12:7 ; 17:8 : land of Canaan Abraham 2:11 : priesthood Students may also identify the phrase “kings shall come out of thee” ( Genesis 17:6 ). This refers to the kings that would rule both Israel and Judah; but more importantly, it refers to Jesus Christ (see Matthew 1:1 ; Revelation 19:16 ). You may want to point out that the covenant God made with Abraham is known as the Abrahamic covenant. Explain that it is how God offers His greatest blessings to His children. God reaffirmed this covenant with Abraham multiple times in his life (see Genesis 13:14–17 ; 15:5, 18 ; 22:15–18 ; Abraham 2:8–12 ; 3:14 ). How can I receive the Abrahamic covenant? Share the following statement from President Nelson to help students see how the Abrahamic covenant relates to them (see also Galatians 3:27–29 ; Abraham 2:10 ). President Russell M. Nelson taught how each of us can also receive these same blessings that God promised Abraham: When we embrace the gospel and are baptized, we take upon ourselves the sacred name of Jesus Christ. Baptism is the gate that leads to becoming joint heirs to all the promises given anciently by the Lord to Abraham, Isaac, Jacob, and their posterity. “The new and everlasting covenant” ( Doctrine and Covenants 132:6 ) and the Abrahamic covenant are essentially the same—two ways of phrasing the covenant God made with mortal men and women at different times. … … [Y]ou and I personally entered the covenant path at baptism. Then we enter it more completely in the temple. The blessings of the Abrahamic covenant are conferred in holy temples. These blessings allow us, upon being resurrected, to “inherit thrones, kingdoms, powers, principalities, and dominions, to our ‘exaltation and glory in all things’ [ Doctrine and Covenants 132:19 ].” (“ The Everlasting Covenant ,” Liahona , Oct. 2022, 4, 6) How would you summarize what we can learn from President Nelson about the blessings of Abraham? Help students identify a truth like: As we make and keep covenants with God, we become heirs to the blessings given to Abraham. Why does the Abrahamic covenant matter to me? Invite students to study the references in the second column and to list in their study journals how the blessings promised to Abraham are also promised to them. These verses might be best for students to study in pairs or small groups. The following are some of the blessings students might find: Doctrine and Covenants 132:19–22, 30–31 : eternal families (“continuation of the seeds” and “continuation of the lives”) Abraham 2:9–11 : gospel shared with all the families of the earth; salvation and exaltation Doctrine and Covenants 88:18–20 (“it” refers to the earth): inheritance in the celestial kingdom (see also Hebrews 11:8, 13–16 ) Doctrine and Covenants 84:33–38 : the blessings of the priesthood, including all that the Father has In what ways are these promised blessings meaningful to you? What do these blessings teach you about God’s feelings for you? To place the Abrahamic covenant in the context of Heavenly Father’s plan, you might want to ask students what makes it possible for us to receive the blessings they listed. You could have students ponder or share some of their thoughts. You could also share this statement from President Nelson. President Russell M. Nelson pointed out what makes it possible for us to receive the blessings of the Abrahamic covenant: The Savior’s atoning sacrifice enabled the Father to fulfill His promises made to His children. … The fulfillment of the Abrahamic covenant becomes feasible because of the Atonement of our Savior, the Lord Jesus Christ. Jesus Christ is at the center of the Abrahamic covenant. (“ The Everlasting Covenant ,” Liahona , Oct. 2022, 7). Explain the Abrahamic covenant Invite students to add to their responses from the beginning of class: What is the Abrahamic covenant? How can I receive the Abrahamic covenant? Why does the Abrahamic covenant matter to me? To solidify their understanding, consider inviting students to get into pairs and explain the Abrahamic covenant to each other. Encourage them to see if they can be brief yet complete in their responses. Explaining this covenant in as few words as possible can help students to understand it more clearly. Testify of the blessings and promises God offers us through the Abrahamic covenant.\n\n\n--- Lesson 24 ---\nThe Lord made a covenant with Abraham and his posterity. As the seed of Abraham, we have a covenant responsibility to bring the blessings of the Savior’s gospel to all the families of the earth. This lesson will help students act on the responsibilities the Lord has given them as the seed of Abraham. Student preparation: Invite students to think about the following questions and to discuss them with a family member: Why does the gospel of Jesus Christ matter to you? Why do you think all people need it?” Possible Learning Activities The seed of Abraham You could begin class by giving students 30 seconds to list as many words as they can that describe themselves. Next, ask students to circle three words that best describe them. A few students could share with the class. In what ways do these identifiers influence your behavior? Elder David A. Bednar of the Quorum of the Twelve Apostles taught the following about our identity: 17:8 You may enjoy music, athletics, or be mechanically inclined, and someday you may work in a trade or a profession or in the arts. As important as such activities and occupations can be, they do not define who we are. First and foremost, we are spiritual beings. We are sons [and daughters] of God and the seed of Abraham. (“ Becoming a Missionary ,” Ensign or Liahona , Nov. 2005, 47) What stands out to you from what Elder Bednar taught about our foremost identities? If students studied Lesson 23: “ Genesis 12; 17 ,” invite them to summarize with a classmate what they remember about the Abrahamic covenant. Help students see that as the seed, or posterity, of Abraham, not only are we promised significant blessings, but we also covenant to fulfill significant responsibilities. Invite them to complete the following self-assessment. Select which of the following statements are true of you: I understand my responsibilities as the seed of Abraham. I am seeking to fulfill my responsibilities as the seed of Abraham. I have found great joy in fulfilling my responsibilities as the seed of Abraham. I do not understand what my responsibilities are as the seed of Abraham. I have questions about what my responsibilities are as the seed of Abraham. Invite students to record any questions they may have or impressions they felt as they considered these statements. Invite them to seek revelation from their Father in Heaven through the Holy Ghost to know how they can better fulfill their responsibilities as the seed of Abraham. Abraham 2:9–11 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Abraham 2:8–11 , looking for our responsibilities as the seed of Abraham. What does the Savior expect of us? You might invite students to ask any questions about the verses. As you discuss the responsibilities of the Abrahamic covenant, help students identify a truth similar to: As the seed of Abraham, the Savior has given us a responsibility to bless all the families of the earth with the blessings of His gospel. Students may benefit from knowing they can fulfill their covenant responsibility by helping gather Israel. What are some ways we can bless all the families of the earth with the Savior’s gospel? Read 1 Nephi 15:18 , looking for when the Abrahamic covenant will be fulfilled. President Russell M. Nelson testified: Ours is the responsibility to help fulfill the Abrahamic covenant. Ours is the seed foreordained and prepared to bless all people of the world. That is why priesthood duty includes missionary work. After some 4,000 years of anticipation and preparation, this is the appointed day when the gospel is to be taken to the kindreds of the earth. This is the time of the promised gathering of Israel. And we get to participate! Isn’t that exciting? (“ Covenants ,” Ensign or Liahona , Nov. 2011, 88) Anytime we do anything that helps anyone—on either side of the veil—to make and keep their covenants with God, we are helping to gather Israel. (“ Let God Prevail ,” Ensign or Liahona , Nov. 2020, 92–93) How do you feel about the gospel of Jesus Christ? Why do you think all people need it? What experiences have you (or people you know) had gathering Israel? Fulfilling our responsibilities This portion of the lesson gives students time in class to do something to fulfill their responsibilities in the Abrahamic covenant. You could create learning stations based on the following handout. Students could choose one activity to focus on, or they could rotate through different activities. You might assign student leaders for each station to help their peers complete the exercises. Invite students to seek inspiration when selecting what to focus on. Open PDF After enough time, allow students to share the activity they chose and what they felt inspired to do. As students respond to some or all of the following questions, think of ways to help students seek, recognize, and act on personal revelation. One way for you to do this is to ask yourself, “What else can I invite them to do?” Asking yourself this kind of question can invite inspiration from the Holy Ghost on how to help students act on the personal revelation they receive. For additional training on follow-up questions that invite personal revelation, see “ Help learners seek, recognize, and act on personal revelation ” in Teacher Development Skills. Students may benefit from time to reflect on and answer the following questions in their study journals. What did you do or what plans did you make to bless others with the Savior’s gospel? What have you felt prompted to do in the days and weeks ahead to: Help others make or keep covenants? Share the Savior’s gospel? Help people on the other side of the veil? Consider testifying of our important responsibility, as the seed of Abraham, to share the blessings of the Savior’s gospel with all people. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Abraham 2:9–11 is “The Lord promised Abraham that his seed would ‘bear this ministry and Priesthood unto all nations.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Abraham 1",
      "content": "1. In the land of theChaldeans, at the residence of my fathers, I,Abraham, saw that it was needful for me to obtain another place ofresidence;\n2. And, finding there was greaterhappinessand peace and rest for me, I sought for the blessings of the fathers, and the right whereunto I should be ordained to administer the same; having been myself follower ofrighteousness, desiring also to be one who possessed greatknowledge, and to be greater follower of righteousness, and to possess greater knowledge, and to be father of manynations, prince of peace, anddesiringto receive instructions, and to keep the commandments of God, I became rightful heir, aHigh Priest, holding the right belonging to the fathers.\n3. It wasconferredupon me from the fathers; it came down from the fathers, from the beginning of time, yea, even from the beginning, or before the foundation of the earth, down to the present time, even the right of thefirstborn, or the first man, who isAdam, or first father, through the fathers unto me.\n4. I sought for mineappointmentunto the Priesthood according to the appointment of God unto thefathersconcerning the seed.\n5. Myfathers, having turned from their righteousness, and from the holy commandments which the Lord their God had given unto them, unto the worshiping of thegodsof theheathen, utterly refused to hearken to my voice;\n6. For theirheartswere set to doevil, and were wholly turned to the god ofElkenah, and the god of Libnah, and the god of Mahmackrah, and the god of Korash, and the god of Pharaoh, king of Egypt;\n7. Therefore they turned their hearts to the sacrifice of theheathenin offering up their children unto these dumb idols, and hearkened not unto my voice, but endeavored totake away mylifeby the hand of the priest of Elkenah. The priest of Elkenah was also the priest of Pharaoh.\n8. Now, at this time it was the custom of the priest of Pharaoh, the king of Egypt, to offer up upon the altar which was built in the land of Chaldea, for the offering unto these strange gods, men, women, and children.\n9. And it came to pass that the priest made an offering unto the god of Pharaoh, and also unto the god of Shagreel, even after the manner of the Egyptians. Now the god of Shagreel was the sun.\n10. Even the thank-offering of child did thepriestof Pharaoh offer upon the altar which stood by the hill called Potiphars Hill, at the head of the plain of Olishem.\n11. Now, this priest had offered upon this altar three virgins at one time, who were the daughters of Onitah, one of the royal descent directly from the loins ofHam. These virgins were offered up because of their virtue; they would notbowdown to worship gods of wood or of stone, therefore they were killed upon this altar, and it was done after the manner of the Egyptians.\n12. And it came to pass that the priests laid violence upon me, that they might slay me also, as they did those virgins upon this altar; and that you may have knowledge of this altar, I will refer you to the representation at the commencement of this record.\n13. It was made after the form of bedstead, such as was had among the Chaldeans, and it stood before the gods of Elkenah, Libnah, Mahmackrah, Korash, and also god like unto that of Pharaoh, king of Egypt.\n14. That you may have an understanding of these gods, I have given you the fashion of them in the figures at the beginning, which manner of figures is called by the Chaldeans Rahleenos, which signifies hieroglyphics.\n15. And as they lifted up their hands upon me, that they might offer me up and take away my life, behold, I lifted up my voice unto the Lord my God, and the Lordhearkenedand heard, and he filled me with the vision of the Almighty, and the angel of his presence stood by me, and immediatelyunloosedmy bands;\n16. And his voice was unto me:Abraham, Abraham, behold, mynameis Jehovah, and I have heard thee, and have come down to deliver thee, and to take thee away from thyfathershouse, and from all thy kinsfolk, into strangelandwhich thou knowest not of;\n17. And this because they have turned theirheartsaway from me, to worship the god of Elkenah, and the god of Libnah, and the god of Mahmackrah, and the god of Korash, and the god of Pharaoh, king of Egypt; therefore I have come down tovisitthem, and to destroy him who hath lifted up his hand against thee, Abraham, my son, to take away thy life.\n18. Behold, I will lead thee by my hand, and I will take thee, to put upon thee my name, even the Priesthood of thy father, and my power shall be over thee.\n19. As it was withNoahso shall it be with thee; but through thy ministry mynameshall be known in the earthforever, for I am thy God.\n20. Behold, Potiphars Hill was in the land ofUr, of Chaldea. And the Lord broke down the altar of Elkenah, and of the gods of the land, and utterly destroyed them, and smote the priest that he died; and there was great mourning in Chaldea, and also in the court of Pharaoh; which Pharaoh signifies king by royal blood.\n21. Now this king of Egypt was descendant from theloinsofHam, and was partaker of the blood of theCanaanitesby birth.\n22. From this descent sprang all the Egyptians, and thus the blood of theCanaaniteswas preserved in the land.\n23. The land ofEgyptbeing first discovered by woman, who was the daughter of Ham, and the daughter of Egyptus, which in the Chaldean signifies Egypt, which signifies that which is forbidden;\n24. When this woman discovered the land it was under water, who afterward settled her sons in it; and thus, from Ham, sprang that race which preserved the curse in the land.\n25. Now the firstgovernmentof Egypt was established by Pharaoh, the eldest son of Egyptus, the daughter of Ham, and it was after the manner of the government of Ham, which was patriarchal.\n26. Pharaoh, being righteous man, established his kingdom and judged his people wisely and justly all his days, seeking earnestly to imitate thatorderestablished by the fathers in the first generations, in the days of the first patriarchal reign, even in the reign of Adam, and also of Noah, his father, who blessed him with theblessingsof the earth, and with the blessings of wisdom, but cursed him as pertaining to the Priesthood.\n27. Now, Pharaoh being of that lineage by which he could not have the right ofPriesthood, notwithstanding the Pharaohs would fainclaimit from Noah, through Ham, therefore my father was led away by their idolatry;\n28. But I shall endeavor, hereafter, to delineate the chronology running back from myself to the beginning of the creation, for therecordshave come into my hands, which I hold unto this present time.\n29. Now, after the priest of Elkenah was smitten that he died, there came fulfilment of those things which were said unto me concerning the land of Chaldea, that there should be afaminein the land.\n30. Accordingly famine prevailed throughout all the land of Chaldea, and my father was sorely tormented because of the famine, and he repented of the evil which he had determined against me, to take away mylife.\n31. But therecordsof the fathers, even the patriarchs, concerning the right of Priesthood, the Lord my God preserved in mine own hands; therefore knowledge of the beginning of the creation, and also of theplanets, and of the stars, as they were made known unto the fathers, have I kept even unto this day, and I shall endeavor to write some of these things upon thisrecord, for the benefit of my posterity that shall come after me.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Abraham 2",
      "content": "1. Now the Lord God caused thefamineto wax sore in the land of Ur, insomuch thatHaran, my brother, died; butTerah, my father, yet lived in the land of Ur, of the Chaldees.\n2. And it came to pass that I, Abraham, tookSaraito wife, andNahor, my brother, took Milcah to wife, who was thedaughterof Haran.\n3. Now the Lord hadsaidunto me: Abraham, get thee out of thy country, and from thy kindred, and from thy fathers house, unto land that I will show thee.\n4. Therefore I left the land ofUr, of the Chaldees, to go into the land of Canaan; and I took Lot, my brothers son, and his wife, and Sarai my wife; and also myfatherfollowed after me, unto the land which we denominated Haran.\n5. And the famine abated; and my father tarried in Haran and dwelt there, as there were many flocks in Haran; and my father turned again unto hisidolatry, therefore he continued in Haran.\n6. But I, Abraham, and Lot, my brothers son, prayed unto the Lord, and the Lordappearedunto me, and said unto me: Arise, and take Lot with thee; for I have purposed to take thee away out of Haran, and to make of thee aministerto bear mynamein strangelandwhich I will give unto thy seed after thee for an everlasting possession, when they hearken to my voice.\n7. For I am the Lord thy God; I dwell inheaven; the earth is myfootstool; I stretch my hand over the sea, and it obeys my voice; I cause the wind and the fire to be mychariot; I say to the mountainsDepart henceand behold, they are taken away by whirlwind, in an instant, suddenly.\n8. Mynameis Jehovah, and Iknowthe end from the beginning; therefore my hand shall be over thee.\n9. And I will make of thee greatnation, and I willblessthee above measure, and make thy name great among all nations, and thou shalt be blessing unto thy seed after thee, that in their hands they shall bear this ministry andPriesthoodunto all nations;\n10. And I willblessthem through thy name; for as many as receive thisGospelshall be called after thyname, and shall be accounted thyseed, and shall rise up and bless thee, as theirfather;\n11. And I willblessthem that bless thee, andcursethem that curse thee; and in thee (that is, in thy Priesthood) and in thyseed(that is, thy Priesthood), for I give unto thee promise that thisrightshall continue in thee, and in thy seed after thee (that is to say, the literal seed, or the seed of the body) shall all the families of the earth be blessed, even with the blessings of the Gospel, which are the blessings of salvation, even of life eternal.\n12. Now, after the Lord had withdrawn from speaking to me, and withdrawn his face from me, I said in my heart: Thy servant hassoughtthee earnestly; now I have found thee;\n13. Thou didst send thine angel todeliverme from the gods of Elkenah, and I will do well to hearken unto thy voice, therefore let thy servant rise up and depart in peace.\n14. So I, Abraham, departed as the Lord had said unto me, and Lot with me; and I, Abraham, wassixtyand two years old when I departed out of Haran.\n15. And I took Sarai, whom I took to wife when I was in Ur, in Chaldea, and Lot, my brothers son, and all our substance that we had gathered, and the souls that we hadwonin Haran, and came forth in the way to the land of Canaan, and dwelt in tents as we came on our way;\n16. Therefore,eternitywas our covering and ourrockand our salvation, as we journeyed from Haran by the way ofJershon, to come to the land of Canaan.\n17. Now I, Abraham, built analtarin the land of Jershon, and made an offering unto the Lord, and prayed that thefaminemight be turned away from my fathers house, that they might not perish.\n18. And then we passed from Jershon through the land unto the place of Sechem; it was situated in the plains of Moreh, and we had already come into the borders of the land of theCanaanites, and I offeredsacrificethere in the plains of Moreh, and called on the Lord devoutly, because we had already come into the land of this idolatrous nation.\n19. And the Lordappearedunto me in answer to my prayers, and said unto me: Unto thy seed will I give thisland.\n20. And I, Abraham, arose from the place of the altar which I had built unto the Lord, and removed from thence unto mountain on the east ofBethel, and pitched my tent there, Bethel on the west, andHaion the east; and there I built anotheraltarunto the Lord, andcalledagain upon the name of the Lord.\n21. And I, Abraham, journeyed, going on still towards the south; and there was continuation of famine in the land; and I, Abraham, concluded to go down into Egypt, to sojourn there, for the famine became very grievous.\n22. And it came to pass when I was come near to enter into Egypt, the Lordsaidunto me: Behold, Sarai, thy wife, is very fair woman to look upon;\n23. Therefore it shall come to pass, when the Egyptians shall see her, they will sayShe is his wife; and they will kill you, but they will save her alive; therefore see that ye do on this wise:\n24. Let her say unto the Egyptians, she is thy sister, and thy soul shall live.\n25. And it came to pass that I, Abraham, told Sarai, my wife, all that the Lord had said unto meTherefore say unto them, I pray thee, thou art mysister, that it may be well with me for thy sake, and my soul shall live because of thee.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Abraham": {
      "1": {
        "verses": {
          "1": {
            "text": "In the land of theChaldeans, at the residence of my fathers, I,Abraham, saw that it was needful for me to obtain another place ofresidence;",
            "citation": "(Abraham 1:1)"
          },
          "2": {
            "text": "And, finding there was greaterhappinessand peace and rest for me, I sought for the blessings of the fathers, and the right whereunto I should be ordained to administer the same; having been myself follower ofrighteousness, desiring also to be one who possessed greatknowledge, and to be greater follower of righteousness, and to possess greater knowledge, and to be father of manynations, prince of peace, anddesiringto receive instructions, and to keep the commandments of God, I became rightful heir, aHigh Priest, holding the right belonging to the fathers.",
            "citation": "(Abraham 1:2)"
          },
          "3": {
            "text": "It wasconferredupon me from the fathers; it came down from the fathers, from the beginning of time, yea, even from the beginning, or before the foundation of the earth, down to the present time, even the right of thefirstborn, or the first man, who isAdam, or first father, through the fathers unto me.",
            "citation": "(Abraham 1:3)"
          },
          "4": {
            "text": "I sought for mineappointmentunto the Priesthood according to the appointment of God unto thefathersconcerning the seed.",
            "citation": "(Abraham 1:4)"
          },
          "5": {
            "text": "Myfathers, having turned from their righteousness, and from the holy commandments which the Lord their God had given unto them, unto the worshiping of thegodsof theheathen, utterly refused to hearken to my voice;",
            "citation": "(Abraham 1:5)"
          },
          "6": {
            "text": "For theirheartswere set to doevil, and were wholly turned to the god ofElkenah, and the god of Libnah, and the god of Mahmackrah, and the god of Korash, and the god of Pharaoh, king of Egypt;",
            "citation": "(Abraham 1:6)"
          },
          "7": {
            "text": "Therefore they turned their hearts to the sacrifice of theheathenin offering up their children unto these dumb idols, and hearkened not unto my voice, but endeavored totake away mylifeby the hand of the priest of Elkenah. The priest of Elkenah was also the priest of Pharaoh.",
            "citation": "(Abraham 1:7)"
          },
          "8": {
            "text": "Now, at this time it was the custom of the priest of Pharaoh, the king of Egypt, to offer up upon the altar which was built in the land of Chaldea, for the offering unto these strange gods, men, women, and children.",
            "citation": "(Abraham 1:8)"
          },
          "9": {
            "text": "And it came to pass that the priest made an offering unto the god of Pharaoh, and also unto the god of Shagreel, even after the manner of the Egyptians. Now the god of Shagreel was the sun.",
            "citation": "(Abraham 1:9)"
          },
          "10": {
            "text": "Even the thank-offering of child did thepriestof Pharaoh offer upon the altar which stood by the hill called Potiphars Hill, at the head of the plain of Olishem.",
            "citation": "(Abraham 1:10)"
          },
          "11": {
            "text": "Now, this priest had offered upon this altar three virgins at one time, who were the daughters of Onitah, one of the royal descent directly from the loins ofHam. These virgins were offered up because of their virtue; they would notbowdown to worship gods of wood or of stone, therefore they were killed upon this altar, and it was done after the manner of the Egyptians.",
            "citation": "(Abraham 1:11)"
          },
          "12": {
            "text": "And it came to pass that the priests laid violence upon me, that they might slay me also, as they did those virgins upon this altar; and that you may have knowledge of this altar, I will refer you to the representation at the commencement of this record.",
            "citation": "(Abraham 1:12)"
          },
          "13": {
            "text": "It was made after the form of bedstead, such as was had among the Chaldeans, and it stood before the gods of Elkenah, Libnah, Mahmackrah, Korash, and also god like unto that of Pharaoh, king of Egypt.",
            "citation": "(Abraham 1:13)"
          },
          "14": {
            "text": "That you may have an understanding of these gods, I have given you the fashion of them in the figures at the beginning, which manner of figures is called by the Chaldeans Rahleenos, which signifies hieroglyphics.",
            "citation": "(Abraham 1:14)"
          },
          "15": {
            "text": "And as they lifted up their hands upon me, that they might offer me up and take away my life, behold, I lifted up my voice unto the Lord my God, and the Lordhearkenedand heard, and he filled me with the vision of the Almighty, and the angel of his presence stood by me, and immediatelyunloosedmy bands;",
            "citation": "(Abraham 1:15)"
          },
          "16": {
            "text": "And his voice was unto me:Abraham, Abraham, behold, mynameis Jehovah, and I have heard thee, and have come down to deliver thee, and to take thee away from thyfathershouse, and from all thy kinsfolk, into strangelandwhich thou knowest not of;",
            "citation": "(Abraham 1:16)"
          },
          "17": {
            "text": "And this because they have turned theirheartsaway from me, to worship the god of Elkenah, and the god of Libnah, and the god of Mahmackrah, and the god of Korash, and the god of Pharaoh, king of Egypt; therefore I have come down tovisitthem, and to destroy him who hath lifted up his hand against thee, Abraham, my son, to take away thy life.",
            "citation": "(Abraham 1:17)"
          },
          "18": {
            "text": "Behold, I will lead thee by my hand, and I will take thee, to put upon thee my name, even the Priesthood of thy father, and my power shall be over thee.",
            "citation": "(Abraham 1:18)"
          },
          "19": {
            "text": "As it was withNoahso shall it be with thee; but through thy ministry mynameshall be known in the earthforever, for I am thy God.",
            "citation": "(Abraham 1:19)"
          },
          "20": {
            "text": "Behold, Potiphars Hill was in the land ofUr, of Chaldea. And the Lord broke down the altar of Elkenah, and of the gods of the land, and utterly destroyed them, and smote the priest that he died; and there was great mourning in Chaldea, and also in the court of Pharaoh; which Pharaoh signifies king by royal blood.",
            "citation": "(Abraham 1:20)"
          },
          "21": {
            "text": "Now this king of Egypt was descendant from theloinsofHam, and was partaker of the blood of theCanaanitesby birth.",
            "citation": "(Abraham 1:21)"
          },
          "22": {
            "text": "From this descent sprang all the Egyptians, and thus the blood of theCanaaniteswas preserved in the land.",
            "citation": "(Abraham 1:22)"
          },
          "23": {
            "text": "The land ofEgyptbeing first discovered by woman, who was the daughter of Ham, and the daughter of Egyptus, which in the Chaldean signifies Egypt, which signifies that which is forbidden;",
            "citation": "(Abraham 1:23)"
          },
          "24": {
            "text": "When this woman discovered the land it was under water, who afterward settled her sons in it; and thus, from Ham, sprang that race which preserved the curse in the land.",
            "citation": "(Abraham 1:24)"
          },
          "25": {
            "text": "Now the firstgovernmentof Egypt was established by Pharaoh, the eldest son of Egyptus, the daughter of Ham, and it was after the manner of the government of Ham, which was patriarchal.",
            "citation": "(Abraham 1:25)"
          },
          "26": {
            "text": "Pharaoh, being righteous man, established his kingdom and judged his people wisely and justly all his days, seeking earnestly to imitate thatorderestablished by the fathers in the first generations, in the days of the first patriarchal reign, even in the reign of Adam, and also of Noah, his father, who blessed him with theblessingsof the earth, and with the blessings of wisdom, but cursed him as pertaining to the Priesthood.",
            "citation": "(Abraham 1:26)"
          },
          "27": {
            "text": "Now, Pharaoh being of that lineage by which he could not have the right ofPriesthood, notwithstanding the Pharaohs would fainclaimit from Noah, through Ham, therefore my father was led away by their idolatry;",
            "citation": "(Abraham 1:27)"
          },
          "28": {
            "text": "But I shall endeavor, hereafter, to delineate the chronology running back from myself to the beginning of the creation, for therecordshave come into my hands, which I hold unto this present time.",
            "citation": "(Abraham 1:28)"
          },
          "29": {
            "text": "Now, after the priest of Elkenah was smitten that he died, there came fulfilment of those things which were said unto me concerning the land of Chaldea, that there should be afaminein the land.",
            "citation": "(Abraham 1:29)"
          },
          "30": {
            "text": "Accordingly famine prevailed throughout all the land of Chaldea, and my father was sorely tormented because of the famine, and he repented of the evil which he had determined against me, to take away mylife.",
            "citation": "(Abraham 1:30)"
          },
          "31": {
            "text": "But therecordsof the fathers, even the patriarchs, concerning the right of Priesthood, the Lord my God preserved in mine own hands; therefore knowledge of the beginning of the creation, and also of theplanets, and of the stars, as they were made known unto the fathers, have I kept even unto this day, and I shall endeavor to write some of these things upon thisrecord, for the benefit of my posterity that shall come after me.",
            "citation": "(Abraham 1:31)"
          }
        }
      },
      "2": {
        "verses": {
          "1": {
            "text": "Now the Lord God caused thefamineto wax sore in the land of Ur, insomuch thatHaran, my brother, died; butTerah, my father, yet lived in the land of Ur, of the Chaldees.",
            "citation": "(Abraham 2:1)"
          },
          "2": {
            "text": "And it came to pass that I, Abraham, tookSaraito wife, andNahor, my brother, took Milcah to wife, who was thedaughterof Haran.",
            "citation": "(Abraham 2:2)"
          },
          "3": {
            "text": "Now the Lord hadsaidunto me: Abraham, get thee out of thy country, and from thy kindred, and from thy fathers house, unto land that I will show thee.",
            "citation": "(Abraham 2:3)"
          },
          "4": {
            "text": "Therefore I left the land ofUr, of the Chaldees, to go into the land of Canaan; and I took Lot, my brothers son, and his wife, and Sarai my wife; and also myfatherfollowed after me, unto the land which we denominated Haran.",
            "citation": "(Abraham 2:4)"
          },
          "5": {
            "text": "And the famine abated; and my father tarried in Haran and dwelt there, as there were many flocks in Haran; and my father turned again unto hisidolatry, therefore he continued in Haran.",
            "citation": "(Abraham 2:5)"
          },
          "6": {
            "text": "But I, Abraham, and Lot, my brothers son, prayed unto the Lord, and the Lordappearedunto me, and said unto me: Arise, and take Lot with thee; for I have purposed to take thee away out of Haran, and to make of thee aministerto bear mynamein strangelandwhich I will give unto thy seed after thee for an everlasting possession, when they hearken to my voice.",
            "citation": "(Abraham 2:6)"
          },
          "7": {
            "text": "For I am the Lord thy God; I dwell inheaven; the earth is myfootstool; I stretch my hand over the sea, and it obeys my voice; I cause the wind and the fire to be mychariot; I say to the mountainsDepart henceand behold, they are taken away by whirlwind, in an instant, suddenly.",
            "citation": "(Abraham 2:7)"
          },
          "8": {
            "text": "Mynameis Jehovah, and Iknowthe end from the beginning; therefore my hand shall be over thee.",
            "citation": "(Abraham 2:8)"
          },
          "9": {
            "text": "And I will make of thee greatnation, and I willblessthee above measure, and make thy name great among all nations, and thou shalt be blessing unto thy seed after thee, that in their hands they shall bear this ministry andPriesthoodunto all nations;",
            "citation": "(Abraham 2:9)"
          },
          "10": {
            "text": "And I willblessthem through thy name; for as many as receive thisGospelshall be called after thyname, and shall be accounted thyseed, and shall rise up and bless thee, as theirfather;",
            "citation": "(Abraham 2:10)"
          },
          "11": {
            "text": "And I willblessthem that bless thee, andcursethem that curse thee; and in thee (that is, in thy Priesthood) and in thyseed(that is, thy Priesthood), for I give unto thee promise that thisrightshall continue in thee, and in thy seed after thee (that is to say, the literal seed, or the seed of the body) shall all the families of the earth be blessed, even with the blessings of the Gospel, which are the blessings of salvation, even of life eternal.",
            "citation": "(Abraham 2:11)"
          },
          "12": {
            "text": "Now, after the Lord had withdrawn from speaking to me, and withdrawn his face from me, I said in my heart: Thy servant hassoughtthee earnestly; now I have found thee;",
            "citation": "(Abraham 2:12)"
          },
          "13": {
            "text": "Thou didst send thine angel todeliverme from the gods of Elkenah, and I will do well to hearken unto thy voice, therefore let thy servant rise up and depart in peace.",
            "citation": "(Abraham 2:13)"
          },
          "14": {
            "text": "So I, Abraham, departed as the Lord had said unto me, and Lot with me; and I, Abraham, wassixtyand two years old when I departed out of Haran.",
            "citation": "(Abraham 2:14)"
          },
          "15": {
            "text": "And I took Sarai, whom I took to wife when I was in Ur, in Chaldea, and Lot, my brothers son, and all our substance that we had gathered, and the souls that we hadwonin Haran, and came forth in the way to the land of Canaan, and dwelt in tents as we came on our way;",
            "citation": "(Abraham 2:15)"
          },
          "16": {
            "text": "Therefore,eternitywas our covering and ourrockand our salvation, as we journeyed from Haran by the way ofJershon, to come to the land of Canaan.",
            "citation": "(Abraham 2:16)"
          },
          "17": {
            "text": "Now I, Abraham, built analtarin the land of Jershon, and made an offering unto the Lord, and prayed that thefaminemight be turned away from my fathers house, that they might not perish.",
            "citation": "(Abraham 2:17)"
          },
          "18": {
            "text": "And then we passed from Jershon through the land unto the place of Sechem; it was situated in the plains of Moreh, and we had already come into the borders of the land of theCanaanites, and I offeredsacrificethere in the plains of Moreh, and called on the Lord devoutly, because we had already come into the land of this idolatrous nation.",
            "citation": "(Abraham 2:18)"
          },
          "19": {
            "text": "And the Lordappearedunto me in answer to my prayers, and said unto me: Unto thy seed will I give thisland.",
            "citation": "(Abraham 2:19)"
          },
          "20": {
            "text": "And I, Abraham, arose from the place of the altar which I had built unto the Lord, and removed from thence unto mountain on the east ofBethel, and pitched my tent there, Bethel on the west, andHaion the east; and there I built anotheraltarunto the Lord, andcalledagain upon the name of the Lord.",
            "citation": "(Abraham 2:20)"
          },
          "21": {
            "text": "And I, Abraham, journeyed, going on still towards the south; and there was continuation of famine in the land; and I, Abraham, concluded to go down into Egypt, to sojourn there, for the famine became very grievous.",
            "citation": "(Abraham 2:21)"
          },
          "22": {
            "text": "And it came to pass when I was come near to enter into Egypt, the Lordsaidunto me: Behold, Sarai, thy wife, is very fair woman to look upon;",
            "citation": "(Abraham 2:22)"
          },
          "23": {
            "text": "Therefore it shall come to pass, when the Egyptians shall see her, they will sayShe is his wife; and they will kill you, but they will save her alive; therefore see that ye do on this wise:",
            "citation": "(Abraham 2:23)"
          },
          "24": {
            "text": "Let her say unto the Egyptians, she is thy sister, and thy soul shall live.",
            "citation": "(Abraham 2:24)"
          },
          "25": {
            "text": "And it came to pass that I, Abraham, told Sarai, my wife, all that the Lord had said unto meTherefore say unto them, I pray thee, thou art mysister, that it may be well with me for thy sake, and my soul shall live because of thee.",
            "citation": "(Abraham 2:25)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 40836,
  "total_sources": 4,
  "generated_at": "2025-12-14T04:01:27.367642"
}