{
  "week_number": 5,
  "date_range": "Genesis 5",
  "title": "Genesis 5;Moses 6",
  "primary_scriptures": [
    {
      "book": "Genesis",
      "chapters": [
        "5"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Moses",
      "chapters": [
        "6"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    }
  ],
  "all_content": "\n\n--- CFM: Genesis 5;Moses 6 ---\nMost of\nGenesis 5\nis a list of the generations between Adam and Eve and Noah. We read a lot of names, but we don’t learn much about them. Then we read this intriguing but unexplained line: “And Enoch walked with God: and he was not; for God took him” (\nGenesis 5:24\n). Surely there’s a story behind that verse! But without further explanation, the list of generations resumes.\nThankfully,\nMoses 6\nreveals the details of Enoch’s story—and it’s quite a story. We learn of Enoch’s humility, his insecurities, the potential God saw in him, and the great work he performed as God’s prophet. We also get a clearer picture of the family of Adam and Eve as it progressed through the generations. We read of Satan’s “great dominion” but also of parents who taught children “the ways of God” (\nMoses 6:15, 21\n). Especially precious is what we learn about the doctrine these parents taught: faith in Jesus Christ, repentance, baptism, and receiving the Holy Ghost (see\nMoses 6:50–52\n). That doctrine, like the priesthood that accompanies it, “was in the beginning [and] shall be in the end of the world also” (\nMoses 6:7\n).\nIdeas for Learning at Home and at Church\nMoses 6:26–36\nSin limits my ability to see, feel, and hear the things of God.\nAs you study\nMoses 6:26–36\n, what do you learn about the effects of sin? How have you seen these effects? What attributes did Enoch have that helped him overcome these effects? How did God bless him as a result?\nMoses 6:26–47\nGod calls me to do His work despite my weaknesses.\nIf you ever feel overwhelmed with what the Lord has called you to do, you aren’t alone. Even Enoch felt that way when the Lord called him to be a prophet. As you read\nMoses 6:26–36\n, look for why Enoch felt overwhelmed and what the Lord said to give him courage.\nIn\nverses 37–47\n, you could look for ways the Lord supported Enoch and empowered him to do His work (see also\nMoses 7:13\n). You might compare Enoch’s experience with that of other prophets who felt inadequate, such as Moses (see\nExodus 4:10–16\n), Jeremiah (see\nJeremiah 1:4–10\n), Nephi (see\n2 Nephi 33:1–4\n), and Moroni (see\nEther 12:23–29\n). What do you feel God wants you to learn from these scriptures about the work He has given you to do?\nA Seer Hath the Lord Raised Up (Moses 6:36)\n, by Eva Timothy\nMany modern-day apostles and prophets have expressed feelings similar to Enoch’s when they described how it felt to receive their calls. For example, see the testimony of Elder Ulisses Soares in “\nProphets Speak by the Power of the Holy Spirit\n” (\nLiahona\n, May 2018, 98–99).\nWhat can you learn from these prophets and apostles about your feelings of inadequacy? When have you felt the Savior help you when He asked you to do hard things? Consider writing down a few experiences in your future when you will need to rely on the Savior’s help. How can you approach these events with faith in Jesus Christ?\nThis year’s youth theme, “Walk with Me,” is based on\nMoses 6:34\n. Click\nhere\nfor music and other resources related to this theme. What does it mean to walk with the Savior? What will you do to accept His invitation to walk with Him?\nSee also David A. Bednar, “\nAbide in Me, and I in You; Therefore Walk with Me,\n”\nLiahona\n, May 2023, 123–25; “\nI’ll Go Where You Want Me to Go\n,”\nHymns\n, no. 270.\nMoses 6:48–68\nThe gospel of Jesus Christ was taught from the beginning.\nBecause we have the book of Moses, we know that God has been teaching His children how to find redemption ever since Adam and Eve. As you study\nMoses 6:48–68\n, search for what we must know and do to be redeemed. Notice Adam’s question in\nverse 53\n. Have you ever wondered that? What do you learn from the Lord’s answer in\nverses 53–65\n? You might think of these verses as the Lord’s message at Adam’s baptismal service. What do you learn about baptism from His message? Why do you think He compared baptism to being “born again”? (\nverse 59\n). What can you do to continue to be “born again” throughout your life?\nLook for symbols.\nIn the scriptures, objects or events can often represent or symbolize spiritual truths, especially truths about the Savior (see\nTeaching in the Savior’s Way\n,\n7\n). These symbols can enrich your understanding of Him and His doctrine. For instance, what do you learn from the symbols of hearts and ears in\nMoses 6:27\n, eyes and clay in\nMoses 6:35\n, or water in\nMoses 6:59–60\n?\nMoses 6:51–62\n“Teach these things freely unto your children.”\nAfter teaching Adam truths of the gospel of Jesus Christ, in\nMoses 6:51–63\n, the Lord told Adam to teach them to future generations. Consider making a list of these truths. (It might help to divide the passage into smaller groups of verses, such as\nverses 51–52\n,\n53–57\n,\n58–60\n,\n61–63\n). Why are these truths valuable to today’s rising generation? What else can you learn from the Lord’s instructions to parents in\nMosiah 4:14–15\nand\nDoctrine and Covenants 68:25–28\n;\n93:40–50\n?\nReading about the “book of remembrance” that Adam and Eve’s family kept may inspire you or your family to make your own book of remembrance. What do you feel the Lord would want you to include? Consider saving information from your book of remembrance on\nFamilySearch.org\n.\nSee also Dieter F. Uchtdorf, “\nJesus Christ Is the Strength of Parents\n,”\nLiahona\n, May 2023, 55–59; “Parenting: Touching the Hearts of Our Youth,” “But Why?” (videos), Gospel Library.\n3:2\nParenting: Touching the Hearts of Our Youth\n1:1\nBut Why?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat do the symbols of water, spirit, and blood teach us about being born again through Jesus Christ?\nHow did Adam become a “son of God”?\nClick to see more.\nIdeas for Teaching Children\nMoses 6:26–34\nGod can help me do hard things.\nWhen Enoch was called to preach the gospel, he worried that he would fail. But God helped him. Read together this story in\nMoses 6:26–34\n(see also “\nEnoch the Prophet\n” in\nOld Testament Stories\n, 19–21). Why did Enoch feel that he couldn’t preach the gospel? (see\nMoses 6:31\n). How did God help Enoch? (see\nMoses 6:32–34\n;\n7:13\n).\nYour children might enjoy sharing or acting out other examples of when God helped people do difficult things—for example, Noah, David, Ammon, or Samuel the Lamanite (see\nGospel Art Book\n,\nnos. 7\n,\n19\n,\n78\n,\n81\n). You could also share an experience of your own and let your children talk about how God helps them do hard things.\nMoses 6:50–62\nFaith in Christ, repentance, baptism, and receiving the Holy Ghost prepare me to return to God.\nGod taught Adam what we need to do to return to Him—have faith in Jesus Christ, repent, be baptized, and receive the gift of the Holy Ghost. Help your children find these principles in\nMoses 6:52, 57\n. Then you could help them write a short talk about one of the principles. Each talk could include a scripture from\nMoses 6\n, an experience, and a testimony. Let them share their talks with each other.\nYou could also display pictures that represent the first principles of the gospel (see the\nfourth article of faith\n). Place them in a line leading to a picture of Jesus Christ. As you read\nMoses 6:52\n, your children could stand next to the correct picture when they hear the words the picture represents.\nYour children might enjoy singing songs that teach the principles in\nMoses 6:52\n, such as “\nFaith\n,” “\nWhen I Am Baptized\n,” and “\nThe Holy Ghost\n” (\nChildren’s Songbook\n, 96–97, 103, 105). Help them find these principles in\nMoses 6:52\n.\nMoses 6:57–58\nHeavenly Father wants parents to teach their children.\nTo encourage your children to support their parents in their role as gospel teachers, consider asking a child to read\nMoses 6:58\nand identify the commandment God gave to parents. Then you could show a picture of Adam and Eve teaching their children (like the one at the end of this outline) and let your children talk about what they see in the picture. Your children could draw pictures of their families reading the scriptures together, praying together, or playing together.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 5: Lesson 13: Lesson 13—Moses 6:1–39This lesson can help students feel confidence in the Lord and His power to help and strengthen them.; Lesson 14: Lesson 14—Moses 6:47–68This lesson can help students understand how to come unto Jesus Christ and receive blessings only He and His Father can offer. ---\n\n--- Lesson 13 ---\nWhen Enoch was called to preach repentance to a wicked group of people, he felt inadequate. The Lord helped and strengthened him to accomplish what he thought he could not do. This lesson can help students feel confidence in the Lord and His power to help and strengthen them. Student preparation: Invite students to think of times people experienced the Lord’s power as he helped them overcome difficulties. Encourage them to look for examples in the scriptures. Possible Learning Activities Feelings of inadequacy Consider displaying statements such as the following on the board: I can’t. I’m not good enough. It’s too hard. What are situations where teenagers might experience these kinds of feelings? You might make a list on the board of the situations that students share. Think about a situation in your own life that might be causing you to feel inadequate or overwhelmed. Take a moment and ponder this question: How confident do you feel that the Lord will help you in this situation? Encourage students to think about their own situations as they study Enoch’s call to be a prophet. Invite them to seek the guidance of the Holy Ghost to increase their confidence in the Lord’s ability to help and strengthen them. Enoch experiences the Lord’s power A few generations after Adam, one of his descendants, Enoch, lived among hard-hearted and wicked people. Read Moses 6:26–28 , looking for what the Lord called Enoch to do. How might you have felt if you were Enoch? Why? To help students study Enoch’s experience with the Lord, consider using the handout titled “Enoch Experiences the Lord’s Power.” Students could work through the handout with a partner. For variety, they could switch partners after each study activity. You could also use the ideas on the handout to help the students study Enoch’s experience together as a class. Some students struggle with knowing how to begin a gospel-focused conversation. Included in the handout are some discussion questions. Providing discussion questions like these can help students practice sharing their thoughts and feelings about what they study in the scriptures or the words of prophets. (For additional training on discussions, see “ Encourage learners to share the truths they are learning ” in Teacher Development Skills .) Open PDF Give students time to share what they learned from their study and discussion, including truths they identified in Study Activity 4. Using their own words, students may have identified a truth similar to the following: If we faithfully do as the Lord commands, He will give us help and strength. The Lord’s help and strength in your life To help students understand the above principle, you could display some scriptural or modern examples. Invite students to read (or watch) the example and prepare to share how the Lord helped and strengthened the people in the example. Examples could include Nephi and his family in the wilderness (see 1 Nephi 5:7–8 ; 7:16–18 ; 17:1–3 ; 18:1–4 ), Alma and his people in bondage (see Mosiah 24:10–22 ), or the Prophet Joseph Smith in Liberty Jail (see Doctrine and Covenants 121:1–10 ; 122:7–9 ). You could also consider showing the example President Russell M. Nelson shared from his life in “ Becoming True Millennials ” (time code 9:05 to 12:29). This video is available at ChurchofJesusChrist.org . 30:29 How have you seen or experienced the Lord’s power to give help and strength in your life? Consider sharing your own personal experiences with the Lord’s power. Reflect on what you learned Give students time to reflect on what they have learned and felt today from the scriptures, each other, and the Spirit. One way you could do this is to display the following question and give students time to record their answers in their study journals. What have I learned or felt today about the Lord that can help me when I feel inadequate, discouraged, or not strong enough? Consider inviting a few willing students to share what they wrote with the class. Testify of the Savior and His power to give us strength and help.\n\n\n--- Lesson 14 ---\nJesus Christ is at the center of our Heavenly Father’s plan of salvation. He invites all to come unto Him by living His doctrine. This lesson can help students understand how to come unto Jesus Christ and receive blessings only He and His Father can offer. Student preparation: Invite students to ask a family member or friend why Jesus Christ is significant to them and what it means to them to come unto Him. Possible Learning Activities Come unto Christ Consider displaying a picture of Jesus Christ, such as the one found at the beginning of the lesson. Then share the following scenario. Imagine you have a friend who is unfamiliar with Jesus Christ. Your friend asks you who Jesus Christ is and why He matters to you. Give students time to think about how they might respond. Then invite them to share their thoughts in small groups or with the class. If you only had a small amount of time to respond, what would you want your friend to know about Jesus Christ? Why? Remind students of Enoch’s call to preach repentance to a wicked group of people (see Moses 6:27–29 ). Explain that today’s lesson will focus on his teachings to those people. Enoch’s message centered on our need for Jesus Christ and how we can come unto Him. To help students reflect on their need for the Savior, consider displaying the following instructions and giving students time to silently evaluate themselves on each statement. Using a scale of 1 (not true of me) to 5 (true of me), evaluate yourself using the following statements: I know why I need a Savior. I understand how I can come unto Jesus Christ. I currently want to come to and follow Jesus Christ. Regardless of how you evaluated yourself, the Savior wants you to come unto Him and receive the blessings that only He can offer you. As you study the words of the prophet Enoch today, pay attention to impressions from the Spirit to better understand why you need the Savior and how you can come unto Him. Enoch teaches his people To help students learn from Enoch’s teachings in Moses 6 , consider copying the following chart onto the board. Students could also copy the chart into their study journals. Ask the students to study the verses. Assign half of the class to look for why we need a Savior. The other half could look for how we come unto Christ. As students study, you may want to walk around and ask students if there are words or phrases they need help understanding. The following may help students understand verse 59 : We become born of the Spirit by receiving the gift of the Holy Ghost (see Topics and Questions, “ Gospel Study Guide: “Gift of the Holy Ghost ,” Gospel Library). To be sanctified means to become “free from sin, pure, clean, and holy through the Atonement of Jesus Christ” (Guide to the Scriptures, “ Sanctification ,” Gospel Library). Enoch’s teachings about coming unto Christ: Moses 6:48–52, 57–59 I need a Savior because … I can come unto Christ by … After students have completed their half of the chart, give them a chance to discuss their findings. They could do this by filling out the chart on the board as a class or by sharing what they learned with a partner. What did you learn from these verses about why we need a Savior? Students who focused on why we need a Savior may share truths like we can receive the blessings of salvation only through Jesus Christ ( verse 52 ); all people everywhere need to repent ( verses 49–50, 57 ); no unclean thing can dwell in the kingdom of God ( verse 57 ). You could invite students to write the truths they found in the chart on the board. What did these verses teach you about specific actions you can take that will help you come to Jesus Christ? Students who focused on how we can come unto Christ could write what they found on the board. Their responses could be summarized into a truth like we come unto Christ as we listen to the Savior’s voice, believe in Him, repent of our sins, are baptized, and receive the gift of the Holy Ghost . It may be helpful to explain that the scriptures sometimes refer to this process as the “doctrine of Christ” ( 2 Nephi 31:2–21 ), the Savior’s doctrine (see 3 Nephi 11:31–40 ), or the Savior’s gospel (see 3 Nephi 27:13–22 ). Consider inviting students to read Moses 6:62 to see another term Heavenly Father used to describe this process. You could invite students to share what they are noticing about the role of Jesus Christ in Heavenly Father’s plan of salvation. What would you say to someone who wonders whether it is worth the effort it takes to come unto Christ? As part of your discussion of the previous question, it may be helpful for students to study some or all of the following verses, looking for blessings we can receive as we come unto Jesus Christ: Matthew 11:28–30 ; 2 Nephi 31:21 ; 3 Nephi 19:13–14 ; Ether 12:27 ; Moroni 10:32–33 . You might also consider inviting students to share blessings they have experienced as they have made efforts to come unto Jesus Christ. Demonstrate understanding Invite students to refer to the scenario with their friend from the beginning of the lesson. To practice explaining what they have learned, students could share their responses to the following questions in small groups. Based on what you have learned and felt today, explain the following to your friend in a way that would be easy for them to understand: Why do we need Jesus Christ? What can we do to come unto Him? Consider concluding the lesson by inviting students to record thoughts or spiritual impressions they have had in their study journals. You could share what you have learned about the need for Jesus Christ and testify how coming unto Him has blessed your life.\n\n--- SCRIPTURE: Genesis 5 ---\n1. Thisisthebookof thegenerationsof Adam. In the day that God created man, in thelikenessof Godmadehe him;\n2. Male and female created he them; and blessed them, and called their nameAdam, in the day when they were created.\n3. And Adam lived an hundred and thirty years, and begata sonin his ownlikeness, after his image; and called his name Seth:\n4. And the days ofAdamafter he had begotten Seth were eight hundred years: and he begat sons and daughters:\n5. And all the days that Adam lived were nine hundred and thirty years: and he died.\n6. And Seth lived an hundred and five years, and begat Enos:\n7. And Seth lived after he begat Enos eight hundred and seven years, and begat sons and daughters:\n8. And all the days of Seth were nine hundred and twelve years: and he died.\n9. And Enos lived ninety years, and begat Cainan:\n10. And Enos lived after he begat Cainan eight hundred and fifteen years, and begat sons and daughters:\n11. And all the days of Enos were nine hundred and five years: and he died.\n12. And Cainan lived seventy years, and begat Mahalaleel:\n13. And Cainan lived after he begat Mahalaleel eight hundred and forty years, and begat sons and daughters:\n14. And all the days ofCainanwere nine hundred and ten years: and he died.\n15. And Mahalaleel lived sixty and five years, and begat Jared:\n16. And Mahalaleel lived after he begat Jared eight hundred and thirty years, and begat sons and daughters:\n17. And all the days of Mahalaleel were eight hundred ninety and five years: and he died.\n18. And Jared lived an hundred sixty and two years, and he begat Enoch:\n19. And Jared lived after he begat Enoch eight hundred years, and begat sons and daughters:\n20. And all the days of Jared were nine hundred sixty and two years: and he died.\n21. And Enoch lived sixty and five years, and begat Methuselah:\n22. AndEnochwalkedwith God after he begat Methuselah three hundred years, and begat sons and daughters:\n23. And all the days ofEnochwere three hundred sixty and five years:\n24. AndEnochwalkedwith God: and hewasnot; for Godtookhim.\n25. And Methuselah lived an hundred eighty and seven years, and begat Lamech:\n26. And Methuselah lived after he begat Lamech seven hundred eighty and two years, and begat sons and daughters:\n27. And all the days of Methuselah were nine hundred sixty and nine years: and he died.\n28. And Lamech lived an hundred eighty and two years, and begat son:\n29. And he called his nameNoah, saying, Thissameshallcomfortus concerning our work and toil of our hands, because of the ground which theLordhathcursed.\n30. And Lamech lived after he begat Noah five hundred ninety and five years, and begat sons and daughters:\n31. And all the days of Lamech were seven hundred seventy and seven years: and he died.\n32. And Noah was five hundred years old: and NoahbegatShem, Ham, and Japheth.\n\n--- SCRIPTURE: Moses 6 ---\n1. And Adam hearkened unto the voice of God, and called upon his sons to repent.\n2. And Adam knew his wife again, and she bare son, and he called his nameSeth. And Adam glorified the name of God; for he said: God hath appointed me another seed, instead of Abel, whom Cain slew.\n3. And God revealed himself untoSeth, and he rebelled not, but offered an acceptablesacrifice, like unto his brother Abel. And to him also was born son, and he called his name Enos.\n4. And then began these men tocallupon the name of the Lord, and the Lord blessed them;\n5. And abookofremembrancewas kept, in the which was recorded, in thelanguageof Adam, for it was given unto as many as called upon God to write by the spirit ofinspiration;\n6. And by them theirchildrenwere taught to read and write, having alanguagewhich waspureand undefiled.\n7. Now this samePriesthood, which was in the beginning, shall be in the end of the world also.\n8. Now this prophecy Adam spake, as he was moved upon by theHoly Ghost, and agenealogywas kept of thechildrenof God. And this was thebookof the generations of Adam, saying: In the day that God created man, in the likeness of God made he him;\n9. In theimageof his ownbody, male and female,createdhe them, and blessed them, and called theirnameAdam, in the day when they were created and became livingsoulsin the land upon thefootstoolof God.\n10. AndAdamlived one hundred and thirty years, and begat sonin his own likeness, after his ownimage, and called his name Seth.\n11. And the days of Adam, after he had begotten Seth, were eight hundred years, and he begat many sons and daughters;\n12. And all the days that Adam lived were nine hundred and thirty years, and he died.\n13. Seth lived one hundred and five years, and begat Enos, andprophesiedin all his days, and taught his son Enos in the ways of God; wherefore Enos prophesied also.\n14. And Seth lived, after he begat Enos, eight hundred and seven years, and begat many sons and daughters.\n15. And the children ofmenwere numerous upon all the face of the land. And in those daysSatanhad greatdominionamong men, and raged in their hearts; and from thenceforth camewarsand bloodshed; and mans hand was against his own brother, in administering death, because ofsecretworks, seeking forpower.\n16. All the days of Seth were nine hundred and twelve years, and he died.\n17. And Enos lived ninety years, and begatCainan. And Enos and the residue of the people of God came out from the land, which was called Shulon, and dwelt in land of promise, which he called after his own son, whom he had namedCainan.\n18. And Enos lived, after he begat Cainan, eight hundred and fifteen years, and begat many sons and daughters. And all the days of Enos were nine hundred and five years, and he died.\n19. And Cainan lived seventy years, and begat Mahalaleel; and Cainan lived after he begat Mahalaleel eight hundred and forty years, and begat sons and daughters. And all the days ofCainanwere nine hundred and ten years, and he died.\n20. And Mahalaleel lived sixty-five years, and begat Jared; and Mahalaleel lived, after he begat Jared, eight hundred and thirty years, and begat sons and daughters. And all the days of Mahalaleel were eight hundred and ninety-five years, and he died.\n21. And Jared lived one hundred and sixty-two years, and begatEnoch; and Jared lived, after he begat Enoch, eight hundred years, and begat sons and daughters. And JaredtaughtEnoch in all the ways of God.\n22. And this is the genealogy of the sons of Adam, who was thesonof God, with whom God, himself, conversed.\n23. And they werepreachersofrighteousness, and spake andprophesied, and called upon all men, everywhere, to repent; andfaithwastaughtunto the children of men.\n24. And it came to pass that all the days of Jared were nine hundred and sixty-two years, and he died.\n25. And Enoch lived sixty-five years, and begat Methuselah.\n26. And it came to pass that Enoch journeyed in the land, among the people; and as he journeyed, theSpiritof God descended out of heaven, and abode upon him.\n27. And he heard avoicefrom heaven, saying:Enoch, my son,prophesyunto this people, and say unto themRepent, for thus saith the Lord: I amangrywith this people, and my fierce anger is kindled against them; for their hearts have waxedhard, and theirearsare dull of hearing, and their eyescannotsee afar off;\n28. And for these many generations, ever since the day that I created them, have they gone astray, and havedeniedme, and have sought their own counsels in the dark; and in their own abominations have they devised murder, and have not kept the commandments, which I gave unto their father, Adam.\n29. Wherefore, they have foresworn themselves, and, by their oaths, they have brought upon themselves death; and ahellI have prepared for them, if they repent not;\n30. And this is decree, which I have sent forth in the beginning of the world, from my own mouth, from the foundation thereof, and by the mouths of my servants, thy fathers, have I decreed it, even as it shall be sent forth in the world, unto the ends thereof.\n31. And when Enoch had heard these words, hebowedhimself to the earth, before the Lord, and spake before the Lord, saying:Whyis it that I have found favor in thy sight, and am but lad, and all the peoplehateme; for I amslowof speech; wherefore am I thy servant?\n32. And the Lord said unto Enoch: Go forth and do as I have commanded thee, and no man shall pierce thee. Open thymouth, and it shall be filled, and I will give thee utterance, for all flesh is in my hands, and I will do as seemeth me good.\n33. Say unto this people:Chooseyethis day, to serve the Lord God who made you.\n34. Behold mySpiritis upon you, wherefore all thy words will I justify; and themountainsshall flee before you, and theriversshall turn from their course; and thou shalt abide in me, and I in you; thereforewalkwith me.\n35. And the Lord spake unto Enoch, and said unto him: Anoint thine eyes withclay, and wash them, and thou shalt see. And he did so.\n36. And he beheld thespiritsthat God had created; and he beheld also things which were not visible to thenaturaleye; and from thenceforth came the saying abroad in the land: Aseerhath the Lord raised up unto his people.\n37. And it came to pass that Enoch went forth in the land, among the people, standing upon the hills and the high places, and cried with loud voice, testifying against their works; and all men wereoffendedbecause of him.\n38. And they came forth to hear him, upon the high places, saying unto thetent-keepers: Tarry ye here and keep the tents, while we go yonder to behold the seer, for he prophesieth, and there is strange thing in the land; awildman hath come among us.\n39. And it came to pass when they heard him, no man laid hands on him; forfearcame on all them that heard him; for hewalkedwith God.\n40. And there came man unto him, whose name was Mahijah, and said unto him: Tell us plainly who thou art, and from whence thou comest?\n41. And he said unto them: I came out from the land ofCainan, the land of my fathers, land ofrighteousnessunto this day. And my fathertaughtme in all the ways of God.\n42. And it came to pass, as I journeyed from the land of Cainan, by the sea east, I beheld vision; and lo, the heavens I saw, and the Lord spake with me, and gave me commandment; wherefore, for this cause, to keep the commandment, I speak forth these words.\n43. And Enoch continued his speech, saying: The Lord which spake with me, the same is the God of heaven, and he is my God, and your God, and ye are my brethren, and whycounselye yourselves, and deny the God of heaven?\n44. The heavens he made; theearthis hisfootstool; and the foundation thereof is his. Behold, he laid it, an host of men hath he brought in upon the face thereof.\n45. And death hath come upon our fathers; nevertheless we know them, and cannot deny, and even the first of all we know, evenAdam.\n46. For book ofremembrancewe havewrittenamong us, according to the pattern given by the finger of God; and it is given in our ownlanguage.\n47. And as Enoch spake forth the words of God, the people trembled, and could notstandin his presence.\n48. And he said unto them: Because that Adamfell, we are; and by his fall camedeath; and we are made partakers of misery and woe.\n49. Behold Satan hath come among the children of men, andtempteththem toworshiphim; and men have becomecarnal,sensual, and devilish, and are shut out from thepresenceof God.\n50. But God hath made known unto our fathers that all men must repent.\n51. And he called upon our father Adam by his own voice, saying: I am God; Imadethe world, andmenbeforethey were in the flesh.\n52. And he also said unto him: If thou wilt turn unto me, and hearken unto my voice, and believe, and repent of all thy transgressions, and bebaptized, even in water, in the name of mine Only Begotten Son, who is full ofgraceand truth, which isJesus Christ, the onlynamewhich shall be given under heaven, wherebysalvationshall come unto the children of men, ye shall receive the gift of the Holy Ghost, asking all things in his name, and whatsoever ye shall ask, it shall be given you.\n53. And our father Adam spake untothe Lord, and said: Why is it that men must repent and be baptized in water? And the Lord said unto Adam: Behold I haveforgiventhee thy transgression in the Garden of Eden.\n54. Hence came the saying abroad among the people, that theSon of Godhathatonedfor original guilt, wherein the sins of the parents cannot be answered upon the heads of thechildren, for they arewholefrom the foundation of the world.\n55. And the Lord spake unto Adam, saying: Inasmuch as thy children areconceivedin sin, even so when they begin to grow up,sinconceiveth in their hearts, and they taste thebitter, that they may know to prize the good.\n56. And it is given unto them to know good from evil; wherefore they areagentsunto themselves, and I have given unto you another law and commandment.\n57. Wherefore teach it unto your children, that all men, everywhere, mustrepent, or they can in nowise inherit the kingdom of God, for nounclean thingcan dwell there, ordwellin hispresence; for, in the language of Adam,Manof Holiness is his name, and the name of his Only Begotten is theSon of Man, evenJesus Christ, righteousJudge, who shall come in the meridian of time.\n58. Therefore I give unto you acommandment, toteachthese things freely unto yourchildren, saying:\n59. That by reason of transgression cometh the fall, which fall bringeth death, and inasmuch as ye were born into the world by water, and blood, and thespirit, which I have made, and so became ofdusta living soul, even so ye must beborn againinto the kingdom of heaven, ofwater, and of the Spirit, and be cleansed by blood, even the blood of mine Only Begotten; that ye might be sanctified from all sin, andenjoythewordsofeternal lifein this world, and eternal life in the world to come, even immortalglory;\n60. For by thewaterye keep the commandment; by the Spirit ye arejustified, and by thebloodye aresanctified;\n61. Therefore it is given to abide in you; therecordof heaven; theComforter; thepeaceablethings of immortal glory; the truth of all things; that which quickeneth all things, which maketh alive all things; that which knoweth all things, and hath allpoweraccordingto wisdom, mercy, truth, justice, and judgment.\n62. And now, behold, I say unto you: This is theplan of salvationunto all men, through thebloodof mineOnly Begotten, who shall come in the meridian of time.\n63. And behold, all things have theirlikeness, and all things are created and made tobear recordof me, both things which are temporal, and things which are spiritual; things which are in the heavens above, and things which are on the earth, and things which are in the earth, and things which are under the earth, both above and beneath: all things bear record of me.\n64. And it came to pass, when the Lord had spoken with Adam, our father, that Adam cried unto the Lord, and he wascaught awayby the Spirit of the Lord, and was carried down into the water, and was laid under thewater, and was brought forth out of the water.\n65. And thus he was baptized, and the Spirit of God descended upon him, and thus he wasbornof the Spirit, and became quickened in theinnerman.\n66. And he heard voice out of heaven, saying: Thou art baptized withfire, and with the Holy Ghost. This is therecordof the Father, and the Son, from henceforth and forever;\n67. And thou art after theorderof him who was without beginning of days or end of years, from all eternity to all eternity.\n68. Behold, thou artonein me, son of God; and thus may all become mysons. Amen.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Genesis 5;Moses 6",
      "content": "Most of\nGenesis 5\nis a list of the generations between Adam and Eve and Noah. We read a lot of names, but we don’t learn much about them. Then we read this intriguing but unexplained line: “And Enoch walked with God: and he was not; for God took him” (\nGenesis 5:24\n). Surely there’s a story behind that verse! But without further explanation, the list of generations resumes.\nThankfully,\nMoses 6\nreveals the details of Enoch’s story—and it’s quite a story. We learn of Enoch’s humility, his insecurities, the potential God saw in him, and the great work he performed as God’s prophet. We also get a clearer picture of the family of Adam and Eve as it progressed through the generations. We read of Satan’s “great dominion” but also of parents who taught children “the ways of God” (\nMoses 6:15, 21\n). Especially precious is what we learn about the doctrine these parents taught: faith in Jesus Christ, repentance, baptism, and receiving the Holy Ghost (see\nMoses 6:50–52\n). That doctrine, like the priesthood that accompanies it, “was in the beginning [and] shall be in the end of the world also” (\nMoses 6:7\n).\nIdeas for Learning at Home and at Church\nMoses 6:26–36\nSin limits my ability to see, feel, and hear the things of God.\nAs you study\nMoses 6:26–36\n, what do you learn about the effects of sin? How have you seen these effects? What attributes did Enoch have that helped him overcome these effects? How did God bless him as a result?\nMoses 6:26–47\nGod calls me to do His work despite my weaknesses.\nIf you ever feel overwhelmed with what the Lord has called you to do, you aren’t alone. Even Enoch felt that way when the Lord called him to be a prophet. As you read\nMoses 6:26–36\n, look for why Enoch felt overwhelmed and what the Lord said to give him courage.\nIn\nverses 37–47\n, you could look for ways the Lord supported Enoch and empowered him to do His work (see also\nMoses 7:13\n). You might compare Enoch’s experience with that of other prophets who felt inadequate, such as Moses (see\nExodus 4:10–16\n), Jeremiah (see\nJeremiah 1:4–10\n), Nephi (see\n2 Nephi 33:1–4\n), and Moroni (see\nEther 12:23–29\n). What do you feel God wants you to learn from these scriptures about the work He has given you to do?\nA Seer Hath the Lord Raised Up (Moses 6:36)\n, by Eva Timothy\nMany modern-day apostles and prophets have expressed feelings similar to Enoch’s when they described how it felt to receive their calls. For example, see the testimony of Elder Ulisses Soares in “\nProphets Speak by the Power of the Holy Spirit\n” (\nLiahona\n, May 2018, 98–99).\nWhat can you learn from these prophets and apostles about your feelings of inadequacy? When have you felt the Savior help you when He asked you to do hard things? Consider writing down a few experiences in your future when you will need to rely on the Savior’s help. How can you approach these events with faith in Jesus Christ?\nThis year’s youth theme, “Walk with Me,” is based on\nMoses 6:34\n. Click\nhere\nfor music and other resources related to this theme. What does it mean to walk with the Savior? What will you do to accept His invitation to walk with Him?\nSee also David A. Bednar, “\nAbide in Me, and I in You; Therefore Walk with Me,\n”\nLiahona\n, May 2023, 123–25; “\nI’ll Go Where You Want Me to Go\n,”\nHymns\n, no. 270.\nMoses 6:48–68\nThe gospel of Jesus Christ was taught from the beginning.\nBecause we have the book of Moses, we know that God has been teaching His children how to find redemption ever since Adam and Eve. As you study\nMoses 6:48–68\n, search for what we must know and do to be redeemed. Notice Adam’s question in\nverse 53\n. Have you ever wondered that? What do you learn from the Lord’s answer in\nverses 53–65\n? You might think of these verses as the Lord’s message at Adam’s baptismal service. What do you learn about baptism from His message? Why do you think He compared baptism to being “born again”? (\nverse 59\n). What can you do to continue to be “born again” throughout your life?\nLook for symbols.\nIn the scriptures, objects or events can often represent or symbolize spiritual truths, especially truths about the Savior (see\nTeaching in the Savior’s Way\n,\n7\n). These symbols can enrich your understanding of Him and His doctrine. For instance, what do you learn from the symbols of hearts and ears in\nMoses 6:27\n, eyes and clay in\nMoses 6:35\n, or water in\nMoses 6:59–60\n?\nMoses 6:51–62\n“Teach these things freely unto your children.”\nAfter teaching Adam truths of the gospel of Jesus Christ, in\nMoses 6:51–63\n, the Lord told Adam to teach them to future generations. Consider making a list of these truths. (It might help to divide the passage into smaller groups of verses, such as\nverses 51–52\n,\n53–57\n,\n58–60\n,\n61–63\n). Why are these truths valuable to today’s rising generation? What else can you learn from the Lord’s instructions to parents in\nMosiah 4:14–15\nand\nDoctrine and Covenants 68:25–28\n;\n93:40–50\n?\nReading about the “book of remembrance” that Adam and Eve’s family kept may inspire you or your family to make your own book of remembrance. What do you feel the Lord would want you to include? Consider saving information from your book of remembrance on\nFamilySearch.org\n.\nSee also Dieter F. Uchtdorf, “\nJesus Christ Is the Strength of Parents\n,”\nLiahona\n, May 2023, 55–59; “Parenting: Touching the Hearts of Our Youth,” “But Why?” (videos), Gospel Library.\n3:2\nParenting: Touching the Hearts of Our Youth\n1:1\nBut Why?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat do the symbols of water, spirit, and blood teach us about being born again through Jesus Christ?\nHow did Adam become a “son of God”?\nClick to see more.\nIdeas for Teaching Children\nMoses 6:26–34\nGod can help me do hard things.\nWhen Enoch was called to preach the gospel, he worried that he would fail. But God helped him. Read together this story in\nMoses 6:26–34\n(see also “\nEnoch the Prophet\n” in\nOld Testament Stories\n, 19–21). Why did Enoch feel that he couldn’t preach the gospel? (see\nMoses 6:31\n). How did God help Enoch? (see\nMoses 6:32–34\n;\n7:13\n).\nYour children might enjoy sharing or acting out other examples of when God helped people do difficult things—for example, Noah, David, Ammon, or Samuel the Lamanite (see\nGospel Art Book\n,\nnos. 7\n,\n19\n,\n78\n,\n81\n). You could also share an experience of your own and let your children talk about how God helps them do hard things.\nMoses 6:50–62\nFaith in Christ, repentance, baptism, and receiving the Holy Ghost prepare me to return to God.\nGod taught Adam what we need to do to return to Him—have faith in Jesus Christ, repent, be baptized, and receive the gift of the Holy Ghost. Help your children find these principles in\nMoses 6:52, 57\n. Then you could help them write a short talk about one of the principles. Each talk could include a scripture from\nMoses 6\n, an experience, and a testimony. Let them share their talks with each other.\nYou could also display pictures that represent the first principles of the gospel (see the\nfourth article of faith\n). Place them in a line leading to a picture of Jesus Christ. As you read\nMoses 6:52\n, your children could stand next to the correct picture when they hear the words the picture represents.\nYour children might enjoy singing songs that teach the principles in\nMoses 6:52\n, such as “\nFaith\n,” “\nWhen I Am Baptized\n,” and “\nThe Holy Ghost\n” (\nChildren’s Songbook\n, 96–97, 103, 105). Help them find these principles in\nMoses 6:52\n.\nMoses 6:57–58\nHeavenly Father wants parents to teach their children.\nTo encourage your children to support their parents in their role as gospel teachers, consider asking a child to read\nMoses 6:58\nand identify the commandment God gave to parents. Then you could show a picture of Adam and Eve teaching their children (like the one at the end of this outline) and let your children talk about what they see in the picture. Your children could draw pictures of their families reading the scriptures together, praying together, or playing together.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 5: Lesson 13: Lesson 13—Moses 6:1–39This lesson can help students feel confidence in the Lord and His power to help and strengthen them.; Lesson 14: Lesson 14—Moses 6:47–68This lesson can help students understand how to come unto Jesus Christ and receive blessings only He and His Father can offer.",
      "content": "\n--- Lesson 13 ---\nWhen Enoch was called to preach repentance to a wicked group of people, he felt inadequate. The Lord helped and strengthened him to accomplish what he thought he could not do. This lesson can help students feel confidence in the Lord and His power to help and strengthen them. Student preparation: Invite students to think of times people experienced the Lord’s power as he helped them overcome difficulties. Encourage them to look for examples in the scriptures. Possible Learning Activities Feelings of inadequacy Consider displaying statements such as the following on the board: I can’t. I’m not good enough. It’s too hard. What are situations where teenagers might experience these kinds of feelings? You might make a list on the board of the situations that students share. Think about a situation in your own life that might be causing you to feel inadequate or overwhelmed. Take a moment and ponder this question: How confident do you feel that the Lord will help you in this situation? Encourage students to think about their own situations as they study Enoch’s call to be a prophet. Invite them to seek the guidance of the Holy Ghost to increase their confidence in the Lord’s ability to help and strengthen them. Enoch experiences the Lord’s power A few generations after Adam, one of his descendants, Enoch, lived among hard-hearted and wicked people. Read Moses 6:26–28 , looking for what the Lord called Enoch to do. How might you have felt if you were Enoch? Why? To help students study Enoch’s experience with the Lord, consider using the handout titled “Enoch Experiences the Lord’s Power.” Students could work through the handout with a partner. For variety, they could switch partners after each study activity. You could also use the ideas on the handout to help the students study Enoch’s experience together as a class. Some students struggle with knowing how to begin a gospel-focused conversation. Included in the handout are some discussion questions. Providing discussion questions like these can help students practice sharing their thoughts and feelings about what they study in the scriptures or the words of prophets. (For additional training on discussions, see “ Encourage learners to share the truths they are learning ” in Teacher Development Skills .) Open PDF Give students time to share what they learned from their study and discussion, including truths they identified in Study Activity 4. Using their own words, students may have identified a truth similar to the following: If we faithfully do as the Lord commands, He will give us help and strength. The Lord’s help and strength in your life To help students understand the above principle, you could display some scriptural or modern examples. Invite students to read (or watch) the example and prepare to share how the Lord helped and strengthened the people in the example. Examples could include Nephi and his family in the wilderness (see 1 Nephi 5:7–8 ; 7:16–18 ; 17:1–3 ; 18:1–4 ), Alma and his people in bondage (see Mosiah 24:10–22 ), or the Prophet Joseph Smith in Liberty Jail (see Doctrine and Covenants 121:1–10 ; 122:7–9 ). You could also consider showing the example President Russell M. Nelson shared from his life in “ Becoming True Millennials ” (time code 9:05 to 12:29). This video is available at ChurchofJesusChrist.org . 30:29 How have you seen or experienced the Lord’s power to give help and strength in your life? Consider sharing your own personal experiences with the Lord’s power. Reflect on what you learned Give students time to reflect on what they have learned and felt today from the scriptures, each other, and the Spirit. One way you could do this is to display the following question and give students time to record their answers in their study journals. What have I learned or felt today about the Lord that can help me when I feel inadequate, discouraged, or not strong enough? Consider inviting a few willing students to share what they wrote with the class. Testify of the Savior and His power to give us strength and help.\n\n\n--- Lesson 14 ---\nJesus Christ is at the center of our Heavenly Father’s plan of salvation. He invites all to come unto Him by living His doctrine. This lesson can help students understand how to come unto Jesus Christ and receive blessings only He and His Father can offer. Student preparation: Invite students to ask a family member or friend why Jesus Christ is significant to them and what it means to them to come unto Him. Possible Learning Activities Come unto Christ Consider displaying a picture of Jesus Christ, such as the one found at the beginning of the lesson. Then share the following scenario. Imagine you have a friend who is unfamiliar with Jesus Christ. Your friend asks you who Jesus Christ is and why He matters to you. Give students time to think about how they might respond. Then invite them to share their thoughts in small groups or with the class. If you only had a small amount of time to respond, what would you want your friend to know about Jesus Christ? Why? Remind students of Enoch’s call to preach repentance to a wicked group of people (see Moses 6:27–29 ). Explain that today’s lesson will focus on his teachings to those people. Enoch’s message centered on our need for Jesus Christ and how we can come unto Him. To help students reflect on their need for the Savior, consider displaying the following instructions and giving students time to silently evaluate themselves on each statement. Using a scale of 1 (not true of me) to 5 (true of me), evaluate yourself using the following statements: I know why I need a Savior. I understand how I can come unto Jesus Christ. I currently want to come to and follow Jesus Christ. Regardless of how you evaluated yourself, the Savior wants you to come unto Him and receive the blessings that only He can offer you. As you study the words of the prophet Enoch today, pay attention to impressions from the Spirit to better understand why you need the Savior and how you can come unto Him. Enoch teaches his people To help students learn from Enoch’s teachings in Moses 6 , consider copying the following chart onto the board. Students could also copy the chart into their study journals. Ask the students to study the verses. Assign half of the class to look for why we need a Savior. The other half could look for how we come unto Christ. As students study, you may want to walk around and ask students if there are words or phrases they need help understanding. The following may help students understand verse 59 : We become born of the Spirit by receiving the gift of the Holy Ghost (see Topics and Questions, “ Gospel Study Guide: “Gift of the Holy Ghost ,” Gospel Library). To be sanctified means to become “free from sin, pure, clean, and holy through the Atonement of Jesus Christ” (Guide to the Scriptures, “ Sanctification ,” Gospel Library). Enoch’s teachings about coming unto Christ: Moses 6:48–52, 57–59 I need a Savior because … I can come unto Christ by … After students have completed their half of the chart, give them a chance to discuss their findings. They could do this by filling out the chart on the board as a class or by sharing what they learned with a partner. What did you learn from these verses about why we need a Savior? Students who focused on why we need a Savior may share truths like we can receive the blessings of salvation only through Jesus Christ ( verse 52 ); all people everywhere need to repent ( verses 49–50, 57 ); no unclean thing can dwell in the kingdom of God ( verse 57 ). You could invite students to write the truths they found in the chart on the board. What did these verses teach you about specific actions you can take that will help you come to Jesus Christ? Students who focused on how we can come unto Christ could write what they found on the board. Their responses could be summarized into a truth like we come unto Christ as we listen to the Savior’s voice, believe in Him, repent of our sins, are baptized, and receive the gift of the Holy Ghost . It may be helpful to explain that the scriptures sometimes refer to this process as the “doctrine of Christ” ( 2 Nephi 31:2–21 ), the Savior’s doctrine (see 3 Nephi 11:31–40 ), or the Savior’s gospel (see 3 Nephi 27:13–22 ). Consider inviting students to read Moses 6:62 to see another term Heavenly Father used to describe this process. You could invite students to share what they are noticing about the role of Jesus Christ in Heavenly Father’s plan of salvation. What would you say to someone who wonders whether it is worth the effort it takes to come unto Christ? As part of your discussion of the previous question, it may be helpful for students to study some or all of the following verses, looking for blessings we can receive as we come unto Jesus Christ: Matthew 11:28–30 ; 2 Nephi 31:21 ; 3 Nephi 19:13–14 ; Ether 12:27 ; Moroni 10:32–33 . You might also consider inviting students to share blessings they have experienced as they have made efforts to come unto Jesus Christ. Demonstrate understanding Invite students to refer to the scenario with their friend from the beginning of the lesson. To practice explaining what they have learned, students could share their responses to the following questions in small groups. Based on what you have learned and felt today, explain the following to your friend in a way that would be easy for them to understand: Why do we need Jesus Christ? What can we do to come unto Him? Consider concluding the lesson by inviting students to record thoughts or spiritual impressions they have had in their study journals. You could share what you have learned about the need for Jesus Christ and testify how coming unto Him has blessed your life.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Genesis 5",
      "content": "1. Thisisthebookof thegenerationsof Adam. In the day that God created man, in thelikenessof Godmadehe him;\n2. Male and female created he them; and blessed them, and called their nameAdam, in the day when they were created.\n3. And Adam lived an hundred and thirty years, and begata sonin his ownlikeness, after his image; and called his name Seth:\n4. And the days ofAdamafter he had begotten Seth were eight hundred years: and he begat sons and daughters:\n5. And all the days that Adam lived were nine hundred and thirty years: and he died.\n6. And Seth lived an hundred and five years, and begat Enos:\n7. And Seth lived after he begat Enos eight hundred and seven years, and begat sons and daughters:\n8. And all the days of Seth were nine hundred and twelve years: and he died.\n9. And Enos lived ninety years, and begat Cainan:\n10. And Enos lived after he begat Cainan eight hundred and fifteen years, and begat sons and daughters:\n11. And all the days of Enos were nine hundred and five years: and he died.\n12. And Cainan lived seventy years, and begat Mahalaleel:\n13. And Cainan lived after he begat Mahalaleel eight hundred and forty years, and begat sons and daughters:\n14. And all the days ofCainanwere nine hundred and ten years: and he died.\n15. And Mahalaleel lived sixty and five years, and begat Jared:\n16. And Mahalaleel lived after he begat Jared eight hundred and thirty years, and begat sons and daughters:\n17. And all the days of Mahalaleel were eight hundred ninety and five years: and he died.\n18. And Jared lived an hundred sixty and two years, and he begat Enoch:\n19. And Jared lived after he begat Enoch eight hundred years, and begat sons and daughters:\n20. And all the days of Jared were nine hundred sixty and two years: and he died.\n21. And Enoch lived sixty and five years, and begat Methuselah:\n22. AndEnochwalkedwith God after he begat Methuselah three hundred years, and begat sons and daughters:\n23. And all the days ofEnochwere three hundred sixty and five years:\n24. AndEnochwalkedwith God: and hewasnot; for Godtookhim.\n25. And Methuselah lived an hundred eighty and seven years, and begat Lamech:\n26. And Methuselah lived after he begat Lamech seven hundred eighty and two years, and begat sons and daughters:\n27. And all the days of Methuselah were nine hundred sixty and nine years: and he died.\n28. And Lamech lived an hundred eighty and two years, and begat son:\n29. And he called his nameNoah, saying, Thissameshallcomfortus concerning our work and toil of our hands, because of the ground which theLordhathcursed.\n30. And Lamech lived after he begat Noah five hundred ninety and five years, and begat sons and daughters:\n31. And all the days of Lamech were seven hundred seventy and seven years: and he died.\n32. And Noah was five hundred years old: and NoahbegatShem, Ham, and Japheth.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Moses 6",
      "content": "1. And Adam hearkened unto the voice of God, and called upon his sons to repent.\n2. And Adam knew his wife again, and she bare son, and he called his nameSeth. And Adam glorified the name of God; for he said: God hath appointed me another seed, instead of Abel, whom Cain slew.\n3. And God revealed himself untoSeth, and he rebelled not, but offered an acceptablesacrifice, like unto his brother Abel. And to him also was born son, and he called his name Enos.\n4. And then began these men tocallupon the name of the Lord, and the Lord blessed them;\n5. And abookofremembrancewas kept, in the which was recorded, in thelanguageof Adam, for it was given unto as many as called upon God to write by the spirit ofinspiration;\n6. And by them theirchildrenwere taught to read and write, having alanguagewhich waspureand undefiled.\n7. Now this samePriesthood, which was in the beginning, shall be in the end of the world also.\n8. Now this prophecy Adam spake, as he was moved upon by theHoly Ghost, and agenealogywas kept of thechildrenof God. And this was thebookof the generations of Adam, saying: In the day that God created man, in the likeness of God made he him;\n9. In theimageof his ownbody, male and female,createdhe them, and blessed them, and called theirnameAdam, in the day when they were created and became livingsoulsin the land upon thefootstoolof God.\n10. AndAdamlived one hundred and thirty years, and begat sonin his own likeness, after his ownimage, and called his name Seth.\n11. And the days of Adam, after he had begotten Seth, were eight hundred years, and he begat many sons and daughters;\n12. And all the days that Adam lived were nine hundred and thirty years, and he died.\n13. Seth lived one hundred and five years, and begat Enos, andprophesiedin all his days, and taught his son Enos in the ways of God; wherefore Enos prophesied also.\n14. And Seth lived, after he begat Enos, eight hundred and seven years, and begat many sons and daughters.\n15. And the children ofmenwere numerous upon all the face of the land. And in those daysSatanhad greatdominionamong men, and raged in their hearts; and from thenceforth camewarsand bloodshed; and mans hand was against his own brother, in administering death, because ofsecretworks, seeking forpower.\n16. All the days of Seth were nine hundred and twelve years, and he died.\n17. And Enos lived ninety years, and begatCainan. And Enos and the residue of the people of God came out from the land, which was called Shulon, and dwelt in land of promise, which he called after his own son, whom he had namedCainan.\n18. And Enos lived, after he begat Cainan, eight hundred and fifteen years, and begat many sons and daughters. And all the days of Enos were nine hundred and five years, and he died.\n19. And Cainan lived seventy years, and begat Mahalaleel; and Cainan lived after he begat Mahalaleel eight hundred and forty years, and begat sons and daughters. And all the days ofCainanwere nine hundred and ten years, and he died.\n20. And Mahalaleel lived sixty-five years, and begat Jared; and Mahalaleel lived, after he begat Jared, eight hundred and thirty years, and begat sons and daughters. And all the days of Mahalaleel were eight hundred and ninety-five years, and he died.\n21. And Jared lived one hundred and sixty-two years, and begatEnoch; and Jared lived, after he begat Enoch, eight hundred years, and begat sons and daughters. And JaredtaughtEnoch in all the ways of God.\n22. And this is the genealogy of the sons of Adam, who was thesonof God, with whom God, himself, conversed.\n23. And they werepreachersofrighteousness, and spake andprophesied, and called upon all men, everywhere, to repent; andfaithwastaughtunto the children of men.\n24. And it came to pass that all the days of Jared were nine hundred and sixty-two years, and he died.\n25. And Enoch lived sixty-five years, and begat Methuselah.\n26. And it came to pass that Enoch journeyed in the land, among the people; and as he journeyed, theSpiritof God descended out of heaven, and abode upon him.\n27. And he heard avoicefrom heaven, saying:Enoch, my son,prophesyunto this people, and say unto themRepent, for thus saith the Lord: I amangrywith this people, and my fierce anger is kindled against them; for their hearts have waxedhard, and theirearsare dull of hearing, and their eyescannotsee afar off;\n28. And for these many generations, ever since the day that I created them, have they gone astray, and havedeniedme, and have sought their own counsels in the dark; and in their own abominations have they devised murder, and have not kept the commandments, which I gave unto their father, Adam.\n29. Wherefore, they have foresworn themselves, and, by their oaths, they have brought upon themselves death; and ahellI have prepared for them, if they repent not;\n30. And this is decree, which I have sent forth in the beginning of the world, from my own mouth, from the foundation thereof, and by the mouths of my servants, thy fathers, have I decreed it, even as it shall be sent forth in the world, unto the ends thereof.\n31. And when Enoch had heard these words, hebowedhimself to the earth, before the Lord, and spake before the Lord, saying:Whyis it that I have found favor in thy sight, and am but lad, and all the peoplehateme; for I amslowof speech; wherefore am I thy servant?\n32. And the Lord said unto Enoch: Go forth and do as I have commanded thee, and no man shall pierce thee. Open thymouth, and it shall be filled, and I will give thee utterance, for all flesh is in my hands, and I will do as seemeth me good.\n33. Say unto this people:Chooseyethis day, to serve the Lord God who made you.\n34. Behold mySpiritis upon you, wherefore all thy words will I justify; and themountainsshall flee before you, and theriversshall turn from their course; and thou shalt abide in me, and I in you; thereforewalkwith me.\n35. And the Lord spake unto Enoch, and said unto him: Anoint thine eyes withclay, and wash them, and thou shalt see. And he did so.\n36. And he beheld thespiritsthat God had created; and he beheld also things which were not visible to thenaturaleye; and from thenceforth came the saying abroad in the land: Aseerhath the Lord raised up unto his people.\n37. And it came to pass that Enoch went forth in the land, among the people, standing upon the hills and the high places, and cried with loud voice, testifying against their works; and all men wereoffendedbecause of him.\n38. And they came forth to hear him, upon the high places, saying unto thetent-keepers: Tarry ye here and keep the tents, while we go yonder to behold the seer, for he prophesieth, and there is strange thing in the land; awildman hath come among us.\n39. And it came to pass when they heard him, no man laid hands on him; forfearcame on all them that heard him; for hewalkedwith God.\n40. And there came man unto him, whose name was Mahijah, and said unto him: Tell us plainly who thou art, and from whence thou comest?\n41. And he said unto them: I came out from the land ofCainan, the land of my fathers, land ofrighteousnessunto this day. And my fathertaughtme in all the ways of God.\n42. And it came to pass, as I journeyed from the land of Cainan, by the sea east, I beheld vision; and lo, the heavens I saw, and the Lord spake with me, and gave me commandment; wherefore, for this cause, to keep the commandment, I speak forth these words.\n43. And Enoch continued his speech, saying: The Lord which spake with me, the same is the God of heaven, and he is my God, and your God, and ye are my brethren, and whycounselye yourselves, and deny the God of heaven?\n44. The heavens he made; theearthis hisfootstool; and the foundation thereof is his. Behold, he laid it, an host of men hath he brought in upon the face thereof.\n45. And death hath come upon our fathers; nevertheless we know them, and cannot deny, and even the first of all we know, evenAdam.\n46. For book ofremembrancewe havewrittenamong us, according to the pattern given by the finger of God; and it is given in our ownlanguage.\n47. And as Enoch spake forth the words of God, the people trembled, and could notstandin his presence.\n48. And he said unto them: Because that Adamfell, we are; and by his fall camedeath; and we are made partakers of misery and woe.\n49. Behold Satan hath come among the children of men, andtempteththem toworshiphim; and men have becomecarnal,sensual, and devilish, and are shut out from thepresenceof God.\n50. But God hath made known unto our fathers that all men must repent.\n51. And he called upon our father Adam by his own voice, saying: I am God; Imadethe world, andmenbeforethey were in the flesh.\n52. And he also said unto him: If thou wilt turn unto me, and hearken unto my voice, and believe, and repent of all thy transgressions, and bebaptized, even in water, in the name of mine Only Begotten Son, who is full ofgraceand truth, which isJesus Christ, the onlynamewhich shall be given under heaven, wherebysalvationshall come unto the children of men, ye shall receive the gift of the Holy Ghost, asking all things in his name, and whatsoever ye shall ask, it shall be given you.\n53. And our father Adam spake untothe Lord, and said: Why is it that men must repent and be baptized in water? And the Lord said unto Adam: Behold I haveforgiventhee thy transgression in the Garden of Eden.\n54. Hence came the saying abroad among the people, that theSon of Godhathatonedfor original guilt, wherein the sins of the parents cannot be answered upon the heads of thechildren, for they arewholefrom the foundation of the world.\n55. And the Lord spake unto Adam, saying: Inasmuch as thy children areconceivedin sin, even so when they begin to grow up,sinconceiveth in their hearts, and they taste thebitter, that they may know to prize the good.\n56. And it is given unto them to know good from evil; wherefore they areagentsunto themselves, and I have given unto you another law and commandment.\n57. Wherefore teach it unto your children, that all men, everywhere, mustrepent, or they can in nowise inherit the kingdom of God, for nounclean thingcan dwell there, ordwellin hispresence; for, in the language of Adam,Manof Holiness is his name, and the name of his Only Begotten is theSon of Man, evenJesus Christ, righteousJudge, who shall come in the meridian of time.\n58. Therefore I give unto you acommandment, toteachthese things freely unto yourchildren, saying:\n59. That by reason of transgression cometh the fall, which fall bringeth death, and inasmuch as ye were born into the world by water, and blood, and thespirit, which I have made, and so became ofdusta living soul, even so ye must beborn againinto the kingdom of heaven, ofwater, and of the Spirit, and be cleansed by blood, even the blood of mine Only Begotten; that ye might be sanctified from all sin, andenjoythewordsofeternal lifein this world, and eternal life in the world to come, even immortalglory;\n60. For by thewaterye keep the commandment; by the Spirit ye arejustified, and by thebloodye aresanctified;\n61. Therefore it is given to abide in you; therecordof heaven; theComforter; thepeaceablethings of immortal glory; the truth of all things; that which quickeneth all things, which maketh alive all things; that which knoweth all things, and hath allpoweraccordingto wisdom, mercy, truth, justice, and judgment.\n62. And now, behold, I say unto you: This is theplan of salvationunto all men, through thebloodof mineOnly Begotten, who shall come in the meridian of time.\n63. And behold, all things have theirlikeness, and all things are created and made tobear recordof me, both things which are temporal, and things which are spiritual; things which are in the heavens above, and things which are on the earth, and things which are in the earth, and things which are under the earth, both above and beneath: all things bear record of me.\n64. And it came to pass, when the Lord had spoken with Adam, our father, that Adam cried unto the Lord, and he wascaught awayby the Spirit of the Lord, and was carried down into the water, and was laid under thewater, and was brought forth out of the water.\n65. And thus he was baptized, and the Spirit of God descended upon him, and thus he wasbornof the Spirit, and became quickened in theinnerman.\n66. And he heard voice out of heaven, saying: Thou art baptized withfire, and with the Holy Ghost. This is therecordof the Father, and the Son, from henceforth and forever;\n67. And thou art after theorderof him who was without beginning of days or end of years, from all eternity to all eternity.\n68. Behold, thou artonein me, son of God; and thus may all become mysons. Amen.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Genesis": {
      "5": {
        "verses": {
          "1": {
            "text": "Thisisthebookof thegenerationsof Adam. In the day that God created man, in thelikenessof Godmadehe him;",
            "citation": "(Genesis 5:1)"
          },
          "2": {
            "text": "Male and female created he them; and blessed them, and called their nameAdam, in the day when they were created.",
            "citation": "(Genesis 5:2)"
          },
          "3": {
            "text": "And Adam lived an hundred and thirty years, and begata sonin his ownlikeness, after his image; and called his name Seth:",
            "citation": "(Genesis 5:3)"
          },
          "4": {
            "text": "And the days ofAdamafter he had begotten Seth were eight hundred years: and he begat sons and daughters:",
            "citation": "(Genesis 5:4)"
          },
          "5": {
            "text": "And all the days that Adam lived were nine hundred and thirty years: and he died.",
            "citation": "(Genesis 5:5)"
          },
          "6": {
            "text": "And Seth lived an hundred and five years, and begat Enos:",
            "citation": "(Genesis 5:6)"
          },
          "7": {
            "text": "And Seth lived after he begat Enos eight hundred and seven years, and begat sons and daughters:",
            "citation": "(Genesis 5:7)"
          },
          "8": {
            "text": "And all the days of Seth were nine hundred and twelve years: and he died.",
            "citation": "(Genesis 5:8)"
          },
          "9": {
            "text": "And Enos lived ninety years, and begat Cainan:",
            "citation": "(Genesis 5:9)"
          },
          "10": {
            "text": "And Enos lived after he begat Cainan eight hundred and fifteen years, and begat sons and daughters:",
            "citation": "(Genesis 5:10)"
          },
          "11": {
            "text": "And all the days of Enos were nine hundred and five years: and he died.",
            "citation": "(Genesis 5:11)"
          },
          "12": {
            "text": "And Cainan lived seventy years, and begat Mahalaleel:",
            "citation": "(Genesis 5:12)"
          },
          "13": {
            "text": "And Cainan lived after he begat Mahalaleel eight hundred and forty years, and begat sons and daughters:",
            "citation": "(Genesis 5:13)"
          },
          "14": {
            "text": "And all the days ofCainanwere nine hundred and ten years: and he died.",
            "citation": "(Genesis 5:14)"
          },
          "15": {
            "text": "And Mahalaleel lived sixty and five years, and begat Jared:",
            "citation": "(Genesis 5:15)"
          },
          "16": {
            "text": "And Mahalaleel lived after he begat Jared eight hundred and thirty years, and begat sons and daughters:",
            "citation": "(Genesis 5:16)"
          },
          "17": {
            "text": "And all the days of Mahalaleel were eight hundred ninety and five years: and he died.",
            "citation": "(Genesis 5:17)"
          },
          "18": {
            "text": "And Jared lived an hundred sixty and two years, and he begat Enoch:",
            "citation": "(Genesis 5:18)"
          },
          "19": {
            "text": "And Jared lived after he begat Enoch eight hundred years, and begat sons and daughters:",
            "citation": "(Genesis 5:19)"
          },
          "20": {
            "text": "And all the days of Jared were nine hundred sixty and two years: and he died.",
            "citation": "(Genesis 5:20)"
          },
          "21": {
            "text": "And Enoch lived sixty and five years, and begat Methuselah:",
            "citation": "(Genesis 5:21)"
          },
          "22": {
            "text": "AndEnochwalkedwith God after he begat Methuselah three hundred years, and begat sons and daughters:",
            "citation": "(Genesis 5:22)"
          },
          "23": {
            "text": "And all the days ofEnochwere three hundred sixty and five years:",
            "citation": "(Genesis 5:23)"
          },
          "24": {
            "text": "AndEnochwalkedwith God: and hewasnot; for Godtookhim.",
            "citation": "(Genesis 5:24)"
          },
          "25": {
            "text": "And Methuselah lived an hundred eighty and seven years, and begat Lamech:",
            "citation": "(Genesis 5:25)"
          },
          "26": {
            "text": "And Methuselah lived after he begat Lamech seven hundred eighty and two years, and begat sons and daughters:",
            "citation": "(Genesis 5:26)"
          },
          "27": {
            "text": "And all the days of Methuselah were nine hundred sixty and nine years: and he died.",
            "citation": "(Genesis 5:27)"
          },
          "28": {
            "text": "And Lamech lived an hundred eighty and two years, and begat son:",
            "citation": "(Genesis 5:28)"
          },
          "29": {
            "text": "And he called his nameNoah, saying, Thissameshallcomfortus concerning our work and toil of our hands, because of the ground which theLordhathcursed.",
            "citation": "(Genesis 5:29)"
          },
          "30": {
            "text": "And Lamech lived after he begat Noah five hundred ninety and five years, and begat sons and daughters:",
            "citation": "(Genesis 5:30)"
          },
          "31": {
            "text": "And all the days of Lamech were seven hundred seventy and seven years: and he died.",
            "citation": "(Genesis 5:31)"
          },
          "32": {
            "text": "And Noah was five hundred years old: and NoahbegatShem, Ham, and Japheth.",
            "citation": "(Genesis 5:32)"
          }
        }
      }
    },
    "Moses": {
      "6": {
        "verses": {
          "1": {
            "text": "And Adam hearkened unto the voice of God, and called upon his sons to repent.",
            "citation": "(Moses 6:1)"
          },
          "2": {
            "text": "And Adam knew his wife again, and she bare son, and he called his nameSeth. And Adam glorified the name of God; for he said: God hath appointed me another seed, instead of Abel, whom Cain slew.",
            "citation": "(Moses 6:2)"
          },
          "3": {
            "text": "And God revealed himself untoSeth, and he rebelled not, but offered an acceptablesacrifice, like unto his brother Abel. And to him also was born son, and he called his name Enos.",
            "citation": "(Moses 6:3)"
          },
          "4": {
            "text": "And then began these men tocallupon the name of the Lord, and the Lord blessed them;",
            "citation": "(Moses 6:4)"
          },
          "5": {
            "text": "And abookofremembrancewas kept, in the which was recorded, in thelanguageof Adam, for it was given unto as many as called upon God to write by the spirit ofinspiration;",
            "citation": "(Moses 6:5)"
          },
          "6": {
            "text": "And by them theirchildrenwere taught to read and write, having alanguagewhich waspureand undefiled.",
            "citation": "(Moses 6:6)"
          },
          "7": {
            "text": "Now this samePriesthood, which was in the beginning, shall be in the end of the world also.",
            "citation": "(Moses 6:7)"
          },
          "8": {
            "text": "Now this prophecy Adam spake, as he was moved upon by theHoly Ghost, and agenealogywas kept of thechildrenof God. And this was thebookof the generations of Adam, saying: In the day that God created man, in the likeness of God made he him;",
            "citation": "(Moses 6:8)"
          },
          "9": {
            "text": "In theimageof his ownbody, male and female,createdhe them, and blessed them, and called theirnameAdam, in the day when they were created and became livingsoulsin the land upon thefootstoolof God.",
            "citation": "(Moses 6:9)"
          },
          "10": {
            "text": "AndAdamlived one hundred and thirty years, and begat sonin his own likeness, after his ownimage, and called his name Seth.",
            "citation": "(Moses 6:10)"
          },
          "11": {
            "text": "And the days of Adam, after he had begotten Seth, were eight hundred years, and he begat many sons and daughters;",
            "citation": "(Moses 6:11)"
          },
          "12": {
            "text": "And all the days that Adam lived were nine hundred and thirty years, and he died.",
            "citation": "(Moses 6:12)"
          },
          "13": {
            "text": "Seth lived one hundred and five years, and begat Enos, andprophesiedin all his days, and taught his son Enos in the ways of God; wherefore Enos prophesied also.",
            "citation": "(Moses 6:13)"
          },
          "14": {
            "text": "And Seth lived, after he begat Enos, eight hundred and seven years, and begat many sons and daughters.",
            "citation": "(Moses 6:14)"
          },
          "15": {
            "text": "And the children ofmenwere numerous upon all the face of the land. And in those daysSatanhad greatdominionamong men, and raged in their hearts; and from thenceforth camewarsand bloodshed; and mans hand was against his own brother, in administering death, because ofsecretworks, seeking forpower.",
            "citation": "(Moses 6:15)"
          },
          "16": {
            "text": "All the days of Seth were nine hundred and twelve years, and he died.",
            "citation": "(Moses 6:16)"
          },
          "17": {
            "text": "And Enos lived ninety years, and begatCainan. And Enos and the residue of the people of God came out from the land, which was called Shulon, and dwelt in land of promise, which he called after his own son, whom he had namedCainan.",
            "citation": "(Moses 6:17)"
          },
          "18": {
            "text": "And Enos lived, after he begat Cainan, eight hundred and fifteen years, and begat many sons and daughters. And all the days of Enos were nine hundred and five years, and he died.",
            "citation": "(Moses 6:18)"
          },
          "19": {
            "text": "And Cainan lived seventy years, and begat Mahalaleel; and Cainan lived after he begat Mahalaleel eight hundred and forty years, and begat sons and daughters. And all the days ofCainanwere nine hundred and ten years, and he died.",
            "citation": "(Moses 6:19)"
          },
          "20": {
            "text": "And Mahalaleel lived sixty-five years, and begat Jared; and Mahalaleel lived, after he begat Jared, eight hundred and thirty years, and begat sons and daughters. And all the days of Mahalaleel were eight hundred and ninety-five years, and he died.",
            "citation": "(Moses 6:20)"
          },
          "21": {
            "text": "And Jared lived one hundred and sixty-two years, and begatEnoch; and Jared lived, after he begat Enoch, eight hundred years, and begat sons and daughters. And JaredtaughtEnoch in all the ways of God.",
            "citation": "(Moses 6:21)"
          },
          "22": {
            "text": "And this is the genealogy of the sons of Adam, who was thesonof God, with whom God, himself, conversed.",
            "citation": "(Moses 6:22)"
          },
          "23": {
            "text": "And they werepreachersofrighteousness, and spake andprophesied, and called upon all men, everywhere, to repent; andfaithwastaughtunto the children of men.",
            "citation": "(Moses 6:23)"
          },
          "24": {
            "text": "And it came to pass that all the days of Jared were nine hundred and sixty-two years, and he died.",
            "citation": "(Moses 6:24)"
          },
          "25": {
            "text": "And Enoch lived sixty-five years, and begat Methuselah.",
            "citation": "(Moses 6:25)"
          },
          "26": {
            "text": "And it came to pass that Enoch journeyed in the land, among the people; and as he journeyed, theSpiritof God descended out of heaven, and abode upon him.",
            "citation": "(Moses 6:26)"
          },
          "27": {
            "text": "And he heard avoicefrom heaven, saying:Enoch, my son,prophesyunto this people, and say unto themRepent, for thus saith the Lord: I amangrywith this people, and my fierce anger is kindled against them; for their hearts have waxedhard, and theirearsare dull of hearing, and their eyescannotsee afar off;",
            "citation": "(Moses 6:27)"
          },
          "28": {
            "text": "And for these many generations, ever since the day that I created them, have they gone astray, and havedeniedme, and have sought their own counsels in the dark; and in their own abominations have they devised murder, and have not kept the commandments, which I gave unto their father, Adam.",
            "citation": "(Moses 6:28)"
          },
          "29": {
            "text": "Wherefore, they have foresworn themselves, and, by their oaths, they have brought upon themselves death; and ahellI have prepared for them, if they repent not;",
            "citation": "(Moses 6:29)"
          },
          "30": {
            "text": "And this is decree, which I have sent forth in the beginning of the world, from my own mouth, from the foundation thereof, and by the mouths of my servants, thy fathers, have I decreed it, even as it shall be sent forth in the world, unto the ends thereof.",
            "citation": "(Moses 6:30)"
          },
          "31": {
            "text": "And when Enoch had heard these words, hebowedhimself to the earth, before the Lord, and spake before the Lord, saying:Whyis it that I have found favor in thy sight, and am but lad, and all the peoplehateme; for I amslowof speech; wherefore am I thy servant?",
            "citation": "(Moses 6:31)"
          },
          "32": {
            "text": "And the Lord said unto Enoch: Go forth and do as I have commanded thee, and no man shall pierce thee. Open thymouth, and it shall be filled, and I will give thee utterance, for all flesh is in my hands, and I will do as seemeth me good.",
            "citation": "(Moses 6:32)"
          },
          "33": {
            "text": "Say unto this people:Chooseyethis day, to serve the Lord God who made you.",
            "citation": "(Moses 6:33)"
          },
          "34": {
            "text": "Behold mySpiritis upon you, wherefore all thy words will I justify; and themountainsshall flee before you, and theriversshall turn from their course; and thou shalt abide in me, and I in you; thereforewalkwith me.",
            "citation": "(Moses 6:34)"
          },
          "35": {
            "text": "And the Lord spake unto Enoch, and said unto him: Anoint thine eyes withclay, and wash them, and thou shalt see. And he did so.",
            "citation": "(Moses 6:35)"
          },
          "36": {
            "text": "And he beheld thespiritsthat God had created; and he beheld also things which were not visible to thenaturaleye; and from thenceforth came the saying abroad in the land: Aseerhath the Lord raised up unto his people.",
            "citation": "(Moses 6:36)"
          },
          "37": {
            "text": "And it came to pass that Enoch went forth in the land, among the people, standing upon the hills and the high places, and cried with loud voice, testifying against their works; and all men wereoffendedbecause of him.",
            "citation": "(Moses 6:37)"
          },
          "38": {
            "text": "And they came forth to hear him, upon the high places, saying unto thetent-keepers: Tarry ye here and keep the tents, while we go yonder to behold the seer, for he prophesieth, and there is strange thing in the land; awildman hath come among us.",
            "citation": "(Moses 6:38)"
          },
          "39": {
            "text": "And it came to pass when they heard him, no man laid hands on him; forfearcame on all them that heard him; for hewalkedwith God.",
            "citation": "(Moses 6:39)"
          },
          "40": {
            "text": "And there came man unto him, whose name was Mahijah, and said unto him: Tell us plainly who thou art, and from whence thou comest?",
            "citation": "(Moses 6:40)"
          },
          "41": {
            "text": "And he said unto them: I came out from the land ofCainan, the land of my fathers, land ofrighteousnessunto this day. And my fathertaughtme in all the ways of God.",
            "citation": "(Moses 6:41)"
          },
          "42": {
            "text": "And it came to pass, as I journeyed from the land of Cainan, by the sea east, I beheld vision; and lo, the heavens I saw, and the Lord spake with me, and gave me commandment; wherefore, for this cause, to keep the commandment, I speak forth these words.",
            "citation": "(Moses 6:42)"
          },
          "43": {
            "text": "And Enoch continued his speech, saying: The Lord which spake with me, the same is the God of heaven, and he is my God, and your God, and ye are my brethren, and whycounselye yourselves, and deny the God of heaven?",
            "citation": "(Moses 6:43)"
          },
          "44": {
            "text": "The heavens he made; theearthis hisfootstool; and the foundation thereof is his. Behold, he laid it, an host of men hath he brought in upon the face thereof.",
            "citation": "(Moses 6:44)"
          },
          "45": {
            "text": "And death hath come upon our fathers; nevertheless we know them, and cannot deny, and even the first of all we know, evenAdam.",
            "citation": "(Moses 6:45)"
          },
          "46": {
            "text": "For book ofremembrancewe havewrittenamong us, according to the pattern given by the finger of God; and it is given in our ownlanguage.",
            "citation": "(Moses 6:46)"
          },
          "47": {
            "text": "And as Enoch spake forth the words of God, the people trembled, and could notstandin his presence.",
            "citation": "(Moses 6:47)"
          },
          "48": {
            "text": "And he said unto them: Because that Adamfell, we are; and by his fall camedeath; and we are made partakers of misery and woe.",
            "citation": "(Moses 6:48)"
          },
          "49": {
            "text": "Behold Satan hath come among the children of men, andtempteththem toworshiphim; and men have becomecarnal,sensual, and devilish, and are shut out from thepresenceof God.",
            "citation": "(Moses 6:49)"
          },
          "50": {
            "text": "But God hath made known unto our fathers that all men must repent.",
            "citation": "(Moses 6:50)"
          },
          "51": {
            "text": "And he called upon our father Adam by his own voice, saying: I am God; Imadethe world, andmenbeforethey were in the flesh.",
            "citation": "(Moses 6:51)"
          },
          "52": {
            "text": "And he also said unto him: If thou wilt turn unto me, and hearken unto my voice, and believe, and repent of all thy transgressions, and bebaptized, even in water, in the name of mine Only Begotten Son, who is full ofgraceand truth, which isJesus Christ, the onlynamewhich shall be given under heaven, wherebysalvationshall come unto the children of men, ye shall receive the gift of the Holy Ghost, asking all things in his name, and whatsoever ye shall ask, it shall be given you.",
            "citation": "(Moses 6:52)"
          },
          "53": {
            "text": "And our father Adam spake untothe Lord, and said: Why is it that men must repent and be baptized in water? And the Lord said unto Adam: Behold I haveforgiventhee thy transgression in the Garden of Eden.",
            "citation": "(Moses 6:53)"
          },
          "54": {
            "text": "Hence came the saying abroad among the people, that theSon of Godhathatonedfor original guilt, wherein the sins of the parents cannot be answered upon the heads of thechildren, for they arewholefrom the foundation of the world.",
            "citation": "(Moses 6:54)"
          },
          "55": {
            "text": "And the Lord spake unto Adam, saying: Inasmuch as thy children areconceivedin sin, even so when they begin to grow up,sinconceiveth in their hearts, and they taste thebitter, that they may know to prize the good.",
            "citation": "(Moses 6:55)"
          },
          "56": {
            "text": "And it is given unto them to know good from evil; wherefore they areagentsunto themselves, and I have given unto you another law and commandment.",
            "citation": "(Moses 6:56)"
          },
          "57": {
            "text": "Wherefore teach it unto your children, that all men, everywhere, mustrepent, or they can in nowise inherit the kingdom of God, for nounclean thingcan dwell there, ordwellin hispresence; for, in the language of Adam,Manof Holiness is his name, and the name of his Only Begotten is theSon of Man, evenJesus Christ, righteousJudge, who shall come in the meridian of time.",
            "citation": "(Moses 6:57)"
          },
          "58": {
            "text": "Therefore I give unto you acommandment, toteachthese things freely unto yourchildren, saying:",
            "citation": "(Moses 6:58)"
          },
          "59": {
            "text": "That by reason of transgression cometh the fall, which fall bringeth death, and inasmuch as ye were born into the world by water, and blood, and thespirit, which I have made, and so became ofdusta living soul, even so ye must beborn againinto the kingdom of heaven, ofwater, and of the Spirit, and be cleansed by blood, even the blood of mine Only Begotten; that ye might be sanctified from all sin, andenjoythewordsofeternal lifein this world, and eternal life in the world to come, even immortalglory;",
            "citation": "(Moses 6:59)"
          },
          "60": {
            "text": "For by thewaterye keep the commandment; by the Spirit ye arejustified, and by thebloodye aresanctified;",
            "citation": "(Moses 6:60)"
          },
          "61": {
            "text": "Therefore it is given to abide in you; therecordof heaven; theComforter; thepeaceablethings of immortal glory; the truth of all things; that which quickeneth all things, which maketh alive all things; that which knoweth all things, and hath allpoweraccordingto wisdom, mercy, truth, justice, and judgment.",
            "citation": "(Moses 6:61)"
          },
          "62": {
            "text": "And now, behold, I say unto you: This is theplan of salvationunto all men, through thebloodof mineOnly Begotten, who shall come in the meridian of time.",
            "citation": "(Moses 6:62)"
          },
          "63": {
            "text": "And behold, all things have theirlikeness, and all things are created and made tobear recordof me, both things which are temporal, and things which are spiritual; things which are in the heavens above, and things which are on the earth, and things which are in the earth, and things which are under the earth, both above and beneath: all things bear record of me.",
            "citation": "(Moses 6:63)"
          },
          "64": {
            "text": "And it came to pass, when the Lord had spoken with Adam, our father, that Adam cried unto the Lord, and he wascaught awayby the Spirit of the Lord, and was carried down into the water, and was laid under thewater, and was brought forth out of the water.",
            "citation": "(Moses 6:64)"
          },
          "65": {
            "text": "And thus he was baptized, and the Spirit of God descended upon him, and thus he wasbornof the Spirit, and became quickened in theinnerman.",
            "citation": "(Moses 6:65)"
          },
          "66": {
            "text": "And he heard voice out of heaven, saying: Thou art baptized withfire, and with the Holy Ghost. This is therecordof the Father, and the Son, from henceforth and forever;",
            "citation": "(Moses 6:66)"
          },
          "67": {
            "text": "And thou art after theorderof him who was without beginning of days or end of years, from all eternity to all eternity.",
            "citation": "(Moses 6:67)"
          },
          "68": {
            "text": "Behold, thou artonein me, son of God; and thus may all become mysons. Amen.",
            "citation": "(Moses 6:68)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 33721,
  "total_sources": 4,
  "generated_at": "2025-12-14T04:01:27.365233"
}