{
  "week_number": 30,
  "date_range": "Chronicles 14–202 ",
  "title": "2 ;26;30",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: 2 ;26;30 ---\nThe Kingdom of Judah was surrounded. Armies from three powerful enemy nations were all advancing at once, prepared for battle. In this desperate moment of need, Jehoshaphat, King of Judah, turned to the King of heaven and earth. Jehoshaphat gathered his people at the temple and prayed. He acknowledged their human weakness and pleaded for deliverance. In response, the Lord promised His protection: “Fear not, nor be dismayed” (\n2 Chronicles 20:17\n).\nWe might not have an invading army at our doorstep threatening to destroy us, but sometimes we do feel surrounded by adversity and evil. Our path to deliverance is the same one Jehoshaphat sought, and our prayer can be like his too: “O our God, … we have no might against this great company that cometh against us; neither know we what to do: but our eyes are upon thee” (\n2 Chronicles 20:12\n).\nIn\n2 Chronicles 14–30\n, you will read about Jehoshaphat and other kings in Judah. Consider how their faith-driven reforms, victories, and challenges can apply to your own life.\nFor an overview of the book of 2 Chronicles, see “\nChronicles\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n2 Chronicles 14–16\nTrusting in God will bring me peace.\nWhen Asa was the king of Judah, he faced many challenges—just like we all do today. As you read about the trials he faced, notice where he put his trust and how that changed over time.\nReference\nChallenges Asa faced\nWhere Asa put his trust\nReference\n2 Chronicles 14:9–12\nReference\n2 Chronicles 15:1–8\nReference\n2 Chronicles 16:1–10\nWhy do we sometimes stop trusting the Lord? What else do you learn from Asa’s life?\nSee also Elder D. Todd Christofferson, “\nOur Relationship with God\n,”\nLiahona\n, May 2022, 78–80.\n2 Chronicles 18\nI can defend the truth, even when it’s unpopular.\nThe prophet Micaiah must have felt a lot of pressure to predict success for the kings Jehoshaphat and Ahab in their war against Syria. Look for evidence of that pressure in\n2 Chronicles 18:1–12\n. What evidence do you find of Micaiah’s courage and integrity in\nverses 13–27\n? (Note that in\nverse 14\n, Micaiah gives a sarcastic response; his real answer is in\nverse 16\n.) How are Micaiah’s words fulfilled in\nverses 28–34\n?\nWhat are some situations in which you might face pressure like Micaiah faced? What gives you courage to stand up for the Lord and His teachings?\nIn the days of King Jehoshaphat, three nations attacked Jerusalem.\n2 Chronicles 20:1–25\nIn difficult times, I can turn to God and His prophets.\nAs you read\n2 Chronicles 20:1–12\n, look for what King Jehoshaphat did when multiple nations came to attack Judah. How could you apply his actions in the challenging circumstances you face?\nThe Lord’s response to Jehoshaphat’s prayer is found in\nverses 14–17\n. What phrases do you find there that could comfort you or someone you know during difficult times?\nThe following day, the people of Jerusalem went out to meet the opposing army. As you read\n2 Chronicles 20:20\n, look for the message Jehoshaphat gave to the people of Jerusalem. How were his words fulfilled? (see\nverses 22–23\n). How has God blessed you for believing in Him and following His prophets?\nPresident Russell M. Nelson said: “My experience is that once you stop putting question marks behind the prophet’s statements and put exclamation points instead, and\ndo it\n, the blessings just pour. I never ask myself, ‘When does the prophet speak as a prophet and when does he not?’ My interest has been, ‘How can I be more like him?’” (in Lane Johnson, “\nRussell M. Nelson: A Study in Obedience\n,”\nEnsign\n, Aug. 1982, 24).\nSee also\nDoctrine and Covenants 21:4–6\n; “A Secure Anchor” (video), Gospel Library; “\nMake inspired choices\n,”\nFor the Strength of Youth: A Guide for Making Choices\n(2022), 4–5.\n3:37\nA Secure Anchor\nIdentify simple statements of truth.\nElder Neal A. Maxwell taught: “The scriptures offer us so many doctrinal diamonds. And when the light of the Spirit plays upon their several facets, they sparkle with celestial sense and illuminate the path we are to follow” (“\nAccording to the Desire of [Our] Hearts\n,”\nEnsign\n, Nov. 1996, 21). As you study the scriptures, consider taking time to identify, mark, and ponder short yet powerful messages. Some examples can be found in\n2 Chronicles 14:11\n;\n15:7\n;\n18:13\n;\n20:15\n;\n26:5\n. What other “doctrinal diamonds” can you find?\n2 Chronicles 26:3–21\nPride leads to destruction.\nAs with many other kings of Judah, Uzziah’s reign began with great accomplishments but ended with tragedy. Look for this pattern in\n2 Chronicles 26\n. What would you say was the turning point in Uzziah’s life?\nAs you read\nverses 16–23\n, keep in mind that at this time, only priests were allowed to burn incense in the temple. Why do you think King Uzziah disobeyed God? What do you learn from this tragic experience?\nSee also “\nBe Thou Humble\n,”\nHymns\n, no. 130.\n2 Chronicles 30\nI can be a peacemaker.\nIn\n2 Chronicles 30\n, Hezekiah was the king of Judah. He invited the rival Kingdom of Israel to gather in Jerusalem to celebrate Passover—something the Israelites hadn’t been able to do for many years (see\nverses 1–12\n). What impresses you about the invitation and how it was received—both by the Israelite guests and by their hosts in Judah?\nBecause it had been so long, some visitors to Jerusalem were not familiar with the details of how to participate in Passover. As you read\n2 Chronicles 30:18–27\n, what do you learn from Hezekiah’s response and the results of his response?\nSee also Russell M. Nelson, “\nPeacemakers Needed\n,”\nLiahona\n, May 2023, 98–101.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n2 Chronicles 14–16\n;\n20\nI can trust God.\nTo introduce the idea of trusting the Lord, you might show your children something you trust to keep you dry when it rains, like an umbrella or jacket. Let them talk about why we can trust these things. Then help them compare that to our trust in the Lord. Why do we trust Him to keep us safe spiritually?\nYou could help your children discover how King Asa and King Jehoshaphat responded to challenges by trusting in the Lord (see\n2 Chronicles 14:11\n;\n20:3–5, 12\n). Share with each other ways you can show the Lord that you trust Him.\n2 Chronicles 20:1–29\nGod will hear and answer my prayers.\nThis week’s activity page can help your children understand the story of Jehoshaphat’s prayer and the Lord’s answer. You and your children could share times when God heard and answered your prayers. Consider including times when the answers came in ways or at times that you didn’t expect. A song about prayer, such as “\nI Pray in Faith\n” (\nChildren’s Songbook\n, 14), could help build your children’s faith.\n2 Chronicles 26:3–23\nI can be humble.\nTo learn about the dangers of pride, your children could build a tower with blocks or small cups. As they place each block or cup on the tower, help them identify one of Uzziah’s accomplishments from\n2 Chronicles 26:3–15\n. After they finish the tower, discuss with your children how Uzziah could keep it tall and strong. What could make it fall? Then, as you read\nverse 16\n, you could talk about what it means to have our hearts “lifted up to [our] destruction.” Share with your children what happened to Uzziah in\nverses 16–23\n. Let them knock down their tower. Talk about what we can do to stay humble.\nKing Hezekiah and the People Thank God\n, © Lifeway Collection/licensed from goodsalt.com\n2 Chronicles 30\nI can be a peacemaker.\nThe picture above shows when Hezekiah invited Judah’s neighbors from the Kingdom of Israel to celebrate Passover with them. You could look at this image with your children and read\n2 Chronicles 30:18–19\n, which explains that some of the guests had not washed themselves according to the law of Moses. What did Hezekiah do? How would this have made the guests feel? Help your children think of how they can be like Hezekiah in the way they treat others.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 30: Lesson 83: Lesson 83—2 Kings 2–4This lesson can help students understand that the Lord gives authority to the people He calls and power to those who serve righteously.; Lesson 84: Lesson 84—2 Kings 5This lesson can help students obey the small and simple things the Lord asks us to do.... ---\n\n--- Lesson 83 ---\nWhen we accept callings in the Lord’s Church, we receive His authority to serve. When we strive to diligently serve and become more like Him, He will bless us with His power. The account of the Lord blessing the prophet Elisha with power and authority after taking Elijah into heaven illustrates this truth. This lesson can help students understand that the Lord gives authority to the people He calls and power to those who serve righteously. Student preparation: Invite students to think about a time when they or someone they know has served in a Church calling. Invite students to ponder the question, “When have I witnessed the Lord’s power and authority in fulfilling Church callings?” Possible Learning Activities The source of power and authority Consider beginning class by discussing where authority to do certain things comes from. You might do this by showing an image of a doctor wearing a medical coat or in a medical setting (or another professional with authority to act in their position) and asking the following questions. What are some of this person’s responsibilities? Who gave them authority to fulfill their role? What gives you confidence to trust them? Consider showing an image of the current prophet and asking the previous questions again about him. To help students assess what they understand about serving with the Lord’s power and authority in callings, you could invite them to do the following. In your study journal or Notes section in Gospel Library, answer the following questions. As you consider your answers, listen for impressions from the Holy Ghost about what the Lord wants you to understand about serving with the Lord’s power and authority in callings. What do I understand about receiving the Lord’s power and authority to serve in callings? How could this understanding influence how I respond when I or someone else receives a calling from the Lord? Elisha receives God’s power and authority You might explain that the Lord revealed to Elijah that Elisha would become a prophet (see 1 Kings 19:16, 19 ). What concerns might Elisha have felt as he prepared for his calling from the Lord? Elisha knew that the Lord would soon take Elijah away ( 2 Kings 2:1–3 ). On Elijah’s final day, Elisha followed Elijah from city to city until the two arrived at the Jordan River. To help students discover what happened at the Jordan River, you could organize the class into small groups. On the board, you could draw the four images below or summarize each in a few words in random order. Invite each group to read 2 Kings 2:8–15 and organize the images or summary of the events in chronological order. You might need to explain that a mantle is a cloak. How did the Lord show Elisha and others that He had given Elisha power and authority in his calling? You might explain that the mantle used by Elijah and Elisha did not give them power and authority but represented God’s power and authority. In the Church today, we sometimes refer to someone’s calling or authority as their “mantle.” For example, when a new prophet is sustained as President of the Church, he receives the mantle of authority. It also might be helpful to point out that the authority to serve in callings comes from the Lord through the men who hold priesthood keys. What truth can we learn from Elisha’s experience about what the Lord does for people He calls to serve Him? Among truths students may offer, point out that the Lord gives authority and power to people whom He calls . Serving with God’s power and authority To help students understand what it means to serve in callings with the Lord’s power and authority, you could write Priesthood Authority and Priesthood Power on the board. Share the following statement from Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ . While this statement applies directly to missionary callings, remind students that the Lord gives authority to the people He calls to serve in any calling and power to those who serve Him righteously. Under Christ’s direction, the authority to preach the gospel was restored through the Prophet Joseph Smith. When you are set apart as a missionary, you received this authority. With it comes the right, privilege, and responsibility to represent the Lord and teach His gospel. … In addition to authority, you need spiritual power to fulfill your calling. God gives spiritual power as you consistently work to strengthen your testimony of Him, Jesus Christ, and the gospel truths you teach. He bestows spiritual power as you pray, study the scriptures, and seek to fulfill your missionary purpose. He grants spiritual power as you strive to keep His commandments and the covenants you made when you received the ordinances of salvation (see Doctrine and Covenants 35:24 ). ( Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ , [2023], 3) What do you learn about the Lord’s power and authority from these statements? Why might this be helpful to remember when you receive a calling from Heavenly Father and Jesus Christ? Why might this be helpful to remember when you sustain others who receive callings? As students discuss what they learned about priesthood authority and power, you could list what they share under each heading on the board. As part of this discussion, you may point out that God gives priesthood authority to someone when they are set apart in a calling. Priesthood power comes from God as someone strives to keep the commandments and act according to righteous principles (see Doctrine and Covenants 121:34–46 ). Consider showing the video “ Jesus Calls Twelve Apostles to Preach and Bless Others ” (1:38), available at ChurchofJesusChrist.org . As students watch the video, have them think about how Heavenly Father and Jesus Christ manifest Their love by giving Their authority and power to Their servants on earth. 1:39 Following the video, invite a few students to share their thoughts. Demonstrate understanding To help students summarize what they learned, consider organizing the class into pairs for the following activity. Choose one or more of the following situations and discuss what you have learned today that could help the person with their concerns about a calling. In each response, include scriptures, statements from Church leaders, or insights you have received from the Spirit as you’ve studied the story of Elisha’s call to serve. A new bishop is called and sustained. His son knows that he is not perfect. A new Young Women president is called to serve. A young woman had a great relationship with the previous president and doesn’t know the new one at all. A young man or young woman is called to serve as the president of their quorum or class. They do not feel they know enough to fulfill this calling well. A missionary is called to serve in a country where the people speak a different language. They are concerned about how effective they will really be in sharing the gospel. Think of a way to have students share their responses with each other. One way is to have each pair share with a different group. After everyone has a chance to share, you could invite students to share what they really liked about the other group’s response. To conclude, you might testify of truths you have discussed today.\n\n\n--- Lesson 84 ---\nSometimes we may not recognize the spiritual value of doing the small things Heavenly Father and Jesus Christ invite us to do. In 2 Kings 5 , the Lord healed Naaman, a Syrian captain, of his leprosy because he followed the prophet’s simple counsel to wash himself seven times in the Jordan River. This lesson can help students obey the small and simple things the Lord asks us to do. Student preparation: Invite students to read Alma 37:6–7 , looking for what they can learn about small and simple things. Or you could encourage students to pay attention to small things they do often that make a big difference in their life or that affect their relationship with Heavenly Father and Jesus Christ. Possible Learning Activities Drip irrigation Consider displaying an image like the following or bringing a plant to class and demonstrating how drip irrigation works. The information in the next paragraph could help you explain it. Drip irrigation is a technique used to water plants. Unlike other forms of irrigation that apply large amounts of water infrequently, drip irrigation involves slowly dripping small amounts of water onto the soil. The steady drips of water keep the soil moist where it is most useful to the plants. Consider placing students into small groups to discuss answers to the following question. In what ways could the principles of drip irrigation apply to our spiritual progress in Heavenly Father’s plan? Invite a few groups to share what they discussed. Then consider displaying the self-assessment below and inviting students to think about how accurate it is in their life. Take a moment to reflect on the small efforts you are making as a disciple of Jesus Christ and the results you are experiencing. Then ponder the truthfulness of this statement for you: I recognize how the small and simple things I do, or don’t do, affect my life and my relationship with Heavenly Father and Jesus Christ. Invite students to be receptive to thoughts and feelings they receive from the Holy Ghost about small and simple things they can do to strengthen their relationship with Heavenly Father and Jesus Christ. Naaman healed of his leprosy 2 Kings 5 contains the account of Naaman, a Syrian captain who learned a powerful lesson about doing the small and simple things the Lord commands. Read 2 Kings 5:1 , looking for everything you can learn about Naaman. What did you find? You may want to explain that leprosy was a terrible skin disease. It may have caused Naaman to develop disfiguring sores and could have resulted in death. As an alternative to students simply reading the following verses, you could label three parts of your classroom as “Syria,” “Elisha’s house,” and “Jordan River.” Invite four volunteers to represent the following people by reading aloud the accompanying verses in the designated places. Students representing Naaman and his servant could move from place to place, while the little maid and Elisha’s messenger remain in their location. Syria: The little maid read verses 2–4 Elisha’s house: Elisha’s messenger read verses 9–10 Elisha’s house: Naaman read verses 11–12 Jordan River: Naaman’s servant read verses 13–14 Read 2 Kings 5:2–4, 9–14 , looking for what Elisha, as a prophet of God, told Naaman to do to be healed of his leprosy. What are some important lessons a teenager today could learn from Naaman’s experience? Students may state a truth like obedience to the Lord’s small and simple invitations brings great blessings . You might invite them to write this truth as a note next to 2 Kings 5:13–14 in their scriptures and mark the phrases in these verses that teach this truth. Making notes in their scriptures can help students remember truths they learn. You could also invite students to read Alma 37:6–7 , and link or cross-reference these verses to 2 Kings 5:13–14 . Small and simple things The following activity is designed to help students identify small and simple things Heavenly Father and Jesus Christ have asked us to do and to discuss how we can be blessed by doing them. One way this activity could be done is by placing students in small groups and giving each group a piece of paper and scissors. Invite each group to draw and cut out three large water drops. For step 1 below, groups could write a different small and simple thing that the Lord has invited us to do on each droplet, then place them on the board. Make a list of small and simple things the Lord has asked us to do that can lead to great blessings. If needed, the following statement could help groups identify small and simple things the Lord has asked us to do as well as ways we are blessed by doing them. President Dallin H. Oaks of the First Presidency shared some examples of small and simple things the Lord has invited us to do. 17:36 Consider the scripture study we’ve been taught to incorporate into our daily lives. Or consider the personal prayers and the kneeling family prayers that are regular practices for faithful Latter-day Saints. Consider attendance at seminary for youth or institute classes for young adults. Though each of these practices may seem to be small and simple, over time they result in powerful spiritual uplift and growth. This occurs because each of these small and simple things invites the companionship of the Holy Ghost, the Testifier who enlightens us and guides us into truth. (“ Small and Simple Things ,” Ensign or Liahona , May 2018, 90) Before completing the following step, invite each group to select one drop that a different group placed on the board. Search the scriptures and words of the prophets, looking for the great blessings the Lord offers if we do this small and simple thing. Invite multiple groups to share what they learned. As part of this discussion, you might invite students to reflect on experiences they have had doing small and simple things. You could then invite volunteers to share how the Lord has blessed them and how their relationship with Heavenly Father and Jesus Christ was strengthened as a result. The previous prompt can help students verbalize their feelings, experiences, and testimonies. You might also share your testimony or experiences with doing small and simple things the Lord asks of us. For additional training, see: “ Bear testimony often and invite learners to share their feelings, experiences, and testimonies ” in Teacher Development Skills . You could also watch “ Abide the Day in Christ ” ( ChurchofJesusChrist.org ) from time code 2:30 to 4:23. Students could identify how Sister Amy A. Wright, First Counselor in the Primary General Presidency, and her family were strengthened through the small and simple things they had done. 10:33 You could also have students read 2 Kings 5:15 to see the blessing of testimony Naaman received through his obedience to the small and simple thing the prophet invited him to do. Small and simple things in my life To help students make a plan to obey the small and simple things the Lord has asked them to do, display the following instructions. Respond to the following in your study journal: Think of a small and simple thing the Lord has asked you to do that you feel you are already doing well. How has obeying the Lord’s instruction strengthened your relationship with Heavenly Father and Jesus Christ? Select a small and simple thing the Lord has asked you to do that you feel inspired to do better. What will you do to improve your obedience to the Lord’s invitation? How could that strengthen your faith in Heavenly Father and Jesus Christ? You could invite a few willing students to share their response to the first question. Encourage students to follow through on their plan to improve.\n\n\n--- Lesson 85 ---\nWhen surrounded by the Syrian army, the prophet Elisha’s servant cried out in fear, “how shall we do?” ( 2 Kings 6:15 ). Elisha comforted his servant by helping him recognize the Lord’s help. We likewise can be comforted as we learn to recognize the Lord’s help. This lesson can help students feel increased confidence in the Lord’s constant and watchful care. Student preparation: Invite students to prepare to share an experience when the Lord blessed or protected them or someone they know. Possible Learning Activities Recognizing the Savior’s care To begin your lesson, consider drawing a stick figure in the center of the board. The scriptures are filled with the Savior’s promises for His people who strive to serve Him. To visualize one of these promises, draw a stick figure on the center of a page in your study journal and label it Me. Then, read Doctrine and Covenants 84:88 , and draw around your stick figure how you visualize the Lord’s promises. You could invite a student to add to the drawing on the board what they drew in their journal, explaining why they drew what they did. Other students could be invited to add anything different they may have drawn. Alternatively, students could share and explain their drawings with a neighbor. How do you think it might affect someone if they were able to recognize these promises occurring in their life? Why can it be difficult to see or recognize the Lord’s blessings and protection in our lives? It may be helpful to testify that Heavenly Father and the Savior are actively involved in each student’s life. Ponder how well you recognize Heavenly Father and Jesus Christ’s involvement in your life. Then respond to the following questions in your study journal: Can you recognize at least one way Heavenly Father and Jesus Christ are blessing or protecting you? If so, how are They doing it? What is a situation you are facing in your life where it could help you to better recognize Their blessings and protection? As you study 2 Kings 6 , invite the Holy Ghost to help you recognize ways Heavenly Father and Jesus Christ are blessing and protecting you. Divine help Consider explaining the following information to help students understand the context of 2 Kings 6 . During a time of war between Israel and Syria, the king of Syria privately discussed his battle plans with his servants. However, the Lord repeatedly revealed Syria’s plans to the prophet Elisha, who would then warn the king of Israel. When the king of Syria discovered this, he sent an army to capture Elisha (see 2 Kings 6:8–13 ). Choose an effective way for students to study the following verses to help them identify converting principles. For example, it may be helpful for students to study from the perspective of Elisha’s servant. They could occasionally pause and think about how they would feel if they were in his place. Students could also read as a class or in small groups, with different students reading the parts for Elisha, Elisha’s servant, and the king of Israel. It may be helpful to explain that Samaria was the capital city of the kingdom of Israel. Read 2 Kings 6:14–23 , looking for ways the Lord blessed and protected Elisha and his servant. What impressed you from the story? What truths from this story could be relevant to us today? Consider sharing the following truth if students did not already share a similar truth in their own words: The Lord can help us recognize His blessings and protection in our lives. How do you think recognizing the Lord’s blessings and protection affected Elisha and his servant? Recognizing the Lord’s blessings and protection To help students recognize some ways the Lord can bless and protect them, you could organize them into pairs or small groups for the following activity. Note: Students will be given an opportunity to reflect on the list they create in this activity in Lesson 96: “ Assess Your Learning 6 .” Make a list of different ways the Lord might watch over and care for us. List as many as you can think of in two minutes. After the two minutes, you could invite them to look for additional ideas they could include from Mosiah 24:13–15 ; Doctrine and Covenants 8:2–3 ; 38:7 or other scripture passages you might suggest. You could also share the following statement from President Eyring. President Henry B. Eyring of the First Presidency taught the following about the Lord’s help: Like that servant of Elisha, there are more with you than those you can see opposed to you. Some who are with you will be invisible to your mortal eyes. The Lord will bear you up and will at times do it by calling others to stand with you. (“ O Ye That Embark ,” Ensign or Liahona , Nov. 2008, 58) Consider inviting groups to take turns sharing examples from their lists while you or volunteers write them on the board. You might allow groups to keep sharing until all unique ideas have been shared. Invite students to share examples they can think of from the scriptures when the Lord watched over or cared for someone in the ways listed on the board. As you discuss the following questions, you may choose to share when you have recognized God’s blessings or help in your life. What can make some of these blessings from the Lord harder to recognize than others? When has the Lord blessed or protected you, or someone you know, in one of these ways? What does this experience teach you about the Lord? Opening our eyes Consider concluding the lesson by displaying the following quote and instructions. Sister Michelle D. Craig, formerly of the Young Women General Presidency, explained what we can do if we struggle to see how God is working in our lives: 9:45 There may be times when you, like the servant, find yourself struggling to see how God is working in your life—times when you feel under siege—when the trials of mortality bring you to your knees. Wait and trust in God and in His timing, because you can trust His heart with all of yours. But there is a second lesson here. My dear sisters and brothers, you too can pray for the Lord to open your eyes to see things you would not normally see. (“ Eyes to See ,” Ensign or Liahona , Nov. 2020, 15) Consider answering the following question in your study journal: What did you learn today that helps you feel confident the Lord watches over and cares for you? Testify of the Lord’s love and of His ability to help students recognize His help in their lives.\n\n\n--- Lesson 86 ---\nHeavenly Father and Jesus Christ love us and will help us as we put our trust in Them. After the Assyrians conquered Samaria, they began attacking Judah. King Hezekiah and his people turned to the Lord for strength and protection. The Lord delivered them from the Assyrians. This lesson can help increase students’ trust that the Lord will help them face their challenges. Student preparation: Invite students to come to class prepared to share an experience when they felt God’s support during a challenging time. Possible Learning Activities During hard times Consider beginning class by writing the following words in the middle of the board: helpless , overwhelmed , discouraged , fearful , and doubtful . Then you could write one of the following questions on the left side of the board and the other question on the right side of the board. Students could write their answers to each question on the board. What are situations where a teenager might feel one or more of these emotions? Where might teenagers turn to for help when they experience these emotions? You could then invite students to think or write in their study journal about a current or future situation where they might feel similar emotions. Students will have an opportunity to refer back to these emotions later in the lesson. Reflect on the following questions as they relate to your own personal situation: When you experience these emotions, where do you turn for help? How confident are you that the Lord will help you when you turn to Him? Throughout the lesson today, think about how the Lord can help you when you experience these emotions now or in the future. Pay attention to the impressions that come to your mind and heart from the Holy Ghost. Hezekiah trusts the Lord Explain to students that this lesson will focus on how Hezekiah, the king of Judah, chose to turn to the Lord for help when he and his people faced great challenges. Read 2 Kings 18:1–7 , looking for what Hezekiah did when he became king. What did you find? What principles can we learn from verses 5–7 ? Help students identify principles such as: As we trust in the Lord and keep His commandments, He will be with us. Likening the scriptures to our lives Israel, the nation on Judah’s northern border, was conquered by Assyria. Then, the Assyrians attacked Hezekiah’s people and captured all the fortified cities in their kingdom (see 2 Kings 18:9–13 ). Assyrian messengers then came to Jerusalem, the capital of Judah, to deliver a warning to Hezekiah and his people. Look back at the emotions on the board. Which emotions do you think the people of Jerusalem might have been feeling? Consider using the handout “ An Example of Trusting the Lord ” to help students understand the principle they identified earlier and make connections between Hezekiah and their lives. Students could complete the handout in groups or partnerships. You could invite students to reorganize groups after completing each section of the handout, giving students opportunities to work with and get to know other members of the class. Open PDF Questions that help students find personal relevance to the scripture block can allow the Lord to teach and inspire them personally. The questions in the handout could help students relate the verses they studied to their own lives. For additional training on helping students find relevance in the scripture block, see: “ Help learners find personal relevance in the doctrine of Jesus Christ ” in Teacher Development Skills . The Lord is with us Read 2 Kings 19:32–35 , looking for how the Lord delivered Hezekiah and his people. What did you find? Consider inviting students to mark the phrase “For I will defend this city, to save it” in 2 Kings 19:34 . As needed, explain that the Lord’s deliverance will come in His time and way. To help students consider ways the Lord helps us face our challenges, you could show “Heavenly Father Knows Me” (3:18) and ask students to look for how Heavenly Father delivered this young woman from a challenge she faced. Then, invite students to share their own experiences. You might consider sharing a personal experience of trusting the Lord or how He has helped you during difficult times. 3:19 How have Heavenly Father and Jesus Christ supported you or someone you know during a difficult situation? You could also let students feel the power of a prophetic testimony of the Savior to end class. To do this, you could invite students to read Alma 36:3 or the following statement. President Dieter F. Uchtdorf, then of the First Presidency, testified of the power of trusting God. 19:11 Rather than dwelling on the immensity of our challenges, would it not be better to focus on the infinite greatness, goodness, and absolute power of our God, trusting Him and preparing with a joyful heart for the return of Jesus the Christ? As His covenant people, we need not be paralyzed by fear because bad things might happen. Instead, we can move forward with faith, courage, determination, and trust in God as we approach the challenges and opportunities ahead. (“ Perfect Love Casteth Out Fear ,” Ensign or Liahona , May 2017, 106) Encourage students to trust Heavenly Father and Jesus Christ during hard times.\n\n\n--- Lesson 87 ---\nHave you ever wondered how your life might be different if you didn’t have the scriptures? When the kingdom of Judah fell away from God, the “book of the law“ ( 2 Kings 22:8, 11 ) was disregarded and eventually lost in the temple. During Josiah’s renovation of the temple the high priest Hilkiah found the book of the law, which Josiah then read to the people. The scriptures helped King Josiah and his people turn back to the Lord. This lesson can help students turn to the Lord through personal scripture study. Student preparation: Invite students to review their personal scripture study goals and their efforts to read the assigned Old Testament chapters. Encourage them to continue working on their goals or to prayerfully make needed adjustments to be successful. Possible Learning Activities Life without scriptures Before class, consider placing a bookmark in a Bible at 2 Kings 22:8 . Hide the Bible in the classroom to use later in the lesson. Write the following incomplete question on the board: What would your life be like without ? Consider providing each student with a small piece of paper. Invite them to write down a common item or activity that could complete the question. For example, they could write words like shoes , toothbrushes , school , or sports . Place students in small groups. Invite them to discuss how they would answer the question if it were completed with the words they have written. When students have finished sharing, give them time to silently consider the following: Reflect on your personal experiences as you ponder the following questions: What would your life be like without the scriptures ? How has your recent study of the scriptures influenced your relationship with Heavenly Father and Jesus Christ? You might ask a few volunteers to share their responses. To add to the discussion, you could display the following statement. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles taught about our need for the scriptures. Those who either don’t have or ignore the recorded word of God eventually cease to believe in Him and forget the purpose of their existence. (“ The Blessing of Scripture ,” Ensign or Liahona , May 2010, 33) Later in the lesson, students will have an opportunity to identify and share scripture passages and reflect on their personal study goals. You might adjust portions of this lesson to allow sufficient time for the “Student sharing” and “Scripture study goals” sections. The influence of scriptures Over time, the scriptures had been lost, and the kingdom of Judah turned away from the Lord. Under the reign of kings Manasseh and Amon, the people engaged in idolatry and other wicked practices, including the sacrifice of children (see 2 Kings 21 ). After the death of Amon, his son, Josiah, was made king at the age of eight. Josiah was righteous. In the 18th year of his reign, Josiah arranged payment for workers to repair the temple in Jerusalem (see 2 Kings 22:1–7 ). If you hid a Bible before class, explain that there are lost scriptures somewhere in the classroom. Invite students to find them. Ask the student who finds the Bible to locate the bookmark. Then provide the following instructions: Read 2 Kings 22:8–13 , looking for what happened as the temple was being repaired. What did Hilkiah the high priest find? How did King Josiah respond after hearing the words of the book, or the scriptures? Josiah decided to read the book to all the people of Jerusalem (see 2 Kings 22:14–20 ; 23:1–2 ). You could help students visualize what they’ve read by watching “ Josiah and the Book of the Law ” (12:25) from time code 7:02 to 8:37. This video is available at ChurchofJesusChrist.org . 12:25 Read 2 Kings 23:1–3 , looking for the influence that reading the scriptures had on Josiah and his people. Consider marking what you find. What can we learn from these verses about the effect of scripture study in our lives? Among the insights students share, they might identify that studying the scriptures can help us turn to the Lord with all our hearts . This could be written on the board and referenced throughout the remainder of the lesson. To better understand this principle, students could complete the following with a partner. Each student could study one set of verses. Then partners could share with one another what they learned and discuss the accompanying questions. As Josiah and his people learned from the scriptures and turned to the Lord, they were inspired to make changes in their lives. Read your assigned verses, looking for the changes they made. Student 1 2 Kings 23:4, 24 . Why do you think the people needed to destroy all their idols to turn to the Lord with all their hearts? How can scripture study help us turn away from the evil influences in our lives? Student 2 2 Kings 23:21–22 . What religious practice did Josiah and his people follow again after reading the scriptures? How can scripture study help us remember the Savior and live His gospel? You could conclude the story of Josiah by watching “ Josiah and the Book of the Law“ from time code 8:37 to 10:20. 12:25 Student sharing This portion of the lesson is designed for personal reflection and sharing. Students can share how the scriptures have helped (or could help) them turn to the Lord. President Spencer W. Kimball (1895–1985) taught of the influence scripture study had on his life: I find that when I get casual in my relationships with divinity and when it seems that no divine ear is listening and no divine voice is speaking, that I am far, far away. If I immerse myself in the scriptures the distance narrows and the spirituality returns. ( Teachings of Presidents of the Church: Spencer W. Kimball [2006], 67) Identify a scripture passage that has helped (or could help) you turn to Heavenly Father and Jesus Christ. It could be from your personal or family scripture study or a previous seminary lesson, or it could be a doctrinal mastery passage. Prepare to share the following: How has this passage helped (or how could it help) you turn to Heavenly Father and Jesus Christ with all your heart? When students are ready to share, invite everyone to write their passages on the board around the truth that they identified earlier. Ask for multiple volunteers to read their passage and share their insights or experiences. If needed, you could also share passages that have helped you turn to the Lord. Consider pointing to passages on the board that haven’t been shared. You might ask if the students who wrote them would be willing to share. Or you might invite the class to read the passage and discuss how it could help us turn to the Lord. As students are sharing, you might ask follow-up questions to encourage class discussion. For example, you might ask, “Has anyone else had an experience with that passage? Would you be willing to share?” or “What thoughts and feelings have you had as you’ve listened to each other?” Scripture study goals Consider sharing your witness that your students can have a similar experience as Josiah did as he studied the scriptures (see 2 Kings 23:25 ). Invite students to review their goals for personal scripture study and their progress in reading the assigned chapters of the Old Testament. Give them time to reflect on the following questions: Do you feel your current scripture study goal is helping you fully turn to the Heavenly Father and Jesus Christ? If so, how have you seen this happen? If not, what adjustments will you make? What meaningful experiences have you had with reading the assigned Old Testament chapters? What will you do to ensure you complete the assigned readings? Encourage students to continue their efforts to study the scriptures daily.\n\n\n--- Lesson 88 ---\nProphets and others often speak about the gathering of Israel. To understand the gathering, it can help to understand why Israel was scattered in the first place. This lesson can help students use the scattering of Israel to identify attributes of Heavenly Father and Jesus Christ. Student preparation: Invite students to read Thoughts to Keep in Mind: “Jesus Will Say to All Israel, ‘Come Home’” from Come, Follow Me—For Home and Church: Old Testament 2026 . Ask them to come prepared to share thoughts or questions about the scattering of Israel. Possible Learning Activities The scattering of Israel Before class, you might want to label different areas in classroom as Northern Kingdom (Israel) , Southern Kingdom (Judah) , Assyria , the Americas , and Babylon/Persia . How and when might disciplining a child be a sign of love from their parent? Read Doctrine and Covenants 95:1 , looking for how Heavenly Father and Jesus Christ feel about people They need to correct or chasten. Several times in the Old Testament, Israel rebelled against Heavenly Father and Jesus Christ and needed correction. This resulted in what is called the scattering of Israel. As you study the scattering of Israel, look for how Heavenly Father and Jesus Christ demonstrated their love. Throughout the next two sections of the lesson, students will move around the classroom to understand how Israel was scattered. Divide students evenly into two groups. Have one group move near the area of the classroom labeled Northern Kingdom (Israel) , and the other group near the Southern Kingdom (Judah) . Rather than have students move around the classroom, you could display the graphic “ The Kingdoms of Israel and Judah at a Glance .” Students could read the same verses and discuss the same questions from the lesson, but simply follow along with this graphic. Northern Kingdom of Israel In about 975 BC, after Solomon died, his son Rehoboam became king. Rehoboam imposed great burdens on the people. Ten of the tribes rebelled against Rehoboam and followed Jeroboam (see 1 Kings 12:6–11, 19–20 ). This separation created the Northern and Southern Kingdoms. Read 2 Kings 17:7–18, 22–23 , looking for what happened to the Northern Kingdom of Israel. What happened to them and why did it happen? Explain that when Assyria conquered the Northern Kingdom of Israel and took many of the Israelites back to Assyria, this began the scattering of Israel. Ask most of the students standing near the Northern Kingdom (Israel) to move to the part of the room labeled Assyria . Point out that we often call these tribes the lost tribes of Israel. You could give the students that moved to Assyria a label that says Lost Tribes . You could give the students who remain in Israel a label that says Samaritans . You might want to explain that the Samaritans were part Israelite and part Gentile (see Guide to the Scriptures, “ Samaritans ,” Gospel Library). How would you summarize why Israel was scattered? Students might identify a truth like: Because Israel rejected the prophets and broke their covenant with the Lord, He scattered them among the nations. Southern Kingdom of Judah What have you learned so far about the Southern Kingdom of Judah, including the kings who have reigned there? Invite students to share any accounts they remember. For example, they might bring up King Hezekiah or King Josiah. If they do, you could create a label for each king and have students hold them up. Encourage students to share how the Lord blessed these kings and the people for their faith in Him. Both of these righteous kings reigned after Assyria conquered the Kingdom of Israel. Students might also mention Lehi and his family. If they do, invite them to share what they know. If they don’t, you could have them do the following. You could create a label for Lehi and his family for a few students to hold. Read 1 Nephi 1:4 , looking for who else lived in the Kingdom of Judah. Read 1 Nephi 2:1–4 ; 18:22–23 , looking for what happened to this family. What blessings from Heavenly Father have we received because the Lord led Lehi and his family away from Jerusalem as part of the scattering? Ask the students holding the Lehi and his family label to move from the Kingdom of Judah to the section of the class labeled The Americas . Read 2 Chronicles 36:17–20 , looking for what Nebuchadnezzar, the king of Babylon, did to the inhabitants of Jerusalem shortly after Lehi and his family left. Ask the remaining students in Kingdom of Judah to move to the area of the classroom representing Babylon/Persia . Approximately between 605 and 587 BC, the Babylonians carried away many Jews to Babylon and besieged and eventually destroyed Jerusalem (see 2 Kings 24:8–16 ; 25:1–12, 21 ; Jeremiah 52 ). You might want to ask students to name a few individuals who ended up in Babylon. If they need help, you could hand a few students labels such as Daniel , Shadrach , Meshach , Abed-nego (see Daniel 1:1–7 ), and Ezekiel (see Guide to the Scriptures, “ Ezekiel ,” Gospel Library). Read the following summary. Explain that some Jews remained in Persia (see Esther 2:5–7 ). Ask some students in Babylon/Persia to return to the area of the classroom representing Kingdom of Judah . You could create labels for Ezra and Nehemiah for a couple students to carry who move to Kingdom of Judah . Students will learn more about Ezra and Nehemiah later. Under King Cyrus the Persians conquered Babylon. Around 537 BC, the Lord inspired King Cyrus of Persia to permit the Jews to return to Jerusalem and rebuild the temple (see 2 Chronicles 36:22–23 ; Jeremiah 29:10–14 ; Ezra 1:1–3 ). In the years that followed, Ezra, Nehemiah, and others returned to Jerusalem to help rebuild the city and complete the temple (see Ezra 7:6–8 ; Nehemiah 2:1–11 ). Heavenly Father’s children are never lost to Him You might want to point out that many of these groups did not know what was happening to the other groups. From their perspective, the other groups were lost. Read 3 Nephi 17:4 , looking for what the Savior shared with the Nephites during His ministry among them. What stands out to you in this verse? You might point out that although Israel was scattered, the Lord used the scattering of His covenant people to bless the nations they were scattered to (see “ The scattering of Israel ” under Guide to the Scriptures, “ Israel ,” Gospel Library). You may want to point out that “kindness” in Isaiah 54:8 is a translation of hesed . For more on the significance of hesed see President Nelson’s article “ Everlasting Covenant ,” Liahona , Oct. 2022, 5–6. Read Deuteronomy 4:27–31 and Isaiah 54:7–10 , looking for what the Lord promised to do for scattered Israel. What attributes do you see in Heavenly Father and Jesus Christ as you learn about the scattering of Israel? Consider sharing your testimony of Heavenly Father’s love for all His children and of His promise to gather scattered Israel.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "2 ;26;30",
      "content": "The Kingdom of Judah was surrounded. Armies from three powerful enemy nations were all advancing at once, prepared for battle. In this desperate moment of need, Jehoshaphat, King of Judah, turned to the King of heaven and earth. Jehoshaphat gathered his people at the temple and prayed. He acknowledged their human weakness and pleaded for deliverance. In response, the Lord promised His protection: “Fear not, nor be dismayed” (\n2 Chronicles 20:17\n).\nWe might not have an invading army at our doorstep threatening to destroy us, but sometimes we do feel surrounded by adversity and evil. Our path to deliverance is the same one Jehoshaphat sought, and our prayer can be like his too: “O our God, … we have no might against this great company that cometh against us; neither know we what to do: but our eyes are upon thee” (\n2 Chronicles 20:12\n).\nIn\n2 Chronicles 14–30\n, you will read about Jehoshaphat and other kings in Judah. Consider how their faith-driven reforms, victories, and challenges can apply to your own life.\nFor an overview of the book of 2 Chronicles, see “\nChronicles\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n2 Chronicles 14–16\nTrusting in God will bring me peace.\nWhen Asa was the king of Judah, he faced many challenges—just like we all do today. As you read about the trials he faced, notice where he put his trust and how that changed over time.\nReference\nChallenges Asa faced\nWhere Asa put his trust\nReference\n2 Chronicles 14:9–12\nReference\n2 Chronicles 15:1–8\nReference\n2 Chronicles 16:1–10\nWhy do we sometimes stop trusting the Lord? What else do you learn from Asa’s life?\nSee also Elder D. Todd Christofferson, “\nOur Relationship with God\n,”\nLiahona\n, May 2022, 78–80.\n2 Chronicles 18\nI can defend the truth, even when it’s unpopular.\nThe prophet Micaiah must have felt a lot of pressure to predict success for the kings Jehoshaphat and Ahab in their war against Syria. Look for evidence of that pressure in\n2 Chronicles 18:1–12\n. What evidence do you find of Micaiah’s courage and integrity in\nverses 13–27\n? (Note that in\nverse 14\n, Micaiah gives a sarcastic response; his real answer is in\nverse 16\n.) How are Micaiah’s words fulfilled in\nverses 28–34\n?\nWhat are some situations in which you might face pressure like Micaiah faced? What gives you courage to stand up for the Lord and His teachings?\nIn the days of King Jehoshaphat, three nations attacked Jerusalem.\n2 Chronicles 20:1–25\nIn difficult times, I can turn to God and His prophets.\nAs you read\n2 Chronicles 20:1–12\n, look for what King Jehoshaphat did when multiple nations came to attack Judah. How could you apply his actions in the challenging circumstances you face?\nThe Lord’s response to Jehoshaphat’s prayer is found in\nverses 14–17\n. What phrases do you find there that could comfort you or someone you know during difficult times?\nThe following day, the people of Jerusalem went out to meet the opposing army. As you read\n2 Chronicles 20:20\n, look for the message Jehoshaphat gave to the people of Jerusalem. How were his words fulfilled? (see\nverses 22–23\n). How has God blessed you for believing in Him and following His prophets?\nPresident Russell M. Nelson said: “My experience is that once you stop putting question marks behind the prophet’s statements and put exclamation points instead, and\ndo it\n, the blessings just pour. I never ask myself, ‘When does the prophet speak as a prophet and when does he not?’ My interest has been, ‘How can I be more like him?’” (in Lane Johnson, “\nRussell M. Nelson: A Study in Obedience\n,”\nEnsign\n, Aug. 1982, 24).\nSee also\nDoctrine and Covenants 21:4–6\n; “A Secure Anchor” (video), Gospel Library; “\nMake inspired choices\n,”\nFor the Strength of Youth: A Guide for Making Choices\n(2022), 4–5.\n3:37\nA Secure Anchor\nIdentify simple statements of truth.\nElder Neal A. Maxwell taught: “The scriptures offer us so many doctrinal diamonds. And when the light of the Spirit plays upon their several facets, they sparkle with celestial sense and illuminate the path we are to follow” (“\nAccording to the Desire of [Our] Hearts\n,”\nEnsign\n, Nov. 1996, 21). As you study the scriptures, consider taking time to identify, mark, and ponder short yet powerful messages. Some examples can be found in\n2 Chronicles 14:11\n;\n15:7\n;\n18:13\n;\n20:15\n;\n26:5\n. What other “doctrinal diamonds” can you find?\n2 Chronicles 26:3–21\nPride leads to destruction.\nAs with many other kings of Judah, Uzziah’s reign began with great accomplishments but ended with tragedy. Look for this pattern in\n2 Chronicles 26\n. What would you say was the turning point in Uzziah’s life?\nAs you read\nverses 16–23\n, keep in mind that at this time, only priests were allowed to burn incense in the temple. Why do you think King Uzziah disobeyed God? What do you learn from this tragic experience?\nSee also “\nBe Thou Humble\n,”\nHymns\n, no. 130.\n2 Chronicles 30\nI can be a peacemaker.\nIn\n2 Chronicles 30\n, Hezekiah was the king of Judah. He invited the rival Kingdom of Israel to gather in Jerusalem to celebrate Passover—something the Israelites hadn’t been able to do for many years (see\nverses 1–12\n). What impresses you about the invitation and how it was received—both by the Israelite guests and by their hosts in Judah?\nBecause it had been so long, some visitors to Jerusalem were not familiar with the details of how to participate in Passover. As you read\n2 Chronicles 30:18–27\n, what do you learn from Hezekiah’s response and the results of his response?\nSee also Russell M. Nelson, “\nPeacemakers Needed\n,”\nLiahona\n, May 2023, 98–101.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n2 Chronicles 14–16\n;\n20\nI can trust God.\nTo introduce the idea of trusting the Lord, you might show your children something you trust to keep you dry when it rains, like an umbrella or jacket. Let them talk about why we can trust these things. Then help them compare that to our trust in the Lord. Why do we trust Him to keep us safe spiritually?\nYou could help your children discover how King Asa and King Jehoshaphat responded to challenges by trusting in the Lord (see\n2 Chronicles 14:11\n;\n20:3–5, 12\n). Share with each other ways you can show the Lord that you trust Him.\n2 Chronicles 20:1–29\nGod will hear and answer my prayers.\nThis week’s activity page can help your children understand the story of Jehoshaphat’s prayer and the Lord’s answer. You and your children could share times when God heard and answered your prayers. Consider including times when the answers came in ways or at times that you didn’t expect. A song about prayer, such as “\nI Pray in Faith\n” (\nChildren’s Songbook\n, 14), could help build your children’s faith.\n2 Chronicles 26:3–23\nI can be humble.\nTo learn about the dangers of pride, your children could build a tower with blocks or small cups. As they place each block or cup on the tower, help them identify one of Uzziah’s accomplishments from\n2 Chronicles 26:3–15\n. After they finish the tower, discuss with your children how Uzziah could keep it tall and strong. What could make it fall? Then, as you read\nverse 16\n, you could talk about what it means to have our hearts “lifted up to [our] destruction.” Share with your children what happened to Uzziah in\nverses 16–23\n. Let them knock down their tower. Talk about what we can do to stay humble.\nKing Hezekiah and the People Thank God\n, © Lifeway Collection/licensed from goodsalt.com\n2 Chronicles 30\nI can be a peacemaker.\nThe picture above shows when Hezekiah invited Judah’s neighbors from the Kingdom of Israel to celebrate Passover with them. You could look at this image with your children and read\n2 Chronicles 30:18–19\n, which explains that some of the guests had not washed themselves according to the law of Moses. What did Hezekiah do? How would this have made the guests feel? Help your children think of how they can be like Hezekiah in the way they treat others.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 30: Lesson 83: Lesson 83—2 Kings 2–4This lesson can help students understand that the Lord gives authority to the people He calls and power to those who serve righteously.; Lesson 84: Lesson 84—2 Kings 5This lesson can help students obey the small and simple things the Lord asks us to do....",
      "content": "\n--- Lesson 83 ---\nWhen we accept callings in the Lord’s Church, we receive His authority to serve. When we strive to diligently serve and become more like Him, He will bless us with His power. The account of the Lord blessing the prophet Elisha with power and authority after taking Elijah into heaven illustrates this truth. This lesson can help students understand that the Lord gives authority to the people He calls and power to those who serve righteously. Student preparation: Invite students to think about a time when they or someone they know has served in a Church calling. Invite students to ponder the question, “When have I witnessed the Lord’s power and authority in fulfilling Church callings?” Possible Learning Activities The source of power and authority Consider beginning class by discussing where authority to do certain things comes from. You might do this by showing an image of a doctor wearing a medical coat or in a medical setting (or another professional with authority to act in their position) and asking the following questions. What are some of this person’s responsibilities? Who gave them authority to fulfill their role? What gives you confidence to trust them? Consider showing an image of the current prophet and asking the previous questions again about him. To help students assess what they understand about serving with the Lord’s power and authority in callings, you could invite them to do the following. In your study journal or Notes section in Gospel Library, answer the following questions. As you consider your answers, listen for impressions from the Holy Ghost about what the Lord wants you to understand about serving with the Lord’s power and authority in callings. What do I understand about receiving the Lord’s power and authority to serve in callings? How could this understanding influence how I respond when I or someone else receives a calling from the Lord? Elisha receives God’s power and authority You might explain that the Lord revealed to Elijah that Elisha would become a prophet (see 1 Kings 19:16, 19 ). What concerns might Elisha have felt as he prepared for his calling from the Lord? Elisha knew that the Lord would soon take Elijah away ( 2 Kings 2:1–3 ). On Elijah’s final day, Elisha followed Elijah from city to city until the two arrived at the Jordan River. To help students discover what happened at the Jordan River, you could organize the class into small groups. On the board, you could draw the four images below or summarize each in a few words in random order. Invite each group to read 2 Kings 2:8–15 and organize the images or summary of the events in chronological order. You might need to explain that a mantle is a cloak. How did the Lord show Elisha and others that He had given Elisha power and authority in his calling? You might explain that the mantle used by Elijah and Elisha did not give them power and authority but represented God’s power and authority. In the Church today, we sometimes refer to someone’s calling or authority as their “mantle.” For example, when a new prophet is sustained as President of the Church, he receives the mantle of authority. It also might be helpful to point out that the authority to serve in callings comes from the Lord through the men who hold priesthood keys. What truth can we learn from Elisha’s experience about what the Lord does for people He calls to serve Him? Among truths students may offer, point out that the Lord gives authority and power to people whom He calls . Serving with God’s power and authority To help students understand what it means to serve in callings with the Lord’s power and authority, you could write Priesthood Authority and Priesthood Power on the board. Share the following statement from Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ . While this statement applies directly to missionary callings, remind students that the Lord gives authority to the people He calls to serve in any calling and power to those who serve Him righteously. Under Christ’s direction, the authority to preach the gospel was restored through the Prophet Joseph Smith. When you are set apart as a missionary, you received this authority. With it comes the right, privilege, and responsibility to represent the Lord and teach His gospel. … In addition to authority, you need spiritual power to fulfill your calling. God gives spiritual power as you consistently work to strengthen your testimony of Him, Jesus Christ, and the gospel truths you teach. He bestows spiritual power as you pray, study the scriptures, and seek to fulfill your missionary purpose. He grants spiritual power as you strive to keep His commandments and the covenants you made when you received the ordinances of salvation (see Doctrine and Covenants 35:24 ). ( Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ , [2023], 3) What do you learn about the Lord’s power and authority from these statements? Why might this be helpful to remember when you receive a calling from Heavenly Father and Jesus Christ? Why might this be helpful to remember when you sustain others who receive callings? As students discuss what they learned about priesthood authority and power, you could list what they share under each heading on the board. As part of this discussion, you may point out that God gives priesthood authority to someone when they are set apart in a calling. Priesthood power comes from God as someone strives to keep the commandments and act according to righteous principles (see Doctrine and Covenants 121:34–46 ). Consider showing the video “ Jesus Calls Twelve Apostles to Preach and Bless Others ” (1:38), available at ChurchofJesusChrist.org . As students watch the video, have them think about how Heavenly Father and Jesus Christ manifest Their love by giving Their authority and power to Their servants on earth. 1:39 Following the video, invite a few students to share their thoughts. Demonstrate understanding To help students summarize what they learned, consider organizing the class into pairs for the following activity. Choose one or more of the following situations and discuss what you have learned today that could help the person with their concerns about a calling. In each response, include scriptures, statements from Church leaders, or insights you have received from the Spirit as you’ve studied the story of Elisha’s call to serve. A new bishop is called and sustained. His son knows that he is not perfect. A new Young Women president is called to serve. A young woman had a great relationship with the previous president and doesn’t know the new one at all. A young man or young woman is called to serve as the president of their quorum or class. They do not feel they know enough to fulfill this calling well. A missionary is called to serve in a country where the people speak a different language. They are concerned about how effective they will really be in sharing the gospel. Think of a way to have students share their responses with each other. One way is to have each pair share with a different group. After everyone has a chance to share, you could invite students to share what they really liked about the other group’s response. To conclude, you might testify of truths you have discussed today.\n\n\n--- Lesson 84 ---\nSometimes we may not recognize the spiritual value of doing the small things Heavenly Father and Jesus Christ invite us to do. In 2 Kings 5 , the Lord healed Naaman, a Syrian captain, of his leprosy because he followed the prophet’s simple counsel to wash himself seven times in the Jordan River. This lesson can help students obey the small and simple things the Lord asks us to do. Student preparation: Invite students to read Alma 37:6–7 , looking for what they can learn about small and simple things. Or you could encourage students to pay attention to small things they do often that make a big difference in their life or that affect their relationship with Heavenly Father and Jesus Christ. Possible Learning Activities Drip irrigation Consider displaying an image like the following or bringing a plant to class and demonstrating how drip irrigation works. The information in the next paragraph could help you explain it. Drip irrigation is a technique used to water plants. Unlike other forms of irrigation that apply large amounts of water infrequently, drip irrigation involves slowly dripping small amounts of water onto the soil. The steady drips of water keep the soil moist where it is most useful to the plants. Consider placing students into small groups to discuss answers to the following question. In what ways could the principles of drip irrigation apply to our spiritual progress in Heavenly Father’s plan? Invite a few groups to share what they discussed. Then consider displaying the self-assessment below and inviting students to think about how accurate it is in their life. Take a moment to reflect on the small efforts you are making as a disciple of Jesus Christ and the results you are experiencing. Then ponder the truthfulness of this statement for you: I recognize how the small and simple things I do, or don’t do, affect my life and my relationship with Heavenly Father and Jesus Christ. Invite students to be receptive to thoughts and feelings they receive from the Holy Ghost about small and simple things they can do to strengthen their relationship with Heavenly Father and Jesus Christ. Naaman healed of his leprosy 2 Kings 5 contains the account of Naaman, a Syrian captain who learned a powerful lesson about doing the small and simple things the Lord commands. Read 2 Kings 5:1 , looking for everything you can learn about Naaman. What did you find? You may want to explain that leprosy was a terrible skin disease. It may have caused Naaman to develop disfiguring sores and could have resulted in death. As an alternative to students simply reading the following verses, you could label three parts of your classroom as “Syria,” “Elisha’s house,” and “Jordan River.” Invite four volunteers to represent the following people by reading aloud the accompanying verses in the designated places. Students representing Naaman and his servant could move from place to place, while the little maid and Elisha’s messenger remain in their location. Syria: The little maid read verses 2–4 Elisha’s house: Elisha’s messenger read verses 9–10 Elisha’s house: Naaman read verses 11–12 Jordan River: Naaman’s servant read verses 13–14 Read 2 Kings 5:2–4, 9–14 , looking for what Elisha, as a prophet of God, told Naaman to do to be healed of his leprosy. What are some important lessons a teenager today could learn from Naaman’s experience? Students may state a truth like obedience to the Lord’s small and simple invitations brings great blessings . You might invite them to write this truth as a note next to 2 Kings 5:13–14 in their scriptures and mark the phrases in these verses that teach this truth. Making notes in their scriptures can help students remember truths they learn. You could also invite students to read Alma 37:6–7 , and link or cross-reference these verses to 2 Kings 5:13–14 . Small and simple things The following activity is designed to help students identify small and simple things Heavenly Father and Jesus Christ have asked us to do and to discuss how we can be blessed by doing them. One way this activity could be done is by placing students in small groups and giving each group a piece of paper and scissors. Invite each group to draw and cut out three large water drops. For step 1 below, groups could write a different small and simple thing that the Lord has invited us to do on each droplet, then place them on the board. Make a list of small and simple things the Lord has asked us to do that can lead to great blessings. If needed, the following statement could help groups identify small and simple things the Lord has asked us to do as well as ways we are blessed by doing them. President Dallin H. Oaks of the First Presidency shared some examples of small and simple things the Lord has invited us to do. 17:36 Consider the scripture study we’ve been taught to incorporate into our daily lives. Or consider the personal prayers and the kneeling family prayers that are regular practices for faithful Latter-day Saints. Consider attendance at seminary for youth or institute classes for young adults. Though each of these practices may seem to be small and simple, over time they result in powerful spiritual uplift and growth. This occurs because each of these small and simple things invites the companionship of the Holy Ghost, the Testifier who enlightens us and guides us into truth. (“ Small and Simple Things ,” Ensign or Liahona , May 2018, 90) Before completing the following step, invite each group to select one drop that a different group placed on the board. Search the scriptures and words of the prophets, looking for the great blessings the Lord offers if we do this small and simple thing. Invite multiple groups to share what they learned. As part of this discussion, you might invite students to reflect on experiences they have had doing small and simple things. You could then invite volunteers to share how the Lord has blessed them and how their relationship with Heavenly Father and Jesus Christ was strengthened as a result. The previous prompt can help students verbalize their feelings, experiences, and testimonies. You might also share your testimony or experiences with doing small and simple things the Lord asks of us. For additional training, see: “ Bear testimony often and invite learners to share their feelings, experiences, and testimonies ” in Teacher Development Skills . You could also watch “ Abide the Day in Christ ” ( ChurchofJesusChrist.org ) from time code 2:30 to 4:23. Students could identify how Sister Amy A. Wright, First Counselor in the Primary General Presidency, and her family were strengthened through the small and simple things they had done. 10:33 You could also have students read 2 Kings 5:15 to see the blessing of testimony Naaman received through his obedience to the small and simple thing the prophet invited him to do. Small and simple things in my life To help students make a plan to obey the small and simple things the Lord has asked them to do, display the following instructions. Respond to the following in your study journal: Think of a small and simple thing the Lord has asked you to do that you feel you are already doing well. How has obeying the Lord’s instruction strengthened your relationship with Heavenly Father and Jesus Christ? Select a small and simple thing the Lord has asked you to do that you feel inspired to do better. What will you do to improve your obedience to the Lord’s invitation? How could that strengthen your faith in Heavenly Father and Jesus Christ? You could invite a few willing students to share their response to the first question. Encourage students to follow through on their plan to improve.\n\n\n--- Lesson 85 ---\nWhen surrounded by the Syrian army, the prophet Elisha’s servant cried out in fear, “how shall we do?” ( 2 Kings 6:15 ). Elisha comforted his servant by helping him recognize the Lord’s help. We likewise can be comforted as we learn to recognize the Lord’s help. This lesson can help students feel increased confidence in the Lord’s constant and watchful care. Student preparation: Invite students to prepare to share an experience when the Lord blessed or protected them or someone they know. Possible Learning Activities Recognizing the Savior’s care To begin your lesson, consider drawing a stick figure in the center of the board. The scriptures are filled with the Savior’s promises for His people who strive to serve Him. To visualize one of these promises, draw a stick figure on the center of a page in your study journal and label it Me. Then, read Doctrine and Covenants 84:88 , and draw around your stick figure how you visualize the Lord’s promises. You could invite a student to add to the drawing on the board what they drew in their journal, explaining why they drew what they did. Other students could be invited to add anything different they may have drawn. Alternatively, students could share and explain their drawings with a neighbor. How do you think it might affect someone if they were able to recognize these promises occurring in their life? Why can it be difficult to see or recognize the Lord’s blessings and protection in our lives? It may be helpful to testify that Heavenly Father and the Savior are actively involved in each student’s life. Ponder how well you recognize Heavenly Father and Jesus Christ’s involvement in your life. Then respond to the following questions in your study journal: Can you recognize at least one way Heavenly Father and Jesus Christ are blessing or protecting you? If so, how are They doing it? What is a situation you are facing in your life where it could help you to better recognize Their blessings and protection? As you study 2 Kings 6 , invite the Holy Ghost to help you recognize ways Heavenly Father and Jesus Christ are blessing and protecting you. Divine help Consider explaining the following information to help students understand the context of 2 Kings 6 . During a time of war between Israel and Syria, the king of Syria privately discussed his battle plans with his servants. However, the Lord repeatedly revealed Syria’s plans to the prophet Elisha, who would then warn the king of Israel. When the king of Syria discovered this, he sent an army to capture Elisha (see 2 Kings 6:8–13 ). Choose an effective way for students to study the following verses to help them identify converting principles. For example, it may be helpful for students to study from the perspective of Elisha’s servant. They could occasionally pause and think about how they would feel if they were in his place. Students could also read as a class or in small groups, with different students reading the parts for Elisha, Elisha’s servant, and the king of Israel. It may be helpful to explain that Samaria was the capital city of the kingdom of Israel. Read 2 Kings 6:14–23 , looking for ways the Lord blessed and protected Elisha and his servant. What impressed you from the story? What truths from this story could be relevant to us today? Consider sharing the following truth if students did not already share a similar truth in their own words: The Lord can help us recognize His blessings and protection in our lives. How do you think recognizing the Lord’s blessings and protection affected Elisha and his servant? Recognizing the Lord’s blessings and protection To help students recognize some ways the Lord can bless and protect them, you could organize them into pairs or small groups for the following activity. Note: Students will be given an opportunity to reflect on the list they create in this activity in Lesson 96: “ Assess Your Learning 6 .” Make a list of different ways the Lord might watch over and care for us. List as many as you can think of in two minutes. After the two minutes, you could invite them to look for additional ideas they could include from Mosiah 24:13–15 ; Doctrine and Covenants 8:2–3 ; 38:7 or other scripture passages you might suggest. You could also share the following statement from President Eyring. President Henry B. Eyring of the First Presidency taught the following about the Lord’s help: Like that servant of Elisha, there are more with you than those you can see opposed to you. Some who are with you will be invisible to your mortal eyes. The Lord will bear you up and will at times do it by calling others to stand with you. (“ O Ye That Embark ,” Ensign or Liahona , Nov. 2008, 58) Consider inviting groups to take turns sharing examples from their lists while you or volunteers write them on the board. You might allow groups to keep sharing until all unique ideas have been shared. Invite students to share examples they can think of from the scriptures when the Lord watched over or cared for someone in the ways listed on the board. As you discuss the following questions, you may choose to share when you have recognized God’s blessings or help in your life. What can make some of these blessings from the Lord harder to recognize than others? When has the Lord blessed or protected you, or someone you know, in one of these ways? What does this experience teach you about the Lord? Opening our eyes Consider concluding the lesson by displaying the following quote and instructions. Sister Michelle D. Craig, formerly of the Young Women General Presidency, explained what we can do if we struggle to see how God is working in our lives: 9:45 There may be times when you, like the servant, find yourself struggling to see how God is working in your life—times when you feel under siege—when the trials of mortality bring you to your knees. Wait and trust in God and in His timing, because you can trust His heart with all of yours. But there is a second lesson here. My dear sisters and brothers, you too can pray for the Lord to open your eyes to see things you would not normally see. (“ Eyes to See ,” Ensign or Liahona , Nov. 2020, 15) Consider answering the following question in your study journal: What did you learn today that helps you feel confident the Lord watches over and cares for you? Testify of the Lord’s love and of His ability to help students recognize His help in their lives.\n\n\n--- Lesson 86 ---\nHeavenly Father and Jesus Christ love us and will help us as we put our trust in Them. After the Assyrians conquered Samaria, they began attacking Judah. King Hezekiah and his people turned to the Lord for strength and protection. The Lord delivered them from the Assyrians. This lesson can help increase students’ trust that the Lord will help them face their challenges. Student preparation: Invite students to come to class prepared to share an experience when they felt God’s support during a challenging time. Possible Learning Activities During hard times Consider beginning class by writing the following words in the middle of the board: helpless , overwhelmed , discouraged , fearful , and doubtful . Then you could write one of the following questions on the left side of the board and the other question on the right side of the board. Students could write their answers to each question on the board. What are situations where a teenager might feel one or more of these emotions? Where might teenagers turn to for help when they experience these emotions? You could then invite students to think or write in their study journal about a current or future situation where they might feel similar emotions. Students will have an opportunity to refer back to these emotions later in the lesson. Reflect on the following questions as they relate to your own personal situation: When you experience these emotions, where do you turn for help? How confident are you that the Lord will help you when you turn to Him? Throughout the lesson today, think about how the Lord can help you when you experience these emotions now or in the future. Pay attention to the impressions that come to your mind and heart from the Holy Ghost. Hezekiah trusts the Lord Explain to students that this lesson will focus on how Hezekiah, the king of Judah, chose to turn to the Lord for help when he and his people faced great challenges. Read 2 Kings 18:1–7 , looking for what Hezekiah did when he became king. What did you find? What principles can we learn from verses 5–7 ? Help students identify principles such as: As we trust in the Lord and keep His commandments, He will be with us. Likening the scriptures to our lives Israel, the nation on Judah’s northern border, was conquered by Assyria. Then, the Assyrians attacked Hezekiah’s people and captured all the fortified cities in their kingdom (see 2 Kings 18:9–13 ). Assyrian messengers then came to Jerusalem, the capital of Judah, to deliver a warning to Hezekiah and his people. Look back at the emotions on the board. Which emotions do you think the people of Jerusalem might have been feeling? Consider using the handout “ An Example of Trusting the Lord ” to help students understand the principle they identified earlier and make connections between Hezekiah and their lives. Students could complete the handout in groups or partnerships. You could invite students to reorganize groups after completing each section of the handout, giving students opportunities to work with and get to know other members of the class. Open PDF Questions that help students find personal relevance to the scripture block can allow the Lord to teach and inspire them personally. The questions in the handout could help students relate the verses they studied to their own lives. For additional training on helping students find relevance in the scripture block, see: “ Help learners find personal relevance in the doctrine of Jesus Christ ” in Teacher Development Skills . The Lord is with us Read 2 Kings 19:32–35 , looking for how the Lord delivered Hezekiah and his people. What did you find? Consider inviting students to mark the phrase “For I will defend this city, to save it” in 2 Kings 19:34 . As needed, explain that the Lord’s deliverance will come in His time and way. To help students consider ways the Lord helps us face our challenges, you could show “Heavenly Father Knows Me” (3:18) and ask students to look for how Heavenly Father delivered this young woman from a challenge she faced. Then, invite students to share their own experiences. You might consider sharing a personal experience of trusting the Lord or how He has helped you during difficult times. 3:19 How have Heavenly Father and Jesus Christ supported you or someone you know during a difficult situation? You could also let students feel the power of a prophetic testimony of the Savior to end class. To do this, you could invite students to read Alma 36:3 or the following statement. President Dieter F. Uchtdorf, then of the First Presidency, testified of the power of trusting God. 19:11 Rather than dwelling on the immensity of our challenges, would it not be better to focus on the infinite greatness, goodness, and absolute power of our God, trusting Him and preparing with a joyful heart for the return of Jesus the Christ? As His covenant people, we need not be paralyzed by fear because bad things might happen. Instead, we can move forward with faith, courage, determination, and trust in God as we approach the challenges and opportunities ahead. (“ Perfect Love Casteth Out Fear ,” Ensign or Liahona , May 2017, 106) Encourage students to trust Heavenly Father and Jesus Christ during hard times.\n\n\n--- Lesson 87 ---\nHave you ever wondered how your life might be different if you didn’t have the scriptures? When the kingdom of Judah fell away from God, the “book of the law“ ( 2 Kings 22:8, 11 ) was disregarded and eventually lost in the temple. During Josiah’s renovation of the temple the high priest Hilkiah found the book of the law, which Josiah then read to the people. The scriptures helped King Josiah and his people turn back to the Lord. This lesson can help students turn to the Lord through personal scripture study. Student preparation: Invite students to review their personal scripture study goals and their efforts to read the assigned Old Testament chapters. Encourage them to continue working on their goals or to prayerfully make needed adjustments to be successful. Possible Learning Activities Life without scriptures Before class, consider placing a bookmark in a Bible at 2 Kings 22:8 . Hide the Bible in the classroom to use later in the lesson. Write the following incomplete question on the board: What would your life be like without ? Consider providing each student with a small piece of paper. Invite them to write down a common item or activity that could complete the question. For example, they could write words like shoes , toothbrushes , school , or sports . Place students in small groups. Invite them to discuss how they would answer the question if it were completed with the words they have written. When students have finished sharing, give them time to silently consider the following: Reflect on your personal experiences as you ponder the following questions: What would your life be like without the scriptures ? How has your recent study of the scriptures influenced your relationship with Heavenly Father and Jesus Christ? You might ask a few volunteers to share their responses. To add to the discussion, you could display the following statement. Elder D. Todd Christofferson of the Quorum of the Twelve Apostles taught about our need for the scriptures. Those who either don’t have or ignore the recorded word of God eventually cease to believe in Him and forget the purpose of their existence. (“ The Blessing of Scripture ,” Ensign or Liahona , May 2010, 33) Later in the lesson, students will have an opportunity to identify and share scripture passages and reflect on their personal study goals. You might adjust portions of this lesson to allow sufficient time for the “Student sharing” and “Scripture study goals” sections. The influence of scriptures Over time, the scriptures had been lost, and the kingdom of Judah turned away from the Lord. Under the reign of kings Manasseh and Amon, the people engaged in idolatry and other wicked practices, including the sacrifice of children (see 2 Kings 21 ). After the death of Amon, his son, Josiah, was made king at the age of eight. Josiah was righteous. In the 18th year of his reign, Josiah arranged payment for workers to repair the temple in Jerusalem (see 2 Kings 22:1–7 ). If you hid a Bible before class, explain that there are lost scriptures somewhere in the classroom. Invite students to find them. Ask the student who finds the Bible to locate the bookmark. Then provide the following instructions: Read 2 Kings 22:8–13 , looking for what happened as the temple was being repaired. What did Hilkiah the high priest find? How did King Josiah respond after hearing the words of the book, or the scriptures? Josiah decided to read the book to all the people of Jerusalem (see 2 Kings 22:14–20 ; 23:1–2 ). You could help students visualize what they’ve read by watching “ Josiah and the Book of the Law ” (12:25) from time code 7:02 to 8:37. This video is available at ChurchofJesusChrist.org . 12:25 Read 2 Kings 23:1–3 , looking for the influence that reading the scriptures had on Josiah and his people. Consider marking what you find. What can we learn from these verses about the effect of scripture study in our lives? Among the insights students share, they might identify that studying the scriptures can help us turn to the Lord with all our hearts . This could be written on the board and referenced throughout the remainder of the lesson. To better understand this principle, students could complete the following with a partner. Each student could study one set of verses. Then partners could share with one another what they learned and discuss the accompanying questions. As Josiah and his people learned from the scriptures and turned to the Lord, they were inspired to make changes in their lives. Read your assigned verses, looking for the changes they made. Student 1 2 Kings 23:4, 24 . Why do you think the people needed to destroy all their idols to turn to the Lord with all their hearts? How can scripture study help us turn away from the evil influences in our lives? Student 2 2 Kings 23:21–22 . What religious practice did Josiah and his people follow again after reading the scriptures? How can scripture study help us remember the Savior and live His gospel? You could conclude the story of Josiah by watching “ Josiah and the Book of the Law“ from time code 8:37 to 10:20. 12:25 Student sharing This portion of the lesson is designed for personal reflection and sharing. Students can share how the scriptures have helped (or could help) them turn to the Lord. President Spencer W. Kimball (1895–1985) taught of the influence scripture study had on his life: I find that when I get casual in my relationships with divinity and when it seems that no divine ear is listening and no divine voice is speaking, that I am far, far away. If I immerse myself in the scriptures the distance narrows and the spirituality returns. ( Teachings of Presidents of the Church: Spencer W. Kimball [2006], 67) Identify a scripture passage that has helped (or could help) you turn to Heavenly Father and Jesus Christ. It could be from your personal or family scripture study or a previous seminary lesson, or it could be a doctrinal mastery passage. Prepare to share the following: How has this passage helped (or how could it help) you turn to Heavenly Father and Jesus Christ with all your heart? When students are ready to share, invite everyone to write their passages on the board around the truth that they identified earlier. Ask for multiple volunteers to read their passage and share their insights or experiences. If needed, you could also share passages that have helped you turn to the Lord. Consider pointing to passages on the board that haven’t been shared. You might ask if the students who wrote them would be willing to share. Or you might invite the class to read the passage and discuss how it could help us turn to the Lord. As students are sharing, you might ask follow-up questions to encourage class discussion. For example, you might ask, “Has anyone else had an experience with that passage? Would you be willing to share?” or “What thoughts and feelings have you had as you’ve listened to each other?” Scripture study goals Consider sharing your witness that your students can have a similar experience as Josiah did as he studied the scriptures (see 2 Kings 23:25 ). Invite students to review their goals for personal scripture study and their progress in reading the assigned chapters of the Old Testament. Give them time to reflect on the following questions: Do you feel your current scripture study goal is helping you fully turn to the Heavenly Father and Jesus Christ? If so, how have you seen this happen? If not, what adjustments will you make? What meaningful experiences have you had with reading the assigned Old Testament chapters? What will you do to ensure you complete the assigned readings? Encourage students to continue their efforts to study the scriptures daily.\n\n\n--- Lesson 88 ---\nProphets and others often speak about the gathering of Israel. To understand the gathering, it can help to understand why Israel was scattered in the first place. This lesson can help students use the scattering of Israel to identify attributes of Heavenly Father and Jesus Christ. Student preparation: Invite students to read Thoughts to Keep in Mind: “Jesus Will Say to All Israel, ‘Come Home’” from Come, Follow Me—For Home and Church: Old Testament 2026 . Ask them to come prepared to share thoughts or questions about the scattering of Israel. Possible Learning Activities The scattering of Israel Before class, you might want to label different areas in classroom as Northern Kingdom (Israel) , Southern Kingdom (Judah) , Assyria , the Americas , and Babylon/Persia . How and when might disciplining a child be a sign of love from their parent? Read Doctrine and Covenants 95:1 , looking for how Heavenly Father and Jesus Christ feel about people They need to correct or chasten. Several times in the Old Testament, Israel rebelled against Heavenly Father and Jesus Christ and needed correction. This resulted in what is called the scattering of Israel. As you study the scattering of Israel, look for how Heavenly Father and Jesus Christ demonstrated their love. Throughout the next two sections of the lesson, students will move around the classroom to understand how Israel was scattered. Divide students evenly into two groups. Have one group move near the area of the classroom labeled Northern Kingdom (Israel) , and the other group near the Southern Kingdom (Judah) . Rather than have students move around the classroom, you could display the graphic “ The Kingdoms of Israel and Judah at a Glance .” Students could read the same verses and discuss the same questions from the lesson, but simply follow along with this graphic. Northern Kingdom of Israel In about 975 BC, after Solomon died, his son Rehoboam became king. Rehoboam imposed great burdens on the people. Ten of the tribes rebelled against Rehoboam and followed Jeroboam (see 1 Kings 12:6–11, 19–20 ). This separation created the Northern and Southern Kingdoms. Read 2 Kings 17:7–18, 22–23 , looking for what happened to the Northern Kingdom of Israel. What happened to them and why did it happen? Explain that when Assyria conquered the Northern Kingdom of Israel and took many of the Israelites back to Assyria, this began the scattering of Israel. Ask most of the students standing near the Northern Kingdom (Israel) to move to the part of the room labeled Assyria . Point out that we often call these tribes the lost tribes of Israel. You could give the students that moved to Assyria a label that says Lost Tribes . You could give the students who remain in Israel a label that says Samaritans . You might want to explain that the Samaritans were part Israelite and part Gentile (see Guide to the Scriptures, “ Samaritans ,” Gospel Library). How would you summarize why Israel was scattered? Students might identify a truth like: Because Israel rejected the prophets and broke their covenant with the Lord, He scattered them among the nations. Southern Kingdom of Judah What have you learned so far about the Southern Kingdom of Judah, including the kings who have reigned there? Invite students to share any accounts they remember. For example, they might bring up King Hezekiah or King Josiah. If they do, you could create a label for each king and have students hold them up. Encourage students to share how the Lord blessed these kings and the people for their faith in Him. Both of these righteous kings reigned after Assyria conquered the Kingdom of Israel. Students might also mention Lehi and his family. If they do, invite them to share what they know. If they don’t, you could have them do the following. You could create a label for Lehi and his family for a few students to hold. Read 1 Nephi 1:4 , looking for who else lived in the Kingdom of Judah. Read 1 Nephi 2:1–4 ; 18:22–23 , looking for what happened to this family. What blessings from Heavenly Father have we received because the Lord led Lehi and his family away from Jerusalem as part of the scattering? Ask the students holding the Lehi and his family label to move from the Kingdom of Judah to the section of the class labeled The Americas . Read 2 Chronicles 36:17–20 , looking for what Nebuchadnezzar, the king of Babylon, did to the inhabitants of Jerusalem shortly after Lehi and his family left. Ask the remaining students in Kingdom of Judah to move to the area of the classroom representing Babylon/Persia . Approximately between 605 and 587 BC, the Babylonians carried away many Jews to Babylon and besieged and eventually destroyed Jerusalem (see 2 Kings 24:8–16 ; 25:1–12, 21 ; Jeremiah 52 ). You might want to ask students to name a few individuals who ended up in Babylon. If they need help, you could hand a few students labels such as Daniel , Shadrach , Meshach , Abed-nego (see Daniel 1:1–7 ), and Ezekiel (see Guide to the Scriptures, “ Ezekiel ,” Gospel Library). Read the following summary. Explain that some Jews remained in Persia (see Esther 2:5–7 ). Ask some students in Babylon/Persia to return to the area of the classroom representing Kingdom of Judah . You could create labels for Ezra and Nehemiah for a couple students to carry who move to Kingdom of Judah . Students will learn more about Ezra and Nehemiah later. Under King Cyrus the Persians conquered Babylon. Around 537 BC, the Lord inspired King Cyrus of Persia to permit the Jews to return to Jerusalem and rebuild the temple (see 2 Chronicles 36:22–23 ; Jeremiah 29:10–14 ; Ezra 1:1–3 ). In the years that followed, Ezra, Nehemiah, and others returned to Jerusalem to help rebuild the city and complete the temple (see Ezra 7:6–8 ; Nehemiah 2:1–11 ). Heavenly Father’s children are never lost to Him You might want to point out that many of these groups did not know what was happening to the other groups. From their perspective, the other groups were lost. Read 3 Nephi 17:4 , looking for what the Savior shared with the Nephites during His ministry among them. What stands out to you in this verse? You might point out that although Israel was scattered, the Lord used the scattering of His covenant people to bless the nations they were scattered to (see “ The scattering of Israel ” under Guide to the Scriptures, “ Israel ,” Gospel Library). You may want to point out that “kindness” in Isaiah 54:8 is a translation of hesed . For more on the significance of hesed see President Nelson’s article “ Everlasting Covenant ,” Liahona , Oct. 2022, 5–6. Read Deuteronomy 4:27–31 and Isaiah 54:7–10 , looking for what the Lord promised to do for scattered Israel. What attributes do you see in Heavenly Father and Jesus Christ as you learn about the scattering of Israel? Consider sharing your testimony of Heavenly Father’s love for all His children and of His promise to gather scattered Israel.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 49746,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.387354"
}