{
  "week_number": 7,
  "date_range": "Genesis 6–11",
  "title": ";Moses 8",
  "primary_scriptures": [
    {
      "book": "Moses",
      "chapters": [
        "8"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    }
  ],
  "all_content": "\n\n--- CFM: ;Moses 8 ---\nLiving in the latter days, we have special reason to pay attention to the story of the Flood. When Jesus Christ taught how we should watch for His Second Coming, He said, “As it was in the days of Noah, so it shall be also at the coming of the Son of Man” (\nJoseph Smith—Matthew 1:41\n). In addition, words that describe Noah’s day, like “corrupt” and “filled with violence,” could just as easily describe our time (\nGenesis 6:12–13\n;\nMoses 8:28\n). The story of the Tower of Babel also feels applicable to our day, with its description of pride followed by confusion and then division.\nThese ancient accounts are valuable not just because they show us that wickedness repeats itself throughout history. More important, they teach us what to do about it. Noah “found grace in the eyes of the Lord” (\nMoses 8:27\n). And the families of Jared and his brother turned to the Lord and were protected from the confusion and division in Babel (see\nEther 1:33–43\n). If we wonder how to keep ourselves and our families safe during corruption and violence, the stories in these chapters have much to teach us.\nIdeas for Learning at Home and at Church\nGenesis 6\n;\nMoses 8\nThere is spiritual safety in following the Lord’s prophet.\nDo you see anything in the description of Noah’s day that seems similar to conditions in our day? In particular, look in\nMoses 8:15–24, 28\n. What themes do you see repeated?\nOne important similarity you’ll see is that God called Noah to be a prophet, and He has called a prophet today too. Consider making a list of truths you learn about prophets from\nMoses 8:13–30\n. How is our living prophet like Noah? Of course, the Lord’s prophet today isn’t warning of a Flood or inviting us to help build an ark. But what is he warning us about? And what is he inviting us to do? To help answer these questions, you could review a chapter from\nTeachings of Presidents of the Church\nin Gospel Library, especially the “Invitations and Promised Blessings” section. Perhaps you could pick one warning and one invitation that seem especially important to you.\nElder Allen D. Haynie taught, “A perfect and loving Father in Heaven has chosen the pattern of revealing truth to His children through a prophet” (“\nA Living Prophet for the Latter Days\n,”\nLiahona\n, May 2023, 25). Consider studying Elder Haynie’s message, looking for reasons having a prophet is a sign of Heavenly Father’s love. How has following the Lord’s prophet helped you feel safe living in the latter days?\nSee also Topics and Questions, “\nProphets\n,” Gospel Library; “Why Do We Have Prophets?” (video), Gospel Library.\n1:37\nWhy Do We Have Prophets?\nGenesis 6:5–13\nThe Flood was an act of God’s mercy.\nSome people wonder about the justice of God in sending the Flood to “destroy man” (\nGenesis 6:7\n). Elder Neal A. Maxwell explained that at the time of the Flood, “corruption had reached an agency-destroying point that spirits could not, in justice, be sent here” (\nWe Will Prove Them Herewith\n[1982], 58). You might also consider how the Flood was an act of mercy. What do you find in\nGenesis 6:5–13\nthat shows the Lord’s tender mercy and love for the people?\nGenesis 9:8–17\nTokens or symbols help me remember my covenants with the Lord.\nAccording to\nGenesis 9:8–17\n, what can a rainbow bring to your mind? What does\nJoseph Smith Translation, Genesis 9:21–25\n(in the Bible appendix) add to your understanding? You might also consider making a list of other things (like symbols, objects, or anything else) that God has given you to remind you of your covenants. What do these things teach you? How do they help you remember?\nSee also Gerrit W. Gong, “\nAlways Remember Him\n,”\nEnsign\nor\nLiahona\n, May 2016, 108–11; “\nReverently and Meekly Now\n,”\nHymns\n, no. 185.\nThe Tower of Babel\n, by David Green\nGenesis 11:1–9\nFollowing Jesus Christ is the only way to Heavenly Father.\nThe account of the people of Babel building a tower provides an interesting contrast to the account of Enoch and his people building Zion, which you studied last week. Both groups of people were trying to reach heaven but in different ways. How did the people of Zion obtain heaven? (see\nMoses 7:18–19, 53, 62–63, 69\n). What do you learn from\nGenesis 11:1–9\nand\nHelaman 6:26–28\nabout the people of Babel? What does this teach us about our own efforts to return to God’s presence? What has God provided to help us “reach unto heaven”? (\nGenesis 11:4\n; see also\nJohn 3:16\n).\nLearn actively.\nLearning can involve more than just reading or listening. For example, when learning about the Tower of Babel, you and your family or class could write, on slips of paper, things that take us away from God. Then, on other slips of paper, you could write things that bring us nearer to God. Arrange the first group of papers in the shape of a tower and the second group in the shape of a temple.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Noah curse Canaan?\nWhat was wrong about building the Tower of Babel?\nWhat is significant about the genealogy of Shem?\nClick to see more.\nIdeas for Teaching Children\nGenesis 6:14–22\n;\n7–8\n;\nMoses 8:16–24\nFollowing the Lord’s prophet will bless me and my family.\nMost children love the story of Noah and the ark. Consider giving your children opportunities to share what they know about it. To help them, you could use the pictures in this outline, “\nNoah and His Family\n” in\nOld Testament Stories\n(22–25), and the third verse of “\nFollow the Prophet\n” (\nChildren’s Songbook\n, 110–11). Your children might enjoy acting out parts of the story—for example, by pretending to use a tool to build the ark or walking like animals entering the ark.\nAs you talk about Noah together, help your children see how blessed we are to have a prophet of God today. Help your children search\nMoses 8:16–24\nto find things Noah taught that the Lord’s prophets still teach today. How are we blessed when we obey these teachings?\nGenesis 9:15–16\nGod will keep His promises to me.\nYour children might enjoy drawing or coloring a rainbow while you talk about what it represents (see\nJoseph Smith Translation, Genesis 9:21–25\n[in the Bible appendix]). What did God want Noah and his family to think of whenever they saw a rainbow?\nYou could also show your children something you have that reminds you of something important in your life, such as a wedding ring, a picture, or a journal. Let your children share their own examples. This could lead to a conversation about things that help us remember our covenants, such as the sacrament, which helps us remember our baptismal covenant to follow Jesus Christ (see\nDoctrine and Covenants 20:75–79\n).\nGod told Noah’s family that the rainbow would be “the token of the covenant which I make between me and you” (\nGenesis 9:12\n).\nGenesis 11:1–9\nFollowing Jesus Christ is the only way to heaven.\nIt could be fun to build a tower out of blocks or other objects with your children. As you do so, explain that the people of Babel thought they could get to heaven by building a tall tower. You could then look together at a picture of the Savior and ask your children how He helps us get to heaven. Then you could talk with each other about things you can do to follow the Savior.\nIn addition to reading the story of the tower of Babel in\nGenesis 11:1–9\n, you and your children could read\nHelaman 6:28\n. According to this verse, why did the people of Babel build the tower? Why was building this tower the wrong way to reach heaven? Then you could search\n2 Nephi 31:20–21\nand\nHelaman 3:28\nto find the right way to reach heaven. What advice would we give to the people of Babel?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 7: Lesson 19: Lesson 19—Moses 8This lesson can help students better follow the Savior despite living in a wicked world.; Lesson 20: Lesson 20—Genesis 6–8This lesson can help students increase their desire to obey God’s commandments.... ---\n\n--- Lesson 19 ---\nThe Lord called Noah to be a prophet at a time when the people were described as “being only evil continually” ( Moses 8:22 ). Even amid so much wickedness, Noah and his sons chose to follow Jesus Christ. This lesson can help students better follow the Savior despite living in a wicked world. Student preparation: Invite students to think about challenges or difficulties they face in following Jesus Christ in the world today. Ask them to come to class prepared to share what has helped them overcome the world and follow Jesus Christ. Possible Learning Activities Living in, but not of, the world Begin class by showing students a bucket of water and a small dry object. Is it possible for an object to remain dry if it’s placed in a bucket of water? How? After students have had an opportunity to share their thoughts, place the object in a plastic bag or a sealed container, and place it in the bucket of water. How might this object lesson relate to our efforts to remain righteous in a wicked world? To help students evaluate their current ability to live righteously in a wicked world, consider displaying the following statements. Invite students to ponder how true each statement is for them. It’s hard for me to resist the enticements of the world and follow Jesus Christ. I know where I can turn for help to remain faithful in a wicked world. I spend time daily seeking to learn more about and to follow Jesus Christ. Remind students that the Holy Ghost will show us what we should do (see 2 Nephi 32:5 ). Invite students to seek inspiration to know what they can do to remain righteous in an increasingly wicked world. A wicked world When the Lord took Enoch and his city into heaven (see Moses 7:69 ), Enoch’s righteous son, Methuselah, remained on the earth (see Moses 8:2 ). Methuselah’s grandson, Noah, and Noah’s three sons “walked with God” ( Moses 8:27 ), while most people who remained on the earth chose wickedness. Display the following instructions and chart on the board. Invite students to draw the chart in their study journals. Students could complete the chart in small groups. Read Moses 8:12–22, 28–29 , looking for the spiritual condition of the people in Noah’s day. Then identify similarities between the spiritual conditions in Noah’s day and conditions we see in our day. Spiritual Condition of Many in Noah’s Day Similarities between Noah’s Day and Our Day Invite groups to share what they found with other groups. Encourage students to add what their classmates share to their own charts. If students need help, you could point out similarities like the following: 1. Like Noah’s granddaughters, some people today forfeit blessings God offers them through eternal, covenant marriage (see verses 12–15 ). 2. Some people today also fight against the prophet and reject his counsel (see verses 18–20 ). Review Moses 8:16–17 to see what the Lord told Noah would happen if the people didn’t repent. How much time did the Lord give the people to repent? What can that teach us about the nature of God? Following the Savior in a wicked world To help students feel hope that they can follow the Savior in a wicked world, consider inviting a student to read the following statement. President Russell M. Nelson shared how overcoming this fallen world is possible: Because Jesus Christ overcame this fallen world, and because He atoned for each of us, you too can overcome this sin-saturated, self-centered, and often exhausting world. (“ Overcome the World and Find Rest ,” Liahona , Nov. 2022, 96) What would you use from President Nelson’s statement to help someone who feels overwhelmed by the wickedness around them? Consider writing the following incomplete statement of truth on the board. Invite students to begin thinking about different ways they could complete it. I can choose to follow the Savior in a wicked world by … To help students discover ways they can follow the Savior in a wicked world, provide them with instructions below and copies of the accompanying handout. Students could work in groups. They could study the resources together, or group members could select different scripture passages and statements to study separately and then come together to discuss. Choosing from the following resources, make a list in your study journal of things we can do to follow Jesus Christ despite the wickedness and temptations around us. Open PDF After groups have had sufficient time to study and create lists, consider having each group write on the board one thing they found to complete the statement of truth. For example, from Moses 8:13, 23–24 , students might find listening to the Lord and His prophets, believing in Jesus Christ, repenting, and making covenants with God. A few students could share why the things they wrote were significant to them. Consider showing the video “ Sharing Your Light ” (2:56), available at ChurchofJesusChrist.org . In this video, a young woman follows the Savior despite the choices of others around her. 2:56 Pausing and reflecting on students’ unique backgrounds can invite a Christlike spirit of discernment, love, and empathy into your interactions with them. For example, based on their life experiences, some students may respond to the following questions differently than you would. Seek to understand their point of view, react with love and empathy, and compliment their efforts to follow the Savior. (For additional training on increasing your understanding of students’ unique circumstances, see “ Seek to know them—understand their circumstances, needs, and strengths ” in Teacher Development Skills.) Ponder what you have done to help you overcome the wickedness around you. These actions might be the small and simple things you do regularly, goals you’ve worked on in the Children and Youth program, or other experiences. What have you done to help you better follow the Savior and overcome the wickedness around you? Were there any obstacles you faced in your efforts? If so, what did you do or could you do to overcome those obstacles? What advice would you have for others? My plan to follow Jesus Christ Help students think of ways they can follow Jesus Christ. You could do this by inviting them to respond to the following questions. You might encourage students to write their answers somewhere they will see them often or to share their plan with trusted friends, family members, or Church leaders. These suggestions can remind students what they’ve learned and want to do. What have you felt inspired to do today? How will following these impressions increase your ability to follow the Savior and overcome the world? Consider concluding with student testimonies about what they have learned and felt today and about how following the Savior can help them overcome the world. You might also share your testimony.\n\n\n--- Lesson 20 ---\nGod lovingly asks us to obey His commandments. Some commandments may be difficult to understand, but they are always for our good. Noah’s family was saved from an unprecedented, miraculous flood because they obeyed God’s commandment to build an ark. This lesson can help students increase their desire to obey God’s commandments. Student preparation: Invite students to ponder and come prepared to share how a specific commandment shows Heavenly Father’s love for us and His desire to protect us. Possible Learning Activities Commandments of God Consider beginning the lesson by encouraging students to ponder why our loving Father in Heaven gives us commandments. One way to do this is to display the following pictures and to create a discussion using the questions below. Another way is to have students share rules their parents have set to keep their children safe. Imagine you are caring for a large group of young children in this campground. What specific rules might you give the children to keep them safe? If the children were mad at you for setting rules, what would you explain to them? Invite students to share with a partner how they might compare this situation to Heavenly Father’s commandments for us. Then invite students to record their personal feelings about God and His commandments in their study journals using prompts like the following. You might invite a few volunteers to share what they wrote. Why do you think that God wants you, personally, to keep His commandments? How willing are you to obey what God asks, even if you don’t understand the reason for the commandment? Why? The people in Noah’s day Consider displaying the image of Noah at the beginning of the lesson. Ask students to share what they already know about the following concepts. Invite them to use the suggested scripture passages if needed. The spiritual condition of the people in Noah’s day and what God did as a result (see Moses 8:17, 20, 22, 28–29 ) What God commanded Noah to do to save the obedient (see Moses 7:43 ) As students continue to study, encourage them to seek the influence of the Holy Ghost to understand God’s love for us. Everything God does, including the Flood, is motivated by love (see 2 Nephi 26:24 ). Help students recognize that Jesus Christ suffered for the sins of the people who died in the Flood so that they could learn and repent in the spirit world (see Moses 7:38–40 ; 1 Peter 3:18–20 ). Also, God’s choice to send the Flood protected His other spirit children from being born into such dangerous and wicked circumstances (see John Taylor, in Journal of Discourses , 19:158–59). The ark Consider providing paper for small groups of students and giving them a short time to complete the following activity together. (Be careful to save time after this activity for students to discuss what they learn and to relate it to their lives.) Read Genesis 6:14–22 ; 7:1–12, 23 ; 8:13–17 , looking for what this account teaches about God and what we can learn from Noah. Make a simple drawing of what happened. Include with your drawing one thing you learned about God and one thing you learned from Noah’s example. Invite groups to show and explain their drawings (even if they are incomplete) to another group. Then invite groups to share with the class what they learned about God and what they learned from Noah’s example. One truth that students might identify from this account is as we obey the Lord in faith, He will bless and protect us . Consider displaying the following statement and inviting groups to read and discuss how it applies to us today. President Spencer W. Kimball (1895–1985) shared some reasons why Noah and his family needed faith in Christ to fulfill the commandment to build the ark. As yet there was no evidence of rain and flood. [Noah’s] people mocked and called him a fool. His preaching fell on deaf ears. His warnings were considered irrational. There was no precedent; never had it been known that a deluge [or flood] could cover the earth. How foolish to build an ark on dry ground with the sun shining and life moving forward as usual! ( Teachings of Presidents of the Church: Spencer W. Kimball [2006], 140–41 ) What are some of the Lord’s commandments that people ignore or mock today? What do you know about God and His prophets that can help us obey the Lord despite opposition? Invite students to share commandments that they believe are loving protections from God. Obedience to God in our lives Consider displaying the following statement along with the personal reflection prompts below. President Thomas S. Monson (1927–2018) shared one of the greatest lessons we can learn in our lives. Noah had the unwavering faith to follow God’s commandments. May we ever do likewise. May we remember that the wisdom of God ofttimes appears as foolishness to men; but the greatest lesson we can learn in mortality is that when God speaks and we obey, we will always be right. (“ Models to Follow ,” Ensign or Liahona , Nov. 2002, 61) Record in your study journal: How you feel President Monson’s statement relates to situations or commandments in your life. What you learned or felt today about Heavenly Father and His commandments. What you believe Heavenly Father would have you do to follow Noah’s example of faithful obedience. You might conclude the lesson by inviting students to mark Noah’s example in Genesis 7:5 and cross-reference it with the Savior’s premortal example in Moses 4:2 . Consider testifying that God will bless your students for their faithful efforts to follow the Savior’s example of obedience.\n\n\n--- Lesson 21 ---\nReflecting on and assessing our spiritual learning can help us draw closer to the Savior. This lesson can help students reflect on the goals they have set and the growth they have experienced during their study of Moses 1 through Genesis 11 . Student preparation: Invite students to come ready to share what they have learned or ways they have grown spiritually since beginning this year’s study of the Old Testament and Pearl of Great Price. You might suggest that they review their study journals or notes in their scriptures to help them notice their growth and learning. Possible Learning Activities Your class’s study of Moses 1 through Genesis 11 may have focused on different outcomes than those assessed in this lesson. If so, adapt the activities to assess the growth students experienced from the outcomes they focused on. In this lesson, students will have the opportunity to assess their progress in: Deepening their conversion to Jesus Christ and becoming His disciple. Studying the scriptures daily. Explaining the effects of the Fall and role of Jesus Christ as our Redeemer. (Note: This activity is based on teachings from Lesson 11: “ Moses 4:5–32; 5:1–15, Part 1 ” and Lesson 12: “ Moses 4:5–32; 5:1–15, Part 2 .”) Increasing their desire to fulfill their divine identity and purpose. (Note: This activity is based on Lesson 3: “ Abraham 3 ,” Lesson 4: “ Moses 1:1–11 ,” Lesson 5: “ Moses 1:12–26 ,” and Lesson 8: “ Genesis 1:26–27 .”) Deepening conversion to Jesus Christ and becoming His disciple To help students understand that spiritual growth takes time, consider displaying the following image of Enoch’s people. Invite students to read Moses 7:18–21 to remind them of the spiritual progress Enoch’s people made before they were taken up into heaven by the Lord. What impresses you from this description of Enoch’s people? In verse 21 , it states that “in process of time, [they were] taken up into heaven.” Read Moses 7:68 to see how long that “process of time” was. What can this teach us about spiritual growth as disciples of the Savior? Encourage students to celebrate their progress as disciples of Christ, even if it is taking longer than they would like. In time, slow and steady progress will lead to a relationship with the Savior like Enoch’s people eventually developed. Invite students to look back on their own spiritual growth and learning over the past couple months. They could try to recognize even seemingly small progress in their knowledge, desires, and actions that have helped them become more committed disciples of Jesus Christ. You might suggest that students look through their study journals or the notes in their scriptures. If it would help your students to notice their progress, you could display or ask questions like the following: What have you learned about Heavenly Father and Jesus Christ that is important to you? What are some ways you have come closer to Them? What is something you have applied from your scripture study to help you as a disciple of Christ? After time to ponder, invite volunteers to share progress they notice in themselves. Studying the scriptures daily You may want to remind students that reading Moses 1–5 ; Abraham 1–3 ; and Genesis 37, 39, 41 is required to receive seminary credit this semester. These chapters were carefully selected because of their doctrinal depth and richness. Additionally, students are encouraged to create a personal scripture study goal. This goal is not required for credit, but it will help them find strength daily in the word of God. If they have not yet set a goal, encourage them to do so today. They can adjust this goal anytime. To help support students in accomplishing their required reading and personal study goals, consider giving each student a small slip of paper. They will hand this paper in at the end of class. You could use the information they provide in their papers to appropriately encourage each student in their goals. You might display the following as suggestions for what to include on their papers. Your name. Required chapters you have completed. If you choose to share your personal study goal with the teacher, also include: What your goal is and how you are doing with it. How your goal is helping you learn the gospel and come to know Jesus Christ better. You could ask volunteers to share their answers to the final two prompts with the class or have students share in smaller groups. If you do this, make sure that students know that they do not need to share their scripture study goals if they do not want to. Students should never feel pressured to share. Explaining the effects of the Fall and role of Jesus Christ as our Redeemer Understanding the effects of the Fall and the role of Jesus Christ as our Redeemer from the Fall is important in understanding Heavenly Father’s plan. Yet these essential truths can be challenging to understand and explain to others. Consider giving students time to review the pamphlets they created in Lesson 11: “ Moses 4:5–32; 5:1–15, Part 1 ” and Lesson 12: “ Moses 4:5–32; 5:1–15, Part 2 .” (If students did not make pamphlets, consider displaying a piece of fruit and a picture of Jesus Christ as a simple visual way to remind students of these scripture accounts. Students could then briefly review Moses 4:6–13, 22–25 ; 5:8–12 to prepare for the discussion below.) Prepare to explain the following in your own words: Adam and Eve’s choice that caused the Fall The results of the Fall on Adam and Eve, and how those results affect all of us still today How the Fall was necessary in Heavenly Father’s plan for us What the Savior did to redeem us from specific effects of the Fall Invite students to choose a partner. Have one student explain points 1 and 2 to their partner. Then invite the other student to explain points 3 and 4. When they are finished, you might invite them to do the activity one more time, this time switching who explains which points. Increasing our desire to fulfill our divine identity and purpose During their recent study of the Old Testament, students may have had several learning experiences focused on their divine identity and purpose as children of God. Provide an opportunity for students to reflect on how the truths they have learned have impacted their desire to fulfill their divine potential. Draw an outline of a person that could represent you. Within this outline, or near it, write the truths about your divine identity that you have learned recently in the Old Testament. If possible, make these statements personal using “me” or “I.” Here are some scriptures you might refer to: Abraham 3:22–23 Moses 1:1–11 Moses 1:12–24 Genesis 1:26–27 The following are some truths students might write. They are adapted from Lessons 3, 4, 5, and 8. God chose me from among the noble and great spirits to be born today ( Abraham 3:22–23 ). As a child of God, He has a work specifically for me to do ( Moses 1:6 ). Because I am a daughter or son of God, I can find strength in Him to resist temptation ( Moses 1:13, 16 ). Because I am created in the image of God, I can become like Him ( Genesis 1:26–27 ). To help students think about how these truths can help them, you could choose one of the following activities for students to do as a class or in small groups. Or you could have students choose which activity they would like to do. Option A: Describe a few circumstances where knowing these truths could help you. Identify how these truths could help someone in each circumstance. Option B: Complete the following phrases: Knowing these truths can help me when I think about myself because … I face temptation because … I interact with others because … I make decisions because … When students have finished, invite them to record in their study journals any thoughts or experiences of how these truths have influenced their desire to fulfill their divine potential. You also might invite students to record how these truths could influence them in a future situation they will face. When students finish, invite any willing students to share something from what they wrote.\n\n--- SCRIPTURE: Moses 8 ---\n1. And all the days ofEnochwere four hundred and thirty years.\n2. And it came to pass that Methuselah, the son of Enoch, wasnottaken, that the covenants of the Lord might be fulfilled, which he made to Enoch; for he truly covenanted with Enoch that Noah should be of the fruit of his loins.\n3. And it came to pass that Methuselahprophesiedthat from his loins should spring all the kingdoms of the earth (through Noah), and he took glory unto himself.\n4. And there came forth greatfamineinto the land, and the Lordcursedthe earth with sore curse, and many of the inhabitants thereof died.\n5. And it came to pass that Methuselah lived one hundred and eighty-seven years, and begat Lamech;\n6. And Methuselah lived, after he begat Lamech, seven hundred and eighty-two years, and begat sons and daughters;\n7. And all the days of Methuselah were nine hundred and sixty-nine years, and he died.\n8. And Lamech lived one hundred and eighty-two years, and begat son,\n9. And he called his name Noah, saying: This son shall comfort us concerning our work and toil of our hands, because of the ground which the Lord hathcursed.\n10. And Lamech lived, after he begat Noah, five hundred and ninety-five years, and begat sons and daughters;\n11. And all the days of Lamech were seven hundred and seventy-seven years, and he died.\n12. And Noah was four hundred and fifty years old, andbegatJapheth; and forty-two years afterward he begatShemof her who was the mother of Japheth, and when he was five hundred years old he begatHam.\n13. AndNoahand his sons hearkened unto the Lord, and gave heed, and they were called thesonsof God.\n14. And when these men began to multiply on the face of the earth, and daughters were born unto them, thesonsof men saw that those daughters were fair, and they took themwives, even as they chose.\n15. And the Lord said unto Noah: The daughters of thy sons have sold themselves; for behold mine anger is kindled against the sons of men, for they will nothearkento my voice.\n16. And it came to pass that Noahprophesied, and taught the things of God, even as it was in the beginning.\n17. And the Lord said unto Noah: My Spirit shall not alwaysstrivewith man, for he shall know that allfleshshall die; yet his days shall be anhundredand twenty years; and if men do not repent, I will send in thefloodsupon them.\n18. And in those days there weregiantson the earth, and they sought Noah to take away hislife; but the Lord was with Noah, and thepowerof the Lord was upon him.\n19. And the LordordainedNoahafter his ownorder, and commanded him that he should go forth anddeclarehis Gospel unto the children of men, even as it was given unto Enoch.\n20. And it came to pass that Noah called upon the children of men that they shouldrepent; but they hearkened not unto his words;\n21. And also, after that they had heard him, they came up before him, saying: Behold, we are the sons of God; have we not taken unto ourselves the daughters of men? And are we noteatingand drinking, and marrying and giving in marriage? And our wives bear unto us children, and the same are mighty men, which are like unto men of old, men of great renown. And they hearkened not unto the words of Noah.\n22. And God saw that thewickednessof men had become great in the earth; and every man was lifted up in theimaginationof the thoughts of his heart, being only evil continually.\n23. And it came to pass that Noah continued hispreachingunto the people, saying: Hearken, and give heed unto my words;\n24. Believeand repent of your sins and bebaptizedin the name of Jesus Christ, the Son of God, even as our fathers, and ye shall receive the Holy Ghost, that ye may have all things mademanifest; and if ye do not this, the floods will come in upon you; nevertheless they hearkened not.\n25. And itrepentedNoah, and his heart was pained that the Lord had made man on the earth, and it grieved him at the heart.\n26. And the Lord said: I willdestroyman whom I have created, from the face of the earth, both man and beast, and the creeping things, and the fowls of the air; for it repenteth Noah that I have created them, and that I have made them; and he hath called upon me; for they have sought hislife.\n27. And thus Noah foundgracein the eyes of the Lord; for Noah was just man, andperfectin his generation; and hewalkedwith God, as did also his three sons, Shem, Ham, and Japheth.\n28. Theearthwascorruptbefore God, and it was filled with violence.\n29. And God looked upon the earth, and, behold, it was corrupt, for all flesh had corrupted itswayupon the earth.\n30. And God said unto Noah: The end of all flesh is come before me, for the earth is filled with violence, and behold I willdestroyall flesh from off the earth.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";Moses 8",
      "content": "Living in the latter days, we have special reason to pay attention to the story of the Flood. When Jesus Christ taught how we should watch for His Second Coming, He said, “As it was in the days of Noah, so it shall be also at the coming of the Son of Man” (\nJoseph Smith—Matthew 1:41\n). In addition, words that describe Noah’s day, like “corrupt” and “filled with violence,” could just as easily describe our time (\nGenesis 6:12–13\n;\nMoses 8:28\n). The story of the Tower of Babel also feels applicable to our day, with its description of pride followed by confusion and then division.\nThese ancient accounts are valuable not just because they show us that wickedness repeats itself throughout history. More important, they teach us what to do about it. Noah “found grace in the eyes of the Lord” (\nMoses 8:27\n). And the families of Jared and his brother turned to the Lord and were protected from the confusion and division in Babel (see\nEther 1:33–43\n). If we wonder how to keep ourselves and our families safe during corruption and violence, the stories in these chapters have much to teach us.\nIdeas for Learning at Home and at Church\nGenesis 6\n;\nMoses 8\nThere is spiritual safety in following the Lord’s prophet.\nDo you see anything in the description of Noah’s day that seems similar to conditions in our day? In particular, look in\nMoses 8:15–24, 28\n. What themes do you see repeated?\nOne important similarity you’ll see is that God called Noah to be a prophet, and He has called a prophet today too. Consider making a list of truths you learn about prophets from\nMoses 8:13–30\n. How is our living prophet like Noah? Of course, the Lord’s prophet today isn’t warning of a Flood or inviting us to help build an ark. But what is he warning us about? And what is he inviting us to do? To help answer these questions, you could review a chapter from\nTeachings of Presidents of the Church\nin Gospel Library, especially the “Invitations and Promised Blessings” section. Perhaps you could pick one warning and one invitation that seem especially important to you.\nElder Allen D. Haynie taught, “A perfect and loving Father in Heaven has chosen the pattern of revealing truth to His children through a prophet” (“\nA Living Prophet for the Latter Days\n,”\nLiahona\n, May 2023, 25). Consider studying Elder Haynie’s message, looking for reasons having a prophet is a sign of Heavenly Father’s love. How has following the Lord’s prophet helped you feel safe living in the latter days?\nSee also Topics and Questions, “\nProphets\n,” Gospel Library; “Why Do We Have Prophets?” (video), Gospel Library.\n1:37\nWhy Do We Have Prophets?\nGenesis 6:5–13\nThe Flood was an act of God’s mercy.\nSome people wonder about the justice of God in sending the Flood to “destroy man” (\nGenesis 6:7\n). Elder Neal A. Maxwell explained that at the time of the Flood, “corruption had reached an agency-destroying point that spirits could not, in justice, be sent here” (\nWe Will Prove Them Herewith\n[1982], 58). You might also consider how the Flood was an act of mercy. What do you find in\nGenesis 6:5–13\nthat shows the Lord’s tender mercy and love for the people?\nGenesis 9:8–17\nTokens or symbols help me remember my covenants with the Lord.\nAccording to\nGenesis 9:8–17\n, what can a rainbow bring to your mind? What does\nJoseph Smith Translation, Genesis 9:21–25\n(in the Bible appendix) add to your understanding? You might also consider making a list of other things (like symbols, objects, or anything else) that God has given you to remind you of your covenants. What do these things teach you? How do they help you remember?\nSee also Gerrit W. Gong, “\nAlways Remember Him\n,”\nEnsign\nor\nLiahona\n, May 2016, 108–11; “\nReverently and Meekly Now\n,”\nHymns\n, no. 185.\nThe Tower of Babel\n, by David Green\nGenesis 11:1–9\nFollowing Jesus Christ is the only way to Heavenly Father.\nThe account of the people of Babel building a tower provides an interesting contrast to the account of Enoch and his people building Zion, which you studied last week. Both groups of people were trying to reach heaven but in different ways. How did the people of Zion obtain heaven? (see\nMoses 7:18–19, 53, 62–63, 69\n). What do you learn from\nGenesis 11:1–9\nand\nHelaman 6:26–28\nabout the people of Babel? What does this teach us about our own efforts to return to God’s presence? What has God provided to help us “reach unto heaven”? (\nGenesis 11:4\n; see also\nJohn 3:16\n).\nLearn actively.\nLearning can involve more than just reading or listening. For example, when learning about the Tower of Babel, you and your family or class could write, on slips of paper, things that take us away from God. Then, on other slips of paper, you could write things that bring us nearer to God. Arrange the first group of papers in the shape of a tower and the second group in the shape of a temple.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Noah curse Canaan?\nWhat was wrong about building the Tower of Babel?\nWhat is significant about the genealogy of Shem?\nClick to see more.\nIdeas for Teaching Children\nGenesis 6:14–22\n;\n7–8\n;\nMoses 8:16–24\nFollowing the Lord’s prophet will bless me and my family.\nMost children love the story of Noah and the ark. Consider giving your children opportunities to share what they know about it. To help them, you could use the pictures in this outline, “\nNoah and His Family\n” in\nOld Testament Stories\n(22–25), and the third verse of “\nFollow the Prophet\n” (\nChildren’s Songbook\n, 110–11). Your children might enjoy acting out parts of the story—for example, by pretending to use a tool to build the ark or walking like animals entering the ark.\nAs you talk about Noah together, help your children see how blessed we are to have a prophet of God today. Help your children search\nMoses 8:16–24\nto find things Noah taught that the Lord’s prophets still teach today. How are we blessed when we obey these teachings?\nGenesis 9:15–16\nGod will keep His promises to me.\nYour children might enjoy drawing or coloring a rainbow while you talk about what it represents (see\nJoseph Smith Translation, Genesis 9:21–25\n[in the Bible appendix]). What did God want Noah and his family to think of whenever they saw a rainbow?\nYou could also show your children something you have that reminds you of something important in your life, such as a wedding ring, a picture, or a journal. Let your children share their own examples. This could lead to a conversation about things that help us remember our covenants, such as the sacrament, which helps us remember our baptismal covenant to follow Jesus Christ (see\nDoctrine and Covenants 20:75–79\n).\nGod told Noah’s family that the rainbow would be “the token of the covenant which I make between me and you” (\nGenesis 9:12\n).\nGenesis 11:1–9\nFollowing Jesus Christ is the only way to heaven.\nIt could be fun to build a tower out of blocks or other objects with your children. As you do so, explain that the people of Babel thought they could get to heaven by building a tall tower. You could then look together at a picture of the Savior and ask your children how He helps us get to heaven. Then you could talk with each other about things you can do to follow the Savior.\nIn addition to reading the story of the tower of Babel in\nGenesis 11:1–9\n, you and your children could read\nHelaman 6:28\n. According to this verse, why did the people of Babel build the tower? Why was building this tower the wrong way to reach heaven? Then you could search\n2 Nephi 31:20–21\nand\nHelaman 3:28\nto find the right way to reach heaven. What advice would we give to the people of Babel?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 7: Lesson 19: Lesson 19—Moses 8This lesson can help students better follow the Savior despite living in a wicked world.; Lesson 20: Lesson 20—Genesis 6–8This lesson can help students increase their desire to obey God’s commandments....",
      "content": "\n--- Lesson 19 ---\nThe Lord called Noah to be a prophet at a time when the people were described as “being only evil continually” ( Moses 8:22 ). Even amid so much wickedness, Noah and his sons chose to follow Jesus Christ. This lesson can help students better follow the Savior despite living in a wicked world. Student preparation: Invite students to think about challenges or difficulties they face in following Jesus Christ in the world today. Ask them to come to class prepared to share what has helped them overcome the world and follow Jesus Christ. Possible Learning Activities Living in, but not of, the world Begin class by showing students a bucket of water and a small dry object. Is it possible for an object to remain dry if it’s placed in a bucket of water? How? After students have had an opportunity to share their thoughts, place the object in a plastic bag or a sealed container, and place it in the bucket of water. How might this object lesson relate to our efforts to remain righteous in a wicked world? To help students evaluate their current ability to live righteously in a wicked world, consider displaying the following statements. Invite students to ponder how true each statement is for them. It’s hard for me to resist the enticements of the world and follow Jesus Christ. I know where I can turn for help to remain faithful in a wicked world. I spend time daily seeking to learn more about and to follow Jesus Christ. Remind students that the Holy Ghost will show us what we should do (see 2 Nephi 32:5 ). Invite students to seek inspiration to know what they can do to remain righteous in an increasingly wicked world. A wicked world When the Lord took Enoch and his city into heaven (see Moses 7:69 ), Enoch’s righteous son, Methuselah, remained on the earth (see Moses 8:2 ). Methuselah’s grandson, Noah, and Noah’s three sons “walked with God” ( Moses 8:27 ), while most people who remained on the earth chose wickedness. Display the following instructions and chart on the board. Invite students to draw the chart in their study journals. Students could complete the chart in small groups. Read Moses 8:12–22, 28–29 , looking for the spiritual condition of the people in Noah’s day. Then identify similarities between the spiritual conditions in Noah’s day and conditions we see in our day. Spiritual Condition of Many in Noah’s Day Similarities between Noah’s Day and Our Day Invite groups to share what they found with other groups. Encourage students to add what their classmates share to their own charts. If students need help, you could point out similarities like the following: 1. Like Noah’s granddaughters, some people today forfeit blessings God offers them through eternal, covenant marriage (see verses 12–15 ). 2. Some people today also fight against the prophet and reject his counsel (see verses 18–20 ). Review Moses 8:16–17 to see what the Lord told Noah would happen if the people didn’t repent. How much time did the Lord give the people to repent? What can that teach us about the nature of God? Following the Savior in a wicked world To help students feel hope that they can follow the Savior in a wicked world, consider inviting a student to read the following statement. President Russell M. Nelson shared how overcoming this fallen world is possible: Because Jesus Christ overcame this fallen world, and because He atoned for each of us, you too can overcome this sin-saturated, self-centered, and often exhausting world. (“ Overcome the World and Find Rest ,” Liahona , Nov. 2022, 96) What would you use from President Nelson’s statement to help someone who feels overwhelmed by the wickedness around them? Consider writing the following incomplete statement of truth on the board. Invite students to begin thinking about different ways they could complete it. I can choose to follow the Savior in a wicked world by … To help students discover ways they can follow the Savior in a wicked world, provide them with instructions below and copies of the accompanying handout. Students could work in groups. They could study the resources together, or group members could select different scripture passages and statements to study separately and then come together to discuss. Choosing from the following resources, make a list in your study journal of things we can do to follow Jesus Christ despite the wickedness and temptations around us. Open PDF After groups have had sufficient time to study and create lists, consider having each group write on the board one thing they found to complete the statement of truth. For example, from Moses 8:13, 23–24 , students might find listening to the Lord and His prophets, believing in Jesus Christ, repenting, and making covenants with God. A few students could share why the things they wrote were significant to them. Consider showing the video “ Sharing Your Light ” (2:56), available at ChurchofJesusChrist.org . In this video, a young woman follows the Savior despite the choices of others around her. 2:56 Pausing and reflecting on students’ unique backgrounds can invite a Christlike spirit of discernment, love, and empathy into your interactions with them. For example, based on their life experiences, some students may respond to the following questions differently than you would. Seek to understand their point of view, react with love and empathy, and compliment their efforts to follow the Savior. (For additional training on increasing your understanding of students’ unique circumstances, see “ Seek to know them—understand their circumstances, needs, and strengths ” in Teacher Development Skills.) Ponder what you have done to help you overcome the wickedness around you. These actions might be the small and simple things you do regularly, goals you’ve worked on in the Children and Youth program, or other experiences. What have you done to help you better follow the Savior and overcome the wickedness around you? Were there any obstacles you faced in your efforts? If so, what did you do or could you do to overcome those obstacles? What advice would you have for others? My plan to follow Jesus Christ Help students think of ways they can follow Jesus Christ. You could do this by inviting them to respond to the following questions. You might encourage students to write their answers somewhere they will see them often or to share their plan with trusted friends, family members, or Church leaders. These suggestions can remind students what they’ve learned and want to do. What have you felt inspired to do today? How will following these impressions increase your ability to follow the Savior and overcome the world? Consider concluding with student testimonies about what they have learned and felt today and about how following the Savior can help them overcome the world. You might also share your testimony.\n\n\n--- Lesson 20 ---\nGod lovingly asks us to obey His commandments. Some commandments may be difficult to understand, but they are always for our good. Noah’s family was saved from an unprecedented, miraculous flood because they obeyed God’s commandment to build an ark. This lesson can help students increase their desire to obey God’s commandments. Student preparation: Invite students to ponder and come prepared to share how a specific commandment shows Heavenly Father’s love for us and His desire to protect us. Possible Learning Activities Commandments of God Consider beginning the lesson by encouraging students to ponder why our loving Father in Heaven gives us commandments. One way to do this is to display the following pictures and to create a discussion using the questions below. Another way is to have students share rules their parents have set to keep their children safe. Imagine you are caring for a large group of young children in this campground. What specific rules might you give the children to keep them safe? If the children were mad at you for setting rules, what would you explain to them? Invite students to share with a partner how they might compare this situation to Heavenly Father’s commandments for us. Then invite students to record their personal feelings about God and His commandments in their study journals using prompts like the following. You might invite a few volunteers to share what they wrote. Why do you think that God wants you, personally, to keep His commandments? How willing are you to obey what God asks, even if you don’t understand the reason for the commandment? Why? The people in Noah’s day Consider displaying the image of Noah at the beginning of the lesson. Ask students to share what they already know about the following concepts. Invite them to use the suggested scripture passages if needed. The spiritual condition of the people in Noah’s day and what God did as a result (see Moses 8:17, 20, 22, 28–29 ) What God commanded Noah to do to save the obedient (see Moses 7:43 ) As students continue to study, encourage them to seek the influence of the Holy Ghost to understand God’s love for us. Everything God does, including the Flood, is motivated by love (see 2 Nephi 26:24 ). Help students recognize that Jesus Christ suffered for the sins of the people who died in the Flood so that they could learn and repent in the spirit world (see Moses 7:38–40 ; 1 Peter 3:18–20 ). Also, God’s choice to send the Flood protected His other spirit children from being born into such dangerous and wicked circumstances (see John Taylor, in Journal of Discourses , 19:158–59). The ark Consider providing paper for small groups of students and giving them a short time to complete the following activity together. (Be careful to save time after this activity for students to discuss what they learn and to relate it to their lives.) Read Genesis 6:14–22 ; 7:1–12, 23 ; 8:13–17 , looking for what this account teaches about God and what we can learn from Noah. Make a simple drawing of what happened. Include with your drawing one thing you learned about God and one thing you learned from Noah’s example. Invite groups to show and explain their drawings (even if they are incomplete) to another group. Then invite groups to share with the class what they learned about God and what they learned from Noah’s example. One truth that students might identify from this account is as we obey the Lord in faith, He will bless and protect us . Consider displaying the following statement and inviting groups to read and discuss how it applies to us today. President Spencer W. Kimball (1895–1985) shared some reasons why Noah and his family needed faith in Christ to fulfill the commandment to build the ark. As yet there was no evidence of rain and flood. [Noah’s] people mocked and called him a fool. His preaching fell on deaf ears. His warnings were considered irrational. There was no precedent; never had it been known that a deluge [or flood] could cover the earth. How foolish to build an ark on dry ground with the sun shining and life moving forward as usual! ( Teachings of Presidents of the Church: Spencer W. Kimball [2006], 140–41 ) What are some of the Lord’s commandments that people ignore or mock today? What do you know about God and His prophets that can help us obey the Lord despite opposition? Invite students to share commandments that they believe are loving protections from God. Obedience to God in our lives Consider displaying the following statement along with the personal reflection prompts below. President Thomas S. Monson (1927–2018) shared one of the greatest lessons we can learn in our lives. Noah had the unwavering faith to follow God’s commandments. May we ever do likewise. May we remember that the wisdom of God ofttimes appears as foolishness to men; but the greatest lesson we can learn in mortality is that when God speaks and we obey, we will always be right. (“ Models to Follow ,” Ensign or Liahona , Nov. 2002, 61) Record in your study journal: How you feel President Monson’s statement relates to situations or commandments in your life. What you learned or felt today about Heavenly Father and His commandments. What you believe Heavenly Father would have you do to follow Noah’s example of faithful obedience. You might conclude the lesson by inviting students to mark Noah’s example in Genesis 7:5 and cross-reference it with the Savior’s premortal example in Moses 4:2 . Consider testifying that God will bless your students for their faithful efforts to follow the Savior’s example of obedience.\n\n\n--- Lesson 21 ---\nReflecting on and assessing our spiritual learning can help us draw closer to the Savior. This lesson can help students reflect on the goals they have set and the growth they have experienced during their study of Moses 1 through Genesis 11 . Student preparation: Invite students to come ready to share what they have learned or ways they have grown spiritually since beginning this year’s study of the Old Testament and Pearl of Great Price. You might suggest that they review their study journals or notes in their scriptures to help them notice their growth and learning. Possible Learning Activities Your class’s study of Moses 1 through Genesis 11 may have focused on different outcomes than those assessed in this lesson. If so, adapt the activities to assess the growth students experienced from the outcomes they focused on. In this lesson, students will have the opportunity to assess their progress in: Deepening their conversion to Jesus Christ and becoming His disciple. Studying the scriptures daily. Explaining the effects of the Fall and role of Jesus Christ as our Redeemer. (Note: This activity is based on teachings from Lesson 11: “ Moses 4:5–32; 5:1–15, Part 1 ” and Lesson 12: “ Moses 4:5–32; 5:1–15, Part 2 .”) Increasing their desire to fulfill their divine identity and purpose. (Note: This activity is based on Lesson 3: “ Abraham 3 ,” Lesson 4: “ Moses 1:1–11 ,” Lesson 5: “ Moses 1:12–26 ,” and Lesson 8: “ Genesis 1:26–27 .”) Deepening conversion to Jesus Christ and becoming His disciple To help students understand that spiritual growth takes time, consider displaying the following image of Enoch’s people. Invite students to read Moses 7:18–21 to remind them of the spiritual progress Enoch’s people made before they were taken up into heaven by the Lord. What impresses you from this description of Enoch’s people? In verse 21 , it states that “in process of time, [they were] taken up into heaven.” Read Moses 7:68 to see how long that “process of time” was. What can this teach us about spiritual growth as disciples of the Savior? Encourage students to celebrate their progress as disciples of Christ, even if it is taking longer than they would like. In time, slow and steady progress will lead to a relationship with the Savior like Enoch’s people eventually developed. Invite students to look back on their own spiritual growth and learning over the past couple months. They could try to recognize even seemingly small progress in their knowledge, desires, and actions that have helped them become more committed disciples of Jesus Christ. You might suggest that students look through their study journals or the notes in their scriptures. If it would help your students to notice their progress, you could display or ask questions like the following: What have you learned about Heavenly Father and Jesus Christ that is important to you? What are some ways you have come closer to Them? What is something you have applied from your scripture study to help you as a disciple of Christ? After time to ponder, invite volunteers to share progress they notice in themselves. Studying the scriptures daily You may want to remind students that reading Moses 1–5 ; Abraham 1–3 ; and Genesis 37, 39, 41 is required to receive seminary credit this semester. These chapters were carefully selected because of their doctrinal depth and richness. Additionally, students are encouraged to create a personal scripture study goal. This goal is not required for credit, but it will help them find strength daily in the word of God. If they have not yet set a goal, encourage them to do so today. They can adjust this goal anytime. To help support students in accomplishing their required reading and personal study goals, consider giving each student a small slip of paper. They will hand this paper in at the end of class. You could use the information they provide in their papers to appropriately encourage each student in their goals. You might display the following as suggestions for what to include on their papers. Your name. Required chapters you have completed. If you choose to share your personal study goal with the teacher, also include: What your goal is and how you are doing with it. How your goal is helping you learn the gospel and come to know Jesus Christ better. You could ask volunteers to share their answers to the final two prompts with the class or have students share in smaller groups. If you do this, make sure that students know that they do not need to share their scripture study goals if they do not want to. Students should never feel pressured to share. Explaining the effects of the Fall and role of Jesus Christ as our Redeemer Understanding the effects of the Fall and the role of Jesus Christ as our Redeemer from the Fall is important in understanding Heavenly Father’s plan. Yet these essential truths can be challenging to understand and explain to others. Consider giving students time to review the pamphlets they created in Lesson 11: “ Moses 4:5–32; 5:1–15, Part 1 ” and Lesson 12: “ Moses 4:5–32; 5:1–15, Part 2 .” (If students did not make pamphlets, consider displaying a piece of fruit and a picture of Jesus Christ as a simple visual way to remind students of these scripture accounts. Students could then briefly review Moses 4:6–13, 22–25 ; 5:8–12 to prepare for the discussion below.) Prepare to explain the following in your own words: Adam and Eve’s choice that caused the Fall The results of the Fall on Adam and Eve, and how those results affect all of us still today How the Fall was necessary in Heavenly Father’s plan for us What the Savior did to redeem us from specific effects of the Fall Invite students to choose a partner. Have one student explain points 1 and 2 to their partner. Then invite the other student to explain points 3 and 4. When they are finished, you might invite them to do the activity one more time, this time switching who explains which points. Increasing our desire to fulfill our divine identity and purpose During their recent study of the Old Testament, students may have had several learning experiences focused on their divine identity and purpose as children of God. Provide an opportunity for students to reflect on how the truths they have learned have impacted their desire to fulfill their divine potential. Draw an outline of a person that could represent you. Within this outline, or near it, write the truths about your divine identity that you have learned recently in the Old Testament. If possible, make these statements personal using “me” or “I.” Here are some scriptures you might refer to: Abraham 3:22–23 Moses 1:1–11 Moses 1:12–24 Genesis 1:26–27 The following are some truths students might write. They are adapted from Lessons 3, 4, 5, and 8. God chose me from among the noble and great spirits to be born today ( Abraham 3:22–23 ). As a child of God, He has a work specifically for me to do ( Moses 1:6 ). Because I am a daughter or son of God, I can find strength in Him to resist temptation ( Moses 1:13, 16 ). Because I am created in the image of God, I can become like Him ( Genesis 1:26–27 ). To help students think about how these truths can help them, you could choose one of the following activities for students to do as a class or in small groups. Or you could have students choose which activity they would like to do. Option A: Describe a few circumstances where knowing these truths could help you. Identify how these truths could help someone in each circumstance. Option B: Complete the following phrases: Knowing these truths can help me when I think about myself because … I face temptation because … I interact with others because … I make decisions because … When students have finished, invite them to record in their study journals any thoughts or experiences of how these truths have influenced their desire to fulfill their divine potential. You also might invite students to record how these truths could influence them in a future situation they will face. When students finish, invite any willing students to share something from what they wrote.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Moses 8",
      "content": "1. And all the days ofEnochwere four hundred and thirty years.\n2. And it came to pass that Methuselah, the son of Enoch, wasnottaken, that the covenants of the Lord might be fulfilled, which he made to Enoch; for he truly covenanted with Enoch that Noah should be of the fruit of his loins.\n3. And it came to pass that Methuselahprophesiedthat from his loins should spring all the kingdoms of the earth (through Noah), and he took glory unto himself.\n4. And there came forth greatfamineinto the land, and the Lordcursedthe earth with sore curse, and many of the inhabitants thereof died.\n5. And it came to pass that Methuselah lived one hundred and eighty-seven years, and begat Lamech;\n6. And Methuselah lived, after he begat Lamech, seven hundred and eighty-two years, and begat sons and daughters;\n7. And all the days of Methuselah were nine hundred and sixty-nine years, and he died.\n8. And Lamech lived one hundred and eighty-two years, and begat son,\n9. And he called his name Noah, saying: This son shall comfort us concerning our work and toil of our hands, because of the ground which the Lord hathcursed.\n10. And Lamech lived, after he begat Noah, five hundred and ninety-five years, and begat sons and daughters;\n11. And all the days of Lamech were seven hundred and seventy-seven years, and he died.\n12. And Noah was four hundred and fifty years old, andbegatJapheth; and forty-two years afterward he begatShemof her who was the mother of Japheth, and when he was five hundred years old he begatHam.\n13. AndNoahand his sons hearkened unto the Lord, and gave heed, and they were called thesonsof God.\n14. And when these men began to multiply on the face of the earth, and daughters were born unto them, thesonsof men saw that those daughters were fair, and they took themwives, even as they chose.\n15. And the Lord said unto Noah: The daughters of thy sons have sold themselves; for behold mine anger is kindled against the sons of men, for they will nothearkento my voice.\n16. And it came to pass that Noahprophesied, and taught the things of God, even as it was in the beginning.\n17. And the Lord said unto Noah: My Spirit shall not alwaysstrivewith man, for he shall know that allfleshshall die; yet his days shall be anhundredand twenty years; and if men do not repent, I will send in thefloodsupon them.\n18. And in those days there weregiantson the earth, and they sought Noah to take away hislife; but the Lord was with Noah, and thepowerof the Lord was upon him.\n19. And the LordordainedNoahafter his ownorder, and commanded him that he should go forth anddeclarehis Gospel unto the children of men, even as it was given unto Enoch.\n20. And it came to pass that Noah called upon the children of men that they shouldrepent; but they hearkened not unto his words;\n21. And also, after that they had heard him, they came up before him, saying: Behold, we are the sons of God; have we not taken unto ourselves the daughters of men? And are we noteatingand drinking, and marrying and giving in marriage? And our wives bear unto us children, and the same are mighty men, which are like unto men of old, men of great renown. And they hearkened not unto the words of Noah.\n22. And God saw that thewickednessof men had become great in the earth; and every man was lifted up in theimaginationof the thoughts of his heart, being only evil continually.\n23. And it came to pass that Noah continued hispreachingunto the people, saying: Hearken, and give heed unto my words;\n24. Believeand repent of your sins and bebaptizedin the name of Jesus Christ, the Son of God, even as our fathers, and ye shall receive the Holy Ghost, that ye may have all things mademanifest; and if ye do not this, the floods will come in upon you; nevertheless they hearkened not.\n25. And itrepentedNoah, and his heart was pained that the Lord had made man on the earth, and it grieved him at the heart.\n26. And the Lord said: I willdestroyman whom I have created, from the face of the earth, both man and beast, and the creeping things, and the fowls of the air; for it repenteth Noah that I have created them, and that I have made them; and he hath called upon me; for they have sought hislife.\n27. And thus Noah foundgracein the eyes of the Lord; for Noah was just man, andperfectin his generation; and hewalkedwith God, as did also his three sons, Shem, Ham, and Japheth.\n28. Theearthwascorruptbefore God, and it was filled with violence.\n29. And God looked upon the earth, and, behold, it was corrupt, for all flesh had corrupted itswayupon the earth.\n30. And God said unto Noah: The end of all flesh is come before me, for the earth is filled with violence, and behold I willdestroyall flesh from off the earth.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Moses": {
      "8": {
        "verses": {
          "1": {
            "text": "And all the days ofEnochwere four hundred and thirty years.",
            "citation": "(Moses 8:1)"
          },
          "2": {
            "text": "And it came to pass that Methuselah, the son of Enoch, wasnottaken, that the covenants of the Lord might be fulfilled, which he made to Enoch; for he truly covenanted with Enoch that Noah should be of the fruit of his loins.",
            "citation": "(Moses 8:2)"
          },
          "3": {
            "text": "And it came to pass that Methuselahprophesiedthat from his loins should spring all the kingdoms of the earth (through Noah), and he took glory unto himself.",
            "citation": "(Moses 8:3)"
          },
          "4": {
            "text": "And there came forth greatfamineinto the land, and the Lordcursedthe earth with sore curse, and many of the inhabitants thereof died.",
            "citation": "(Moses 8:4)"
          },
          "5": {
            "text": "And it came to pass that Methuselah lived one hundred and eighty-seven years, and begat Lamech;",
            "citation": "(Moses 8:5)"
          },
          "6": {
            "text": "And Methuselah lived, after he begat Lamech, seven hundred and eighty-two years, and begat sons and daughters;",
            "citation": "(Moses 8:6)"
          },
          "7": {
            "text": "And all the days of Methuselah were nine hundred and sixty-nine years, and he died.",
            "citation": "(Moses 8:7)"
          },
          "8": {
            "text": "And Lamech lived one hundred and eighty-two years, and begat son,",
            "citation": "(Moses 8:8)"
          },
          "9": {
            "text": "And he called his name Noah, saying: This son shall comfort us concerning our work and toil of our hands, because of the ground which the Lord hathcursed.",
            "citation": "(Moses 8:9)"
          },
          "10": {
            "text": "And Lamech lived, after he begat Noah, five hundred and ninety-five years, and begat sons and daughters;",
            "citation": "(Moses 8:10)"
          },
          "11": {
            "text": "And all the days of Lamech were seven hundred and seventy-seven years, and he died.",
            "citation": "(Moses 8:11)"
          },
          "12": {
            "text": "And Noah was four hundred and fifty years old, andbegatJapheth; and forty-two years afterward he begatShemof her who was the mother of Japheth, and when he was five hundred years old he begatHam.",
            "citation": "(Moses 8:12)"
          },
          "13": {
            "text": "AndNoahand his sons hearkened unto the Lord, and gave heed, and they were called thesonsof God.",
            "citation": "(Moses 8:13)"
          },
          "14": {
            "text": "And when these men began to multiply on the face of the earth, and daughters were born unto them, thesonsof men saw that those daughters were fair, and they took themwives, even as they chose.",
            "citation": "(Moses 8:14)"
          },
          "15": {
            "text": "And the Lord said unto Noah: The daughters of thy sons have sold themselves; for behold mine anger is kindled against the sons of men, for they will nothearkento my voice.",
            "citation": "(Moses 8:15)"
          },
          "16": {
            "text": "And it came to pass that Noahprophesied, and taught the things of God, even as it was in the beginning.",
            "citation": "(Moses 8:16)"
          },
          "17": {
            "text": "And the Lord said unto Noah: My Spirit shall not alwaysstrivewith man, for he shall know that allfleshshall die; yet his days shall be anhundredand twenty years; and if men do not repent, I will send in thefloodsupon them.",
            "citation": "(Moses 8:17)"
          },
          "18": {
            "text": "And in those days there weregiantson the earth, and they sought Noah to take away hislife; but the Lord was with Noah, and thepowerof the Lord was upon him.",
            "citation": "(Moses 8:18)"
          },
          "19": {
            "text": "And the LordordainedNoahafter his ownorder, and commanded him that he should go forth anddeclarehis Gospel unto the children of men, even as it was given unto Enoch.",
            "citation": "(Moses 8:19)"
          },
          "20": {
            "text": "And it came to pass that Noah called upon the children of men that they shouldrepent; but they hearkened not unto his words;",
            "citation": "(Moses 8:20)"
          },
          "21": {
            "text": "And also, after that they had heard him, they came up before him, saying: Behold, we are the sons of God; have we not taken unto ourselves the daughters of men? And are we noteatingand drinking, and marrying and giving in marriage? And our wives bear unto us children, and the same are mighty men, which are like unto men of old, men of great renown. And they hearkened not unto the words of Noah.",
            "citation": "(Moses 8:21)"
          },
          "22": {
            "text": "And God saw that thewickednessof men had become great in the earth; and every man was lifted up in theimaginationof the thoughts of his heart, being only evil continually.",
            "citation": "(Moses 8:22)"
          },
          "23": {
            "text": "And it came to pass that Noah continued hispreachingunto the people, saying: Hearken, and give heed unto my words;",
            "citation": "(Moses 8:23)"
          },
          "24": {
            "text": "Believeand repent of your sins and bebaptizedin the name of Jesus Christ, the Son of God, even as our fathers, and ye shall receive the Holy Ghost, that ye may have all things mademanifest; and if ye do not this, the floods will come in upon you; nevertheless they hearkened not.",
            "citation": "(Moses 8:24)"
          },
          "25": {
            "text": "And itrepentedNoah, and his heart was pained that the Lord had made man on the earth, and it grieved him at the heart.",
            "citation": "(Moses 8:25)"
          },
          "26": {
            "text": "And the Lord said: I willdestroyman whom I have created, from the face of the earth, both man and beast, and the creeping things, and the fowls of the air; for it repenteth Noah that I have created them, and that I have made them; and he hath called upon me; for they have sought hislife.",
            "citation": "(Moses 8:26)"
          },
          "27": {
            "text": "And thus Noah foundgracein the eyes of the Lord; for Noah was just man, andperfectin his generation; and hewalkedwith God, as did also his three sons, Shem, Ham, and Japheth.",
            "citation": "(Moses 8:27)"
          },
          "28": {
            "text": "Theearthwascorruptbefore God, and it was filled with violence.",
            "citation": "(Moses 8:28)"
          },
          "29": {
            "text": "And God looked upon the earth, and, behold, it was corrupt, for all flesh had corrupted itswayupon the earth.",
            "citation": "(Moses 8:29)"
          },
          "30": {
            "text": "And God said unto Noah: The end of all flesh is come before me, for the earth is filled with violence, and behold I willdestroyall flesh from off the earth.",
            "citation": "(Moses 8:30)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 33299,
  "total_sources": 3,
  "generated_at": "2025-12-14T04:01:27.367092"
}