{
  "week_number": 49,
  "date_range": "Micah",
  "title": "Micah;Nahum;Habakkuk;Zephaniah",
  "primary_scriptures": [],
  "all_content": "\n\n--- CFM: Micah;Nahum;Habakkuk;Zephaniah ---\nReading the Old Testament often means reading prophecies about destruction. The Lord frequently called prophets to warn the wicked about His judgments. The ministries of Micah, Nahum, Habakkuk, and Zephaniah are good examples. In dreadful detail, these prophets foretold the downfall of cities that, at the time, seemed strong and powerful: Nineveh, Babylon, and Jerusalem. But that was thousands of years ago. Why is it valuable to read these prophecies today?\nEven though those prideful, wicked cities were destroyed, prideful wickedness persists. We may even detect traces of it in our own hearts. Old Testament prophets reveal how we can turn away from these evils. Perhaps that’s one reason we still read their words today. They weren’t just prophets of doom—they were prophets of deliverance. The descriptions of destruction are tempered by invitations to come unto Christ and receive His forgiveness. As Micah put it, the Lord does not delight in condemning us, but “he delighteth in mercy” (\nMicah 7:18\n). This was the Lord’s way anciently, and it is His way today. “His ways are everlasting” (\nHabakkuk 3:6\n).\nFor overviews of these books, see “\nMicah\n,” “\nNahum\n,” “\nHabakkuk\n,” and “\nZephaniah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nMicah 6:1–8\n“What doth the Lord require of thee?”\nMicah invites us to imagine what it might be like to “come before the Lord, and bow … before the high God” (\nMicah 6:6\n). What do\nverses 6–8\nsuggest to you about what is important to the Lord as He evaluates your life?\nSee also Dale G. Renlund, “\nDo Justly, Love Mercy, and Walk Humbly with God\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 109–12.\n“The Lord is good, a strong hold in the day of trouble” (\nNahum 1:7\n).\nNahum 1\nThe Lord is both powerful and merciful.\nNahum’s mission was to foretell the destruction of Nineveh—the capital of the violent empire Assyria, which had scattered Israel and brutalized Judah. Nahum began by describing God’s wrath and matchless power, but He also spoke about God’s mercy and goodness. Look for verses in\nchapter 1\nthat help you understand each of these attributes—and other attributes of God that you notice. Why do you think it is important to know each of these things about the Lord?\nHabakkuk\nI can trust the Lord’s will and His timing.\nEven prophets sometimes have questions about the Lord’s ways. Habakkuk, who lived at a time of widespread wickedness in Judah, began his record with questions to the Lord (see\nHabakkuk 1:1–4\n). How would you summarize Habakkuk’s concerns? What similar questions do people ask about God today? Have you ever had similar feelings? You could also compare his questions with others in the scriptures, such as those found in\nMark 4:37–38\nand\nDoctrine and Covenants 121:1–6\n.\nThe Lord responded to Habakkuk’s questions by saying that He would send the Chaldeans (the Babylonians) to punish Judah (see\nHabakkuk 1:5–11\n). But Habakkuk was still troubled, for it seemed unfair for the Lord to stand by “when the wicked [Babylon] devoureth the man that is more righteous [Judah]” (see\nverses 12–17\n). What do you find in\nHabakkuk 2:1–4\nthat inspires you to trust the Lord when you have unanswered questions? (see also\nMark 4:39–40\n;\nDoctrine and Covenants 121:7–8\n; “God Will Lift Us Up” [video], Gospel Library).\n4:59\nGod Will Lift Us Up\nChapter 3\nis Habakkuk’s prayer of praise and faith. How is Habakkuk’s tone in\nchapter 3\ndifferent from\nchapter 1\n? Here’s an idea to help you ponder\nverses 17–19\n: Make a list of temporal and spiritual blessings God has given you. Then imagine that you lost the temporal blessings. How might that make you feel about the other blessings? Why might it be hard to “rejoice in the Lord” (\nverse 18\n) during hardships like those described in\nverse 17\n? Ponder how you can develop greater faith in God, even when life seems unfair.\nSee also Gerrit W. Gong, “\nAll Things for Our Good\n,”\nLiahona\n, May 2024, 41–44; “\nLead, Kindly Light\n,”\nHymns\n, no. 97; Topics and Questions, “\nSeeking Answers to Questions\n,” Gospel Library.\nBe patient.\nSometimes we want answers to our questions right away, but spiritual insights take time and cannot be forced. As the Lord told Habakkuk, “Wait for it; because it will surely come” (\nHabakkuk 2:3\n).\nZephaniah\n“Seek ye the Lord, all ye meek of the earth.”\nAs you read Zephaniah’s prophecies, notice the attitudes and behaviors that led to destruction—see especially\nZephaniah 1:4–6, 12\n;\n2:8, 10, 15\n;\n3:1–4\n. Then look for the characteristics of the people God would preserve—see\nZephaniah 2:1–3\n;\n3:12–13, 18–19\n. What message do you feel the Lord has for you in these verses?\nZephaniah 3:14–20\nThe Lord will rejoice with His people in Zion.\nAfter reading\nZephaniah 3:14–20\n, see how many ways you can complete this sentence:\n“Be glad and rejoice with all the heart” because …\nWhy is it important to you to know about these reasons to rejoice? You might compare these verses to the experiences described in\n3 Nephi 17\nand ponder how Jesus Christ feels about His people—including you.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nMicah 5:2\nJesus Christ was born in Bethlehem.\nYour children may not know that it was a prophecy by Micah that helped the Wise Men find the baby Jesus in Bethlehem. Using\nMicah 5:2\nand\nMatthew 2:1–6\n, perhaps your children could reenact their experience. Then you could talk about why Jesus’s birth was so important that prophets knew about it many years before He was born.\nThe Holy Child Is Born\n, by Dana Wood\nNahum 1:7\n“The Lord is good, a strong hold in the day of trouble.”\nAfter reading\nNahum 1:7\n, your children could build or draw a simple “strong hold” or fortress (there’s a picture of one in this outline). What are some reasons people might need a fortress? What makes our day a “day of trouble”? How is Jesus Christ like a stronghold for us?\nHabakkuk 2:3\nGod will always fulfill His promises.\nTo introduce\nHabakkuk 2:3\n, you and your children could talk about things that are good but only after we wait—like fruit that needs to ripen or dough that needs to bake. What would happen if we tried to eat the fruit or the dough before it was ready? Then you could talk about the prophet Habakkuk, who wanted to know when the Lord would stop the wickedness in the world. Read the Lord’s answer in\nHabakkuk 2:3\n. You could help your children think of things that God has promised. With each example, you could say together, “Wait for it; because it will surely come.”\nHabakkuk 2:14\nI can help fill the earth with knowledge of Jesus Christ.\nTo illustrate\nHabakkuk 2:14\n, you and your children could fill a jar or other container with pictures or words representing things Jesus did or taught. How can we help fill the world with knowledge of the Lord?\nYou could also show your children a map of the world (see Church History Maps, no. 7, “\nMap of the World\n”). Help them find the place where they live and places where missionaries they know have served. You could sing together a song about sharing the gospel, such as “\nWe’ll Bring the World His Truth\n” (\nChildren’s Songbook\n, 172–73). What can we tell others about Jesus Christ?\nZephaniah 3:14–20\nJesus Christ rejoices with those who follow Him.\nIn\nZephaniah 3:14–20\n, your children could look for something that makes them want to “sing, … be glad and rejoice with all the heart.” Perhaps you could sing some joyful hymns or songs together and talk about the joy you find in the gospel of Jesus Christ.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 49: Lesson 152: Lesson 152—MicahThis lesson can help students make a plan to do justly, love mercy, and walk humbly with Heavenly Father and Jesus Christ.; Lesson 153: Lesson 153—HabakkukThis lesson can help students maintain their faith in Jesus Christ when they have questions that seem to go unanswered. ---\n\n--- Lesson 152 ---\nMany of us wonder if our sincere efforts truly please Heavenly Father and Jesus Christ. The prophet Micah wondered what he could do to please the Lord. Micah was taught to “do justly, and to love mercy, and to walk humbly” with Him ( Micah 6:8 ). This lesson can help students make a plan to do justly, love mercy, and walk humbly with Heavenly Father and Jesus Christ. Student preparation: Invite students to think of a few family members or friends, then to think of specific things they would do to please each of those people. They could note how they might do different things for each person. Possible Learning Activities Pleasing different people Before class, you may want to write the following incomplete question on the board. Consider beginning class by inviting students to respond to the question multiple times, filling in the blank with different people each time (mom, dad, teacher, bishop, friend). Students could share in pairs or small groups. Then you could invite a few volunteers to share with the class. If needed as an example, you might share a few of your own answers using different people in your life. If you wanted to please your______________, what would you do? Why might we act differently depending on who we are trying to please? After students share a few responses to the previous questions, write Heavenly Father and Jesus Christ in the blank space on the board. Ponder what you feel pleases Heavenly Father and Jesus Christ. Think about things you currently do that might please Them and things you could do differently. At the end of the lesson, you will be invited to make a plan to follow through on impressions you receive. What can we do to please the Lord? Speaking to the people of Israel and Judah, Micah prophesied the judgments that would come upon them because of their wickedness. Micah pleaded with Israel to remember the great blessings they had received from the Lord and invited them to repent and be gathered to Him (see Micah 2–5 ). Read Micah 6:4 , looking for some of the ways the Lord had shown His love for Israel. Then read Micah 7:7–8, 18–20 , looking for what Micah said the Lord would do for His covenant people. What did you discover? How have Heavenly Father and Jesus Christ done these things for you? You could invite students to answer the previous question in their study journals and then share with a partner or the class what they wrote. After students share, you might point out that when we recognize the great things the Lord has done for us, it is natural to wonder how we can serve and please Him. Explain that the prophet Micah wrestled with the question of what we can do to please the Lord. The reading invitation and question below invite students to identify a truth from Micah’s message. Helping students identify truths from a scripture passage can help make their scripture study more meaningful. Meaningful scripture study is an important element of building faith in and conversion to Jesus Christ. (For additional training on asking questions that help students identify and state converting truths, see “ Focus on truths that lead to conversion and build faith in Jesus Christ ” in Teacher Development Skills .) Sometimes people have inaccurate ideas about what they can do to please the Lord. The prophet Micah helps us better understand the Lord’s love. In Micah 6:6–7 , the prophet uses extreme examples to demonstrate how no amount of worldly riches could please the Lord. Read Micah 6:8 , looking for what we can do to please the Lord. How would you summarize what you learned about pleasing the Lord? Students might use their own words to convey the truth that the Lord is pleased when we strive to do justly, love mercy, and walk humbly with Him. What does the Lord require? At the end of the lesson, you will invite students to make a plan to improve their efforts to please Heavenly Father and Jesus Christ in the ways identified in verse 8 . To prepare students to make this plan, consider using the handout “ What Does the Lord Require? ” After students study one or more sections of the handout with a group, you might invite them to create a three-column chart on the board labeled Do Justly , Love Mercy , and Walk Humbly . After studying the handout, students could write ways a teenager could please the Lord on small pieces of paper and tape them to the board under the corresponding column. At the end of the activity, students could read all the papers. This might help them select something they feel impressed to work on. Open PDF Showing gratitude to the Lord After students have reviewed their classmates’ suggestions, display the following instructions and prompts. Today the Holy Ghost might have inspired a thought to your mind or feeling to your heart about something that could help you do justly, love mercy, or walk humbly with the Lord. Make a plan to act on what you have learned and felt by completing the following prompts in your study journal. To better please Heavenly Father and Jesus Christ, I would like to focus on the phrase “ ” from Micah 6:8 . One or two specific things I would like to do are: . You could reassure students that Heavenly Father loves our sincere efforts to please Him. These efforts help us become more like Jesus Christ every day. You might share your witness that as we continually try to do better and be better, the Savior will magnify our sincere efforts.\n\n\n--- Lesson 153 ---\nWhen the prophet Habakkuk had questions about the wickedness around him, he sought and waited for answers from the Lord. Like Habakkuk, we can turn to the Lord with our questions. This lesson can help students understand how to maintain their faith in Jesus Christ when they have questions that seem to go unanswered. Student preparation: Invite students to ask a friend or family member if they have ever struggled with difficult questions that seemed to go unanswered. If so, students can ask what this person did to remain faithful to the Lord as they waited for answers. Possible Learning Activities Having questions is natural Hold up a jar labeled with a question mark in one hand and another jar labeled with a picture of Christ in the other hand. Explain that one jar represents questions or concerns we might have and the other jar represents our faith in the Lord and His gospel. Invite students to think about the following question before reading the statement from President Uchtdorf. Is it possible to struggle with difficult questions and have faith in Jesus Christ and His restored Church at the same time? President Dieter F. Uchtdorf, then of the First Presidency, taught: 44:24 Inquiry is the birthplace of testimony. Some might feel embarrassed or unworthy because they have searching questions regarding the gospel, but they needn’t feel that way. Asking questions isn’t a sign of weakness; it’s a precursor of growth. God commands us to seek answers to our questions and asks only that we seek “with a sincere heart, with real intent, having faith in Christ” [ Moroni 10:4 ]. When we do so, the truth of all things can be manifested to us “by the power of the Holy Ghost” [ Moroni 10:5 ]. Fear not; ask questions. Be curious, but doubt not! Always hold fast to faith and to the light you have already received. (“The Reflection in the Water” [Church Educational System fireside for young adults, Nov. 1, 2009], broadcasts.ChurchofJesusChrist.org ) Why do you think youth need to understand what President Uchtdorf taught? Difficult questions The Lord called Habakkuk to be a prophet to the kingdom of Judah before the Babylonian siege of Jerusalem. Like other prophets, Habakkuk had questions and sought understanding from the Lord (see Jeremiah 12:1 ; Doctrine and Covenants 121:1–6 ). Read Habakkuk 1:2–4 , looking for questions Habakkuk struggled with. In your study journal, describe how someone today might express similar questions or concerns. Invite students to share what they wrote. They might share things such as the following: Lord, are you hearing me? ( verse 2 ) Why is there so much violence and sin all around me? ( verse 3 ) Why do bad people get away with so much evil? ( verse 4 ) Give each student a small piece of paper to write down their answers to the following prompt. Like Habakkuk, we too might have questions. Write down a difficult question you might have that you feel hasn’t been answered yet. Students could put what they wrote in the jar representing our questions. Hold up the jar of questions and set down the jar representing our faith in Jesus Christ. Explain that when we have questions, we might be tempted to set aside our faith in Jesus Christ because we don’t have answers. What is the danger of setting aside our faith and relationship with the Lord when we have questions? Hold both jars in your hands and explain that we don’t have to set aside our faith in Jesus Christ because of questions. We can move forward with trust in the Lord as we look for answers. As you study Habakkuk, pay attention to impressions from the Holy Ghost that might help you move forward with faith in the Lord as you wait for answers. Looking to God Throughout the rest of the lesson, you might consider periodically inviting students to add things to the jar of faith. If you do this, give students several small pieces of paper to write what they learn from Habakkuk or their classmates about why or how to trust the Lord. In response to Habakkuk’s questions about the wickedness in his society, the Lord said that He would “raise up the Chaldeans” (Babylonians) to punish the children of Israel (see Habakkuk 1:6 ). Habakkuk wondered why the Lord would allow the wicked Babylonians to conquer his people (see Habakkuk 1:12–17 ). Read Habakkuk 2:1–4 , looking for what Habakkuk chose to do as he struggled with his questions and how the Lord responded. What did you find? You might ask follow-up questions like “What do you think it looks like to ‘watch to see what [God] will say’? (see Habakkuk 2:1 )” or “What does it look like to ‘live by [our] faith’? (see Habakkuk 2:4 ).” You might invite students to add something they are learning to the jar of faith. Explain that the Lord told Habakkuk that the Babylonians would eventually be punished for their wickedness (see Habakkuk 2:5–20 ). Read Habakkuk 3:17–19 , looking for how Habakkuk chose to live by his faith in the Lord. If students need help understanding Habakkuk 3:17–18 , you could explain that in verse 17 , Habakkuk described several undesirable outcomes (plants not providing fruit, fields not providing crops, and so on). In verse 18 , he said that he would “rejoice in the Lord” regardless of the outcome. You could also explain that “hinds’ feet” in Habakkuk 3:19 refers to deer feet, which enable deer to climb difficult ground. This image suggests that the Lord will give us the ability to climb our metaphorical mountains. How do Habakkuk’s attitudes and actions show his faith in God? Help students see from Habakkuk’s example that we can choose to remain faithful to the Lord while waiting for answers to our sincere questions. What do you know about Heavenly Father and Jesus Christ that helps you trust Them while waiting for answers? As students share what they know, you might ask follow-up questions like “How did you come to know that about Heavenly Father and Jesus Christ?” You might invite students to add what they are learning from Habakkuk or their classmates to the jar of faith. How to move forward Help students think about how to move forward with faith in God even though they might have questions. To do so, students could watch “ His Grace: Choosing to Believe in God ” (4:07), looking for what Adam did to remain faithful to God despite difficult questions and concerns. 4:7 Students could also read 1 Nephi 10:17–22 ; 11:1 or Mosiah 24:9–17 , or explore one of the sections in “ Seeking Answers to Questions ” in Topics and Questions (Gospel Library). What are you learning that could help a young person choose to remain faithful to God as they wait for answers? Students could share experiences of when they or someone they know chose to faithfully trust God while waiting for answers. You could also share your own experience or testify of why you trust Heavenly Father and Jesus Christ. Encourage students to write down what they have learned today that will help them trust the Lord as they wait for answers. Students could add these ideas to the jar of faith. If time permits, you could read some of the papers from the jar of faith. As you read, you might ask students to share additional thoughts or impressions that come to them. Consider keeping these jars to refer to in future lessons. For example, you might use what students have added to the jar of faith to enhance a doctrinal mastery practice lesson.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Micah;Nahum;Habakkuk;Zephaniah",
      "content": "Reading the Old Testament often means reading prophecies about destruction. The Lord frequently called prophets to warn the wicked about His judgments. The ministries of Micah, Nahum, Habakkuk, and Zephaniah are good examples. In dreadful detail, these prophets foretold the downfall of cities that, at the time, seemed strong and powerful: Nineveh, Babylon, and Jerusalem. But that was thousands of years ago. Why is it valuable to read these prophecies today?\nEven though those prideful, wicked cities were destroyed, prideful wickedness persists. We may even detect traces of it in our own hearts. Old Testament prophets reveal how we can turn away from these evils. Perhaps that’s one reason we still read their words today. They weren’t just prophets of doom—they were prophets of deliverance. The descriptions of destruction are tempered by invitations to come unto Christ and receive His forgiveness. As Micah put it, the Lord does not delight in condemning us, but “he delighteth in mercy” (\nMicah 7:18\n). This was the Lord’s way anciently, and it is His way today. “His ways are everlasting” (\nHabakkuk 3:6\n).\nFor overviews of these books, see “\nMicah\n,” “\nNahum\n,” “\nHabakkuk\n,” and “\nZephaniah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nMicah 6:1–8\n“What doth the Lord require of thee?”\nMicah invites us to imagine what it might be like to “come before the Lord, and bow … before the high God” (\nMicah 6:6\n). What do\nverses 6–8\nsuggest to you about what is important to the Lord as He evaluates your life?\nSee also Dale G. Renlund, “\nDo Justly, Love Mercy, and Walk Humbly with God\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 109–12.\n“The Lord is good, a strong hold in the day of trouble” (\nNahum 1:7\n).\nNahum 1\nThe Lord is both powerful and merciful.\nNahum’s mission was to foretell the destruction of Nineveh—the capital of the violent empire Assyria, which had scattered Israel and brutalized Judah. Nahum began by describing God’s wrath and matchless power, but He also spoke about God’s mercy and goodness. Look for verses in\nchapter 1\nthat help you understand each of these attributes—and other attributes of God that you notice. Why do you think it is important to know each of these things about the Lord?\nHabakkuk\nI can trust the Lord’s will and His timing.\nEven prophets sometimes have questions about the Lord’s ways. Habakkuk, who lived at a time of widespread wickedness in Judah, began his record with questions to the Lord (see\nHabakkuk 1:1–4\n). How would you summarize Habakkuk’s concerns? What similar questions do people ask about God today? Have you ever had similar feelings? You could also compare his questions with others in the scriptures, such as those found in\nMark 4:37–38\nand\nDoctrine and Covenants 121:1–6\n.\nThe Lord responded to Habakkuk’s questions by saying that He would send the Chaldeans (the Babylonians) to punish Judah (see\nHabakkuk 1:5–11\n). But Habakkuk was still troubled, for it seemed unfair for the Lord to stand by “when the wicked [Babylon] devoureth the man that is more righteous [Judah]” (see\nverses 12–17\n). What do you find in\nHabakkuk 2:1–4\nthat inspires you to trust the Lord when you have unanswered questions? (see also\nMark 4:39–40\n;\nDoctrine and Covenants 121:7–8\n; “God Will Lift Us Up” [video], Gospel Library).\n4:59\nGod Will Lift Us Up\nChapter 3\nis Habakkuk’s prayer of praise and faith. How is Habakkuk’s tone in\nchapter 3\ndifferent from\nchapter 1\n? Here’s an idea to help you ponder\nverses 17–19\n: Make a list of temporal and spiritual blessings God has given you. Then imagine that you lost the temporal blessings. How might that make you feel about the other blessings? Why might it be hard to “rejoice in the Lord” (\nverse 18\n) during hardships like those described in\nverse 17\n? Ponder how you can develop greater faith in God, even when life seems unfair.\nSee also Gerrit W. Gong, “\nAll Things for Our Good\n,”\nLiahona\n, May 2024, 41–44; “\nLead, Kindly Light\n,”\nHymns\n, no. 97; Topics and Questions, “\nSeeking Answers to Questions\n,” Gospel Library.\nBe patient.\nSometimes we want answers to our questions right away, but spiritual insights take time and cannot be forced. As the Lord told Habakkuk, “Wait for it; because it will surely come” (\nHabakkuk 2:3\n).\nZephaniah\n“Seek ye the Lord, all ye meek of the earth.”\nAs you read Zephaniah’s prophecies, notice the attitudes and behaviors that led to destruction—see especially\nZephaniah 1:4–6, 12\n;\n2:8, 10, 15\n;\n3:1–4\n. Then look for the characteristics of the people God would preserve—see\nZephaniah 2:1–3\n;\n3:12–13, 18–19\n. What message do you feel the Lord has for you in these verses?\nZephaniah 3:14–20\nThe Lord will rejoice with His people in Zion.\nAfter reading\nZephaniah 3:14–20\n, see how many ways you can complete this sentence:\n“Be glad and rejoice with all the heart” because …\nWhy is it important to you to know about these reasons to rejoice? You might compare these verses to the experiences described in\n3 Nephi 17\nand ponder how Jesus Christ feels about His people—including you.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nMicah 5:2\nJesus Christ was born in Bethlehem.\nYour children may not know that it was a prophecy by Micah that helped the Wise Men find the baby Jesus in Bethlehem. Using\nMicah 5:2\nand\nMatthew 2:1–6\n, perhaps your children could reenact their experience. Then you could talk about why Jesus’s birth was so important that prophets knew about it many years before He was born.\nThe Holy Child Is Born\n, by Dana Wood\nNahum 1:7\n“The Lord is good, a strong hold in the day of trouble.”\nAfter reading\nNahum 1:7\n, your children could build or draw a simple “strong hold” or fortress (there’s a picture of one in this outline). What are some reasons people might need a fortress? What makes our day a “day of trouble”? How is Jesus Christ like a stronghold for us?\nHabakkuk 2:3\nGod will always fulfill His promises.\nTo introduce\nHabakkuk 2:3\n, you and your children could talk about things that are good but only after we wait—like fruit that needs to ripen or dough that needs to bake. What would happen if we tried to eat the fruit or the dough before it was ready? Then you could talk about the prophet Habakkuk, who wanted to know when the Lord would stop the wickedness in the world. Read the Lord’s answer in\nHabakkuk 2:3\n. You could help your children think of things that God has promised. With each example, you could say together, “Wait for it; because it will surely come.”\nHabakkuk 2:14\nI can help fill the earth with knowledge of Jesus Christ.\nTo illustrate\nHabakkuk 2:14\n, you and your children could fill a jar or other container with pictures or words representing things Jesus did or taught. How can we help fill the world with knowledge of the Lord?\nYou could also show your children a map of the world (see Church History Maps, no. 7, “\nMap of the World\n”). Help them find the place where they live and places where missionaries they know have served. You could sing together a song about sharing the gospel, such as “\nWe’ll Bring the World His Truth\n” (\nChildren’s Songbook\n, 172–73). What can we tell others about Jesus Christ?\nZephaniah 3:14–20\nJesus Christ rejoices with those who follow Him.\nIn\nZephaniah 3:14–20\n, your children could look for something that makes them want to “sing, … be glad and rejoice with all the heart.” Perhaps you could sing some joyful hymns or songs together and talk about the joy you find in the gospel of Jesus Christ.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 49: Lesson 152: Lesson 152—MicahThis lesson can help students make a plan to do justly, love mercy, and walk humbly with Heavenly Father and Jesus Christ.; Lesson 153: Lesson 153—HabakkukThis lesson can help students maintain their faith in Jesus Christ when they have questions that seem to go unanswered.",
      "content": "\n--- Lesson 152 ---\nMany of us wonder if our sincere efforts truly please Heavenly Father and Jesus Christ. The prophet Micah wondered what he could do to please the Lord. Micah was taught to “do justly, and to love mercy, and to walk humbly” with Him ( Micah 6:8 ). This lesson can help students make a plan to do justly, love mercy, and walk humbly with Heavenly Father and Jesus Christ. Student preparation: Invite students to think of a few family members or friends, then to think of specific things they would do to please each of those people. They could note how they might do different things for each person. Possible Learning Activities Pleasing different people Before class, you may want to write the following incomplete question on the board. Consider beginning class by inviting students to respond to the question multiple times, filling in the blank with different people each time (mom, dad, teacher, bishop, friend). Students could share in pairs or small groups. Then you could invite a few volunteers to share with the class. If needed as an example, you might share a few of your own answers using different people in your life. If you wanted to please your______________, what would you do? Why might we act differently depending on who we are trying to please? After students share a few responses to the previous questions, write Heavenly Father and Jesus Christ in the blank space on the board. Ponder what you feel pleases Heavenly Father and Jesus Christ. Think about things you currently do that might please Them and things you could do differently. At the end of the lesson, you will be invited to make a plan to follow through on impressions you receive. What can we do to please the Lord? Speaking to the people of Israel and Judah, Micah prophesied the judgments that would come upon them because of their wickedness. Micah pleaded with Israel to remember the great blessings they had received from the Lord and invited them to repent and be gathered to Him (see Micah 2–5 ). Read Micah 6:4 , looking for some of the ways the Lord had shown His love for Israel. Then read Micah 7:7–8, 18–20 , looking for what Micah said the Lord would do for His covenant people. What did you discover? How have Heavenly Father and Jesus Christ done these things for you? You could invite students to answer the previous question in their study journals and then share with a partner or the class what they wrote. After students share, you might point out that when we recognize the great things the Lord has done for us, it is natural to wonder how we can serve and please Him. Explain that the prophet Micah wrestled with the question of what we can do to please the Lord. The reading invitation and question below invite students to identify a truth from Micah’s message. Helping students identify truths from a scripture passage can help make their scripture study more meaningful. Meaningful scripture study is an important element of building faith in and conversion to Jesus Christ. (For additional training on asking questions that help students identify and state converting truths, see “ Focus on truths that lead to conversion and build faith in Jesus Christ ” in Teacher Development Skills .) Sometimes people have inaccurate ideas about what they can do to please the Lord. The prophet Micah helps us better understand the Lord’s love. In Micah 6:6–7 , the prophet uses extreme examples to demonstrate how no amount of worldly riches could please the Lord. Read Micah 6:8 , looking for what we can do to please the Lord. How would you summarize what you learned about pleasing the Lord? Students might use their own words to convey the truth that the Lord is pleased when we strive to do justly, love mercy, and walk humbly with Him. What does the Lord require? At the end of the lesson, you will invite students to make a plan to improve their efforts to please Heavenly Father and Jesus Christ in the ways identified in verse 8 . To prepare students to make this plan, consider using the handout “ What Does the Lord Require? ” After students study one or more sections of the handout with a group, you might invite them to create a three-column chart on the board labeled Do Justly , Love Mercy , and Walk Humbly . After studying the handout, students could write ways a teenager could please the Lord on small pieces of paper and tape them to the board under the corresponding column. At the end of the activity, students could read all the papers. This might help them select something they feel impressed to work on. Open PDF Showing gratitude to the Lord After students have reviewed their classmates’ suggestions, display the following instructions and prompts. Today the Holy Ghost might have inspired a thought to your mind or feeling to your heart about something that could help you do justly, love mercy, or walk humbly with the Lord. Make a plan to act on what you have learned and felt by completing the following prompts in your study journal. To better please Heavenly Father and Jesus Christ, I would like to focus on the phrase “ ” from Micah 6:8 . One or two specific things I would like to do are: . You could reassure students that Heavenly Father loves our sincere efforts to please Him. These efforts help us become more like Jesus Christ every day. You might share your witness that as we continually try to do better and be better, the Savior will magnify our sincere efforts.\n\n\n--- Lesson 153 ---\nWhen the prophet Habakkuk had questions about the wickedness around him, he sought and waited for answers from the Lord. Like Habakkuk, we can turn to the Lord with our questions. This lesson can help students understand how to maintain their faith in Jesus Christ when they have questions that seem to go unanswered. Student preparation: Invite students to ask a friend or family member if they have ever struggled with difficult questions that seemed to go unanswered. If so, students can ask what this person did to remain faithful to the Lord as they waited for answers. Possible Learning Activities Having questions is natural Hold up a jar labeled with a question mark in one hand and another jar labeled with a picture of Christ in the other hand. Explain that one jar represents questions or concerns we might have and the other jar represents our faith in the Lord and His gospel. Invite students to think about the following question before reading the statement from President Uchtdorf. Is it possible to struggle with difficult questions and have faith in Jesus Christ and His restored Church at the same time? President Dieter F. Uchtdorf, then of the First Presidency, taught: 44:24 Inquiry is the birthplace of testimony. Some might feel embarrassed or unworthy because they have searching questions regarding the gospel, but they needn’t feel that way. Asking questions isn’t a sign of weakness; it’s a precursor of growth. God commands us to seek answers to our questions and asks only that we seek “with a sincere heart, with real intent, having faith in Christ” [ Moroni 10:4 ]. When we do so, the truth of all things can be manifested to us “by the power of the Holy Ghost” [ Moroni 10:5 ]. Fear not; ask questions. Be curious, but doubt not! Always hold fast to faith and to the light you have already received. (“The Reflection in the Water” [Church Educational System fireside for young adults, Nov. 1, 2009], broadcasts.ChurchofJesusChrist.org ) Why do you think youth need to understand what President Uchtdorf taught? Difficult questions The Lord called Habakkuk to be a prophet to the kingdom of Judah before the Babylonian siege of Jerusalem. Like other prophets, Habakkuk had questions and sought understanding from the Lord (see Jeremiah 12:1 ; Doctrine and Covenants 121:1–6 ). Read Habakkuk 1:2–4 , looking for questions Habakkuk struggled with. In your study journal, describe how someone today might express similar questions or concerns. Invite students to share what they wrote. They might share things such as the following: Lord, are you hearing me? ( verse 2 ) Why is there so much violence and sin all around me? ( verse 3 ) Why do bad people get away with so much evil? ( verse 4 ) Give each student a small piece of paper to write down their answers to the following prompt. Like Habakkuk, we too might have questions. Write down a difficult question you might have that you feel hasn’t been answered yet. Students could put what they wrote in the jar representing our questions. Hold up the jar of questions and set down the jar representing our faith in Jesus Christ. Explain that when we have questions, we might be tempted to set aside our faith in Jesus Christ because we don’t have answers. What is the danger of setting aside our faith and relationship with the Lord when we have questions? Hold both jars in your hands and explain that we don’t have to set aside our faith in Jesus Christ because of questions. We can move forward with trust in the Lord as we look for answers. As you study Habakkuk, pay attention to impressions from the Holy Ghost that might help you move forward with faith in the Lord as you wait for answers. Looking to God Throughout the rest of the lesson, you might consider periodically inviting students to add things to the jar of faith. If you do this, give students several small pieces of paper to write what they learn from Habakkuk or their classmates about why or how to trust the Lord. In response to Habakkuk’s questions about the wickedness in his society, the Lord said that He would “raise up the Chaldeans” (Babylonians) to punish the children of Israel (see Habakkuk 1:6 ). Habakkuk wondered why the Lord would allow the wicked Babylonians to conquer his people (see Habakkuk 1:12–17 ). Read Habakkuk 2:1–4 , looking for what Habakkuk chose to do as he struggled with his questions and how the Lord responded. What did you find? You might ask follow-up questions like “What do you think it looks like to ‘watch to see what [God] will say’? (see Habakkuk 2:1 )” or “What does it look like to ‘live by [our] faith’? (see Habakkuk 2:4 ).” You might invite students to add something they are learning to the jar of faith. Explain that the Lord told Habakkuk that the Babylonians would eventually be punished for their wickedness (see Habakkuk 2:5–20 ). Read Habakkuk 3:17–19 , looking for how Habakkuk chose to live by his faith in the Lord. If students need help understanding Habakkuk 3:17–18 , you could explain that in verse 17 , Habakkuk described several undesirable outcomes (plants not providing fruit, fields not providing crops, and so on). In verse 18 , he said that he would “rejoice in the Lord” regardless of the outcome. You could also explain that “hinds’ feet” in Habakkuk 3:19 refers to deer feet, which enable deer to climb difficult ground. This image suggests that the Lord will give us the ability to climb our metaphorical mountains. How do Habakkuk’s attitudes and actions show his faith in God? Help students see from Habakkuk’s example that we can choose to remain faithful to the Lord while waiting for answers to our sincere questions. What do you know about Heavenly Father and Jesus Christ that helps you trust Them while waiting for answers? As students share what they know, you might ask follow-up questions like “How did you come to know that about Heavenly Father and Jesus Christ?” You might invite students to add what they are learning from Habakkuk or their classmates to the jar of faith. How to move forward Help students think about how to move forward with faith in God even though they might have questions. To do so, students could watch “ His Grace: Choosing to Believe in God ” (4:07), looking for what Adam did to remain faithful to God despite difficult questions and concerns. 4:7 Students could also read 1 Nephi 10:17–22 ; 11:1 or Mosiah 24:9–17 , or explore one of the sections in “ Seeking Answers to Questions ” in Topics and Questions (Gospel Library). What are you learning that could help a young person choose to remain faithful to God as they wait for answers? Students could share experiences of when they or someone they know chose to faithfully trust God while waiting for answers. You could also share your own experience or testify of why you trust Heavenly Father and Jesus Christ. Encourage students to write down what they have learned today that will help them trust the Lord as they wait for answers. Students could add these ideas to the jar of faith. If time permits, you could read some of the papers from the jar of faith. As you read, you might ask students to share additional thoughts or impressions that come to them. Consider keeping these jars to refer to in future lessons. For example, you might use what students have added to the jar of faith to enhance a doctrinal mastery practice lesson.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 20799,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.403473"
}