{
  "week_number": 40,
  "date_range": "Isaiah 40–49",
  "title": "",
  "primary_scriptures": [
    {
      "book": "Isaiah",
      "chapters": [
        "40",
        "41",
        "42",
        "43",
        "44",
        "45",
        "46",
        "47",
        "48",
        "49"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Isaiah",
      "chapters": [
        "40",
        "41",
        "42",
        "43",
        "44",
        "45",
        "46",
        "47",
        "48",
        "49"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM:  ---\n“Comfort” is the first word of\nIsaiah chapter 40\n. It marks the beginning of a different tone, a different emphasis in the prophet’s message. Isaiah’s earlier writings warned Israel and Judah about destruction and captivity that would come because of their sins. But these later prophecies were meant to comfort the Jewish people over 150 years in the future—after Jerusalem and the temple were destroyed and the people were taken captive by Babylon. These prophecies, however, reach even further into the future than to the defeated, disheartened Israelites. They speak to us, who also sometimes feel defeated, disheartened, and even lost.\nIsaiah’s message to his people and to us is simple: “Fear not” (\nIsaiah 43:1\n). All is not lost. The Lord has not forgotten you, and He has power over situations that seem out of your control. Isn’t the Lord, who “created the heavens” (\nIsaiah 42:5\n), more powerful than Babylon, than sin, than whatever is holding you captive? “Return unto me,” He pleads, “for I have redeemed thee” (\nIsaiah 44:22\n). He can heal, restore, strengthen, forgive, and comfort—whatever is needed for you, in your case, to be redeemed.\nIdeas for Learning at Home and at Church\nIsaiah 40–49\nJesus Christ can comfort me and give me hope.\nWhen the Israelites were captives in Babylon, many may have wondered if they had forever lost their place as God’s chosen, covenant people. As you read\nIsaiah 40–49\n, look for passages that might have provided comfort and hope. For each passage you find, ponder and record what the Lord might be saying to\nyou\nin these verses. Here are a few you might start with:\n40:11, 29–31\n:\n41:10–13, 17–18\n:\n42:6–7\n:\n43:1–7, 25\n:\n44:1–4, 21–24\n:\n46:3–4\n:\n49:7–16\n:\nWhat do you feel the Lord wants you to know about Him?\nYou might notice that the hymn “\nHow Firm a Foundation\n” (\nHymns\n, no. 85) draws on Isaiah’s words in\nIsaiah 41:10\n;\n43:2–5\n;\n46:4\n. Consider singing or listening to this hymn, looking for parallels between the lyrics and these verses from Isaiah. How has the Lord fulfilled the promises in these verses in your life?\nSee also Patrick Kearon, “\nHe Is Risen with Healing in His Wings: We Can Be More Than Conquerors\n,”\nLiahona\n, May 2022, 37–40.\nUse additional scripture.\nSometimes we can understand the Old Testament better if we supplement our study with verses from the Book of Mormon. For example, the Book of Mormon prophets Nephi and Jacob had access to the writings of Isaiah on the plates of brass (see\n1 Nephi 19:22–23\n), and they used these prophecies to teach about the Savior. To learn how Nephi and Jacob likened\nIsaiah 48–49\nto their people, see\n1 Nephi 22\n. That may help you liken these chapters to your own life.\nBy obeying the Lord, we can have “peace … as a river” (\nIsaiah 48:18\n).\nIsaiah 40–49\n“Thou art my servant.”\nThroughout\nIsaiah 40–49\nthe Lord speaks of His “servant” and His “witnesses.” These words can refer to Jesus Christ (see\nIsaiah 42:1–7\n), to the house of Israel (see\nIsaiah 45:4\n), and to King Cyrus, who allowed the Jewish people to return to Jerusalem and rebuild the temple (see\nIsaiah 44:26–28\n;\n45:1–4\n). You might also consider how the passages apply to you as a servant and a witness of the Lord. For example, ponder questions like these:\nIsaiah 40:1–3, 9–11\n;\n43:9–12\n.\nIn what sense are you a witness of Jesus Christ? What are the “good tidings” that you can share as His witness? You might imagine that you have been called to the witness stand in a court trial. In this trial, Jesus Christ has been charged with making the claim recorded in\nIsaiah 43:11\n. What testimony could you give in support of Jesus’s claim? What evidence from your life would you present?\nIsaiah 41:8–13\n;\n42:6\n;\n44:21\n.\nWhat has the Lord called you to do? Consider Church callings as well as other opportunities to serve Him. How has He “formed” or prepared you to become His servant? How does He support you as you serve?\nIsaiah 49:1–9\n.\nWhat messages do you find in these verses that can help when your efforts and service seem to be “for nought, and in vain”? (\nverse 4\n).\nIsaiah 40:3–8, 15–23\n;\n42:15–16\n;\n47:7–11\nGod’s power is greater than worldly power.\nIsaiah repeatedly reminded his people of God’s matchless power, even compared to the oppressive worldly power that surrounded them. Look for this message as you read\nIsaiah 40:3–8, 15–23\n;\n42:15–16\n; and\n47:7–11\n(note that\nchapter 47\nis addressed to Israel’s captor, Babylon). What do these passages teach you about worldly things? What do they teach you about God? Ponder why this message might have been valuable to Jewish people in captivity. Why is it valuable to you?\nIsaiah 48:10\n;\n49:13–16\nThe Lord can refine me through my afflictions.\nAs you read\nIsaiah 48:10\n, ponder your own “furnace of affliction.” How is the Lord “refining” you? How does\nIsaiah 49:13–16\nhelp you when you suffer afflictions?\nSee also “The Refiner’s Fire” (video), Gospel Library.\n5:2\nThe Refiner's Fire\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 40:3–5\nI can help prepare “the way of the Lord.”\nThink of some ways to illustrate what it might mean to “prepare … the way of the Lord,” as described in\nIsaiah 40:3–5\n. For example, you and your children could straighten something that’s crooked, clear a cluttered floor, or make a clear path in rocky ground. You could also show pictures of John the Baptist and Joseph Smith (see\nGospel Art Book\n, nos.\n35\n,\n87\n). How did they prepare the way for the Lord’s coming? (see\nLuke 3:2–18\n;\nDoctrine and Covenants 135:3\n). How can we help? This might be an opportunity to talk about how Aaronic Priesthood holders help prepare the way of the Lord (see\nDoctrine and Covenants 84:26–28\n).\nIsaiah 43:10\nI can be a witness of the Lord.\nAfter reading\nIsaiah 43:10\ntogether, you could talk about what it means to be a witness. Share with each other things you have experienced that you can be a “witness” of—for example, a food you have tasted, a place you have visited, or a person you know. What does it mean to be the Lord’s witness? What can we tell other people about Him?\nIsaiah 44:3–4\n;\n45:8\nThe Lord will “pour” His blessings on me.\nAfter reading these verses, your children could water a plant and talk about blessings the Lord has poured out on them. What happens to a plant when we water it? How have the Lord’s blessings helped us grow?\nOur “righteousness [can be] as the waves of the sea” (\nIsaiah 48:18\n).\nIsaiah 48:17–18\nKeeping God’s commandments brings peace.\nPictures or videos of rivers and ocean waves could help your children visualize\nIsaiah 48:18\n(such as the pictures in this outline). Your children might enjoy moving their hands and arms like a river and waves of the sea. How can peace be like a river? How can righteousness be like waves? Talk about how keeping God’s commandments has helped you feel peaceful like a river or strong like a wave.\nSing together a song about commandments, such as “\nKeep the Commandments\n” (\nChildren’s Songbook\n, 146–47). What does this song teach about why we should keep God’s commandments?\nIsaiah 49:14–16\nThe Lord will never forget me.\nIsaiah 49:14–16\ncan be a great comfort to your children for years to come. As you read\nverse 14\n, you could talk about what might make people feel forgotten or forsaken. How do we know the Lord has not forgotten us?\nTo introduce\nverses 15–16\n, you could ask your children about someone who they will never forget, like a family member or friend. According to\nIsaiah 49:15–16\n, why will the Lord never forget us? Then you could share with each other your feelings about Jesus Christ.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 40: Lesson 119: Lesson 119—Isaiah 40–43This lesson can help students feel God’s comfort.; Lesson 120: Lesson 120—Isaiah 44–47This lesson can help students place Heavenly Father and Jesus Christ before anyone or anything else in their lives.... ---\n\n--- Lesson 119 ---\nGod will not abandon His covenant people. Through His prophet Isaiah, God comforted those who would eventually be taken captive into Babylon. God offers us, His covenant people today, the same words of comfort: “Fear thou not; for I am with thee” ( Isaiah 41:10 ). This lesson can help students feel God’s comfort. Student preparation: Invite students to read or listen to the words of some or all verses in the hymn “ How Firm a Foundation ” ( Hymns—for Home and Church ). Ask them to identify comforting words or phrases and to come to class prepared to share. Possible Learning Activities Fear is not new Consider beginning class by displaying the following statement and question. Students could be invited to list their answers on the board. Elder Ronald A. Rasband of the Quorum of the Twelve Apostles shared the following observation: Fear is not new. The disciples of Jesus Christ, out on the Sea of Galilee, feared the “wind, and the waves” in the dark of the night ( Mark 4:34 ). As His disciples today, we too have fears. (“ Be Not Troubled ,” Ensign or Liahona , Nov. 2018, 18) What are some fears people throughout the world, including disciples of Jesus Christ, might have? After students have listed various fears, share the remainder of Elder Rasband’s statement, which includes fears he has seen in the world today. You could add some of these to the list on the board. Elder Rasband continued: 15:42 Our single adults fear making commitments such as getting married. Young marrieds … can fear bringing children into an increasingly wicked world. Missionaries fear lots of things, especially approaching strangers. Widows fear going forward alone. Teenagers fear not being accepted; grade schoolers fear the first day of school; university students fear getting back a test. We fear failure, rejection, disappointment, and the unknown. We fear hurricanes, earthquakes, and fires that ravage the land and our lives. We fear not being chosen, and on the flip side, we fear being chosen. We fear not being good enough; we fear that the Lord has no blessings for us. We fear change, and our fears can escalate to terror. Have I included just about everyone? (“ Be Not Troubled ,” Ensign or Liahona , Nov. 2018, 18) What effect can our fears have on us? Consider inviting students to reflect on whether they can relate to any of the fears that have been listed or to think of their own fears. Share the following context to help students see circumstances that may have caused the Israelites to fear. Isaiah prophesied of the destruction and captivity that would come upon Israel and Judah. Beginning in Isaiah 40 , God inspired Isaiah to write to the Jews in the distant future who would be dwelling in captivity. What could be some fears or concerns a person in captivity might face? Read Isaiah 40:1–2 , looking for the message God instructed Isaiah to deliver to His covenant people. What attributes or characteristics of God do you learn from these verses? Share your witness that God comforts His covenant people in our day. Consider displaying the following image. Students could draw this, or something similar, in their study journals. Invite them to make marks on their drawing to answer the accompanying questions. Fear Comfort In general, where on this scale would you place your feelings about your life right now? Where would you place your feelings about the future? As you study, look for what God teaches that can help you experience more of His comfort . If you read or hear something you think might bring comfort, those thoughts could be the Holy Ghost communicating to you. Consider recording these insights near the drawing in your study journal. God comforts His people To help comfort His covenant people, God inspired Isaiah to teach many things about Him in Isaiah 40–43 . You will have the opportunity to identify some of these truths and consider how they could help comfort someone who is afraid. Display the following instructions and explain that students will have the chance to complete this activity later in the lesson. Using a passage from Isaiah, create a short message that could comfort someone who is afraid. Include each of the following: Step 1. Words or phrases from the passage that could help someone feel comforted by God. Summarize these into a simple statement of truth. Step 2. A scripture, hymn, or statement from a Church leader to support the teachings in the passage. Step 3. A personal experience or modern example that illustrates how knowing this about God can bring comfort. Model Before students complete this activity, explain that you will provide a model using Isaiah 41:10–14 . The following is one way you could model these steps. Continue to display the three steps and be very clear with students when you are demonstrating each step. Read Isaiah 41:10–14 , looking for God’s words of comfort to His covenant people. Note that worm in verse 14 can mean meek and humble . Step 1 What words or phrases do you think could be comforting? Why? How would you summarize them into a simple statement of truth? In their own words, students may have identified something such as: We don’t need to fear, because God will be with and strengthen His covenant people. Step 2 To help students understand this truth, consider singing or listening to “ How Firm a Foundation ” ( Hymns—for Home and Church ) as a class. Invite students to look for and share words or phrases they find comforting. Depending on time, you might only sing verses 3 and 7. You could also invite students to link Isaiah 41:10 to verse 3 of this hymn in Gospel Library. 3:60 How can knowing God will be with and strengthen us help us not to fear? Elder Neil L. Andersen of the Quorum of the Twelve Apostles shared how our relationship with the Lord can help us to not fear: 15:3 Even with the increasing worldly influences around us, we need not fear. The Lord will never desert His covenant people. There is a compensatory power of spiritual gifts and divine direction for the righteous. This added blessing of spiritual power, however, does not settle upon us just because we are part of this generation. It comes as we strengthen our faith in the Lord Jesus Christ and keep His commandments, as we come to know Him and love Him. (Neil L. Andersen, “ Drawing Closer to the Savior ,” Liahona , Nov. 2022, 73–74) Step 3 When have you felt that God was with you or had strengthened you? Messages of comfort Give students time to prepare their short message of comfort. They could do this individually or with a partner. Select one of the following sets of verses. Create a short message that could comfort someone who is afraid. Follow the three steps to do this. Isaiah 40:9–11 Isaiah 40:28–31 Isaiah 41:17–20 Isaiah 42:5–7 Isaiah 43:1–2 Isaiah 43:25–26 When students are ready, invite them to share their messages of comfort in groups or with the class. If students share a hymn as part of their message, you could invite them to select a verse that supports what they shared. Sing that verse together as a class. You could repeat this, depending on how much time you have available. Conclusion Give students time to reflect on what they have learned about God that can bring them comfort. Remind them that these insights may have been inspired by the Holy Ghost, who teaches and testifies of Heavenly Father and Jesus Christ. Invite students to record their thoughts in their study journals.\n\n\n--- Lesson 120 ---\nEvery day, we face influences that challenge our devotion to Heavenly Father and Jesus Christ. Faced with similar temptations, some Israelites in Isaiah’s day turned to worshipping other sources. In response, the Lord lovingly but clearly warned the Israelites against worshipping false gods. This lesson can help students place Heavenly Father and Jesus Christ before anyone or anything else in their lives. Student preparation: Invite students to think about what they have learned throughout their study of the Old Testament. Then, invite them to ponder, “How has what I’ve learned about Heavenly Father and Jesus Christ increased my desire to put Them first in my life?” Possible Learning Activities Hero worship Consider beginning class by asking the following question. If you were to survey teenagers in our area about who their heroes are, who do you think they might include? Then invite students to do the following in their study journals. Make a list of your personal heroes. Put a star next to the ones who seem to have the most influence in your life. Bishop W. Christopher Waddell of the Presiding Bishopric shared the following counsel about our heroes. 10:7 When I was a young boy, my first heroes were athletes. My earliest memories are of collecting baseball cards with the pictures and statistics of Major League Baseball players. “Hero worship” as a child can be fun and innocent, as when children dress up as their favorite superheroes for Halloween. Although we admire and respect many talented and remarkable men and women for their abilities and contributions, the degree to which they are revered, if taken to an excess, can be the equivalent of the children of Israel worshipping a golden calf in the desert of Sinai. … The hero—our hero, now and always—is Jesus Christ, and anything or anyone that distracts us from His teachings, as found in the scriptures and through the words of living prophets, can negatively impact our progress on the covenant path. (“ More Than a Hero ,” Liahona , Nov. 2023, 90) What stands out to you from Bishop Waddell’s message? To help students assess where they place Heavenly Father and Jesus Christ in their lives, you could invite them to look back at their list of heroes as they silently ponder the following questions. Do any of the heroes on your list distract you from your worship of Heavenly Father and Jesus Christ? Are there any interests, activities, or objects that might distract you from worshipping Them? As students prepare to study the teachings of Isaiah today, invite them to listen for impressions from the Holy Ghost about ways they can put Heavenly Father and Jesus Christ first in their lives. No other God Explain that the children of Israel in Isaiah’s day struggled to put the Lord first in their lives. Instead, they turned to false gods such as idols for help. Consider inviting partnerships or small groups to read the following verses and come up with a single-sentence summary of what they learned. Read Isaiah 44:6, 8 and 46:9 , looking for what the Lord wanted the children of Israel to understand about the focus of their worship. Invite several students to share the summary of what their group learned. If they don’t naturally share it, help students identify a truth similar to the following: No one and nothing on earth can compare to Jesus Christ. As part of your discussion, you might point out that Isaiah 44:6 contains several titles for Jesus Christ. You could invite students to share what these titles teach about Jesus Christ. In Isaiah 44–46 , the Lord describes the Israelites’ worship of false gods. He reminds the people that they created, worshipped, and prayed to idols made of the same wood they used to make fires and cook food. And when the Israelites were carried into captivity, their animals struggled to pull carts weighed down with their heavy man-made idols. Read Isaiah 44:14–19 and Isaiah 46:1–2 , looking for the Lord’s description of ancient idols that could apply to things that distract people from the Lord in our day. (It may be helpful to know that two of the idols they worshiped were called Bel and Nebo.) What did you find? You might write the phrase “Shall I fall down to the stock of a tree?” ( Isaiah 44:19 ) on the board. Ask students to share what this question means in their own words. Then erase the phrase “the stock of a tree” from the question, leaving “Shall I fall down to ?” Invite students to come to the board and finish the sentence in ways that apply to people in our day. What is the danger of putting these people or things ahead of Heavenly Father and Jesus Christ? Why can it be difficult to always put Heavenly Father and Jesus Christ first in our lives? Putting Jesus Christ first To help students put the Savior first in their lives, you could display an image of Jesus Christ, such as the one at the beginning of the lesson, in the center of the board. As students do the following activity, they could write the attributes they find around the image. Study at least two of the following passages. As you read the verses slowly and carefully, look for what we can learn about Jesus Christ that gives us confidence to put Him first in our lives. Isaiah 44:1–4 Isaiah 44:21–23 Isaiah 44:24–25 Isaiah 45:20–22 Isaiah 46:3–5 You might ask students to add any other attributes to the board that they know about Jesus Christ from their experiences or from other scriptures. To help students share their thoughts about the matchless power of Jesus Christ, you might ask the following. How might understanding these truths about Jesus Christ help someone who finds it difficult to put Him first in their lives? What experiences have you had that have helped you put Heavenly Father and Jesus Christ first in your life? Planning to put Heavenly Father and Jesus Christ first To help students make a plan to more fully put Heavenly Father and Jesus Christ first in their lives, you could use the handout titled “Making a Plan.” Encourage them to listen for impressions from the Holy Ghost as they determine what they would like to do to accomplish their goal. Open PDF\n\n\n--- Lesson 121 ---\nHeavenly Father and Jesus Christ know you personally and perfectly. Yet sometimes we see the challenges of mortality and cry, “The Lord has forsaken me” (see Isaiah 49:14 ). Isaiah’s words reassure us that we have been graven upon the Savior’s hands and will never be forsaken or forgotten (see Isaiah 49:16 ). This lesson can help students feel that Heavenly Father and Jesus Christ love us and will not forget us. Student preparation: Invite students to come to class having pondered experiences where they felt Heavenly Father and Jesus Christ had remembered them. They might ask a family member or friend about experiences feeling remembered by Heavenly Father and Jesus Christ. Possible Learning Activities Remembered by the Lord Consider beginning class by displaying an image of the tiny flowers called “forget-me-nots.” Sharing a childhood memory, President Dieter F. Uchtdorf, then of the First Presidency, said: 21:42 As a child, when I would look at the little forget-me-nots, I sometimes felt a little like that flower—small and insignificant. I wondered if I would be forgotten by my family or by my Heavenly Father. (“ Forget Me Not ,” Ensign or Liahona , Nov. 2011, 122) What are some reasons a teenager might feel forgotten by others or by Heavenly Father? What do you already know about Heavenly Father and Jesus Christ that you would want to share with someone who feels they are forgotten? President Uchtdorf continued: 21:42 Years later I can look back on that young boy with tenderness and compassion. And I do know now—I was never forgotten. And I know something else: as an Apostle of our Master, Jesus Christ, I proclaim with all the certainty and conviction of my heart—neither are you! You are not forgotten. (“ Forget Me Not ,” Ensign or Liahona , Nov. 2011, 122) Ponder your own experiences with Heavenly Father and Jesus Christ as you answer the following questions: How confident do you feel that They know and remember you? What experiences have you or someone you know had that help you better understand how perfectly They know and remember you? As you study Isaiah 49 today, seek impressions from the Holy Ghost testifying that Heavenly Father and Jesus Christ will never forget you. The Lord will not forget Zion You could point out that Isaiah sometimes writes in such a way that his words could be expressed by a variety of different people, including the Savior, Isaiah himself, ancient covenant Israel, or even modern-day covenant Israel. Because of this poetic style, Isaiah’s writings have wide applicability to different settings and circumstances. That is why Nephi felt very comfortable likening Isaiah’s words to himself and his people (see 1 Nephi 19:23 ). You might also explain to students that when He called Isaiah to preach repentance, the Lord knew the message would not be well received (see Isaiah 6:9–10 ). You could ask students how they would feel about a similar assignment. Read Isaiah 49:4–5 , thinking about why Isaiah may have felt this way. Then read them thinking about how God’s covenant people could feel this way. Even when we suffer, what do these verses help us remember about the Lord? Read Isaiah 49:13–16 , looking for what the Lord wanted His covenant people (Zion) to understand. How would you summarize this as a statement of truth? Students may use their own words, but help them recognize the truth that the Lord loves us and will never forget or forsake us. In preparation for the following journal activity, you might display images of the Savior on the cross and the nail prints in His resurrected hands. Consider playing quiet, sacred music to invite the Spirit as students write. Cross-reference or link Isaiah 49:16 with John 19:15–19 and 3 Nephi 11:10–15 . Slowly read these passages, marking words and phrases that help you feel the love Heavenly Father and Jesus Christ have for you. Look for teachings that help you understand why They will not forget or forsake you. To help students visualize what they read in John 19 and 3 Nephi 11 , you could show the videos “ Jesus Is Scourged and Crucified ” from time code 2:31 to 3:11 and “ Jesus Christ Appears at the Temple | 3 Nephi 11:1–17 ” from time code 2:23 to 4:57 from ChurchofJesusChrist.org . 4:45 5:38 He will not forget us In your study journal, write a paragraph that explains what the Savior saying “I have graven [you] on the palms of my hands” ( Isaiah 49:16 ) means to you. When truths in the scriptures are also taught by living prophets, students can more readily see the relevance of these teachings in their lives today. The following handout provides one way to help students make these connections. (For additional training on invitations that help connect students to the words of prophets, see “ Teach from the scriptures and the words of latter-day prophets ” in Teacher Development Skills .) Consider using the handout “ I Will Not Forget Thee ” to help deepen students’ understanding that Heavenly Father and Jesus Christ will not forget them. You could place some or all of the quotes and scripture references from the handout around the room. Other helpful quotes are available in Additional Resources. Students could quietly move around the room, reading several of the quotes and scripture passages. They could add to the paragraph they wrote in their journals. As part of the activity, consider asking students to write on the board something they have learned in the lesson today. Students could read what others have written and add insights to their journal entry. Open PDF Share what you have felt When students have finished studying the handout, volunteers could share what they found meaningful from the quotes, scriptures, and personal insights. To conclude class, you could invite students to respond to the following questions either with a partner, in small groups, or with the class. What do you hope to remember from what you have learned and felt as you studied Isaiah 49 today? What is something you could do to remember that Heavenly Father and Jesus Christ will never forget you?\n\n--- SCRIPTURE: Isaiah 40 ---\n1. Comfort ye,comfortye my people, saith your God.\n2. Speak ye comfortably to Jerusalem, and cry unto her, that herwarfareis accomplished, that her iniquity ispardoned: for she hathreceived of theLords handdoublefor all her sins.\n3. Thevoiceof him that crieth in the wilderness,Prepareye thewayof theLord, make straight in the desert ahighwayfor our God.\n4. Everyvalleyshall beexalted, and everymountainand hill shall be madelow: and thecrookedshall be made straight, andthe rough places plain:\n5. And thegloryof theLordshall berevealed, and all flesh shallseeittogether: for the mouth of theLordhath spokenit.\n6. The voice said, Cry. And he said, What shall I cry? Allfleshisgrass, and all the goodliness thereofisas the flower of the field:\n7. The grass withereth, the flower fadeth: because the spirit of theLordbloweth upon it: surely the peopleisgrass.\n8. The grass withereth, the flower fadeth: but thewordof our God shall stand for ever.\n9. OZion, that bringestgoodtidings, get thee up into the high mountain; O Jerusalem, that bringest good tidings, lift up thy voice with strength; liftitup, be not afraid; say unto the cities ofJudah, Behold your God!\n10. Behold, the LordGodwill come with stronghand,and hisarmshall rule for him: behold, hisrewardiswith him, and his work before him.\n11. He shall feed hisflocklike ashepherd: he shall gather the lambs with his arm, and carrythemin his bosom,andshall gently lead those that are with young.\n12. Who hath measured the waters in the hollow of his hand, and meted out heaven with the span, and comprehended the dust of the earth in measure, and weighed the mountains in scales, and the hills in balance?\n13. Who hathdirectedtheSpiritof theLord, orbeinghiscounsellorhath taught him?\n14. With whom took hecounsel, andwhoinstructed him, and taught him in the path ofjudgment, and taught him knowledge, and shewed to him the way of understanding?\n15. Behold, thenationsareas adropof bucket, and are counted as the small dust of the balance: behold, he taketh up theislesas very little thing.\n16. And Lebanonisnot sufficient to burn, nor the beasts thereof sufficient for burnt offering.\n17. All nations before himareas nothing; and they are counted to him less than nothing, andvanity.\n18. To whom then will yelikenGod? or what likeness will ye compare unto him?\n19. The workman melteth graven image, and thegoldsmithspreadeth it over with gold, and casteth silver chains.\n20. He thatisso impoverished that he hath no oblation chooseth treethatwill not rot; he seeketh unto hima cunning workman to prepare graven image,thatshallnot be moved.\n21. Have ye not known? have ye not heard? hath it not been told you from the beginning? have ye not understood from the foundations of the earth?\n22. It ishe that sitteth upon the circle of the earth, and the inhabitants thereofareas grasshoppers; thatstretchethout the heavens as curtain, and spreadeth them out as tent to dwell in:\n23. That bringeth theprincesto nothing; he maketh the judges of the earth as vanity.\n24. Yea, they shall not be planted; yea, they shall not be sown: yea, their stock shall not take root in the earth: and he shall also blow upon them, and they shall wither, and the whirlwind shall take them away as stubble.\n25. To whom then will ye liken me, or shall I be equal? saith the Holy One.\n26. Lift up your eyes on high, and behold who hath created thesethings,that bringeth out their host by number: he calleth them all bynamesby the greatness of his might, for thathe isstrong in power; not one faileth.\n27. Why sayest thou, O Jacob, and speakest, O Israel, My way is hid from theLord, and my judgment ispassed over frommy God?\n28. Hast thou not known? hast thou not heard,thattheeverlastingGod, theLord, theCreatorof the ends of the earth, fainteth not, neither is weary?there isnosearchingof his understanding.\n29. He giveth power to the faint; and tothem that haveno might he increaseth strength.\n30. Even the youths shall faint and be weary, and the young men shall utterly fall:\n31. But they thatwait upontheLordshallrenewtheirstrength; they shall mount up with wings aseagles; they shallrun, and not be weary;andthey shall walk, and not faint.\n\n--- SCRIPTURE: Isaiah 41 ---\n1. Keepsilencebefore me, O islands; and let the peoplerenewtheirstrength: let them come near; then let them speak: let us come neartogetherto judgment.\n2. Who raised up the righteousmanfrom theeast, called him to his foot, gave the nations before him, and madehimruleover kings? he gavethemas the dust to his sword,andas driven stubble to his bow.\n3. He pursued them,andpassed safely;evenby the waythathe had not gone with his feet.\n4. Who hath wrought and doneit,calling the generations from the beginning? I theLord, thefirst, and with the last; Iamhe.\n5. The isles sawit,and feared; the ends of the earth were afraid, drew near, and came.\n6. Theyhelpedevery one his neighbour; andevery onesaid to his brother, Be of good courage.\n7. So the carpenter encouraged the goldsmith,andhe that smoothethwiththe hammer him that smote the anvil, saying, Itisready for the sodering: and he fastened it with nails,thatitshould notbe moved.\n8. But thou, Israel,artmy servant,Jacob whom I havechosen, the seed of Abraham myfriend.\n9. Thouwhom I have taken from the ends of the earth, and called thee from the chief men thereof, and said unto thee, Thouartmyservant; I have chosen thee, and not cast thee away.\n10. Fearthou not; for Iamwith thee: be not dismayed; for Iamthy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of my righteousness.\n11. Behold, all they that were incensed against thee shall be ashamed and confounded: they shall be as nothing; and they that strive with thee shallperish.\n12. Thou shalt seek them, and shalt not find them,eventhem that contended with thee: they that war against thee shall be as nothing, and as thing of nought.\n13. For I theLordthy God will hold thy right hand, saying unto thee, Fear not; I will help thee.\n14. Fear not, thouwormJacob,andye men of Israel; I will help thee, saith theLord, and thyredeemer, theHoly Oneof Israel.\n15. Behold, I will make thee new sharp threshing instrument having teeth: thou shalt thresh themountains, and beatthemsmall, and shalt make the hills as chaff.\n16. Thou shaltfanthem, and the wind shall carry them away, and the whirlwind shall scatter them: and thou shalt rejoice in theLord,andshalt glory in the Holy One of Israel.\n17. Whenthe poor and needy seek water, andthere isnone,andtheir tongue faileth for thirst, I theLordwill hear them,Ithe God of Israel will notforsakethem.\n18. I will openriversin high places, and fountains in the midst of the valleys: I will make thewildernessa pool of water, and the dry land springs of water.\n19. I will plant in the wilderness the cedar, theshittahtree, and the myrtle, and the oil tree; I will set in the desert thefirtree,andthepine, and the box tree together:\n20. That they may see, and know, and consider, and understand together, that the hand of theLordhath done this, and the Holy One of Israel hathcreatedit.\n21. Produce your cause, saith theLord; bring forth yourstrongreasons,saith the King of Jacob.\n22. Let them bringthemforth, and shew us what shall happen: let them shew the former things, what theybe,that we may consider them, and know the latter end of them; or declare us things for to come.\n23. Shew the things that are to come hereafter, that we may know that yearegods: yea, do good, or do evil, that we may be dismayed, and beholdittogether.\n24. Behold, yeareof nothing, and your work of nought: anabominationis he thatchooseth you.\n25. I have raised uponefrom the north, and he shall come: from the rising of the sun shall he call upon my name: and he shall come upon princes asuponmortar, and as the potter treadeth clay.\n26. Who hathdeclaredfrom the beginning, that we may know? and beforetime, that we may say,He isrighteous? yea,there isnone that sheweth, yea,there isnone that declareth, yea,there isnone that heareth your words.\n27. The firstshall sayto Zion,Behold, behold them: and I will give to Jerusalem one that bringeth good tidings.\n28. For I beheld, andthere wasno man; even among them, andthere wasno counsellor, that, when I asked of them, could answer word.\n29. Behold, theyareallvanity; their worksarenothing: their moltenimagesarewind and confusion.\n\n--- SCRIPTURE: Isaiah 42 ---\n1. Behold myservant, whom I uphold; mineelect,in whommy soul delighteth; I haveputmyspiritupon him: he shall bring forthjudgmentto the Gentiles.\n2. He shall not cry, norlift up, nor cause his voice to be heard in the street.\n3. Abruised reed shall he not break, and the smoking flax shall he not quench: he shall bring forth judgment unto truth.\n4. He shall not fail nor be discouraged, till he have set judgment in the earth: and theislesshall wait for his law.\n5. Thus saith God theLord, he thatcreatedthe heavens, and stretched them out; he that spread forth the earth, and that which cometh out of it; he that givethbreathunto the people upon it, andspiritto them thatwalktherein:\n6. I theLordhave called thee in righteousness, and will hold thine hand, and will keep thee, and give thee for acovenantof the people, for alightof theGentiles;\n7. Toopentheblindeyes, to bring out theprisonersfrom theprison,andthem that sit in darkness out of the prison house.\n8. IamtheLord: thatismy name: and my glory will I not give to another, neither my praise to graven images.\n9. Behold, theformerthings are come to pass, and new things do I declare: before they spring forth I tellyouof them.\n10. Singunto theLorda new song,andhis praise from the end of the earth, ye that go down to the sea, and all that is therein; the isles, and the inhabitants thereof.\n11. Let the wilderness and the cities thereof lift uptheir voice,the villagesthatKedar doth inhabit: let the inhabitants of the rock sing, let them shout from the top of the mountains.\n12. Let them give glory unto theLord, and declare his praise in the islands.\n13. TheLordshall go forth as mighty man, he shall stir upjealousylike man ofwar: he shall cry, yea, roar; he shall prevail against his enemies.\n14. I have long time holden my peace; I have been still,andrefrainedmyself:nowwill I cry like travailing woman; I willdestroyand devour at once.\n15. I will make waste mountains and hills, and dry up all their herbs; and I will make the rivers islands, and I will dry up the pools.\n16. And I will bring the blind by waythatthey knew not; I will lead them in pathsthatthey have not known: I will makedarknesslight before them, and crooked things straight. These things will I do unto them, and not forsake them.\n17. They shall be turned back, they shall be greatly ashamed, that trust in graven images, that say to the molten images, Yeareour gods.\n18. Hear, ye deaf; and look, ye blind, that ye may see.\n19. Whoisblind, but my servant? or deaf, as my messengerthatI sent? whoisblind ashe that isperfect, and blind as theLords servant?\n20. Seeingmany things, but thou observest not; opening the ears, but he heareth not.\n21. TheLordis well pleased for his righteousness sake; he will magnify the law, and makeithonourable.\n22. But thisisapeoplerobbed and spoiled;they areall of them snared in holes, and they are hid in prison houses: they are for prey, and none delivereth; for spoil, and none saith,Restore.\n23. Who among you will give ear to this?whowill hearken and hear for the time to come?\n24. Who gave Jacob for spoil, andIsraelto the robbers? did not theLord, he against whom we have sinned? for they would notwalkin his ways, neither were theyobedientunto his law.\n25. Therefore he hath poured upon him the fury of his anger, and the strength of battle: and it hath set him on fire round about, yet he knew not; and it burned him, yet he laiditnot to heart.\n\n--- SCRIPTURE: Isaiah 43 ---\n1. But now thus saith theLordthat created thee, O Jacob, and he that formed thee, O Israel, Fear not: for I haveredeemed thee, I have calledtheeby thy name; thouartmine.\n2. When thou passest through thewaters, Iwill bewith thee; and through the rivers, they shall not overflow thee: when thou walkest through thefire, thou shalt not beburned; neither shall the flame kindle upon thee.\n3. For IamtheLordthy God, theHoly Oneof Israel, thySaviour: I gaveEgyptforthyransom, Ethiopia andSebafor thee.\n4. Since thou wastpreciousin my sight, thou hast been honourable, and I have loved thee: therefore will I give men for thee, and people for thy life.\n5. Fear not: for Iamwith thee: I willbringthy seed from the east, and gather thee from the west;\n6. I will say to thenorth,Give up; and to the south, Keep not back: bring my sons from far, and my daughters from the ends of the earth;\n7. Evenevery one that is called by my name: for I havecreatedhim for my glory, I have formed him; yea, I have made him.\n8. Bring forth the blind peoplethat have eyes, and the deaf that have ears.\n9. Let all the nations be gathered together, and let the people be assembled: who among them can declare this, and shew us former things? let them bring forth their witnesses, that they may be justified: or let them hear, and say,It istruth.\n10. Yearemywitnesses, saith theLord, and my servant whom I havechosen: that ye may know andbelieveme, and understand that Iamhe: before me there was no God formed, neither shall there be after me.\n11. I,evenI,amtheLord; andbesidemethere isnosaviour.\n12. I have declared, and have saved, and I have shewed, whenthere wasno strangegodamong you: therefore yearemy witnesses, saith theLord, that IamGod.\n13. Yea, before the daywasIamhe; andthere isnone that can deliver out of my hand: I will work, and who shalllet it?\n14. Thus saith theLord, yourredeemer, the Holy One of Israel; For your sake I have sent to Babylon, and have brought down all their nobles, and the Chaldeans, whose cryisin the ships.\n15. IamtheLord, your Holy One, the creator of Israel, yourKing.\n16. Thus saith theLord, whichmaketha way in the sea, and path in the mighty waters;\n17. Which bringeth forth the chariot and horse, the army and the power; they shalllie downtogether, they shall not rise: they are extinct, they arequenched as tow.\n18. Remember ye not the former things, neither consider the things of old.\n19. Behold, I will do new thing; now it shall spring forth; shall ye not know it? I will even make way in thewilderness,andriversin the desert.\n20. The beast of the field shall honour me, thedragons and the owls: because I give waters in the wilderness,andrivers in the desert, to give drink to my people, my chosen.\n21. Thispeoplehave I formed for myself; they shall shew forth my praise.\n22. But thou hast not called upon me, O Jacob; but thou hast been weary of me, O Israel.\n23. Thou hast not brought me thesmall cattleof thy burnt offerings; neither hast thou honoured me with thy sacrifices. I have not caused thee to serve with an offering, nor wearied thee with incense.\n24. Thou hast bought me nosweet canewith money, neither hast thou filled me with the fat of thy sacrifices: but thou hastmademe to serve with thy sins, thou hastweariedme with thine iniquities.\n25. I,evenI,amhe thatblottethout thytransgressionsfor mine ownsake, and will not remember thy sins.\n26. Put me in remembrance: let us plead together:declarethou, that thou mayest be justified.\n27. Thyfirst fatherhath sinned, and thy teachers have transgressed against me.\n28. Therefore I haveprofanedtheprincesof the sanctuary, and have given Jacob to the curse, and Israel to reproaches.\n\n--- SCRIPTURE: Isaiah 44 ---\n1. Yet now hear, O Jacob myservant; and Israel, whom I have chosen:\n2. Thus saith theLordthat made thee, andformedthee from the womb,whichwill help thee; Fear not, O Jacob, my servant; and thou,Jesurun, whom I have chosen.\n3. For I will pour water uponhimthat isthirsty, and floods upon the dry ground: I will pour myspiritupon thy seed, and my blessing upon thine offspring:\n4. And they shall spring upasamong the grass, as willows by the water courses.\n5. One shall say, IamtheLords; and another shall callhimselfby thenameof Jacob; and another shall subscribewithhis hand unto theLord, and surnamehimselfby the name of Israel.\n6. Thus saith theLordtheKingof Israel, and his redeemer theLordof hosts; Iamthefirst, and Iamthe last; and beside methere isno God.\n7. And who, as I, shall call, and shall declare it, and set it in order for me, since I appointed the ancient people? and the things that are coming, and shall come, let them shew unto them.\n8. Fearye not, neither be afraid: have not I told thee from that time, and have declaredit?yeareeven my witnesses. Is there God beside me? yea,there isnoGod; I know notany.\n9. They that make gravenimageareall of them vanity; and theirdelectable thingsshall not profit; and theyaretheir own witnesses; theysee not, nor know; that they may be ashamed.\n10. Who hath formed god, or molten gravenimagethatis profitable for nothing?\n11. Behold, all hisfellowsshall be ashamed: and the workmen, theyareof men: let them all be gathered together, let them stand up;yetthey shall fear,andthey shall be ashamed together.\n12. Thesmithwith the tongs both worketh in the coals, and fashioneth it with hammers, and worketh it with the strength of his arms: yea, he is hungry, and his strength faileth: he drinketh no water, and is faint.\n13. The carpenter stretcheth outhisrule; he marketh it out with line; he fitteth it with planes, and he marketh it out with the compass, and maketh it after the figure of man, according to the beauty of man; that it may remain in the house.\n14. He heweth him down cedars, and taketh the cypress and the oak, which he strengtheneth for himself among the trees of the forest: he planteth an ash, and the rain doth nourishit.\n15. Then shall it be for man to burn: for he will take thereof, and warm himself; yea, he kindlethit,and baketh bread; yea, he maketh god, and worshippethit;he maketh it graven image, and falleth down thereto.\n16. He burneth part thereof in the fire; with part thereof he eateth flesh; he roasteth roast, and is satisfied: yea, he warmethhimself,andsaith, Aha, I am warm, I have seen the fire:\n17. And the residue thereof he maketh god,evenhis graven image: he falleth down unto it, and worshippethit,and prayeth unto it, and saith, Deliver me; for thouartmy god.\n18. They have notknownnor understood: for he hathshuttheir eyes, that they cannot see;andtheirhearts, that they cannot understand.\n19. And none considereth in his heart, neitheris thereknowledge nor understanding to say, I have burned part of it in the fire; yea, also I have baked bread upon the coals thereof; I have roasted flesh, and eatenit:and shall I make the residue thereof an abomination? shall I fall down to thestockof tree?\n20. He feedeth on ashes: adeceivedheart hath turned him aside, that he cannot deliver his soul, nor say,Is therenot aliein my right hand?\n21. Rememberthese, O Jacob and Israel; for thouartmyservant: I have formed thee; thouartmy servant: O Israel, thou shalt not beforgottenof me.\n22. I have blotted out, as thick cloud, thytransgressions, and, as cloud, thy sins: return unto me; for I have redeemed thee.\n23. Sing, O ye heavens; for theLordhath doneit:shout, ye lower parts of the earth: break forth intosinging, ye mountains, O forest, and every tree therein: for theLordhathredeemedJacob, and glorified himself in Israel.\n24. Thus saith theLord, thyredeemer, and he thatformedthee from the womb, IamtheLordthatmakethallthings;that stretcheth forth the heavens alone; that spreadeth abroad the earth by myself;\n25. That frustrateth the tokens of the liars, and maketh diviners mad; that turnethwisemenbackward, and maketh their knowledge foolish;\n26. That confirmeth the word of his servant, and performeth the counsel of his messengers; that saith to Jerusalem, Thou shalt be inhabited; and to the cities of Judah, Ye shall be built, and I will raise up the decayed places thereof:\n27. That saith to the deep, Be dry, and I willdry upthy rivers:\n28. That saith ofCyrus,He ismyshepherd, and shall perform all mypleasure: even saying to Jerusalem, Thou shalt bebuilt; and to thetemple, Thy foundation shall be laid.\n\n--- SCRIPTURE: Isaiah 45 ---\n1. Thus saith theLordto hisanointed, toCyrus, whose right hand I haveholden, tosubduenations before him; and I will loose the loins of kings, to open before him thetwo leaved gates; and the gates shall not be shut;\n2. I will go before thee, and make thecrookedplaces straight: I willbreakin pieces the gates of brass, and cut in sunder the bars of iron:\n3. And I will give thee thetreasures of darkness, and hidden riches of secret places, that thou mayest know that I, theLord, which calltheeby thyname,amtheGodof Israel.\n4. For Jacob myservantssake, and Israel mineelect, I have evencalledthee by thy name: I have surnamed thee, though thou hast not known me.\n5. IamtheLord, andthere isnone else,there isno God beside me: I girded thee, though thou hast not known me:\n6. That they may know from therisingof the sun, and from the west, thatthere isnone beside me. IamtheLord, andthere isnone else.\n7. I form thelight, and create darkness: I make peace, and createevil: I theLorddo all thesethings.\n8. Drop down, ye heavens, from above, and let the skies pour downrighteousness: let the earth open, and letthembring forthsalvation, and let righteousness spring up together; I theLordhave created it.\n9. Woe unto him thatstrivethwith hisMaker!Letthe potsherdstrivewith the potsherds of the earth. Shall theclaysay to him that fashioneth it, What makest thou? or thy work, He hath no hands?\n10. Woe unto him that saith untohisfather, What begettest thou? or tothe woman, What hast thou brought forth?\n11. Thus saith theLord, the Holy One of Israel, and his Maker, Ask me of things to come concerning mysons, and concerning theworkof my handscommand ye me.\n12. I havemadethe earth, andcreatedman upon it: I,evenmy hands, have stretched out the heavens, and all theirhosthave I commanded.\n13. I have raisedhimup in righteousness, and I will direct all his ways: he shallbuildmy city, and he shall let go my captives, not forpricenor reward, saith theLordof hosts.\n14. Thus saith theLord, The labour ofEgypt, and merchandise of Ethiopia and of the Sabeans, men of stature, shall come over unto thee, and they shall be thine: they shall comeafterthee; in chains they shall come over, and they shall fall down unto thee, they shall make supplication unto thee,saying,Surely Godisin thee; andthere isnoneelse,there isno God.\n15. Verily thouarta God thathidestthyself, O God of Israel, theSaviour.\n16. They shall be ashamed, and also confounded, all of them: they shall go to confusion togetherthat aremakers ofidols.\n17. ButIsrael shall besavedin theLordwith an everlastingsalvation: ye shall not be ashamed nor confounded world without end.\n18. For thus saith theLordthatcreatedthe heavens; God himself that formed the earth and made it; he hath established it, he created it not in vain, he formed it to beinhabited: IamtheLord; andthere isnone else.\n19. I have not spoken insecret, in dark place of the earth: I said not unto the seed of Jacob, Seek ye me in vain: I theLordspeakrighteousness, I declare things that areright.\n20. Assemble yourselves and come; draw near together, yethat areescapedof thenations: they have noknowledgethat set up the wood of their graven image, andprayunto godthatcannot save.\n21. Tell ye, and bringthemnear; yea, let them take counsel together: who hath declared this from ancient time?whohath told it from that time?havenot I theLord? andthere isno God else beside me; ajustGod and aSaviour;there isnone beside me.\n22. Lookunto me, and be yesaved, all the ends of the earth: for IamGod, andthere isnone else.\n23. I have sworn by myself, the word is gone out of my mouthinrighteousness, and shall not return, That unto me everykneeshall bow, every tongue shallswear.\n24. Surely, shallonesay, in theLordhave I righteousness andstrength:evento him shallmencome; and all that are incensed against him shall be ashamed.\n25. In theLordshall all the seed of Israel bejustified, and shall glory.\n\n--- SCRIPTURE: Isaiah 46 ---\n1. Belboweth down, Nebo stoopeth, their idols were upon the beasts, and upon the cattle: your carriageswereheavy loaden;they areaburdento the wearybeast.\n2. Theystoop, they bow down together; they could not deliver the burden, but themselves are gone into captivity.\n3. Hearken unto me, O house of Jacob, and all theremnantof the house of Israel, which are borneby mefrom the belly, which are carried from the womb:\n4. Andeventoyouroldage Iamhe; andeventohoar hairswill I carryyou:I have made, and I will bear; even I willcarry, and willdeliveryou.\n5. To whom will yelikenme, and makemeequal, and compare me, that we may be like?\n6. They lavish gold out of the bag, and weigh silver in the balance,andhire goldsmith; and he maketh it god: they fall down, yea, theyworship.\n7. Theybearhim upon the shoulder, they carry him, and set him in his place, and he standeth; from his place shall he not remove: yea,oneshallcryunto him, yet can he not answer, nor save him out of his trouble.\n8. Remember this, and shew yourselvesmen: bringitagain to mind, O ye transgressors.\n9. Remembertheformerthings of old: forIamGod, andthere isnone else;I amGod, andthere isnonelike me,\n10. Declaringtheendfrom the beginning, and from ancient timesthe thingsthat are notyetdone, saying, Mycounselshall stand, and I will do all mypleasure:\n11. Calling aravenous birdfrom theeast, the man that executeth my counsel from far country: yea, I havespokenit,I will also bring it to pass; I have purposedit,I will also do it.\n12. Hearken unto me, yestouthearted, thatarefar from righteousness:\n13. I bring near my righteousness; it shall not be far off, and mysalvationshall nottarry: and I will place salvation in Zion for Israel my glory.\n\n--- SCRIPTURE: Isaiah 47 ---\n1. Come down, and sit in the dust, O virgin daughter ofBabylon, sit on the ground:there isnothrone, Odaughter of the Chaldeans: for thou shalt no more be called tender and delicate.\n2. Takethe millstones, and grind meal: uncover thy locks, make bare the leg, uncover the thigh,pass over the rivers.\n3. Thy nakedness shall be uncovered, yea, thy shame shall be seen: I will take vengeance, andIwill not meetthee asa man.\n4. As forour redeemer, theLordof hostsishis name, the Holy One of Israel.\n5. Sit thou silent, andget thee into darkness, O daughter of the Chaldeans: for thou shalt no more be called, The lady of kingdoms.\n6. I was wroth with my people, I have polluted mine inheritance, andgiventhem into thine hand: thou didst shew them no mercy; upon the ancient hast thou very heavily laid thy yoke.\n7. And thou saidst, I shall bea ladyfor ever:sothat thou didst not lay thesethingsto thy heart, neither didst remember the latterendof it.\n8. Therefore hear now this,thou that artgiven to pleasures, that dwellest carelessly, that sayest in thine heart, Iam,and none else beside me; I shall not sitasawidow, neither shall I know theloss of children:\n9. But these twothingsshall come to thee in moment in one day, the loss of children, and widowhood: they shall come upon theein their perfectionfor the multitude of thy sorceries,andfor the great abundance of thine enchantments.\n10. For thou hast trusted in thy wickedness: thou hast said, Noneseethme. Thy wisdom and thy knowledge, it hath perverted thee; and thou hast said in thine heart, Iam,and none else beside me.\n11. Therefore shall evil come upon thee; thou shalt not know fromwhence it riseth: andmischiefshall fall upon thee; thou shalt not be able to put it off: anddesolationshall come upon thee suddenly,whichthou shalt not know.\n12. Stand now with thine enchantments, and with the multitude of thy sorceries, wherein thou hast laboured from thy youth; if so be thou shalt be able to profit, if so be thou mayest prevail.\n13. Thou art wearied in the multitude of thy counsels. Let now theastrologers, the stargazers, themonthlyprognosticators, stand up, and save thee fromthese thingsthat shall come upon thee.\n14. Behold, they shall be asstubble; the fire shall burn them; they shall not deliver themselves from the power of the flame:there shallnotbea coal to warm at,norfire to sit before it.\n15. Thus shall they be unto thee with whom thou hast laboured,eventhy merchants, from thy youth: they shall wander every one to his quarter; none shall save thee.\n\n--- SCRIPTURE: Isaiah 48 ---\n1. Hear ye this, O house of Jacob, which are called by the name of Israel, and are come forth out of thewaters of Judah, whichswearby the name of theLord, and makementionof the God of Israel,butnot in truth, nor in righteousness.\n2. For they call themselves of theholy city, andstay themselves uponthe God of Israel; TheLordof hostsishis name.\n3. I havedeclaredtheformerthings from the beginning; and they went forth out of my mouth, and I shewed them; I didthemsuddenly, and they came to pass.\n4. Because I knew thatthouartobstinate, and thyneckisan iron sinew, and thy brow brass;\n5. I have even from the beginning declareditto thee; before it came to pass I sheweditthee: lest thou shouldest say, Mine idol hath done them, and my graven image, and my molten image, hath commanded them.\n6. Thou hast heard, see all this; and will not ye declareit?I have shewed thee new things from this time, even hidden things, and thou didst not know them.\n7. They are created now, and not from the beginning; even before the day when thou heardest them not; lest thou shouldest say, Behold, I knew them.\n8. Yea, thou heardest not; yea, thou knewest not; yea, from that timethatthine ear was not opened: for I knew that thou wouldest deal very treacherously, and wast called transgressor from thewomb.\n9. For mynamessake will I defer mineanger, and for my praise will I refrain for thee, that I cut thee not off.\n10. Behold, I have refined thee, but not with silver; I have chosen thee in thefurnaceofaffliction.\n11. For mine ownsake,evenfor mine own sake, will I doit:for how shouldmynamebe polluted? and I will notgivemy glory unto another.\n12. Hearken unto me, O Jacob and Israel, my called; Iamhe; Iamthe first, I alsoamthe last.\n13. Mine hand also hath laid thefoundation of theearth, and my right hand hath spanned the heavens:whenI call unto them, they stand up together.\n14. All ye, assemble yourselves, and hear; which among them hath declared thesethings?TheLordhath loved him: he will do hispleasureonBabylon, and his armshall be onthe Chaldeans.\n15. I,evenI, have spoken; yea, I have called him: I have brought him, and he shall make his way prosperous.\n16. Come ye near unto me, hear ye this; I have not spoken insecretfrom the beginning; from the time that it was, thereamI: and now the LordGod, and his Spirit, hathsentme.\n17. Thus saith theLord, thy Redeemer, the Holy One of Israel; IamtheLordthy God which teacheth thee to profit, whichleadeththee by the waythatthou shouldest go.\n18. O that thou hadst hearkened to my commandments! then had thypeacebeen as river, and thy righteousness as the waves of the sea:\n19. Thyseedalso had been as the sand, and the offspring of thy bowels like the gravel thereof; his name should not have been cut off nor destroyed from before me.\n20. Go ye forth ofBabylon, flee ye from theChaldeans, with voice of singing declare ye, tell this, utter itevento the end of the earth; say ye, TheLordhath redeemed his servant Jacob.\n21. And they thirsted notwhenhe led them through the deserts: he caused thewatersto flow out of the rock for them: he clave the rock also, and the waters gushed out.\n22. There isnopeace, saith theLord, unto the wicked.\n\n--- SCRIPTURE: Isaiah 49 ---\n1. Listen, O isles, unto me; andhearken, ye people, from far; TheLordhathcalledme from the womb; from the bowels of my mother hath he made mention of my name.\n2. And he hath made my mouth like sharpsword; in the shadow of his hand hath he hid me, and made me polished shaft; in his quiver hath he hid me;\n3. And said unto me, Thouartmyservant, O Israel, in whom I will beglorified.\n4. Then I said, I have laboured in vain, I have spent my strength for nought, and in vain:yetsurely my judgmentiswith theLord, and my work with my God.\n5. And now, saith theLordthatformedme from the wombto behis servant, to bring Jacob again to him, Though Israel be not gathered, yet shall I be glorious in the eyes of theLord, and my God shall be my strength.\n6. And he said, It is light thing that thou shouldest be my servant to raise up the tribes of Jacob, and to restore the preserved of Israel: I will also give thee for alightto theGentiles, that thou mayest be mysalvationunto the end of the earth.\n7. Thus saith theLord, the Redeemer of Israel,andhis Holy One, to him whom man despiseth, to him whom the nation abhorreth, to servant of rulers, Kings shall see and arise, princes also shall worship, because of theLordthat is faithful,andthe Holy One of Israel, and he shall choose thee.\n8. Thus saith theLord, In an acceptabletimehave I heard thee, and in day of salvation have I helped thee: and I will preserve thee, and give thee for acovenantof the people, to establish the earth, to cause toinheritthe desolate heritages;\n9. That thou mayest say to theprisoners, Go forth; to them thatarein darkness, Shew yourselves. They shall feed in the ways, and their pasturesshall bein all high places.\n10. They shall not hunger northirst; neither shall the heat norsunsmite them: for he that hath mercy on them shall lead them, even by the springs of water shall he guide them.\n11. And I will make all my mountains way, and myhighwaysshall be exalted.\n12. Behold, these shall come from far: and, lo, these from thenorthand from the west; and these from the land of Sinim.\n13. Sing, O heavens; and be joyful, O earth; and break forth intosinging, O mountains: for theLordhathcomfortedhis people, and will havemercyupon hisafflicted.\n14. But Zion said, TheLordhathforsakenme, and my Lord hath forgotten me.\n15. Can awomanforget her sucking child, that she should not have compassion on the son of her womb? yea, they may forget, yet will I notforgetthee.\n16. Behold, I have graven thee upon the palms ofmyhands; thy wallsarecontinually before me.\n17. Thy children shall make haste; thy destroyers and they that made thee waste shall go forth of thee.\n18. Lift up thine eyes round about, and behold: all thesegatherthemselves together,andcome to thee.AsI live, saith theLord, thou shalt surely clothe thee with them all, as with an ornament, and bind themon thee,as bridedoeth.\n19. For thy waste and thy desolate places, and the land of thy destruction, shall even now be too narrow by reason of the inhabitants, and they that swallowed thee up shall be far away.\n20. The children which thou shalt have, after thou hast lost the other, shall say again in thine ears, The placeistoostraitfor me: give place to me that I may dwell.\n21. Then shaltthousay in thine heart, Who hath begotten me these, seeing I have lost my children, and amdesolate, captive, and removing to and fro? and who hath brought up these? Behold, I was left alone; these, wherehadtheybeen?\n22. Thus saith the LordGod, Behold, I willlift upmine hand to theGentiles, and set up mystandardto the people: and they shall bring thysonsintheirarms, and thy daughters shall be carried upontheirshoulders.\n23. And kings shall be thynursingfathers, and their queens thy nursingmothers: they shallbowdown to thee withtheirface toward the earth, and lick up the dust of thy feet; and thou shalt know that IamtheLord: for they shall not beashamedthat wait for me.\n24. Shall the prey be taken from the mighty, or the lawful captive delivered?\n25. But thus saith theLord, Even the captives of the mighty shall be taken away, and the prey of the terrible shall be delivered: for I willcontendwith him that contendeth with thee, and I will save thy children.\n26. And I will feed them thatoppressthee with their own flesh; and they shall be drunken with their own blood, as with sweet wine: and all flesh shallknowthat I theLordamthySaviourand thyRedeemer, themighty Oneof Jacob.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "",
      "content": "“Comfort” is the first word of\nIsaiah chapter 40\n. It marks the beginning of a different tone, a different emphasis in the prophet’s message. Isaiah’s earlier writings warned Israel and Judah about destruction and captivity that would come because of their sins. But these later prophecies were meant to comfort the Jewish people over 150 years in the future—after Jerusalem and the temple were destroyed and the people were taken captive by Babylon. These prophecies, however, reach even further into the future than to the defeated, disheartened Israelites. They speak to us, who also sometimes feel defeated, disheartened, and even lost.\nIsaiah’s message to his people and to us is simple: “Fear not” (\nIsaiah 43:1\n). All is not lost. The Lord has not forgotten you, and He has power over situations that seem out of your control. Isn’t the Lord, who “created the heavens” (\nIsaiah 42:5\n), more powerful than Babylon, than sin, than whatever is holding you captive? “Return unto me,” He pleads, “for I have redeemed thee” (\nIsaiah 44:22\n). He can heal, restore, strengthen, forgive, and comfort—whatever is needed for you, in your case, to be redeemed.\nIdeas for Learning at Home and at Church\nIsaiah 40–49\nJesus Christ can comfort me and give me hope.\nWhen the Israelites were captives in Babylon, many may have wondered if they had forever lost their place as God’s chosen, covenant people. As you read\nIsaiah 40–49\n, look for passages that might have provided comfort and hope. For each passage you find, ponder and record what the Lord might be saying to\nyou\nin these verses. Here are a few you might start with:\n40:11, 29–31\n:\n41:10–13, 17–18\n:\n42:6–7\n:\n43:1–7, 25\n:\n44:1–4, 21–24\n:\n46:3–4\n:\n49:7–16\n:\nWhat do you feel the Lord wants you to know about Him?\nYou might notice that the hymn “\nHow Firm a Foundation\n” (\nHymns\n, no. 85) draws on Isaiah’s words in\nIsaiah 41:10\n;\n43:2–5\n;\n46:4\n. Consider singing or listening to this hymn, looking for parallels between the lyrics and these verses from Isaiah. How has the Lord fulfilled the promises in these verses in your life?\nSee also Patrick Kearon, “\nHe Is Risen with Healing in His Wings: We Can Be More Than Conquerors\n,”\nLiahona\n, May 2022, 37–40.\nUse additional scripture.\nSometimes we can understand the Old Testament better if we supplement our study with verses from the Book of Mormon. For example, the Book of Mormon prophets Nephi and Jacob had access to the writings of Isaiah on the plates of brass (see\n1 Nephi 19:22–23\n), and they used these prophecies to teach about the Savior. To learn how Nephi and Jacob likened\nIsaiah 48–49\nto their people, see\n1 Nephi 22\n. That may help you liken these chapters to your own life.\nBy obeying the Lord, we can have “peace … as a river” (\nIsaiah 48:18\n).\nIsaiah 40–49\n“Thou art my servant.”\nThroughout\nIsaiah 40–49\nthe Lord speaks of His “servant” and His “witnesses.” These words can refer to Jesus Christ (see\nIsaiah 42:1–7\n), to the house of Israel (see\nIsaiah 45:4\n), and to King Cyrus, who allowed the Jewish people to return to Jerusalem and rebuild the temple (see\nIsaiah 44:26–28\n;\n45:1–4\n). You might also consider how the passages apply to you as a servant and a witness of the Lord. For example, ponder questions like these:\nIsaiah 40:1–3, 9–11\n;\n43:9–12\n.\nIn what sense are you a witness of Jesus Christ? What are the “good tidings” that you can share as His witness? You might imagine that you have been called to the witness stand in a court trial. In this trial, Jesus Christ has been charged with making the claim recorded in\nIsaiah 43:11\n. What testimony could you give in support of Jesus’s claim? What evidence from your life would you present?\nIsaiah 41:8–13\n;\n42:6\n;\n44:21\n.\nWhat has the Lord called you to do? Consider Church callings as well as other opportunities to serve Him. How has He “formed” or prepared you to become His servant? How does He support you as you serve?\nIsaiah 49:1–9\n.\nWhat messages do you find in these verses that can help when your efforts and service seem to be “for nought, and in vain”? (\nverse 4\n).\nIsaiah 40:3–8, 15–23\n;\n42:15–16\n;\n47:7–11\nGod’s power is greater than worldly power.\nIsaiah repeatedly reminded his people of God’s matchless power, even compared to the oppressive worldly power that surrounded them. Look for this message as you read\nIsaiah 40:3–8, 15–23\n;\n42:15–16\n; and\n47:7–11\n(note that\nchapter 47\nis addressed to Israel’s captor, Babylon). What do these passages teach you about worldly things? What do they teach you about God? Ponder why this message might have been valuable to Jewish people in captivity. Why is it valuable to you?\nIsaiah 48:10\n;\n49:13–16\nThe Lord can refine me through my afflictions.\nAs you read\nIsaiah 48:10\n, ponder your own “furnace of affliction.” How is the Lord “refining” you? How does\nIsaiah 49:13–16\nhelp you when you suffer afflictions?\nSee also “The Refiner’s Fire” (video), Gospel Library.\n5:2\nThe Refiner's Fire\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 40:3–5\nI can help prepare “the way of the Lord.”\nThink of some ways to illustrate what it might mean to “prepare … the way of the Lord,” as described in\nIsaiah 40:3–5\n. For example, you and your children could straighten something that’s crooked, clear a cluttered floor, or make a clear path in rocky ground. You could also show pictures of John the Baptist and Joseph Smith (see\nGospel Art Book\n, nos.\n35\n,\n87\n). How did they prepare the way for the Lord’s coming? (see\nLuke 3:2–18\n;\nDoctrine and Covenants 135:3\n). How can we help? This might be an opportunity to talk about how Aaronic Priesthood holders help prepare the way of the Lord (see\nDoctrine and Covenants 84:26–28\n).\nIsaiah 43:10\nI can be a witness of the Lord.\nAfter reading\nIsaiah 43:10\ntogether, you could talk about what it means to be a witness. Share with each other things you have experienced that you can be a “witness” of—for example, a food you have tasted, a place you have visited, or a person you know. What does it mean to be the Lord’s witness? What can we tell other people about Him?\nIsaiah 44:3–4\n;\n45:8\nThe Lord will “pour” His blessings on me.\nAfter reading these verses, your children could water a plant and talk about blessings the Lord has poured out on them. What happens to a plant when we water it? How have the Lord’s blessings helped us grow?\nOur “righteousness [can be] as the waves of the sea” (\nIsaiah 48:18\n).\nIsaiah 48:17–18\nKeeping God’s commandments brings peace.\nPictures or videos of rivers and ocean waves could help your children visualize\nIsaiah 48:18\n(such as the pictures in this outline). Your children might enjoy moving their hands and arms like a river and waves of the sea. How can peace be like a river? How can righteousness be like waves? Talk about how keeping God’s commandments has helped you feel peaceful like a river or strong like a wave.\nSing together a song about commandments, such as “\nKeep the Commandments\n” (\nChildren’s Songbook\n, 146–47). What does this song teach about why we should keep God’s commandments?\nIsaiah 49:14–16\nThe Lord will never forget me.\nIsaiah 49:14–16\ncan be a great comfort to your children for years to come. As you read\nverse 14\n, you could talk about what might make people feel forgotten or forsaken. How do we know the Lord has not forgotten us?\nTo introduce\nverses 15–16\n, you could ask your children about someone who they will never forget, like a family member or friend. According to\nIsaiah 49:15–16\n, why will the Lord never forget us? Then you could share with each other your feelings about Jesus Christ.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 40: Lesson 119: Lesson 119—Isaiah 40–43This lesson can help students feel God’s comfort.; Lesson 120: Lesson 120—Isaiah 44–47This lesson can help students place Heavenly Father and Jesus Christ before anyone or anything else in their lives....",
      "content": "\n--- Lesson 119 ---\nGod will not abandon His covenant people. Through His prophet Isaiah, God comforted those who would eventually be taken captive into Babylon. God offers us, His covenant people today, the same words of comfort: “Fear thou not; for I am with thee” ( Isaiah 41:10 ). This lesson can help students feel God’s comfort. Student preparation: Invite students to read or listen to the words of some or all verses in the hymn “ How Firm a Foundation ” ( Hymns—for Home and Church ). Ask them to identify comforting words or phrases and to come to class prepared to share. Possible Learning Activities Fear is not new Consider beginning class by displaying the following statement and question. Students could be invited to list their answers on the board. Elder Ronald A. Rasband of the Quorum of the Twelve Apostles shared the following observation: Fear is not new. The disciples of Jesus Christ, out on the Sea of Galilee, feared the “wind, and the waves” in the dark of the night ( Mark 4:34 ). As His disciples today, we too have fears. (“ Be Not Troubled ,” Ensign or Liahona , Nov. 2018, 18) What are some fears people throughout the world, including disciples of Jesus Christ, might have? After students have listed various fears, share the remainder of Elder Rasband’s statement, which includes fears he has seen in the world today. You could add some of these to the list on the board. Elder Rasband continued: 15:42 Our single adults fear making commitments such as getting married. Young marrieds … can fear bringing children into an increasingly wicked world. Missionaries fear lots of things, especially approaching strangers. Widows fear going forward alone. Teenagers fear not being accepted; grade schoolers fear the first day of school; university students fear getting back a test. We fear failure, rejection, disappointment, and the unknown. We fear hurricanes, earthquakes, and fires that ravage the land and our lives. We fear not being chosen, and on the flip side, we fear being chosen. We fear not being good enough; we fear that the Lord has no blessings for us. We fear change, and our fears can escalate to terror. Have I included just about everyone? (“ Be Not Troubled ,” Ensign or Liahona , Nov. 2018, 18) What effect can our fears have on us? Consider inviting students to reflect on whether they can relate to any of the fears that have been listed or to think of their own fears. Share the following context to help students see circumstances that may have caused the Israelites to fear. Isaiah prophesied of the destruction and captivity that would come upon Israel and Judah. Beginning in Isaiah 40 , God inspired Isaiah to write to the Jews in the distant future who would be dwelling in captivity. What could be some fears or concerns a person in captivity might face? Read Isaiah 40:1–2 , looking for the message God instructed Isaiah to deliver to His covenant people. What attributes or characteristics of God do you learn from these verses? Share your witness that God comforts His covenant people in our day. Consider displaying the following image. Students could draw this, or something similar, in their study journals. Invite them to make marks on their drawing to answer the accompanying questions. Fear Comfort In general, where on this scale would you place your feelings about your life right now? Where would you place your feelings about the future? As you study, look for what God teaches that can help you experience more of His comfort . If you read or hear something you think might bring comfort, those thoughts could be the Holy Ghost communicating to you. Consider recording these insights near the drawing in your study journal. God comforts His people To help comfort His covenant people, God inspired Isaiah to teach many things about Him in Isaiah 40–43 . You will have the opportunity to identify some of these truths and consider how they could help comfort someone who is afraid. Display the following instructions and explain that students will have the chance to complete this activity later in the lesson. Using a passage from Isaiah, create a short message that could comfort someone who is afraid. Include each of the following: Step 1. Words or phrases from the passage that could help someone feel comforted by God. Summarize these into a simple statement of truth. Step 2. A scripture, hymn, or statement from a Church leader to support the teachings in the passage. Step 3. A personal experience or modern example that illustrates how knowing this about God can bring comfort. Model Before students complete this activity, explain that you will provide a model using Isaiah 41:10–14 . The following is one way you could model these steps. Continue to display the three steps and be very clear with students when you are demonstrating each step. Read Isaiah 41:10–14 , looking for God’s words of comfort to His covenant people. Note that worm in verse 14 can mean meek and humble . Step 1 What words or phrases do you think could be comforting? Why? How would you summarize them into a simple statement of truth? In their own words, students may have identified something such as: We don’t need to fear, because God will be with and strengthen His covenant people. Step 2 To help students understand this truth, consider singing or listening to “ How Firm a Foundation ” ( Hymns—for Home and Church ) as a class. Invite students to look for and share words or phrases they find comforting. Depending on time, you might only sing verses 3 and 7. You could also invite students to link Isaiah 41:10 to verse 3 of this hymn in Gospel Library. 3:60 How can knowing God will be with and strengthen us help us not to fear? Elder Neil L. Andersen of the Quorum of the Twelve Apostles shared how our relationship with the Lord can help us to not fear: 15:3 Even with the increasing worldly influences around us, we need not fear. The Lord will never desert His covenant people. There is a compensatory power of spiritual gifts and divine direction for the righteous. This added blessing of spiritual power, however, does not settle upon us just because we are part of this generation. It comes as we strengthen our faith in the Lord Jesus Christ and keep His commandments, as we come to know Him and love Him. (Neil L. Andersen, “ Drawing Closer to the Savior ,” Liahona , Nov. 2022, 73–74) Step 3 When have you felt that God was with you or had strengthened you? Messages of comfort Give students time to prepare their short message of comfort. They could do this individually or with a partner. Select one of the following sets of verses. Create a short message that could comfort someone who is afraid. Follow the three steps to do this. Isaiah 40:9–11 Isaiah 40:28–31 Isaiah 41:17–20 Isaiah 42:5–7 Isaiah 43:1–2 Isaiah 43:25–26 When students are ready, invite them to share their messages of comfort in groups or with the class. If students share a hymn as part of their message, you could invite them to select a verse that supports what they shared. Sing that verse together as a class. You could repeat this, depending on how much time you have available. Conclusion Give students time to reflect on what they have learned about God that can bring them comfort. Remind them that these insights may have been inspired by the Holy Ghost, who teaches and testifies of Heavenly Father and Jesus Christ. Invite students to record their thoughts in their study journals.\n\n\n--- Lesson 120 ---\nEvery day, we face influences that challenge our devotion to Heavenly Father and Jesus Christ. Faced with similar temptations, some Israelites in Isaiah’s day turned to worshipping other sources. In response, the Lord lovingly but clearly warned the Israelites against worshipping false gods. This lesson can help students place Heavenly Father and Jesus Christ before anyone or anything else in their lives. Student preparation: Invite students to think about what they have learned throughout their study of the Old Testament. Then, invite them to ponder, “How has what I’ve learned about Heavenly Father and Jesus Christ increased my desire to put Them first in my life?” Possible Learning Activities Hero worship Consider beginning class by asking the following question. If you were to survey teenagers in our area about who their heroes are, who do you think they might include? Then invite students to do the following in their study journals. Make a list of your personal heroes. Put a star next to the ones who seem to have the most influence in your life. Bishop W. Christopher Waddell of the Presiding Bishopric shared the following counsel about our heroes. 10:7 When I was a young boy, my first heroes were athletes. My earliest memories are of collecting baseball cards with the pictures and statistics of Major League Baseball players. “Hero worship” as a child can be fun and innocent, as when children dress up as their favorite superheroes for Halloween. Although we admire and respect many talented and remarkable men and women for their abilities and contributions, the degree to which they are revered, if taken to an excess, can be the equivalent of the children of Israel worshipping a golden calf in the desert of Sinai. … The hero—our hero, now and always—is Jesus Christ, and anything or anyone that distracts us from His teachings, as found in the scriptures and through the words of living prophets, can negatively impact our progress on the covenant path. (“ More Than a Hero ,” Liahona , Nov. 2023, 90) What stands out to you from Bishop Waddell’s message? To help students assess where they place Heavenly Father and Jesus Christ in their lives, you could invite them to look back at their list of heroes as they silently ponder the following questions. Do any of the heroes on your list distract you from your worship of Heavenly Father and Jesus Christ? Are there any interests, activities, or objects that might distract you from worshipping Them? As students prepare to study the teachings of Isaiah today, invite them to listen for impressions from the Holy Ghost about ways they can put Heavenly Father and Jesus Christ first in their lives. No other God Explain that the children of Israel in Isaiah’s day struggled to put the Lord first in their lives. Instead, they turned to false gods such as idols for help. Consider inviting partnerships or small groups to read the following verses and come up with a single-sentence summary of what they learned. Read Isaiah 44:6, 8 and 46:9 , looking for what the Lord wanted the children of Israel to understand about the focus of their worship. Invite several students to share the summary of what their group learned. If they don’t naturally share it, help students identify a truth similar to the following: No one and nothing on earth can compare to Jesus Christ. As part of your discussion, you might point out that Isaiah 44:6 contains several titles for Jesus Christ. You could invite students to share what these titles teach about Jesus Christ. In Isaiah 44–46 , the Lord describes the Israelites’ worship of false gods. He reminds the people that they created, worshipped, and prayed to idols made of the same wood they used to make fires and cook food. And when the Israelites were carried into captivity, their animals struggled to pull carts weighed down with their heavy man-made idols. Read Isaiah 44:14–19 and Isaiah 46:1–2 , looking for the Lord’s description of ancient idols that could apply to things that distract people from the Lord in our day. (It may be helpful to know that two of the idols they worshiped were called Bel and Nebo.) What did you find? You might write the phrase “Shall I fall down to the stock of a tree?” ( Isaiah 44:19 ) on the board. Ask students to share what this question means in their own words. Then erase the phrase “the stock of a tree” from the question, leaving “Shall I fall down to ?” Invite students to come to the board and finish the sentence in ways that apply to people in our day. What is the danger of putting these people or things ahead of Heavenly Father and Jesus Christ? Why can it be difficult to always put Heavenly Father and Jesus Christ first in our lives? Putting Jesus Christ first To help students put the Savior first in their lives, you could display an image of Jesus Christ, such as the one at the beginning of the lesson, in the center of the board. As students do the following activity, they could write the attributes they find around the image. Study at least two of the following passages. As you read the verses slowly and carefully, look for what we can learn about Jesus Christ that gives us confidence to put Him first in our lives. Isaiah 44:1–4 Isaiah 44:21–23 Isaiah 44:24–25 Isaiah 45:20–22 Isaiah 46:3–5 You might ask students to add any other attributes to the board that they know about Jesus Christ from their experiences or from other scriptures. To help students share their thoughts about the matchless power of Jesus Christ, you might ask the following. How might understanding these truths about Jesus Christ help someone who finds it difficult to put Him first in their lives? What experiences have you had that have helped you put Heavenly Father and Jesus Christ first in your life? Planning to put Heavenly Father and Jesus Christ first To help students make a plan to more fully put Heavenly Father and Jesus Christ first in their lives, you could use the handout titled “Making a Plan.” Encourage them to listen for impressions from the Holy Ghost as they determine what they would like to do to accomplish their goal. Open PDF\n\n\n--- Lesson 121 ---\nHeavenly Father and Jesus Christ know you personally and perfectly. Yet sometimes we see the challenges of mortality and cry, “The Lord has forsaken me” (see Isaiah 49:14 ). Isaiah’s words reassure us that we have been graven upon the Savior’s hands and will never be forsaken or forgotten (see Isaiah 49:16 ). This lesson can help students feel that Heavenly Father and Jesus Christ love us and will not forget us. Student preparation: Invite students to come to class having pondered experiences where they felt Heavenly Father and Jesus Christ had remembered them. They might ask a family member or friend about experiences feeling remembered by Heavenly Father and Jesus Christ. Possible Learning Activities Remembered by the Lord Consider beginning class by displaying an image of the tiny flowers called “forget-me-nots.” Sharing a childhood memory, President Dieter F. Uchtdorf, then of the First Presidency, said: 21:42 As a child, when I would look at the little forget-me-nots, I sometimes felt a little like that flower—small and insignificant. I wondered if I would be forgotten by my family or by my Heavenly Father. (“ Forget Me Not ,” Ensign or Liahona , Nov. 2011, 122) What are some reasons a teenager might feel forgotten by others or by Heavenly Father? What do you already know about Heavenly Father and Jesus Christ that you would want to share with someone who feels they are forgotten? President Uchtdorf continued: 21:42 Years later I can look back on that young boy with tenderness and compassion. And I do know now—I was never forgotten. And I know something else: as an Apostle of our Master, Jesus Christ, I proclaim with all the certainty and conviction of my heart—neither are you! You are not forgotten. (“ Forget Me Not ,” Ensign or Liahona , Nov. 2011, 122) Ponder your own experiences with Heavenly Father and Jesus Christ as you answer the following questions: How confident do you feel that They know and remember you? What experiences have you or someone you know had that help you better understand how perfectly They know and remember you? As you study Isaiah 49 today, seek impressions from the Holy Ghost testifying that Heavenly Father and Jesus Christ will never forget you. The Lord will not forget Zion You could point out that Isaiah sometimes writes in such a way that his words could be expressed by a variety of different people, including the Savior, Isaiah himself, ancient covenant Israel, or even modern-day covenant Israel. Because of this poetic style, Isaiah’s writings have wide applicability to different settings and circumstances. That is why Nephi felt very comfortable likening Isaiah’s words to himself and his people (see 1 Nephi 19:23 ). You might also explain to students that when He called Isaiah to preach repentance, the Lord knew the message would not be well received (see Isaiah 6:9–10 ). You could ask students how they would feel about a similar assignment. Read Isaiah 49:4–5 , thinking about why Isaiah may have felt this way. Then read them thinking about how God’s covenant people could feel this way. Even when we suffer, what do these verses help us remember about the Lord? Read Isaiah 49:13–16 , looking for what the Lord wanted His covenant people (Zion) to understand. How would you summarize this as a statement of truth? Students may use their own words, but help them recognize the truth that the Lord loves us and will never forget or forsake us. In preparation for the following journal activity, you might display images of the Savior on the cross and the nail prints in His resurrected hands. Consider playing quiet, sacred music to invite the Spirit as students write. Cross-reference or link Isaiah 49:16 with John 19:15–19 and 3 Nephi 11:10–15 . Slowly read these passages, marking words and phrases that help you feel the love Heavenly Father and Jesus Christ have for you. Look for teachings that help you understand why They will not forget or forsake you. To help students visualize what they read in John 19 and 3 Nephi 11 , you could show the videos “ Jesus Is Scourged and Crucified ” from time code 2:31 to 3:11 and “ Jesus Christ Appears at the Temple | 3 Nephi 11:1–17 ” from time code 2:23 to 4:57 from ChurchofJesusChrist.org . 4:45 5:38 He will not forget us In your study journal, write a paragraph that explains what the Savior saying “I have graven [you] on the palms of my hands” ( Isaiah 49:16 ) means to you. When truths in the scriptures are also taught by living prophets, students can more readily see the relevance of these teachings in their lives today. The following handout provides one way to help students make these connections. (For additional training on invitations that help connect students to the words of prophets, see “ Teach from the scriptures and the words of latter-day prophets ” in Teacher Development Skills .) Consider using the handout “ I Will Not Forget Thee ” to help deepen students’ understanding that Heavenly Father and Jesus Christ will not forget them. You could place some or all of the quotes and scripture references from the handout around the room. Other helpful quotes are available in Additional Resources. Students could quietly move around the room, reading several of the quotes and scripture passages. They could add to the paragraph they wrote in their journals. As part of the activity, consider asking students to write on the board something they have learned in the lesson today. Students could read what others have written and add insights to their journal entry. Open PDF Share what you have felt When students have finished studying the handout, volunteers could share what they found meaningful from the quotes, scriptures, and personal insights. To conclude class, you could invite students to respond to the following questions either with a partner, in small groups, or with the class. What do you hope to remember from what you have learned and felt as you studied Isaiah 49 today? What is something you could do to remember that Heavenly Father and Jesus Christ will never forget you?",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 40",
      "content": "1. Comfort ye,comfortye my people, saith your God.\n2. Speak ye comfortably to Jerusalem, and cry unto her, that herwarfareis accomplished, that her iniquity ispardoned: for she hathreceived of theLords handdoublefor all her sins.\n3. Thevoiceof him that crieth in the wilderness,Prepareye thewayof theLord, make straight in the desert ahighwayfor our God.\n4. Everyvalleyshall beexalted, and everymountainand hill shall be madelow: and thecrookedshall be made straight, andthe rough places plain:\n5. And thegloryof theLordshall berevealed, and all flesh shallseeittogether: for the mouth of theLordhath spokenit.\n6. The voice said, Cry. And he said, What shall I cry? Allfleshisgrass, and all the goodliness thereofisas the flower of the field:\n7. The grass withereth, the flower fadeth: because the spirit of theLordbloweth upon it: surely the peopleisgrass.\n8. The grass withereth, the flower fadeth: but thewordof our God shall stand for ever.\n9. OZion, that bringestgoodtidings, get thee up into the high mountain; O Jerusalem, that bringest good tidings, lift up thy voice with strength; liftitup, be not afraid; say unto the cities ofJudah, Behold your God!\n10. Behold, the LordGodwill come with stronghand,and hisarmshall rule for him: behold, hisrewardiswith him, and his work before him.\n11. He shall feed hisflocklike ashepherd: he shall gather the lambs with his arm, and carrythemin his bosom,andshall gently lead those that are with young.\n12. Who hath measured the waters in the hollow of his hand, and meted out heaven with the span, and comprehended the dust of the earth in measure, and weighed the mountains in scales, and the hills in balance?\n13. Who hathdirectedtheSpiritof theLord, orbeinghiscounsellorhath taught him?\n14. With whom took hecounsel, andwhoinstructed him, and taught him in the path ofjudgment, and taught him knowledge, and shewed to him the way of understanding?\n15. Behold, thenationsareas adropof bucket, and are counted as the small dust of the balance: behold, he taketh up theislesas very little thing.\n16. And Lebanonisnot sufficient to burn, nor the beasts thereof sufficient for burnt offering.\n17. All nations before himareas nothing; and they are counted to him less than nothing, andvanity.\n18. To whom then will yelikenGod? or what likeness will ye compare unto him?\n19. The workman melteth graven image, and thegoldsmithspreadeth it over with gold, and casteth silver chains.\n20. He thatisso impoverished that he hath no oblation chooseth treethatwill not rot; he seeketh unto hima cunning workman to prepare graven image,thatshallnot be moved.\n21. Have ye not known? have ye not heard? hath it not been told you from the beginning? have ye not understood from the foundations of the earth?\n22. It ishe that sitteth upon the circle of the earth, and the inhabitants thereofareas grasshoppers; thatstretchethout the heavens as curtain, and spreadeth them out as tent to dwell in:\n23. That bringeth theprincesto nothing; he maketh the judges of the earth as vanity.\n24. Yea, they shall not be planted; yea, they shall not be sown: yea, their stock shall not take root in the earth: and he shall also blow upon them, and they shall wither, and the whirlwind shall take them away as stubble.\n25. To whom then will ye liken me, or shall I be equal? saith the Holy One.\n26. Lift up your eyes on high, and behold who hath created thesethings,that bringeth out their host by number: he calleth them all bynamesby the greatness of his might, for thathe isstrong in power; not one faileth.\n27. Why sayest thou, O Jacob, and speakest, O Israel, My way is hid from theLord, and my judgment ispassed over frommy God?\n28. Hast thou not known? hast thou not heard,thattheeverlastingGod, theLord, theCreatorof the ends of the earth, fainteth not, neither is weary?there isnosearchingof his understanding.\n29. He giveth power to the faint; and tothem that haveno might he increaseth strength.\n30. Even the youths shall faint and be weary, and the young men shall utterly fall:\n31. But they thatwait upontheLordshallrenewtheirstrength; they shall mount up with wings aseagles; they shallrun, and not be weary;andthey shall walk, and not faint.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 41",
      "content": "1. Keepsilencebefore me, O islands; and let the peoplerenewtheirstrength: let them come near; then let them speak: let us come neartogetherto judgment.\n2. Who raised up the righteousmanfrom theeast, called him to his foot, gave the nations before him, and madehimruleover kings? he gavethemas the dust to his sword,andas driven stubble to his bow.\n3. He pursued them,andpassed safely;evenby the waythathe had not gone with his feet.\n4. Who hath wrought and doneit,calling the generations from the beginning? I theLord, thefirst, and with the last; Iamhe.\n5. The isles sawit,and feared; the ends of the earth were afraid, drew near, and came.\n6. Theyhelpedevery one his neighbour; andevery onesaid to his brother, Be of good courage.\n7. So the carpenter encouraged the goldsmith,andhe that smoothethwiththe hammer him that smote the anvil, saying, Itisready for the sodering: and he fastened it with nails,thatitshould notbe moved.\n8. But thou, Israel,artmy servant,Jacob whom I havechosen, the seed of Abraham myfriend.\n9. Thouwhom I have taken from the ends of the earth, and called thee from the chief men thereof, and said unto thee, Thouartmyservant; I have chosen thee, and not cast thee away.\n10. Fearthou not; for Iamwith thee: be not dismayed; for Iamthy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of my righteousness.\n11. Behold, all they that were incensed against thee shall be ashamed and confounded: they shall be as nothing; and they that strive with thee shallperish.\n12. Thou shalt seek them, and shalt not find them,eventhem that contended with thee: they that war against thee shall be as nothing, and as thing of nought.\n13. For I theLordthy God will hold thy right hand, saying unto thee, Fear not; I will help thee.\n14. Fear not, thouwormJacob,andye men of Israel; I will help thee, saith theLord, and thyredeemer, theHoly Oneof Israel.\n15. Behold, I will make thee new sharp threshing instrument having teeth: thou shalt thresh themountains, and beatthemsmall, and shalt make the hills as chaff.\n16. Thou shaltfanthem, and the wind shall carry them away, and the whirlwind shall scatter them: and thou shalt rejoice in theLord,andshalt glory in the Holy One of Israel.\n17. Whenthe poor and needy seek water, andthere isnone,andtheir tongue faileth for thirst, I theLordwill hear them,Ithe God of Israel will notforsakethem.\n18. I will openriversin high places, and fountains in the midst of the valleys: I will make thewildernessa pool of water, and the dry land springs of water.\n19. I will plant in the wilderness the cedar, theshittahtree, and the myrtle, and the oil tree; I will set in the desert thefirtree,andthepine, and the box tree together:\n20. That they may see, and know, and consider, and understand together, that the hand of theLordhath done this, and the Holy One of Israel hathcreatedit.\n21. Produce your cause, saith theLord; bring forth yourstrongreasons,saith the King of Jacob.\n22. Let them bringthemforth, and shew us what shall happen: let them shew the former things, what theybe,that we may consider them, and know the latter end of them; or declare us things for to come.\n23. Shew the things that are to come hereafter, that we may know that yearegods: yea, do good, or do evil, that we may be dismayed, and beholdittogether.\n24. Behold, yeareof nothing, and your work of nought: anabominationis he thatchooseth you.\n25. I have raised uponefrom the north, and he shall come: from the rising of the sun shall he call upon my name: and he shall come upon princes asuponmortar, and as the potter treadeth clay.\n26. Who hathdeclaredfrom the beginning, that we may know? and beforetime, that we may say,He isrighteous? yea,there isnone that sheweth, yea,there isnone that declareth, yea,there isnone that heareth your words.\n27. The firstshall sayto Zion,Behold, behold them: and I will give to Jerusalem one that bringeth good tidings.\n28. For I beheld, andthere wasno man; even among them, andthere wasno counsellor, that, when I asked of them, could answer word.\n29. Behold, theyareallvanity; their worksarenothing: their moltenimagesarewind and confusion.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 42",
      "content": "1. Behold myservant, whom I uphold; mineelect,in whommy soul delighteth; I haveputmyspiritupon him: he shall bring forthjudgmentto the Gentiles.\n2. He shall not cry, norlift up, nor cause his voice to be heard in the street.\n3. Abruised reed shall he not break, and the smoking flax shall he not quench: he shall bring forth judgment unto truth.\n4. He shall not fail nor be discouraged, till he have set judgment in the earth: and theislesshall wait for his law.\n5. Thus saith God theLord, he thatcreatedthe heavens, and stretched them out; he that spread forth the earth, and that which cometh out of it; he that givethbreathunto the people upon it, andspiritto them thatwalktherein:\n6. I theLordhave called thee in righteousness, and will hold thine hand, and will keep thee, and give thee for acovenantof the people, for alightof theGentiles;\n7. Toopentheblindeyes, to bring out theprisonersfrom theprison,andthem that sit in darkness out of the prison house.\n8. IamtheLord: thatismy name: and my glory will I not give to another, neither my praise to graven images.\n9. Behold, theformerthings are come to pass, and new things do I declare: before they spring forth I tellyouof them.\n10. Singunto theLorda new song,andhis praise from the end of the earth, ye that go down to the sea, and all that is therein; the isles, and the inhabitants thereof.\n11. Let the wilderness and the cities thereof lift uptheir voice,the villagesthatKedar doth inhabit: let the inhabitants of the rock sing, let them shout from the top of the mountains.\n12. Let them give glory unto theLord, and declare his praise in the islands.\n13. TheLordshall go forth as mighty man, he shall stir upjealousylike man ofwar: he shall cry, yea, roar; he shall prevail against his enemies.\n14. I have long time holden my peace; I have been still,andrefrainedmyself:nowwill I cry like travailing woman; I willdestroyand devour at once.\n15. I will make waste mountains and hills, and dry up all their herbs; and I will make the rivers islands, and I will dry up the pools.\n16. And I will bring the blind by waythatthey knew not; I will lead them in pathsthatthey have not known: I will makedarknesslight before them, and crooked things straight. These things will I do unto them, and not forsake them.\n17. They shall be turned back, they shall be greatly ashamed, that trust in graven images, that say to the molten images, Yeareour gods.\n18. Hear, ye deaf; and look, ye blind, that ye may see.\n19. Whoisblind, but my servant? or deaf, as my messengerthatI sent? whoisblind ashe that isperfect, and blind as theLords servant?\n20. Seeingmany things, but thou observest not; opening the ears, but he heareth not.\n21. TheLordis well pleased for his righteousness sake; he will magnify the law, and makeithonourable.\n22. But thisisapeoplerobbed and spoiled;they areall of them snared in holes, and they are hid in prison houses: they are for prey, and none delivereth; for spoil, and none saith,Restore.\n23. Who among you will give ear to this?whowill hearken and hear for the time to come?\n24. Who gave Jacob for spoil, andIsraelto the robbers? did not theLord, he against whom we have sinned? for they would notwalkin his ways, neither were theyobedientunto his law.\n25. Therefore he hath poured upon him the fury of his anger, and the strength of battle: and it hath set him on fire round about, yet he knew not; and it burned him, yet he laiditnot to heart.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 43",
      "content": "1. But now thus saith theLordthat created thee, O Jacob, and he that formed thee, O Israel, Fear not: for I haveredeemed thee, I have calledtheeby thy name; thouartmine.\n2. When thou passest through thewaters, Iwill bewith thee; and through the rivers, they shall not overflow thee: when thou walkest through thefire, thou shalt not beburned; neither shall the flame kindle upon thee.\n3. For IamtheLordthy God, theHoly Oneof Israel, thySaviour: I gaveEgyptforthyransom, Ethiopia andSebafor thee.\n4. Since thou wastpreciousin my sight, thou hast been honourable, and I have loved thee: therefore will I give men for thee, and people for thy life.\n5. Fear not: for Iamwith thee: I willbringthy seed from the east, and gather thee from the west;\n6. I will say to thenorth,Give up; and to the south, Keep not back: bring my sons from far, and my daughters from the ends of the earth;\n7. Evenevery one that is called by my name: for I havecreatedhim for my glory, I have formed him; yea, I have made him.\n8. Bring forth the blind peoplethat have eyes, and the deaf that have ears.\n9. Let all the nations be gathered together, and let the people be assembled: who among them can declare this, and shew us former things? let them bring forth their witnesses, that they may be justified: or let them hear, and say,It istruth.\n10. Yearemywitnesses, saith theLord, and my servant whom I havechosen: that ye may know andbelieveme, and understand that Iamhe: before me there was no God formed, neither shall there be after me.\n11. I,evenI,amtheLord; andbesidemethere isnosaviour.\n12. I have declared, and have saved, and I have shewed, whenthere wasno strangegodamong you: therefore yearemy witnesses, saith theLord, that IamGod.\n13. Yea, before the daywasIamhe; andthere isnone that can deliver out of my hand: I will work, and who shalllet it?\n14. Thus saith theLord, yourredeemer, the Holy One of Israel; For your sake I have sent to Babylon, and have brought down all their nobles, and the Chaldeans, whose cryisin the ships.\n15. IamtheLord, your Holy One, the creator of Israel, yourKing.\n16. Thus saith theLord, whichmaketha way in the sea, and path in the mighty waters;\n17. Which bringeth forth the chariot and horse, the army and the power; they shalllie downtogether, they shall not rise: they are extinct, they arequenched as tow.\n18. Remember ye not the former things, neither consider the things of old.\n19. Behold, I will do new thing; now it shall spring forth; shall ye not know it? I will even make way in thewilderness,andriversin the desert.\n20. The beast of the field shall honour me, thedragons and the owls: because I give waters in the wilderness,andrivers in the desert, to give drink to my people, my chosen.\n21. Thispeoplehave I formed for myself; they shall shew forth my praise.\n22. But thou hast not called upon me, O Jacob; but thou hast been weary of me, O Israel.\n23. Thou hast not brought me thesmall cattleof thy burnt offerings; neither hast thou honoured me with thy sacrifices. I have not caused thee to serve with an offering, nor wearied thee with incense.\n24. Thou hast bought me nosweet canewith money, neither hast thou filled me with the fat of thy sacrifices: but thou hastmademe to serve with thy sins, thou hastweariedme with thine iniquities.\n25. I,evenI,amhe thatblottethout thytransgressionsfor mine ownsake, and will not remember thy sins.\n26. Put me in remembrance: let us plead together:declarethou, that thou mayest be justified.\n27. Thyfirst fatherhath sinned, and thy teachers have transgressed against me.\n28. Therefore I haveprofanedtheprincesof the sanctuary, and have given Jacob to the curse, and Israel to reproaches.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 44",
      "content": "1. Yet now hear, O Jacob myservant; and Israel, whom I have chosen:\n2. Thus saith theLordthat made thee, andformedthee from the womb,whichwill help thee; Fear not, O Jacob, my servant; and thou,Jesurun, whom I have chosen.\n3. For I will pour water uponhimthat isthirsty, and floods upon the dry ground: I will pour myspiritupon thy seed, and my blessing upon thine offspring:\n4. And they shall spring upasamong the grass, as willows by the water courses.\n5. One shall say, IamtheLords; and another shall callhimselfby thenameof Jacob; and another shall subscribewithhis hand unto theLord, and surnamehimselfby the name of Israel.\n6. Thus saith theLordtheKingof Israel, and his redeemer theLordof hosts; Iamthefirst, and Iamthe last; and beside methere isno God.\n7. And who, as I, shall call, and shall declare it, and set it in order for me, since I appointed the ancient people? and the things that are coming, and shall come, let them shew unto them.\n8. Fearye not, neither be afraid: have not I told thee from that time, and have declaredit?yeareeven my witnesses. Is there God beside me? yea,there isnoGod; I know notany.\n9. They that make gravenimageareall of them vanity; and theirdelectable thingsshall not profit; and theyaretheir own witnesses; theysee not, nor know; that they may be ashamed.\n10. Who hath formed god, or molten gravenimagethatis profitable for nothing?\n11. Behold, all hisfellowsshall be ashamed: and the workmen, theyareof men: let them all be gathered together, let them stand up;yetthey shall fear,andthey shall be ashamed together.\n12. Thesmithwith the tongs both worketh in the coals, and fashioneth it with hammers, and worketh it with the strength of his arms: yea, he is hungry, and his strength faileth: he drinketh no water, and is faint.\n13. The carpenter stretcheth outhisrule; he marketh it out with line; he fitteth it with planes, and he marketh it out with the compass, and maketh it after the figure of man, according to the beauty of man; that it may remain in the house.\n14. He heweth him down cedars, and taketh the cypress and the oak, which he strengtheneth for himself among the trees of the forest: he planteth an ash, and the rain doth nourishit.\n15. Then shall it be for man to burn: for he will take thereof, and warm himself; yea, he kindlethit,and baketh bread; yea, he maketh god, and worshippethit;he maketh it graven image, and falleth down thereto.\n16. He burneth part thereof in the fire; with part thereof he eateth flesh; he roasteth roast, and is satisfied: yea, he warmethhimself,andsaith, Aha, I am warm, I have seen the fire:\n17. And the residue thereof he maketh god,evenhis graven image: he falleth down unto it, and worshippethit,and prayeth unto it, and saith, Deliver me; for thouartmy god.\n18. They have notknownnor understood: for he hathshuttheir eyes, that they cannot see;andtheirhearts, that they cannot understand.\n19. And none considereth in his heart, neitheris thereknowledge nor understanding to say, I have burned part of it in the fire; yea, also I have baked bread upon the coals thereof; I have roasted flesh, and eatenit:and shall I make the residue thereof an abomination? shall I fall down to thestockof tree?\n20. He feedeth on ashes: adeceivedheart hath turned him aside, that he cannot deliver his soul, nor say,Is therenot aliein my right hand?\n21. Rememberthese, O Jacob and Israel; for thouartmyservant: I have formed thee; thouartmy servant: O Israel, thou shalt not beforgottenof me.\n22. I have blotted out, as thick cloud, thytransgressions, and, as cloud, thy sins: return unto me; for I have redeemed thee.\n23. Sing, O ye heavens; for theLordhath doneit:shout, ye lower parts of the earth: break forth intosinging, ye mountains, O forest, and every tree therein: for theLordhathredeemedJacob, and glorified himself in Israel.\n24. Thus saith theLord, thyredeemer, and he thatformedthee from the womb, IamtheLordthatmakethallthings;that stretcheth forth the heavens alone; that spreadeth abroad the earth by myself;\n25. That frustrateth the tokens of the liars, and maketh diviners mad; that turnethwisemenbackward, and maketh their knowledge foolish;\n26. That confirmeth the word of his servant, and performeth the counsel of his messengers; that saith to Jerusalem, Thou shalt be inhabited; and to the cities of Judah, Ye shall be built, and I will raise up the decayed places thereof:\n27. That saith to the deep, Be dry, and I willdry upthy rivers:\n28. That saith ofCyrus,He ismyshepherd, and shall perform all mypleasure: even saying to Jerusalem, Thou shalt bebuilt; and to thetemple, Thy foundation shall be laid.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 45",
      "content": "1. Thus saith theLordto hisanointed, toCyrus, whose right hand I haveholden, tosubduenations before him; and I will loose the loins of kings, to open before him thetwo leaved gates; and the gates shall not be shut;\n2. I will go before thee, and make thecrookedplaces straight: I willbreakin pieces the gates of brass, and cut in sunder the bars of iron:\n3. And I will give thee thetreasures of darkness, and hidden riches of secret places, that thou mayest know that I, theLord, which calltheeby thyname,amtheGodof Israel.\n4. For Jacob myservantssake, and Israel mineelect, I have evencalledthee by thy name: I have surnamed thee, though thou hast not known me.\n5. IamtheLord, andthere isnone else,there isno God beside me: I girded thee, though thou hast not known me:\n6. That they may know from therisingof the sun, and from the west, thatthere isnone beside me. IamtheLord, andthere isnone else.\n7. I form thelight, and create darkness: I make peace, and createevil: I theLorddo all thesethings.\n8. Drop down, ye heavens, from above, and let the skies pour downrighteousness: let the earth open, and letthembring forthsalvation, and let righteousness spring up together; I theLordhave created it.\n9. Woe unto him thatstrivethwith hisMaker!Letthe potsherdstrivewith the potsherds of the earth. Shall theclaysay to him that fashioneth it, What makest thou? or thy work, He hath no hands?\n10. Woe unto him that saith untohisfather, What begettest thou? or tothe woman, What hast thou brought forth?\n11. Thus saith theLord, the Holy One of Israel, and his Maker, Ask me of things to come concerning mysons, and concerning theworkof my handscommand ye me.\n12. I havemadethe earth, andcreatedman upon it: I,evenmy hands, have stretched out the heavens, and all theirhosthave I commanded.\n13. I have raisedhimup in righteousness, and I will direct all his ways: he shallbuildmy city, and he shall let go my captives, not forpricenor reward, saith theLordof hosts.\n14. Thus saith theLord, The labour ofEgypt, and merchandise of Ethiopia and of the Sabeans, men of stature, shall come over unto thee, and they shall be thine: they shall comeafterthee; in chains they shall come over, and they shall fall down unto thee, they shall make supplication unto thee,saying,Surely Godisin thee; andthere isnoneelse,there isno God.\n15. Verily thouarta God thathidestthyself, O God of Israel, theSaviour.\n16. They shall be ashamed, and also confounded, all of them: they shall go to confusion togetherthat aremakers ofidols.\n17. ButIsrael shall besavedin theLordwith an everlastingsalvation: ye shall not be ashamed nor confounded world without end.\n18. For thus saith theLordthatcreatedthe heavens; God himself that formed the earth and made it; he hath established it, he created it not in vain, he formed it to beinhabited: IamtheLord; andthere isnone else.\n19. I have not spoken insecret, in dark place of the earth: I said not unto the seed of Jacob, Seek ye me in vain: I theLordspeakrighteousness, I declare things that areright.\n20. Assemble yourselves and come; draw near together, yethat areescapedof thenations: they have noknowledgethat set up the wood of their graven image, andprayunto godthatcannot save.\n21. Tell ye, and bringthemnear; yea, let them take counsel together: who hath declared this from ancient time?whohath told it from that time?havenot I theLord? andthere isno God else beside me; ajustGod and aSaviour;there isnone beside me.\n22. Lookunto me, and be yesaved, all the ends of the earth: for IamGod, andthere isnone else.\n23. I have sworn by myself, the word is gone out of my mouthinrighteousness, and shall not return, That unto me everykneeshall bow, every tongue shallswear.\n24. Surely, shallonesay, in theLordhave I righteousness andstrength:evento him shallmencome; and all that are incensed against him shall be ashamed.\n25. In theLordshall all the seed of Israel bejustified, and shall glory.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 46",
      "content": "1. Belboweth down, Nebo stoopeth, their idols were upon the beasts, and upon the cattle: your carriageswereheavy loaden;they areaburdento the wearybeast.\n2. Theystoop, they bow down together; they could not deliver the burden, but themselves are gone into captivity.\n3. Hearken unto me, O house of Jacob, and all theremnantof the house of Israel, which are borneby mefrom the belly, which are carried from the womb:\n4. Andeventoyouroldage Iamhe; andeventohoar hairswill I carryyou:I have made, and I will bear; even I willcarry, and willdeliveryou.\n5. To whom will yelikenme, and makemeequal, and compare me, that we may be like?\n6. They lavish gold out of the bag, and weigh silver in the balance,andhire goldsmith; and he maketh it god: they fall down, yea, theyworship.\n7. Theybearhim upon the shoulder, they carry him, and set him in his place, and he standeth; from his place shall he not remove: yea,oneshallcryunto him, yet can he not answer, nor save him out of his trouble.\n8. Remember this, and shew yourselvesmen: bringitagain to mind, O ye transgressors.\n9. Remembertheformerthings of old: forIamGod, andthere isnone else;I amGod, andthere isnonelike me,\n10. Declaringtheendfrom the beginning, and from ancient timesthe thingsthat are notyetdone, saying, Mycounselshall stand, and I will do all mypleasure:\n11. Calling aravenous birdfrom theeast, the man that executeth my counsel from far country: yea, I havespokenit,I will also bring it to pass; I have purposedit,I will also do it.\n12. Hearken unto me, yestouthearted, thatarefar from righteousness:\n13. I bring near my righteousness; it shall not be far off, and mysalvationshall nottarry: and I will place salvation in Zion for Israel my glory.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 47",
      "content": "1. Come down, and sit in the dust, O virgin daughter ofBabylon, sit on the ground:there isnothrone, Odaughter of the Chaldeans: for thou shalt no more be called tender and delicate.\n2. Takethe millstones, and grind meal: uncover thy locks, make bare the leg, uncover the thigh,pass over the rivers.\n3. Thy nakedness shall be uncovered, yea, thy shame shall be seen: I will take vengeance, andIwill not meetthee asa man.\n4. As forour redeemer, theLordof hostsishis name, the Holy One of Israel.\n5. Sit thou silent, andget thee into darkness, O daughter of the Chaldeans: for thou shalt no more be called, The lady of kingdoms.\n6. I was wroth with my people, I have polluted mine inheritance, andgiventhem into thine hand: thou didst shew them no mercy; upon the ancient hast thou very heavily laid thy yoke.\n7. And thou saidst, I shall bea ladyfor ever:sothat thou didst not lay thesethingsto thy heart, neither didst remember the latterendof it.\n8. Therefore hear now this,thou that artgiven to pleasures, that dwellest carelessly, that sayest in thine heart, Iam,and none else beside me; I shall not sitasawidow, neither shall I know theloss of children:\n9. But these twothingsshall come to thee in moment in one day, the loss of children, and widowhood: they shall come upon theein their perfectionfor the multitude of thy sorceries,andfor the great abundance of thine enchantments.\n10. For thou hast trusted in thy wickedness: thou hast said, Noneseethme. Thy wisdom and thy knowledge, it hath perverted thee; and thou hast said in thine heart, Iam,and none else beside me.\n11. Therefore shall evil come upon thee; thou shalt not know fromwhence it riseth: andmischiefshall fall upon thee; thou shalt not be able to put it off: anddesolationshall come upon thee suddenly,whichthou shalt not know.\n12. Stand now with thine enchantments, and with the multitude of thy sorceries, wherein thou hast laboured from thy youth; if so be thou shalt be able to profit, if so be thou mayest prevail.\n13. Thou art wearied in the multitude of thy counsels. Let now theastrologers, the stargazers, themonthlyprognosticators, stand up, and save thee fromthese thingsthat shall come upon thee.\n14. Behold, they shall be asstubble; the fire shall burn them; they shall not deliver themselves from the power of the flame:there shallnotbea coal to warm at,norfire to sit before it.\n15. Thus shall they be unto thee with whom thou hast laboured,eventhy merchants, from thy youth: they shall wander every one to his quarter; none shall save thee.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 48",
      "content": "1. Hear ye this, O house of Jacob, which are called by the name of Israel, and are come forth out of thewaters of Judah, whichswearby the name of theLord, and makementionof the God of Israel,butnot in truth, nor in righteousness.\n2. For they call themselves of theholy city, andstay themselves uponthe God of Israel; TheLordof hostsishis name.\n3. I havedeclaredtheformerthings from the beginning; and they went forth out of my mouth, and I shewed them; I didthemsuddenly, and they came to pass.\n4. Because I knew thatthouartobstinate, and thyneckisan iron sinew, and thy brow brass;\n5. I have even from the beginning declareditto thee; before it came to pass I sheweditthee: lest thou shouldest say, Mine idol hath done them, and my graven image, and my molten image, hath commanded them.\n6. Thou hast heard, see all this; and will not ye declareit?I have shewed thee new things from this time, even hidden things, and thou didst not know them.\n7. They are created now, and not from the beginning; even before the day when thou heardest them not; lest thou shouldest say, Behold, I knew them.\n8. Yea, thou heardest not; yea, thou knewest not; yea, from that timethatthine ear was not opened: for I knew that thou wouldest deal very treacherously, and wast called transgressor from thewomb.\n9. For mynamessake will I defer mineanger, and for my praise will I refrain for thee, that I cut thee not off.\n10. Behold, I have refined thee, but not with silver; I have chosen thee in thefurnaceofaffliction.\n11. For mine ownsake,evenfor mine own sake, will I doit:for how shouldmynamebe polluted? and I will notgivemy glory unto another.\n12. Hearken unto me, O Jacob and Israel, my called; Iamhe; Iamthe first, I alsoamthe last.\n13. Mine hand also hath laid thefoundation of theearth, and my right hand hath spanned the heavens:whenI call unto them, they stand up together.\n14. All ye, assemble yourselves, and hear; which among them hath declared thesethings?TheLordhath loved him: he will do hispleasureonBabylon, and his armshall be onthe Chaldeans.\n15. I,evenI, have spoken; yea, I have called him: I have brought him, and he shall make his way prosperous.\n16. Come ye near unto me, hear ye this; I have not spoken insecretfrom the beginning; from the time that it was, thereamI: and now the LordGod, and his Spirit, hathsentme.\n17. Thus saith theLord, thy Redeemer, the Holy One of Israel; IamtheLordthy God which teacheth thee to profit, whichleadeththee by the waythatthou shouldest go.\n18. O that thou hadst hearkened to my commandments! then had thypeacebeen as river, and thy righteousness as the waves of the sea:\n19. Thyseedalso had been as the sand, and the offspring of thy bowels like the gravel thereof; his name should not have been cut off nor destroyed from before me.\n20. Go ye forth ofBabylon, flee ye from theChaldeans, with voice of singing declare ye, tell this, utter itevento the end of the earth; say ye, TheLordhath redeemed his servant Jacob.\n21. And they thirsted notwhenhe led them through the deserts: he caused thewatersto flow out of the rock for them: he clave the rock also, and the waters gushed out.\n22. There isnopeace, saith theLord, unto the wicked.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 49",
      "content": "1. Listen, O isles, unto me; andhearken, ye people, from far; TheLordhathcalledme from the womb; from the bowels of my mother hath he made mention of my name.\n2. And he hath made my mouth like sharpsword; in the shadow of his hand hath he hid me, and made me polished shaft; in his quiver hath he hid me;\n3. And said unto me, Thouartmyservant, O Israel, in whom I will beglorified.\n4. Then I said, I have laboured in vain, I have spent my strength for nought, and in vain:yetsurely my judgmentiswith theLord, and my work with my God.\n5. And now, saith theLordthatformedme from the wombto behis servant, to bring Jacob again to him, Though Israel be not gathered, yet shall I be glorious in the eyes of theLord, and my God shall be my strength.\n6. And he said, It is light thing that thou shouldest be my servant to raise up the tribes of Jacob, and to restore the preserved of Israel: I will also give thee for alightto theGentiles, that thou mayest be mysalvationunto the end of the earth.\n7. Thus saith theLord, the Redeemer of Israel,andhis Holy One, to him whom man despiseth, to him whom the nation abhorreth, to servant of rulers, Kings shall see and arise, princes also shall worship, because of theLordthat is faithful,andthe Holy One of Israel, and he shall choose thee.\n8. Thus saith theLord, In an acceptabletimehave I heard thee, and in day of salvation have I helped thee: and I will preserve thee, and give thee for acovenantof the people, to establish the earth, to cause toinheritthe desolate heritages;\n9. That thou mayest say to theprisoners, Go forth; to them thatarein darkness, Shew yourselves. They shall feed in the ways, and their pasturesshall bein all high places.\n10. They shall not hunger northirst; neither shall the heat norsunsmite them: for he that hath mercy on them shall lead them, even by the springs of water shall he guide them.\n11. And I will make all my mountains way, and myhighwaysshall be exalted.\n12. Behold, these shall come from far: and, lo, these from thenorthand from the west; and these from the land of Sinim.\n13. Sing, O heavens; and be joyful, O earth; and break forth intosinging, O mountains: for theLordhathcomfortedhis people, and will havemercyupon hisafflicted.\n14. But Zion said, TheLordhathforsakenme, and my Lord hath forgotten me.\n15. Can awomanforget her sucking child, that she should not have compassion on the son of her womb? yea, they may forget, yet will I notforgetthee.\n16. Behold, I have graven thee upon the palms ofmyhands; thy wallsarecontinually before me.\n17. Thy children shall make haste; thy destroyers and they that made thee waste shall go forth of thee.\n18. Lift up thine eyes round about, and behold: all thesegatherthemselves together,andcome to thee.AsI live, saith theLord, thou shalt surely clothe thee with them all, as with an ornament, and bind themon thee,as bridedoeth.\n19. For thy waste and thy desolate places, and the land of thy destruction, shall even now be too narrow by reason of the inhabitants, and they that swallowed thee up shall be far away.\n20. The children which thou shalt have, after thou hast lost the other, shall say again in thine ears, The placeistoostraitfor me: give place to me that I may dwell.\n21. Then shaltthousay in thine heart, Who hath begotten me these, seeing I have lost my children, and amdesolate, captive, and removing to and fro? and who hath brought up these? Behold, I was left alone; these, wherehadtheybeen?\n22. Thus saith the LordGod, Behold, I willlift upmine hand to theGentiles, and set up mystandardto the people: and they shall bring thysonsintheirarms, and thy daughters shall be carried upontheirshoulders.\n23. And kings shall be thynursingfathers, and their queens thy nursingmothers: they shallbowdown to thee withtheirface toward the earth, and lick up the dust of thy feet; and thou shalt know that IamtheLord: for they shall not beashamedthat wait for me.\n24. Shall the prey be taken from the mighty, or the lawful captive delivered?\n25. But thus saith theLord, Even the captives of the mighty shall be taken away, and the prey of the terrible shall be delivered: for I willcontendwith him that contendeth with thee, and I will save thy children.\n26. And I will feed them thatoppressthee with their own flesh; and they shall be drunken with their own blood, as with sweet wine: and all flesh shallknowthat I theLordamthySaviourand thyRedeemer, themighty Oneof Jacob.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Isaiah": {
      "40": {
        "verses": {
          "1": {
            "text": "Comfort ye,comfortye my people, saith your God.",
            "citation": "(Isaiah 40:1)"
          },
          "2": {
            "text": "Speak ye comfortably to Jerusalem, and cry unto her, that herwarfareis accomplished, that her iniquity ispardoned: for she hathreceived of theLords handdoublefor all her sins.",
            "citation": "(Isaiah 40:2)"
          },
          "3": {
            "text": "Thevoiceof him that crieth in the wilderness,Prepareye thewayof theLord, make straight in the desert ahighwayfor our God.",
            "citation": "(Isaiah 40:3)"
          },
          "4": {
            "text": "Everyvalleyshall beexalted, and everymountainand hill shall be madelow: and thecrookedshall be made straight, andthe rough places plain:",
            "citation": "(Isaiah 40:4)"
          },
          "5": {
            "text": "And thegloryof theLordshall berevealed, and all flesh shallseeittogether: for the mouth of theLordhath spokenit.",
            "citation": "(Isaiah 40:5)"
          },
          "6": {
            "text": "The voice said, Cry. And he said, What shall I cry? Allfleshisgrass, and all the goodliness thereofisas the flower of the field:",
            "citation": "(Isaiah 40:6)"
          },
          "7": {
            "text": "The grass withereth, the flower fadeth: because the spirit of theLordbloweth upon it: surely the peopleisgrass.",
            "citation": "(Isaiah 40:7)"
          },
          "8": {
            "text": "The grass withereth, the flower fadeth: but thewordof our God shall stand for ever.",
            "citation": "(Isaiah 40:8)"
          },
          "9": {
            "text": "OZion, that bringestgoodtidings, get thee up into the high mountain; O Jerusalem, that bringest good tidings, lift up thy voice with strength; liftitup, be not afraid; say unto the cities ofJudah, Behold your God!",
            "citation": "(Isaiah 40:9)"
          },
          "10": {
            "text": "Behold, the LordGodwill come with stronghand,and hisarmshall rule for him: behold, hisrewardiswith him, and his work before him.",
            "citation": "(Isaiah 40:10)"
          },
          "11": {
            "text": "He shall feed hisflocklike ashepherd: he shall gather the lambs with his arm, and carrythemin his bosom,andshall gently lead those that are with young.",
            "citation": "(Isaiah 40:11)"
          },
          "12": {
            "text": "Who hath measured the waters in the hollow of his hand, and meted out heaven with the span, and comprehended the dust of the earth in measure, and weighed the mountains in scales, and the hills in balance?",
            "citation": "(Isaiah 40:12)"
          },
          "13": {
            "text": "Who hathdirectedtheSpiritof theLord, orbeinghiscounsellorhath taught him?",
            "citation": "(Isaiah 40:13)"
          },
          "14": {
            "text": "With whom took hecounsel, andwhoinstructed him, and taught him in the path ofjudgment, and taught him knowledge, and shewed to him the way of understanding?",
            "citation": "(Isaiah 40:14)"
          },
          "15": {
            "text": "Behold, thenationsareas adropof bucket, and are counted as the small dust of the balance: behold, he taketh up theislesas very little thing.",
            "citation": "(Isaiah 40:15)"
          },
          "16": {
            "text": "And Lebanonisnot sufficient to burn, nor the beasts thereof sufficient for burnt offering.",
            "citation": "(Isaiah 40:16)"
          },
          "17": {
            "text": "All nations before himareas nothing; and they are counted to him less than nothing, andvanity.",
            "citation": "(Isaiah 40:17)"
          },
          "18": {
            "text": "To whom then will yelikenGod? or what likeness will ye compare unto him?",
            "citation": "(Isaiah 40:18)"
          },
          "19": {
            "text": "The workman melteth graven image, and thegoldsmithspreadeth it over with gold, and casteth silver chains.",
            "citation": "(Isaiah 40:19)"
          },
          "20": {
            "text": "He thatisso impoverished that he hath no oblation chooseth treethatwill not rot; he seeketh unto hima cunning workman to prepare graven image,thatshallnot be moved.",
            "citation": "(Isaiah 40:20)"
          },
          "21": {
            "text": "Have ye not known? have ye not heard? hath it not been told you from the beginning? have ye not understood from the foundations of the earth?",
            "citation": "(Isaiah 40:21)"
          },
          "22": {
            "text": "It ishe that sitteth upon the circle of the earth, and the inhabitants thereofareas grasshoppers; thatstretchethout the heavens as curtain, and spreadeth them out as tent to dwell in:",
            "citation": "(Isaiah 40:22)"
          },
          "23": {
            "text": "That bringeth theprincesto nothing; he maketh the judges of the earth as vanity.",
            "citation": "(Isaiah 40:23)"
          },
          "24": {
            "text": "Yea, they shall not be planted; yea, they shall not be sown: yea, their stock shall not take root in the earth: and he shall also blow upon them, and they shall wither, and the whirlwind shall take them away as stubble.",
            "citation": "(Isaiah 40:24)"
          },
          "25": {
            "text": "To whom then will ye liken me, or shall I be equal? saith the Holy One.",
            "citation": "(Isaiah 40:25)"
          },
          "26": {
            "text": "Lift up your eyes on high, and behold who hath created thesethings,that bringeth out their host by number: he calleth them all bynamesby the greatness of his might, for thathe isstrong in power; not one faileth.",
            "citation": "(Isaiah 40:26)"
          },
          "27": {
            "text": "Why sayest thou, O Jacob, and speakest, O Israel, My way is hid from theLord, and my judgment ispassed over frommy God?",
            "citation": "(Isaiah 40:27)"
          },
          "28": {
            "text": "Hast thou not known? hast thou not heard,thattheeverlastingGod, theLord, theCreatorof the ends of the earth, fainteth not, neither is weary?there isnosearchingof his understanding.",
            "citation": "(Isaiah 40:28)"
          },
          "29": {
            "text": "He giveth power to the faint; and tothem that haveno might he increaseth strength.",
            "citation": "(Isaiah 40:29)"
          },
          "30": {
            "text": "Even the youths shall faint and be weary, and the young men shall utterly fall:",
            "citation": "(Isaiah 40:30)"
          },
          "31": {
            "text": "But they thatwait upontheLordshallrenewtheirstrength; they shall mount up with wings aseagles; they shallrun, and not be weary;andthey shall walk, and not faint.",
            "citation": "(Isaiah 40:31)"
          }
        }
      },
      "41": {
        "verses": {
          "1": {
            "text": "Keepsilencebefore me, O islands; and let the peoplerenewtheirstrength: let them come near; then let them speak: let us come neartogetherto judgment.",
            "citation": "(Isaiah 41:1)"
          },
          "2": {
            "text": "Who raised up the righteousmanfrom theeast, called him to his foot, gave the nations before him, and madehimruleover kings? he gavethemas the dust to his sword,andas driven stubble to his bow.",
            "citation": "(Isaiah 41:2)"
          },
          "3": {
            "text": "He pursued them,andpassed safely;evenby the waythathe had not gone with his feet.",
            "citation": "(Isaiah 41:3)"
          },
          "4": {
            "text": "Who hath wrought and doneit,calling the generations from the beginning? I theLord, thefirst, and with the last; Iamhe.",
            "citation": "(Isaiah 41:4)"
          },
          "5": {
            "text": "The isles sawit,and feared; the ends of the earth were afraid, drew near, and came.",
            "citation": "(Isaiah 41:5)"
          },
          "6": {
            "text": "Theyhelpedevery one his neighbour; andevery onesaid to his brother, Be of good courage.",
            "citation": "(Isaiah 41:6)"
          },
          "7": {
            "text": "So the carpenter encouraged the goldsmith,andhe that smoothethwiththe hammer him that smote the anvil, saying, Itisready for the sodering: and he fastened it with nails,thatitshould notbe moved.",
            "citation": "(Isaiah 41:7)"
          },
          "8": {
            "text": "But thou, Israel,artmy servant,Jacob whom I havechosen, the seed of Abraham myfriend.",
            "citation": "(Isaiah 41:8)"
          },
          "9": {
            "text": "Thouwhom I have taken from the ends of the earth, and called thee from the chief men thereof, and said unto thee, Thouartmyservant; I have chosen thee, and not cast thee away.",
            "citation": "(Isaiah 41:9)"
          },
          "10": {
            "text": "Fearthou not; for Iamwith thee: be not dismayed; for Iamthy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of my righteousness.",
            "citation": "(Isaiah 41:10)"
          },
          "11": {
            "text": "Behold, all they that were incensed against thee shall be ashamed and confounded: they shall be as nothing; and they that strive with thee shallperish.",
            "citation": "(Isaiah 41:11)"
          },
          "12": {
            "text": "Thou shalt seek them, and shalt not find them,eventhem that contended with thee: they that war against thee shall be as nothing, and as thing of nought.",
            "citation": "(Isaiah 41:12)"
          },
          "13": {
            "text": "For I theLordthy God will hold thy right hand, saying unto thee, Fear not; I will help thee.",
            "citation": "(Isaiah 41:13)"
          },
          "14": {
            "text": "Fear not, thouwormJacob,andye men of Israel; I will help thee, saith theLord, and thyredeemer, theHoly Oneof Israel.",
            "citation": "(Isaiah 41:14)"
          },
          "15": {
            "text": "Behold, I will make thee new sharp threshing instrument having teeth: thou shalt thresh themountains, and beatthemsmall, and shalt make the hills as chaff.",
            "citation": "(Isaiah 41:15)"
          },
          "16": {
            "text": "Thou shaltfanthem, and the wind shall carry them away, and the whirlwind shall scatter them: and thou shalt rejoice in theLord,andshalt glory in the Holy One of Israel.",
            "citation": "(Isaiah 41:16)"
          },
          "17": {
            "text": "Whenthe poor and needy seek water, andthere isnone,andtheir tongue faileth for thirst, I theLordwill hear them,Ithe God of Israel will notforsakethem.",
            "citation": "(Isaiah 41:17)"
          },
          "18": {
            "text": "I will openriversin high places, and fountains in the midst of the valleys: I will make thewildernessa pool of water, and the dry land springs of water.",
            "citation": "(Isaiah 41:18)"
          },
          "19": {
            "text": "I will plant in the wilderness the cedar, theshittahtree, and the myrtle, and the oil tree; I will set in the desert thefirtree,andthepine, and the box tree together:",
            "citation": "(Isaiah 41:19)"
          },
          "20": {
            "text": "That they may see, and know, and consider, and understand together, that the hand of theLordhath done this, and the Holy One of Israel hathcreatedit.",
            "citation": "(Isaiah 41:20)"
          },
          "21": {
            "text": "Produce your cause, saith theLord; bring forth yourstrongreasons,saith the King of Jacob.",
            "citation": "(Isaiah 41:21)"
          },
          "22": {
            "text": "Let them bringthemforth, and shew us what shall happen: let them shew the former things, what theybe,that we may consider them, and know the latter end of them; or declare us things for to come.",
            "citation": "(Isaiah 41:22)"
          },
          "23": {
            "text": "Shew the things that are to come hereafter, that we may know that yearegods: yea, do good, or do evil, that we may be dismayed, and beholdittogether.",
            "citation": "(Isaiah 41:23)"
          },
          "24": {
            "text": "Behold, yeareof nothing, and your work of nought: anabominationis he thatchooseth you.",
            "citation": "(Isaiah 41:24)"
          },
          "25": {
            "text": "I have raised uponefrom the north, and he shall come: from the rising of the sun shall he call upon my name: and he shall come upon princes asuponmortar, and as the potter treadeth clay.",
            "citation": "(Isaiah 41:25)"
          },
          "26": {
            "text": "Who hathdeclaredfrom the beginning, that we may know? and beforetime, that we may say,He isrighteous? yea,there isnone that sheweth, yea,there isnone that declareth, yea,there isnone that heareth your words.",
            "citation": "(Isaiah 41:26)"
          },
          "27": {
            "text": "The firstshall sayto Zion,Behold, behold them: and I will give to Jerusalem one that bringeth good tidings.",
            "citation": "(Isaiah 41:27)"
          },
          "28": {
            "text": "For I beheld, andthere wasno man; even among them, andthere wasno counsellor, that, when I asked of them, could answer word.",
            "citation": "(Isaiah 41:28)"
          },
          "29": {
            "text": "Behold, theyareallvanity; their worksarenothing: their moltenimagesarewind and confusion.",
            "citation": "(Isaiah 41:29)"
          }
        }
      },
      "42": {
        "verses": {
          "1": {
            "text": "Behold myservant, whom I uphold; mineelect,in whommy soul delighteth; I haveputmyspiritupon him: he shall bring forthjudgmentto the Gentiles.",
            "citation": "(Isaiah 42:1)"
          },
          "2": {
            "text": "He shall not cry, norlift up, nor cause his voice to be heard in the street.",
            "citation": "(Isaiah 42:2)"
          },
          "3": {
            "text": "Abruised reed shall he not break, and the smoking flax shall he not quench: he shall bring forth judgment unto truth.",
            "citation": "(Isaiah 42:3)"
          },
          "4": {
            "text": "He shall not fail nor be discouraged, till he have set judgment in the earth: and theislesshall wait for his law.",
            "citation": "(Isaiah 42:4)"
          },
          "5": {
            "text": "Thus saith God theLord, he thatcreatedthe heavens, and stretched them out; he that spread forth the earth, and that which cometh out of it; he that givethbreathunto the people upon it, andspiritto them thatwalktherein:",
            "citation": "(Isaiah 42:5)"
          },
          "6": {
            "text": "I theLordhave called thee in righteousness, and will hold thine hand, and will keep thee, and give thee for acovenantof the people, for alightof theGentiles;",
            "citation": "(Isaiah 42:6)"
          },
          "7": {
            "text": "Toopentheblindeyes, to bring out theprisonersfrom theprison,andthem that sit in darkness out of the prison house.",
            "citation": "(Isaiah 42:7)"
          },
          "8": {
            "text": "IamtheLord: thatismy name: and my glory will I not give to another, neither my praise to graven images.",
            "citation": "(Isaiah 42:8)"
          },
          "9": {
            "text": "Behold, theformerthings are come to pass, and new things do I declare: before they spring forth I tellyouof them.",
            "citation": "(Isaiah 42:9)"
          },
          "10": {
            "text": "Singunto theLorda new song,andhis praise from the end of the earth, ye that go down to the sea, and all that is therein; the isles, and the inhabitants thereof.",
            "citation": "(Isaiah 42:10)"
          },
          "11": {
            "text": "Let the wilderness and the cities thereof lift uptheir voice,the villagesthatKedar doth inhabit: let the inhabitants of the rock sing, let them shout from the top of the mountains.",
            "citation": "(Isaiah 42:11)"
          },
          "12": {
            "text": "Let them give glory unto theLord, and declare his praise in the islands.",
            "citation": "(Isaiah 42:12)"
          },
          "13": {
            "text": "TheLordshall go forth as mighty man, he shall stir upjealousylike man ofwar: he shall cry, yea, roar; he shall prevail against his enemies.",
            "citation": "(Isaiah 42:13)"
          },
          "14": {
            "text": "I have long time holden my peace; I have been still,andrefrainedmyself:nowwill I cry like travailing woman; I willdestroyand devour at once.",
            "citation": "(Isaiah 42:14)"
          },
          "15": {
            "text": "I will make waste mountains and hills, and dry up all their herbs; and I will make the rivers islands, and I will dry up the pools.",
            "citation": "(Isaiah 42:15)"
          },
          "16": {
            "text": "And I will bring the blind by waythatthey knew not; I will lead them in pathsthatthey have not known: I will makedarknesslight before them, and crooked things straight. These things will I do unto them, and not forsake them.",
            "citation": "(Isaiah 42:16)"
          },
          "17": {
            "text": "They shall be turned back, they shall be greatly ashamed, that trust in graven images, that say to the molten images, Yeareour gods.",
            "citation": "(Isaiah 42:17)"
          },
          "18": {
            "text": "Hear, ye deaf; and look, ye blind, that ye may see.",
            "citation": "(Isaiah 42:18)"
          },
          "19": {
            "text": "Whoisblind, but my servant? or deaf, as my messengerthatI sent? whoisblind ashe that isperfect, and blind as theLords servant?",
            "citation": "(Isaiah 42:19)"
          },
          "20": {
            "text": "Seeingmany things, but thou observest not; opening the ears, but he heareth not.",
            "citation": "(Isaiah 42:20)"
          },
          "21": {
            "text": "TheLordis well pleased for his righteousness sake; he will magnify the law, and makeithonourable.",
            "citation": "(Isaiah 42:21)"
          },
          "22": {
            "text": "But thisisapeoplerobbed and spoiled;they areall of them snared in holes, and they are hid in prison houses: they are for prey, and none delivereth; for spoil, and none saith,Restore.",
            "citation": "(Isaiah 42:22)"
          },
          "23": {
            "text": "Who among you will give ear to this?whowill hearken and hear for the time to come?",
            "citation": "(Isaiah 42:23)"
          },
          "24": {
            "text": "Who gave Jacob for spoil, andIsraelto the robbers? did not theLord, he against whom we have sinned? for they would notwalkin his ways, neither were theyobedientunto his law.",
            "citation": "(Isaiah 42:24)"
          },
          "25": {
            "text": "Therefore he hath poured upon him the fury of his anger, and the strength of battle: and it hath set him on fire round about, yet he knew not; and it burned him, yet he laiditnot to heart.",
            "citation": "(Isaiah 42:25)"
          }
        }
      },
      "43": {
        "verses": {
          "1": {
            "text": "But now thus saith theLordthat created thee, O Jacob, and he that formed thee, O Israel, Fear not: for I haveredeemed thee, I have calledtheeby thy name; thouartmine.",
            "citation": "(Isaiah 43:1)"
          },
          "2": {
            "text": "When thou passest through thewaters, Iwill bewith thee; and through the rivers, they shall not overflow thee: when thou walkest through thefire, thou shalt not beburned; neither shall the flame kindle upon thee.",
            "citation": "(Isaiah 43:2)"
          },
          "3": {
            "text": "For IamtheLordthy God, theHoly Oneof Israel, thySaviour: I gaveEgyptforthyransom, Ethiopia andSebafor thee.",
            "citation": "(Isaiah 43:3)"
          },
          "4": {
            "text": "Since thou wastpreciousin my sight, thou hast been honourable, and I have loved thee: therefore will I give men for thee, and people for thy life.",
            "citation": "(Isaiah 43:4)"
          },
          "5": {
            "text": "Fear not: for Iamwith thee: I willbringthy seed from the east, and gather thee from the west;",
            "citation": "(Isaiah 43:5)"
          },
          "6": {
            "text": "I will say to thenorth,Give up; and to the south, Keep not back: bring my sons from far, and my daughters from the ends of the earth;",
            "citation": "(Isaiah 43:6)"
          },
          "7": {
            "text": "Evenevery one that is called by my name: for I havecreatedhim for my glory, I have formed him; yea, I have made him.",
            "citation": "(Isaiah 43:7)"
          },
          "8": {
            "text": "Bring forth the blind peoplethat have eyes, and the deaf that have ears.",
            "citation": "(Isaiah 43:8)"
          },
          "9": {
            "text": "Let all the nations be gathered together, and let the people be assembled: who among them can declare this, and shew us former things? let them bring forth their witnesses, that they may be justified: or let them hear, and say,It istruth.",
            "citation": "(Isaiah 43:9)"
          },
          "10": {
            "text": "Yearemywitnesses, saith theLord, and my servant whom I havechosen: that ye may know andbelieveme, and understand that Iamhe: before me there was no God formed, neither shall there be after me.",
            "citation": "(Isaiah 43:10)"
          },
          "11": {
            "text": "I,evenI,amtheLord; andbesidemethere isnosaviour.",
            "citation": "(Isaiah 43:11)"
          },
          "12": {
            "text": "I have declared, and have saved, and I have shewed, whenthere wasno strangegodamong you: therefore yearemy witnesses, saith theLord, that IamGod.",
            "citation": "(Isaiah 43:12)"
          },
          "13": {
            "text": "Yea, before the daywasIamhe; andthere isnone that can deliver out of my hand: I will work, and who shalllet it?",
            "citation": "(Isaiah 43:13)"
          },
          "14": {
            "text": "Thus saith theLord, yourredeemer, the Holy One of Israel; For your sake I have sent to Babylon, and have brought down all their nobles, and the Chaldeans, whose cryisin the ships.",
            "citation": "(Isaiah 43:14)"
          },
          "15": {
            "text": "IamtheLord, your Holy One, the creator of Israel, yourKing.",
            "citation": "(Isaiah 43:15)"
          },
          "16": {
            "text": "Thus saith theLord, whichmaketha way in the sea, and path in the mighty waters;",
            "citation": "(Isaiah 43:16)"
          },
          "17": {
            "text": "Which bringeth forth the chariot and horse, the army and the power; they shalllie downtogether, they shall not rise: they are extinct, they arequenched as tow.",
            "citation": "(Isaiah 43:17)"
          },
          "18": {
            "text": "Remember ye not the former things, neither consider the things of old.",
            "citation": "(Isaiah 43:18)"
          },
          "19": {
            "text": "Behold, I will do new thing; now it shall spring forth; shall ye not know it? I will even make way in thewilderness,andriversin the desert.",
            "citation": "(Isaiah 43:19)"
          },
          "20": {
            "text": "The beast of the field shall honour me, thedragons and the owls: because I give waters in the wilderness,andrivers in the desert, to give drink to my people, my chosen.",
            "citation": "(Isaiah 43:20)"
          },
          "21": {
            "text": "Thispeoplehave I formed for myself; they shall shew forth my praise.",
            "citation": "(Isaiah 43:21)"
          },
          "22": {
            "text": "But thou hast not called upon me, O Jacob; but thou hast been weary of me, O Israel.",
            "citation": "(Isaiah 43:22)"
          },
          "23": {
            "text": "Thou hast not brought me thesmall cattleof thy burnt offerings; neither hast thou honoured me with thy sacrifices. I have not caused thee to serve with an offering, nor wearied thee with incense.",
            "citation": "(Isaiah 43:23)"
          },
          "24": {
            "text": "Thou hast bought me nosweet canewith money, neither hast thou filled me with the fat of thy sacrifices: but thou hastmademe to serve with thy sins, thou hastweariedme with thine iniquities.",
            "citation": "(Isaiah 43:24)"
          },
          "25": {
            "text": "I,evenI,amhe thatblottethout thytransgressionsfor mine ownsake, and will not remember thy sins.",
            "citation": "(Isaiah 43:25)"
          },
          "26": {
            "text": "Put me in remembrance: let us plead together:declarethou, that thou mayest be justified.",
            "citation": "(Isaiah 43:26)"
          },
          "27": {
            "text": "Thyfirst fatherhath sinned, and thy teachers have transgressed against me.",
            "citation": "(Isaiah 43:27)"
          },
          "28": {
            "text": "Therefore I haveprofanedtheprincesof the sanctuary, and have given Jacob to the curse, and Israel to reproaches.",
            "citation": "(Isaiah 43:28)"
          }
        }
      },
      "44": {
        "verses": {
          "1": {
            "text": "Yet now hear, O Jacob myservant; and Israel, whom I have chosen:",
            "citation": "(Isaiah 44:1)"
          },
          "2": {
            "text": "Thus saith theLordthat made thee, andformedthee from the womb,whichwill help thee; Fear not, O Jacob, my servant; and thou,Jesurun, whom I have chosen.",
            "citation": "(Isaiah 44:2)"
          },
          "3": {
            "text": "For I will pour water uponhimthat isthirsty, and floods upon the dry ground: I will pour myspiritupon thy seed, and my blessing upon thine offspring:",
            "citation": "(Isaiah 44:3)"
          },
          "4": {
            "text": "And they shall spring upasamong the grass, as willows by the water courses.",
            "citation": "(Isaiah 44:4)"
          },
          "5": {
            "text": "One shall say, IamtheLords; and another shall callhimselfby thenameof Jacob; and another shall subscribewithhis hand unto theLord, and surnamehimselfby the name of Israel.",
            "citation": "(Isaiah 44:5)"
          },
          "6": {
            "text": "Thus saith theLordtheKingof Israel, and his redeemer theLordof hosts; Iamthefirst, and Iamthe last; and beside methere isno God.",
            "citation": "(Isaiah 44:6)"
          },
          "7": {
            "text": "And who, as I, shall call, and shall declare it, and set it in order for me, since I appointed the ancient people? and the things that are coming, and shall come, let them shew unto them.",
            "citation": "(Isaiah 44:7)"
          },
          "8": {
            "text": "Fearye not, neither be afraid: have not I told thee from that time, and have declaredit?yeareeven my witnesses. Is there God beside me? yea,there isnoGod; I know notany.",
            "citation": "(Isaiah 44:8)"
          },
          "9": {
            "text": "They that make gravenimageareall of them vanity; and theirdelectable thingsshall not profit; and theyaretheir own witnesses; theysee not, nor know; that they may be ashamed.",
            "citation": "(Isaiah 44:9)"
          },
          "10": {
            "text": "Who hath formed god, or molten gravenimagethatis profitable for nothing?",
            "citation": "(Isaiah 44:10)"
          },
          "11": {
            "text": "Behold, all hisfellowsshall be ashamed: and the workmen, theyareof men: let them all be gathered together, let them stand up;yetthey shall fear,andthey shall be ashamed together.",
            "citation": "(Isaiah 44:11)"
          },
          "12": {
            "text": "Thesmithwith the tongs both worketh in the coals, and fashioneth it with hammers, and worketh it with the strength of his arms: yea, he is hungry, and his strength faileth: he drinketh no water, and is faint.",
            "citation": "(Isaiah 44:12)"
          },
          "13": {
            "text": "The carpenter stretcheth outhisrule; he marketh it out with line; he fitteth it with planes, and he marketh it out with the compass, and maketh it after the figure of man, according to the beauty of man; that it may remain in the house.",
            "citation": "(Isaiah 44:13)"
          },
          "14": {
            "text": "He heweth him down cedars, and taketh the cypress and the oak, which he strengtheneth for himself among the trees of the forest: he planteth an ash, and the rain doth nourishit.",
            "citation": "(Isaiah 44:14)"
          },
          "15": {
            "text": "Then shall it be for man to burn: for he will take thereof, and warm himself; yea, he kindlethit,and baketh bread; yea, he maketh god, and worshippethit;he maketh it graven image, and falleth down thereto.",
            "citation": "(Isaiah 44:15)"
          },
          "16": {
            "text": "He burneth part thereof in the fire; with part thereof he eateth flesh; he roasteth roast, and is satisfied: yea, he warmethhimself,andsaith, Aha, I am warm, I have seen the fire:",
            "citation": "(Isaiah 44:16)"
          },
          "17": {
            "text": "And the residue thereof he maketh god,evenhis graven image: he falleth down unto it, and worshippethit,and prayeth unto it, and saith, Deliver me; for thouartmy god.",
            "citation": "(Isaiah 44:17)"
          },
          "18": {
            "text": "They have notknownnor understood: for he hathshuttheir eyes, that they cannot see;andtheirhearts, that they cannot understand.",
            "citation": "(Isaiah 44:18)"
          },
          "19": {
            "text": "And none considereth in his heart, neitheris thereknowledge nor understanding to say, I have burned part of it in the fire; yea, also I have baked bread upon the coals thereof; I have roasted flesh, and eatenit:and shall I make the residue thereof an abomination? shall I fall down to thestockof tree?",
            "citation": "(Isaiah 44:19)"
          },
          "20": {
            "text": "He feedeth on ashes: adeceivedheart hath turned him aside, that he cannot deliver his soul, nor say,Is therenot aliein my right hand?",
            "citation": "(Isaiah 44:20)"
          },
          "21": {
            "text": "Rememberthese, O Jacob and Israel; for thouartmyservant: I have formed thee; thouartmy servant: O Israel, thou shalt not beforgottenof me.",
            "citation": "(Isaiah 44:21)"
          },
          "22": {
            "text": "I have blotted out, as thick cloud, thytransgressions, and, as cloud, thy sins: return unto me; for I have redeemed thee.",
            "citation": "(Isaiah 44:22)"
          },
          "23": {
            "text": "Sing, O ye heavens; for theLordhath doneit:shout, ye lower parts of the earth: break forth intosinging, ye mountains, O forest, and every tree therein: for theLordhathredeemedJacob, and glorified himself in Israel.",
            "citation": "(Isaiah 44:23)"
          },
          "24": {
            "text": "Thus saith theLord, thyredeemer, and he thatformedthee from the womb, IamtheLordthatmakethallthings;that stretcheth forth the heavens alone; that spreadeth abroad the earth by myself;",
            "citation": "(Isaiah 44:24)"
          },
          "25": {
            "text": "That frustrateth the tokens of the liars, and maketh diviners mad; that turnethwisemenbackward, and maketh their knowledge foolish;",
            "citation": "(Isaiah 44:25)"
          },
          "26": {
            "text": "That confirmeth the word of his servant, and performeth the counsel of his messengers; that saith to Jerusalem, Thou shalt be inhabited; and to the cities of Judah, Ye shall be built, and I will raise up the decayed places thereof:",
            "citation": "(Isaiah 44:26)"
          },
          "27": {
            "text": "That saith to the deep, Be dry, and I willdry upthy rivers:",
            "citation": "(Isaiah 44:27)"
          },
          "28": {
            "text": "That saith ofCyrus,He ismyshepherd, and shall perform all mypleasure: even saying to Jerusalem, Thou shalt bebuilt; and to thetemple, Thy foundation shall be laid.",
            "citation": "(Isaiah 44:28)"
          }
        }
      },
      "45": {
        "verses": {
          "1": {
            "text": "Thus saith theLordto hisanointed, toCyrus, whose right hand I haveholden, tosubduenations before him; and I will loose the loins of kings, to open before him thetwo leaved gates; and the gates shall not be shut;",
            "citation": "(Isaiah 45:1)"
          },
          "2": {
            "text": "I will go before thee, and make thecrookedplaces straight: I willbreakin pieces the gates of brass, and cut in sunder the bars of iron:",
            "citation": "(Isaiah 45:2)"
          },
          "3": {
            "text": "And I will give thee thetreasures of darkness, and hidden riches of secret places, that thou mayest know that I, theLord, which calltheeby thyname,amtheGodof Israel.",
            "citation": "(Isaiah 45:3)"
          },
          "4": {
            "text": "For Jacob myservantssake, and Israel mineelect, I have evencalledthee by thy name: I have surnamed thee, though thou hast not known me.",
            "citation": "(Isaiah 45:4)"
          },
          "5": {
            "text": "IamtheLord, andthere isnone else,there isno God beside me: I girded thee, though thou hast not known me:",
            "citation": "(Isaiah 45:5)"
          },
          "6": {
            "text": "That they may know from therisingof the sun, and from the west, thatthere isnone beside me. IamtheLord, andthere isnone else.",
            "citation": "(Isaiah 45:6)"
          },
          "7": {
            "text": "I form thelight, and create darkness: I make peace, and createevil: I theLorddo all thesethings.",
            "citation": "(Isaiah 45:7)"
          },
          "8": {
            "text": "Drop down, ye heavens, from above, and let the skies pour downrighteousness: let the earth open, and letthembring forthsalvation, and let righteousness spring up together; I theLordhave created it.",
            "citation": "(Isaiah 45:8)"
          },
          "9": {
            "text": "Woe unto him thatstrivethwith hisMaker!Letthe potsherdstrivewith the potsherds of the earth. Shall theclaysay to him that fashioneth it, What makest thou? or thy work, He hath no hands?",
            "citation": "(Isaiah 45:9)"
          },
          "10": {
            "text": "Woe unto him that saith untohisfather, What begettest thou? or tothe woman, What hast thou brought forth?",
            "citation": "(Isaiah 45:10)"
          },
          "11": {
            "text": "Thus saith theLord, the Holy One of Israel, and his Maker, Ask me of things to come concerning mysons, and concerning theworkof my handscommand ye me.",
            "citation": "(Isaiah 45:11)"
          },
          "12": {
            "text": "I havemadethe earth, andcreatedman upon it: I,evenmy hands, have stretched out the heavens, and all theirhosthave I commanded.",
            "citation": "(Isaiah 45:12)"
          },
          "13": {
            "text": "I have raisedhimup in righteousness, and I will direct all his ways: he shallbuildmy city, and he shall let go my captives, not forpricenor reward, saith theLordof hosts.",
            "citation": "(Isaiah 45:13)"
          },
          "14": {
            "text": "Thus saith theLord, The labour ofEgypt, and merchandise of Ethiopia and of the Sabeans, men of stature, shall come over unto thee, and they shall be thine: they shall comeafterthee; in chains they shall come over, and they shall fall down unto thee, they shall make supplication unto thee,saying,Surely Godisin thee; andthere isnoneelse,there isno God.",
            "citation": "(Isaiah 45:14)"
          },
          "15": {
            "text": "Verily thouarta God thathidestthyself, O God of Israel, theSaviour.",
            "citation": "(Isaiah 45:15)"
          },
          "16": {
            "text": "They shall be ashamed, and also confounded, all of them: they shall go to confusion togetherthat aremakers ofidols.",
            "citation": "(Isaiah 45:16)"
          },
          "17": {
            "text": "ButIsrael shall besavedin theLordwith an everlastingsalvation: ye shall not be ashamed nor confounded world without end.",
            "citation": "(Isaiah 45:17)"
          },
          "18": {
            "text": "For thus saith theLordthatcreatedthe heavens; God himself that formed the earth and made it; he hath established it, he created it not in vain, he formed it to beinhabited: IamtheLord; andthere isnone else.",
            "citation": "(Isaiah 45:18)"
          },
          "19": {
            "text": "I have not spoken insecret, in dark place of the earth: I said not unto the seed of Jacob, Seek ye me in vain: I theLordspeakrighteousness, I declare things that areright.",
            "citation": "(Isaiah 45:19)"
          },
          "20": {
            "text": "Assemble yourselves and come; draw near together, yethat areescapedof thenations: they have noknowledgethat set up the wood of their graven image, andprayunto godthatcannot save.",
            "citation": "(Isaiah 45:20)"
          },
          "21": {
            "text": "Tell ye, and bringthemnear; yea, let them take counsel together: who hath declared this from ancient time?whohath told it from that time?havenot I theLord? andthere isno God else beside me; ajustGod and aSaviour;there isnone beside me.",
            "citation": "(Isaiah 45:21)"
          },
          "22": {
            "text": "Lookunto me, and be yesaved, all the ends of the earth: for IamGod, andthere isnone else.",
            "citation": "(Isaiah 45:22)"
          },
          "23": {
            "text": "I have sworn by myself, the word is gone out of my mouthinrighteousness, and shall not return, That unto me everykneeshall bow, every tongue shallswear.",
            "citation": "(Isaiah 45:23)"
          },
          "24": {
            "text": "Surely, shallonesay, in theLordhave I righteousness andstrength:evento him shallmencome; and all that are incensed against him shall be ashamed.",
            "citation": "(Isaiah 45:24)"
          },
          "25": {
            "text": "In theLordshall all the seed of Israel bejustified, and shall glory.",
            "citation": "(Isaiah 45:25)"
          }
        }
      },
      "46": {
        "verses": {
          "1": {
            "text": "Belboweth down, Nebo stoopeth, their idols were upon the beasts, and upon the cattle: your carriageswereheavy loaden;they areaburdento the wearybeast.",
            "citation": "(Isaiah 46:1)"
          },
          "2": {
            "text": "Theystoop, they bow down together; they could not deliver the burden, but themselves are gone into captivity.",
            "citation": "(Isaiah 46:2)"
          },
          "3": {
            "text": "Hearken unto me, O house of Jacob, and all theremnantof the house of Israel, which are borneby mefrom the belly, which are carried from the womb:",
            "citation": "(Isaiah 46:3)"
          },
          "4": {
            "text": "Andeventoyouroldage Iamhe; andeventohoar hairswill I carryyou:I have made, and I will bear; even I willcarry, and willdeliveryou.",
            "citation": "(Isaiah 46:4)"
          },
          "5": {
            "text": "To whom will yelikenme, and makemeequal, and compare me, that we may be like?",
            "citation": "(Isaiah 46:5)"
          },
          "6": {
            "text": "They lavish gold out of the bag, and weigh silver in the balance,andhire goldsmith; and he maketh it god: they fall down, yea, theyworship.",
            "citation": "(Isaiah 46:6)"
          },
          "7": {
            "text": "Theybearhim upon the shoulder, they carry him, and set him in his place, and he standeth; from his place shall he not remove: yea,oneshallcryunto him, yet can he not answer, nor save him out of his trouble.",
            "citation": "(Isaiah 46:7)"
          },
          "8": {
            "text": "Remember this, and shew yourselvesmen: bringitagain to mind, O ye transgressors.",
            "citation": "(Isaiah 46:8)"
          },
          "9": {
            "text": "Remembertheformerthings of old: forIamGod, andthere isnone else;I amGod, andthere isnonelike me,",
            "citation": "(Isaiah 46:9)"
          },
          "10": {
            "text": "Declaringtheendfrom the beginning, and from ancient timesthe thingsthat are notyetdone, saying, Mycounselshall stand, and I will do all mypleasure:",
            "citation": "(Isaiah 46:10)"
          },
          "11": {
            "text": "Calling aravenous birdfrom theeast, the man that executeth my counsel from far country: yea, I havespokenit,I will also bring it to pass; I have purposedit,I will also do it.",
            "citation": "(Isaiah 46:11)"
          },
          "12": {
            "text": "Hearken unto me, yestouthearted, thatarefar from righteousness:",
            "citation": "(Isaiah 46:12)"
          },
          "13": {
            "text": "I bring near my righteousness; it shall not be far off, and mysalvationshall nottarry: and I will place salvation in Zion for Israel my glory.",
            "citation": "(Isaiah 46:13)"
          }
        }
      },
      "47": {
        "verses": {
          "1": {
            "text": "Come down, and sit in the dust, O virgin daughter ofBabylon, sit on the ground:there isnothrone, Odaughter of the Chaldeans: for thou shalt no more be called tender and delicate.",
            "citation": "(Isaiah 47:1)"
          },
          "2": {
            "text": "Takethe millstones, and grind meal: uncover thy locks, make bare the leg, uncover the thigh,pass over the rivers.",
            "citation": "(Isaiah 47:2)"
          },
          "3": {
            "text": "Thy nakedness shall be uncovered, yea, thy shame shall be seen: I will take vengeance, andIwill not meetthee asa man.",
            "citation": "(Isaiah 47:3)"
          },
          "4": {
            "text": "As forour redeemer, theLordof hostsishis name, the Holy One of Israel.",
            "citation": "(Isaiah 47:4)"
          },
          "5": {
            "text": "Sit thou silent, andget thee into darkness, O daughter of the Chaldeans: for thou shalt no more be called, The lady of kingdoms.",
            "citation": "(Isaiah 47:5)"
          },
          "6": {
            "text": "I was wroth with my people, I have polluted mine inheritance, andgiventhem into thine hand: thou didst shew them no mercy; upon the ancient hast thou very heavily laid thy yoke.",
            "citation": "(Isaiah 47:6)"
          },
          "7": {
            "text": "And thou saidst, I shall bea ladyfor ever:sothat thou didst not lay thesethingsto thy heart, neither didst remember the latterendof it.",
            "citation": "(Isaiah 47:7)"
          },
          "8": {
            "text": "Therefore hear now this,thou that artgiven to pleasures, that dwellest carelessly, that sayest in thine heart, Iam,and none else beside me; I shall not sitasawidow, neither shall I know theloss of children:",
            "citation": "(Isaiah 47:8)"
          },
          "9": {
            "text": "But these twothingsshall come to thee in moment in one day, the loss of children, and widowhood: they shall come upon theein their perfectionfor the multitude of thy sorceries,andfor the great abundance of thine enchantments.",
            "citation": "(Isaiah 47:9)"
          },
          "10": {
            "text": "For thou hast trusted in thy wickedness: thou hast said, Noneseethme. Thy wisdom and thy knowledge, it hath perverted thee; and thou hast said in thine heart, Iam,and none else beside me.",
            "citation": "(Isaiah 47:10)"
          },
          "11": {
            "text": "Therefore shall evil come upon thee; thou shalt not know fromwhence it riseth: andmischiefshall fall upon thee; thou shalt not be able to put it off: anddesolationshall come upon thee suddenly,whichthou shalt not know.",
            "citation": "(Isaiah 47:11)"
          },
          "12": {
            "text": "Stand now with thine enchantments, and with the multitude of thy sorceries, wherein thou hast laboured from thy youth; if so be thou shalt be able to profit, if so be thou mayest prevail.",
            "citation": "(Isaiah 47:12)"
          },
          "13": {
            "text": "Thou art wearied in the multitude of thy counsels. Let now theastrologers, the stargazers, themonthlyprognosticators, stand up, and save thee fromthese thingsthat shall come upon thee.",
            "citation": "(Isaiah 47:13)"
          },
          "14": {
            "text": "Behold, they shall be asstubble; the fire shall burn them; they shall not deliver themselves from the power of the flame:there shallnotbea coal to warm at,norfire to sit before it.",
            "citation": "(Isaiah 47:14)"
          },
          "15": {
            "text": "Thus shall they be unto thee with whom thou hast laboured,eventhy merchants, from thy youth: they shall wander every one to his quarter; none shall save thee.",
            "citation": "(Isaiah 47:15)"
          }
        }
      },
      "48": {
        "verses": {
          "1": {
            "text": "Hear ye this, O house of Jacob, which are called by the name of Israel, and are come forth out of thewaters of Judah, whichswearby the name of theLord, and makementionof the God of Israel,butnot in truth, nor in righteousness.",
            "citation": "(Isaiah 48:1)"
          },
          "2": {
            "text": "For they call themselves of theholy city, andstay themselves uponthe God of Israel; TheLordof hostsishis name.",
            "citation": "(Isaiah 48:2)"
          },
          "3": {
            "text": "I havedeclaredtheformerthings from the beginning; and they went forth out of my mouth, and I shewed them; I didthemsuddenly, and they came to pass.",
            "citation": "(Isaiah 48:3)"
          },
          "4": {
            "text": "Because I knew thatthouartobstinate, and thyneckisan iron sinew, and thy brow brass;",
            "citation": "(Isaiah 48:4)"
          },
          "5": {
            "text": "I have even from the beginning declareditto thee; before it came to pass I sheweditthee: lest thou shouldest say, Mine idol hath done them, and my graven image, and my molten image, hath commanded them.",
            "citation": "(Isaiah 48:5)"
          },
          "6": {
            "text": "Thou hast heard, see all this; and will not ye declareit?I have shewed thee new things from this time, even hidden things, and thou didst not know them.",
            "citation": "(Isaiah 48:6)"
          },
          "7": {
            "text": "They are created now, and not from the beginning; even before the day when thou heardest them not; lest thou shouldest say, Behold, I knew them.",
            "citation": "(Isaiah 48:7)"
          },
          "8": {
            "text": "Yea, thou heardest not; yea, thou knewest not; yea, from that timethatthine ear was not opened: for I knew that thou wouldest deal very treacherously, and wast called transgressor from thewomb.",
            "citation": "(Isaiah 48:8)"
          },
          "9": {
            "text": "For mynamessake will I defer mineanger, and for my praise will I refrain for thee, that I cut thee not off.",
            "citation": "(Isaiah 48:9)"
          },
          "10": {
            "text": "Behold, I have refined thee, but not with silver; I have chosen thee in thefurnaceofaffliction.",
            "citation": "(Isaiah 48:10)"
          },
          "11": {
            "text": "For mine ownsake,evenfor mine own sake, will I doit:for how shouldmynamebe polluted? and I will notgivemy glory unto another.",
            "citation": "(Isaiah 48:11)"
          },
          "12": {
            "text": "Hearken unto me, O Jacob and Israel, my called; Iamhe; Iamthe first, I alsoamthe last.",
            "citation": "(Isaiah 48:12)"
          },
          "13": {
            "text": "Mine hand also hath laid thefoundation of theearth, and my right hand hath spanned the heavens:whenI call unto them, they stand up together.",
            "citation": "(Isaiah 48:13)"
          },
          "14": {
            "text": "All ye, assemble yourselves, and hear; which among them hath declared thesethings?TheLordhath loved him: he will do hispleasureonBabylon, and his armshall be onthe Chaldeans.",
            "citation": "(Isaiah 48:14)"
          },
          "15": {
            "text": "I,evenI, have spoken; yea, I have called him: I have brought him, and he shall make his way prosperous.",
            "citation": "(Isaiah 48:15)"
          },
          "16": {
            "text": "Come ye near unto me, hear ye this; I have not spoken insecretfrom the beginning; from the time that it was, thereamI: and now the LordGod, and his Spirit, hathsentme.",
            "citation": "(Isaiah 48:16)"
          },
          "17": {
            "text": "Thus saith theLord, thy Redeemer, the Holy One of Israel; IamtheLordthy God which teacheth thee to profit, whichleadeththee by the waythatthou shouldest go.",
            "citation": "(Isaiah 48:17)"
          },
          "18": {
            "text": "O that thou hadst hearkened to my commandments! then had thypeacebeen as river, and thy righteousness as the waves of the sea:",
            "citation": "(Isaiah 48:18)"
          },
          "19": {
            "text": "Thyseedalso had been as the sand, and the offspring of thy bowels like the gravel thereof; his name should not have been cut off nor destroyed from before me.",
            "citation": "(Isaiah 48:19)"
          },
          "20": {
            "text": "Go ye forth ofBabylon, flee ye from theChaldeans, with voice of singing declare ye, tell this, utter itevento the end of the earth; say ye, TheLordhath redeemed his servant Jacob.",
            "citation": "(Isaiah 48:20)"
          },
          "21": {
            "text": "And they thirsted notwhenhe led them through the deserts: he caused thewatersto flow out of the rock for them: he clave the rock also, and the waters gushed out.",
            "citation": "(Isaiah 48:21)"
          },
          "22": {
            "text": "There isnopeace, saith theLord, unto the wicked.",
            "citation": "(Isaiah 48:22)"
          }
        }
      },
      "49": {
        "verses": {
          "1": {
            "text": "Listen, O isles, unto me; andhearken, ye people, from far; TheLordhathcalledme from the womb; from the bowels of my mother hath he made mention of my name.",
            "citation": "(Isaiah 49:1)"
          },
          "2": {
            "text": "And he hath made my mouth like sharpsword; in the shadow of his hand hath he hid me, and made me polished shaft; in his quiver hath he hid me;",
            "citation": "(Isaiah 49:2)"
          },
          "3": {
            "text": "And said unto me, Thouartmyservant, O Israel, in whom I will beglorified.",
            "citation": "(Isaiah 49:3)"
          },
          "4": {
            "text": "Then I said, I have laboured in vain, I have spent my strength for nought, and in vain:yetsurely my judgmentiswith theLord, and my work with my God.",
            "citation": "(Isaiah 49:4)"
          },
          "5": {
            "text": "And now, saith theLordthatformedme from the wombto behis servant, to bring Jacob again to him, Though Israel be not gathered, yet shall I be glorious in the eyes of theLord, and my God shall be my strength.",
            "citation": "(Isaiah 49:5)"
          },
          "6": {
            "text": "And he said, It is light thing that thou shouldest be my servant to raise up the tribes of Jacob, and to restore the preserved of Israel: I will also give thee for alightto theGentiles, that thou mayest be mysalvationunto the end of the earth.",
            "citation": "(Isaiah 49:6)"
          },
          "7": {
            "text": "Thus saith theLord, the Redeemer of Israel,andhis Holy One, to him whom man despiseth, to him whom the nation abhorreth, to servant of rulers, Kings shall see and arise, princes also shall worship, because of theLordthat is faithful,andthe Holy One of Israel, and he shall choose thee.",
            "citation": "(Isaiah 49:7)"
          },
          "8": {
            "text": "Thus saith theLord, In an acceptabletimehave I heard thee, and in day of salvation have I helped thee: and I will preserve thee, and give thee for acovenantof the people, to establish the earth, to cause toinheritthe desolate heritages;",
            "citation": "(Isaiah 49:8)"
          },
          "9": {
            "text": "That thou mayest say to theprisoners, Go forth; to them thatarein darkness, Shew yourselves. They shall feed in the ways, and their pasturesshall bein all high places.",
            "citation": "(Isaiah 49:9)"
          },
          "10": {
            "text": "They shall not hunger northirst; neither shall the heat norsunsmite them: for he that hath mercy on them shall lead them, even by the springs of water shall he guide them.",
            "citation": "(Isaiah 49:10)"
          },
          "11": {
            "text": "And I will make all my mountains way, and myhighwaysshall be exalted.",
            "citation": "(Isaiah 49:11)"
          },
          "12": {
            "text": "Behold, these shall come from far: and, lo, these from thenorthand from the west; and these from the land of Sinim.",
            "citation": "(Isaiah 49:12)"
          },
          "13": {
            "text": "Sing, O heavens; and be joyful, O earth; and break forth intosinging, O mountains: for theLordhathcomfortedhis people, and will havemercyupon hisafflicted.",
            "citation": "(Isaiah 49:13)"
          },
          "14": {
            "text": "But Zion said, TheLordhathforsakenme, and my Lord hath forgotten me.",
            "citation": "(Isaiah 49:14)"
          },
          "15": {
            "text": "Can awomanforget her sucking child, that she should not have compassion on the son of her womb? yea, they may forget, yet will I notforgetthee.",
            "citation": "(Isaiah 49:15)"
          },
          "16": {
            "text": "Behold, I have graven thee upon the palms ofmyhands; thy wallsarecontinually before me.",
            "citation": "(Isaiah 49:16)"
          },
          "17": {
            "text": "Thy children shall make haste; thy destroyers and they that made thee waste shall go forth of thee.",
            "citation": "(Isaiah 49:17)"
          },
          "18": {
            "text": "Lift up thine eyes round about, and behold: all thesegatherthemselves together,andcome to thee.AsI live, saith theLord, thou shalt surely clothe thee with them all, as with an ornament, and bind themon thee,as bridedoeth.",
            "citation": "(Isaiah 49:18)"
          },
          "19": {
            "text": "For thy waste and thy desolate places, and the land of thy destruction, shall even now be too narrow by reason of the inhabitants, and they that swallowed thee up shall be far away.",
            "citation": "(Isaiah 49:19)"
          },
          "20": {
            "text": "The children which thou shalt have, after thou hast lost the other, shall say again in thine ears, The placeistoostraitfor me: give place to me that I may dwell.",
            "citation": "(Isaiah 49:20)"
          },
          "21": {
            "text": "Then shaltthousay in thine heart, Who hath begotten me these, seeing I have lost my children, and amdesolate, captive, and removing to and fro? and who hath brought up these? Behold, I was left alone; these, wherehadtheybeen?",
            "citation": "(Isaiah 49:21)"
          },
          "22": {
            "text": "Thus saith the LordGod, Behold, I willlift upmine hand to theGentiles, and set up mystandardto the people: and they shall bring thysonsintheirarms, and thy daughters shall be carried upontheirshoulders.",
            "citation": "(Isaiah 49:22)"
          },
          "23": {
            "text": "And kings shall be thynursingfathers, and their queens thy nursingmothers: they shallbowdown to thee withtheirface toward the earth, and lick up the dust of thy feet; and thou shalt know that IamtheLord: for they shall not beashamedthat wait for me.",
            "citation": "(Isaiah 49:23)"
          },
          "24": {
            "text": "Shall the prey be taken from the mighty, or the lawful captive delivered?",
            "citation": "(Isaiah 49:24)"
          },
          "25": {
            "text": "But thus saith theLord, Even the captives of the mighty shall be taken away, and the prey of the terrible shall be delivered: for I willcontendwith him that contendeth with thee, and I will save thy children.",
            "citation": "(Isaiah 49:25)"
          },
          "26": {
            "text": "And I will feed them thatoppressthee with their own flesh; and they shall be drunken with their own blood, as with sweet wine: and all flesh shallknowthat I theLordamthySaviourand thyRedeemer, themighty Oneof Jacob.",
            "citation": "(Isaiah 49:26)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 63774,
  "total_sources": 12,
  "generated_at": "2025-12-14T04:01:27.394354"
}