{
  "week_number": 39,
  "date_range": "Isaiah 13–14",
  "title": ";22;24–30;35",
  "primary_scriptures": [
    {
      "book": "Isaiah",
      "chapters": [
        "13",
        "14"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Isaiah",
      "chapters": [
        "13",
        "14"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;22;24–30;35 ---\nOne thing that the Lord asks prophets to do is to warn about the consequences of sin. For Old Testament prophets, this often meant telling the rulers of mighty kingdoms that they needed to repent. It was a dangerous task, but Isaiah was fearless, and his warnings to the kingdoms of his day—including Israel, Judah, and surrounding nations—were bold (see\nIsaiah 13–23\n).\nHowever, Isaiah also had a message of hope. Even though the prophesied destructions did come upon these kingdoms, Isaiah foresaw a chance for restoration and renewal. The Lord would invite His people to return to Him. He would make “the parched ground … become a pool, and the thirsty land springs of water” (\nIsaiah 35:7\n). He would perform “a marvellous work and a wonder” (\nIsaiah 29:14\n), restoring to Israel the blessings He had promised them. Neither Isaiah nor anyone else alive at that time lived to see this marvelous work. But we are seeing it today. In fact, we are part of it.\nIdeas for Learning at Home and at Church\nIsaiah 13:1–11, 19–22\n;\n14:1–20\nPride and worldliness will fail.\nIn Isaiah’s day, Babylon was a mighty kingdom with a powerful ruler. Now Babylon is ancient history. So why is Isaiah’s message to Babylon, in\nIsaiah 13–14\n, important to us today? Because Babylon symbolizes pride, greed, and sin, things that still surround us today. Think about this symbolism as you read\nIsaiah 13:1–11, 19–22\n;\n14:1–20\n. You might consider questions like these:\nWhat similarities do you see between the pride of the Babylonian king and the pride of Satan? (see\nIsaiah 14:4–20\n;\nMoses 4:1–4\n). What warnings do you find for yourself in these verses?\nHow does the Savior provide “rest from thy sorrow, and from thy fear”? (\nIsaiah 14:3\n).\n“He will swallow up death in victory” (\nIsaiah 25:8\n).\nIsaiah 22:22–23\n;\n24:21–23\n;\n25:6–8\n;\n26:19\n;\n28:16\nJesus Christ is the promised Messiah.\nThe teachings of Isaiah often refer to the Savior’s mission, including His atoning sacrifice, Resurrection, and Second Coming. What aspects of His mission come to mind as you read these verses:\nIsaiah 22:22–23\n;\n24:21–23\n;\n25:6–8\n;\n26:19\n;\n28:16\n? What other passages do you find that remind you of the Savior?\nGive learners opportunities to bear testimony of Jesus Christ.\n“To be a teacher of Jesus Christ’s gospel means to help others understand and rely on His teachings, redeeming power, and perfect love” (\nTeaching in the Savior’s Way\n,\n8\n). One simple way to do that every time you teach is to ask a question like “What did you find in the scriptures this week that taught you something about the Savior?” Then let learners share their experiences and strengthen each other’s faith.\nIsaiah 24:1–12\n;\n28:1–8\n;\n29:7–13\n;\n30:8–14\nTurning away from the Lord brings spiritual danger.\nIn His mercy, the Lord sent Isaiah to warn the covenant people that they were straying from Him. See if you can find the spiritual warning signs of this in\nIsaiah 24:5\n;\n29:13\n;\n30:8–12\n. Why are these attitudes and actions spiritually dangerous?\nTo warn about the consequences of turning away from the Lord, Isaiah used some memorable comparisons. As you study them, ask yourself how turning away from the Lord is like:\nA sad, empty earth (\nIsaiah 24:1–12\n).\nDrunkenness (\nIsaiah 28:7–8\n).\nHunger and thirst (\nIsaiah 29:7–10\n).\nA broken wall or vessel (\nIsaiah 30:13–14\n).\nWhy is it important to you to stay close to the Lord?\nIsaiah 29\n;\n30:18–26\n;\n35\nThe Lord can restore what is lost or broken.\nHave you ever lost something that you thought you would never find again? Or maybe something broke, and you worried that it could never be repaired. When we turn away from the Lord, Satan wants us to think that we can never return or be healed. However, Isaiah described some of the marvelous things the Lord will do to help us return to Him. What do you learn from\nIsaiah 29:13–24\n;\n30:18–26\n;\n35\nabout the Lord, His love, and His power? Perhaps you could find a phrase in these passages that gives you hope when you need healing. You could also look in Sister Amy A. Wright’s message “\nChrist Heals That Which Is Broken\n” (\nLiahona\n, May 2022, 81–84).\nOne way the Lord manifests His power and mercy is through the Restoration of His gospel.\nIsaiah 29\ncontains several passages that have parallels with events of the Restoration. For example:\nCompare\nIsaiah 29:11–12\nwith\n2 Nephi 27:6–26\nand\nJoseph Smith—History 1:63–65\n.\nCompare\nIsaiah 29:13–14\nwith\nDoctrine and Covenants 4\nand\nJoseph Smith—History 1:17–19\n.\nCompare\nIsaiah 29:18–24\nwith the\ntitle page of the Book of Mormon\n.\nIn your opinion, why are “marvellous” and “wonder” (\nIsaiah 29:14\n) good words to describe the Lord restoring His gospel? How can you help fulfill the prophecies about the Restoration? For ideas, look in Elder Gerrit W. Gong’s message “\nAll Nations, Kindreds, and Tongues\n” (\nEnsign\nor\nLiahona\n, Nov. 2020, 38–41).\nSee also “\nThe Restoration of the Fulness of the Gospel of Jesus Christ: A Bicentennial Proclamation to the World\n” (Gospel Library); “\nThe Morning Breaks\n,”\nHymns\n, no 1.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 14:3\n;\n25:8–9\n;\n28:16\nJesus Christ can save me from sin and death.\nHow will you help your children see the Savior in the writings of Isaiah? You might help them find phrases that remind them of Him in\nIsaiah 14:3\n;\n25:8\n; or\n28:16\n. They could also match these verses from Isaiah with other verses that teach about the Savior, such as\nMatthew 11:28–30\n;\n1 Corinthians 15:53–57\n;\nHelaman 5:12\n. What great things has the Lord done for us?\nAfter reading\nIsaiah 25:8–9\ntogether, you could look at pictures of the Savior in Gethsemane, on the cross, and after His Resurrection. Let your children talk about what is happening in the pictures and why they love Jesus and “rejoice in his salvation” (\nverse 9\n).\nYou might choose to tell your children about the sadness you felt when someone you love passed away. Testify of the comfort you receive because of Jesus Christ. Maybe your children could draw a crying face and then erase the tears as you read\nIsaiah 25:8\ntogether.\nThy Will Be Done\n, by Ken Spencer\nIsaiah 25:4–6\nJesus gives me “refuge from the storm.”\nHave you and your children ever experienced the blessing of safe shelter during a storm or shade on a hot summer day? Or have you enjoyed a good meal when you were hungry? Talk about these experiences as you read\nIsaiah 25:4–6\n. How is Jesus like these things?\nIsaiah 29:11–18, 24\nThe Restoration of the gospel is a “marvellous work.”\nAs you and your children read\nIsaiah 29:14\n, share with them other words that mean the same thing as “marvellous” and “wonder.” Let them help you find objects or pictures that represent some of the Lord’s marvelous works during the latter days. These might include a copy of the Book of Mormon, a picture of a temple, or a picture of the First Vision (there’s one at the beginning of this outline). Then your children could choose an item and share why it is marvelous to them.\nA song about the Restoration of the gospel could go well with\nIsaiah 29\n, such as “\nOn a Golden Springtime\n” (\nChildren’s Songbook\n, 88). And perhaps a personal experience could help the children understand what\nrestoration\nmeans. For example, you and your children could talk about something that you lost and how you found it. Help your children compare this to the Restoration of the gospel. According to\nIsaiah 29:13–15\n, why do we need the Restoration? What marvelous works is the Lord doing to restore His gospel? (see this week’s activity page).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 39: Lesson 117: Lesson 117—Isaiah 25This lesson can help students understand the importance of waiting for the Lord.; Lesson 118: Lesson 118—Isaiah 29This lesson can help students feel gratitude for the Restoration of the gospel of Jesus Christ and the Book of Mormon. ---\n\n--- Lesson 117 ---\nHow do you respond when it seems as though your earnest prayers go unanswered? Throughout scripture, the Lord and His prophets have emphasized our need to be waiting for the Lord (see Isaiah 25:9 ), patiently seeking blessings and answers. This lesson can help students understand the importance of waiting for the Lord. Student preparation: Invite students to reflect on a time when they or someone they know had to patiently wait for an answer or blessing from Heavenly Father. They could prepare to share what makes the experience of waiting easy or difficult for them. Possible Learning Activities Developing patience by practice To help students understand how difficult it can be to wait patiently for something, consider displaying a marshmallow or a picture of a child looking at a marshmallow as the following paragraph is read or summarized. Alternatively, you could use the video “ Continue in Patience ,” from ChurchofJesusChrist.org , time code 0:00–1:08, to get students thinking about our need to wait patiently. In the video, President Dieter F. Uchtdorf, then of the First Presidency, introduces the same marshmallow experiment. 2:42 To test children’s ability to patiently wait, researchers placed a large marshmallow in front of several four-year-olds. The children were told that they could eat the marshmallow immediately. However, if they were able to wait 15 minutes, they would be given two marshmallows. Only 30 percent of the children were able to wait. What do you think might have made the difference between the children who could wait and those who could not? When have you had difficulty waiting for something? What made it challenging for you? At times, Heavenly Father may ask us to wait for a desired answer or blessing. Sometimes, He might not provide the desired answer or blessing in the way or at the time we want. What are some examples of blessings or answers from the Lord we may need to patiently wait for? Students may mention waiting for confirmation that the Book of Mormon is true, seeking healing blessings for a sick loved one, or petitioning Heavenly Father for answers to their gospel questions. To help students identify how this lesson applies to their individual needs, provide an opportunity for them to ponder the following self-assessment questions. What blessings or answers from Heavenly Father are you currently waiting to receive? What might He ask you to wait for in the future? What makes waiting for something from Heavenly Father easy or difficult for you? As you study today, seek the help of the Holy Ghost to increase your understanding of the importance of waiting on the will and timing of Heavenly Father and Jesus Christ. You could prayerfully invite Heavenly Father to strengthen your ability to wait patiently. Patiently waiting for the Lord It might be helpful to share with students that the Lord sent the prophet Isaiah to the nation of Judah during a chaotic time of political and social uncertainty. Isaiah 25 reminds the house of Israel of the great blessings they have and will receive from the Lord. Read Isaiah 25:1–4, 6–9 , looking for what the Lord had already done for Israel and what He would do for them in the future. What blessings stand out to you? According to verse 9 , what does the Lord ask us to do to receive His blessings? Help students identify a truth such as if we wait for the Lord, we will be glad and rejoice in His salvation . You could write the phrase “wait for the Lord” on the board. Invite students to imagine a friend asked them to explain what this phrase means. Help students create an explanation for this phrase. If students need additional help understanding what it means to wait for the Lord, you could share the following statement. Elder Robert D. Hales (1932–2017) of the Quorum of the Twelve Apostles taught: In the scriptures, the word wait means to hope, to anticipate, and to trust. To hope and trust in the Lord requires faith, patience, humility, meekness, long-suffering, keeping the commandments, and enduring to the end. (“ Waiting Upon the Lord: Thy Will Be Done ,” Ensign or Liahona , Nov. 2011, 71) Is there anything you would add to help someone understand what it means to wait for the Lord? Why do you think it is important to the Lord that we learn to wait for Him? How does that help us become more like Him? Students could benefit from seeing the example of Jesus Christ waiting for Heavenly Father. You could share other examples from Elder Hales’s message, “ Waiting Upon the Lord: Thy Will Be Done ,” (time code 0:59–2:57). 16:12 Great blessings promised to those who wait on the Lord To help students see other blessings the Lord has promised to those who wait for Him, you could use the following scripture study skill activity. This activity helps students practice linking or cross-referencing verses to help increase their understanding of the principle. Select one or more of the following verses to study: Psalm 27:14 ; Isaiah 40:31 ; Doctrine and Covenants 133:45 . Look for additional blessings the Lord promises to those who wait for Him. What might the blessings of waiting for the Lord look like today? Students might share blessings like peace, joy, or strength while they are waiting for the Lord. As an example of blessings that came after waiting on the Lord, you could show President Uchtdorf’s story in the video “ Continue in Patience ,” from ChurchofJesusChrist.org , time code 1:07–2:41. Invite students to look for what President Uchtdorf, then of the First Presidency, did to act in faith as he waited for the promised blessings of following the Word of Wisdom. 2:42 After you display the following questions, you might share a brief experience you have had while students think about how they would respond. When have you had an experience of waiting for an answer or blessing? What have you done that has helped you wait for the Lord? We are to actively wait for the Lord Providing an opportunity for students to share what they have studied can make it easier for them to recognize their learning and growth. One way to do this would be with the activity below. If useful, invite students to think of additional details to add to the scenario to make it relevant to them. Imagine you were asked to give advice to someone struggling while waiting for a blessing or an answer to their prayers. In your study journal: List something you have learned today that has helped you understand the importance of waiting on the Lord. You might share something you know about the Lord that has helped you. Write down a passage from Isaiah 25 or another scripture that could be helpful for someone actively waiting on the Lord. Write down something you feel would be helpful for someone to do while they are waiting for the Lord’s answers and blessings. You could include an experience when you or someone you know has experienced the Lord’s blessings. Consider concluding class by sharing how you have come to know that you can trust the Lord as you wait for Him.\n\n\n--- Lesson 118 ---\nHow is the gospel of Jesus Christ and the Book of Mormon marvelous to you? Isaiah described the Restoration of the gospel of Jesus Christ, including the coming forth of the Book of Mormon, as “a marvellous work and a wonder” ( Isaiah 29:14 ). This lesson can help students feel gratitude for the Restoration of the gospel of Jesus Christ and the Book of Mormon. Student preparation: Invite students to think of how they might define the words marvelous and wonderful. Using their definition, invite them to find a verse or story in the Book of Mormon that is marvelous or wonderful to them. Possible Learning Activities Apostasy To see the need for the Restoration of the gospel, it is helpful for students to understand the Great Apostasy. To do this, tell students they are going to try and guess an event based on clues. Then display the following phrases one at a time as students try to guess “the Great Apostasy.” As students identify it, invite them to raise their hand but not share the answer yet. Use the following phrases to determine what event is being described: “darkness shall cover the earth” ( Isaiah 60:2 ) “a famine of hearing the words of the Lord” ( Amos 8:11 ) “grievous wolves shall enter in among you” ( Acts 20:29 ) “a falling away” ( 2 Thessalonians 2:3 ) Invite students to share what they understand about the Great Apostasy. If needed, you could share that the Great Apostasy refers to “a widespread falling away from the gospel and Church of Jesus Christ” that occurred after the death of the Savior and His Apostles ( Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ , 37). Alternatively, you could watch “ What Is the Restoration? ,” available at ChurchofJesusChrist.org , from time code 0:32 to 2:09. 5:13 It may be helpful to explain to students that many of Isaiah’s prophecies referred to different time periods and had multiple fulfilments. For example, Isaiah 29 was a prophecy for Isaiah’s own people that Jerusalem would soon be destroyed. However, his prophecy in Isaiah 29 can also refer to the Great Apostasy (see 2 Nephi 27 ). Read Isaiah 29:8–10 , looking for descriptions of the Great Apostasy. How does the passage describe people who have either abandoned or never had access to the Lord’s truth due to the Great Apostasy? We live in a world where many are still spiritually hungry, staggering, or sleeping. We may also make choices that distance us from the Lord. Take a moment to ponder ways you, or those you love, may feel this way. As you study today, seek help from the Holy Ghost to appreciate what Heavenly Father and Jesus Christ have given us to overcome these challenges and turn to Them. A marvelous work and a wonder Read Isaiah 29:4 to identify what Isaiah prophesied the Lord would bless us with to overcome the effects of the Great Apostasy. To help students understand that verse 4 is referring to the Book of Mormon, you could provide students with some of the following scripture references: 2 Nephi 33:13 Mormon 8:23 Last paragraph of “ Testimony of the Prophet Joseph Smith ” found in the introductory pages of the Book of Mormon. Alternatively, you could display all of the references on the board and invite students to use as many of them as they need to identify what the Lord has blessed us with. Students could pick one or more of these references and cross-reference, or link, them to Isaiah 29:4 . This can help them remember what they are learning. You might invite students to read Isaiah 29:11–12 and looking for other phrases that could refer to the coming forth of the Book of Mormon. Students might mark, “the book is delivered to him that is not learned” ( Isaiah 29:12 ). This phrase refers to Joseph Smith, who received very little formal schooling. If students do not know, you could explain that these verses refer to an event in Church history found in Joseph Smith—History 1:62–65 . Isaiah 29:13–14 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Isaiah 29:13–14 , looking for what the Lord said He would do to overcome the effects of the Apostasy. President Russell M. Nelson explained what the marvelous work and wonder is: That marvelous work [and wonder] would include the coming forth of the Book of Mormon and the Restoration of the gospel. (“ Scriptural Witnesses ,” Ensign or Liahona , Nov. 2007, 46) How would you summarize what we can learn from Isaiah 29:13–14 ? Students might share something similar to the following: The Lord restored the gospel of Jesus Christ, including the coming forth of the Book of Mormon, to overcome the effects of the Great Apostasy . Explain that the Restoration of the Gospel is “God’s reestablishment of the truths and ordinances of His gospel among men on earth” (“ Restoration of the Gospel ,” Guide to the Scriptures, Gospel Library). Alternatively, you could watch “ What Is the Restoration? ” from time code 2:09 to 5:13. 5:13 To help students analyze this truth, consider placing them in groups to discuss the following questions. What can this truth teach us about Heavenly Father and Jesus Christ? How can the Restoration of the gospel of Jesus Christ and the Book of Mormon help us overcome the spiritual difficulties caused by the Great Apostasy? The blessings of the marvelous work and wonder The following can help students see how the Restoration and the Book of Mormon can help us overcome the effects of the Great Apostasy. Write the question “ How can the Lord bless me through the Restoration and the Book of Mormon? ” in your journal. Read Isaiah 29:18–19 and write what you find that answers the question. Invite students to continue to add answers and thoughts to their study journal as they continue learning. To help students see how the marvelous work and wonder of the Book of Mormon can bless us, you could share President Russell M. Nelson’s teachings in the following video available at ChurchofJesusChrist.org . “ The Book of Mormon: What Would Your Life Be Like without It? ” from time code 5:38 to 8:44. 15:1 The following activity can help students reflect on how the Book of Mormon or the Restoration is marvelous to them. Ensure that students have enough time to successfully complete the activity. You may want to display the instructions for the activity on the board. Complete one of the following activities: Activity 1 Identify a verse or story from the Book of Mormon that brings you closer to Heavenly Father and Jesus Christ. If helpful, you could look at Book of Mormon doctrinal mastery passages. Explain why it is marvelous to you. Activity 2 Identify a doctrine, ordinance, blessing, or other aspect of the Restoration of the gospel of Jesus Christ (modern-day prophets, temples, the priesthood, and so on) that helps you draw closer to Heavenly Father and Jesus Christ. Explain why it is marvelous to you. After enough time, invite students to get into small groups and share their explanations. Consider concluding class by inviting students to ponder why they are grateful to Heavenly Father and Jesus Christ for the Restoration and the Book of Mormon. Consider sharing your feelings about why you are grateful for the Restoration or the Book of Mormon. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Isaiah 29:13–14 is “The Restoration of the gospel is ‘a marvellous work and a wonder.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n--- SCRIPTURE: Isaiah 13 ---\n1. TheburdenofBabylon, which Isaiah the son of Amoz did see.\n2. Lift ye up abannerupon the highmountain,exaltthe voice unto them, shake the hand, that they may go into the gates of the nobles.\n3. I have commanded mysanctified ones, I have also called mymightyones for mine anger,eventhem that rejoice in my highness.\n4. The noise of multitude in the mountains, like as of great people; tumultuous noise of thekingdomsof nations gathered together: theLordof hosts mustereth the host of thebattle.\n5. They come from far country, from the end of heaven,eventheLord, and the weapons of his indignation, todestroythe whole land.\n6. Howlye; for thedayof theLordisat hand; it shall come as destruction from the Almighty.\n7. Therefore shall all hands be faint, and every mans heart shallmelt:\n8. And they shall be afraid: pangs and sorrows shall take hold of them; they shall be inpainas woman thattravaileth: they shall be amazed one at another; their facesshall be asflames.\n9. Behold, the day of theLordcometh, cruel both with wrath and fierce anger, to lay the land desolate: and he shalldestroythe sinners thereof out of it.\n10. For the stars of heaven and the constellations thereof shall not give their light: the sun shall bedarkenedin his going forth, and the moon shall not cause her light to shine.\n11. And I willpunishtheworldfortheirevil, and the wicked for their iniquity; and I will cause the arrogancy of the proud to cease, and will lay low thehaughtinessof theterrible.\n12. I will make man morepreciousthan fine gold; even man than thegoldenwedge of Ophir.\n13. Therefore I willshakethe heavens, and theearthshallremoveout of her place, in the wrath of theLordof hosts, and in the day of his fierceanger.\n14. And it shall be as thechased roe, and as sheep thatno man taketh up: they shall every man turn to his ownpeople, and flee every one into his ownland.\n15. Every one that is found shall bethrustthrough; and every one that is joinedunto themshall fall by the sword.\n16. Theirchildrenalso shall be dashed to pieces before their eyes; theirhousesshall bespoiled, and their wives ravished.\n17. Behold, I will stir up theMedesagainst them, which shall not regard silver; andas forgold, they shall not delight in it.\n18. Theirbows also shall dash the young men to pieces; and they shall have no pity on the fruit of the womb; their eye shall not spare children.\n19. AndBabylon, the glory of kingdoms, thebeautyof theChaldeesexcellency, shall be as when GodoverthrewSodomand Gomorrah.\n20. It shall never beinhabited, neither shall it be dwelt in from generation to generation: neither shall the Arabian pitch tent there; neither shall the shepherds make their fold there.\n21. Butwildbeasts of the desert shall lie there; and their houses shall be full of doleful creatures; and owls shall dwell there, andsatyrsshall dance there.\n22. And the wild beasts of the islands shall cry in their desolatehouses, anddragonsintheirpleasant palaces: and her timeisnear to come, and her days shall not be prolonged.\n\n--- SCRIPTURE: Isaiah 14 ---\n1. FortheLordwill havemercyon Jacob, and will yetchooseIsrael, and set them in their ownland: and thestrangersshall be joined with them, and they shall cleave to the house of Jacob.\n2. And thepeople shall take them, andbringthem to their place: and the house of Israel shall possess them in the land of theLordfor servants and handmaids: and they shall take themcaptives, whose captives they were; and they shallruleover their oppressors.\n3. And it shall come to pass in the day that theLordshall give thee rest from thy sorrow, and from thy fear, and from the hard bondage wherein thou wast made to serve,\n4. That thou shalt take up thisproverbagainst the king ofBabylon, and say, How hath the oppressor ceased! thegoldencity ceased!\n5. TheLordhath broken thestaffof thewicked,andthe sceptre of the rulers.\n6. He who smote the people in wrath witha continual stroke, he that ruled the nations in anger, is persecuted,andnone hindereth.\n7. The whole earth is atrest,andis quiet: they break forth into singing.\n8. Yea, thefir treesrejoice at thee,andthe cedars of Lebanon,saying,Since thou artlaid down,nofeller is come up against us.\n9. Hellfrom beneath is moved for thee to meettheeat thy coming: it stirreth up thedeadfor thee,evenall the chief ones of the earth; it hath raised up from their thrones all the kings of the nations.\n10. All they shall speak and say unto thee, Art thou also become weak as we? art thou become like unto us?\n11. Thy pomp is brought down tothe grave,andthe noise of thyviols: the worm is spread under thee, and the worms cover thee.\n12. How art thoufallenfromheaven, OLucifer, son of the morning!howart thou cut down to the ground, which didst weaken thenations!\n13. For thou hast said in thineheart,Iwill ascend into heaven, I willexaltmythroneabove the stars of God: I will sit also upon the mount of the congregation, in the sides of thenorth:\n14. I will ascend above the heights of the clouds; I will be like themostHigh.\n15. Yet thou shalt be brought down tohell, to the sides of the pit.\n16. They that seetheeshallnarrowly look upon thee,andconsider thee,saying, Isthis the man that made the earth to tremble, that did shake kingdoms;\n17. Thatmade the world as wilderness, and destroyed the cities thereof;thatopened not the house of his prisoners?\n18. All the kings of the nations,evenall of them, lie inglory, every one inhis own house.\n19. But thou art cast out of thy grave likean abominable branch,and asthe raiment of those that are slain, thrust through with sword, that go down tothe stonesof the pit; as carcase trodden under feet.\n20. Thou shalt not bejoinedwith them in burial, because thou hast destroyed thy land,andslain thy people: theseedofevildoersshall never be renowned.\n21. Prepareslaughter for his children for the iniquity of their fathers; that they do not rise, nor possess the land, nor fill the face of the world with cities.\n22. For I will rise up against them, saith theLordof hosts, andcut offfrom Babylon the name, and remnant, and son, and nephew, saith theLord.\n23. I will also make it possession for thebittern, and pools of water: and I will sweep it with thebesomof destruction, saith theLordof hosts.\n24. TheLordof hosts hath sworn, saying, Surely as I have thought, so shall it come to pass; and as I have purposed,soshall it stand:\n25. ThatIwill break the Assyrian in my land, and uponmy mountainstread him under foot: then shall hisyokedepart from off them, and his burden depart from off their shoulders.\n26. Thisisthe purpose that is purposed upon the wholeearth: and thisisthe hand that is stretched out uponall the nations.\n27. For theLordof hosts hathpurposed, and who shall disannulit?and his handisstretched out, and who shall turn it back?\n28. In theyearthat kingAhazdied was thisburden.\n29. Rejoice not thou, wholePalestina, because the rod of him that smote thee is broken: for out of the serpents root shall come forth cockatrice, and his fruitshall bea fiery flying serpent.\n30. And the firstborn of the poor shall feed, and the needy shall lie down in safety: and I will kill thy root with famine, and he shall slay thy remnant.\n31. Howl, O gate; cry, O city; thou, wholePalestina,artdissolved: for there shall come from the north smoke, and noneshall bealone in his appointed times.\n32. What shallonethen answer the messengers of thenation? That theLordhath foundedZion, and thepoorof his people shalltrust in it.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";22;24–30;35",
      "content": "One thing that the Lord asks prophets to do is to warn about the consequences of sin. For Old Testament prophets, this often meant telling the rulers of mighty kingdoms that they needed to repent. It was a dangerous task, but Isaiah was fearless, and his warnings to the kingdoms of his day—including Israel, Judah, and surrounding nations—were bold (see\nIsaiah 13–23\n).\nHowever, Isaiah also had a message of hope. Even though the prophesied destructions did come upon these kingdoms, Isaiah foresaw a chance for restoration and renewal. The Lord would invite His people to return to Him. He would make “the parched ground … become a pool, and the thirsty land springs of water” (\nIsaiah 35:7\n). He would perform “a marvellous work and a wonder” (\nIsaiah 29:14\n), restoring to Israel the blessings He had promised them. Neither Isaiah nor anyone else alive at that time lived to see this marvelous work. But we are seeing it today. In fact, we are part of it.\nIdeas for Learning at Home and at Church\nIsaiah 13:1–11, 19–22\n;\n14:1–20\nPride and worldliness will fail.\nIn Isaiah’s day, Babylon was a mighty kingdom with a powerful ruler. Now Babylon is ancient history. So why is Isaiah’s message to Babylon, in\nIsaiah 13–14\n, important to us today? Because Babylon symbolizes pride, greed, and sin, things that still surround us today. Think about this symbolism as you read\nIsaiah 13:1–11, 19–22\n;\n14:1–20\n. You might consider questions like these:\nWhat similarities do you see between the pride of the Babylonian king and the pride of Satan? (see\nIsaiah 14:4–20\n;\nMoses 4:1–4\n). What warnings do you find for yourself in these verses?\nHow does the Savior provide “rest from thy sorrow, and from thy fear”? (\nIsaiah 14:3\n).\n“He will swallow up death in victory” (\nIsaiah 25:8\n).\nIsaiah 22:22–23\n;\n24:21–23\n;\n25:6–8\n;\n26:19\n;\n28:16\nJesus Christ is the promised Messiah.\nThe teachings of Isaiah often refer to the Savior’s mission, including His atoning sacrifice, Resurrection, and Second Coming. What aspects of His mission come to mind as you read these verses:\nIsaiah 22:22–23\n;\n24:21–23\n;\n25:6–8\n;\n26:19\n;\n28:16\n? What other passages do you find that remind you of the Savior?\nGive learners opportunities to bear testimony of Jesus Christ.\n“To be a teacher of Jesus Christ’s gospel means to help others understand and rely on His teachings, redeeming power, and perfect love” (\nTeaching in the Savior’s Way\n,\n8\n). One simple way to do that every time you teach is to ask a question like “What did you find in the scriptures this week that taught you something about the Savior?” Then let learners share their experiences and strengthen each other’s faith.\nIsaiah 24:1–12\n;\n28:1–8\n;\n29:7–13\n;\n30:8–14\nTurning away from the Lord brings spiritual danger.\nIn His mercy, the Lord sent Isaiah to warn the covenant people that they were straying from Him. See if you can find the spiritual warning signs of this in\nIsaiah 24:5\n;\n29:13\n;\n30:8–12\n. Why are these attitudes and actions spiritually dangerous?\nTo warn about the consequences of turning away from the Lord, Isaiah used some memorable comparisons. As you study them, ask yourself how turning away from the Lord is like:\nA sad, empty earth (\nIsaiah 24:1–12\n).\nDrunkenness (\nIsaiah 28:7–8\n).\nHunger and thirst (\nIsaiah 29:7–10\n).\nA broken wall or vessel (\nIsaiah 30:13–14\n).\nWhy is it important to you to stay close to the Lord?\nIsaiah 29\n;\n30:18–26\n;\n35\nThe Lord can restore what is lost or broken.\nHave you ever lost something that you thought you would never find again? Or maybe something broke, and you worried that it could never be repaired. When we turn away from the Lord, Satan wants us to think that we can never return or be healed. However, Isaiah described some of the marvelous things the Lord will do to help us return to Him. What do you learn from\nIsaiah 29:13–24\n;\n30:18–26\n;\n35\nabout the Lord, His love, and His power? Perhaps you could find a phrase in these passages that gives you hope when you need healing. You could also look in Sister Amy A. Wright’s message “\nChrist Heals That Which Is Broken\n” (\nLiahona\n, May 2022, 81–84).\nOne way the Lord manifests His power and mercy is through the Restoration of His gospel.\nIsaiah 29\ncontains several passages that have parallels with events of the Restoration. For example:\nCompare\nIsaiah 29:11–12\nwith\n2 Nephi 27:6–26\nand\nJoseph Smith—History 1:63–65\n.\nCompare\nIsaiah 29:13–14\nwith\nDoctrine and Covenants 4\nand\nJoseph Smith—History 1:17–19\n.\nCompare\nIsaiah 29:18–24\nwith the\ntitle page of the Book of Mormon\n.\nIn your opinion, why are “marvellous” and “wonder” (\nIsaiah 29:14\n) good words to describe the Lord restoring His gospel? How can you help fulfill the prophecies about the Restoration? For ideas, look in Elder Gerrit W. Gong’s message “\nAll Nations, Kindreds, and Tongues\n” (\nEnsign\nor\nLiahona\n, Nov. 2020, 38–41).\nSee also “\nThe Restoration of the Fulness of the Gospel of Jesus Christ: A Bicentennial Proclamation to the World\n” (Gospel Library); “\nThe Morning Breaks\n,”\nHymns\n, no 1.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 14:3\n;\n25:8–9\n;\n28:16\nJesus Christ can save me from sin and death.\nHow will you help your children see the Savior in the writings of Isaiah? You might help them find phrases that remind them of Him in\nIsaiah 14:3\n;\n25:8\n; or\n28:16\n. They could also match these verses from Isaiah with other verses that teach about the Savior, such as\nMatthew 11:28–30\n;\n1 Corinthians 15:53–57\n;\nHelaman 5:12\n. What great things has the Lord done for us?\nAfter reading\nIsaiah 25:8–9\ntogether, you could look at pictures of the Savior in Gethsemane, on the cross, and after His Resurrection. Let your children talk about what is happening in the pictures and why they love Jesus and “rejoice in his salvation” (\nverse 9\n).\nYou might choose to tell your children about the sadness you felt when someone you love passed away. Testify of the comfort you receive because of Jesus Christ. Maybe your children could draw a crying face and then erase the tears as you read\nIsaiah 25:8\ntogether.\nThy Will Be Done\n, by Ken Spencer\nIsaiah 25:4–6\nJesus gives me “refuge from the storm.”\nHave you and your children ever experienced the blessing of safe shelter during a storm or shade on a hot summer day? Or have you enjoyed a good meal when you were hungry? Talk about these experiences as you read\nIsaiah 25:4–6\n. How is Jesus like these things?\nIsaiah 29:11–18, 24\nThe Restoration of the gospel is a “marvellous work.”\nAs you and your children read\nIsaiah 29:14\n, share with them other words that mean the same thing as “marvellous” and “wonder.” Let them help you find objects or pictures that represent some of the Lord’s marvelous works during the latter days. These might include a copy of the Book of Mormon, a picture of a temple, or a picture of the First Vision (there’s one at the beginning of this outline). Then your children could choose an item and share why it is marvelous to them.\nA song about the Restoration of the gospel could go well with\nIsaiah 29\n, such as “\nOn a Golden Springtime\n” (\nChildren’s Songbook\n, 88). And perhaps a personal experience could help the children understand what\nrestoration\nmeans. For example, you and your children could talk about something that you lost and how you found it. Help your children compare this to the Restoration of the gospel. According to\nIsaiah 29:13–15\n, why do we need the Restoration? What marvelous works is the Lord doing to restore His gospel? (see this week’s activity page).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 39: Lesson 117: Lesson 117—Isaiah 25This lesson can help students understand the importance of waiting for the Lord.; Lesson 118: Lesson 118—Isaiah 29This lesson can help students feel gratitude for the Restoration of the gospel of Jesus Christ and the Book of Mormon.",
      "content": "\n--- Lesson 117 ---\nHow do you respond when it seems as though your earnest prayers go unanswered? Throughout scripture, the Lord and His prophets have emphasized our need to be waiting for the Lord (see Isaiah 25:9 ), patiently seeking blessings and answers. This lesson can help students understand the importance of waiting for the Lord. Student preparation: Invite students to reflect on a time when they or someone they know had to patiently wait for an answer or blessing from Heavenly Father. They could prepare to share what makes the experience of waiting easy or difficult for them. Possible Learning Activities Developing patience by practice To help students understand how difficult it can be to wait patiently for something, consider displaying a marshmallow or a picture of a child looking at a marshmallow as the following paragraph is read or summarized. Alternatively, you could use the video “ Continue in Patience ,” from ChurchofJesusChrist.org , time code 0:00–1:08, to get students thinking about our need to wait patiently. In the video, President Dieter F. Uchtdorf, then of the First Presidency, introduces the same marshmallow experiment. 2:42 To test children’s ability to patiently wait, researchers placed a large marshmallow in front of several four-year-olds. The children were told that they could eat the marshmallow immediately. However, if they were able to wait 15 minutes, they would be given two marshmallows. Only 30 percent of the children were able to wait. What do you think might have made the difference between the children who could wait and those who could not? When have you had difficulty waiting for something? What made it challenging for you? At times, Heavenly Father may ask us to wait for a desired answer or blessing. Sometimes, He might not provide the desired answer or blessing in the way or at the time we want. What are some examples of blessings or answers from the Lord we may need to patiently wait for? Students may mention waiting for confirmation that the Book of Mormon is true, seeking healing blessings for a sick loved one, or petitioning Heavenly Father for answers to their gospel questions. To help students identify how this lesson applies to their individual needs, provide an opportunity for them to ponder the following self-assessment questions. What blessings or answers from Heavenly Father are you currently waiting to receive? What might He ask you to wait for in the future? What makes waiting for something from Heavenly Father easy or difficult for you? As you study today, seek the help of the Holy Ghost to increase your understanding of the importance of waiting on the will and timing of Heavenly Father and Jesus Christ. You could prayerfully invite Heavenly Father to strengthen your ability to wait patiently. Patiently waiting for the Lord It might be helpful to share with students that the Lord sent the prophet Isaiah to the nation of Judah during a chaotic time of political and social uncertainty. Isaiah 25 reminds the house of Israel of the great blessings they have and will receive from the Lord. Read Isaiah 25:1–4, 6–9 , looking for what the Lord had already done for Israel and what He would do for them in the future. What blessings stand out to you? According to verse 9 , what does the Lord ask us to do to receive His blessings? Help students identify a truth such as if we wait for the Lord, we will be glad and rejoice in His salvation . You could write the phrase “wait for the Lord” on the board. Invite students to imagine a friend asked them to explain what this phrase means. Help students create an explanation for this phrase. If students need additional help understanding what it means to wait for the Lord, you could share the following statement. Elder Robert D. Hales (1932–2017) of the Quorum of the Twelve Apostles taught: In the scriptures, the word wait means to hope, to anticipate, and to trust. To hope and trust in the Lord requires faith, patience, humility, meekness, long-suffering, keeping the commandments, and enduring to the end. (“ Waiting Upon the Lord: Thy Will Be Done ,” Ensign or Liahona , Nov. 2011, 71) Is there anything you would add to help someone understand what it means to wait for the Lord? Why do you think it is important to the Lord that we learn to wait for Him? How does that help us become more like Him? Students could benefit from seeing the example of Jesus Christ waiting for Heavenly Father. You could share other examples from Elder Hales’s message, “ Waiting Upon the Lord: Thy Will Be Done ,” (time code 0:59–2:57). 16:12 Great blessings promised to those who wait on the Lord To help students see other blessings the Lord has promised to those who wait for Him, you could use the following scripture study skill activity. This activity helps students practice linking or cross-referencing verses to help increase their understanding of the principle. Select one or more of the following verses to study: Psalm 27:14 ; Isaiah 40:31 ; Doctrine and Covenants 133:45 . Look for additional blessings the Lord promises to those who wait for Him. What might the blessings of waiting for the Lord look like today? Students might share blessings like peace, joy, or strength while they are waiting for the Lord. As an example of blessings that came after waiting on the Lord, you could show President Uchtdorf’s story in the video “ Continue in Patience ,” from ChurchofJesusChrist.org , time code 1:07–2:41. Invite students to look for what President Uchtdorf, then of the First Presidency, did to act in faith as he waited for the promised blessings of following the Word of Wisdom. 2:42 After you display the following questions, you might share a brief experience you have had while students think about how they would respond. When have you had an experience of waiting for an answer or blessing? What have you done that has helped you wait for the Lord? We are to actively wait for the Lord Providing an opportunity for students to share what they have studied can make it easier for them to recognize their learning and growth. One way to do this would be with the activity below. If useful, invite students to think of additional details to add to the scenario to make it relevant to them. Imagine you were asked to give advice to someone struggling while waiting for a blessing or an answer to their prayers. In your study journal: List something you have learned today that has helped you understand the importance of waiting on the Lord. You might share something you know about the Lord that has helped you. Write down a passage from Isaiah 25 or another scripture that could be helpful for someone actively waiting on the Lord. Write down something you feel would be helpful for someone to do while they are waiting for the Lord’s answers and blessings. You could include an experience when you or someone you know has experienced the Lord’s blessings. Consider concluding class by sharing how you have come to know that you can trust the Lord as you wait for Him.\n\n\n--- Lesson 118 ---\nHow is the gospel of Jesus Christ and the Book of Mormon marvelous to you? Isaiah described the Restoration of the gospel of Jesus Christ, including the coming forth of the Book of Mormon, as “a marvellous work and a wonder” ( Isaiah 29:14 ). This lesson can help students feel gratitude for the Restoration of the gospel of Jesus Christ and the Book of Mormon. Student preparation: Invite students to think of how they might define the words marvelous and wonderful. Using their definition, invite them to find a verse or story in the Book of Mormon that is marvelous or wonderful to them. Possible Learning Activities Apostasy To see the need for the Restoration of the gospel, it is helpful for students to understand the Great Apostasy. To do this, tell students they are going to try and guess an event based on clues. Then display the following phrases one at a time as students try to guess “the Great Apostasy.” As students identify it, invite them to raise their hand but not share the answer yet. Use the following phrases to determine what event is being described: “darkness shall cover the earth” ( Isaiah 60:2 ) “a famine of hearing the words of the Lord” ( Amos 8:11 ) “grievous wolves shall enter in among you” ( Acts 20:29 ) “a falling away” ( 2 Thessalonians 2:3 ) Invite students to share what they understand about the Great Apostasy. If needed, you could share that the Great Apostasy refers to “a widespread falling away from the gospel and Church of Jesus Christ” that occurred after the death of the Savior and His Apostles ( Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ , 37). Alternatively, you could watch “ What Is the Restoration? ,” available at ChurchofJesusChrist.org , from time code 0:32 to 2:09. 5:13 It may be helpful to explain to students that many of Isaiah’s prophecies referred to different time periods and had multiple fulfilments. For example, Isaiah 29 was a prophecy for Isaiah’s own people that Jerusalem would soon be destroyed. However, his prophecy in Isaiah 29 can also refer to the Great Apostasy (see 2 Nephi 27 ). Read Isaiah 29:8–10 , looking for descriptions of the Great Apostasy. How does the passage describe people who have either abandoned or never had access to the Lord’s truth due to the Great Apostasy? We live in a world where many are still spiritually hungry, staggering, or sleeping. We may also make choices that distance us from the Lord. Take a moment to ponder ways you, or those you love, may feel this way. As you study today, seek help from the Holy Ghost to appreciate what Heavenly Father and Jesus Christ have given us to overcome these challenges and turn to Them. A marvelous work and a wonder Read Isaiah 29:4 to identify what Isaiah prophesied the Lord would bless us with to overcome the effects of the Great Apostasy. To help students understand that verse 4 is referring to the Book of Mormon, you could provide students with some of the following scripture references: 2 Nephi 33:13 Mormon 8:23 Last paragraph of “ Testimony of the Prophet Joseph Smith ” found in the introductory pages of the Book of Mormon. Alternatively, you could display all of the references on the board and invite students to use as many of them as they need to identify what the Lord has blessed us with. Students could pick one or more of these references and cross-reference, or link, them to Isaiah 29:4 . This can help them remember what they are learning. You might invite students to read Isaiah 29:11–12 and looking for other phrases that could refer to the coming forth of the Book of Mormon. Students might mark, “the book is delivered to him that is not learned” ( Isaiah 29:12 ). This phrase refers to Joseph Smith, who received very little formal schooling. If students do not know, you could explain that these verses refer to an event in Church history found in Joseph Smith—History 1:62–65 . Isaiah 29:13–14 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Isaiah 29:13–14 , looking for what the Lord said He would do to overcome the effects of the Apostasy. President Russell M. Nelson explained what the marvelous work and wonder is: That marvelous work [and wonder] would include the coming forth of the Book of Mormon and the Restoration of the gospel. (“ Scriptural Witnesses ,” Ensign or Liahona , Nov. 2007, 46) How would you summarize what we can learn from Isaiah 29:13–14 ? Students might share something similar to the following: The Lord restored the gospel of Jesus Christ, including the coming forth of the Book of Mormon, to overcome the effects of the Great Apostasy . Explain that the Restoration of the Gospel is “God’s reestablishment of the truths and ordinances of His gospel among men on earth” (“ Restoration of the Gospel ,” Guide to the Scriptures, Gospel Library). Alternatively, you could watch “ What Is the Restoration? ” from time code 2:09 to 5:13. 5:13 To help students analyze this truth, consider placing them in groups to discuss the following questions. What can this truth teach us about Heavenly Father and Jesus Christ? How can the Restoration of the gospel of Jesus Christ and the Book of Mormon help us overcome the spiritual difficulties caused by the Great Apostasy? The blessings of the marvelous work and wonder The following can help students see how the Restoration and the Book of Mormon can help us overcome the effects of the Great Apostasy. Write the question “ How can the Lord bless me through the Restoration and the Book of Mormon? ” in your journal. Read Isaiah 29:18–19 and write what you find that answers the question. Invite students to continue to add answers and thoughts to their study journal as they continue learning. To help students see how the marvelous work and wonder of the Book of Mormon can bless us, you could share President Russell M. Nelson’s teachings in the following video available at ChurchofJesusChrist.org . “ The Book of Mormon: What Would Your Life Be Like without It? ” from time code 5:38 to 8:44. 15:1 The following activity can help students reflect on how the Book of Mormon or the Restoration is marvelous to them. Ensure that students have enough time to successfully complete the activity. You may want to display the instructions for the activity on the board. Complete one of the following activities: Activity 1 Identify a verse or story from the Book of Mormon that brings you closer to Heavenly Father and Jesus Christ. If helpful, you could look at Book of Mormon doctrinal mastery passages. Explain why it is marvelous to you. Activity 2 Identify a doctrine, ordinance, blessing, or other aspect of the Restoration of the gospel of Jesus Christ (modern-day prophets, temples, the priesthood, and so on) that helps you draw closer to Heavenly Father and Jesus Christ. Explain why it is marvelous to you. After enough time, invite students to get into small groups and share their explanations. Consider concluding class by inviting students to ponder why they are grateful to Heavenly Father and Jesus Christ for the Restoration and the Book of Mormon. Consider sharing your feelings about why you are grateful for the Restoration or the Book of Mormon. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Isaiah 29:13–14 is “The Restoration of the gospel is ‘a marvellous work and a wonder.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 13",
      "content": "1. TheburdenofBabylon, which Isaiah the son of Amoz did see.\n2. Lift ye up abannerupon the highmountain,exaltthe voice unto them, shake the hand, that they may go into the gates of the nobles.\n3. I have commanded mysanctified ones, I have also called mymightyones for mine anger,eventhem that rejoice in my highness.\n4. The noise of multitude in the mountains, like as of great people; tumultuous noise of thekingdomsof nations gathered together: theLordof hosts mustereth the host of thebattle.\n5. They come from far country, from the end of heaven,eventheLord, and the weapons of his indignation, todestroythe whole land.\n6. Howlye; for thedayof theLordisat hand; it shall come as destruction from the Almighty.\n7. Therefore shall all hands be faint, and every mans heart shallmelt:\n8. And they shall be afraid: pangs and sorrows shall take hold of them; they shall be inpainas woman thattravaileth: they shall be amazed one at another; their facesshall be asflames.\n9. Behold, the day of theLordcometh, cruel both with wrath and fierce anger, to lay the land desolate: and he shalldestroythe sinners thereof out of it.\n10. For the stars of heaven and the constellations thereof shall not give their light: the sun shall bedarkenedin his going forth, and the moon shall not cause her light to shine.\n11. And I willpunishtheworldfortheirevil, and the wicked for their iniquity; and I will cause the arrogancy of the proud to cease, and will lay low thehaughtinessof theterrible.\n12. I will make man morepreciousthan fine gold; even man than thegoldenwedge of Ophir.\n13. Therefore I willshakethe heavens, and theearthshallremoveout of her place, in the wrath of theLordof hosts, and in the day of his fierceanger.\n14. And it shall be as thechased roe, and as sheep thatno man taketh up: they shall every man turn to his ownpeople, and flee every one into his ownland.\n15. Every one that is found shall bethrustthrough; and every one that is joinedunto themshall fall by the sword.\n16. Theirchildrenalso shall be dashed to pieces before their eyes; theirhousesshall bespoiled, and their wives ravished.\n17. Behold, I will stir up theMedesagainst them, which shall not regard silver; andas forgold, they shall not delight in it.\n18. Theirbows also shall dash the young men to pieces; and they shall have no pity on the fruit of the womb; their eye shall not spare children.\n19. AndBabylon, the glory of kingdoms, thebeautyof theChaldeesexcellency, shall be as when GodoverthrewSodomand Gomorrah.\n20. It shall never beinhabited, neither shall it be dwelt in from generation to generation: neither shall the Arabian pitch tent there; neither shall the shepherds make their fold there.\n21. Butwildbeasts of the desert shall lie there; and their houses shall be full of doleful creatures; and owls shall dwell there, andsatyrsshall dance there.\n22. And the wild beasts of the islands shall cry in their desolatehouses, anddragonsintheirpleasant palaces: and her timeisnear to come, and her days shall not be prolonged.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 14",
      "content": "1. FortheLordwill havemercyon Jacob, and will yetchooseIsrael, and set them in their ownland: and thestrangersshall be joined with them, and they shall cleave to the house of Jacob.\n2. And thepeople shall take them, andbringthem to their place: and the house of Israel shall possess them in the land of theLordfor servants and handmaids: and they shall take themcaptives, whose captives they were; and they shallruleover their oppressors.\n3. And it shall come to pass in the day that theLordshall give thee rest from thy sorrow, and from thy fear, and from the hard bondage wherein thou wast made to serve,\n4. That thou shalt take up thisproverbagainst the king ofBabylon, and say, How hath the oppressor ceased! thegoldencity ceased!\n5. TheLordhath broken thestaffof thewicked,andthe sceptre of the rulers.\n6. He who smote the people in wrath witha continual stroke, he that ruled the nations in anger, is persecuted,andnone hindereth.\n7. The whole earth is atrest,andis quiet: they break forth into singing.\n8. Yea, thefir treesrejoice at thee,andthe cedars of Lebanon,saying,Since thou artlaid down,nofeller is come up against us.\n9. Hellfrom beneath is moved for thee to meettheeat thy coming: it stirreth up thedeadfor thee,evenall the chief ones of the earth; it hath raised up from their thrones all the kings of the nations.\n10. All they shall speak and say unto thee, Art thou also become weak as we? art thou become like unto us?\n11. Thy pomp is brought down tothe grave,andthe noise of thyviols: the worm is spread under thee, and the worms cover thee.\n12. How art thoufallenfromheaven, OLucifer, son of the morning!howart thou cut down to the ground, which didst weaken thenations!\n13. For thou hast said in thineheart,Iwill ascend into heaven, I willexaltmythroneabove the stars of God: I will sit also upon the mount of the congregation, in the sides of thenorth:\n14. I will ascend above the heights of the clouds; I will be like themostHigh.\n15. Yet thou shalt be brought down tohell, to the sides of the pit.\n16. They that seetheeshallnarrowly look upon thee,andconsider thee,saying, Isthis the man that made the earth to tremble, that did shake kingdoms;\n17. Thatmade the world as wilderness, and destroyed the cities thereof;thatopened not the house of his prisoners?\n18. All the kings of the nations,evenall of them, lie inglory, every one inhis own house.\n19. But thou art cast out of thy grave likean abominable branch,and asthe raiment of those that are slain, thrust through with sword, that go down tothe stonesof the pit; as carcase trodden under feet.\n20. Thou shalt not bejoinedwith them in burial, because thou hast destroyed thy land,andslain thy people: theseedofevildoersshall never be renowned.\n21. Prepareslaughter for his children for the iniquity of their fathers; that they do not rise, nor possess the land, nor fill the face of the world with cities.\n22. For I will rise up against them, saith theLordof hosts, andcut offfrom Babylon the name, and remnant, and son, and nephew, saith theLord.\n23. I will also make it possession for thebittern, and pools of water: and I will sweep it with thebesomof destruction, saith theLordof hosts.\n24. TheLordof hosts hath sworn, saying, Surely as I have thought, so shall it come to pass; and as I have purposed,soshall it stand:\n25. ThatIwill break the Assyrian in my land, and uponmy mountainstread him under foot: then shall hisyokedepart from off them, and his burden depart from off their shoulders.\n26. Thisisthe purpose that is purposed upon the wholeearth: and thisisthe hand that is stretched out uponall the nations.\n27. For theLordof hosts hathpurposed, and who shall disannulit?and his handisstretched out, and who shall turn it back?\n28. In theyearthat kingAhazdied was thisburden.\n29. Rejoice not thou, wholePalestina, because the rod of him that smote thee is broken: for out of the serpents root shall come forth cockatrice, and his fruitshall bea fiery flying serpent.\n30. And the firstborn of the poor shall feed, and the needy shall lie down in safety: and I will kill thy root with famine, and he shall slay thy remnant.\n31. Howl, O gate; cry, O city; thou, wholePalestina,artdissolved: for there shall come from the north smoke, and noneshall bealone in his appointed times.\n32. What shallonethen answer the messengers of thenation? That theLordhath foundedZion, and thepoorof his people shalltrust in it.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Isaiah": {
      "13": {
        "verses": {
          "1": {
            "text": "TheburdenofBabylon, which Isaiah the son of Amoz did see.",
            "citation": "(Isaiah 13:1)"
          },
          "2": {
            "text": "Lift ye up abannerupon the highmountain,exaltthe voice unto them, shake the hand, that they may go into the gates of the nobles.",
            "citation": "(Isaiah 13:2)"
          },
          "3": {
            "text": "I have commanded mysanctified ones, I have also called mymightyones for mine anger,eventhem that rejoice in my highness.",
            "citation": "(Isaiah 13:3)"
          },
          "4": {
            "text": "The noise of multitude in the mountains, like as of great people; tumultuous noise of thekingdomsof nations gathered together: theLordof hosts mustereth the host of thebattle.",
            "citation": "(Isaiah 13:4)"
          },
          "5": {
            "text": "They come from far country, from the end of heaven,eventheLord, and the weapons of his indignation, todestroythe whole land.",
            "citation": "(Isaiah 13:5)"
          },
          "6": {
            "text": "Howlye; for thedayof theLordisat hand; it shall come as destruction from the Almighty.",
            "citation": "(Isaiah 13:6)"
          },
          "7": {
            "text": "Therefore shall all hands be faint, and every mans heart shallmelt:",
            "citation": "(Isaiah 13:7)"
          },
          "8": {
            "text": "And they shall be afraid: pangs and sorrows shall take hold of them; they shall be inpainas woman thattravaileth: they shall be amazed one at another; their facesshall be asflames.",
            "citation": "(Isaiah 13:8)"
          },
          "9": {
            "text": "Behold, the day of theLordcometh, cruel both with wrath and fierce anger, to lay the land desolate: and he shalldestroythe sinners thereof out of it.",
            "citation": "(Isaiah 13:9)"
          },
          "10": {
            "text": "For the stars of heaven and the constellations thereof shall not give their light: the sun shall bedarkenedin his going forth, and the moon shall not cause her light to shine.",
            "citation": "(Isaiah 13:10)"
          },
          "11": {
            "text": "And I willpunishtheworldfortheirevil, and the wicked for their iniquity; and I will cause the arrogancy of the proud to cease, and will lay low thehaughtinessof theterrible.",
            "citation": "(Isaiah 13:11)"
          },
          "12": {
            "text": "I will make man morepreciousthan fine gold; even man than thegoldenwedge of Ophir.",
            "citation": "(Isaiah 13:12)"
          },
          "13": {
            "text": "Therefore I willshakethe heavens, and theearthshallremoveout of her place, in the wrath of theLordof hosts, and in the day of his fierceanger.",
            "citation": "(Isaiah 13:13)"
          },
          "14": {
            "text": "And it shall be as thechased roe, and as sheep thatno man taketh up: they shall every man turn to his ownpeople, and flee every one into his ownland.",
            "citation": "(Isaiah 13:14)"
          },
          "15": {
            "text": "Every one that is found shall bethrustthrough; and every one that is joinedunto themshall fall by the sword.",
            "citation": "(Isaiah 13:15)"
          },
          "16": {
            "text": "Theirchildrenalso shall be dashed to pieces before their eyes; theirhousesshall bespoiled, and their wives ravished.",
            "citation": "(Isaiah 13:16)"
          },
          "17": {
            "text": "Behold, I will stir up theMedesagainst them, which shall not regard silver; andas forgold, they shall not delight in it.",
            "citation": "(Isaiah 13:17)"
          },
          "18": {
            "text": "Theirbows also shall dash the young men to pieces; and they shall have no pity on the fruit of the womb; their eye shall not spare children.",
            "citation": "(Isaiah 13:18)"
          },
          "19": {
            "text": "AndBabylon, the glory of kingdoms, thebeautyof theChaldeesexcellency, shall be as when GodoverthrewSodomand Gomorrah.",
            "citation": "(Isaiah 13:19)"
          },
          "20": {
            "text": "It shall never beinhabited, neither shall it be dwelt in from generation to generation: neither shall the Arabian pitch tent there; neither shall the shepherds make their fold there.",
            "citation": "(Isaiah 13:20)"
          },
          "21": {
            "text": "Butwildbeasts of the desert shall lie there; and their houses shall be full of doleful creatures; and owls shall dwell there, andsatyrsshall dance there.",
            "citation": "(Isaiah 13:21)"
          },
          "22": {
            "text": "And the wild beasts of the islands shall cry in their desolatehouses, anddragonsintheirpleasant palaces: and her timeisnear to come, and her days shall not be prolonged.",
            "citation": "(Isaiah 13:22)"
          }
        }
      },
      "14": {
        "verses": {
          "1": {
            "text": "FortheLordwill havemercyon Jacob, and will yetchooseIsrael, and set them in their ownland: and thestrangersshall be joined with them, and they shall cleave to the house of Jacob.",
            "citation": "(Isaiah 14:1)"
          },
          "2": {
            "text": "And thepeople shall take them, andbringthem to their place: and the house of Israel shall possess them in the land of theLordfor servants and handmaids: and they shall take themcaptives, whose captives they were; and they shallruleover their oppressors.",
            "citation": "(Isaiah 14:2)"
          },
          "3": {
            "text": "And it shall come to pass in the day that theLordshall give thee rest from thy sorrow, and from thy fear, and from the hard bondage wherein thou wast made to serve,",
            "citation": "(Isaiah 14:3)"
          },
          "4": {
            "text": "That thou shalt take up thisproverbagainst the king ofBabylon, and say, How hath the oppressor ceased! thegoldencity ceased!",
            "citation": "(Isaiah 14:4)"
          },
          "5": {
            "text": "TheLordhath broken thestaffof thewicked,andthe sceptre of the rulers.",
            "citation": "(Isaiah 14:5)"
          },
          "6": {
            "text": "He who smote the people in wrath witha continual stroke, he that ruled the nations in anger, is persecuted,andnone hindereth.",
            "citation": "(Isaiah 14:6)"
          },
          "7": {
            "text": "The whole earth is atrest,andis quiet: they break forth into singing.",
            "citation": "(Isaiah 14:7)"
          },
          "8": {
            "text": "Yea, thefir treesrejoice at thee,andthe cedars of Lebanon,saying,Since thou artlaid down,nofeller is come up against us.",
            "citation": "(Isaiah 14:8)"
          },
          "9": {
            "text": "Hellfrom beneath is moved for thee to meettheeat thy coming: it stirreth up thedeadfor thee,evenall the chief ones of the earth; it hath raised up from their thrones all the kings of the nations.",
            "citation": "(Isaiah 14:9)"
          },
          "10": {
            "text": "All they shall speak and say unto thee, Art thou also become weak as we? art thou become like unto us?",
            "citation": "(Isaiah 14:10)"
          },
          "11": {
            "text": "Thy pomp is brought down tothe grave,andthe noise of thyviols: the worm is spread under thee, and the worms cover thee.",
            "citation": "(Isaiah 14:11)"
          },
          "12": {
            "text": "How art thoufallenfromheaven, OLucifer, son of the morning!howart thou cut down to the ground, which didst weaken thenations!",
            "citation": "(Isaiah 14:12)"
          },
          "13": {
            "text": "For thou hast said in thineheart,Iwill ascend into heaven, I willexaltmythroneabove the stars of God: I will sit also upon the mount of the congregation, in the sides of thenorth:",
            "citation": "(Isaiah 14:13)"
          },
          "14": {
            "text": "I will ascend above the heights of the clouds; I will be like themostHigh.",
            "citation": "(Isaiah 14:14)"
          },
          "15": {
            "text": "Yet thou shalt be brought down tohell, to the sides of the pit.",
            "citation": "(Isaiah 14:15)"
          },
          "16": {
            "text": "They that seetheeshallnarrowly look upon thee,andconsider thee,saying, Isthis the man that made the earth to tremble, that did shake kingdoms;",
            "citation": "(Isaiah 14:16)"
          },
          "17": {
            "text": "Thatmade the world as wilderness, and destroyed the cities thereof;thatopened not the house of his prisoners?",
            "citation": "(Isaiah 14:17)"
          },
          "18": {
            "text": "All the kings of the nations,evenall of them, lie inglory, every one inhis own house.",
            "citation": "(Isaiah 14:18)"
          },
          "19": {
            "text": "But thou art cast out of thy grave likean abominable branch,and asthe raiment of those that are slain, thrust through with sword, that go down tothe stonesof the pit; as carcase trodden under feet.",
            "citation": "(Isaiah 14:19)"
          },
          "20": {
            "text": "Thou shalt not bejoinedwith them in burial, because thou hast destroyed thy land,andslain thy people: theseedofevildoersshall never be renowned.",
            "citation": "(Isaiah 14:20)"
          },
          "21": {
            "text": "Prepareslaughter for his children for the iniquity of their fathers; that they do not rise, nor possess the land, nor fill the face of the world with cities.",
            "citation": "(Isaiah 14:21)"
          },
          "22": {
            "text": "For I will rise up against them, saith theLordof hosts, andcut offfrom Babylon the name, and remnant, and son, and nephew, saith theLord.",
            "citation": "(Isaiah 14:22)"
          },
          "23": {
            "text": "I will also make it possession for thebittern, and pools of water: and I will sweep it with thebesomof destruction, saith theLordof hosts.",
            "citation": "(Isaiah 14:23)"
          },
          "24": {
            "text": "TheLordof hosts hath sworn, saying, Surely as I have thought, so shall it come to pass; and as I have purposed,soshall it stand:",
            "citation": "(Isaiah 14:24)"
          },
          "25": {
            "text": "ThatIwill break the Assyrian in my land, and uponmy mountainstread him under foot: then shall hisyokedepart from off them, and his burden depart from off their shoulders.",
            "citation": "(Isaiah 14:25)"
          },
          "26": {
            "text": "Thisisthe purpose that is purposed upon the wholeearth: and thisisthe hand that is stretched out uponall the nations.",
            "citation": "(Isaiah 14:26)"
          },
          "27": {
            "text": "For theLordof hosts hathpurposed, and who shall disannulit?and his handisstretched out, and who shall turn it back?",
            "citation": "(Isaiah 14:27)"
          },
          "28": {
            "text": "In theyearthat kingAhazdied was thisburden.",
            "citation": "(Isaiah 14:28)"
          },
          "29": {
            "text": "Rejoice not thou, wholePalestina, because the rod of him that smote thee is broken: for out of the serpents root shall come forth cockatrice, and his fruitshall bea fiery flying serpent.",
            "citation": "(Isaiah 14:29)"
          },
          "30": {
            "text": "And the firstborn of the poor shall feed, and the needy shall lie down in safety: and I will kill thy root with famine, and he shall slay thy remnant.",
            "citation": "(Isaiah 14:30)"
          },
          "31": {
            "text": "Howl, O gate; cry, O city; thou, wholePalestina,artdissolved: for there shall come from the north smoke, and noneshall bealone in his appointed times.",
            "citation": "(Isaiah 14:31)"
          },
          "32": {
            "text": "What shallonethen answer the messengers of thenation? That theLordhath foundedZion, and thepoorof his people shalltrust in it.",
            "citation": "(Isaiah 14:32)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 30153,
  "total_sources": 4,
  "generated_at": "2025-12-14T04:01:27.393746"
}