{
  "week_number": 34,
  "date_range": "Psalms 1–2",
  "title": ";8;19–33;40;46",
  "primary_scriptures": [
    {
      "book": "Psalms",
      "chapters": [
        "1",
        "2"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Psalms",
      "chapters": [
        "1",
        "2"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;8;19–33;40;46 ---\nWe don’t know for certain who wrote the Psalms. Some are attributed to King David, but for most of them, the writers remain anonymous. Yet after reading the Psalms, we feel as if we know the hearts of the psalmists, even if we don’t know their names. We do know that the Psalms were an important part of worship among the Israelites, and we know that the Savior quoted them often. In the Psalms, we get a window into the soul of God’s ancient people. We see how they felt about God, what they worried about, and how they found peace. As believers today, all over the world, we still use these words in our worship of God. It’s almost like the writers of the Psalms had a window into\nour\nsouls, because they expressed how we feel about God, what we worry about, and how we find peace.\nFor an overview of the book of Psalms, see “\nPsalms\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nPsalms 1\n;\n23\n;\n26–28\n;\n46\n“I have trusted … in the Lord.”\nAs you read the Psalms, you might notice how often the writers express fear, sorrow, or anxiety. Such feelings are normal, even for people of faith. But what makes the Psalms inspiring is that they also offer inspiring solutions, including complete trust in the Lord. As you read\nPsalms 1\n;\n23\n;\n26–28\n;\n46\n, write down:\nInvitations to trust the Lord.\nWords that describe Him.\nWords that describe the peace, strength, and other blessings He provides.\nWords that describe people who trust Him.\nAlso watch for the vivid imagery and symbols that the Psalms use to teach about the Savior. For example, in\nPsalm 23\n, what do phrases like “lie down in green pastures” or “still waters” (\nverse 2\n) bring to mind? What could the comforting “rod” and “staff” (\nverse 4\n) symbolize? What might it mean for our “cup” (\nverse 5\n) to run over?\nPsalms 2\n;\n22\nJesus Christ is the promised Messiah.\nSeveral of the psalms point to the mortal life of Jesus Christ. Christians in New Testament times saw these connections too. Consider reading the following scripture references. Look for connections between the words in these psalms and the life of the Savior:\nPsalm 2:1–3\nand\nActs 4:24–28\nPsalm 2:7\nand\nActs 13:30–33\nPsalm 22:1\nand\nMatthew 27:45–46\nPsalm 22:7–8\nand\nMatthew 27:39–43\nPsalm 22:16\nand\nLuke 23:32–33\nPsalm 22:18\nand\nMatthew 27:35\nPsalm 31:5\nand\nLuke 23:46\nWhat do you learn from studying these connections? What scriptural prophecies and promises haven’t been fulfilled yet? What do you find in these promises that gives you hope for the future?\nPsalms 8\n;\n19\n;\n33\n“The earth is full of the goodness of the Lord.”\nReading\nPsalms 8\n;\n19\n;\n33\nmight inspire you to consider the Lord’s many wonderful creations. Pay attention to your feelings as you do. You might also want to sing or ponder the words of a song related to these psalms, such as “\nHow Great Thou Art\n” (\nHymns\n, 86). How do the Lord’s creations “declare the glory of God” to you? (\nPsalm 19:1\n).\nHere are some other hymns inspired by the Psalms:\nPsalm 23\n:\n“\nThe Lord Is My Shepherd\n” (\nHymns\n, no. 108)\nPsalms 23:6\n;\n150\n:\n“\nPraise to the Lord, the Almighty\n” (\nHymns\n, no. 72)\nPsalm 26:8\n:\n“\nWe Love Thy House, O God\n” (\nHymns\n, no. 247)\nPsalm 27:1\n:\n“\nThe Lord Is My Light\n” (\nHymns\n, no. 89)\nPsalms 33:1–6\n;\n95:1–6\n:\n“\nFor the Beauty of the Earth\n” (\nHymns\n, no. 92)\nPsalm 37:3–9\n:\n“\nBe Still, My Soul\n” (\nHymns\n, no. 124)\nPsalm 148\n:\n“\nAll Creatures of Our God and King\n” (\nHymns\n, no. 62)\nUse music.\nPresident Dallin H. Oaks said: “The singing of hymns is one of the best ways to put ourselves in tune with the Spirit of the Lord. … Sacred music has a unique capacity to communicate our feelings of love for the Lord. This kind of communication is a wonderful aid to our worship. … Our hymns contain matchless doctrinal sermons, surpassed only by the scriptures in their truth and poetic impact” (“\nWorship through Music\n,”\nEnsign\n, Nov. 1994, 10, 11). What hymns related to the Psalms could you listen to or sing to enhance your worship this week?\nPsalms 19:7–11\n;\n29\nThe word of the Lord is powerful, “rejoicing the heart.”\nIn the Psalms, words like\ntestimony\n,\nstatutes\n,\ncommandment\n, and\njudgments\ncan refer to the word of the Lord. Keep that in mind as you read\nPsalm 19:7–11\n. What do these verses suggest to you about the word of the Lord? What does\nPsalm 29\nteach you about His voice? In your experience, how has the word or voice of the Lord matched these descriptions?\nPsalms 24\n;\n26–27\nThe Savior can help me be pure so I can enter God’s presence.\nBecause the temple at Jerusalem was built on a hill, the phrase “hill of the Lord” (\nPsalm 24:3\n) could refer to the temple or to the presence of God. What does this add to your understanding of\nPsalm 24\n? What does it mean to you to have “clean hands, and a pure heart”? (\nverse 4\n). As you read\nPsalms 26–27\n, what else do you learn about the house of the Lord?\nAt times, we might be discouraged to hear that we need to be pure to enter the presence of God. After all, we all struggle, and none of us are perfect. What hope do you find in Elder David A. Bednar’s message “\nClean Hands and a Pure Heart\n”? (\nEnsign\nor\nLiahona\n, Nov. 2007, 80–83). How could you use his message to help someone who feels overwhelmed with wanting to be perfect? Consider how you can receive the Savior’s help in your efforts to have “clean hands, and a pure heart.”\nSee also Bradley R. Wilcox, “\nWorthiness Is Not Flawlessness\n,”\nLiahona\n, Nov. 2021, 61–67.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nPsalms 23\n;\n27–28\n;\n32\n;\n46\nThe Lord offers me peace, strength, and guidance.\nConsider writing\nThe Lord is …\nInvite your children to look for ways to complete that sentence using scriptures like these:\nPsalms 23:1\n;\n27:1\n;\n28:1\n;\n28:7\n;\n32:7\n;\n46:1\n. What do these verses teach us about how the Lord can help us?\nYou could discuss with your children what a lamb needs to be safe and healthy. Then, as you read together\nPsalm 23\n, help your children compare what a shepherd does for a lamb with what Jesus does for us. What do we need to be spiritually safe and healthy? Sing together a song that could give them ideas, such as “\nI Feel My Savior’s Love\n” (\nChildren’s Songbook\n, 74–75).\nConcepción Chile Temple\nPsalm 24:3–4\nTo enter the temple, we need “clean hands, and a pure heart.”\nAs you read\nPsalm 24:3\ntogether, your children could look for words that remind them of the temple. They could also look at a picture of a temple. Then you could read together\nverse 4\nto learn who can enter the temple. You could talk about how hands get dirty and how we clean them. How do we get spiritually dirty? How does the Savior help clean us spiritually?\nPsalm 30:5\nJesus Christ can turn sadness into joy.\nIf you have young children, you could invite them to pretend to cry while you read from\nPsalm 30:5\n, “Weeping may endure for a night.” Then ask them to express joy as you read, “But joy cometh in the morning.” Repeat this phrase a few times.\nShow a picture of the Savior, and tell your children what He has done for you that brings you joy. You could also give each child a turn to hold the picture and share what Jesus has done that brings them joy.\nPsalm 46:10\n“Be still, and know that I am God.”\nHelp your children memorize the first line from\nPsalm 46:10\n: “Be still, and know that I am God.” What could it mean to “be still”? Maybe you could spend some time practicing being still. You could also share with each other experiences when being “still” strengthened your relationship with God. Help your children think of times during the day when they can “be still” to feel close to Heavenly Father.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 34: Lesson 100: Lesson 100—Introduction to Psalms, Part 1This lesson can help students better understand Jesus Christ’s life and mission as prophesied in Psalms.; Lesson 101: Lesson 101—Introduction to Psalms, Part 2This lesson can provide an opportunity for students to express their feelings of worship for Heavenly Father and Jesus Christ.... ---\n\n--- Lesson 100 ---\nWhat do your favorite hymns teach you about Jesus Christ? Hymns have allowed musicians and poets to express their feelings about the Savior for centuries. Like many modern hymns, several of the psalms teach and testify of the Savior’s life and mission. This lesson can help students better understand Jesus Christ’s life and mission as prophesied in Psalms. Student preparation: Invite students to ponder how their favorite hymns teach and testify of Jesus Christ. Invite them to prepare to share a favorite hymn about Jesus Christ in class. If students feel they do not have a favorite hymn, invite them to look through the hymn book for songs that teach about Jesus Christ. Possible Learning Activities Hymns that teach of Jesus Christ Using sacred music in class can create a feeling of reverence, invite the Holy Ghost, and increase feelings of unity. Music can also be used to connect the message of hymns to the truths students are learning. You might use sacred music to begin this lesson. One way is to invite students to search Hymns (1985) or Hymns—for Home and Church (2026) . Invite students to select a hymn under the topic “ Jesus Christ .” Give students a moment to read and reflect on the lyrics of that hymn. You might point out the authors’ names and scripture references underneath the music and lyrics. Display the following questions and invite students to share their answers with a partner. (For additional training on using sacred music in class, see “ Create settings and opportunities for learners to be taught by the Holy Ghost ” in Teacher Development Skills .) What can we learn about the Savior and His life from the words of this hymn? Is there another hymn about the Savior that has special meaning to you? If so, why? As you study today, invite the Holy Ghost to help you feel the power of words and music that teach and testify of Jesus Christ. The book of Psalms The book of Psalms is a collection of prayers, poems, and hymns that is similar in some ways to our modern hymnbook. Invite students to turn to the book of Psalms . Give students two to three minutes to scan through some of the psalms, looking for an overall impression. As you scan through the book, what do you notice about Psalms that makes it unique? What questions do you have about this book? Quickly look through Psalm 3 , marking each time you find the word Selah . While the meaning of Selah is not certain, it may have been a signal to the singer or reader to pause and reflect (like a musical rest). Read Psalm 3 , pausing each time you read the word Selah . Invite the Holy Ghost to help you ponder these verses. Why might the author have wanted us to pause and reflect in these places? How might pondering in one or more of these places help or comfort a teenager today? Depending on your class’s questions and experience, you could briefly point out some or all of the following: Many of the psalms are attributed to specific authors like David ( Psalm 3 ). Other psalms have no known author (see Psalm 1 ). Hebrew poetic elements are found throughout Psalms. Parallelism is poetry where two or more lines share connected ideas (see Psalm 29:4 ). Repetition is a Hebrew poetic tool that emphasizes a line by repeating it (such as “Praise him” in Psalm 150 ). In the Hebrew language, Psalm 119 is an example of an acrostic poem. Acrostic poems use the first letter of each line to spell out words or the Hebrew alphabet.. The book of Psalms is quoted in the New Testament over 115 times (see Psalms 6:8 and Luke 13:27 ). After the Last Supper, Jesus and His disciples sang a hymn (see Matthew 26:30 ). This was possibly Psalms 113–118 , the “Hallel,” the hymn traditionally sung at Passover (see Merrill J. Bateman, “ The Power of Hymns ,” Ensign , July 2001, 17). Read Luke 24:44 , looking for what the Savior taught His disciples about the psalms shortly after His Resurrection. In speaking of one of the most important messages found in the book of Psalms, President Jeffrey R. Holland of the Quorum of the Twelve Apostles taught: Jesus Himself quoted the book of Psalms more than any other Old Testament text. … It could be argued that in all of holy writ, no book of scripture goes on so extensively about the Messianic mission or the looking and longing for His return that is expressed in the songs of the Psalmist. ( For Times of Trouble: Spiritual Solace from the Psalms [2012], 7–8) What did you learn from Luke 24:44 and from President Holland? Why is it worth studying the book of Psalms? Help students recognize that we can learn about the life and mission of Jesus Christ by studying the psalms . Consider writing this truth on the board. Psalms that prophesy of Jesus Christ To help students understand some of the prophetic statements in Psalms about Jesus Christ’s life and mission, provide some or all of the scripture references below. The following are a few ways you might have your class study these verses: Write the verse pairs on strips of paper and place each paper around the room. Give students time to walk around the room and read several of the prophecies and fulfillments. Mix up the scripture pairs and invite students to match the prophecies in Psalms with their fulfillments. Display only the Psalms verses. Invite students to use the footnotes and other scripture study tools to find references from the Savior’s life that fulfill each prophecy. Psalms that prophesy of Jesus Christ Prophesy fulfilled Psalms that prophesy of Jesus Christ Psalm 22:1 Prophesy fulfilled Matthew 27:46 Psalms that prophesy of Jesus Christ Psalm 22:7–8 Prophesy fulfilled Matthew 27:41–43 Psalms that prophesy of Jesus Christ Psalm 22:16 Prophesy fulfilled Doctrine and Covenants 6:36–37 Psalms that prophesy of Jesus Christ Psalm 22:18 Prophesy fulfilled John 19:23–24 Psalms that prophesy of Jesus Christ Psalm 31:5 Prophesy fulfilled Luke 23:46 Psalms that prophesy of Jesus Christ Psalm 34:20 Prophesy fulfilled John 19:31–36 Psalms that prophesy of Jesus Christ Psalm 41:9 Prophesy fulfilled Luke 22:47–48 ; Acts 1:16–17 Psalms that prophesy of Jesus Christ Psalm 69:20–21 Prophesy fulfilled John 19:28–29 Psalms that prophesy of Jesus Christ Psalm 118:22 Prophesy fulfilled Acts 4:10–12 Think of a situation that you or a loved one faces where it is helpful to know something you learned about the Savior’s life or mission from these prophecies. Record your thoughts in your study journal. To help students visualize the fulfilment of some of the prophecies, you could show a video depicting moments from the Savior’s life. For example, you could use “ My Kingdom Is Not of This World ,” time code 0:00 to 3:18, from ChurchofJesusChrist.org . This video illustrates prophecies in Psalm 22:1, 7–8, 16 . 5:25 As students watch the video, invite them to raise their hands when they recognize an event prophesied in Psalms. Consider pausing the video and inviting students to share what they would want someone to understand about this moment in the Savior’s life. The life of Jesus Christ Invite students to demonstrate their understanding of the Savior’s life and mission as prophesied in Psalms. One option is to invite students to discuss the following questions with a partner, small group, or the class. Select one of the prophecies from Psalms that you found particularly meaningful. What does this prophecy teach you about Jesus Christ? Why is what you learned about Him important to know? Consider sharing your witness of the life and mission of Jesus Christ. You could invite students to continue to look for references to Jesus Christ as they study the book of Psalms throughout the next few weeks. It might be appropriate to conclude class by singing or listening to a hymn about the Savior, as chosen by the students. In Lesson 101: “ Introduction to the Psalms, Part 2 ,” students will create an expression of their love and devotion to Heavenly Father and Jesus Christ as the Psalmists did. Consider inviting students to start thinking about this now. Ask them to ponder how they feel about Heavenly Father and Jesus Christ and how they would express those feelings.\n\n\n--- Lesson 101 ---\nOne way to worship Heavenly Father and Jesus Christ is to express your love and devotion to Them. Many of the Psalms are poetic examples of worshipping the Father and Son in praises, pleadings, and prayers. This lesson can help students express their feelings of worship for Heavenly Father and Jesus Christ. Student preparation: Let students know they will have an opportunity to reflect on their thoughts and feelings about Heavenly Father, Jesus Christ, and sacred things in preparation to share those feelings in this lesson. Encourage students to listen to reverent music and review favorite scriptures, quotes, or sacred images, looking for specific things they might want to share. Doing this can prepare their hearts and minds for the activity in this lesson. Possible Learning Activities Worshipping God Note: The activity at the end of this lesson will be part of the reflection in Lesson 112: “ Assess Your Learning 7 .” Be sure to allow plenty of time for students to begin working on the activity during class. To begin class, give students a minute to ponder the following question: What does “worshipping God” mean to you? Elder Dean M. Davies, then serving in the Presiding Bishopric, shared some ways we can worship God when he taught: When we worship God, we approach Him with reverent love, humility, and adoration. We acknowledge and accept Him as our sovereign King, the Creator of the universe, our beloved and infinitely loving Father. We respect and revere Him. We submit ourselves to Him. We lift our hearts in mighty prayer, cherish His word, rejoice in His grace, and commit to follow Him with dedicated loyalty. (“ The Blessings of Worship ,” Ensign or Liahona , Nov. 2016, 94) How would you describe the difference between simply attending church, the temple, or seminary compared to worshipping God as you attend? Briefly share with students one or two of your favorite ways that people have expressed their feelings of worship for Heavenly Father and Jesus Christ. Examples include a poem, video, work of art, piece of writing, or piece of sacred music. You could include things that you wrote or created yourself. Explain to students that there are many ways someone can express feelings of worship for Heavenly Father and Jesus Christ. Encourage students to reflect on how they might express their feelings of worship for Heavenly Father and Jesus Christ. Throughout the lesson, be mindful of and sensitive to students who might not feel a connection to Heavenly Father and Jesus Christ right now. In your study journal, select one or more of the following questions to answer. You could use some of Elder Davies’s message or your own words to summarize your feelings. How do you feel about Heavenly Father, Jesus Christ, and sacred things? How do you best express love, respect, or reverence for Heavenly Father, Jesus Christ, or spiritual blessings? At the end of the lesson today, you will begin creating an expression of your feelings. Keep this in mind as you study. Think about how you might want to express what you learn and feel. Invite the Holy Ghost to assist you in your efforts. Worshipping the Lord in the psalms Many psalms are the poetic, prayerful expressions of the sacred thoughts, feelings, hopes, and desires of the writers. While many scriptures record the Lord’s words to us, the psalms frequently reflect the writers’ words to Him. Read Psalm 18:1–6 , looking for words and phrases David used to express his feelings about the Lord. Invite students to write the words and phrases they discovered on the board. Students might identify several different phrases, such as: The Lord is my strength ( verse 1 ). The Lord is my rock, fortress, deliverer, God, strength, buckler, horn of salvation, or high tower ( verse 2 ). The Lord is worthy to be praised ( verse 3 ). The Lord hears our cries to Him ( verse 6 ). Students who wrote phrases could share why David might have wanted his audience to know this about the Lord. Consider asking the students how the Lord has fulfilled these roles in their lives. Invite students to choose one of the following passages to study with a partner. Encourage them to pause often and share with each other their thoughts and feelings. The psalms demonstrate many ways we can share our feelings for the Lord. Study one of the following passages slowly, marking words and phrases that reflect your feelings about the Lord. Psalm 8:1–9 Psalm 27:1–9 Psalm 30:1–12 Psalm 46:1–11 Consider showing students ways other than writing to express worship. You could select a video that expresses feelings for Heavenly Father and Jesus Christ through dance, music, or art, such as the following videos available at ChurchofJesusChrist.org . Invite students to ponder what they think the creators were expressing through the lyrics, paintings, and so on. Dance: “ Trust in the Lord: Music Video ” (4:11) Music: “ Here I Am, I Will Follow Jesus Christ ” (3:07) or “ Peace in Christ ” (4:09) Art: Sister Kristin M. Yee shares her painting of the Savior on Facebook ( https://www.facebook.com/reel/1240140883346653?mibextid=kcDB8O ) 4:11 4:10 Express your feelings of worship Give students the remaining class time to begin to create something that reflects how they feel about Heavenly Father and Jesus Christ. Evaluate your students’ needs, and display some or all of the following options. You could provide art supplies like paper, colored pencils, markers, and so on for students who wish to create a visual representation of their feelings. Because this is an individual project, you could walk around the room and offer help, guidance, and encouragement as needed. If appropriate, consider playing soft, sacred music during the activity. It might help to express your love and confidence to any students who might be struggling with their thoughts or feelings about the Lord. Activity 6 could be a good option for students who are still unsure about their faith. Take some time to express your thoughts and feelings about Heavenly Father, Jesus Christ, and sacred things. Use one of the following options, or design one of your own. You might not have time to finish your work in class today, but you could begin to compose a song or poem or conceptualize a drawing or video. You could continue to work on your expression outside of class. You might choose to include a scripture from Psalms that you have found meaningful. Compose a poem or a song that expresses your feelings about Heavenly Father and Jesus Christ. Make a video or an audio recording where you share your feelings about Heavenly Father and Jesus Christ. For a video, you could include favorite sacred images from Gospel Library. Psalmists often compared the Savior to something else to show what He meant to them. Examples include “The Lord is my rock, and my fortress” ( Psalm 18:2 ) and “The Lord is my light” ( Psalm 27:1 ). Make a list of things in your life that could represent how you feel about the Lord. Create a drawing, painting, meme, illustration, or other work of art that reflects your feelings about Heavenly Father and Jesus Christ. Search for multiple sacred images and create a collage. Choose images that represent things about Heavenly Father, Jesus Christ, and the gospel that are important to you. Make a note for each image summarizing your thoughts and feelings. Write your thoughts about Heavenly Father and Jesus Christ. You might want to share an experience that has impacted how you feel about Them. You might allow students to share what they created today. You could make time for students to share their work during future lessons after they have completed their creations. Consider inviting students to add to what they are creating as they continue to learn about Jesus Christ during the next several lessons. Tell students that they will reflect on this creative experience in Lesson 112: “ Assess Your Learning 7 .”\n\n\n--- Lesson 102 ---\nPausing to visualize descriptions and comparisons in scripture passages can bring beauty and power to the words we read. In Psalm 23 , King David described his relationship with Jesus Christ through a series of images that depict the Savior’s love and care. This lesson can help students feel the tender, loving character of Christ through visualizing scriptural images. Student preparation: Invite students to ponder how things they see every day remind them of the Savior. For example, “Rain reminds me of the Savior because …”. Then invite them to read Psalm 23 and choose a favorite comparison that David made to the Savior or to what the Savior does for us. Possible Learning Activities Visualizing scriptural imagery To help students practice learning from scriptural imagery, consider beginning class by displaying a picture of someone mourning and someone dancing. Then, ask your students what thoughts or feelings come to mind when they think of mourning. Students might share things like tears, losing someone, pain, or sadness. Repeat the same question for dancing. Read Psalm 30:11 , looking for how David used the images of mourning and dancing to describe the power of Jesus Christ and His Atonement. How do these pictures help you understand what David was taught about Jesus Christ when he said, “Thou has turned for me my mourning into dancing”? Explain to students that using these pictures to better understand verse 11 is an example of the study skill visualizing . Consider inviting a student to read the following description of this study skill. Visualizing is a study skill that creates a mental picture from descriptive details in the scriptures. We can imagine being present at events described in the scriptures. We can pause and picture phrases like “Thou has turned for me my mourning into dancing” ( Psalm 30:11 ). The next step is pondering what we can learn from the images. Doing so can invite the Holy Ghost as we slow down and seek to understand with our mind and heart. Reflect on the following questions. How often do you slow down to visualize what you are studying in the scriptures? How do you think slowing down to visualize what you read can help you come to know the Savior better? Pay attention to the promptings of the Holy Ghost to help you learn about Jesus Christ as you visualize the descriptions in Psalm 23 today. “The Lord is my Shepherd” This section of the lesson gives students an opportunity to practice visualizing together as a class before trying it on their own. Read Psalm 23:1 and mark the image used to describe Jesus Christ. To help students learn more about the Savior, you might invite them to visualize Him as our Shepherd while they read Ezekiel 34:11–16 or John 10:11–15 , or as the class sings “ Dear to the Heart of the Shepherd ” ( Hymns , no. 221). They may also want to cross-reference or link those passages to Psalm 23:1 . Take a minute to try to imagine or visualize a shepherd taking care of or protecting their sheep. Then write down a statement about Jesus Christ that you learn from visualizing Him as your Shepherd. Consider displaying on the board a picture of Jesus Christ depicted as a shepherd like the one at the beginning of this lesson. Invite a few students to write their statements of truth about Him on the board around the picture. Students might share statements like: The Lord cares about my needs. How has Jesus Christ been a shepherd in your life or in the lives of those around you? Coming to know Jesus Christ Consider giving students a chance to come to know the Savior better by practicing visualization on their own or in small groups. The following activity is one way to do this. Before students begin, give each student a blank sheet of paper. You may also want to provide colored pencils or markers that students could use to draw pictures. Study Psalm 23:2–6 . Then choose one verse that stands out to you to focus on for the remainder of this activity. Visualize the imagery King David used in your verse to describe a characteristic of Jesus Christ or something He does for us. Draw a picture of what you’re visualizing or find a digital image that could represent what you picture in your mind. Write at least one statement of truth on your paper about the Savior that you learn from visualizing David’s description. Personalize what you learned by pondering (or discussing with your group) why it matters to you or how it can strengthen your relationship with Heavenly Father and Jesus Christ. As students work, consider walking around the room to learn from them and help those who may need it. If students struggle to visualize the image, you could ask questions like “What does it feel like to be beside still water?” or “What do you think His rod and staff might represent?” Additionally, complimenting students’ drawings or insights can be a great way to encourage them and strengthen your relationships with them. Students might write statements of truth about the Savior such as: The Lord restores weary and broken souls ( verse 3 ) or The Lord will nourish us, even during difficult situations ( verse 5 ). After students complete the activity, invite them to share what they learned about Jesus Christ. To do this, they could display their pictures around the room, share what they learned with other students or other groups, or add what they learned to the board. Consider asking questions like the following after students have shared. Is there anything you learned about Jesus Christ that you might have missed if you hadn’t slowed down to visualize the imagery in Psalm 23 ? If so, what? Which of these images help you see the tender, loving character of Jesus Christ the most? Why? You might end by encouraging students to use visualization in their scripture study to continue to come to know the Savior better. Consider sharing your testimony of the truths about Jesus Christ taught in Psalm 23 .\n\n\n--- Lesson 103 ---\nTemples are holy places that are clean and pure. They can help us imagine what it will be like to be in the presence of the Lord. In Psalm 24 , King David invites us to strive to be spiritually clean and pure so we can enter the Lord’s temple and His presence someday. This lesson can help students prepare to worthily enter the temple and eventually dwell in the presence of Heavenly Father and Jesus Christ. Student preparation: Invite students to review the temple recommend questions, thinking about their own spiritual preparation to attend the temple. These questions can be found in the appendix of For the Strength of Youth: A Guide for Making Choices [2022]. Possible Learning Activities Dirty or clean? To prepare students to study Psalm 24 , consider displaying a picture of a muddy teenager. You could also bring mud in a bowl and invite some students to put their hands in it. Then adapt the question below by asking the students how they feel. When was the last time you were very muddy or dirty? How did you feel? Consider displaying a picture of the inside of a temple. If your students have not been inside a temple, consider adjusting the following question to ask how they imagine they would feel inside a temple. How do you feel when you enter the temple? Consider displaying the picture of the muddy teenager alongside the picture from the temple. How would you feel if you were very muddy inside the temple? Why? What spiritual lessons can we learn from this? Ponder how you might feel if you stood in the presence of Heavenly Father and Jesus Christ while being spiritually muddy or dirty. Then ponder how you might feel standing in Their presence after having been made spotless through the Atonement of Jesus Christ. In your study journal, answer the following questions: How important is it for you to be temple worthy? Why? How important is it for you to someday dwell with Heavenly Father and Jesus Christ? Why? Seek guidance from the Holy Ghost to help you know what the Lord would have you do to worthily worship Him in the temple and someday enter His and Heavenly Father’s presence. “The hill of the Lord” To begin studying Psalm 24 , consider creating a simple drawing of a hill on the board. Students could draw the same in their journals. Read or summarize the paragraph below. In Psalm 24 , King David used imagery of a hill. Some scripture passages use mountains or hills as symbols of temples (see Isaiah 2:2–3 ). It is possible that David was referring to the temple, or the presence of God, or both. You may want to include on the top of your hill a simple drawing of a temple and the words Heavenly Father and Jesus Christ . You could draw a stick figure at the bottom of the hill that represents us. Read Psalm 24:3–6 , looking for what we should do to prepare to enter the temple and return to the Lord’s presence someday. Psalm 24:3–4 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. After students read the verses, they may have questions about some of the words or phrases. Invite students to ask any questions they or someone in general might have as they read this passage. If helpful, explain that “vanity” refers to pride or arrogance. The phrase “nor sworn deceitfully” could refer to being honest with oneself, others, and God. Consider writing students’ responses to the following question on the board along the edge of the hill. Your final drawing could look similar to the image below. What did you learn from these verses about preparing to enter the temple and returning to the Lord’s presence someday? As students share what they found in verses 3–6 , help them identify the following truth: We must prepare ourselves spiritually to worship the Lord in His temple and to dwell in His presence. Why do you think we need to be spiritually prepared to enter the Lord’s temples and eventually His presence? How could the Lord’s requirements to be spiritually prepared be evidence of His love for us? Spiritually preparing Consider displaying the following instructions and inviting students to complete them individually in their study journal or with a partner. Choose one of the following phrases from Psalm 24:4 you would like to learn more about. clean hands pure heart not lifted up his soul unto vanity (humility) nor sworn deceitfully (honesty) Find scriptures or statements from Church leaders that help you better understand the phrase. Then answer the following questions: Why do you think this aspect of preparation is important to worship in the temple and to dwell with Heavenly Father and Jesus Christ someday? What are specific ways a Latter-day Saint teenager could work on that aspect of preparation? What would you want to share about the Savior with a friend who struggles with that aspect of preparation? If students need help, you could suggest scripture passages such as the following: clean hands ( Doctrine and Covenants 88:86 ) pure heart ( Mosiah 5:2 ) not lifted up his soul unto vanity ( Doctrine and Covenants 112:10 ) nor sworn deceitfully ( Alma 27:27 ) You may want to direct them to the Topical Guide , Guide to the Scriptures , or Gospel Library . You could also provide Elder Bednar’s quote from Additional Resources in this lesson. Invite students to share what they learned with another student or partnership who studied a different phrase. You then could ask a few students to share with the class. My personal preparation To prepare your students to make a personal goal, consider showing a video like “ Standing in Holy Places ” (5:36), available at ChurchofJesusChrist.org . Students could be invited to look for ways the young lady prepared herself to worthily attend the temple. 5:36 Students may also benefit from hearing each other’s experiences. For example, they could share how they feel inside the temple or how holding a temple recommend blesses their life. Reflect on how you are doing with your own spiritual preparation. Ponder what you feel Heavenly Father is pleased with and areas where you could improve. Answer the following questions in your study journal. What do you feel Heavenly Father wants you to do to prepare yourself for the temple and for living with Him someday? How can you rely on the Savior for help? Consider sharing your testimony of the truths students studied. Reassure students of the Savior’s ability to cleanse and help them. You may want to share the following statement to conclude the lesson. President Henry B. Eyring of the First Presidency shared the following: My hope for you and for all your beloved family is that you will grow in desire and determination to be worthy to go into the house of the Lord as often as your circumstances allow. He wants to welcome you there. (“ I Love to See the Temple ,” Liahona , May 2021, 31) Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Psalm 24:3–4 is “Who shall stand in his holy place? He that hath clean hands, and a pure heart.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 104 ---\nDavid wrote a psalm expressing his desire to be forgiven for the sins he committed. He demonstrated his desire to sincerely repent. This lesson can help students understand that as they repent, the Savior can make them clean. Student preparation: Invite students to imagine themselves in the following situation: Imagine a friend of yours shares that they know they need to repent but wonder how. What would you want them to understand about repentance and the Savior’s role in overcoming sin? Possible Learning Activities Repentance The following activity provides students with an opportunity to reflect on their current understanding of repentance. You may want to display the instructions. Imagine that the following anonymous question from a youth was included in this month’s edition of For the Strength of Youth magazine: “I recently committed some very serious sins that I feel really bad about. I’m not really sure how to repent. To be honest, I am even wondering if I am beyond repentance. Any help?” In your study journal, using what you know about repentance, record what you feel would be helpful for this person to know and understand. As students read the anonymous question and record their responses, they may have additional questions that come to mind. You could invite them to write down any other questions they might have about repentance. Help them know that during the lesson they will have opportunities to study more about repentance. Testify that the Spirit can give them answers to their questions about repentance as they prayerfully seek answers through their study both in and out of class. Sincere repentance Ask students what they know about King David. You could ask them to share some of the great things he did as well as some of the sins he committed. Share any of the following context with students that they don’t mention in their summary. David “was guilty of grave crimes; but … he was capable of true contrition and was therefore able to find forgiveness, except in the murder of Uriah” (Bible Dictionary, “ David ”, see also Doctrine and Covenants 42:18 ). In Psalm 51 , David recorded a psalm to God in which he expressed his feelings of remorse following his sin with Bathsheba (see 2 Samuel 11–12 ). David’s humility and heartfelt desire to be restored to God’s grace and acceptance demonstrate the attitude of one who is seeking to truly repent. Students could first study Psalm 51 on their own looking for what they learn about repentance; then you could provide them with a way to share what they discovered and learned. Here are some instructions you could display for students to follow. You can adapt any of these instructions to better meet the needs and abilities of your students. Study Psalm 51:1–19 on your own looking for what we can learn from David’s psalm about (1) God, or (2) repentance. Mark what you find. Identify three phrases you marked and do one of the following: Write a statement of truth that the phrase is teaching about God or repentance. Find a cross-reference that confirms or deepens your understanding of what the phrase means. Find a quote from a Church leader that can help with understanding. Write a question about the phrase. One way you could help students prepare to share is to list 1–19 on the board. Invite students to write their names next to the verse numbers that contain a phrase they would be willing to share a cross-reference, quote, or question about. Once they have finished, you can invite students to share. As students share, you may want to list statements of truth on the board. Below is some content you may want to share as part of the discussion. The scriptures and statements are organized by verse grouping and bolded truths. Seek to follow any promptings of the Spirit you may receive about what to share or what to ask. Psalm 51:1–2, 7, 9 : God has power to cleanse me from my sin. Isaiah 1:18 President Jeffrey R. Holland of the Quorum of the Twelve Apostles testified: [H]owever many mistakes you feel you have made … or however far from home and family and God you feel you have traveled, I testify that you have not traveled beyond the reach of divine love. It is not possible for you to sink lower than the infinite light of Christ’s Atonement shines. (“ Laborers in the Vineyard ,” Ensign or Liahona , May 2012, 33) Psalm 51:3–4 : Acknowledging our sin before God is necessary for repentance. Mosiah 26:29–30 Doctrine and Covenants 58:42–43 The General Handbook explains: Repentance requires that sins be confessed to Heavenly Father. … When Church members commit serious sins, their repentance also includes confession to their bishop or stake president. He is then able to exercise the keys of the gospel of repentance on their behalf (see Doctrine and Covenants 13:1 ; 84:26–27 ; 107:18, 20 ). This helps them heal and return to the gospel path through the power of the Savior’s Atonement. … Voluntary confession shows that a person desires to repent. ( General Handbook: Serving in The Church of Jesus Christ of Latter-day Saints , 32.4.1, Gospel Library) Psalm 51:10–12 : As we repent, God can help us change, feel joy, and have the Holy Ghost with us. Mosiah 4:2–3 President Russell M. Nelson taught: When we choose to repent, we choose to change! We allow the Savior to transform us into the best version of ourselves. We choose to grow spiritually and receive joy—the joy of redemption in Him. When we choose to repent, we choose to become more like Jesus Christ! (“ We Can Do Better and Be Better ,” Liahona , May 2019, 67) Psalm 51:16–17 : I must have a broken and contrite heart and spirit to truly repent before God. 3 Nephi 9:19–20 Elder Neil L. Andersen of the Quorum of the Twelve Apostles explained: To have a broken heart is to be humble, repentant, and meek, eagerly receptive to the will of God. A contrite spirit puts one’s own interests in the hands of God, believing that His will, not our own, will help us become who we should become. ( The Divine Gift of Forgiveness [2019], 153) Explain repentance To help students demonstrate their understanding of sincere repentance and the Savior’s role in it, invite them to review what they have learned in class today. Look back at what you wrote at the beginning of class about the question in the For the Strength of Youth magazine. Using what you have learned today about sincere repentance, add two or three sentences to your initial response. Consider inviting a few willing students to share how they would respond to the question. Encourage students to share their message with a friend or family member they feel would be blessed to hear it. Consider concluding class by inviting students to turn to the Savior through repentance and testifying of His power to make us clean as we repent.\n\n--- SCRIPTURE: Psalms 1 ---\n1. Blessedisthe man thatwalkethnot in thecounselof the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of thescornful.\n2. But hisdelightisin thelawof theLord; and in his law doth hemeditateday and night.\n3. And he shall be like atreeplanted by the rivers of water, that bringeth forth his fruit in his season; his leaf also shall not wither; and whatsoever he doeth shallprosper.\n4. The ungodlyarenot so: butarelike thechaffwhich the wind driveth away.\n5. Therefore the ungodly shall not stand in the judgment, nor sinners in the congregation of the righteous.\n6. For theLordknoweth the way of therighteous: but the way of theungodlyshall perish.\n\n--- SCRIPTURE: Psalms 2 ---\n1. Why do theheathenrage, and the people imagine vain thing?\n2. Thekingsof the earth set themselves, and the rulers takecounseltogether, against theLord, and against hisanointed,saying,\n3. Let us break their bands asunder, and cast away their cords from us.\n4. He that sitteth in the heavens shalllaugh: the Lord shall have them in derision.\n5. Then shall he speak unto them in his wrath, and vex them in his sore displeasure.\n6. Yet have Iset my kingupon myholy hillof Zion.\n7. I will declare the decree: theLordhath said unto me, ThouartmySon; this day have I begotten thee.\n8. Ask of me, and I shall givetheethe heathenforthine inheritance, and the uttermost parts of the earthforthy possession.\n9. Thou shaltbreakthem with arod of iron; thou shaltdashthem in pieces like potters vessel.\n10. Be wise now therefore, O ye kings: be instructed, ye judges of the earth.\n11. Serve theLordwithfear, and rejoice with trembling.\n12. Kiss the Son, lest he be angry, and ye perishfromthe way, when his wrath is kindled but little.Blessedareall they that put theirtrustin him.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";8;19–33;40;46",
      "content": "We don’t know for certain who wrote the Psalms. Some are attributed to King David, but for most of them, the writers remain anonymous. Yet after reading the Psalms, we feel as if we know the hearts of the psalmists, even if we don’t know their names. We do know that the Psalms were an important part of worship among the Israelites, and we know that the Savior quoted them often. In the Psalms, we get a window into the soul of God’s ancient people. We see how they felt about God, what they worried about, and how they found peace. As believers today, all over the world, we still use these words in our worship of God. It’s almost like the writers of the Psalms had a window into\nour\nsouls, because they expressed how we feel about God, what we worry about, and how we find peace.\nFor an overview of the book of Psalms, see “\nPsalms\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nPsalms 1\n;\n23\n;\n26–28\n;\n46\n“I have trusted … in the Lord.”\nAs you read the Psalms, you might notice how often the writers express fear, sorrow, or anxiety. Such feelings are normal, even for people of faith. But what makes the Psalms inspiring is that they also offer inspiring solutions, including complete trust in the Lord. As you read\nPsalms 1\n;\n23\n;\n26–28\n;\n46\n, write down:\nInvitations to trust the Lord.\nWords that describe Him.\nWords that describe the peace, strength, and other blessings He provides.\nWords that describe people who trust Him.\nAlso watch for the vivid imagery and symbols that the Psalms use to teach about the Savior. For example, in\nPsalm 23\n, what do phrases like “lie down in green pastures” or “still waters” (\nverse 2\n) bring to mind? What could the comforting “rod” and “staff” (\nverse 4\n) symbolize? What might it mean for our “cup” (\nverse 5\n) to run over?\nPsalms 2\n;\n22\nJesus Christ is the promised Messiah.\nSeveral of the psalms point to the mortal life of Jesus Christ. Christians in New Testament times saw these connections too. Consider reading the following scripture references. Look for connections between the words in these psalms and the life of the Savior:\nPsalm 2:1–3\nand\nActs 4:24–28\nPsalm 2:7\nand\nActs 13:30–33\nPsalm 22:1\nand\nMatthew 27:45–46\nPsalm 22:7–8\nand\nMatthew 27:39–43\nPsalm 22:16\nand\nLuke 23:32–33\nPsalm 22:18\nand\nMatthew 27:35\nPsalm 31:5\nand\nLuke 23:46\nWhat do you learn from studying these connections? What scriptural prophecies and promises haven’t been fulfilled yet? What do you find in these promises that gives you hope for the future?\nPsalms 8\n;\n19\n;\n33\n“The earth is full of the goodness of the Lord.”\nReading\nPsalms 8\n;\n19\n;\n33\nmight inspire you to consider the Lord’s many wonderful creations. Pay attention to your feelings as you do. You might also want to sing or ponder the words of a song related to these psalms, such as “\nHow Great Thou Art\n” (\nHymns\n, 86). How do the Lord’s creations “declare the glory of God” to you? (\nPsalm 19:1\n).\nHere are some other hymns inspired by the Psalms:\nPsalm 23\n:\n“\nThe Lord Is My Shepherd\n” (\nHymns\n, no. 108)\nPsalms 23:6\n;\n150\n:\n“\nPraise to the Lord, the Almighty\n” (\nHymns\n, no. 72)\nPsalm 26:8\n:\n“\nWe Love Thy House, O God\n” (\nHymns\n, no. 247)\nPsalm 27:1\n:\n“\nThe Lord Is My Light\n” (\nHymns\n, no. 89)\nPsalms 33:1–6\n;\n95:1–6\n:\n“\nFor the Beauty of the Earth\n” (\nHymns\n, no. 92)\nPsalm 37:3–9\n:\n“\nBe Still, My Soul\n” (\nHymns\n, no. 124)\nPsalm 148\n:\n“\nAll Creatures of Our God and King\n” (\nHymns\n, no. 62)\nUse music.\nPresident Dallin H. Oaks said: “The singing of hymns is one of the best ways to put ourselves in tune with the Spirit of the Lord. … Sacred music has a unique capacity to communicate our feelings of love for the Lord. This kind of communication is a wonderful aid to our worship. … Our hymns contain matchless doctrinal sermons, surpassed only by the scriptures in their truth and poetic impact” (“\nWorship through Music\n,”\nEnsign\n, Nov. 1994, 10, 11). What hymns related to the Psalms could you listen to or sing to enhance your worship this week?\nPsalms 19:7–11\n;\n29\nThe word of the Lord is powerful, “rejoicing the heart.”\nIn the Psalms, words like\ntestimony\n,\nstatutes\n,\ncommandment\n, and\njudgments\ncan refer to the word of the Lord. Keep that in mind as you read\nPsalm 19:7–11\n. What do these verses suggest to you about the word of the Lord? What does\nPsalm 29\nteach you about His voice? In your experience, how has the word or voice of the Lord matched these descriptions?\nPsalms 24\n;\n26–27\nThe Savior can help me be pure so I can enter God’s presence.\nBecause the temple at Jerusalem was built on a hill, the phrase “hill of the Lord” (\nPsalm 24:3\n) could refer to the temple or to the presence of God. What does this add to your understanding of\nPsalm 24\n? What does it mean to you to have “clean hands, and a pure heart”? (\nverse 4\n). As you read\nPsalms 26–27\n, what else do you learn about the house of the Lord?\nAt times, we might be discouraged to hear that we need to be pure to enter the presence of God. After all, we all struggle, and none of us are perfect. What hope do you find in Elder David A. Bednar’s message “\nClean Hands and a Pure Heart\n”? (\nEnsign\nor\nLiahona\n, Nov. 2007, 80–83). How could you use his message to help someone who feels overwhelmed with wanting to be perfect? Consider how you can receive the Savior’s help in your efforts to have “clean hands, and a pure heart.”\nSee also Bradley R. Wilcox, “\nWorthiness Is Not Flawlessness\n,”\nLiahona\n, Nov. 2021, 61–67.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nPsalms 23\n;\n27–28\n;\n32\n;\n46\nThe Lord offers me peace, strength, and guidance.\nConsider writing\nThe Lord is …\nInvite your children to look for ways to complete that sentence using scriptures like these:\nPsalms 23:1\n;\n27:1\n;\n28:1\n;\n28:7\n;\n32:7\n;\n46:1\n. What do these verses teach us about how the Lord can help us?\nYou could discuss with your children what a lamb needs to be safe and healthy. Then, as you read together\nPsalm 23\n, help your children compare what a shepherd does for a lamb with what Jesus does for us. What do we need to be spiritually safe and healthy? Sing together a song that could give them ideas, such as “\nI Feel My Savior’s Love\n” (\nChildren’s Songbook\n, 74–75).\nConcepción Chile Temple\nPsalm 24:3–4\nTo enter the temple, we need “clean hands, and a pure heart.”\nAs you read\nPsalm 24:3\ntogether, your children could look for words that remind them of the temple. They could also look at a picture of a temple. Then you could read together\nverse 4\nto learn who can enter the temple. You could talk about how hands get dirty and how we clean them. How do we get spiritually dirty? How does the Savior help clean us spiritually?\nPsalm 30:5\nJesus Christ can turn sadness into joy.\nIf you have young children, you could invite them to pretend to cry while you read from\nPsalm 30:5\n, “Weeping may endure for a night.” Then ask them to express joy as you read, “But joy cometh in the morning.” Repeat this phrase a few times.\nShow a picture of the Savior, and tell your children what He has done for you that brings you joy. You could also give each child a turn to hold the picture and share what Jesus has done that brings them joy.\nPsalm 46:10\n“Be still, and know that I am God.”\nHelp your children memorize the first line from\nPsalm 46:10\n: “Be still, and know that I am God.” What could it mean to “be still”? Maybe you could spend some time practicing being still. You could also share with each other experiences when being “still” strengthened your relationship with God. Help your children think of times during the day when they can “be still” to feel close to Heavenly Father.\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 34: Lesson 100: Lesson 100—Introduction to Psalms, Part 1This lesson can help students better understand Jesus Christ’s life and mission as prophesied in Psalms.; Lesson 101: Lesson 101—Introduction to Psalms, Part 2This lesson can provide an opportunity for students to express their feelings of worship for Heavenly Father and Jesus Christ....",
      "content": "\n--- Lesson 100 ---\nWhat do your favorite hymns teach you about Jesus Christ? Hymns have allowed musicians and poets to express their feelings about the Savior for centuries. Like many modern hymns, several of the psalms teach and testify of the Savior’s life and mission. This lesson can help students better understand Jesus Christ’s life and mission as prophesied in Psalms. Student preparation: Invite students to ponder how their favorite hymns teach and testify of Jesus Christ. Invite them to prepare to share a favorite hymn about Jesus Christ in class. If students feel they do not have a favorite hymn, invite them to look through the hymn book for songs that teach about Jesus Christ. Possible Learning Activities Hymns that teach of Jesus Christ Using sacred music in class can create a feeling of reverence, invite the Holy Ghost, and increase feelings of unity. Music can also be used to connect the message of hymns to the truths students are learning. You might use sacred music to begin this lesson. One way is to invite students to search Hymns (1985) or Hymns—for Home and Church (2026) . Invite students to select a hymn under the topic “ Jesus Christ .” Give students a moment to read and reflect on the lyrics of that hymn. You might point out the authors’ names and scripture references underneath the music and lyrics. Display the following questions and invite students to share their answers with a partner. (For additional training on using sacred music in class, see “ Create settings and opportunities for learners to be taught by the Holy Ghost ” in Teacher Development Skills .) What can we learn about the Savior and His life from the words of this hymn? Is there another hymn about the Savior that has special meaning to you? If so, why? As you study today, invite the Holy Ghost to help you feel the power of words and music that teach and testify of Jesus Christ. The book of Psalms The book of Psalms is a collection of prayers, poems, and hymns that is similar in some ways to our modern hymnbook. Invite students to turn to the book of Psalms . Give students two to three minutes to scan through some of the psalms, looking for an overall impression. As you scan through the book, what do you notice about Psalms that makes it unique? What questions do you have about this book? Quickly look through Psalm 3 , marking each time you find the word Selah . While the meaning of Selah is not certain, it may have been a signal to the singer or reader to pause and reflect (like a musical rest). Read Psalm 3 , pausing each time you read the word Selah . Invite the Holy Ghost to help you ponder these verses. Why might the author have wanted us to pause and reflect in these places? How might pondering in one or more of these places help or comfort a teenager today? Depending on your class’s questions and experience, you could briefly point out some or all of the following: Many of the psalms are attributed to specific authors like David ( Psalm 3 ). Other psalms have no known author (see Psalm 1 ). Hebrew poetic elements are found throughout Psalms. Parallelism is poetry where two or more lines share connected ideas (see Psalm 29:4 ). Repetition is a Hebrew poetic tool that emphasizes a line by repeating it (such as “Praise him” in Psalm 150 ). In the Hebrew language, Psalm 119 is an example of an acrostic poem. Acrostic poems use the first letter of each line to spell out words or the Hebrew alphabet.. The book of Psalms is quoted in the New Testament over 115 times (see Psalms 6:8 and Luke 13:27 ). After the Last Supper, Jesus and His disciples sang a hymn (see Matthew 26:30 ). This was possibly Psalms 113–118 , the “Hallel,” the hymn traditionally sung at Passover (see Merrill J. Bateman, “ The Power of Hymns ,” Ensign , July 2001, 17). Read Luke 24:44 , looking for what the Savior taught His disciples about the psalms shortly after His Resurrection. In speaking of one of the most important messages found in the book of Psalms, President Jeffrey R. Holland of the Quorum of the Twelve Apostles taught: Jesus Himself quoted the book of Psalms more than any other Old Testament text. … It could be argued that in all of holy writ, no book of scripture goes on so extensively about the Messianic mission or the looking and longing for His return that is expressed in the songs of the Psalmist. ( For Times of Trouble: Spiritual Solace from the Psalms [2012], 7–8) What did you learn from Luke 24:44 and from President Holland? Why is it worth studying the book of Psalms? Help students recognize that we can learn about the life and mission of Jesus Christ by studying the psalms . Consider writing this truth on the board. Psalms that prophesy of Jesus Christ To help students understand some of the prophetic statements in Psalms about Jesus Christ’s life and mission, provide some or all of the scripture references below. The following are a few ways you might have your class study these verses: Write the verse pairs on strips of paper and place each paper around the room. Give students time to walk around the room and read several of the prophecies and fulfillments. Mix up the scripture pairs and invite students to match the prophecies in Psalms with their fulfillments. Display only the Psalms verses. Invite students to use the footnotes and other scripture study tools to find references from the Savior’s life that fulfill each prophecy. Psalms that prophesy of Jesus Christ Prophesy fulfilled Psalms that prophesy of Jesus Christ Psalm 22:1 Prophesy fulfilled Matthew 27:46 Psalms that prophesy of Jesus Christ Psalm 22:7–8 Prophesy fulfilled Matthew 27:41–43 Psalms that prophesy of Jesus Christ Psalm 22:16 Prophesy fulfilled Doctrine and Covenants 6:36–37 Psalms that prophesy of Jesus Christ Psalm 22:18 Prophesy fulfilled John 19:23–24 Psalms that prophesy of Jesus Christ Psalm 31:5 Prophesy fulfilled Luke 23:46 Psalms that prophesy of Jesus Christ Psalm 34:20 Prophesy fulfilled John 19:31–36 Psalms that prophesy of Jesus Christ Psalm 41:9 Prophesy fulfilled Luke 22:47–48 ; Acts 1:16–17 Psalms that prophesy of Jesus Christ Psalm 69:20–21 Prophesy fulfilled John 19:28–29 Psalms that prophesy of Jesus Christ Psalm 118:22 Prophesy fulfilled Acts 4:10–12 Think of a situation that you or a loved one faces where it is helpful to know something you learned about the Savior’s life or mission from these prophecies. Record your thoughts in your study journal. To help students visualize the fulfilment of some of the prophecies, you could show a video depicting moments from the Savior’s life. For example, you could use “ My Kingdom Is Not of This World ,” time code 0:00 to 3:18, from ChurchofJesusChrist.org . This video illustrates prophecies in Psalm 22:1, 7–8, 16 . 5:25 As students watch the video, invite them to raise their hands when they recognize an event prophesied in Psalms. Consider pausing the video and inviting students to share what they would want someone to understand about this moment in the Savior’s life. The life of Jesus Christ Invite students to demonstrate their understanding of the Savior’s life and mission as prophesied in Psalms. One option is to invite students to discuss the following questions with a partner, small group, or the class. Select one of the prophecies from Psalms that you found particularly meaningful. What does this prophecy teach you about Jesus Christ? Why is what you learned about Him important to know? Consider sharing your witness of the life and mission of Jesus Christ. You could invite students to continue to look for references to Jesus Christ as they study the book of Psalms throughout the next few weeks. It might be appropriate to conclude class by singing or listening to a hymn about the Savior, as chosen by the students. In Lesson 101: “ Introduction to the Psalms, Part 2 ,” students will create an expression of their love and devotion to Heavenly Father and Jesus Christ as the Psalmists did. Consider inviting students to start thinking about this now. Ask them to ponder how they feel about Heavenly Father and Jesus Christ and how they would express those feelings.\n\n\n--- Lesson 101 ---\nOne way to worship Heavenly Father and Jesus Christ is to express your love and devotion to Them. Many of the Psalms are poetic examples of worshipping the Father and Son in praises, pleadings, and prayers. This lesson can help students express their feelings of worship for Heavenly Father and Jesus Christ. Student preparation: Let students know they will have an opportunity to reflect on their thoughts and feelings about Heavenly Father, Jesus Christ, and sacred things in preparation to share those feelings in this lesson. Encourage students to listen to reverent music and review favorite scriptures, quotes, or sacred images, looking for specific things they might want to share. Doing this can prepare their hearts and minds for the activity in this lesson. Possible Learning Activities Worshipping God Note: The activity at the end of this lesson will be part of the reflection in Lesson 112: “ Assess Your Learning 7 .” Be sure to allow plenty of time for students to begin working on the activity during class. To begin class, give students a minute to ponder the following question: What does “worshipping God” mean to you? Elder Dean M. Davies, then serving in the Presiding Bishopric, shared some ways we can worship God when he taught: When we worship God, we approach Him with reverent love, humility, and adoration. We acknowledge and accept Him as our sovereign King, the Creator of the universe, our beloved and infinitely loving Father. We respect and revere Him. We submit ourselves to Him. We lift our hearts in mighty prayer, cherish His word, rejoice in His grace, and commit to follow Him with dedicated loyalty. (“ The Blessings of Worship ,” Ensign or Liahona , Nov. 2016, 94) How would you describe the difference between simply attending church, the temple, or seminary compared to worshipping God as you attend? Briefly share with students one or two of your favorite ways that people have expressed their feelings of worship for Heavenly Father and Jesus Christ. Examples include a poem, video, work of art, piece of writing, or piece of sacred music. You could include things that you wrote or created yourself. Explain to students that there are many ways someone can express feelings of worship for Heavenly Father and Jesus Christ. Encourage students to reflect on how they might express their feelings of worship for Heavenly Father and Jesus Christ. Throughout the lesson, be mindful of and sensitive to students who might not feel a connection to Heavenly Father and Jesus Christ right now. In your study journal, select one or more of the following questions to answer. You could use some of Elder Davies’s message or your own words to summarize your feelings. How do you feel about Heavenly Father, Jesus Christ, and sacred things? How do you best express love, respect, or reverence for Heavenly Father, Jesus Christ, or spiritual blessings? At the end of the lesson today, you will begin creating an expression of your feelings. Keep this in mind as you study. Think about how you might want to express what you learn and feel. Invite the Holy Ghost to assist you in your efforts. Worshipping the Lord in the psalms Many psalms are the poetic, prayerful expressions of the sacred thoughts, feelings, hopes, and desires of the writers. While many scriptures record the Lord’s words to us, the psalms frequently reflect the writers’ words to Him. Read Psalm 18:1–6 , looking for words and phrases David used to express his feelings about the Lord. Invite students to write the words and phrases they discovered on the board. Students might identify several different phrases, such as: The Lord is my strength ( verse 1 ). The Lord is my rock, fortress, deliverer, God, strength, buckler, horn of salvation, or high tower ( verse 2 ). The Lord is worthy to be praised ( verse 3 ). The Lord hears our cries to Him ( verse 6 ). Students who wrote phrases could share why David might have wanted his audience to know this about the Lord. Consider asking the students how the Lord has fulfilled these roles in their lives. Invite students to choose one of the following passages to study with a partner. Encourage them to pause often and share with each other their thoughts and feelings. The psalms demonstrate many ways we can share our feelings for the Lord. Study one of the following passages slowly, marking words and phrases that reflect your feelings about the Lord. Psalm 8:1–9 Psalm 27:1–9 Psalm 30:1–12 Psalm 46:1–11 Consider showing students ways other than writing to express worship. You could select a video that expresses feelings for Heavenly Father and Jesus Christ through dance, music, or art, such as the following videos available at ChurchofJesusChrist.org . Invite students to ponder what they think the creators were expressing through the lyrics, paintings, and so on. Dance: “ Trust in the Lord: Music Video ” (4:11) Music: “ Here I Am, I Will Follow Jesus Christ ” (3:07) or “ Peace in Christ ” (4:09) Art: Sister Kristin M. Yee shares her painting of the Savior on Facebook ( https://www.facebook.com/reel/1240140883346653?mibextid=kcDB8O ) 4:11 4:10 Express your feelings of worship Give students the remaining class time to begin to create something that reflects how they feel about Heavenly Father and Jesus Christ. Evaluate your students’ needs, and display some or all of the following options. You could provide art supplies like paper, colored pencils, markers, and so on for students who wish to create a visual representation of their feelings. Because this is an individual project, you could walk around the room and offer help, guidance, and encouragement as needed. If appropriate, consider playing soft, sacred music during the activity. It might help to express your love and confidence to any students who might be struggling with their thoughts or feelings about the Lord. Activity 6 could be a good option for students who are still unsure about their faith. Take some time to express your thoughts and feelings about Heavenly Father, Jesus Christ, and sacred things. Use one of the following options, or design one of your own. You might not have time to finish your work in class today, but you could begin to compose a song or poem or conceptualize a drawing or video. You could continue to work on your expression outside of class. You might choose to include a scripture from Psalms that you have found meaningful. Compose a poem or a song that expresses your feelings about Heavenly Father and Jesus Christ. Make a video or an audio recording where you share your feelings about Heavenly Father and Jesus Christ. For a video, you could include favorite sacred images from Gospel Library. Psalmists often compared the Savior to something else to show what He meant to them. Examples include “The Lord is my rock, and my fortress” ( Psalm 18:2 ) and “The Lord is my light” ( Psalm 27:1 ). Make a list of things in your life that could represent how you feel about the Lord. Create a drawing, painting, meme, illustration, or other work of art that reflects your feelings about Heavenly Father and Jesus Christ. Search for multiple sacred images and create a collage. Choose images that represent things about Heavenly Father, Jesus Christ, and the gospel that are important to you. Make a note for each image summarizing your thoughts and feelings. Write your thoughts about Heavenly Father and Jesus Christ. You might want to share an experience that has impacted how you feel about Them. You might allow students to share what they created today. You could make time for students to share their work during future lessons after they have completed their creations. Consider inviting students to add to what they are creating as they continue to learn about Jesus Christ during the next several lessons. Tell students that they will reflect on this creative experience in Lesson 112: “ Assess Your Learning 7 .”\n\n\n--- Lesson 102 ---\nPausing to visualize descriptions and comparisons in scripture passages can bring beauty and power to the words we read. In Psalm 23 , King David described his relationship with Jesus Christ through a series of images that depict the Savior’s love and care. This lesson can help students feel the tender, loving character of Christ through visualizing scriptural images. Student preparation: Invite students to ponder how things they see every day remind them of the Savior. For example, “Rain reminds me of the Savior because …”. Then invite them to read Psalm 23 and choose a favorite comparison that David made to the Savior or to what the Savior does for us. Possible Learning Activities Visualizing scriptural imagery To help students practice learning from scriptural imagery, consider beginning class by displaying a picture of someone mourning and someone dancing. Then, ask your students what thoughts or feelings come to mind when they think of mourning. Students might share things like tears, losing someone, pain, or sadness. Repeat the same question for dancing. Read Psalm 30:11 , looking for how David used the images of mourning and dancing to describe the power of Jesus Christ and His Atonement. How do these pictures help you understand what David was taught about Jesus Christ when he said, “Thou has turned for me my mourning into dancing”? Explain to students that using these pictures to better understand verse 11 is an example of the study skill visualizing . Consider inviting a student to read the following description of this study skill. Visualizing is a study skill that creates a mental picture from descriptive details in the scriptures. We can imagine being present at events described in the scriptures. We can pause and picture phrases like “Thou has turned for me my mourning into dancing” ( Psalm 30:11 ). The next step is pondering what we can learn from the images. Doing so can invite the Holy Ghost as we slow down and seek to understand with our mind and heart. Reflect on the following questions. How often do you slow down to visualize what you are studying in the scriptures? How do you think slowing down to visualize what you read can help you come to know the Savior better? Pay attention to the promptings of the Holy Ghost to help you learn about Jesus Christ as you visualize the descriptions in Psalm 23 today. “The Lord is my Shepherd” This section of the lesson gives students an opportunity to practice visualizing together as a class before trying it on their own. Read Psalm 23:1 and mark the image used to describe Jesus Christ. To help students learn more about the Savior, you might invite them to visualize Him as our Shepherd while they read Ezekiel 34:11–16 or John 10:11–15 , or as the class sings “ Dear to the Heart of the Shepherd ” ( Hymns , no. 221). They may also want to cross-reference or link those passages to Psalm 23:1 . Take a minute to try to imagine or visualize a shepherd taking care of or protecting their sheep. Then write down a statement about Jesus Christ that you learn from visualizing Him as your Shepherd. Consider displaying on the board a picture of Jesus Christ depicted as a shepherd like the one at the beginning of this lesson. Invite a few students to write their statements of truth about Him on the board around the picture. Students might share statements like: The Lord cares about my needs. How has Jesus Christ been a shepherd in your life or in the lives of those around you? Coming to know Jesus Christ Consider giving students a chance to come to know the Savior better by practicing visualization on their own or in small groups. The following activity is one way to do this. Before students begin, give each student a blank sheet of paper. You may also want to provide colored pencils or markers that students could use to draw pictures. Study Psalm 23:2–6 . Then choose one verse that stands out to you to focus on for the remainder of this activity. Visualize the imagery King David used in your verse to describe a characteristic of Jesus Christ or something He does for us. Draw a picture of what you’re visualizing or find a digital image that could represent what you picture in your mind. Write at least one statement of truth on your paper about the Savior that you learn from visualizing David’s description. Personalize what you learned by pondering (or discussing with your group) why it matters to you or how it can strengthen your relationship with Heavenly Father and Jesus Christ. As students work, consider walking around the room to learn from them and help those who may need it. If students struggle to visualize the image, you could ask questions like “What does it feel like to be beside still water?” or “What do you think His rod and staff might represent?” Additionally, complimenting students’ drawings or insights can be a great way to encourage them and strengthen your relationships with them. Students might write statements of truth about the Savior such as: The Lord restores weary and broken souls ( verse 3 ) or The Lord will nourish us, even during difficult situations ( verse 5 ). After students complete the activity, invite them to share what they learned about Jesus Christ. To do this, they could display their pictures around the room, share what they learned with other students or other groups, or add what they learned to the board. Consider asking questions like the following after students have shared. Is there anything you learned about Jesus Christ that you might have missed if you hadn’t slowed down to visualize the imagery in Psalm 23 ? If so, what? Which of these images help you see the tender, loving character of Jesus Christ the most? Why? You might end by encouraging students to use visualization in their scripture study to continue to come to know the Savior better. Consider sharing your testimony of the truths about Jesus Christ taught in Psalm 23 .\n\n\n--- Lesson 103 ---\nTemples are holy places that are clean and pure. They can help us imagine what it will be like to be in the presence of the Lord. In Psalm 24 , King David invites us to strive to be spiritually clean and pure so we can enter the Lord’s temple and His presence someday. This lesson can help students prepare to worthily enter the temple and eventually dwell in the presence of Heavenly Father and Jesus Christ. Student preparation: Invite students to review the temple recommend questions, thinking about their own spiritual preparation to attend the temple. These questions can be found in the appendix of For the Strength of Youth: A Guide for Making Choices [2022]. Possible Learning Activities Dirty or clean? To prepare students to study Psalm 24 , consider displaying a picture of a muddy teenager. You could also bring mud in a bowl and invite some students to put their hands in it. Then adapt the question below by asking the students how they feel. When was the last time you were very muddy or dirty? How did you feel? Consider displaying a picture of the inside of a temple. If your students have not been inside a temple, consider adjusting the following question to ask how they imagine they would feel inside a temple. How do you feel when you enter the temple? Consider displaying the picture of the muddy teenager alongside the picture from the temple. How would you feel if you were very muddy inside the temple? Why? What spiritual lessons can we learn from this? Ponder how you might feel if you stood in the presence of Heavenly Father and Jesus Christ while being spiritually muddy or dirty. Then ponder how you might feel standing in Their presence after having been made spotless through the Atonement of Jesus Christ. In your study journal, answer the following questions: How important is it for you to be temple worthy? Why? How important is it for you to someday dwell with Heavenly Father and Jesus Christ? Why? Seek guidance from the Holy Ghost to help you know what the Lord would have you do to worthily worship Him in the temple and someday enter His and Heavenly Father’s presence. “The hill of the Lord” To begin studying Psalm 24 , consider creating a simple drawing of a hill on the board. Students could draw the same in their journals. Read or summarize the paragraph below. In Psalm 24 , King David used imagery of a hill. Some scripture passages use mountains or hills as symbols of temples (see Isaiah 2:2–3 ). It is possible that David was referring to the temple, or the presence of God, or both. You may want to include on the top of your hill a simple drawing of a temple and the words Heavenly Father and Jesus Christ . You could draw a stick figure at the bottom of the hill that represents us. Read Psalm 24:3–6 , looking for what we should do to prepare to enter the temple and return to the Lord’s presence someday. Psalm 24:3–4 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. After students read the verses, they may have questions about some of the words or phrases. Invite students to ask any questions they or someone in general might have as they read this passage. If helpful, explain that “vanity” refers to pride or arrogance. The phrase “nor sworn deceitfully” could refer to being honest with oneself, others, and God. Consider writing students’ responses to the following question on the board along the edge of the hill. Your final drawing could look similar to the image below. What did you learn from these verses about preparing to enter the temple and returning to the Lord’s presence someday? As students share what they found in verses 3–6 , help them identify the following truth: We must prepare ourselves spiritually to worship the Lord in His temple and to dwell in His presence. Why do you think we need to be spiritually prepared to enter the Lord’s temples and eventually His presence? How could the Lord’s requirements to be spiritually prepared be evidence of His love for us? Spiritually preparing Consider displaying the following instructions and inviting students to complete them individually in their study journal or with a partner. Choose one of the following phrases from Psalm 24:4 you would like to learn more about. clean hands pure heart not lifted up his soul unto vanity (humility) nor sworn deceitfully (honesty) Find scriptures or statements from Church leaders that help you better understand the phrase. Then answer the following questions: Why do you think this aspect of preparation is important to worship in the temple and to dwell with Heavenly Father and Jesus Christ someday? What are specific ways a Latter-day Saint teenager could work on that aspect of preparation? What would you want to share about the Savior with a friend who struggles with that aspect of preparation? If students need help, you could suggest scripture passages such as the following: clean hands ( Doctrine and Covenants 88:86 ) pure heart ( Mosiah 5:2 ) not lifted up his soul unto vanity ( Doctrine and Covenants 112:10 ) nor sworn deceitfully ( Alma 27:27 ) You may want to direct them to the Topical Guide , Guide to the Scriptures , or Gospel Library . You could also provide Elder Bednar’s quote from Additional Resources in this lesson. Invite students to share what they learned with another student or partnership who studied a different phrase. You then could ask a few students to share with the class. My personal preparation To prepare your students to make a personal goal, consider showing a video like “ Standing in Holy Places ” (5:36), available at ChurchofJesusChrist.org . Students could be invited to look for ways the young lady prepared herself to worthily attend the temple. 5:36 Students may also benefit from hearing each other’s experiences. For example, they could share how they feel inside the temple or how holding a temple recommend blesses their life. Reflect on how you are doing with your own spiritual preparation. Ponder what you feel Heavenly Father is pleased with and areas where you could improve. Answer the following questions in your study journal. What do you feel Heavenly Father wants you to do to prepare yourself for the temple and for living with Him someday? How can you rely on the Savior for help? Consider sharing your testimony of the truths students studied. Reassure students of the Savior’s ability to cleanse and help them. You may want to share the following statement to conclude the lesson. President Henry B. Eyring of the First Presidency shared the following: My hope for you and for all your beloved family is that you will grow in desire and determination to be worthy to go into the house of the Lord as often as your circumstances allow. He wants to welcome you there. (“ I Love to See the Temple ,” Liahona , May 2021, 31) Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Psalm 24:3–4 is “Who shall stand in his holy place? He that hath clean hands, and a pure heart.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 104 ---\nDavid wrote a psalm expressing his desire to be forgiven for the sins he committed. He demonstrated his desire to sincerely repent. This lesson can help students understand that as they repent, the Savior can make them clean. Student preparation: Invite students to imagine themselves in the following situation: Imagine a friend of yours shares that they know they need to repent but wonder how. What would you want them to understand about repentance and the Savior’s role in overcoming sin? Possible Learning Activities Repentance The following activity provides students with an opportunity to reflect on their current understanding of repentance. You may want to display the instructions. Imagine that the following anonymous question from a youth was included in this month’s edition of For the Strength of Youth magazine: “I recently committed some very serious sins that I feel really bad about. I’m not really sure how to repent. To be honest, I am even wondering if I am beyond repentance. Any help?” In your study journal, using what you know about repentance, record what you feel would be helpful for this person to know and understand. As students read the anonymous question and record their responses, they may have additional questions that come to mind. You could invite them to write down any other questions they might have about repentance. Help them know that during the lesson they will have opportunities to study more about repentance. Testify that the Spirit can give them answers to their questions about repentance as they prayerfully seek answers through their study both in and out of class. Sincere repentance Ask students what they know about King David. You could ask them to share some of the great things he did as well as some of the sins he committed. Share any of the following context with students that they don’t mention in their summary. David “was guilty of grave crimes; but … he was capable of true contrition and was therefore able to find forgiveness, except in the murder of Uriah” (Bible Dictionary, “ David ”, see also Doctrine and Covenants 42:18 ). In Psalm 51 , David recorded a psalm to God in which he expressed his feelings of remorse following his sin with Bathsheba (see 2 Samuel 11–12 ). David’s humility and heartfelt desire to be restored to God’s grace and acceptance demonstrate the attitude of one who is seeking to truly repent. Students could first study Psalm 51 on their own looking for what they learn about repentance; then you could provide them with a way to share what they discovered and learned. Here are some instructions you could display for students to follow. You can adapt any of these instructions to better meet the needs and abilities of your students. Study Psalm 51:1–19 on your own looking for what we can learn from David’s psalm about (1) God, or (2) repentance. Mark what you find. Identify three phrases you marked and do one of the following: Write a statement of truth that the phrase is teaching about God or repentance. Find a cross-reference that confirms or deepens your understanding of what the phrase means. Find a quote from a Church leader that can help with understanding. Write a question about the phrase. One way you could help students prepare to share is to list 1–19 on the board. Invite students to write their names next to the verse numbers that contain a phrase they would be willing to share a cross-reference, quote, or question about. Once they have finished, you can invite students to share. As students share, you may want to list statements of truth on the board. Below is some content you may want to share as part of the discussion. The scriptures and statements are organized by verse grouping and bolded truths. Seek to follow any promptings of the Spirit you may receive about what to share or what to ask. Psalm 51:1–2, 7, 9 : God has power to cleanse me from my sin. Isaiah 1:18 President Jeffrey R. Holland of the Quorum of the Twelve Apostles testified: [H]owever many mistakes you feel you have made … or however far from home and family and God you feel you have traveled, I testify that you have not traveled beyond the reach of divine love. It is not possible for you to sink lower than the infinite light of Christ’s Atonement shines. (“ Laborers in the Vineyard ,” Ensign or Liahona , May 2012, 33) Psalm 51:3–4 : Acknowledging our sin before God is necessary for repentance. Mosiah 26:29–30 Doctrine and Covenants 58:42–43 The General Handbook explains: Repentance requires that sins be confessed to Heavenly Father. … When Church members commit serious sins, their repentance also includes confession to their bishop or stake president. He is then able to exercise the keys of the gospel of repentance on their behalf (see Doctrine and Covenants 13:1 ; 84:26–27 ; 107:18, 20 ). This helps them heal and return to the gospel path through the power of the Savior’s Atonement. … Voluntary confession shows that a person desires to repent. ( General Handbook: Serving in The Church of Jesus Christ of Latter-day Saints , 32.4.1, Gospel Library) Psalm 51:10–12 : As we repent, God can help us change, feel joy, and have the Holy Ghost with us. Mosiah 4:2–3 President Russell M. Nelson taught: When we choose to repent, we choose to change! We allow the Savior to transform us into the best version of ourselves. We choose to grow spiritually and receive joy—the joy of redemption in Him. When we choose to repent, we choose to become more like Jesus Christ! (“ We Can Do Better and Be Better ,” Liahona , May 2019, 67) Psalm 51:16–17 : I must have a broken and contrite heart and spirit to truly repent before God. 3 Nephi 9:19–20 Elder Neil L. Andersen of the Quorum of the Twelve Apostles explained: To have a broken heart is to be humble, repentant, and meek, eagerly receptive to the will of God. A contrite spirit puts one’s own interests in the hands of God, believing that His will, not our own, will help us become who we should become. ( The Divine Gift of Forgiveness [2019], 153) Explain repentance To help students demonstrate their understanding of sincere repentance and the Savior’s role in it, invite them to review what they have learned in class today. Look back at what you wrote at the beginning of class about the question in the For the Strength of Youth magazine. Using what you have learned today about sincere repentance, add two or three sentences to your initial response. Consider inviting a few willing students to share how they would respond to the question. Encourage students to share their message with a friend or family member they feel would be blessed to hear it. Consider concluding class by inviting students to turn to the Savior through repentance and testifying of His power to make us clean as we repent.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Psalms 1",
      "content": "1. Blessedisthe man thatwalkethnot in thecounselof the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of thescornful.\n2. But hisdelightisin thelawof theLord; and in his law doth hemeditateday and night.\n3. And he shall be like atreeplanted by the rivers of water, that bringeth forth his fruit in his season; his leaf also shall not wither; and whatsoever he doeth shallprosper.\n4. The ungodlyarenot so: butarelike thechaffwhich the wind driveth away.\n5. Therefore the ungodly shall not stand in the judgment, nor sinners in the congregation of the righteous.\n6. For theLordknoweth the way of therighteous: but the way of theungodlyshall perish.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Psalms 2",
      "content": "1. Why do theheathenrage, and the people imagine vain thing?\n2. Thekingsof the earth set themselves, and the rulers takecounseltogether, against theLord, and against hisanointed,saying,\n3. Let us break their bands asunder, and cast away their cords from us.\n4. He that sitteth in the heavens shalllaugh: the Lord shall have them in derision.\n5. Then shall he speak unto them in his wrath, and vex them in his sore displeasure.\n6. Yet have Iset my kingupon myholy hillof Zion.\n7. I will declare the decree: theLordhath said unto me, ThouartmySon; this day have I begotten thee.\n8. Ask of me, and I shall givetheethe heathenforthine inheritance, and the uttermost parts of the earthforthy possession.\n9. Thou shaltbreakthem with arod of iron; thou shaltdashthem in pieces like potters vessel.\n10. Be wise now therefore, O ye kings: be instructed, ye judges of the earth.\n11. Serve theLordwithfear, and rejoice with trembling.\n12. Kiss the Son, lest he be angry, and ye perishfromthe way, when his wrath is kindled but little.Blessedareall they that put theirtrustin him.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Psalms": {
      "1": {
        "verses": {
          "1": {
            "text": "Blessedisthe man thatwalkethnot in thecounselof the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of thescornful.",
            "citation": "(Psalms 1:1)"
          },
          "2": {
            "text": "But hisdelightisin thelawof theLord; and in his law doth hemeditateday and night.",
            "citation": "(Psalms 1:2)"
          },
          "3": {
            "text": "And he shall be like atreeplanted by the rivers of water, that bringeth forth his fruit in his season; his leaf also shall not wither; and whatsoever he doeth shallprosper.",
            "citation": "(Psalms 1:3)"
          },
          "4": {
            "text": "The ungodlyarenot so: butarelike thechaffwhich the wind driveth away.",
            "citation": "(Psalms 1:4)"
          },
          "5": {
            "text": "Therefore the ungodly shall not stand in the judgment, nor sinners in the congregation of the righteous.",
            "citation": "(Psalms 1:5)"
          },
          "6": {
            "text": "For theLordknoweth the way of therighteous: but the way of theungodlyshall perish.",
            "citation": "(Psalms 1:6)"
          }
        }
      },
      "2": {
        "verses": {
          "1": {
            "text": "Why do theheathenrage, and the people imagine vain thing?",
            "citation": "(Psalms 2:1)"
          },
          "2": {
            "text": "Thekingsof the earth set themselves, and the rulers takecounseltogether, against theLord, and against hisanointed,saying,",
            "citation": "(Psalms 2:2)"
          },
          "3": {
            "text": "Let us break their bands asunder, and cast away their cords from us.",
            "citation": "(Psalms 2:3)"
          },
          "4": {
            "text": "He that sitteth in the heavens shalllaugh: the Lord shall have them in derision.",
            "citation": "(Psalms 2:4)"
          },
          "5": {
            "text": "Then shall he speak unto them in his wrath, and vex them in his sore displeasure.",
            "citation": "(Psalms 2:5)"
          },
          "6": {
            "text": "Yet have Iset my kingupon myholy hillof Zion.",
            "citation": "(Psalms 2:6)"
          },
          "7": {
            "text": "I will declare the decree: theLordhath said unto me, ThouartmySon; this day have I begotten thee.",
            "citation": "(Psalms 2:7)"
          },
          "8": {
            "text": "Ask of me, and I shall givetheethe heathenforthine inheritance, and the uttermost parts of the earthforthy possession.",
            "citation": "(Psalms 2:8)"
          },
          "9": {
            "text": "Thou shaltbreakthem with arod of iron; thou shaltdashthem in pieces like potters vessel.",
            "citation": "(Psalms 2:9)"
          },
          "10": {
            "text": "Be wise now therefore, O ye kings: be instructed, ye judges of the earth.",
            "citation": "(Psalms 2:10)"
          },
          "11": {
            "text": "Serve theLordwithfear, and rejoice with trembling.",
            "citation": "(Psalms 2:11)"
          },
          "12": {
            "text": "Kiss the Son, lest he be angry, and ye perishfromthe way, when his wrath is kindled but little.Blessedareall they that put theirtrustin him.",
            "citation": "(Psalms 2:12)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 46019,
  "total_sources": 4,
  "generated_at": "2025-12-14T04:01:27.389379"
}