{
  "week_number": 33,
  "date_range": "Job 1–3",
  "title": ";12–14;19;21–24;38–40;42",
  "primary_scriptures": [
    {
      "book": "Job",
      "chapters": [
        "1",
        "2",
        "3"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Job",
      "chapters": [
        "1",
        "2",
        "3"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;12–14;19;21–24;38–40;42 ---\nIt’s natural to wonder why bad things happen to good people—or, for that matter, why good things happen to bad people. Why would God, who is just, allow that? The book of Job explores questions like these. Job was one of those good people to whom a lot of bad things happened. Because of Job’s trials, his friends wondered if he really was good after all. Job asserted his own righteousness and wondered if God really is just after all. But despite his suffering and wondering, Job maintained his integrity and faith in Jesus Christ. In the book of Job, faith is questioned and tested but never completely abandoned. That doesn’t mean all the questions are answered. But the book of Job teaches that until they are answered, questions can coexist with faith. And regardless of what happens in the meantime, we can say of our Lord, “Yet will I trust in him” (\nJob 13:15\n).\nFor an overview of the book of Job, see “\nJob\n” in the Guide to the Scriptures (Gospel Library).\nIdeas for Learning at Home and at Church\nJob 1–3\n;\n12–13\nI can trust God in all circumstances.\nThe opening chapters of Job emphasize, in a poetic way, Satan’s role as our adversary or accuser; they don’t describe an actual interaction between God and Satan. As you read what Satan said about Job (see\nJob 1:9–11\n;\n2:4–5\n), you might ask yourself, “Why do I remain faithful to God?” Why would it be dangerous to obey the Lord solely for the reason Satan suggested?\nWhat impresses you about Job’s responses to his trials? (see\nJob 1:20–22\n;\n2:9–10\n).\nJob’s friends suggested that God was punishing him (see\nJob 4–5\n;\n8\n;\n11\n). What problems do you see with this idea? Read Job’s response in\nchapters 12–13\n. What did Job know about God that enabled him to keep trusting? What do you know about God that helps you face challenges?\nJob 19\nJesus Christ is my Redeemer.\nSometimes we learn the most important truths during our most difficult times. Ponder the trials Job described in\nJob 19:1–22\nand the truths he proclaimed in\nverses 23–27\n. How do you know that your Redeemer lives? What difference does this knowledge make in your life?\nConsider singing or listening to a hymn about Jesus Christ, such as “\nI Know That My Redeemer Lives\n” (\nHymns\n, no. 136). What words from this hymn express your feelings about Him?\nSee also\nDoctrine and Covenants 121:1–12\n;\n122\n.\nJob 21–24\n“When he hath tried me, I shall come forth as gold.”\nIn\nJob 21–24\n, you’ll read a debate between Job and his friends. At the heart of this debate was a question many people have asked: Why do righteous people sometimes suffer?\nAlthough we don’t have all the answers, in the restored gospel of Jesus Christ, we have some truths that can help us make sense of adversity and suffering. Below are latter-day scriptures that contain some of these truths. What do these scriptures teach you about Heavenly Father and His plan?\n2 Nephi 2:11–13\nMosiah 23:21–23\n;\n24:10–16\nEther 12:27\nDoctrine and Covenants 58:3–5\nAbraham 3:22–26\nYou could also read President Spencer W. Kimball’s teachings about adversity in “\nTragedy or Destiny?\n” (\nTeachings of Presidents of the Church: Spencer W. Kimball\n[2011]), 11–21).\nBased on what you have studied, how might you answer a question like “Why does God allow righteous people to suffer?”\nCalm and Stars\n, by Yongsung Kim. Image courtesy of havenlight.com\nJob 38–40\n;\n42\nGod’s perspective is greater than mine.\nFrustrated with his friends’ accusations (see\nJob 16:1–5\n;\n19:1–3\n), Job repeatedly asked God why he had to suffer so much (see\nJob 19:6–7\n;\n23:1–9\n;\n31\n). The Lord did not give a clear reason in the book of Job. But He did teach an important message in\nchapters 38–40\n. How would you summarize that message? For example, what do you learn from the Lord’s questions in\nJob 38:1–7, 18–24\n?\nYou’ll notice that the Lord spoke to Job about some of His creations and other mighty works (see\nJob 38–39\n). You might look at some of those creations (or pictures of them). How do these things help you think differently about God? about your trials? How did they change Job’s perspective? (see\nJob 42:1–6\n; see also\nMoses 1:8–10\n).\nHere are two general conference messages that can help change our perspective: Tamara W. Runia, “\nSeeing God’s Family through the Overview Lens\n” (\nLiahona\n, Nov. 2023, 62–69); Russell M. Nelson, “\nThink Celestial!\n” (\nLiahona\n, Nov. 2023, 117–20). In either message, look for something that you’ll want to remember the next time your trials seem overwhelming. How will you remind yourself of what you learned?\nBe creative.\nLearning doesn’t have to consist only of reading, thinking, and talking. Sometimes the most memorable learning comes in physically active ways. For example, when you read about how the Lord changed Job’s perspective in\nJob 38–40\n, you might take a walk and look at some of the Lord’s creations, large and small. Or you might look at an object from different perspectives—from above, below, up close, far away, and so on.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nJob 1–2\n;\n12\n;\n19\nFaith in Jesus Christ will help me during hard times.\nEncourage your children to tell you what they know about Job. If they need help, you could point them to\nJob 1:1, 13–22\n;\n2:7–10\nor to “\nJob\n” (in\nOld Testament Stories\n, 145–47). How did Job respond to challenges? (see\nJob 1:21\n;\n2:10\n).\n1:55\nJob\nJob was faithful in his challenges because of what he knew about the Lord. Maybe you and your children could look at pictures of Jesus Christ interacting with others (such as the one below or pictures in the\nGospel Art Book\n). Talk about what you know about Him and what He is like. Here are some verses that show what Job knew about the Lord:\nJob 12:10, 13, 16\n;\n19:25–27\n. Why is it valuable to know these things about Him?\nHe Healed Them All\n, by Michael Malm\nJob 14:14\nBecause of Jesus Christ, I will live again after I die.\nJob asked an important question in\nJob 14:14\n. Maybe you and your children could take turns sharing how you would answer Job. You could look for ideas in\nAlma 11:42–44\n, in the video “In a Coming Day” (Gospel Library), or in a song about the Resurrection, such as “\nDid Jesus Really Live Again?\n” (\nChildren’s Songbook\n, 64).\n1:11\n#BECAUSEofHIM: An Easter Message of Hope and Triumph\nJob 16:1–5\n;\n22:5\nGood friends uplift and encourage each other.\nWhen Job was sad, his friends said that God was punishing him because he had sinned (see\nJob 22:5\n). If we were Job’s friends, how would we try to help him? How can our words help others when they are sad? (see\nJob 16:5\n). Consider showing one or more of the pictures in this outline as you discuss these questions.\nConsider asking your children to list some qualities of a good friend and to name a friend who has these qualities. Then you could look at a picture of Jesus Christ. In what ways is Jesus a good friend to each of us? You might think of someone who’s going through a hard time. Plan how you will be a Christlike friend to them.\nJob 19:23–27\nJesus Christ is my Redeemer.\nAfter reading\nJob 19:23–27\n, you and your children could talk about how you know that our Redeemer lives. You might work together to put your testimony (or drawings of the Savior) in a book (see\nverse 23\n).\nYou could also sing a song that testifies of the Savior, such as “\nI Know That My Redeemer Lives\n” (\nHymns\n, no. 136). Share phrases from the hymn that strengthen your faith in Him. Why is it important to know that Jesus Christ lives?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 33: Lesson 97: Lesson 97—Job 1–3; 12–13This lesson can help students feel an increased desire to trust Heavenly Father and Jesus Christ during trials.; Lesson 98: Lesson 98—Job 14; 19This lesson can help students understand the hope that comes through the Resurrection of Jesus Christ... ---\n\n--- Lesson 97 ---\nHave you ever struggled to be faithful to God during difficult times? Job was a faithful man who enjoyed a blessed life. Unexpectedly, Job lost his wealth, children, and health. However, Job did not lose his faith in Jesus Christ. This lesson can help students feel an increased desire to trust Heavenly Father and Jesus Christ during trials. Student preparation: Invite students to reflect on how they have responded to their trials. Ask them to come to class prepared to discuss their experiences. Possible Learning Activities Before beginning today’s lesson, it could help to tell students that the next several books ( Job–Song of Solomon ) are known as the books of poetry or wisdom literature. These books are written in poetic form and are not intended to convey history. Like other scripture, these books can point us toward Jesus Christ and help us follow Him. (Note: Joseph Smith described Song of Solomon as “not inspired writings” [ Joseph Smith Translation, note on Song of Solomon ].) How we respond to trials Consider beginning class by writing on the board “Person A” and “Person B.” Invite students to come up with a scenario for each person, one describing a long-term trial and one describing a short-term trial. The following prompts might help. Ever since Person A was a child, they have had to deal with … Today just keeps getting worse for Person B. It started with … After students have established the two scenarios, invite them to discuss the following questions for “Person A” and “Person B.” They could do this in pairs or small groups. What would it look like if this person responded to this trial poorly? What would it look like if this person responded to this trial well? What would it look like if this person responded to this trial with trust in Heavenly Father? After students have had time to discuss, help them think about how they respond to their own trials. The following is one way you could do this. On a scale of 1–5 (1 being not true of you at all and 5 being very true of you), think about how true the following statements are of you: I respond well to trials. I find strength from Heavenly Father and Jesus Christ during trials. Be open to feeling or learning things about Heavenly Father and Jesus Christ that could help you face your trials with increased trust in them. Job’s life Read Job 1:1–3 , looking for what you learn about Job. (Note: the word perfect translates to “whole, complete, having integrity.”) What did you find? You might write students’ answers on the board. Before continuing the story of Job, consider reading or summarizing the following. It is important to understand that Job was a real person (see Doctrine and Covenants 121:10 ), but Job’s life is told using some poetic elements. For example, as Job’s story begins, the Lord and Satan are described as having two conversations. These are not actual interactions between the Lord and Satan but illustrate Satan’s role as our adversary or enemy. They could be a poetic way of preparing the reader for what follows in Job’s life—his afflictions, temptations, and loss of worldly goods. To help students understand the first conversation, you could ask three volunteers to read. One volunteer could read the words of the narrator, another the words of the Lord, and the third the words of Satan. Ask students to read the words without dramatizing them in any way. Consider displaying the following questions for students to think about as they listen. Read Job 1:6–12 , looking for answers to the following questions: What claim did Satan make about Job’s righteousness? What did Satan want to happen to Job? Allow students to share their answers. If needed, help students understand that Satan claimed that Job was only righteous because the Lord blessed him. Satan wanted Job’s blessings taken away to prove that claim. Job’s example For the next part of Job’s story, you could create a chart like the following on the board. You could then organize students into pairs or small groups to complete the chart. Ask groups to discuss the questions that follow. It might be helpful to walk around to help and encourage students. (Note: Boils are painful skin sores. Job “rent” or tore his clothes and shaved his head as signs of mourning.) What did Job suffer? How did Job respond? What did Job suffer? Read Job 1:13–19 ; 2:7 . How did Job respond? Read Job 1:20–22 ; 2:9–10 ; 13:15 ; 23:10 . What stands out to you about Job’s response? What might Job have understood about God to respond the way he did? Students might point out that Job acknowledged his blessings had come from God (see Job 1:21 ), understood that trials are a part of God’s plan (see Job 2:10 ), and knew God was aware of him and that his trials would refine him (see Job 23:10 ). After students complete the activity, help them identify a truth by asking a question like the following. What can we learn from Job’s example that could help us during trials? Among other answers, students might identify something like: we can choose to trust God during our trials. Consider inviting students to find and mark where they see this truth in Job 13:15 . Examples in scripture Think of ways that you can help students increase their trust in Heavenly Father during their trials. One way is to have students look up scriptures in which people explained their reasons for trusting God during a trial. Students could do the following activity. Find an example in the scriptures where someone chose to trust God during their trials. Mark words or phrases that explain why this person trusted God. Prepare to explain how the concepts you marked have helped or could help you trust God. If students need help identifying scripture accounts, you could invite them to search “trust” in Gospel Library. Or you could provide examples such as: Daniel 2:19–23 —Daniel faced King Nebuchadnezzar’s command that all the wise men in the kingdom (including Daniel) would be killed if no one could interpret his dream. 2 Nephi 4:17–23 —Nephi mourned over his own weaknesses and felt inadequate. After sufficient time, invite students to share in small groups or with the class what they found. You could also show students “ Mountains to Climb ” (5:05), available at ChurchofJesusChrist.org . Have them look for what President Eyring shared that could increase their trust in Heavenly Father and Jesus Christ during trials. 5:5 Conclusion You might conclude class by inviting students to write themselves a note or to send a text to themselves answering the following question. If they write a note, invite them to fold it up and put it in their pocket or someplace where they will see it later that day. You might play soft instrumental music as students write. What is something you felt today that has helped you want to trust Heavenly Father and Jesus Christ during trials?\n\n\n--- Lesson 98 ---\nIt can be difficult to find hope during challenges, including the death of loved ones. Heavenly Father sent His Son to perform the Atonement, which finished with the Savior’s Resurrection from the tomb. Because of Jesus Christ’s Resurrection, we can have hope. This lesson can help students understand the hope that comes through the Resurrection of Jesus Christ. Student preparation: Invite students to listen to or read the lyrics of the hymn “ I Know That My Redeemer Lives .” They could select a favorite phrase from the hymn that could bring hope to someone going through difficulties. Possible Learning Activities The greatest event in history Display the following question and invite students to discuss it in small groups. What are some events that people might say are the most important in human history? Why? President Ezra Taft Benson (1899–1994) shared the following: The greatest events of history are those that affect the greatest number of people for the longest periods. By this standard, no event could be more important to individuals or nations than the resurrection of the Master. ( Teachings of Presidents of the Church: Ezra Taft Benson [2014], 94 ) Take a moment to ponder what you know about the Savior’s Resurrection and why it is important to you. You might also think about why the Savior’s Resurrection could be considered the most important event in history. Encourage students to invite the Holy Ghost to help them better understand the Resurrection of Jesus Christ and the hope it can bring. Job’s questions If you taught Lesson 97: “ Job 1–3; 12–13 ,” students could share what they remember about Job’s trials. Or they could read the following paragraph. Job was a righteous man who experienced severe afflictions. He lost all his property, all 10 of his children were killed when a house collapsed on them, and he suffered terrible physical pain. What questions might you have had if you were Job? Read Job 14:7–14 , marking the two questions Job had as he searched for hope in his afflictions. If students need help understanding Job’s question in verse 10 , you could explain that Job is asking, “Where do we go when we die?” When have you heard or asked similar questions? You might encourage students to think about how they would answer Job’s questions. To see how they could answer Job’s question in verse 10 , students could cross-reference or link verse 10 with Alma 40:6, 11–14 . Explain that the Book of Mormon prophet Alma taught that after we die, our spirits dwell in a state of happiness or misery until the Resurrection. Invite students to think about how they might respond to Job’s question in verse 14 . As they ponder, you or a student can read the following statement. Alternatively, you could watch “ Until We Meet Again ,” available at ChurchofJesusChrist.org , from time code 0:00 to 2:28. 3:40 Arthur Patton, one of President Thomas S. Monson’s (1927–2018) childhood friends, was killed in World War II. President Monson shared his experience visiting Arthur’s home after hearing the news: With a prayer in my heart, I approached the familiar walkway to the Patton home, wondering what words of comfort could come from the lips of a mere boy. The door opened, and Mrs. Patton embraced me as she would her own son. … [After praying together], Mrs. Patton gazed into my eyes and spoke: “Tommy, I belong to no church, but you do. Tell me, will Arthur live again?” (“ Mrs. Patton—The Story Continues ,” Ensign or Liahona , Nov 2007, 22) Imagine you were in President Monson’s situation. In your study journal, write a short paragraph to answer Mrs. Patton’s question. Encourage students to add to what they have written as they continue to learn about the Resurrection of Jesus Christ. “I know that my Redeemer liveth” Read Job 19:23–27 , looking for the answer Job gives to his questions. What did Job know to be true? Students might share something like because of Jesus Christ, we will be resurrected and see God again . What can verses 23–24 teach us about how Job felt about this truth? How might this knowledge about Jesus Christ have influenced Job as he endured his trials? How can this knowledge help us? Students could read the following statement on their own and then share what stands out to them from it. President Dallin H. Oaks of the First Presidency shared some ways our knowledge of the Resurrection of Jesus Christ can bring us hope: The Resurrection from the dead is the reassuring personal pillar of our faith. It adds meaning to our doctrine, motivation to our behavior, and hope for our future. … The Resurrection gives us the perspective and the strength to endure the mortal challenges faced by each of us and those we love. It gives us a new way to view the physical, mental, or emotional deficiencies we have at birth or acquire during mortal life. It gives us the strength to endure sorrows, failures, and frustrations. Because each of us has an assured resurrection, we know that these mortal deficiencies and oppositions are only temporary. (“ What Has Our Savior Done for Us? ,” Liahona , May 2021, 75) When have you seen someone gain hope through their faith in Jesus Christ and His Resurrection? Understanding the Resurrection Before displaying the following instructions, you might discuss how we can strengthen the words we speak or write by connecting them with the words of the Savior and His prophets. One way we can do this is by quoting phrases from scriptures. Do the following with the paragraph you wrote in response to Mrs. Patton’s question: Add a sentence or two using something you learned or felt today about Jesus Christ and the hope available to us because of His Resurrection. Include a phrase from Job 19:25–27 . Add one or two additional sentences using words or phrases from other scriptures or statements from Church leaders. To do this, you could search “Resurrection” in Gospel Library, Guide to the Scriptures , or Topics and Questions . You could also review pages 48 , 55–56 , and 58 of Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ (2023). If needed, you could provide some of the following references: 1 Corinthians 15:20–22 ; Mosiah 16:7–8 ; Alma 11:42–44 ; Helaman 14:17 ; Moroni 7:41 You might show “ Because of Him ” (2:44), available at ChurchofJesusChrist.org , and invite students to add to what they wrote. 2:44 When students have finished, place them in small groups. Have the students share with their groups what they wrote about the Resurrection of Jesus Christ. As their classmates share, students could add to their own paragraphs. To conclude class, you could watch the remainder of “ Until We Meet Again ,” from time code 2:28 to 3:39, to hear what President Monson said to Mrs. Patton. 3:40\n\n\n--- Lesson 99 ---\nHave you ever wondered why God allows suffering? Are there other questions you have asked during your trials? In vain, Job and his friends tried to determine the reasons for Job’s suffering. While God did not give a reason, He did help Job see his trials in a higher and holier way. This lesson can provide students with an opportunity to help others view their trials with an eternal perspective. Student preparation: Provide students with the question “Why does God allow us to experience trials?” Invite them to find answers using divinely appointed sources, such as the scriptures, teachings from Church leaders, or their parents. They could also ask family members or friends how they would answer the question. Possible Learning Activities Why do bad things happen? Consider beginning class by writing the following questions on the board. Invite the class to create two more questions people might ask while trying to understand their trials. Add these two questions to the board and number them 5 and 6 . These questions will be referenced throughout the lesson. “I must be doing everything wrong. Why else is life so hard for me?” “If I’m following the gospel, why am I not able to avoid trials and suffering?” “I thought God loved me. Why is He making my life so difficult?” “If God is real, why doesn’t He stop peoples’ suffering?” It could help to acknowledge that some students might have asked similar questions during trials. Encourage students to be kind and respectful as they discuss the following question. What are some assumptions people might be making when they ask questions such as these? After the discussion you could invite students to ponder the following question. They could write their responses in their study journals. Do you think you could help someone turn to the Lord and find answers to these types of questions? Why or why not? Studying divinely appointed sources can invite the Holy Ghost into our learning. Pay attention to insights He might teach you as you read the scriptures and statements in this lesson. Consider how these insights could help others answer questions about their trials. Doing so might help you gain greater understanding of your own trials. Job and his friends Consider displaying an image of Job, such as the one at the beginning of this lesson. Invite students to briefly discuss with a partner what they remember about the story of Job. You could then share the following: During Job’s trials he had three friends visit him. Job and his friends tried to determine the reasons for his suffering. Their limited perspective led to inaccurate assumptions. Using the verses below, consider inviting the left side of the class to study what Job believed about his suffering and the right side to study what Job’s friend, Eliphaz, believed. Or you could summarize these verses and move on to the heading “An eternal perspective.” Summarizing would allow more time for students to study the conclusion of Job’s story and to discuss the handout. Read Job 19:6–11 , looking for what Job assumed about God. Read Job 22:5–10 , looking for what Eliphaz assumed about Job. What inaccurate assumptions did each person have? If students need help understanding what they read, you could explain that Job felt God had caused his trials and had abandoned him. Eliphaz falsely accused Job of mistreating others. He believed Job’s suffering was the result of wickedness. An eternal perspective As Job continued struggling through his trials, God spoke to him. God asked Job many questions about the creation of the world, which Job could not answer (see Job 38–41 ). Read Job 38:4–7 , looking for examples of the questions God asked Job. Elder Dale G. Renlund of the Quorum of the Twelve Apostles explained God’s response to Job’s inability to answer Him: It was as if God had patiently and kindly said to Job, “If you cannot answer even one of my questions about the earth that I have created, is it possible that eternal laws exist that you do not understand? Are there assumptions you have made that are invalid? Do you understand my motives and how my plan of salvation and exaltation works? And can you foresee your future destiny?” God in His wisdom knows that a vital part of our mortal experience is to not know everything. There is something about trusting Him that allows us to progress to become like Him. (“ Trust God and Let Him Prevail ,” Liahona , Aug. 2022, 5) What does this statement help you understand about God and trials? As students respond, consider pointing out that God did not provide a reason for Job’s suffering. Read Job 42:1–6 , looking for Job’s response to the Lord. What stands out to you from Job’s response? What have you learned from Job’s story that can help us better understand our trials? Students might identify many truths, including God can help us view our trials with an eternal perspective . Job acknowledged his limited understanding compared with God’s knowledge and Job changed the way he viewed his trials. He came to know his suffering was not a result of sin or divine punishment. God blessed Job greatly at the end of his life (see Job 42:12–13 ). Understanding trials We might not always understand the reasons for our challenges. However, the Lord has provided divine sources that can help us view our trials with an eternal perspective. Consider providing students with the handout titled “ Understanding Trials .” Students could complete this on their own to allow for personal reflection. Or they could study the handout in pairs or small groups to increase comprehension or student engagement. Instead of using the handout, you could invite students to search words such as “adversity” or “trials” in the Gospel Library to gain insights that can help them better understand trials. Open PDF When students complete the handout, consider inviting them to reread the six questions about trials that were written on the board at the beginning of class. You could then lead a class discussion with questions such as the following: What did you learn that could help someone with these questions view their trials with an eternal perspective? How have you seen the teachings you studied be true in your own trials? What are you learning about Heavenly Father and Jesus Christ as you listen to what others are sharing? You could also watch “ Why Do Bad Things Happen to Good People? ” (4:39), available at ChurchofJesusChrist.org . Invite students to look for what Brock learned from his trials. 4:39 Conclusion Allow students to role-play helping others view their trials with an eternal perspective. You could do this by placing students in pairs. Provide each pair with a six-sided die. Display the following instructions. You could modify the instructions if dice are unavailable. Refer to the six questions about trials written on the board as you and your partner complete the following activity: Choose one person to roll the die. If you rolled the die, ask your partner the question on the board that corresponds with the number you rolled. (For example, if you rolled one you would ask, “I must be doing everything wrong. Why else is life so hard for me?” ) If you did not roll the die, answer the question your partner asked. Use insights you gained from class to help your partner view their trials with an eternal perspective. Include thoughts or feelings you have about Heavenly Father or Jesus Christ. Switch responsibilities and repeat the activity one more time. If the same number gets rolled, roll again. Consider concluding by adding your witness to the things students have shared today.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";12–14;19;21–24;38–40;42",
      "content": "It’s natural to wonder why bad things happen to good people—or, for that matter, why good things happen to bad people. Why would God, who is just, allow that? The book of Job explores questions like these. Job was one of those good people to whom a lot of bad things happened. Because of Job’s trials, his friends wondered if he really was good after all. Job asserted his own righteousness and wondered if God really is just after all. But despite his suffering and wondering, Job maintained his integrity and faith in Jesus Christ. In the book of Job, faith is questioned and tested but never completely abandoned. That doesn’t mean all the questions are answered. But the book of Job teaches that until they are answered, questions can coexist with faith. And regardless of what happens in the meantime, we can say of our Lord, “Yet will I trust in him” (\nJob 13:15\n).\nFor an overview of the book of Job, see “\nJob\n” in the Guide to the Scriptures (Gospel Library).\nIdeas for Learning at Home and at Church\nJob 1–3\n;\n12–13\nI can trust God in all circumstances.\nThe opening chapters of Job emphasize, in a poetic way, Satan’s role as our adversary or accuser; they don’t describe an actual interaction between God and Satan. As you read what Satan said about Job (see\nJob 1:9–11\n;\n2:4–5\n), you might ask yourself, “Why do I remain faithful to God?” Why would it be dangerous to obey the Lord solely for the reason Satan suggested?\nWhat impresses you about Job’s responses to his trials? (see\nJob 1:20–22\n;\n2:9–10\n).\nJob’s friends suggested that God was punishing him (see\nJob 4–5\n;\n8\n;\n11\n). What problems do you see with this idea? Read Job’s response in\nchapters 12–13\n. What did Job know about God that enabled him to keep trusting? What do you know about God that helps you face challenges?\nJob 19\nJesus Christ is my Redeemer.\nSometimes we learn the most important truths during our most difficult times. Ponder the trials Job described in\nJob 19:1–22\nand the truths he proclaimed in\nverses 23–27\n. How do you know that your Redeemer lives? What difference does this knowledge make in your life?\nConsider singing or listening to a hymn about Jesus Christ, such as “\nI Know That My Redeemer Lives\n” (\nHymns\n, no. 136). What words from this hymn express your feelings about Him?\nSee also\nDoctrine and Covenants 121:1–12\n;\n122\n.\nJob 21–24\n“When he hath tried me, I shall come forth as gold.”\nIn\nJob 21–24\n, you’ll read a debate between Job and his friends. At the heart of this debate was a question many people have asked: Why do righteous people sometimes suffer?\nAlthough we don’t have all the answers, in the restored gospel of Jesus Christ, we have some truths that can help us make sense of adversity and suffering. Below are latter-day scriptures that contain some of these truths. What do these scriptures teach you about Heavenly Father and His plan?\n2 Nephi 2:11–13\nMosiah 23:21–23\n;\n24:10–16\nEther 12:27\nDoctrine and Covenants 58:3–5\nAbraham 3:22–26\nYou could also read President Spencer W. Kimball’s teachings about adversity in “\nTragedy or Destiny?\n” (\nTeachings of Presidents of the Church: Spencer W. Kimball\n[2011]), 11–21).\nBased on what you have studied, how might you answer a question like “Why does God allow righteous people to suffer?”\nCalm and Stars\n, by Yongsung Kim. Image courtesy of havenlight.com\nJob 38–40\n;\n42\nGod’s perspective is greater than mine.\nFrustrated with his friends’ accusations (see\nJob 16:1–5\n;\n19:1–3\n), Job repeatedly asked God why he had to suffer so much (see\nJob 19:6–7\n;\n23:1–9\n;\n31\n). The Lord did not give a clear reason in the book of Job. But He did teach an important message in\nchapters 38–40\n. How would you summarize that message? For example, what do you learn from the Lord’s questions in\nJob 38:1–7, 18–24\n?\nYou’ll notice that the Lord spoke to Job about some of His creations and other mighty works (see\nJob 38–39\n). You might look at some of those creations (or pictures of them). How do these things help you think differently about God? about your trials? How did they change Job’s perspective? (see\nJob 42:1–6\n; see also\nMoses 1:8–10\n).\nHere are two general conference messages that can help change our perspective: Tamara W. Runia, “\nSeeing God’s Family through the Overview Lens\n” (\nLiahona\n, Nov. 2023, 62–69); Russell M. Nelson, “\nThink Celestial!\n” (\nLiahona\n, Nov. 2023, 117–20). In either message, look for something that you’ll want to remember the next time your trials seem overwhelming. How will you remind yourself of what you learned?\nBe creative.\nLearning doesn’t have to consist only of reading, thinking, and talking. Sometimes the most memorable learning comes in physically active ways. For example, when you read about how the Lord changed Job’s perspective in\nJob 38–40\n, you might take a walk and look at some of the Lord’s creations, large and small. Or you might look at an object from different perspectives—from above, below, up close, far away, and so on.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nJob 1–2\n;\n12\n;\n19\nFaith in Jesus Christ will help me during hard times.\nEncourage your children to tell you what they know about Job. If they need help, you could point them to\nJob 1:1, 13–22\n;\n2:7–10\nor to “\nJob\n” (in\nOld Testament Stories\n, 145–47). How did Job respond to challenges? (see\nJob 1:21\n;\n2:10\n).\n1:55\nJob\nJob was faithful in his challenges because of what he knew about the Lord. Maybe you and your children could look at pictures of Jesus Christ interacting with others (such as the one below or pictures in the\nGospel Art Book\n). Talk about what you know about Him and what He is like. Here are some verses that show what Job knew about the Lord:\nJob 12:10, 13, 16\n;\n19:25–27\n. Why is it valuable to know these things about Him?\nHe Healed Them All\n, by Michael Malm\nJob 14:14\nBecause of Jesus Christ, I will live again after I die.\nJob asked an important question in\nJob 14:14\n. Maybe you and your children could take turns sharing how you would answer Job. You could look for ideas in\nAlma 11:42–44\n, in the video “In a Coming Day” (Gospel Library), or in a song about the Resurrection, such as “\nDid Jesus Really Live Again?\n” (\nChildren’s Songbook\n, 64).\n1:11\n#BECAUSEofHIM: An Easter Message of Hope and Triumph\nJob 16:1–5\n;\n22:5\nGood friends uplift and encourage each other.\nWhen Job was sad, his friends said that God was punishing him because he had sinned (see\nJob 22:5\n). If we were Job’s friends, how would we try to help him? How can our words help others when they are sad? (see\nJob 16:5\n). Consider showing one or more of the pictures in this outline as you discuss these questions.\nConsider asking your children to list some qualities of a good friend and to name a friend who has these qualities. Then you could look at a picture of Jesus Christ. In what ways is Jesus a good friend to each of us? You might think of someone who’s going through a hard time. Plan how you will be a Christlike friend to them.\nJob 19:23–27\nJesus Christ is my Redeemer.\nAfter reading\nJob 19:23–27\n, you and your children could talk about how you know that our Redeemer lives. You might work together to put your testimony (or drawings of the Savior) in a book (see\nverse 23\n).\nYou could also sing a song that testifies of the Savior, such as “\nI Know That My Redeemer Lives\n” (\nHymns\n, no. 136). Share phrases from the hymn that strengthen your faith in Him. Why is it important to know that Jesus Christ lives?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 33: Lesson 97: Lesson 97—Job 1–3; 12–13This lesson can help students feel an increased desire to trust Heavenly Father and Jesus Christ during trials.; Lesson 98: Lesson 98—Job 14; 19This lesson can help students understand the hope that comes through the Resurrection of Jesus Christ...",
      "content": "\n--- Lesson 97 ---\nHave you ever struggled to be faithful to God during difficult times? Job was a faithful man who enjoyed a blessed life. Unexpectedly, Job lost his wealth, children, and health. However, Job did not lose his faith in Jesus Christ. This lesson can help students feel an increased desire to trust Heavenly Father and Jesus Christ during trials. Student preparation: Invite students to reflect on how they have responded to their trials. Ask them to come to class prepared to discuss their experiences. Possible Learning Activities Before beginning today’s lesson, it could help to tell students that the next several books ( Job–Song of Solomon ) are known as the books of poetry or wisdom literature. These books are written in poetic form and are not intended to convey history. Like other scripture, these books can point us toward Jesus Christ and help us follow Him. (Note: Joseph Smith described Song of Solomon as “not inspired writings” [ Joseph Smith Translation, note on Song of Solomon ].) How we respond to trials Consider beginning class by writing on the board “Person A” and “Person B.” Invite students to come up with a scenario for each person, one describing a long-term trial and one describing a short-term trial. The following prompts might help. Ever since Person A was a child, they have had to deal with … Today just keeps getting worse for Person B. It started with … After students have established the two scenarios, invite them to discuss the following questions for “Person A” and “Person B.” They could do this in pairs or small groups. What would it look like if this person responded to this trial poorly? What would it look like if this person responded to this trial well? What would it look like if this person responded to this trial with trust in Heavenly Father? After students have had time to discuss, help them think about how they respond to their own trials. The following is one way you could do this. On a scale of 1–5 (1 being not true of you at all and 5 being very true of you), think about how true the following statements are of you: I respond well to trials. I find strength from Heavenly Father and Jesus Christ during trials. Be open to feeling or learning things about Heavenly Father and Jesus Christ that could help you face your trials with increased trust in them. Job’s life Read Job 1:1–3 , looking for what you learn about Job. (Note: the word perfect translates to “whole, complete, having integrity.”) What did you find? You might write students’ answers on the board. Before continuing the story of Job, consider reading or summarizing the following. It is important to understand that Job was a real person (see Doctrine and Covenants 121:10 ), but Job’s life is told using some poetic elements. For example, as Job’s story begins, the Lord and Satan are described as having two conversations. These are not actual interactions between the Lord and Satan but illustrate Satan’s role as our adversary or enemy. They could be a poetic way of preparing the reader for what follows in Job’s life—his afflictions, temptations, and loss of worldly goods. To help students understand the first conversation, you could ask three volunteers to read. One volunteer could read the words of the narrator, another the words of the Lord, and the third the words of Satan. Ask students to read the words without dramatizing them in any way. Consider displaying the following questions for students to think about as they listen. Read Job 1:6–12 , looking for answers to the following questions: What claim did Satan make about Job’s righteousness? What did Satan want to happen to Job? Allow students to share their answers. If needed, help students understand that Satan claimed that Job was only righteous because the Lord blessed him. Satan wanted Job’s blessings taken away to prove that claim. Job’s example For the next part of Job’s story, you could create a chart like the following on the board. You could then organize students into pairs or small groups to complete the chart. Ask groups to discuss the questions that follow. It might be helpful to walk around to help and encourage students. (Note: Boils are painful skin sores. Job “rent” or tore his clothes and shaved his head as signs of mourning.) What did Job suffer? How did Job respond? What did Job suffer? Read Job 1:13–19 ; 2:7 . How did Job respond? Read Job 1:20–22 ; 2:9–10 ; 13:15 ; 23:10 . What stands out to you about Job’s response? What might Job have understood about God to respond the way he did? Students might point out that Job acknowledged his blessings had come from God (see Job 1:21 ), understood that trials are a part of God’s plan (see Job 2:10 ), and knew God was aware of him and that his trials would refine him (see Job 23:10 ). After students complete the activity, help them identify a truth by asking a question like the following. What can we learn from Job’s example that could help us during trials? Among other answers, students might identify something like: we can choose to trust God during our trials. Consider inviting students to find and mark where they see this truth in Job 13:15 . Examples in scripture Think of ways that you can help students increase their trust in Heavenly Father during their trials. One way is to have students look up scriptures in which people explained their reasons for trusting God during a trial. Students could do the following activity. Find an example in the scriptures where someone chose to trust God during their trials. Mark words or phrases that explain why this person trusted God. Prepare to explain how the concepts you marked have helped or could help you trust God. If students need help identifying scripture accounts, you could invite them to search “trust” in Gospel Library. Or you could provide examples such as: Daniel 2:19–23 —Daniel faced King Nebuchadnezzar’s command that all the wise men in the kingdom (including Daniel) would be killed if no one could interpret his dream. 2 Nephi 4:17–23 —Nephi mourned over his own weaknesses and felt inadequate. After sufficient time, invite students to share in small groups or with the class what they found. You could also show students “ Mountains to Climb ” (5:05), available at ChurchofJesusChrist.org . Have them look for what President Eyring shared that could increase their trust in Heavenly Father and Jesus Christ during trials. 5:5 Conclusion You might conclude class by inviting students to write themselves a note or to send a text to themselves answering the following question. If they write a note, invite them to fold it up and put it in their pocket or someplace where they will see it later that day. You might play soft instrumental music as students write. What is something you felt today that has helped you want to trust Heavenly Father and Jesus Christ during trials?\n\n\n--- Lesson 98 ---\nIt can be difficult to find hope during challenges, including the death of loved ones. Heavenly Father sent His Son to perform the Atonement, which finished with the Savior’s Resurrection from the tomb. Because of Jesus Christ’s Resurrection, we can have hope. This lesson can help students understand the hope that comes through the Resurrection of Jesus Christ. Student preparation: Invite students to listen to or read the lyrics of the hymn “ I Know That My Redeemer Lives .” They could select a favorite phrase from the hymn that could bring hope to someone going through difficulties. Possible Learning Activities The greatest event in history Display the following question and invite students to discuss it in small groups. What are some events that people might say are the most important in human history? Why? President Ezra Taft Benson (1899–1994) shared the following: The greatest events of history are those that affect the greatest number of people for the longest periods. By this standard, no event could be more important to individuals or nations than the resurrection of the Master. ( Teachings of Presidents of the Church: Ezra Taft Benson [2014], 94 ) Take a moment to ponder what you know about the Savior’s Resurrection and why it is important to you. You might also think about why the Savior’s Resurrection could be considered the most important event in history. Encourage students to invite the Holy Ghost to help them better understand the Resurrection of Jesus Christ and the hope it can bring. Job’s questions If you taught Lesson 97: “ Job 1–3; 12–13 ,” students could share what they remember about Job’s trials. Or they could read the following paragraph. Job was a righteous man who experienced severe afflictions. He lost all his property, all 10 of his children were killed when a house collapsed on them, and he suffered terrible physical pain. What questions might you have had if you were Job? Read Job 14:7–14 , marking the two questions Job had as he searched for hope in his afflictions. If students need help understanding Job’s question in verse 10 , you could explain that Job is asking, “Where do we go when we die?” When have you heard or asked similar questions? You might encourage students to think about how they would answer Job’s questions. To see how they could answer Job’s question in verse 10 , students could cross-reference or link verse 10 with Alma 40:6, 11–14 . Explain that the Book of Mormon prophet Alma taught that after we die, our spirits dwell in a state of happiness or misery until the Resurrection. Invite students to think about how they might respond to Job’s question in verse 14 . As they ponder, you or a student can read the following statement. Alternatively, you could watch “ Until We Meet Again ,” available at ChurchofJesusChrist.org , from time code 0:00 to 2:28. 3:40 Arthur Patton, one of President Thomas S. Monson’s (1927–2018) childhood friends, was killed in World War II. President Monson shared his experience visiting Arthur’s home after hearing the news: With a prayer in my heart, I approached the familiar walkway to the Patton home, wondering what words of comfort could come from the lips of a mere boy. The door opened, and Mrs. Patton embraced me as she would her own son. … [After praying together], Mrs. Patton gazed into my eyes and spoke: “Tommy, I belong to no church, but you do. Tell me, will Arthur live again?” (“ Mrs. Patton—The Story Continues ,” Ensign or Liahona , Nov 2007, 22) Imagine you were in President Monson’s situation. In your study journal, write a short paragraph to answer Mrs. Patton’s question. Encourage students to add to what they have written as they continue to learn about the Resurrection of Jesus Christ. “I know that my Redeemer liveth” Read Job 19:23–27 , looking for the answer Job gives to his questions. What did Job know to be true? Students might share something like because of Jesus Christ, we will be resurrected and see God again . What can verses 23–24 teach us about how Job felt about this truth? How might this knowledge about Jesus Christ have influenced Job as he endured his trials? How can this knowledge help us? Students could read the following statement on their own and then share what stands out to them from it. President Dallin H. Oaks of the First Presidency shared some ways our knowledge of the Resurrection of Jesus Christ can bring us hope: The Resurrection from the dead is the reassuring personal pillar of our faith. It adds meaning to our doctrine, motivation to our behavior, and hope for our future. … The Resurrection gives us the perspective and the strength to endure the mortal challenges faced by each of us and those we love. It gives us a new way to view the physical, mental, or emotional deficiencies we have at birth or acquire during mortal life. It gives us the strength to endure sorrows, failures, and frustrations. Because each of us has an assured resurrection, we know that these mortal deficiencies and oppositions are only temporary. (“ What Has Our Savior Done for Us? ,” Liahona , May 2021, 75) When have you seen someone gain hope through their faith in Jesus Christ and His Resurrection? Understanding the Resurrection Before displaying the following instructions, you might discuss how we can strengthen the words we speak or write by connecting them with the words of the Savior and His prophets. One way we can do this is by quoting phrases from scriptures. Do the following with the paragraph you wrote in response to Mrs. Patton’s question: Add a sentence or two using something you learned or felt today about Jesus Christ and the hope available to us because of His Resurrection. Include a phrase from Job 19:25–27 . Add one or two additional sentences using words or phrases from other scriptures or statements from Church leaders. To do this, you could search “Resurrection” in Gospel Library, Guide to the Scriptures , or Topics and Questions . You could also review pages 48 , 55–56 , and 58 of Preach My Gospel: A Guide to Sharing the Gospel of Jesus Christ (2023). If needed, you could provide some of the following references: 1 Corinthians 15:20–22 ; Mosiah 16:7–8 ; Alma 11:42–44 ; Helaman 14:17 ; Moroni 7:41 You might show “ Because of Him ” (2:44), available at ChurchofJesusChrist.org , and invite students to add to what they wrote. 2:44 When students have finished, place them in small groups. Have the students share with their groups what they wrote about the Resurrection of Jesus Christ. As their classmates share, students could add to their own paragraphs. To conclude class, you could watch the remainder of “ Until We Meet Again ,” from time code 2:28 to 3:39, to hear what President Monson said to Mrs. Patton. 3:40\n\n\n--- Lesson 99 ---\nHave you ever wondered why God allows suffering? Are there other questions you have asked during your trials? In vain, Job and his friends tried to determine the reasons for Job’s suffering. While God did not give a reason, He did help Job see his trials in a higher and holier way. This lesson can provide students with an opportunity to help others view their trials with an eternal perspective. Student preparation: Provide students with the question “Why does God allow us to experience trials?” Invite them to find answers using divinely appointed sources, such as the scriptures, teachings from Church leaders, or their parents. They could also ask family members or friends how they would answer the question. Possible Learning Activities Why do bad things happen? Consider beginning class by writing the following questions on the board. Invite the class to create two more questions people might ask while trying to understand their trials. Add these two questions to the board and number them 5 and 6 . These questions will be referenced throughout the lesson. “I must be doing everything wrong. Why else is life so hard for me?” “If I’m following the gospel, why am I not able to avoid trials and suffering?” “I thought God loved me. Why is He making my life so difficult?” “If God is real, why doesn’t He stop peoples’ suffering?” It could help to acknowledge that some students might have asked similar questions during trials. Encourage students to be kind and respectful as they discuss the following question. What are some assumptions people might be making when they ask questions such as these? After the discussion you could invite students to ponder the following question. They could write their responses in their study journals. Do you think you could help someone turn to the Lord and find answers to these types of questions? Why or why not? Studying divinely appointed sources can invite the Holy Ghost into our learning. Pay attention to insights He might teach you as you read the scriptures and statements in this lesson. Consider how these insights could help others answer questions about their trials. Doing so might help you gain greater understanding of your own trials. Job and his friends Consider displaying an image of Job, such as the one at the beginning of this lesson. Invite students to briefly discuss with a partner what they remember about the story of Job. You could then share the following: During Job’s trials he had three friends visit him. Job and his friends tried to determine the reasons for his suffering. Their limited perspective led to inaccurate assumptions. Using the verses below, consider inviting the left side of the class to study what Job believed about his suffering and the right side to study what Job’s friend, Eliphaz, believed. Or you could summarize these verses and move on to the heading “An eternal perspective.” Summarizing would allow more time for students to study the conclusion of Job’s story and to discuss the handout. Read Job 19:6–11 , looking for what Job assumed about God. Read Job 22:5–10 , looking for what Eliphaz assumed about Job. What inaccurate assumptions did each person have? If students need help understanding what they read, you could explain that Job felt God had caused his trials and had abandoned him. Eliphaz falsely accused Job of mistreating others. He believed Job’s suffering was the result of wickedness. An eternal perspective As Job continued struggling through his trials, God spoke to him. God asked Job many questions about the creation of the world, which Job could not answer (see Job 38–41 ). Read Job 38:4–7 , looking for examples of the questions God asked Job. Elder Dale G. Renlund of the Quorum of the Twelve Apostles explained God’s response to Job’s inability to answer Him: It was as if God had patiently and kindly said to Job, “If you cannot answer even one of my questions about the earth that I have created, is it possible that eternal laws exist that you do not understand? Are there assumptions you have made that are invalid? Do you understand my motives and how my plan of salvation and exaltation works? And can you foresee your future destiny?” God in His wisdom knows that a vital part of our mortal experience is to not know everything. There is something about trusting Him that allows us to progress to become like Him. (“ Trust God and Let Him Prevail ,” Liahona , Aug. 2022, 5) What does this statement help you understand about God and trials? As students respond, consider pointing out that God did not provide a reason for Job’s suffering. Read Job 42:1–6 , looking for Job’s response to the Lord. What stands out to you from Job’s response? What have you learned from Job’s story that can help us better understand our trials? Students might identify many truths, including God can help us view our trials with an eternal perspective . Job acknowledged his limited understanding compared with God’s knowledge and Job changed the way he viewed his trials. He came to know his suffering was not a result of sin or divine punishment. God blessed Job greatly at the end of his life (see Job 42:12–13 ). Understanding trials We might not always understand the reasons for our challenges. However, the Lord has provided divine sources that can help us view our trials with an eternal perspective. Consider providing students with the handout titled “ Understanding Trials .” Students could complete this on their own to allow for personal reflection. Or they could study the handout in pairs or small groups to increase comprehension or student engagement. Instead of using the handout, you could invite students to search words such as “adversity” or “trials” in the Gospel Library to gain insights that can help them better understand trials. Open PDF When students complete the handout, consider inviting them to reread the six questions about trials that were written on the board at the beginning of class. You could then lead a class discussion with questions such as the following: What did you learn that could help someone with these questions view their trials with an eternal perspective? How have you seen the teachings you studied be true in your own trials? What are you learning about Heavenly Father and Jesus Christ as you listen to what others are sharing? You could also watch “ Why Do Bad Things Happen to Good People? ” (4:39), available at ChurchofJesusChrist.org . Invite students to look for what Brock learned from his trials. 4:39 Conclusion Allow students to role-play helping others view their trials with an eternal perspective. You could do this by placing students in pairs. Provide each pair with a six-sided die. Display the following instructions. You could modify the instructions if dice are unavailable. Refer to the six questions about trials written on the board as you and your partner complete the following activity: Choose one person to roll the die. If you rolled the die, ask your partner the question on the board that corresponds with the number you rolled. (For example, if you rolled one you would ask, “I must be doing everything wrong. Why else is life so hard for me?” ) If you did not roll the die, answer the question your partner asked. Use insights you gained from class to help your partner view their trials with an eternal perspective. Include thoughts or feelings you have about Heavenly Father or Jesus Christ. Switch responsibilities and repeat the activity one more time. If the same number gets rolled, roll again. Consider concluding by adding your witness to the things students have shared today.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 29194,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.388991"
}