{
  "week_number": 3,
  "date_range": "Genesis 1–2",
  "title": ";Moses 2–3;Abraham 4–5",
  "primary_scriptures": [
    {
      "book": "Moses",
      "chapters": [
        "2",
        "3"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    },
    {
      "book": "Abraham",
      "chapters": [
        "4",
        "5"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    }
  ],
  "all_content": "\n\n--- CFM: ;Moses 2–3;Abraham 4–5 ---\nBecause the world around us is so beautiful and majestic, it’s hard to imagine the earth when it was “without form, and void” and “empty and desolate” (\nGenesis 1:2\n;\nAbraham 4:2\n). One thing the Creation story teaches us is that God can, over time, make something magnificent out of something unorganized. That’s helpful to remember when life seems chaotic. Heavenly Father and Jesus Christ are Creators, and Their creative work with us is not finished. They can make light shine in dark moments in our lives. They can fill our emptiness with life. They can transform us into the divine beings we were meant to be. That’s what it means to be created in God’s image, after His likeness (see\nGenesis 1:26\n). We have the potential to become like Him: exalted, glorified, heavenly.\nFor an overview of the book of Genesis, see “\nGenesis\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nGenesis 1:1–25\n;\nMoses 2:1–25\n;\nAbraham 4:1–25\n“By mine Only Begotten I created these things.”\nAlthough we don’t know everything about how the world was created, it’s interesting to note what God has chosen to reveal about the Creation. What does God teach you about it in\nGenesis 1:1–25\n;\nMoses 2:1–25\n; and\nAbraham 4:1–25\n? Why does He want you to know these things? As you ponder these accounts, you might also consider what they teach you about Heavenly Father, Jesus Christ, the world, and yourself.\nTo enrich your study, consider reading these verses while out among God’s creations or while listening to a song like “\nAll Creatures of Our God and King\n” (\nHymns\n, no. 62). You could find pictures of His creations that help you feel reverence for the Creator. Consider sharing these pictures, along with your testimony, with others.\nSee also\nDoctrine and Covenants 101:32–34\n.\nThe Garden of Eden\n, by Grant Romney Clawson\nGenesis 1:26–27\n;\nMoses 2:26–27\n;\nAbraham 4:26–27\nI am created in the image of God.\nAs you read\nGenesis 1:26–27\n;\nMoses 2:26–27\n; and\nAbraham 4:26–27\n, ponder what it means to be created in God’s “image” or “likeness,” male and female. Why is it important to you to know the truths in these verses? For example, how do these truths affect the way you see yourself, others, and God? How can they help you when you have negative feelings about yourself?\nTo help you think about these questions, try completing a sentence like this one: “Because I know I am created in God’s image, I choose to …” Reviewing “\nYour body is sacred\n” in\nFor the Strength of Youth: A Guide for Making Choices\n(pages 22–29) can help. Consider choosing something you will do to show God that you know your body is sacred.\nIn the video “God’s Greatest Creation” (Gospel Library), President Russell M. Nelson bears testimony of the miraculous human body. As you watch this video, ask yourself, “How does Heavenly Father want me to feel about my body?” How is this different from messages you might hear from others?\n2:51\nGod's Greatest Creation\nSome people might say that being created in God’s image means that all of our thoughts, feelings, and desires are approved by Him and that we don’t need to (or cannot) improve. What would you say to that? What insights do you gain from\nMosiah 3:19\nand\nEther 12:27\n?\nSee also Russell M. Nelson, “\nYour Body: A Magnificent Gift to Cherish\n,”\nLiahona\n, Aug. 2019, 50–55.\nGenesis 1:27–28\n;\n2:18–25\n;\nMoses 3:18, 21–24\n;\nAbraham 5:14–18\nMarriage between a man and a woman is ordained of God.\n“Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “\nLessons from Eve\n,”\nEnsign\n, Nov. 1987, 87). Ponder this as you read\nGenesis 1:27–28\n;\n2:18–25\n;\nMoses 3:18, 21–25\n; and\nAbraham 5:14–19\n. How can you treat marriage with the sacredness God has given it?\nSee also\n1 Corinthians 11:11\n; “\nThe Family: A Proclamation to the World\n,” Gospel Library.\nGenesis 1:28\n;\nMoses 2:28\n;\nAbraham 4:28\nI am responsible for caring for God’s creations.\nWhat do\nGenesis 1:28\n;\nMoses 2:28\n; and\nAbraham 4:28\nsuggest about our responsibility toward God’s creations? What do\nDoctrine and Covenants 59:16–21\nand\n104:13–18\nadd to your understanding?\nSee also Gérald Caussé, “\nOur Earthly Stewardship\n,”\nLiahona\n, Nov. 2022, 57–59; Topics and Questions, “\nEnvironmental Stewardship and Conservation\n,” Gospel Library.\nGenesis 2:2–3\n;\nMoses 3:2–3\n;\nAbraham 5:2–3\nGod blessed and sanctified the Sabbath day.\nGod\nmade\nthe Sabbath day holy, and He asks us to\nkeep\nit holy. As you read\nGenesis 2:2–3\n;\nMoses 3:2–3\n; and\nAbraham 5:2–3\n, think about what makes the Sabbath “blessed” to you.\nSee also\nDoctrine and Covenants 59:9–13\n; “The Sabbath Is a Delight” (video), Gospel Library.\n0:50\nHighlight: The Sabbath Is a Delight\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nHow long did the Creation take?\nWhat is the Church’s position on evolution?\nWas Eve really created from Adam’s rib?\nClick to see more.\nIdeas for Teaching Children\nGenesis 1:1–25\n;\nMoses 2:1–25\n;\nAbraham 4:1–25\nJesus created the earth.\nHow will you make learning about the Creation fun for your children? You could take them on a search outside for the kinds of things that were made during each period of Creation. Your children might also look at pictures of things Jesus created (see “\nThe Creation of the Earth\n” in\nOld Testament Stories\n, 8–12). Then you and your children could talk about how you feel about Jesus Christ after reading about the Creation.\nConsider singing a song together about our beautiful world, such as “\nMy Heavenly Father Loves Me\n” (\nChildren’s Songbook\n, 228–29). Maybe your children could add to the song other things God has created that help them feel His love.\nHelp children express their creativity.\n“When you invite children to draw, build, color, or write something related to a gospel principle, you help them better understand the principle and you give them a tangible reminder of what they have learned” (\nTeaching in the Savior’s Way\n,\n32\n).\nGenesis 1:26–27\n;\nMoses 2:26–27\n;\nAbraham 4:26–27\nI was created in God’s image.\nYour children can develop a sense of reverence and respect for their own and others’ bodies as they learn that we were all created in God’s image. To help them understand what this means, you could let your children look at their image in a mirror or picture while you read\nMoses 2:26–27\nto them. You could also show them how baby animals are often in the “likeness” of their parents (see the picture in this outline, for example). This could lead to a conversation about why it’s important to you to know that you are created in your Heavenly Father’s image.\nYou and your children might enjoy drawing a human body and cutting the drawings into puzzles. As your children put their puzzles together, they could talk about ways they can show Heavenly Father that they are thankful for their bodies.\nGenesis 2:2–3\n;\nMoses 3:2–3\n;\nAbraham 5:2–3\nThe Sabbath day is holy.\nAs you read\nMoses 3:2–3\n, ask your children to listen for what God did on the seventh day. Help your children find or draw pictures of things they can do on Sunday to make it a holy day and different from other days. Share with each other why it is important to you to keep the Sabbath day holy.\nHelp your children role-play explaining to a friend why they choose to do things on Sunday that honor Heavenly Father and Jesus. Suggest that they use\nGenesis 2:2–3\nin their explanations. How does keeping the Sabbath day holy show our love for Heavenly Father and Jesus Christ?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 3: Lesson 7: Lesson 7—Genesis 1:1–25This lesson can help students feel love and gratitude for Heavenly Father and Jesus Christ as they study the Creation of the earth.; Lesson 8: Lesson 8—Genesis 1:26–27This lesson can help students feel the importance of their identity and potential as sons and daughters of heavenly parents.... ---\n\n--- Lesson 7 ---\nThe majesty and beauty of our world testifies of glorious Creators who can transform something that is “without form, and void,” (see Genesis 1:2 ) into the wonders of this earth. This lesson can help students feel love and gratitude for Heavenly Father and Jesus Christ as they study the Creation of the earth. Student preparation: Invite students to ponder the beauty of the earth and all of God’s creations. Invite them to bring a picture of or be prepared to talk about something in this world that they enjoy. Possible Learning Activities Note: Although accounts of the Creation of the earth are also found in Moses 2 and Abraham 4 , this lesson will focus on the account recorded in Genesis 1 . Great creators and creations To begin class, consider showing pictures of a beautiful building that is a popular destination in your area. You could ask questions such as the following: What do you think makes people want to visit a building like this? How do you think the creators of beautiful buildings feel when people enjoy their work? You could then display a picture of a beautiful landscape near your area. Invite students to do the following to help prepare them for today’s lesson. Think about how you feel or thoughts you have when you see the beauty and majesty of the earth. Consider how often you take time to admire or appreciate these earthly wonders. As you study today, prayerfully invite the Holy Ghost to help you feel love and gratitude to Heavenly Father and Jesus Christ for the creation of this world. The Creation Before introducing the following study activity, consider inviting the students to share what they know about the creation of the earth. Then refer students to the following sentence from “ The Living Christ: The Testimony of the Apostles .” Invite students to write this truth in their study journals or as a note in their scriptures. You could also write it on the board. In “ The Living Christ: The Testimony of the Apostles ,” we learn: Under the direction of His Father, [Jesus Christ] was the creator of the earth. (“ The Living Christ: The Testimony of the Apostles ,” ChurchofJesusChrist.org ) Genesis 1 contains some of the details about Jesus Christ creating the earth. Read the account of the first six creative periods from Genesis 1 , looking for what we learn about the Creator and creation. As students study the following verses, you could invite them to identify and mark each “day” of Creation in their scriptures. One way to do this is to copy the following chart on the board and give students time to complete it. You could organize students into smaller groups and assign each group one set of verses to study from the chart. It might be helpful to explain that the word “day” refers to a period of creation, not a specific span of time (see Abraham 4 , where the creative periods are labeled “time”). Note : The creation of man and woman will be addressed in greater depth in lessons “ Genesis 1:26–27 ” and “ Genesis 1:28–2:25 .” Be careful that this portion of the lesson does not take too long so students will have enough time to focus on the section titled “The Savior’s role as Creator.” Day 1: Genesis 1:1–5 Divided light from the darkness Day 2: Genesis 1:6–8 Day 3: Genesis 1:9–13 Day 4: Genesis 1:14–19 Day 5: Genesis 1:20–23 Day 7: Genesis 1:24–27 What thoughts or feelings do you have about Heavenly Father and Jesus Christ as you study these verses? Students may have questions about some of the details of the Creation. Help them understand that the accounts of the Creation are not meant to provide a literal, scientific explanation of the specific processes, time periods, or events involved. It may be helpful to read Doctrine and Covenants 101:32–34 and reassure the students that the Savior will reveal all things in His time. The Savior’s role as Creator Give students an opportunity to deepen their appreciation for Jesus Christ as the Creator. One way to do this could be to draw a picture on the board of the earth and display the following scripture references for students to study. You could invite them to study some or all of the verses and come to the board to write meaningful phrases they found around the picture of the earth. As students study these verses, invite them to pay close attention to how the Spirit can testify to them of the Savior’s role as the Creator. Select one or more of the following verses to study, looking for teachings that can enhance your understanding and appreciation of Jesus Christ as the Creator. Alma 30:43–44 Doctrine and Covenants 38:1–3 Doctrine and Covenants 59:18–20 Doctrine and Covenants 76:22–24 Moses 1:33, 39 Moses 6:63 Invite students to share their insights. One way you could do this is by displaying the following questions for students to discuss. What were some meaningful words or phrases from the verses you studied? Why? What did these verses help you learn or feel about Heavenly Father and Jesus Christ? Invite students to reflect on how the Savior’s role as Creator has impacted their lives. As part of this reflection time, you could consider showing “ We Lived with God ” (4:00), available at ChurchofJesusChrist.org . 4:0 You could also use the story from President Boyd K. Packer in “ Additional Resources .” Express gratitude for the Creator This portion of the lesson is intended to help students express their love and gratitude to Jesus Christ because of His role as Creator. To help them do this, consider using one or more of the following activities. You could display the options you select and invite students to choose one to complete. Write a poem or journal entry that expresses gratitude for Jesus Christ and His creations. Draw a picture that represents your feelings toward the Savior and His creations. Select a hymn that is about the Savior and His creations. Study the words to the music. You could search “Jesus Christ—Creator” in the Topic section of the hymnbook. You could write an additional verse to the hymn that reflects your feelings about Heavenly Father, Jesus Christ, and the Creation. After enough time, invite students to share what they learned and felt from the activity. Look for opportunities to use sacred music to invite the influence of the Spirit. Inspirational music can create a feeling of reverence and help students feel the power of the truths they are learning. If students selected meaningful hymns to express their love and gratitude to Jesus Christ, the class could sing one or more of them together, and students could share the additional verse they wrote. (For additional teacher training on the use of inspirational music, see “ Create settings and opportunities for learners to be taught by the Holy Ghost ” in Teacher Development Skills .) You could also invite students to read the poem or journal entry they wrote. You could display the artwork students created and invite them to share what they depicted and why. Consider concluding class by sharing your feelings about the Savior’s role in the Creation.\n\n\n--- Lesson 8 ---\nDuring the sixth period of creation, God created man and woman. Every person on earth is a beloved son or daughter of heavenly parents and has a divine nature and destiny. This lesson can help students feel the importance of their identity and potential as sons and daughters of heavenly parents. Student preparation: Invite students to memorize or review the opening lines of the Young Women and Aaronic Priesthood themes and to reflect on the significance of each statement: Possible Learning Activities Identities and labels Consider drawing a timeline on the board and invite students to create their own personal timeline in their study journals. A sample timeline is provided below. Draw a horizontal line representing your life and label it with various identities or titles you have had in the past, currently have, or anticipate having in the future. This could include “friend,” “student,” or a job title or calling you have had. The following is an example: What are some identities or titles you chose to put on your timeline? Why? In what ways could these identities or titles influence choices you make? President Russell M. Nelson explained how the ways we label ourselves can affect us. 31:24 Labels can be fun and indicate your support for any number of positive things. Many labels will change for you with the passage of time. And not all labels are of equal value. But if any label replaces your most important identifiers, the results can be spiritually suffocating. (“ Choices for Eternity ” [worldwide devotional for young adults, May 15, 2022], broadcasts.ChurchofJesusChrist.org) How do you think some labels could be spiritually suffocating? Children of heavenly parents Read Genesis 1:26–27 and the following statement from “ The Family: A Proclamation to the World ,” looking for insights about your eternal identity. Genesis 1:26–27 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. All human beings—male and female—are created in the image of God. Each is a beloved spirit son or daughter of heavenly parents, and, as such, each has a divine nature and destiny. Gender is an essential characteristic of individual premortal, mortal, and eternal identity and purpose. (“ The Family: A Proclamation to the World ,” ChurchofJesusChrist.org ) What insights did you gain about your eternal identity? One truth students may have identified is that we are sons and daughters of heavenly parents, created in their image . If they have not already done so, invite students to write “Child of God” across their timeline. What do you think it means to be created in God’s image? President Thomas S. Monson (1927–2018) shared the following insight about being created in God’s image. God our Father has ears with which to hear our prayers. He has eyes with which to see our actions. He has a mouth with which to speak to us. He has a heart with which to feel compassion and love. He is real. He is living. We are his children, made in his image. We look like him, and he looks like us. (“ I Know That My Redeemer Lives ,” Ensign , Apr. 1990, 6) Why do you think it would be important to place your identity as a child of God above any other identity you have? Give students time to ponder how important their identity as children of God currently is to them. Doing so can invite the Holy Ghost to testify of truth or help prepare students’ minds and hearts to be taught. What obstacles could make it difficult to believe or remember your identity as a child of God, created in His image? Consider writing student responses to the previous question on the board. Possible answers could be that some people might not understand why being a child of God matters, they struggle to feel God’s love, or they are distracted by less-important identifiers. If students have questions about gender, follow the Savior’s example as you teach His doctrine in a way that brings understanding, hope, and healing. Testify that God loves all His children and will help students navigate their questions as they apply the principles of acquiring spiritual knowledge. For an idea on how to help students with questions about gender, see the Supplemental Learning Activities . Words of scriptures and prophets Provide students with the handout titled “ I Am a Child of God .” Invite students to seek inspiration from God as they study to help them recognize the significance of their divine identity. In addition to the handout, you could invite students to review the teachings found in the Young Women and Aaronic Priesthood themes. Students could do this individually or in small groups. Open PDF When students have finished studying, you could invite them to share what they learned with the class or in small groups. You could also ask questions such as the following: What did you find from the resources you studied that was meaningful to you? How can knowing your identity as a child of God affect the way you see yourself and others? How has the knowledge of your divine identity and potential impacted your life? If students would benefit from seeing an example of how knowing their eternal identity can affect them, consider watching “ Running Toward the Light ” (17:34), available at ChurchofJesusChrist.org , from time code 11:00 to 15:19. In this video, Elder Peter M. Johnson of the Seventy shared his experience of learning that he is a child of God and the influence that knowledge has had on his life. After the video, you could invite a few students to share what impressed them from Elder Johnson’s message. 17:34 Reflect on your identity Give students time to reflect on what they have learned about their identity and potential as daughters and sons of heavenly parents. Invite them to record in their study journals any impressions or insights they have received that they would like to remember. Consider concluding by singing “ I Am a Child of God ” as a class, then sharing your testimony about being a child of God. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Genesis 1:26–27 is “God created man in his own image.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 9 ---\nAfter the creation of Adam and Eve, Heavenly Father joined them together in marriage. He commanded them to multiply and replenish the earth and to cleave to one another. This lesson can help students understand the central role of marriage and family in Heavenly Father’s plan of salvation. Student preparation: Invite the students to study “ The Family: A Proclamation to the World ,” looking for teachings that describe why family is central to Heavenly Father’s plan of salvation. Possible Learning Activities When discussing the importance of marriage and family in Heavenly Father’s plan of salvation, recognize that many students do not currently experience ideal family situations. Be sensitive to the needs and questions of students. Things that are central Consider writing on the board one or more incomplete sentences that illustrate how an object, activity, person, and so on could be central to accomplishing something. The following examples may be useful. Invite the students to think about how they would fill in the blanks, then ask various students to share their answers with the class. It may be helpful to explain that the word central could also mean essential or most important . is central to succeeding in school because . is a central part of a happy life because . plays a central role in my life because . After students have shared their responses, display the following statement from “ The Family: A Proclamation to the World ,” and invite a student to read it aloud. Ask the class to look for a central aspect of our Heavenly Father’s plan of salvation. “ The Family: A Proclamation to the World ” states: We, the First Presidency and the Council of the Twelve Apostles of The Church of Jesus Christ of Latter-day Saints, solemnly proclaim that marriage between a man and a woman is ordained of God and that the family is central to the Creator’s plan for the eternal destiny of His children. (“ The Family: A Proclamation to the World ,” Gospel Library) Why do you think marriage and family play such important roles in Heavenly Father’s plan of salvation? In what ways can you see Satan working to attack marriages and families in our day? Invite students to think about some of the questions they or others may have about marriage and family. They could write their questions in their study journals. Encourage them as they study today to look for truths and to pay attention to spiritual impressions that can help guide them in finding answers to these questions. Teachings from the scriptures Explain that what Heavenly Father did after the earth’s Creation can help us understand the central role of marriage and family in His plan. Display the following instructions and resources, and give students time to study them. You could study these together as a class, or you could organize the students into groups to study and discuss these resources together. As students read the verses from Genesis 2 , you may want to explain that the words help meet in verse 18 refers to “a helper suited to, worthy of, or corresponding to” Adam (see footnote 18b). You could also explain that the account of Eve being created from Adam’s rib is symbolic and can represent the equal partnership between husband and wife (see Russell M. Nelson, “ Lessons from Eve ,” Ensign , Nov. 1987, 87). Study the following statement and scriptures, looking for evidence of the importance of marriage and family to God. President Spencer W. Kimball (1895–1985) taught: The Lord … [brought] together Adam and Eve, his first male and first female on this earth, and perform[ed] a holy marriage ceremony to make them husband and wife. ( Teachings of Presidents of the Church: Spencer W. Kimball [2006], 192 ) Scriptures to study: Genesis 1:27–28 (God’s commandment to Adam and Eve) Genesis 2:18, 21–24 (Creation of Eve) Genesis 2:24 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Doctrine and Covenants 49:15–17 (The Lord’s teachings through the Prophet Joseph Smith) What truths did you find that demonstrate the importance of marriage and family to God? Students may identify truths similar to the following: God has commanded husbands and wives to have children ( Genesis 1:28 ). Husband and wife are to be one and act as equal partners ( Genesis 2:18, 24 ). Marriage between a man and a woman is ordained of God ( Doctrine and Covenants 49:15 ). The earth was created to provide a place where God’s children could be born into families and progress together ( Doctrine and Covenants 49:16–17 ). As part of your discussion of these truths, it may be helpful to discuss the following statement by President Russell M. Nelson. President Russell M. Nelson emphasized the important role families would play after the earth had been created by God: Grand as it is, planet Earth is part of something even grander—that great plan of God. Simply summarized, the earth was created that families might be. Scripture explains that a husband and wife “shall be one flesh, and all this that the earth might answer the end of its creation” [ Doctrine and Covenants 49:16 ]. (“ The Creation ,” Ensign , May 2000, 85) How can remembering the central role of marriage and family in God’s plan affect the choices you make in your life? How can these truths and teachings help us respond when we see the doctrine of marriage or family being criticized or minimized? How do you think following Heavenly Father’s standards related to marriage and family can help you become more like Him? Create a response To help the students explain what they have learned about the importance of marriage and family in God’s plan, consider sharing a scenario like the following. You can adapt this scenario to be more relevant to your culture and your students’ lives. After sharing the scenario, display the instructions for students to create a response. In one of Elizabeth’s school classes, a discussion took place about marriage and family. Elizabeth shared some of her views about marriage being between a man and a woman and the importance of married couples having children. Many of Elizabeth’s classmates shared opinions that were very different from hers. After class, a young man named Isaac, who is also in Elizabeth’s seminary class, asked Elizabeth why she had such outdated opinions about marriage and family. Using what you have learned today, create a response that Elizabeth could share with Isaac. Include the following in your response: An explanation about why marriage and family are important to Heavenly Father and His plan of salvation One or more teachings from the scriptures or Church leaders An invitation Elizabeth could share with Isaac that could help him After the students have had time to prepare, give them an opportunity to share their responses. They could share them with a partner or small group. A few willing students could also be invited to share their responses with the class or to role-play the scenario. Give students time to reflect on what they learned and felt today. They could think about truths they learned that answered some of their questions. Invite them to record any spiritual impressions they have had in their study journals. Testify of the truths you have discussed today. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Genesis 2:24 is “A man … shall cleave unto his wife: and they shall be one.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n--- SCRIPTURE: Moses 2 ---\n1. And it came to pass that the Lord spake unto Moses, saying: Behold, Irevealunto you concerning thisheaven, and thisearth;writethe words which I speak. I am the Beginning and the End, theAlmighty God; by mineOnly BegottenIcreatedthese things; yea, in the beginning Icreatedtheheaven, and the earth upon which thou standest.\n2. And the earth was withoutform, and void; and I causeddarknessto come up upon the face of the deep; and mySpiritmovedupon the face of the water; for I am God.\n3. And I, God, said: Let there belight; and there was light.\n4. And I, God, saw the light; and that light wasgood. And I, God, divided thelightfrom the darkness.\n5. And I, God, called the light Day; and the darkness, I called Night; and this I did by thewordof my power, and it was done as Ispake; and the evening and the morning were the firstday.\n6. And again, I, God, said: Let there be afirmamentin the midst of the water, and it was so, even as I spake; and I said: Let it divide the waters from the waters; and it was done;\n7. And I, God, made the firmament and divided thewaters, yea, the great waters under the firmament from the waters which were above the firmament, and it was so even as I spake.\n8. And I, God, called the firmamentHeaven; and the evening and the morning were the second day.\n9. And I, God, said: Let thewatersunder the heaven be gathered together untooneplace, and it was so; and I, God, said: Let there be dry land; and it was so.\n10. And I, God, called the dry landEarth; and the gathering together of the waters, called I the Sea; and I, God, saw that all things which I had made were good.\n11. And I, God, said: Let the earth bring forthgrass, the herb yielding seed, the fruit tree yielding fruit, after his kind, and the tree yielding fruit, whose seed should be in itself upon the earth, and it was so even as I spake.\n12. And the earth brought forth grass, every herb yielding seed after his kind, and the tree yielding fruit, whose seed should be in itself, after hiskind; and I, God, saw that all things which I had made were good;\n13. And the evening and the morning were the third day.\n14. And I, God, said: Let there belightsin the firmament of the heaven, to divide the day from the night, and let them be for signs, andfor seasons, and for days, and for years;\n15. And let them be for lights in the firmament of the heaven to give light upon the earth; and it was so.\n16. And I, God, made two great lights; the greaterlightto rule the day, and the lesser light to rule the night, and thegreaterlight was the sun, and the lesser light was the moon; and the stars also were made even according to my word.\n17. And I, God, set them in the firmament of the heaven to give light upon the earth,\n18. And thesunto rule over the day, and the moon to rule over the night, and to divide the light from thedarkness; and I, God, saw that all things which I had made were good;\n19. And the evening and the morning were the fourth day.\n20. And I, God, said: Let the waters bring forth abundantly the moving creature that hath life, and fowl which may fly above the earth in the open firmament of heaven.\n21. And I, God, created greatwhales, and every living creature that moveth, which the waters brought forth abundantly, after their kind, and every winged fowl after his kind; and I, God, saw that all things which I had created were good.\n22. And I, God, blessed them, saying: Be fruitful, andmultiply, and fill the waters in the sea; and let fowl multiply in the earth;\n23. And the evening and the morning were the fifth day.\n24. And I, God, said: Let the earth bring forth the living creature after his kind, cattle, and creeping things, and beasts of the earth after their kind, and it was so;\n25. And I, God, made the beasts of the earth after their kind, and cattle after their kind, and everything which creepeth upon the earth after his kind; and I, God, saw that all these things were good.\n26. And I, God, said unto mineOnly Begotten, which was with me from thebeginning: Letusmakeman in ourimage, after our likeness; and it was so. And I, God, said: Let them havedominionover the fishes of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.\n27. And I, God, created man in mine ownimage, in the image of mine Only Begotten created I him; male and female created I them.\n28. And I, God, blessed them, and said unto them: Befruitful, andmultiply, and replenish the earth, and subdue it, and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.\n29. And I, God, said unto man: Behold, I have given you every herb bearing seed, which is upon the face of all the earth, and every tree in the which shall be the fruit of tree yielding seed; to you it shall be formeat.\n30. And to every beast of the earth, and to every fowl of the air, and to everything that creepeth upon the earth, wherein I grant life, there shall be given every clean herb for meat; and it was so, even as I spake.\n31. And I, God, saw everything that I had made, and, behold, all things which I had made were verygood; and the evening and the morning were thesixthday.\n\n--- SCRIPTURE: Moses 3 ---\n1. Thus theheavenand the earth were finished, and all thehostof them.\n2. And on the seventh day I, God, ended my work, and all things which I had made; and Irestedon theseventh dayfrom all my work, and all things which I had made were finished, and I, God, saw that they were good;\n3. And I, God,blessedthe seventh day, andsanctifiedit; because that in it I had rested from all myworkwhich I, God, had created and made.\n4. And now, behold, I say unto you, that these are the generations of the heaven and of the earth, when they werecreated, in the day that I, the Lord God, made theheavenand the earth,\n5. And every plant of the field before it was in the earth, and every herb of the field before it grew. For I, the Lord God,createdall things, of which I have spoken,spiritually, before they werenaturallyupon the face of the earth. For I, the Lord God, had not caused it to rain upon the face of the earth. And I, the Lord God, hadcreatedall the children of men; and not yet man to till theground; for inheavencreatedI them; and there was not yet flesh upon the earth, neither in the water, neither in the air;\n6. But I, the Lord God, spake, and there went up amistfrom the earth, and watered the whole face of the ground.\n7. And I, the Lord God, formed man from thedustof the ground, and breathed into his nostrils thebreath of life; andmanbecame livingsoul, thefirstflesh upon the earth, the first man also; nevertheless, all things were before created; but spiritually were they created and made according to my word.\n8. And I, the Lord God, planted garden eastward inEden, and there I put the man whom I had formed.\n9. And out of the ground made I, the Lord God, to grow every tree,naturally, that is pleasant to the sight of man; and man could behold it. And it became also alivingsoul. For it was spiritual in the day that I created it; for it remaineth in the sphere in which I, God, created it, yea, even all things which I prepared for the use of man; and man saw that it was good for food. And I, the Lord God, planted thetree of lifealso in the midst of the garden,and also the tree of knowledge of good and evil.\n10. And I, the Lord God, caused river to go out ofEdento water the garden; and from thence it was parted, and became into fourheads.\n11. And I, the Lord God, called the name of the first Pison, and it compasseth the whole land ofHavilah, where I, the Lord God, created much gold;\n12. And the gold of that land was good, and there was bdellium and theonyxstone.\n13. And the name of the second river was called Gihon; the same that compasseth the whole land ofEthiopia.\n14. And the name of the third river was Hiddekel; that which goeth toward the east of Assyria. And the fourth river was the Euphrates.\n15. And I, the Lord God, took the man, and put him into the Garden ofEden, to dress it, and to keep it.\n16. And I, the Lord God, commanded the man, saying: Of every tree of the garden thou mayest freely eat,\n17. But of the tree of theknowledgeof good and evil, thou shalt not eat of it, nevertheless, thou mayestchoosefor thyself, for it is given unto thee; but, remember that Iforbidit, for in thedaythou eatest thereof thou shalt surelydie.\n18. And I, the Lord God, said unto mineOnly Begotten, that it was not good that the man should bealone; wherefore, I will make anhelpmeet for him.\n19. And out of the ground I, the Lord God, formed everybeastof the field, and every fowl of the air; and commanded that they should come unto Adam, to see what he would call them; and they were also living souls; for I, God, breathed into them thebreath of life, and commanded that whatsoever Adam called every living creature, that should be the name thereof.\n20. And Adam gavenamesto all cattle, and to the fowl of the air, and to every beast of the field; but as for Adam, there was not found an help meet for him.\n21. And I, the Lord God, caused deep sleep to fall upon Adam; and he slept, and I took one of his ribs and closed up the flesh in the stead thereof;\n22. And the rib which I, the Lord God, had taken from man, made I awoman, and brought her unto the man.\n23. AndAdamsaid: This I know now is bone of my bones, andfleshof my flesh; she shall be called Woman, because she was taken out of man.\n24. Therefore shall man leave his father and his mother, and shallcleaveunto hiswife; andtheyshall beoneflesh.\n25. And they were both naked, the man and his wife, and were not ashamed.\n\n--- SCRIPTURE: Abraham 4 ---\n1. And then the Lord said: Let us go down. And they went down at the beginning, and they, that is theGods,organizedand formed theheavensand the earth.\n2. And the earth, after it was formed, was empty and desolate, because they had not formed anything but the earth; anddarknessreigned upon the face of the deep, and the Spirit of the Godswasbrooding upon the face of the waters.\n3. And they (the Gods) said: Let there be light; and there was light.\n4. And they (the Gods) comprehended the light, for it wasbright; and they divided the light, or caused it to be divided, from the darkness.\n5. And the Gods called the light Day, and the darkness they called Night. And it came to pass that from the evening until morning they callednight; and from the morning until the evening they called day; and this was the first, or the beginning, of that which they called day and night.\n6. And the Gods also said: Let there be anexpansein the midst of the waters, and it shall divide the waters from the waters.\n7. And the Gods ordered the expanse, so that it divided the waters which were under the expanse fromthe waters which were above the expanse; and it was so, even as they ordered.\n8. And the Gods called the expanse, Heaven. And it came to pass that it was from evening until morning that they called night; and it came to pass that it was from morning until evening that they called day; and this was the secondtimethat they called night and day.\n9. And the Gods ordered, saying: Let thewatersunder the heaven be gathered together untooneplace, and let the earth come up dry; and it was so as they ordered;\n10. And the Gods pronounced the dry land, Earth; and the gathering together of the waters, pronounced they,GreatWaters; and the Gods saw that they were obeyed.\n11. And the Gods said: Let us prepare the earth to bring forthgrass; the herb yielding seed; the fruit tree yielding fruit, after his kind, whose seed in itself yieldeth its own likeness upon the earth; and it was so, even as they ordered.\n12. And the Gods organized theearthto bring forth grass from its own seed, and the herb to bring forth herb from its own seed, yielding seed after his kind; and the earth to bring forth the tree from its own seed, yielding fruit, whose seed could only bring forth the same in itself, after his kind; and the Gods saw that they were obeyed.\n13. And it came to pass that they numbered the days; from the evening until the morning they called night; and it came to pass, from the morning until the evening they called day; and it was the third time.\n14. And the Gods organized thelightsin the expanse of the heaven, and caused them to divide the day from the night; and organized them to be for signs and for seasons, and for days and for years;\n15. And organized them to be for lights in the expanse of the heaven to give light upon the earth; and it was so.\n16. And the Gods organized the two great lights, thegreaterlight to rule the day, and the lesser light to rule the night; with the lesser light they set the stars also;\n17. And the Gods set them in the expanse of the heavens, to give light upon the earth, and to rule over the day and over the night, and to cause to divide the light from thedarkness.\n18. And the Gods watched those things which they hadordereduntil they obeyed.\n19. And it came to pass that it was from evening until morning that it was night; and it came to pass that it was from morning until evening that it was day; and it was the fourth time.\n20. And the Gods said: Let us prepare the waters to bring forth abundantly the moving creatures that have life; and the fowl, that they may fly above the earth in the open expanse of heaven.\n21. And the Gods prepared the waters that they might bring forth greatwhales, and every living creature that moveth, which the waters were to bring forth abundantly after their kind; and every winged fowl after their kind. And the Gods saw that they would be obeyed, and that their plan was good.\n22. And the Gods said: We will bless them, and cause them to be fruitful and multiply, and fill the waters in the seas orgreat waters; and cause the fowl to multiply in the earth.\n23. And it came to pass that it was from evening until morning that they called night; and it came topass that it was from morning until evening that they called day; and it was the fifth time.\n24. And the Gods prepared the earth to bring forth the living creature after his kind, cattle and creeping things, and beasts of the earth after their kind; and it was so, as they had said.\n25. And the Gods organized the earth to bring forth the beasts after their kind, and cattle after their kind, and every thing that creepeth upon the earth after its kind; and the Gods saw they would obey.\n26. And the Gods tookcounselamong themselves and said: Let us go down andformman in ourimage, after our likeness; and we will give them dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.\n27. So theGodswent down to organize man in their ownimage, in the image of the Gods to form they him, male and female to form they them.\n28. And the Gods said: We will bless them. And the Gods said: We will cause them to be fruitful and multiply, and replenish the earth, and subdue it, and to have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.\n29. And the Gods said: Behold, we will give them every herb bearing seed that shall come upon the face of all the earth, and every tree which shall have fruit upon it; yea, the fruit of the tree yielding seed to them we will give it; it shall be for theirmeat.\n30. And to every beast of the earth, and to every fowl of the air, and to every thing that creepeth upon the earth, behold, we will give them life, and also we will give to them every green herb for meat, and all these things shall be thus organized.\n31. And the Gods said: We will do everything that we have said, and organize them; and behold, they shall be very obedient. And it came to pass that it was from evening until morning they called night; and it came to pass that it was from morning until evening that they called day; and they numbered thesixthtime.\n\n--- SCRIPTURE: Abraham 5 ---\n1. And thus we will finish the heavens and the earth, and all thehostsof them.\n2. And the Gods said among themselves: On the seventh time we will end our work, which we have counseled; and we willreston theseventhtime from all our work which we have counseled.\n3. And the Gods concluded upon the seventh time, because that on the seventh time they wouldrestfrom all theirworkswhich they (the Gods) counseled among themselves to form; andsanctifiedit. And thus were their decisions at the time that they counseled among themselves to form the heavens and the earth.\n4. And the Gods came down and formed these the generations of the heavens and of the earth, when they were formed in the day that theGodsformed the earth and the heavens,\n5. According to all that which they had said concerning every plant ofthe field before it was in theearth, and every herb of the field before it grew; for the Gods had not caused it to rain upon the earth when they counseled to do them, and had not formed man to till the ground.\n6. But there went up mist from the earth, and watered the whole face of the ground.\n7. And theGodsformed man from thedustof the ground, and took hisspirit(that is, the mans spirit), and put it into him; and breathed into his nostrils the breath of life, and man became livingsoul.\n8. And the Gods planted garden, eastward inEden, and there they put the man, whose spirit they had put into the body which they had formed.\n9. And out of the ground made the Gods to grow every tree that is pleasant to the sight and good for food; thetree of life, also, in the midst of the garden, and the tree of knowledge of good and evil.\n10. There was river running out of Eden, to water the garden, and from thence it was parted and became into four heads.\n11. And the Gods took the man and put him in the Garden of Eden, to dress it and to keep it.\n12. And the Gods commanded the man, saying: Of every tree of the garden thou mayest freely eat,\n13. But of the tree of knowledge of good and evil, thou shalt not eat of it; for in the time that thou eatest thereof, thou shalt surely die. Now I, Abraham, saw that it was after the Lordstime, which was after the time ofKolob; for as yet the Gods had not appointed unto Adam his reckoning.\n14. And the Gods said: Let us make an help meet for the man, for it is not good that the man should be alone, therefore we will form an help meet for him.\n15. And the Gods caused deep sleep to fall upon Adam; and he slept, and they took one of his ribs, and closed up the flesh in the stead thereof;\n16. And of the rib which the Gods had taken from man, formed they awoman, and brought her unto the man.\n17. And Adam said: This was bone of my bones, andfleshof my flesh; now she shall be called Woman, because she was taken out of man;\n18. Therefore shall man leave his father and his mother, and shallcleaveunto his wife, and they shall beoneflesh.\n19. And they were both naked, the man and his wife, and were notashamed.\n20. And out of the ground the Gods formed every beast of the field, and every fowl of the air, and brought them unto Adam to see what he would call them; and whatsoeverAdamcalled every living creature, that should be the name thereof.\n21. And Adam gavenamesto allcattle, to the fowl of the air, to every beast of the field; and for Adam, there was found anhelpmeet for him.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";Moses 2–3;Abraham 4–5",
      "content": "Because the world around us is so beautiful and majestic, it’s hard to imagine the earth when it was “without form, and void” and “empty and desolate” (\nGenesis 1:2\n;\nAbraham 4:2\n). One thing the Creation story teaches us is that God can, over time, make something magnificent out of something unorganized. That’s helpful to remember when life seems chaotic. Heavenly Father and Jesus Christ are Creators, and Their creative work with us is not finished. They can make light shine in dark moments in our lives. They can fill our emptiness with life. They can transform us into the divine beings we were meant to be. That’s what it means to be created in God’s image, after His likeness (see\nGenesis 1:26\n). We have the potential to become like Him: exalted, glorified, heavenly.\nFor an overview of the book of Genesis, see “\nGenesis\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nGenesis 1:1–25\n;\nMoses 2:1–25\n;\nAbraham 4:1–25\n“By mine Only Begotten I created these things.”\nAlthough we don’t know everything about how the world was created, it’s interesting to note what God has chosen to reveal about the Creation. What does God teach you about it in\nGenesis 1:1–25\n;\nMoses 2:1–25\n; and\nAbraham 4:1–25\n? Why does He want you to know these things? As you ponder these accounts, you might also consider what they teach you about Heavenly Father, Jesus Christ, the world, and yourself.\nTo enrich your study, consider reading these verses while out among God’s creations or while listening to a song like “\nAll Creatures of Our God and King\n” (\nHymns\n, no. 62). You could find pictures of His creations that help you feel reverence for the Creator. Consider sharing these pictures, along with your testimony, with others.\nSee also\nDoctrine and Covenants 101:32–34\n.\nThe Garden of Eden\n, by Grant Romney Clawson\nGenesis 1:26–27\n;\nMoses 2:26–27\n;\nAbraham 4:26–27\nI am created in the image of God.\nAs you read\nGenesis 1:26–27\n;\nMoses 2:26–27\n; and\nAbraham 4:26–27\n, ponder what it means to be created in God’s “image” or “likeness,” male and female. Why is it important to you to know the truths in these verses? For example, how do these truths affect the way you see yourself, others, and God? How can they help you when you have negative feelings about yourself?\nTo help you think about these questions, try completing a sentence like this one: “Because I know I am created in God’s image, I choose to …” Reviewing “\nYour body is sacred\n” in\nFor the Strength of Youth: A Guide for Making Choices\n(pages 22–29) can help. Consider choosing something you will do to show God that you know your body is sacred.\nIn the video “God’s Greatest Creation” (Gospel Library), President Russell M. Nelson bears testimony of the miraculous human body. As you watch this video, ask yourself, “How does Heavenly Father want me to feel about my body?” How is this different from messages you might hear from others?\n2:51\nGod's Greatest Creation\nSome people might say that being created in God’s image means that all of our thoughts, feelings, and desires are approved by Him and that we don’t need to (or cannot) improve. What would you say to that? What insights do you gain from\nMosiah 3:19\nand\nEther 12:27\n?\nSee also Russell M. Nelson, “\nYour Body: A Magnificent Gift to Cherish\n,”\nLiahona\n, Aug. 2019, 50–55.\nGenesis 1:27–28\n;\n2:18–25\n;\nMoses 3:18, 21–24\n;\nAbraham 5:14–18\nMarriage between a man and a woman is ordained of God.\n“Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “\nLessons from Eve\n,”\nEnsign\n, Nov. 1987, 87). Ponder this as you read\nGenesis 1:27–28\n;\n2:18–25\n;\nMoses 3:18, 21–25\n; and\nAbraham 5:14–19\n. How can you treat marriage with the sacredness God has given it?\nSee also\n1 Corinthians 11:11\n; “\nThe Family: A Proclamation to the World\n,” Gospel Library.\nGenesis 1:28\n;\nMoses 2:28\n;\nAbraham 4:28\nI am responsible for caring for God’s creations.\nWhat do\nGenesis 1:28\n;\nMoses 2:28\n; and\nAbraham 4:28\nsuggest about our responsibility toward God’s creations? What do\nDoctrine and Covenants 59:16–21\nand\n104:13–18\nadd to your understanding?\nSee also Gérald Caussé, “\nOur Earthly Stewardship\n,”\nLiahona\n, Nov. 2022, 57–59; Topics and Questions, “\nEnvironmental Stewardship and Conservation\n,” Gospel Library.\nGenesis 2:2–3\n;\nMoses 3:2–3\n;\nAbraham 5:2–3\nGod blessed and sanctified the Sabbath day.\nGod\nmade\nthe Sabbath day holy, and He asks us to\nkeep\nit holy. As you read\nGenesis 2:2–3\n;\nMoses 3:2–3\n; and\nAbraham 5:2–3\n, think about what makes the Sabbath “blessed” to you.\nSee also\nDoctrine and Covenants 59:9–13\n; “The Sabbath Is a Delight” (video), Gospel Library.\n0:50\nHighlight: The Sabbath Is a Delight\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nHow long did the Creation take?\nWhat is the Church’s position on evolution?\nWas Eve really created from Adam’s rib?\nClick to see more.\nIdeas for Teaching Children\nGenesis 1:1–25\n;\nMoses 2:1–25\n;\nAbraham 4:1–25\nJesus created the earth.\nHow will you make learning about the Creation fun for your children? You could take them on a search outside for the kinds of things that were made during each period of Creation. Your children might also look at pictures of things Jesus created (see “\nThe Creation of the Earth\n” in\nOld Testament Stories\n, 8–12). Then you and your children could talk about how you feel about Jesus Christ after reading about the Creation.\nConsider singing a song together about our beautiful world, such as “\nMy Heavenly Father Loves Me\n” (\nChildren’s Songbook\n, 228–29). Maybe your children could add to the song other things God has created that help them feel His love.\nHelp children express their creativity.\n“When you invite children to draw, build, color, or write something related to a gospel principle, you help them better understand the principle and you give them a tangible reminder of what they have learned” (\nTeaching in the Savior’s Way\n,\n32\n).\nGenesis 1:26–27\n;\nMoses 2:26–27\n;\nAbraham 4:26–27\nI was created in God’s image.\nYour children can develop a sense of reverence and respect for their own and others’ bodies as they learn that we were all created in God’s image. To help them understand what this means, you could let your children look at their image in a mirror or picture while you read\nMoses 2:26–27\nto them. You could also show them how baby animals are often in the “likeness” of their parents (see the picture in this outline, for example). This could lead to a conversation about why it’s important to you to know that you are created in your Heavenly Father’s image.\nYou and your children might enjoy drawing a human body and cutting the drawings into puzzles. As your children put their puzzles together, they could talk about ways they can show Heavenly Father that they are thankful for their bodies.\nGenesis 2:2–3\n;\nMoses 3:2–3\n;\nAbraham 5:2–3\nThe Sabbath day is holy.\nAs you read\nMoses 3:2–3\n, ask your children to listen for what God did on the seventh day. Help your children find or draw pictures of things they can do on Sunday to make it a holy day and different from other days. Share with each other why it is important to you to keep the Sabbath day holy.\nHelp your children role-play explaining to a friend why they choose to do things on Sunday that honor Heavenly Father and Jesus. Suggest that they use\nGenesis 2:2–3\nin their explanations. How does keeping the Sabbath day holy show our love for Heavenly Father and Jesus Christ?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 3: Lesson 7: Lesson 7—Genesis 1:1–25This lesson can help students feel love and gratitude for Heavenly Father and Jesus Christ as they study the Creation of the earth.; Lesson 8: Lesson 8—Genesis 1:26–27This lesson can help students feel the importance of their identity and potential as sons and daughters of heavenly parents....",
      "content": "\n--- Lesson 7 ---\nThe majesty and beauty of our world testifies of glorious Creators who can transform something that is “without form, and void,” (see Genesis 1:2 ) into the wonders of this earth. This lesson can help students feel love and gratitude for Heavenly Father and Jesus Christ as they study the Creation of the earth. Student preparation: Invite students to ponder the beauty of the earth and all of God’s creations. Invite them to bring a picture of or be prepared to talk about something in this world that they enjoy. Possible Learning Activities Note: Although accounts of the Creation of the earth are also found in Moses 2 and Abraham 4 , this lesson will focus on the account recorded in Genesis 1 . Great creators and creations To begin class, consider showing pictures of a beautiful building that is a popular destination in your area. You could ask questions such as the following: What do you think makes people want to visit a building like this? How do you think the creators of beautiful buildings feel when people enjoy their work? You could then display a picture of a beautiful landscape near your area. Invite students to do the following to help prepare them for today’s lesson. Think about how you feel or thoughts you have when you see the beauty and majesty of the earth. Consider how often you take time to admire or appreciate these earthly wonders. As you study today, prayerfully invite the Holy Ghost to help you feel love and gratitude to Heavenly Father and Jesus Christ for the creation of this world. The Creation Before introducing the following study activity, consider inviting the students to share what they know about the creation of the earth. Then refer students to the following sentence from “ The Living Christ: The Testimony of the Apostles .” Invite students to write this truth in their study journals or as a note in their scriptures. You could also write it on the board. In “ The Living Christ: The Testimony of the Apostles ,” we learn: Under the direction of His Father, [Jesus Christ] was the creator of the earth. (“ The Living Christ: The Testimony of the Apostles ,” ChurchofJesusChrist.org ) Genesis 1 contains some of the details about Jesus Christ creating the earth. Read the account of the first six creative periods from Genesis 1 , looking for what we learn about the Creator and creation. As students study the following verses, you could invite them to identify and mark each “day” of Creation in their scriptures. One way to do this is to copy the following chart on the board and give students time to complete it. You could organize students into smaller groups and assign each group one set of verses to study from the chart. It might be helpful to explain that the word “day” refers to a period of creation, not a specific span of time (see Abraham 4 , where the creative periods are labeled “time”). Note : The creation of man and woman will be addressed in greater depth in lessons “ Genesis 1:26–27 ” and “ Genesis 1:28–2:25 .” Be careful that this portion of the lesson does not take too long so students will have enough time to focus on the section titled “The Savior’s role as Creator.” Day 1: Genesis 1:1–5 Divided light from the darkness Day 2: Genesis 1:6–8 Day 3: Genesis 1:9–13 Day 4: Genesis 1:14–19 Day 5: Genesis 1:20–23 Day 7: Genesis 1:24–27 What thoughts or feelings do you have about Heavenly Father and Jesus Christ as you study these verses? Students may have questions about some of the details of the Creation. Help them understand that the accounts of the Creation are not meant to provide a literal, scientific explanation of the specific processes, time periods, or events involved. It may be helpful to read Doctrine and Covenants 101:32–34 and reassure the students that the Savior will reveal all things in His time. The Savior’s role as Creator Give students an opportunity to deepen their appreciation for Jesus Christ as the Creator. One way to do this could be to draw a picture on the board of the earth and display the following scripture references for students to study. You could invite them to study some or all of the verses and come to the board to write meaningful phrases they found around the picture of the earth. As students study these verses, invite them to pay close attention to how the Spirit can testify to them of the Savior’s role as the Creator. Select one or more of the following verses to study, looking for teachings that can enhance your understanding and appreciation of Jesus Christ as the Creator. Alma 30:43–44 Doctrine and Covenants 38:1–3 Doctrine and Covenants 59:18–20 Doctrine and Covenants 76:22–24 Moses 1:33, 39 Moses 6:63 Invite students to share their insights. One way you could do this is by displaying the following questions for students to discuss. What were some meaningful words or phrases from the verses you studied? Why? What did these verses help you learn or feel about Heavenly Father and Jesus Christ? Invite students to reflect on how the Savior’s role as Creator has impacted their lives. As part of this reflection time, you could consider showing “ We Lived with God ” (4:00), available at ChurchofJesusChrist.org . 4:0 You could also use the story from President Boyd K. Packer in “ Additional Resources .” Express gratitude for the Creator This portion of the lesson is intended to help students express their love and gratitude to Jesus Christ because of His role as Creator. To help them do this, consider using one or more of the following activities. You could display the options you select and invite students to choose one to complete. Write a poem or journal entry that expresses gratitude for Jesus Christ and His creations. Draw a picture that represents your feelings toward the Savior and His creations. Select a hymn that is about the Savior and His creations. Study the words to the music. You could search “Jesus Christ—Creator” in the Topic section of the hymnbook. You could write an additional verse to the hymn that reflects your feelings about Heavenly Father, Jesus Christ, and the Creation. After enough time, invite students to share what they learned and felt from the activity. Look for opportunities to use sacred music to invite the influence of the Spirit. Inspirational music can create a feeling of reverence and help students feel the power of the truths they are learning. If students selected meaningful hymns to express their love and gratitude to Jesus Christ, the class could sing one or more of them together, and students could share the additional verse they wrote. (For additional teacher training on the use of inspirational music, see “ Create settings and opportunities for learners to be taught by the Holy Ghost ” in Teacher Development Skills .) You could also invite students to read the poem or journal entry they wrote. You could display the artwork students created and invite them to share what they depicted and why. Consider concluding class by sharing your feelings about the Savior’s role in the Creation.\n\n\n--- Lesson 8 ---\nDuring the sixth period of creation, God created man and woman. Every person on earth is a beloved son or daughter of heavenly parents and has a divine nature and destiny. This lesson can help students feel the importance of their identity and potential as sons and daughters of heavenly parents. Student preparation: Invite students to memorize or review the opening lines of the Young Women and Aaronic Priesthood themes and to reflect on the significance of each statement: Possible Learning Activities Identities and labels Consider drawing a timeline on the board and invite students to create their own personal timeline in their study journals. A sample timeline is provided below. Draw a horizontal line representing your life and label it with various identities or titles you have had in the past, currently have, or anticipate having in the future. This could include “friend,” “student,” or a job title or calling you have had. The following is an example: What are some identities or titles you chose to put on your timeline? Why? In what ways could these identities or titles influence choices you make? President Russell M. Nelson explained how the ways we label ourselves can affect us. 31:24 Labels can be fun and indicate your support for any number of positive things. Many labels will change for you with the passage of time. And not all labels are of equal value. But if any label replaces your most important identifiers, the results can be spiritually suffocating. (“ Choices for Eternity ” [worldwide devotional for young adults, May 15, 2022], broadcasts.ChurchofJesusChrist.org) How do you think some labels could be spiritually suffocating? Children of heavenly parents Read Genesis 1:26–27 and the following statement from “ The Family: A Proclamation to the World ,” looking for insights about your eternal identity. Genesis 1:26–27 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. All human beings—male and female—are created in the image of God. Each is a beloved spirit son or daughter of heavenly parents, and, as such, each has a divine nature and destiny. Gender is an essential characteristic of individual premortal, mortal, and eternal identity and purpose. (“ The Family: A Proclamation to the World ,” ChurchofJesusChrist.org ) What insights did you gain about your eternal identity? One truth students may have identified is that we are sons and daughters of heavenly parents, created in their image . If they have not already done so, invite students to write “Child of God” across their timeline. What do you think it means to be created in God’s image? President Thomas S. Monson (1927–2018) shared the following insight about being created in God’s image. God our Father has ears with which to hear our prayers. He has eyes with which to see our actions. He has a mouth with which to speak to us. He has a heart with which to feel compassion and love. He is real. He is living. We are his children, made in his image. We look like him, and he looks like us. (“ I Know That My Redeemer Lives ,” Ensign , Apr. 1990, 6) Why do you think it would be important to place your identity as a child of God above any other identity you have? Give students time to ponder how important their identity as children of God currently is to them. Doing so can invite the Holy Ghost to testify of truth or help prepare students’ minds and hearts to be taught. What obstacles could make it difficult to believe or remember your identity as a child of God, created in His image? Consider writing student responses to the previous question on the board. Possible answers could be that some people might not understand why being a child of God matters, they struggle to feel God’s love, or they are distracted by less-important identifiers. If students have questions about gender, follow the Savior’s example as you teach His doctrine in a way that brings understanding, hope, and healing. Testify that God loves all His children and will help students navigate their questions as they apply the principles of acquiring spiritual knowledge. For an idea on how to help students with questions about gender, see the Supplemental Learning Activities . Words of scriptures and prophets Provide students with the handout titled “ I Am a Child of God .” Invite students to seek inspiration from God as they study to help them recognize the significance of their divine identity. In addition to the handout, you could invite students to review the teachings found in the Young Women and Aaronic Priesthood themes. Students could do this individually or in small groups. Open PDF When students have finished studying, you could invite them to share what they learned with the class or in small groups. You could also ask questions such as the following: What did you find from the resources you studied that was meaningful to you? How can knowing your identity as a child of God affect the way you see yourself and others? How has the knowledge of your divine identity and potential impacted your life? If students would benefit from seeing an example of how knowing their eternal identity can affect them, consider watching “ Running Toward the Light ” (17:34), available at ChurchofJesusChrist.org , from time code 11:00 to 15:19. In this video, Elder Peter M. Johnson of the Seventy shared his experience of learning that he is a child of God and the influence that knowledge has had on his life. After the video, you could invite a few students to share what impressed them from Elder Johnson’s message. 17:34 Reflect on your identity Give students time to reflect on what they have learned about their identity and potential as daughters and sons of heavenly parents. Invite them to record in their study journals any impressions or insights they have received that they would like to remember. Consider concluding by singing “ I Am a Child of God ” as a class, then sharing your testimony about being a child of God. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Genesis 1:26–27 is “God created man in his own image.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 9 ---\nAfter the creation of Adam and Eve, Heavenly Father joined them together in marriage. He commanded them to multiply and replenish the earth and to cleave to one another. This lesson can help students understand the central role of marriage and family in Heavenly Father’s plan of salvation. Student preparation: Invite the students to study “ The Family: A Proclamation to the World ,” looking for teachings that describe why family is central to Heavenly Father’s plan of salvation. Possible Learning Activities When discussing the importance of marriage and family in Heavenly Father’s plan of salvation, recognize that many students do not currently experience ideal family situations. Be sensitive to the needs and questions of students. Things that are central Consider writing on the board one or more incomplete sentences that illustrate how an object, activity, person, and so on could be central to accomplishing something. The following examples may be useful. Invite the students to think about how they would fill in the blanks, then ask various students to share their answers with the class. It may be helpful to explain that the word central could also mean essential or most important . is central to succeeding in school because . is a central part of a happy life because . plays a central role in my life because . After students have shared their responses, display the following statement from “ The Family: A Proclamation to the World ,” and invite a student to read it aloud. Ask the class to look for a central aspect of our Heavenly Father’s plan of salvation. “ The Family: A Proclamation to the World ” states: We, the First Presidency and the Council of the Twelve Apostles of The Church of Jesus Christ of Latter-day Saints, solemnly proclaim that marriage between a man and a woman is ordained of God and that the family is central to the Creator’s plan for the eternal destiny of His children. (“ The Family: A Proclamation to the World ,” Gospel Library) Why do you think marriage and family play such important roles in Heavenly Father’s plan of salvation? In what ways can you see Satan working to attack marriages and families in our day? Invite students to think about some of the questions they or others may have about marriage and family. They could write their questions in their study journals. Encourage them as they study today to look for truths and to pay attention to spiritual impressions that can help guide them in finding answers to these questions. Teachings from the scriptures Explain that what Heavenly Father did after the earth’s Creation can help us understand the central role of marriage and family in His plan. Display the following instructions and resources, and give students time to study them. You could study these together as a class, or you could organize the students into groups to study and discuss these resources together. As students read the verses from Genesis 2 , you may want to explain that the words help meet in verse 18 refers to “a helper suited to, worthy of, or corresponding to” Adam (see footnote 18b). You could also explain that the account of Eve being created from Adam’s rib is symbolic and can represent the equal partnership between husband and wife (see Russell M. Nelson, “ Lessons from Eve ,” Ensign , Nov. 1987, 87). Study the following statement and scriptures, looking for evidence of the importance of marriage and family to God. President Spencer W. Kimball (1895–1985) taught: The Lord … [brought] together Adam and Eve, his first male and first female on this earth, and perform[ed] a holy marriage ceremony to make them husband and wife. ( Teachings of Presidents of the Church: Spencer W. Kimball [2006], 192 ) Scriptures to study: Genesis 1:27–28 (God’s commandment to Adam and Eve) Genesis 2:18, 21–24 (Creation of Eve) Genesis 2:24 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Doctrine and Covenants 49:15–17 (The Lord’s teachings through the Prophet Joseph Smith) What truths did you find that demonstrate the importance of marriage and family to God? Students may identify truths similar to the following: God has commanded husbands and wives to have children ( Genesis 1:28 ). Husband and wife are to be one and act as equal partners ( Genesis 2:18, 24 ). Marriage between a man and a woman is ordained of God ( Doctrine and Covenants 49:15 ). The earth was created to provide a place where God’s children could be born into families and progress together ( Doctrine and Covenants 49:16–17 ). As part of your discussion of these truths, it may be helpful to discuss the following statement by President Russell M. Nelson. President Russell M. Nelson emphasized the important role families would play after the earth had been created by God: Grand as it is, planet Earth is part of something even grander—that great plan of God. Simply summarized, the earth was created that families might be. Scripture explains that a husband and wife “shall be one flesh, and all this that the earth might answer the end of its creation” [ Doctrine and Covenants 49:16 ]. (“ The Creation ,” Ensign , May 2000, 85) How can remembering the central role of marriage and family in God’s plan affect the choices you make in your life? How can these truths and teachings help us respond when we see the doctrine of marriage or family being criticized or minimized? How do you think following Heavenly Father’s standards related to marriage and family can help you become more like Him? Create a response To help the students explain what they have learned about the importance of marriage and family in God’s plan, consider sharing a scenario like the following. You can adapt this scenario to be more relevant to your culture and your students’ lives. After sharing the scenario, display the instructions for students to create a response. In one of Elizabeth’s school classes, a discussion took place about marriage and family. Elizabeth shared some of her views about marriage being between a man and a woman and the importance of married couples having children. Many of Elizabeth’s classmates shared opinions that were very different from hers. After class, a young man named Isaac, who is also in Elizabeth’s seminary class, asked Elizabeth why she had such outdated opinions about marriage and family. Using what you have learned today, create a response that Elizabeth could share with Isaac. Include the following in your response: An explanation about why marriage and family are important to Heavenly Father and His plan of salvation One or more teachings from the scriptures or Church leaders An invitation Elizabeth could share with Isaac that could help him After the students have had time to prepare, give them an opportunity to share their responses. They could share them with a partner or small group. A few willing students could also be invited to share their responses with the class or to role-play the scenario. Give students time to reflect on what they learned and felt today. They could think about truths they learned that answered some of their questions. Invite them to record any spiritual impressions they have had in their study journals. Testify of the truths you have discussed today. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Genesis 2:24 is “A man … shall cleave unto his wife: and they shall be one.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Moses 2",
      "content": "1. And it came to pass that the Lord spake unto Moses, saying: Behold, Irevealunto you concerning thisheaven, and thisearth;writethe words which I speak. I am the Beginning and the End, theAlmighty God; by mineOnly BegottenIcreatedthese things; yea, in the beginning Icreatedtheheaven, and the earth upon which thou standest.\n2. And the earth was withoutform, and void; and I causeddarknessto come up upon the face of the deep; and mySpiritmovedupon the face of the water; for I am God.\n3. And I, God, said: Let there belight; and there was light.\n4. And I, God, saw the light; and that light wasgood. And I, God, divided thelightfrom the darkness.\n5. And I, God, called the light Day; and the darkness, I called Night; and this I did by thewordof my power, and it was done as Ispake; and the evening and the morning were the firstday.\n6. And again, I, God, said: Let there be afirmamentin the midst of the water, and it was so, even as I spake; and I said: Let it divide the waters from the waters; and it was done;\n7. And I, God, made the firmament and divided thewaters, yea, the great waters under the firmament from the waters which were above the firmament, and it was so even as I spake.\n8. And I, God, called the firmamentHeaven; and the evening and the morning were the second day.\n9. And I, God, said: Let thewatersunder the heaven be gathered together untooneplace, and it was so; and I, God, said: Let there be dry land; and it was so.\n10. And I, God, called the dry landEarth; and the gathering together of the waters, called I the Sea; and I, God, saw that all things which I had made were good.\n11. And I, God, said: Let the earth bring forthgrass, the herb yielding seed, the fruit tree yielding fruit, after his kind, and the tree yielding fruit, whose seed should be in itself upon the earth, and it was so even as I spake.\n12. And the earth brought forth grass, every herb yielding seed after his kind, and the tree yielding fruit, whose seed should be in itself, after hiskind; and I, God, saw that all things which I had made were good;\n13. And the evening and the morning were the third day.\n14. And I, God, said: Let there belightsin the firmament of the heaven, to divide the day from the night, and let them be for signs, andfor seasons, and for days, and for years;\n15. And let them be for lights in the firmament of the heaven to give light upon the earth; and it was so.\n16. And I, God, made two great lights; the greaterlightto rule the day, and the lesser light to rule the night, and thegreaterlight was the sun, and the lesser light was the moon; and the stars also were made even according to my word.\n17. And I, God, set them in the firmament of the heaven to give light upon the earth,\n18. And thesunto rule over the day, and the moon to rule over the night, and to divide the light from thedarkness; and I, God, saw that all things which I had made were good;\n19. And the evening and the morning were the fourth day.\n20. And I, God, said: Let the waters bring forth abundantly the moving creature that hath life, and fowl which may fly above the earth in the open firmament of heaven.\n21. And I, God, created greatwhales, and every living creature that moveth, which the waters brought forth abundantly, after their kind, and every winged fowl after his kind; and I, God, saw that all things which I had created were good.\n22. And I, God, blessed them, saying: Be fruitful, andmultiply, and fill the waters in the sea; and let fowl multiply in the earth;\n23. And the evening and the morning were the fifth day.\n24. And I, God, said: Let the earth bring forth the living creature after his kind, cattle, and creeping things, and beasts of the earth after their kind, and it was so;\n25. And I, God, made the beasts of the earth after their kind, and cattle after their kind, and everything which creepeth upon the earth after his kind; and I, God, saw that all these things were good.\n26. And I, God, said unto mineOnly Begotten, which was with me from thebeginning: Letusmakeman in ourimage, after our likeness; and it was so. And I, God, said: Let them havedominionover the fishes of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.\n27. And I, God, created man in mine ownimage, in the image of mine Only Begotten created I him; male and female created I them.\n28. And I, God, blessed them, and said unto them: Befruitful, andmultiply, and replenish the earth, and subdue it, and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.\n29. And I, God, said unto man: Behold, I have given you every herb bearing seed, which is upon the face of all the earth, and every tree in the which shall be the fruit of tree yielding seed; to you it shall be formeat.\n30. And to every beast of the earth, and to every fowl of the air, and to everything that creepeth upon the earth, wherein I grant life, there shall be given every clean herb for meat; and it was so, even as I spake.\n31. And I, God, saw everything that I had made, and, behold, all things which I had made were verygood; and the evening and the morning were thesixthday.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Moses 3",
      "content": "1. Thus theheavenand the earth were finished, and all thehostof them.\n2. And on the seventh day I, God, ended my work, and all things which I had made; and Irestedon theseventh dayfrom all my work, and all things which I had made were finished, and I, God, saw that they were good;\n3. And I, God,blessedthe seventh day, andsanctifiedit; because that in it I had rested from all myworkwhich I, God, had created and made.\n4. And now, behold, I say unto you, that these are the generations of the heaven and of the earth, when they werecreated, in the day that I, the Lord God, made theheavenand the earth,\n5. And every plant of the field before it was in the earth, and every herb of the field before it grew. For I, the Lord God,createdall things, of which I have spoken,spiritually, before they werenaturallyupon the face of the earth. For I, the Lord God, had not caused it to rain upon the face of the earth. And I, the Lord God, hadcreatedall the children of men; and not yet man to till theground; for inheavencreatedI them; and there was not yet flesh upon the earth, neither in the water, neither in the air;\n6. But I, the Lord God, spake, and there went up amistfrom the earth, and watered the whole face of the ground.\n7. And I, the Lord God, formed man from thedustof the ground, and breathed into his nostrils thebreath of life; andmanbecame livingsoul, thefirstflesh upon the earth, the first man also; nevertheless, all things were before created; but spiritually were they created and made according to my word.\n8. And I, the Lord God, planted garden eastward inEden, and there I put the man whom I had formed.\n9. And out of the ground made I, the Lord God, to grow every tree,naturally, that is pleasant to the sight of man; and man could behold it. And it became also alivingsoul. For it was spiritual in the day that I created it; for it remaineth in the sphere in which I, God, created it, yea, even all things which I prepared for the use of man; and man saw that it was good for food. And I, the Lord God, planted thetree of lifealso in the midst of the garden,and also the tree of knowledge of good and evil.\n10. And I, the Lord God, caused river to go out ofEdento water the garden; and from thence it was parted, and became into fourheads.\n11. And I, the Lord God, called the name of the first Pison, and it compasseth the whole land ofHavilah, where I, the Lord God, created much gold;\n12. And the gold of that land was good, and there was bdellium and theonyxstone.\n13. And the name of the second river was called Gihon; the same that compasseth the whole land ofEthiopia.\n14. And the name of the third river was Hiddekel; that which goeth toward the east of Assyria. And the fourth river was the Euphrates.\n15. And I, the Lord God, took the man, and put him into the Garden ofEden, to dress it, and to keep it.\n16. And I, the Lord God, commanded the man, saying: Of every tree of the garden thou mayest freely eat,\n17. But of the tree of theknowledgeof good and evil, thou shalt not eat of it, nevertheless, thou mayestchoosefor thyself, for it is given unto thee; but, remember that Iforbidit, for in thedaythou eatest thereof thou shalt surelydie.\n18. And I, the Lord God, said unto mineOnly Begotten, that it was not good that the man should bealone; wherefore, I will make anhelpmeet for him.\n19. And out of the ground I, the Lord God, formed everybeastof the field, and every fowl of the air; and commanded that they should come unto Adam, to see what he would call them; and they were also living souls; for I, God, breathed into them thebreath of life, and commanded that whatsoever Adam called every living creature, that should be the name thereof.\n20. And Adam gavenamesto all cattle, and to the fowl of the air, and to every beast of the field; but as for Adam, there was not found an help meet for him.\n21. And I, the Lord God, caused deep sleep to fall upon Adam; and he slept, and I took one of his ribs and closed up the flesh in the stead thereof;\n22. And the rib which I, the Lord God, had taken from man, made I awoman, and brought her unto the man.\n23. AndAdamsaid: This I know now is bone of my bones, andfleshof my flesh; she shall be called Woman, because she was taken out of man.\n24. Therefore shall man leave his father and his mother, and shallcleaveunto hiswife; andtheyshall beoneflesh.\n25. And they were both naked, the man and his wife, and were not ashamed.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Abraham 4",
      "content": "1. And then the Lord said: Let us go down. And they went down at the beginning, and they, that is theGods,organizedand formed theheavensand the earth.\n2. And the earth, after it was formed, was empty and desolate, because they had not formed anything but the earth; anddarknessreigned upon the face of the deep, and the Spirit of the Godswasbrooding upon the face of the waters.\n3. And they (the Gods) said: Let there be light; and there was light.\n4. And they (the Gods) comprehended the light, for it wasbright; and they divided the light, or caused it to be divided, from the darkness.\n5. And the Gods called the light Day, and the darkness they called Night. And it came to pass that from the evening until morning they callednight; and from the morning until the evening they called day; and this was the first, or the beginning, of that which they called day and night.\n6. And the Gods also said: Let there be anexpansein the midst of the waters, and it shall divide the waters from the waters.\n7. And the Gods ordered the expanse, so that it divided the waters which were under the expanse fromthe waters which were above the expanse; and it was so, even as they ordered.\n8. And the Gods called the expanse, Heaven. And it came to pass that it was from evening until morning that they called night; and it came to pass that it was from morning until evening that they called day; and this was the secondtimethat they called night and day.\n9. And the Gods ordered, saying: Let thewatersunder the heaven be gathered together untooneplace, and let the earth come up dry; and it was so as they ordered;\n10. And the Gods pronounced the dry land, Earth; and the gathering together of the waters, pronounced they,GreatWaters; and the Gods saw that they were obeyed.\n11. And the Gods said: Let us prepare the earth to bring forthgrass; the herb yielding seed; the fruit tree yielding fruit, after his kind, whose seed in itself yieldeth its own likeness upon the earth; and it was so, even as they ordered.\n12. And the Gods organized theearthto bring forth grass from its own seed, and the herb to bring forth herb from its own seed, yielding seed after his kind; and the earth to bring forth the tree from its own seed, yielding fruit, whose seed could only bring forth the same in itself, after his kind; and the Gods saw that they were obeyed.\n13. And it came to pass that they numbered the days; from the evening until the morning they called night; and it came to pass, from the morning until the evening they called day; and it was the third time.\n14. And the Gods organized thelightsin the expanse of the heaven, and caused them to divide the day from the night; and organized them to be for signs and for seasons, and for days and for years;\n15. And organized them to be for lights in the expanse of the heaven to give light upon the earth; and it was so.\n16. And the Gods organized the two great lights, thegreaterlight to rule the day, and the lesser light to rule the night; with the lesser light they set the stars also;\n17. And the Gods set them in the expanse of the heavens, to give light upon the earth, and to rule over the day and over the night, and to cause to divide the light from thedarkness.\n18. And the Gods watched those things which they hadordereduntil they obeyed.\n19. And it came to pass that it was from evening until morning that it was night; and it came to pass that it was from morning until evening that it was day; and it was the fourth time.\n20. And the Gods said: Let us prepare the waters to bring forth abundantly the moving creatures that have life; and the fowl, that they may fly above the earth in the open expanse of heaven.\n21. And the Gods prepared the waters that they might bring forth greatwhales, and every living creature that moveth, which the waters were to bring forth abundantly after their kind; and every winged fowl after their kind. And the Gods saw that they would be obeyed, and that their plan was good.\n22. And the Gods said: We will bless them, and cause them to be fruitful and multiply, and fill the waters in the seas orgreat waters; and cause the fowl to multiply in the earth.\n23. And it came to pass that it was from evening until morning that they called night; and it came topass that it was from morning until evening that they called day; and it was the fifth time.\n24. And the Gods prepared the earth to bring forth the living creature after his kind, cattle and creeping things, and beasts of the earth after their kind; and it was so, as they had said.\n25. And the Gods organized the earth to bring forth the beasts after their kind, and cattle after their kind, and every thing that creepeth upon the earth after its kind; and the Gods saw they would obey.\n26. And the Gods tookcounselamong themselves and said: Let us go down andformman in ourimage, after our likeness; and we will give them dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.\n27. So theGodswent down to organize man in their ownimage, in the image of the Gods to form they him, male and female to form they them.\n28. And the Gods said: We will bless them. And the Gods said: We will cause them to be fruitful and multiply, and replenish the earth, and subdue it, and to have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.\n29. And the Gods said: Behold, we will give them every herb bearing seed that shall come upon the face of all the earth, and every tree which shall have fruit upon it; yea, the fruit of the tree yielding seed to them we will give it; it shall be for theirmeat.\n30. And to every beast of the earth, and to every fowl of the air, and to every thing that creepeth upon the earth, behold, we will give them life, and also we will give to them every green herb for meat, and all these things shall be thus organized.\n31. And the Gods said: We will do everything that we have said, and organize them; and behold, they shall be very obedient. And it came to pass that it was from evening until morning they called night; and it came to pass that it was from morning until evening that they called day; and they numbered thesixthtime.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Abraham 5",
      "content": "1. And thus we will finish the heavens and the earth, and all thehostsof them.\n2. And the Gods said among themselves: On the seventh time we will end our work, which we have counseled; and we willreston theseventhtime from all our work which we have counseled.\n3. And the Gods concluded upon the seventh time, because that on the seventh time they wouldrestfrom all theirworkswhich they (the Gods) counseled among themselves to form; andsanctifiedit. And thus were their decisions at the time that they counseled among themselves to form the heavens and the earth.\n4. And the Gods came down and formed these the generations of the heavens and of the earth, when they were formed in the day that theGodsformed the earth and the heavens,\n5. According to all that which they had said concerning every plant ofthe field before it was in theearth, and every herb of the field before it grew; for the Gods had not caused it to rain upon the earth when they counseled to do them, and had not formed man to till the ground.\n6. But there went up mist from the earth, and watered the whole face of the ground.\n7. And theGodsformed man from thedustof the ground, and took hisspirit(that is, the mans spirit), and put it into him; and breathed into his nostrils the breath of life, and man became livingsoul.\n8. And the Gods planted garden, eastward inEden, and there they put the man, whose spirit they had put into the body which they had formed.\n9. And out of the ground made the Gods to grow every tree that is pleasant to the sight and good for food; thetree of life, also, in the midst of the garden, and the tree of knowledge of good and evil.\n10. There was river running out of Eden, to water the garden, and from thence it was parted and became into four heads.\n11. And the Gods took the man and put him in the Garden of Eden, to dress it and to keep it.\n12. And the Gods commanded the man, saying: Of every tree of the garden thou mayest freely eat,\n13. But of the tree of knowledge of good and evil, thou shalt not eat of it; for in the time that thou eatest thereof, thou shalt surely die. Now I, Abraham, saw that it was after the Lordstime, which was after the time ofKolob; for as yet the Gods had not appointed unto Adam his reckoning.\n14. And the Gods said: Let us make an help meet for the man, for it is not good that the man should be alone, therefore we will form an help meet for him.\n15. And the Gods caused deep sleep to fall upon Adam; and he slept, and they took one of his ribs, and closed up the flesh in the stead thereof;\n16. And of the rib which the Gods had taken from man, formed they awoman, and brought her unto the man.\n17. And Adam said: This was bone of my bones, andfleshof my flesh; now she shall be called Woman, because she was taken out of man;\n18. Therefore shall man leave his father and his mother, and shallcleaveunto his wife, and they shall beoneflesh.\n19. And they were both naked, the man and his wife, and were notashamed.\n20. And out of the ground the Gods formed every beast of the field, and every fowl of the air, and brought them unto Adam to see what he would call them; and whatsoeverAdamcalled every living creature, that should be the name thereof.\n21. And Adam gavenamesto allcattle, to the fowl of the air, to every beast of the field; and for Adam, there was found anhelpmeet for him.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Moses": {
      "2": {
        "verses": {
          "1": {
            "text": "And it came to pass that the Lord spake unto Moses, saying: Behold, Irevealunto you concerning thisheaven, and thisearth;writethe words which I speak. I am the Beginning and the End, theAlmighty God; by mineOnly BegottenIcreatedthese things; yea, in the beginning Icreatedtheheaven, and the earth upon which thou standest.",
            "citation": "(Moses 2:1)"
          },
          "2": {
            "text": "And the earth was withoutform, and void; and I causeddarknessto come up upon the face of the deep; and mySpiritmovedupon the face of the water; for I am God.",
            "citation": "(Moses 2:2)"
          },
          "3": {
            "text": "And I, God, said: Let there belight; and there was light.",
            "citation": "(Moses 2:3)"
          },
          "4": {
            "text": "And I, God, saw the light; and that light wasgood. And I, God, divided thelightfrom the darkness.",
            "citation": "(Moses 2:4)"
          },
          "5": {
            "text": "And I, God, called the light Day; and the darkness, I called Night; and this I did by thewordof my power, and it was done as Ispake; and the evening and the morning were the firstday.",
            "citation": "(Moses 2:5)"
          },
          "6": {
            "text": "And again, I, God, said: Let there be afirmamentin the midst of the water, and it was so, even as I spake; and I said: Let it divide the waters from the waters; and it was done;",
            "citation": "(Moses 2:6)"
          },
          "7": {
            "text": "And I, God, made the firmament and divided thewaters, yea, the great waters under the firmament from the waters which were above the firmament, and it was so even as I spake.",
            "citation": "(Moses 2:7)"
          },
          "8": {
            "text": "And I, God, called the firmamentHeaven; and the evening and the morning were the second day.",
            "citation": "(Moses 2:8)"
          },
          "9": {
            "text": "And I, God, said: Let thewatersunder the heaven be gathered together untooneplace, and it was so; and I, God, said: Let there be dry land; and it was so.",
            "citation": "(Moses 2:9)"
          },
          "10": {
            "text": "And I, God, called the dry landEarth; and the gathering together of the waters, called I the Sea; and I, God, saw that all things which I had made were good.",
            "citation": "(Moses 2:10)"
          },
          "11": {
            "text": "And I, God, said: Let the earth bring forthgrass, the herb yielding seed, the fruit tree yielding fruit, after his kind, and the tree yielding fruit, whose seed should be in itself upon the earth, and it was so even as I spake.",
            "citation": "(Moses 2:11)"
          },
          "12": {
            "text": "And the earth brought forth grass, every herb yielding seed after his kind, and the tree yielding fruit, whose seed should be in itself, after hiskind; and I, God, saw that all things which I had made were good;",
            "citation": "(Moses 2:12)"
          },
          "13": {
            "text": "And the evening and the morning were the third day.",
            "citation": "(Moses 2:13)"
          },
          "14": {
            "text": "And I, God, said: Let there belightsin the firmament of the heaven, to divide the day from the night, and let them be for signs, andfor seasons, and for days, and for years;",
            "citation": "(Moses 2:14)"
          },
          "15": {
            "text": "And let them be for lights in the firmament of the heaven to give light upon the earth; and it was so.",
            "citation": "(Moses 2:15)"
          },
          "16": {
            "text": "And I, God, made two great lights; the greaterlightto rule the day, and the lesser light to rule the night, and thegreaterlight was the sun, and the lesser light was the moon; and the stars also were made even according to my word.",
            "citation": "(Moses 2:16)"
          },
          "17": {
            "text": "And I, God, set them in the firmament of the heaven to give light upon the earth,",
            "citation": "(Moses 2:17)"
          },
          "18": {
            "text": "And thesunto rule over the day, and the moon to rule over the night, and to divide the light from thedarkness; and I, God, saw that all things which I had made were good;",
            "citation": "(Moses 2:18)"
          },
          "19": {
            "text": "And the evening and the morning were the fourth day.",
            "citation": "(Moses 2:19)"
          },
          "20": {
            "text": "And I, God, said: Let the waters bring forth abundantly the moving creature that hath life, and fowl which may fly above the earth in the open firmament of heaven.",
            "citation": "(Moses 2:20)"
          },
          "21": {
            "text": "And I, God, created greatwhales, and every living creature that moveth, which the waters brought forth abundantly, after their kind, and every winged fowl after his kind; and I, God, saw that all things which I had created were good.",
            "citation": "(Moses 2:21)"
          },
          "22": {
            "text": "And I, God, blessed them, saying: Be fruitful, andmultiply, and fill the waters in the sea; and let fowl multiply in the earth;",
            "citation": "(Moses 2:22)"
          },
          "23": {
            "text": "And the evening and the morning were the fifth day.",
            "citation": "(Moses 2:23)"
          },
          "24": {
            "text": "And I, God, said: Let the earth bring forth the living creature after his kind, cattle, and creeping things, and beasts of the earth after their kind, and it was so;",
            "citation": "(Moses 2:24)"
          },
          "25": {
            "text": "And I, God, made the beasts of the earth after their kind, and cattle after their kind, and everything which creepeth upon the earth after his kind; and I, God, saw that all these things were good.",
            "citation": "(Moses 2:25)"
          },
          "26": {
            "text": "And I, God, said unto mineOnly Begotten, which was with me from thebeginning: Letusmakeman in ourimage, after our likeness; and it was so. And I, God, said: Let them havedominionover the fishes of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.",
            "citation": "(Moses 2:26)"
          },
          "27": {
            "text": "And I, God, created man in mine ownimage, in the image of mine Only Begotten created I him; male and female created I them.",
            "citation": "(Moses 2:27)"
          },
          "28": {
            "text": "And I, God, blessed them, and said unto them: Befruitful, andmultiply, and replenish the earth, and subdue it, and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.",
            "citation": "(Moses 2:28)"
          },
          "29": {
            "text": "And I, God, said unto man: Behold, I have given you every herb bearing seed, which is upon the face of all the earth, and every tree in the which shall be the fruit of tree yielding seed; to you it shall be formeat.",
            "citation": "(Moses 2:29)"
          },
          "30": {
            "text": "And to every beast of the earth, and to every fowl of the air, and to everything that creepeth upon the earth, wherein I grant life, there shall be given every clean herb for meat; and it was so, even as I spake.",
            "citation": "(Moses 2:30)"
          },
          "31": {
            "text": "And I, God, saw everything that I had made, and, behold, all things which I had made were verygood; and the evening and the morning were thesixthday.",
            "citation": "(Moses 2:31)"
          }
        }
      },
      "3": {
        "verses": {
          "1": {
            "text": "Thus theheavenand the earth were finished, and all thehostof them.",
            "citation": "(Moses 3:1)"
          },
          "2": {
            "text": "And on the seventh day I, God, ended my work, and all things which I had made; and Irestedon theseventh dayfrom all my work, and all things which I had made were finished, and I, God, saw that they were good;",
            "citation": "(Moses 3:2)"
          },
          "3": {
            "text": "And I, God,blessedthe seventh day, andsanctifiedit; because that in it I had rested from all myworkwhich I, God, had created and made.",
            "citation": "(Moses 3:3)"
          },
          "4": {
            "text": "And now, behold, I say unto you, that these are the generations of the heaven and of the earth, when they werecreated, in the day that I, the Lord God, made theheavenand the earth,",
            "citation": "(Moses 3:4)"
          },
          "5": {
            "text": "And every plant of the field before it was in the earth, and every herb of the field before it grew. For I, the Lord God,createdall things, of which I have spoken,spiritually, before they werenaturallyupon the face of the earth. For I, the Lord God, had not caused it to rain upon the face of the earth. And I, the Lord God, hadcreatedall the children of men; and not yet man to till theground; for inheavencreatedI them; and there was not yet flesh upon the earth, neither in the water, neither in the air;",
            "citation": "(Moses 3:5)"
          },
          "6": {
            "text": "But I, the Lord God, spake, and there went up amistfrom the earth, and watered the whole face of the ground.",
            "citation": "(Moses 3:6)"
          },
          "7": {
            "text": "And I, the Lord God, formed man from thedustof the ground, and breathed into his nostrils thebreath of life; andmanbecame livingsoul, thefirstflesh upon the earth, the first man also; nevertheless, all things were before created; but spiritually were they created and made according to my word.",
            "citation": "(Moses 3:7)"
          },
          "8": {
            "text": "And I, the Lord God, planted garden eastward inEden, and there I put the man whom I had formed.",
            "citation": "(Moses 3:8)"
          },
          "9": {
            "text": "And out of the ground made I, the Lord God, to grow every tree,naturally, that is pleasant to the sight of man; and man could behold it. And it became also alivingsoul. For it was spiritual in the day that I created it; for it remaineth in the sphere in which I, God, created it, yea, even all things which I prepared for the use of man; and man saw that it was good for food. And I, the Lord God, planted thetree of lifealso in the midst of the garden,and also the tree of knowledge of good and evil.",
            "citation": "(Moses 3:9)"
          },
          "10": {
            "text": "And I, the Lord God, caused river to go out ofEdento water the garden; and from thence it was parted, and became into fourheads.",
            "citation": "(Moses 3:10)"
          },
          "11": {
            "text": "And I, the Lord God, called the name of the first Pison, and it compasseth the whole land ofHavilah, where I, the Lord God, created much gold;",
            "citation": "(Moses 3:11)"
          },
          "12": {
            "text": "And the gold of that land was good, and there was bdellium and theonyxstone.",
            "citation": "(Moses 3:12)"
          },
          "13": {
            "text": "And the name of the second river was called Gihon; the same that compasseth the whole land ofEthiopia.",
            "citation": "(Moses 3:13)"
          },
          "14": {
            "text": "And the name of the third river was Hiddekel; that which goeth toward the east of Assyria. And the fourth river was the Euphrates.",
            "citation": "(Moses 3:14)"
          },
          "15": {
            "text": "And I, the Lord God, took the man, and put him into the Garden ofEden, to dress it, and to keep it.",
            "citation": "(Moses 3:15)"
          },
          "16": {
            "text": "And I, the Lord God, commanded the man, saying: Of every tree of the garden thou mayest freely eat,",
            "citation": "(Moses 3:16)"
          },
          "17": {
            "text": "But of the tree of theknowledgeof good and evil, thou shalt not eat of it, nevertheless, thou mayestchoosefor thyself, for it is given unto thee; but, remember that Iforbidit, for in thedaythou eatest thereof thou shalt surelydie.",
            "citation": "(Moses 3:17)"
          },
          "18": {
            "text": "And I, the Lord God, said unto mineOnly Begotten, that it was not good that the man should bealone; wherefore, I will make anhelpmeet for him.",
            "citation": "(Moses 3:18)"
          },
          "19": {
            "text": "And out of the ground I, the Lord God, formed everybeastof the field, and every fowl of the air; and commanded that they should come unto Adam, to see what he would call them; and they were also living souls; for I, God, breathed into them thebreath of life, and commanded that whatsoever Adam called every living creature, that should be the name thereof.",
            "citation": "(Moses 3:19)"
          },
          "20": {
            "text": "And Adam gavenamesto all cattle, and to the fowl of the air, and to every beast of the field; but as for Adam, there was not found an help meet for him.",
            "citation": "(Moses 3:20)"
          },
          "21": {
            "text": "And I, the Lord God, caused deep sleep to fall upon Adam; and he slept, and I took one of his ribs and closed up the flesh in the stead thereof;",
            "citation": "(Moses 3:21)"
          },
          "22": {
            "text": "And the rib which I, the Lord God, had taken from man, made I awoman, and brought her unto the man.",
            "citation": "(Moses 3:22)"
          },
          "23": {
            "text": "AndAdamsaid: This I know now is bone of my bones, andfleshof my flesh; she shall be called Woman, because she was taken out of man.",
            "citation": "(Moses 3:23)"
          },
          "24": {
            "text": "Therefore shall man leave his father and his mother, and shallcleaveunto hiswife; andtheyshall beoneflesh.",
            "citation": "(Moses 3:24)"
          },
          "25": {
            "text": "And they were both naked, the man and his wife, and were not ashamed.",
            "citation": "(Moses 3:25)"
          }
        }
      }
    },
    "Abraham": {
      "4": {
        "verses": {
          "1": {
            "text": "And then the Lord said: Let us go down. And they went down at the beginning, and they, that is theGods,organizedand formed theheavensand the earth.",
            "citation": "(Abraham 4:1)"
          },
          "2": {
            "text": "And the earth, after it was formed, was empty and desolate, because they had not formed anything but the earth; anddarknessreigned upon the face of the deep, and the Spirit of the Godswasbrooding upon the face of the waters.",
            "citation": "(Abraham 4:2)"
          },
          "3": {
            "text": "And they (the Gods) said: Let there be light; and there was light.",
            "citation": "(Abraham 4:3)"
          },
          "4": {
            "text": "And they (the Gods) comprehended the light, for it wasbright; and they divided the light, or caused it to be divided, from the darkness.",
            "citation": "(Abraham 4:4)"
          },
          "5": {
            "text": "And the Gods called the light Day, and the darkness they called Night. And it came to pass that from the evening until morning they callednight; and from the morning until the evening they called day; and this was the first, or the beginning, of that which they called day and night.",
            "citation": "(Abraham 4:5)"
          },
          "6": {
            "text": "And the Gods also said: Let there be anexpansein the midst of the waters, and it shall divide the waters from the waters.",
            "citation": "(Abraham 4:6)"
          },
          "7": {
            "text": "And the Gods ordered the expanse, so that it divided the waters which were under the expanse fromthe waters which were above the expanse; and it was so, even as they ordered.",
            "citation": "(Abraham 4:7)"
          },
          "8": {
            "text": "And the Gods called the expanse, Heaven. And it came to pass that it was from evening until morning that they called night; and it came to pass that it was from morning until evening that they called day; and this was the secondtimethat they called night and day.",
            "citation": "(Abraham 4:8)"
          },
          "9": {
            "text": "And the Gods ordered, saying: Let thewatersunder the heaven be gathered together untooneplace, and let the earth come up dry; and it was so as they ordered;",
            "citation": "(Abraham 4:9)"
          },
          "10": {
            "text": "And the Gods pronounced the dry land, Earth; and the gathering together of the waters, pronounced they,GreatWaters; and the Gods saw that they were obeyed.",
            "citation": "(Abraham 4:10)"
          },
          "11": {
            "text": "And the Gods said: Let us prepare the earth to bring forthgrass; the herb yielding seed; the fruit tree yielding fruit, after his kind, whose seed in itself yieldeth its own likeness upon the earth; and it was so, even as they ordered.",
            "citation": "(Abraham 4:11)"
          },
          "12": {
            "text": "And the Gods organized theearthto bring forth grass from its own seed, and the herb to bring forth herb from its own seed, yielding seed after his kind; and the earth to bring forth the tree from its own seed, yielding fruit, whose seed could only bring forth the same in itself, after his kind; and the Gods saw that they were obeyed.",
            "citation": "(Abraham 4:12)"
          },
          "13": {
            "text": "And it came to pass that they numbered the days; from the evening until the morning they called night; and it came to pass, from the morning until the evening they called day; and it was the third time.",
            "citation": "(Abraham 4:13)"
          },
          "14": {
            "text": "And the Gods organized thelightsin the expanse of the heaven, and caused them to divide the day from the night; and organized them to be for signs and for seasons, and for days and for years;",
            "citation": "(Abraham 4:14)"
          },
          "15": {
            "text": "And organized them to be for lights in the expanse of the heaven to give light upon the earth; and it was so.",
            "citation": "(Abraham 4:15)"
          },
          "16": {
            "text": "And the Gods organized the two great lights, thegreaterlight to rule the day, and the lesser light to rule the night; with the lesser light they set the stars also;",
            "citation": "(Abraham 4:16)"
          },
          "17": {
            "text": "And the Gods set them in the expanse of the heavens, to give light upon the earth, and to rule over the day and over the night, and to cause to divide the light from thedarkness.",
            "citation": "(Abraham 4:17)"
          },
          "18": {
            "text": "And the Gods watched those things which they hadordereduntil they obeyed.",
            "citation": "(Abraham 4:18)"
          },
          "19": {
            "text": "And it came to pass that it was from evening until morning that it was night; and it came to pass that it was from morning until evening that it was day; and it was the fourth time.",
            "citation": "(Abraham 4:19)"
          },
          "20": {
            "text": "And the Gods said: Let us prepare the waters to bring forth abundantly the moving creatures that have life; and the fowl, that they may fly above the earth in the open expanse of heaven.",
            "citation": "(Abraham 4:20)"
          },
          "21": {
            "text": "And the Gods prepared the waters that they might bring forth greatwhales, and every living creature that moveth, which the waters were to bring forth abundantly after their kind; and every winged fowl after their kind. And the Gods saw that they would be obeyed, and that their plan was good.",
            "citation": "(Abraham 4:21)"
          },
          "22": {
            "text": "And the Gods said: We will bless them, and cause them to be fruitful and multiply, and fill the waters in the seas orgreat waters; and cause the fowl to multiply in the earth.",
            "citation": "(Abraham 4:22)"
          },
          "23": {
            "text": "And it came to pass that it was from evening until morning that they called night; and it came topass that it was from morning until evening that they called day; and it was the fifth time.",
            "citation": "(Abraham 4:23)"
          },
          "24": {
            "text": "And the Gods prepared the earth to bring forth the living creature after his kind, cattle and creeping things, and beasts of the earth after their kind; and it was so, as they had said.",
            "citation": "(Abraham 4:24)"
          },
          "25": {
            "text": "And the Gods organized the earth to bring forth the beasts after their kind, and cattle after their kind, and every thing that creepeth upon the earth after its kind; and the Gods saw they would obey.",
            "citation": "(Abraham 4:25)"
          },
          "26": {
            "text": "And the Gods tookcounselamong themselves and said: Let us go down andformman in ourimage, after our likeness; and we will give them dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.",
            "citation": "(Abraham 4:26)"
          },
          "27": {
            "text": "So theGodswent down to organize man in their ownimage, in the image of the Gods to form they him, male and female to form they them.",
            "citation": "(Abraham 4:27)"
          },
          "28": {
            "text": "And the Gods said: We will bless them. And the Gods said: We will cause them to be fruitful and multiply, and replenish the earth, and subdue it, and to have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.",
            "citation": "(Abraham 4:28)"
          },
          "29": {
            "text": "And the Gods said: Behold, we will give them every herb bearing seed that shall come upon the face of all the earth, and every tree which shall have fruit upon it; yea, the fruit of the tree yielding seed to them we will give it; it shall be for theirmeat.",
            "citation": "(Abraham 4:29)"
          },
          "30": {
            "text": "And to every beast of the earth, and to every fowl of the air, and to every thing that creepeth upon the earth, behold, we will give them life, and also we will give to them every green herb for meat, and all these things shall be thus organized.",
            "citation": "(Abraham 4:30)"
          },
          "31": {
            "text": "And the Gods said: We will do everything that we have said, and organize them; and behold, they shall be very obedient. And it came to pass that it was from evening until morning they called night; and it came to pass that it was from morning until evening that they called day; and they numbered thesixthtime.",
            "citation": "(Abraham 4:31)"
          }
        }
      },
      "5": {
        "verses": {
          "1": {
            "text": "And thus we will finish the heavens and the earth, and all thehostsof them.",
            "citation": "(Abraham 5:1)"
          },
          "2": {
            "text": "And the Gods said among themselves: On the seventh time we will end our work, which we have counseled; and we willreston theseventhtime from all our work which we have counseled.",
            "citation": "(Abraham 5:2)"
          },
          "3": {
            "text": "And the Gods concluded upon the seventh time, because that on the seventh time they wouldrestfrom all theirworkswhich they (the Gods) counseled among themselves to form; andsanctifiedit. And thus were their decisions at the time that they counseled among themselves to form the heavens and the earth.",
            "citation": "(Abraham 5:3)"
          },
          "4": {
            "text": "And the Gods came down and formed these the generations of the heavens and of the earth, when they were formed in the day that theGodsformed the earth and the heavens,",
            "citation": "(Abraham 5:4)"
          },
          "5": {
            "text": "According to all that which they had said concerning every plant ofthe field before it was in theearth, and every herb of the field before it grew; for the Gods had not caused it to rain upon the earth when they counseled to do them, and had not formed man to till the ground.",
            "citation": "(Abraham 5:5)"
          },
          "6": {
            "text": "But there went up mist from the earth, and watered the whole face of the ground.",
            "citation": "(Abraham 5:6)"
          },
          "7": {
            "text": "And theGodsformed man from thedustof the ground, and took hisspirit(that is, the mans spirit), and put it into him; and breathed into his nostrils the breath of life, and man became livingsoul.",
            "citation": "(Abraham 5:7)"
          },
          "8": {
            "text": "And the Gods planted garden, eastward inEden, and there they put the man, whose spirit they had put into the body which they had formed.",
            "citation": "(Abraham 5:8)"
          },
          "9": {
            "text": "And out of the ground made the Gods to grow every tree that is pleasant to the sight and good for food; thetree of life, also, in the midst of the garden, and the tree of knowledge of good and evil.",
            "citation": "(Abraham 5:9)"
          },
          "10": {
            "text": "There was river running out of Eden, to water the garden, and from thence it was parted and became into four heads.",
            "citation": "(Abraham 5:10)"
          },
          "11": {
            "text": "And the Gods took the man and put him in the Garden of Eden, to dress it and to keep it.",
            "citation": "(Abraham 5:11)"
          },
          "12": {
            "text": "And the Gods commanded the man, saying: Of every tree of the garden thou mayest freely eat,",
            "citation": "(Abraham 5:12)"
          },
          "13": {
            "text": "But of the tree of knowledge of good and evil, thou shalt not eat of it; for in the time that thou eatest thereof, thou shalt surely die. Now I, Abraham, saw that it was after the Lordstime, which was after the time ofKolob; for as yet the Gods had not appointed unto Adam his reckoning.",
            "citation": "(Abraham 5:13)"
          },
          "14": {
            "text": "And the Gods said: Let us make an help meet for the man, for it is not good that the man should be alone, therefore we will form an help meet for him.",
            "citation": "(Abraham 5:14)"
          },
          "15": {
            "text": "And the Gods caused deep sleep to fall upon Adam; and he slept, and they took one of his ribs, and closed up the flesh in the stead thereof;",
            "citation": "(Abraham 5:15)"
          },
          "16": {
            "text": "And of the rib which the Gods had taken from man, formed they awoman, and brought her unto the man.",
            "citation": "(Abraham 5:16)"
          },
          "17": {
            "text": "And Adam said: This was bone of my bones, andfleshof my flesh; now she shall be called Woman, because she was taken out of man;",
            "citation": "(Abraham 5:17)"
          },
          "18": {
            "text": "Therefore shall man leave his father and his mother, and shallcleaveunto his wife, and they shall beoneflesh.",
            "citation": "(Abraham 5:18)"
          },
          "19": {
            "text": "And they were both naked, the man and his wife, and were notashamed.",
            "citation": "(Abraham 5:19)"
          },
          "20": {
            "text": "And out of the ground the Gods formed every beast of the field, and every fowl of the air, and brought them unto Adam to see what he would call them; and whatsoeverAdamcalled every living creature, that should be the name thereof.",
            "citation": "(Abraham 5:20)"
          },
          "21": {
            "text": "And Adam gavenamesto allcattle, to the fowl of the air, to every beast of the field; and for Adam, there was found anhelpmeet for him.",
            "citation": "(Abraham 5:21)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 48544,
  "total_sources": 6,
  "generated_at": "2025-12-14T04:01:27.363234"
}