{
  "week_number": 2,
  "date_range": "Moses 1",
  "title": "Moses 1;Abraham 3",
  "primary_scriptures": [
    {
      "book": "Moses",
      "chapters": [
        "1"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    },
    {
      "book": "Abraham",
      "chapters": [
        "3"
      ],
      "verses": null,
      "book_type": "pearl_of_great_price"
    }
  ],
  "all_content": "\n\n--- CFM: Moses 1;Abraham 3 ---\nThe Bible begins with the words “in the beginning God created the heaven and the earth” (\nGenesis 1:1\n). But what was there\nbefore\nthis “beginning”? And\nwhy\ndid God create all of this? Through the Prophet Joseph Smith, the Lord has shed light on these questions.\nFor example, He gave us the record of a vision in which Abraham saw our existence as spirits “before the world was” (see\nAbraham 3:22–28\n). The Lord also gave us an inspired translation or revision of the first six chapters of Genesis, called the book of Moses—which doesn’t begin with “in the beginning.” Instead, it begins with an experience Moses had that provides some context for the Creation story. Together, these latter-day scriptures are a good place to start our study of the Old Testament because they address some fundamental questions that can frame our reading: Who is God? Who are we? What is God’s work, and what is our place in it? The opening chapters of Genesis could be seen as the Lord’s response to Moses’s request: “Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens” (\nMoses 1:36\n).\nIdeas for Learning at Home and at Church\nMoses 1\nAs a child of God, I have a divine destiny.\n“If the Lord were speaking to you directly,” President Russell M. Nelson taught, “the first thing He would make sure you understand is your true identity” (“\nChoices for Eternity\n” [worldwide devotional for young adults, May 2022], Gospel Library). It follows that Satan would try to confuse you on that same point. Look for this pattern in God’s message to Moses in\nMoses 1:4, 6\nand in Satan’s messages in\nMoses 1:12\n. What do you learn from these verses about the differences between God and Satan?\nPresident Nelson also taught, “The way you think about who you really are affects almost every decision you will ever make” (“\nChoices for Eternity\n”). Consider making a list of choices you make because your identity as a child of God comes before other labels.\nWhat additional verses or phrases in\nMoses 1\nhelp you understand your divine worth? You might also read more of President Nelson’s message in the section of “Choices for Eternity” titled “\nFirst: Know the truth about who you are.\n” What do you feel inspired to do to make your identity as a child of God your most important identifier?\nSee also “\nI Am a Child of God\n,”\nHymns\n(1985), no. 301; “\nOur True Identity\n” (video), Gospel Library; Topics and Questions, “\nChildren of God\n,” Gospel Library.\n3:39\nOur True Identity\nMoses 1:12–26\nWith the Lord’s help, I can resist Satan.\nAs\nMoses 1\nclearly shows, powerful spiritual experiences do not mean we’ll never be tempted again. In fact, one of Satan’s tactics is to tempt us to doubt these experiences. As you read Moses’s response to Satan in\nverses 12–26\n, what do you learn that can help you stay true to the testimony you have received? What was it that finally helped Moses overcome Satan?\nAnother lesson from Moses’s experience is that Satan tempts us with counterfeits of God’s truth and power. Think of some fake versions of things, such as an artificial plant or a baby doll. How can you tell they’re fake? Then consider the counterfeits Satan uses today to tempt you. What do you learn from\nMoses 1:13–18\nabout how to recognize and reject his counterfeits? How can the Lord help you? (see\nMoses 1:24–26\n).\nSee also\nMatthew 4:1–11\n; Gary E. Stevenson, “\nDeceive Me Not\n,”\nEnsign\nor\nLiahona\n, Nov. 2019, 93–96; “I Am a Son of God” (video), Gospel Library.\n6:31\nI Am a Son of God\nLearning at home can be planned but also spontaneous.\n“Teaching opportunities in the family frequently occur in informal, everyday moments—while eating a meal, doing chores, playing games, [or] traveling” (\nTeaching in the Savior’s Way\n, 31). For example, in addition to reading about how Moses resisted Satan in\nMoses 1\n, you might spend a few moments at dinnertime talking as a family about how you resisted the influence of the adversary.\nMoses 1:27–39\n;\nAbraham 3\nGod’s work and glory is to help me gain eternal life.\nAfter seeing a vision of God’s creations, Moses said to the Lord: “Tell me … why these things are so” (\nMoses 1:30\n). What impresses you about the Lord’s response in\nMoses 1:31–39\n? What’s the difference between immortality and eternal life? (see Topics and Questions, “\nEternal Life\n,” Gospel Library). How does Jesus Christ help bring to pass both? Abraham also had a vision, recorded in\nAbraham 3\n. What do you find in\nverses 24–26\nthat could help answer Moses’s request?\nAbraham 3:22–28\nI lived as a spirit before I was born on earth.\nWe know very little about our premortal life. But much of what we do know comes from Abraham’s vision in\nAbraham 3:22–28\n. As you read these verses, make a list of truths you find—including truths about yourself and about Jesus Christ. Why are these truths valuable to you? What difference do they make in your life?\nSee also Topics and Questions, “\nPremortal Life\n,” Gospel Library.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat is the book of Moses?\nWhat is the book of Abraham?\nWhat does it mean to “chosen,” or foreordained?\nClick to see more.\nIdeas for Teaching Children\nMoses 1:1–4, 6, 12\nI am a child of God.\nAfter you read together God’s message to Moses in\nMoses 1:4\n, consider letting your children look at their reflection in a mirror and giving themselves a similar message: “I am a child of God.” Then they could give the same message to each other: “You are a child of God.” You might even find pictures of a variety of people and invite your children to point to each one and say, “This is a child of God.” Share with each other why you are glad to know you are children of God. How does this knowledge change the way you treat yourselves and others?\nYou and your children could compare God’s message to Moses in\nMoses 1:4\nwith Satan’s message in\nverse 12\n. How can you help your children distinguish between God’s messages to them and Satan’s?\nMoses Sees Jehovah\n, by Joseph Brickey (detail)\nMoses 1:6, 39\nHeavenly Father has a work for me to do.\nAs you read\nMoses 1:6\nwith your children, you might talk to them about the “work” God had for Moses. Consider using the\nGospel Art Book\n,\nnos. 13–16\n, or\nOld Testament Stories\n,\npages 64–84\n, to help your children see what Moses accomplished with Heavenly Father’s help. What is the work God has for us to do? (see, for example,\nDoctrine and Covenants 11:20\n).\nMoses 1:12–26\nI can resist Satan’s temptations.\nAs you study\nMoses 1:12–26\nwith your children, help them discover what Moses did to resist Satan (see\nverses 13, 15, 18, 20–22, 26\n). It might be fun for them to act out things they can do to resist temptation (such as praying, walking away, or asking for help).\nAbraham 3:22–28\nI lived as a spirit before I was born on earth.\nKnowing about our premortal life can inspire your children to make choices based on eternal truths. To help them learn about it, you could give them some key words and phrases to find in\nAbraham 3:22–28\n, like “before the world was,” “spirits,” “make an earth,” and “prove.” What do these verses teach us about why Heavenly Father sent us to earth?\nA song like “\nI Will Follow God’s Plan\n” (\nChildren’s Songbook\n, 164–65) could reinforce what\nAbraham 3\nteaches. Maybe you could invite your children to draw pictures that go with the words.\nHelp your children think of situations in which they have to choose whether or not to do what God has asked them to (see\nAbraham 3:25\n; see also\nFor the Strength of Youth: A Guide for Making Choices\n). Let them practice possible responses to these situations. How can the Savior help us when we make a wrong choice?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 2: Lesson 1: Lesson 1—Introduction to the Old TestamentThis lesson is intended to help students increase their desire to come closer to Heavenly Father and Jesus Christ through their study of the Old Testament.; Lesson 2: Lesson 2—The Plan of SalvationThis lesson is intended to help students understand Heavenly Father’s plan of salvation and the central role of Jesus Christ... ---\n\n--- Lesson 1 ---\nThe Old Testament contains many teachings and symbols about the Lord Jesus Christ and His role as Savior of the world. Stories from the Old Testament can help students learn about Him and see how He is involved in our lives. This lesson is intended to help students increase their desire to come closer to Heavenly Father and Jesus Christ through their study of the Old Testament. Student preparation: Consider inviting students to review a favorite story from the Old Testament and ponder what that story might teach about Heavenly Father or Jesus Christ. Possible Learning Activities Our focus To begin the lesson, think of how you can help students look more carefully for the Savior in the Old Testament. One way to do this is to put up several pictures of the Savior around the room before class. After class begins, you could ask students how many pictures of the Savior they noticed and discuss why they did or did not notice the pictures. Another way to do this is to explain to students that they are about to watch a video showing two teams: one wearing white and one wearing black. Both teams will be passing a basketball. Invite students to try to correctly count the number of passes the team in white makes. Show the video “ Focus Test ,” found at ChurchofJesusChrist.org , from time code 0:00 to 0:22. Then pause the video. 1:2 How many passes did you count? Did you notice anything else happening in the video? If so, what? Play the remainder of the video (it repeats the same passing drill) and invite students to watch for anything they may not have seen the first time. What did you notice that you hadn’t seen the first time? If needed, you could point out that an older woman walked across the floor, a ninja warrior wearing black replaced one of the players, some boys put on hats, and some passed a football instead of a basketball. Why did you not see some of those things the first time watching? How might this be similar to what someone might experience when reading the stories of the Old Testament? With either approach to starting the lesson, be sure it is clear to students that, if we are not careful, we might focus on other things and overlook what the Old Testament has to teach us about Heavenly Father and Jesus Christ. Read the following statement by Elder Michael T. Ringwood of the Seventy, looking for what we can learn about Heavenly Father and Jesus Christ as we read the Old Testament. We are the focus of Heavenly Father’s plan and the reason for our Savior’s mission. Chapter after chapter [of the Old Testament] we discover examples of how Heavenly Father and [Jesus Christ] are intimately involved in our lives. (“ For God So Loved Us ,” Liahona , May 2022, 88–89) According to Elder Ringwood, what does the Old Testament show us about Heavenly Father and Jesus Christ? Students might come up with truths similar to: We are the focus of Heavenly Father’s plan and the reason for the Savior’s mission. Heavenly Father and Jesus Christ are intimately involved in our lives. Ask students to share what they think and feel about these truths and why they may be meaningful to them. Invite students to complete the following self-assessment on their own. They can record their answers in a study journals. Think of any experiences you have had with the Old Testament. What has your experience with the Old Testament been like? If you have had experiences with the Old Testament, have they helped you feel closer to Heavenly Father and Jesus Christ? As you study this lesson, seek help through the Holy Ghost to know how to come closer to Heavenly Father and Jesus Christ through your study of the Old Testament. Heavenly Father and Jesus Christ in the Old Testament Consider asking students to share things they already know about the Old Testament. If needed, you might share that the Old Testament begins with an account of the Creation of the world and of Adam and Eve. It relates the stories of many prophets and people who mostly live in and around Israel and ends about 400 BC. Then, explain the following in your own words. As you study the Old Testament, it will refer to the Lord or Jehovah. It is helpful to know that Jehovah is Jesus Christ. Jehovah did the will of Heavenly Father in all things. As you learn about Jehovah, you also learn about Heavenly Father, who guided and empowered Him. Display several pictures in a circular pattern that depict Old Testament stories. (It might be helpful to prepare yourself before class by briefly reviewing the stories that are presented.) In the center of these pictures, place an image of Jesus Christ. You may choose to use images like the following. Alternatively, you might display the image of Jesus Christ and invite students to think of stories on their own that illustrate His involvement and love in the Old Testament. Students could write simple titles for those stories around the Savior. The stories are listed below, starting from the top and working around clockwise. Joseph in Egypt ( Genesis 37:23–28 ; 39:1–5 ). After Joseph shared his dream with his family, Joseph’s brothers conspired against him. Moses parting the Red Sea ( Exodus 14:10, 13–16, 21–22 ). The children of Israel were fleeing Egypt when Pharaoh’s army approached to attack and enslave them again. Serpent on the pole ( Numbers 21:4–9 ). After the Lord delivered the Israelites from Egypt and miraculously provided bread from heaven, the Israelites complained against God. David and Goliath ( 1 Samuel 17:43–49 ). Goliath the Philistine warrior challenged Israel to send their best fighter against him. David volunteered to face him. Fiery furnace ( Daniel 3:4–6, 12–13, 16–25 ). King Nebuchadnezzar set up a golden image and called the rulers of his land together to dedicate it. Lion’s den ( Daniel 6:7, 10, 16–23 ). Darius made Daniel a ruler in Babylon. Other rulers conspired against him so he would lose favor with the king. Consider organizing students into pairs or small groups. Students could choose one or more stories, read the associated verses, and discuss the following questions. How does this story demonstrate the love or involvement of both Heavenly Father and Jesus Christ? How can understanding the story this way be helpful to you? You might invite students to share with the class insights gained from their discussion. If students do not mention it, explain that studying how the Lord is involved in the lives of individuals in the Old Testament can help us ponder how He is involved in our lives. Invite students to ponder how the Lord has blessed and helped them. Ask a few students to share their thoughts and experiences if they are not too personal. Studying the Old Testament This may be a good opportunity to remind students of their daily scripture study goals. You could invite students to seek the guidance of the Holy Ghost as they review, adjust, or create scripture study goals. You might ask students if any of them would like to share their goals with the class to help generate ideas for others. Consider inviting students to discuss as a class or write their answers in their study journals to the following questions. What have you learned today that you think could help you in your study of the Old Testament? Why would it be a blessing to you to experience and recognize the love and involvement of both Heavenly Father and Jesus Christ in your life? To help students with their study of the Old Testament this year, you might invite them to mark in their scriptures or note in their study journals every time they see evidence of God’s love or involvement in the lives of His children. Consider concluding with your testimony of how studying the Old Testament can help us draw closer to Heavenly Father and Jesus Christ and gain faith in Their involvement in our lives. You might invite students to share with their families what they learned today. This could help their families as they study the Old Testament.\n\n\n--- Lesson 2 ---\nIn our premortal realm, we “shouted for joy” ( Job 38:7 ) as we learned about Heavenly Father’s plan for our eternal progress. Jehovah was chosen to be our Savior and Redeemer, providing the way for us to return to the Father and become as He is. This lesson can help students understand Heavenly Father’s plan of salvation and the central role of Jesus Christ. Student preparation: Invite students to ponder what they know about Heavenly Father’s plan of salvation and the Savior’s central role in our eternal progress. Students could write down elements of the plan of salvation they are familiar with and practice explaining them to a family member or friend. Possible Learning Activities Answering life’s questions To begin class, consider displaying and sharing the following. Your friend Jonathan approaches you and asks: Where did we come from? What is the purpose of life? What happens after we die? Invite students to reflect on what they already know about Heavenly Father’s plan of happiness. The following study journal activity is one way you could do this. Be sure students understand that they will have an opportunity to practice answering Jonathan’s questions later in the lesson. In your study journal, answer the following questions to help you reflect on what you already understand about Heavenly Father’s plan of salvation. How confident are you in your ability to answer Jonathan’s questions? What questions do you have about Heavenly Father’s plan? As you study today, seek the guidance of the Holy Ghost to help increase your understanding of Heavenly Father’s plan and the Savior’s central role. Jesus Christ is central to the Father’s plan of happiness Helping students identify the different titles, roles, and attributes of Jesus Christ can increase their connection to Him. To help students understand the central role Jesus Christ plays in each element of Heavenly Father’s plan of salvation, you could display the following image. Consider inviting students to share their thoughts about what this illustration teaches about the Savior. (For additional teacher training on identifying the titles, roles, and attributes of Jesus Christ, see: “ Emphasize the example of Jesus Christ ” in Teacher Development Skills.) After adequate time for students to discuss what the image is teaching, you could display the statement from President Dallin H. Oaks. President Dallin H. Oaks of the First Presidency explained the Savior’s role in Heavenly Father’s plan of salvation: What has Jesus Christ done for each of us? He has done everything that is essential for our journey through mortality toward the destiny outlined in the plan of our Heavenly Father. … His Only Begotten Son, Jesus Christ, is the central figure. (“ What Has Our Savior Done for Us? ,” Liahona , May 2021, 75) How would you summarize President Oaks’s teaching as a statement of truth? Help students identify a truth such as Jesus Christ is central to Heavenly Father’s plan of salvation and our eternal progress. It might be helpful to write this truth on the board. Heavenly Father’s plan and the Savior’s central role The following activity is intended to help students deepen their understanding of Heavenly Father’s plan of salvation and the Savior’s role in it. Students who are especially familiar with the plan of salvation could be invited to use their scripture study tools to find scripture passages and statements from Church leaders to answer Jonathan’s three questions on the board. If students need additional guidance, consider giving them a copy of the handout titled “Heavenly Father’s Plan of Salvation.” They could be invited to study the handout individually or in small groups. One way to do this could be to cut the handout into three sections and place the sections around the room. Students could rotate through each location in the room individually or with their groups as they study the plan of salvation. Display the following instructions to help guide the students as they study. As you study about Heavenly Father’s plan of salvation, look for the following: How Jesus Christ plays a central role in Heavenly Father’s plan of salvation. Truths you could share with Jonathan to help answer his questions. Record your insights in your study journal. After students have finished studying, provide an opportunity for them to share the insights and understanding they gained. Students could practice sharing what they learned by role-playing how they would answer each of Jonathan’s three questions. You could also invite them to discuss the following questions with a partner or together with the class. What did you learn about the central role Jesus Christ plays in Heavenly Father’s plan of salvation? What truths or teachings could you share with Jonathan that could help answer his questions? Think about what you learned Consider concluding the lesson by inviting the students to reflect quietly on what they felt about Heavenly Father, Jesus Christ, and the plan of salvation. Invite them to consider any actions they have felt prompted to take. They could record their insight and spiritual impressions in their study journals.\n\n\n--- Lesson 3 ---\nIn a vision, Jehovah showed Abraham His works and creations. He also showed Abraham the premortal existence, including the noble and great spirits chosen to be leaders in mortality. This lesson can help students understand how a knowledge of the premortal life in Heavenly Father’s plan can help them in their lives. Student preparation: Invite students to ask a friend or family member what they know about the premortal life and how knowing about the premortal life could help them. Possible Learning Activities How old are you? Invite several students to share how old they are. Point out that the age they shared is how long they have been in their physical body during their lifetime. Our spirits have existed far longer than our physical bodies. Before birth, we lived with Heavenly Father and the Savior Jesus Christ. We call this our premortal life. Ask students to write their answers to the following questions in their study journals. What are some of the things you know about the premortal life? How can knowledge about the premortal life help you now? Encourage students to add to their answers as they continue this lesson. Encourage them to seek help from the Heavenly Father through the Holy Ghost to learn how knowledge about the premortal life can help them. What we learn from Abraham To help students to know where the Book of Abraham came from, you could invite them to share what they know, or share some of the following in your own words. Abraham recorded an experience that can help us understand more about the premortal life. Abraham was born about 2,000 years before the birth of Jesus Christ. He recorded a few details of his life along with visions he received from God that can be found in the book of Abraham. This record originated from scrolls of papyrus discovered in Egypt and purchased by members of the Church. This record was then revealed to the Prophet Joseph Smith by the gift and power of God. Read Abraham 3:11–12, 21 to see what the Lord taught Abraham. What stood out to you from these verses? What truths did you learn about the Lord? As students share, invite them to point out phrases or verses where their insights come from so other students can mark them if they would like. How might understanding these truths about Jesus Christ influence you now? How have you witnessed or experienced these truths about the Savior in your life? Our premortal life After learning of the premortal greatness of Jesus Christ (see Abraham 3:16–21 ), Abraham also learned about our premortal existence. Before reading what the Lord showed Abraham, imagine what it would be like if you were able to view your premortal life with Heavenly Father and Jesus Christ. Ponder how it might affect you. Allow sufficient time for students to imagine the effect of observing themselves in their premortal state with Heavenly Father and Jesus Christ. Abraham 3:22–23 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Abraham 3:22–23 , looking for what Abraham learned in his vision about premortal life. It may be helpful to know that “intelligences” in these verses refer to premortal spirits. What truths do you think Abraham may have learned or understood better because of this experience? Write the various truths students share on the board. If students do not mention it, add the following: God chose His noble and great spirit children to become rulers before they were born. This is often referred to as foreordination. How do you think the world’s definition of “noble and great” would be different than the Lord’s? Are we part of the noble and great ones? In a worldwide devotional, President Russell M. Nelson spoke of one way the truth taught in Abraham 3 applies to you. Our Heavenly Father has reserved many of His most noble spirits—perhaps, I might say, His finest team—for this final phase. Those noble spirits—those finest players, those heroes—are you! … You are among the best the Lord has ever sent to this world. You have the capacity to be smarter and wiser and have more impact on the world than any previous generation! (“ Hope of Israel ” [worldwide youth devotional, June 3, 2018], 8, 16) Consider inviting students to mark their scriptures in a way that will help them remember what President Nelson taught. After verse 22 they might write the phrase “including me,” or they could write their name above Abraham’s name in verse 23 , or they could perhaps link Abraham 3:22–23 with President Nelson’s statement above in Gospel Library. If useful, give students some time to learn more about the premortal life. They could study “premortal life” in Guide to the Scriptures or the Topical Guide . Or students could make a scripture chain, linking verses about the premortal life like Jeremiah 1:4–5 ; Alma 13:3–4 ; and Doctrine and Covenants 138:55–56 . Ask students to share what they found and why it is meaningful to them. Do the following in small groups and then present some of their thoughts to the class. Imagine that someone in your class is unsure how Abraham 3:22–23 applies to them. Prepare the following: A summary of what Abraham 3:22–23 and President Nelson taught. Ideas for how you or other youth could affect others for good or bring them closer to Jesus Christ. How you feel your understanding of the premortal life can help you in your life. As students share, look for appropriate ways to emphasize that Heavenly Father sent them here at this time to help others come closer to Him. Also, offer sincere compliments and praise to students for their willingness to participate. Doing this helps students know you value their contribution. Your efforts can help increase their motivation to share their thoughts with the class again. For additional training, see “ Create an environment where all are respected and know their contributions are valued ” in Teacher Development Skills . Consider sharing your testimony of the truths in this lesson. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase is “As spirits we ‘were organized before the world was.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 4 ---\nOn a high mountain, Moses “saw God face to face and talked with Him” ( Moses 1:2 ). God told Moses, “Thou art my son” ( Moses 1:4 ) and “I have a work for thee” ( Moses 1:6 ). The purpose of this lesson is to help students feel that they are children of God and He has a work for them to do. Student preparation: Invite students to ponder or write what they believe their purpose is in life. Possible Learning Activities Something for you to do Write on the board, “ (Your name), I have something I want you to do.” Ask students how they feel when someone tells them they have something they want them to do. Consider asking the following questions. Do you feel differently depending on who asks? Why or why not? How would you feel if it was God that was saying it to you? Why? Invite students to answer the following questions in their scripture journals. Do you believe that God has a work for you in this life? Why or why not? How well do you feel you know what God wants you to do? What do you think you would have to know about God and yourself for that work to be motivating? As students study Moses 1 in this lesson, invite them to seek help through the Holy Ghost to know more about themselves, God, and what He wants them to do in this life. The example of Moses Invite students to find the book of Moses in the Pearl of Great Price. Explain that God revealed the Book of Moses through the Prophet Joseph Smith as he worked on the inspired translation of Genesis 1 through Genesis 6:13 . It contains the words God commanded Moses to record ( Moses 1:40 ). Consider displaying a picture of Moses such as the following. What do you know about Moses and his life? If needed, explain that before the Lord performed miracles through Moses to lead his people out of slavery, Moses was born an Israelite (a member of God’s covenant people) but was adopted by a royal Egyptian family. Eventually he had to flee from Egypt to a new land to preserve his life, leaving the only family he had known. If you were in Moses’s situation, what thoughts might you have about the purpose for your life? Some time after Moses had fled Egypt, the Savior appeared to Moses “face to face” ( Moses 1:2 ). Jesus Christ, being one with Heavenly Father, spoke to Moses as if He were God the Father. Therefore, we can read these verses to better understand both the Father and the Son. Moses learned much about Heavenly Father and His relationship to Him that led him to do an important work. To help students discover what Moses learned, draw the following chart on the board. In this activity, students could copy the chart in their study journals or complete it as a class on the board. Heavenly Father and Jesus Christ Moses Read Moses 1:1–11 , imagining what it would be like to have this experience. On the chart, write what the verses teach about Heavenly Father, Jesus Christ, and Moses. An alternative way to study these verses is to show the video “ I Am a Son of God ” from time code 0:00 to 2:49. After the video, you could invite students to read the verses, looking for important statements or details that were not in the video. Invite students to share what they found in the scriptures as they completed the chart and why it may be important or meaningful to them. If needed, ask the following questions. 6:31 What stood out to you about Heavenly Father and Jesus Christ? Why? As students share, look for ways to emphasize the greatness of God. You might ask students to point out phrases that highlight His power. What did God tell Moses in verses 4, 6–7 that also applies to you? Students might identify a truth like: We are children of God and He has a work for us to do. Consider inviting students to record this truth in their scriptures or mark phrases that teach it. How does knowing the greatness of God make being His child more meaningful? How might understanding that we are children of God help us understand our purpose or purposes in this life? Note: It may be useful to know that, in the next lesson on Moses 1:12–26 , students will study how Moses’s understanding of his identity as a son of God gave him power to resist Satan’s temptation. Also, the lesson on Genesis 1:26–27 in the following week will help students feel the importance of their identity and potential as sons and daughters of heavenly parents. The work God has for us To help students to ponder how God has an important work for each of his children, consider doing the following activity. Draw three stick figures in your study journal. Learn about the work God had for the individuals in the following examples and label the stick figures. Then write the answers to the following questions next to or below each figure. Moses. Look up “Moses” in the Bible Dictionary or Guide to the Scriptures . Girish (a man born and raised in Nepal who found the gospel and eventually moved to Utah). Read the following or watch “ I Have a Work for Thee ” (10:25) from time code 0:18 to 1:12. 10:25 Years later, when more than 1,500 refugees from camps in Nepal were relocated to Utah, Girish felt inspired to help. With native-language fluency and cultural understanding, Girish served as an interpreter, teacher, and mentor. … A Nepali-speaking branch was organized, and Girish later served as its branch president. He was also instrumental in translating the Book of Mormon into Nepali. (John C. Pingree Jr., “ I Have a Work for Thee ,” Ensign or Liahona , Nov. 2017, 32) A discouraged sister. Read the following. One day, a discouraged sister pleaded, “Lord, what is my personal ministry?” He answered, “Notice others.” … Since then, she has found joy in noticing those who are regularly forgotten, and God has worked through her to bless many. (John C. Pingree Jr., “ I Have a Work for Thee ,” Ensign or Liahona , Nov. 2017, 33) You could substitute the story of Girish or the discouraged sister with another modern-day example you know. It may be useful to display the following questions on the board. What did the individual do to help others and bring them to Jesus Christ? Why might a loving God want them to do this work? How were they uniquely prepared to help? Or how did they help in a unique or personal way? As students share what they found, look for ways to make clear that not all work the Lord wants us to do is big or grand, but it is always significant to the Lord and to those of His children we serve. The specific tasks and responsibilities the Lord may give us will help us take part in His work of salvation and exaltation (see Moses 1:39 ). There may also be tasks He wants to focus on now, but He may ask us to focus on something different in the future. A work for you Draw an additional stick figure and write your name below it. Elder John C. Pingree Jr. of the Seventy testified: To Moses, God declared, “I have a work for thee” ( Moses 1:6 ). Have you ever wondered if Heavenly Father has a work for you? Are there important things He has prepared you—and specifically you—to accomplish? I testify the answer is yes! (“ I Have a Work for Thee ,” Ensign or Liahona , Nov. 2017, 32) Consider inviting students to say a silent prayer and seek revelation from the Lord as they answer some or all of the following questions around the stick figure of themselves. It may be helpful to explain that students may not receive complete answers to these questions in class. Invite them to continue to ponder and pray about them. What am I already doing that may be part of God’s work for me in this life? What has God already revealed to me about what He wants me to do? (This could include priesthood blessings, callings, patriarchal blessings, and other moments of revelation.) How might God want me personally to do His work in my family? in my ward or branch? How might God want me to prepare to help others now or in the future? If not too personal, invite students to share impressions or feelings they had as they studied today. Consider sharing your testimony and feelings about the principles in this lesson.\n\n\n--- Lesson 5 ---\nWe all have felt Satan’s temptations. However, like Moses, as we remember who we really are, we can receive strength from God to overcome Satan and his temptations in our lives. The purpose of this lesson is to help students draw strength from God to overcome their personal temptations. Student preparation: Invite students to ponder one of the temptations they personally face and come to class prepared to learn how to overcome it. Possible Learning Activities Facing temptation To prepare students to learn about overcoming temptations, consider sharing the following statement and questions. President Jeffrey R. Holland of the Quorum of the Twelve Apostles taught: We speak boldly because Satan is a real being set on destroying you, and you face his influence at a younger and younger age. (“ We are All Enlisted ,” Ensign or Liahona , Nov. 2011, 45) How do you feel about this quote from President Holland? What are some of the temptations Latter-day Saint teenagers face? It may be helpful to write on the board the temptations that students mention. You will ask students to reflect on these later in the lesson. For the following questions, you may consider inviting students to write their answers in a study journal. Ponder a temptation you have faced or you might struggle with. Consider the following: What makes it difficult for you to resist that temptation? What do you do to seek help and strength to resist? How effective do you feel you are at overcoming your temptation? As you study Moses 1:1–26 today, seek guidance from the Holy Ghost to identify truths that can strengthen you as you face temptation. Moses is tempted by Satan Invite students to share what they remember from the previous lesson, or they could briefly review Moses 1:1–10 and reflect on what they learned. If needed, remind them that Moses “saw God face to face, and he talked with him” ( Moses 1:2 ) and that God taught Moses three times that he is His son (see verses 4, 6, and 7 ). Although Moses was a mighty prophet, he also faced great temptation. Shortly after Moses’s experience with God, he had an extremely difficult experience where “Satan came tempting him” ( Moses 1:12 ). Because of what Moses knew and did, he was able to prevail. Read Moses 1:12–22 , looking for what helped Moses overcome Satan’s temptations. Consider marking what you find. You may consider showing the video “ I Am a Son of God ” from time code 2:50 to 6:30, or the entire video if you did not show students the first part in the previous lesson. After the video, you could invite students to read the verses, looking for what helped Moses overcome Satan’s temptations. Students could then discuss the following question in pairs or small groups: 6:31 What do you learn from Moses’s experience that can help us overcome our temptations? Consider writing the following incomplete principle on the board: We can receive God’s help to overcome temptations by … Invite students to come to the board and finish the principle in their own words. If students need help, you could guide them by asking questions such as the following: What did Satan call Moses in verse 12 , and how did Moses respond in verse 13 ? What did Moses recall from his spiritual experience with God that helped him when he was faced with temptation? Students may finish the principle in a number of ways, including some of the following: … remembering that we are children of God … recalling past spiritual experiences … calling upon God for strength After multiple principles have been identified, consider using the following quote and questions to help deepen students’ understanding of the truths they discovered. President Russell M. Nelson shared the following about the power of remembering we are children of God: My dear friends, you are literally spirit children of God. You have sung this truth since you learned the words to “I Am a Child of God.” But is that eternal truth imprinted upon your heart? Has this truth rescued you when confronted with temptation? (“ Choices for Eternity ” [worldwide devotional for young adults, May 15, 2022]) What do you think it means to have the truth that you are a child of God imprinted on your heart? How might remembering we are children of God strengthen us when we face temptation? Why do you think we need God’s help to overcome temptation? Invite students to share examples of when God has strengthened someone against temptation. This could be from scriptures, people close to them, or their own lives. As temptations are personal, remind students not to share any specific temptation. Overcoming personal temptations To help your students understand how they can live the principles discussed today, invite them to select one or two temptations that were written on the board earlier in the lesson. As a class or in small groups, invite students to think of practical ways a person facing that temptation could use these principles to overcome that temptation. Consider inviting students to write their ideas on the board, or you could display some of the following ideas. Ways to apply what we learn in Moses 1:12–26 : Record in your journal a time when you felt the Lord’s love and knew you were a child of God. You could review this during times of temptation. Memorize and rehearse inspiring scriptures, hymns, or the sacrament prayers to repeat to yourself when you are tempted. (This was a strategy the Savior used in Matthew 4:1–11 .) Pray daily for the Lord’s strength and power to overcome the temptation. Report to Heavenly Father each evening to thank Him, acknowledge any weaknesses, ask for forgiveness, and pledge to continue trying (see 3 Nephi 18:15, 18 ). Recall past spiritual experiences you have had and write them down in a journal. Refer to these when temptation arises. Discuss with parents or trusted adults or friends how these principles have helped them and ways they would recommend you apply them. Invite students to make a plan to help them overcome temptations they face. You could do this by providing the following instructions: Recall the temptation you pondered at the beginning of the lesson or another that you struggle with. Share your testimony about the Lord’s power and strength that you have experienced in your life and of His wish to help your students overcome their temptations. Express your confidence in them and in their ability to overcome their temptations with God’s help. Asking Heavenly Father for guidance, complete the following statement in your study journal or in your mind: “To help me prepare against this temptation, I will .”\n\n\n--- Lesson 6 ---\nUnder the direction of Heavenly Father, Jesus Christ has created worlds without number. Heavenly Father’s greatest creations are His spirit sons and daughters. This lesson can help students feel gratitude for Heavenly Father and His work to bring immortality and eternal life to all His children. Student preparation: Invite students to reflect on the vastness of Heavenly Father’s creations and the love Heavenly Father has for each of them. One way they could do this is to look at the sky on a clear night and think about how Heavenly Father feels about them among the many stars, planets, and galaxies He has created. Possible Learning Activities Begotten sons and daughters of God Consider bringing a small container of sand and a small container of water to class. Ask a student to come to the front of the class and put his or her finger into the container of water and then dip the moistened finger into the container of sand. Alternatively, you could show students the following picture. Then ask students to estimate how many grains of sand are in this person’s hands. Read Moses 1:27–29 , looking for what Moses compared to sand upon the seashore and why. What stands out to you from this vision? To help students appreciate the vastness of God’s creations, consider showing “ This Is My Work and Glory ,” available at ChurchofJesusChrist.org , from time code 0:53 to 1:31. 17:11 To help students contemplate themselves in God’s creations and to prepare their minds to be taught by the Holy Ghost, invite them to complete the following self-assessment. Answer the following questions in your study journal: Why did God create the universe? Why did God create us? How do I feel about God and what He does for me? Invite students to add to their answers throughout the lesson. Remind them that recording their thoughts in a study journal can help invite the influence of the Holy Ghost into their learning. Heavenly Father’s work and glory Read Moses 1:30 , looking for and marking two questions Moses had as he beheld the earth and God’s begotten sons and daughters. Moses 1:39 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Moses 1:31–33, 39 , looking for how the Lord answered Moses’s questions. What truths can we learn from God’s responses in these verses? Among the truths students may find, help them identify God’s work and glory is to bring to pass the immortality and eternal life of His children . To learn what students understand about immortality and eternal life, you might ask them to share how they would define them. If useful, students could search “ Immortality ” and “ Eternal Life ” in Guide to the Scriptures or Topics and Questions on ChurchofJesusChrist.org . Alternatively, you could share the following definition: Immortality means to live forever as a resurrected being. “Eternal life, or exaltation, is to become like God and live in His presence eternally as families” ( General Handbook: Serving in The Church of Jesus Christ of Latter-day Saints , 1.1 , Gospel Library). How can the truth found in Moses 1:39 help you understand why God created the earth? President Dieter F. Uchtdorf, then of the First Presidency, explained the purpose of God’s creations. 19:30 While we may look at the vast expanse of the universe and say, “What is man in comparison to the glory of creation?” God Himself said we are the reason He created the universe! His work and glory—the purpose for this magnificent universe—is to save and exalt mankind. In other words, the vast expanse of eternity, the glories and mysteries of infinite space and time are all built for the benefit of ordinary mortals like you and me. Our Heavenly Father created the universe that we might reach our potential as His sons and daughters. (“ You Matter to Him ,” Ensign or Liahona , Nov. 2011, 20) What does this statement help you understand about Heavenly Father? What does this statement help you understand about yourself? Heavenly Father helps us receive immortality and eternal life Consider placing students in small groups for the following activity. You could give each group a piece of paper and invite students to write the following questions at the top of their paper. Students could then write their responses under the questions. If possible, you might invite students to find a scripture that testifies of some or all of their answers. What have Heavenly Father and Jesus Christ done to bring to pass our immortality? What have They done and continue to do to help us obtain eternal life? To help students learn for themselves, give them enough time to respond to the previous questions. Then ask them to add to their list by reading John 3:16 and the following statement by President Dieter F. Uchtdorf. President Dieter F. Uchtdorf, the of the First Presidency, shared additional ways Heavenly Father brings to pass our immortality and eternal life. [Heavenly Father] has given us the gospel and the Church of Jesus Christ. He has given us the plan of redemption, the plan of salvation, even the plan of happiness. … He has given us the priceless gift of the Holy Ghost. … He has given us 24/7 access to Him through prayers of faith and supplications of real intent. He has given us modern-day apostles and prophets, who reveal the word of God in our day. … He has restored His Church. … He has given us the holy scriptures—His written word to us. He has given myriad tools of modern technology to help us in our walk of discipleship. … Why has our Heavenly Father given us so much help? Because He loves us. And because, as He said of Himself, “This is my work and my glory—to bring to pass the immortality and eternal life of man” ( Moses 1:39 ). (“ Our Father, Our Mentor ,” Ensign , June 2016, 5) Invite students to select a few of the ways that are most meaningful to them as they respond to the following questions. How can these help us progress toward eternal life? How have some of these ways helped you become more like Heavenly Father? Invite various students to share one way they chose and their answers to the questions above. Look for ways to thank and validate them for their answers. If students do not naturally focus on the Savior, refer to John 3:16 and Mosiah 4:2 , and ask students to share how the Savior helps them progress and become more like Heavenly Father. Appreciation for Heavenly Father To help students feel a greater appreciation for Heavenly Father and His work to bring to pass their immortality and eternal life, invite them to seek the Lord’s help as they respond to the following questions in their study journals. Alternatively, students could make a journal entry expressing their appreciation to Heavenly Father for what He does for them. What have you learned or felt today that you want to remember? How do you feel about Heavenly Father and Jesus Christ and what They do to help you return to Them? Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase is “This is my work and my glory—to bring to pass the immortality and eternal life of man.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n--- SCRIPTURE: Moses 1 ---\n1. The words of God, which hespakeunto Moses at time when Moses was caught up into an exceedingly highmountain,\n2. And hesawGodface to face, and hetalkedwith him, and thegloryof God was upon Moses; therefore Moses could endure his presence.\n3. And God spake unto Moses, saying: Behold, I am the Lord GodAlmighty, andEndlessis myname; for I am without beginning of days or end of years; and is not this endless?\n4. And, behold, thou art my son; whereforelook, and I will show thee theworkmanshipof minehands; but not all, for myworksare withoutend, and also mywords, for they never cease.\n5. Wherefore, no man can behold all myworks, except he behold all myglory; and no man canbeholdall myglory, and afterwards remain in the flesh on the earth.\n6. And I have work for thee, Moses, my son; and thou art in thesimilitudeof mineOnlyBegotten; and mine Only Begotten is and shall be theSavior, for he is full ofgraceandtruth; but there isnoGod beside me, and all things are present with me, for Iknowthem all.\n7. And now, behold, this one thing I show unto thee, Moses, my son, for thou art in the world, and now I show it unto thee.\n8. And it came to pass that Moses looked, and beheld theworldupon which he was created; and Mosesbeheldthe world and the ends thereof, and all the children of men which are, and which were created; of the same he greatlymarveledand wondered.\n9. And thepresenceof God withdrew from Moses, that hisglorywas not upon Moses; and Moses was left unto himself. And as he was left unto himself, hefellunto the earth.\n10. And it came to pass that it was for the space of many hours before Moses did again receive his naturalstrengthlike unto man; and he said unto himself: Now, for this cause I know thatmanisnothing, which thing I never had supposed.\n11. But now mine own eyes havebeheldGod; but not mynatural, but myspiritualeyes, for mynaturaleyes could not havebeheld; for I should havewitheredanddiedin his presence; but hisglorywas upon me; and I beheld hisface, for I wastransfiguredbefore him.\n12. And it came to pass that when Moses had said these words, behold,Satancametemptinghim, saying: Moses, son of man, worship me.\n13. And it came to pass that Moses looked upon Satan and said: Who art thou? For behold, I am asonof God, in the similitude of his Only Begotten; and where is thyglory, that I should worship thee?\n14. For behold, I could not look upon God, except hisgloryshould come upon me, and I were transfigured before him. But Icanlook upon thee in the natural man. Is it not so, surely?\n15. Blessed be the name of my God, for hisSpirithath not altogether withdrawn from me, or else where is thy glory, for it is darkness unto me? And I can judge between thee and God; for God said unto me:WorshipGod, for him only shalt thouserve.\n16. Get thee hence, Satan; deceive me not; for God said unto me: Thou art after thesimilitudeof mine Only Begotten.\n17. And he also gave me commandments when hecalledunto me out of the burningbush, saying:Callupon God in the name of mine Only Begotten, and worship me.\n18. And again Moses said: I will not cease to call upon God, I have otherthings to inquire of him: for hisgloryhas been upon me, wherefore I can judge between him and thee.Departhence, Satan.\n19. And now, when Moses had said these words,Satancried with loud voice, and ranted upon the earth, and commanded, saying: I am theOnly Begotten, worship me.\n20. And it came to pass that Moses began tofearexceedingly; and as he began to fear, he saw the bitterness ofhell. Nevertheless,callingupon God, he receivedstrength, and he commanded, saying: Depart from me, Satan, for this one God only will I worship, which is the God ofglory.\n21. And now Satan began to tremble, and the earth shook; and Moses received strength, and called upon God, saying: In the name of the Only Begotten,departhence,Satan.\n22. And it came to pass that Satan cried with loud voice, with weeping, and wailing, andgnashingof teeth; and he departed hence, even from the presence of Moses, that he beheld him not.\n23. And now of this thing Moses bore record; but because ofwickednessit isnothad among the children of men.\n24. And it came to pass that when Satan had departed from the presence of Moses, that Moses lifted up his eyes unto heaven, being filled with theHoly Ghost, which beareth record of the Father and the Son;\n25. And calling upon the name of God, he beheld hisgloryagain, for it was upon him; and he heard avoice, saying: Blessed art thou, Moses, for I, the Almighty, havechosenthee, and thou shalt be made stronger than manywaters; for they shall obey thycommandas if thou wertGod.\n26. And lo, I amwith thee, even unto the end of thy days; for thou shaltdelivermy people frombondage, evenIsraelmychosen.\n27. And it came to pass, as the voice was still speaking, Moses cast his eyes andbeheldthe earth, yea, even all of it; and there was not particle of it which he did not behold,discerningit by theSpiritof God.\n28. And he beheld also the inhabitants thereof, and there was not asoulwhich he beheld not; and he discerned them by the Spirit of God; and their numbers were great, even numberless as the sand upon the sea shore.\n29. And he beheld many lands; and each land was calledearth, and there wereinhabitantson the face thereof.\n30. And it came to pass that Moses called upon God, saying:Tellme, I pray thee, why these things are so, and by what thou madest them?\n31. And behold, the glory of the Lord was upon Moses, so that Moses stood in the presence of God, andtalked with himface to face. And the Lord God said unto Moses: For mine ownpurposehave I made these things. Here iswisdomand it remaineth in me.\n32. And by thewordof my power, have I created them, which is mine Only Begotten Son, who is full ofgraceand truth.\n33. Andworldswithout number have Icreated; and I also created them for mine own purpose; and by theSonIcreatedthem, which is mineOnly Begotten.\n34. And thefirstman of all men have I calledAdam, which ismany.\n35. But only an account of this earth, and the inhabitants thereof, give I unto you. For behold, there are many worlds that have passed away by the word of my power. And there are many that now stand, and innumerable are they unto man; but all things are numbered unto me, for they are mine and Iknowthem.\n36. And it came to pass that Moses spake unto the Lord, saying: Be merciful unto thy servant, O God, andtellme concerning this earth, and the inhabitants thereof, and also the heavens, and then thy servant will be content.\n37. And the Lord God spake unto Moses, saying: Theheavens, they are many, and they cannot be numbered unto man; but they are numbered unto me, for they are mine.\n38. And as one earth shall pass away, and the heavens thereof even so shall another come; and there is noendto my works, neither to my words.\n39. For behold, this is myworkand mygloryto bring to pass theimmortalityandeternallifeof man.\n40. And now, Moses, my son, I will speak unto thee concerning this earth upon which thou standest; and thou shaltwritethe things which I shall speak.\n41. And in day when the children of men shall esteem my words asnaughtandtakemany of them from thebookwhich thou shalt write, behold, I will raise up anotherlikeunto thee; and they shall behadagain among the children of menamong as many as shall believe.\n42. (These words werespokenunto Moses in the mount, the name of which shall not be known among the children of men. And now they are spoken unto you. Show them not unto any except them that believe. Even so. Amen.)\n\n--- SCRIPTURE: Abraham 3 ---\n1. And I, Abraham, had theUrim and Thummim, which the Lord my God had given unto me, in Ur of the Chaldees;\n2. And I saw thestars, that they were very great, and that one of them was nearest unto the throne of God; and there were many great ones which were near unto it;\n3. And the Lord said unto me: These are the governing ones; and the name of the great one isKolob, because it is near unto me, for I am the Lord thy God: I have set this one to govern all those which belong to the same order as that upon which thou standest.\n4. And the Lord said unto me, by the Urim and Thummim, that Kolob was after the manner of the Lord, according to itstimesand seasons in the revolutions thereof; that one revolution was adayunto the Lord, after his manner of reckoning, it being one thousandyearsaccording to the time appointed unto that whereon thou standest. This is the reckoning of the Lordstime, according to the reckoning of Kolob.\n5. And the Lord said unto me: The planet which is the lesser light, lesser than that which is to rule the day, even the night, is above orgreaterthan that upon which thou standest in point of reckoning, for it moveth in order more slow; this is in order because it standeth above the earth upon which thou standest, therefore the reckoning of its time is not so many as to its number of days, and of months, and of years.\n6. And the Lord said unto me: Now, Abraham, thesetwofacts exist, behold thine eyes see it; it is given unto thee to know the times of reckoning, and the set time, yea, the set time of the earth upon which thou standest, and the set time of the greater light which is set to rule the day, and the set time of the lesser light which is set to rule the night.\n7. Now the set time of the lesser light is longer time as to its reckoning than the reckoning of the time of the earth upon which thou standest.\n8. And where these two facts exist, there shall be another fact above them, that is, there shall be another planet whose reckoning of time shall be longer still;\n9. And thus there shall be the reckoning of the time of oneplanetabove another, until thou come nigh unto Kolob, which Kolob is after the reckoning of the Lords time; which Kolob is set nigh unto the throne of God, to govern all those planets which belong to the sameorderas that upon which thou standest.\n10. And it is given unto thee to know the set time of all the stars that are set to give light, until thou come near unto the throne of God.\n11. Thus I, Abraham,talkedwith the Lord, face to face, as one man talketh with another; and he told me of the works which his hands had made;\n12. And he said unto me: My son, my son (and his hand was stretched out), behold I will show you all these. And he put his hand upon mine eyes, and I saw those things which his hands had made, which were many; and they multiplied before mine eyes, and I could not see the end thereof.\n13. And he said unto me: This is Shinehah, which is the sun. And he said unto me: Kokob, which is star. And he said unto me: Olea, which is the moon. And he said unto me: Kokaubeam, which signifies stars, or all the great lights, which were in the firmament of heaven.\n14. And it was in the night time when the Lord spake these words unto me: I willmultiplythee, and thyseedafter thee, like unto these; and if thou canst count thenumberof sands, so shall be the number of thy seeds.\n15. And the Lord said unto me: Abraham, Ishowthese things unto thee before ye go into Egypt, that ye may declare all these words.\n16. Iftwothings exist, and there be one above the other, there shall be greater things above them; thereforeKolobis the greatest of all the Kokaubeam that thou hast seen, because it is nearest unto me.\n17. Now, if there be two things, one above the other, and the moon be above the earth, then it may be that planet or star may exist above it; and there is nothing that the Lord thy God shall take in his heart to do but what he willdoit.\n18. Howbeit that he made the greater star; as, also, if there be twospirits, and one shall be more intelligent than the other, yet these two spirits, notwithstanding one is more intelligent than the other, have no beginning; they existed before, they shall have no end, they shall exist after, for they aregnolaum, or eternal.\n19. And the Lord said unto me: These two facts do exist, that there are two spirits, one being more intelligent than the other; there shall be another more intelligent than they; I am the Lord thy God, I ammore intelligentthan they all.\n20. The Lord thy God sent his angel todeliverthee from the hands of the priest of Elkenah.\n21. I dwell in the midst of them all; I now, therefore, have come down unto thee to declare unto thee theworkswhich my hands have made, wherein mywisdomexcelleth them all, for Irulein the heavens above, and in the earth beneath, in all wisdom and prudence, over all the intelligences thine eyes have seen from the beginning; I came down in the beginning in the midst of all the intelligences thou hast seen.\n22. Now the Lord had shown unto me, Abraham, theintelligencesthat were organized before the world was; and among all thesethere were many of thenobleand great ones;\n23. And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wastchosenbefore thou wast born.\n24. And there stoodoneamong them that was like unto God, and he said unto those who were with him: We will go down, for there is space there, and we will take of these materials, andwewill make an earth whereon these maydwell;\n25. And we willprovethem herewith, to see if they willdoall things whatsoever the Lord their God shall command them;\n26. And they whokeeptheir firstestateshall be added upon; and they who keep not their first estate shall not have glory in the same kingdom with those who keep their first estate; and they who keep their secondestateshall havegloryadded upon their heads for ever and ever.\n27. And theLordsaid: Whom shall Isend? And one answered like unto the Son of Man: Here am I, send me. Andanotheranswered and said: Here am I, send me. And the Lord said: I willsendthe first.\n28. And thesecondwas angry, and kept not his firstestate; and, at that day, many followed after him.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "Moses 1;Abraham 3",
      "content": "The Bible begins with the words “in the beginning God created the heaven and the earth” (\nGenesis 1:1\n). But what was there\nbefore\nthis “beginning”? And\nwhy\ndid God create all of this? Through the Prophet Joseph Smith, the Lord has shed light on these questions.\nFor example, He gave us the record of a vision in which Abraham saw our existence as spirits “before the world was” (see\nAbraham 3:22–28\n). The Lord also gave us an inspired translation or revision of the first six chapters of Genesis, called the book of Moses—which doesn’t begin with “in the beginning.” Instead, it begins with an experience Moses had that provides some context for the Creation story. Together, these latter-day scriptures are a good place to start our study of the Old Testament because they address some fundamental questions that can frame our reading: Who is God? Who are we? What is God’s work, and what is our place in it? The opening chapters of Genesis could be seen as the Lord’s response to Moses’s request: “Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens” (\nMoses 1:36\n).\nIdeas for Learning at Home and at Church\nMoses 1\nAs a child of God, I have a divine destiny.\n“If the Lord were speaking to you directly,” President Russell M. Nelson taught, “the first thing He would make sure you understand is your true identity” (“\nChoices for Eternity\n” [worldwide devotional for young adults, May 2022], Gospel Library). It follows that Satan would try to confuse you on that same point. Look for this pattern in God’s message to Moses in\nMoses 1:4, 6\nand in Satan’s messages in\nMoses 1:12\n. What do you learn from these verses about the differences between God and Satan?\nPresident Nelson also taught, “The way you think about who you really are affects almost every decision you will ever make” (“\nChoices for Eternity\n”). Consider making a list of choices you make because your identity as a child of God comes before other labels.\nWhat additional verses or phrases in\nMoses 1\nhelp you understand your divine worth? You might also read more of President Nelson’s message in the section of “Choices for Eternity” titled “\nFirst: Know the truth about who you are.\n” What do you feel inspired to do to make your identity as a child of God your most important identifier?\nSee also “\nI Am a Child of God\n,”\nHymns\n(1985), no. 301; “\nOur True Identity\n” (video), Gospel Library; Topics and Questions, “\nChildren of God\n,” Gospel Library.\n3:39\nOur True Identity\nMoses 1:12–26\nWith the Lord’s help, I can resist Satan.\nAs\nMoses 1\nclearly shows, powerful spiritual experiences do not mean we’ll never be tempted again. In fact, one of Satan’s tactics is to tempt us to doubt these experiences. As you read Moses’s response to Satan in\nverses 12–26\n, what do you learn that can help you stay true to the testimony you have received? What was it that finally helped Moses overcome Satan?\nAnother lesson from Moses’s experience is that Satan tempts us with counterfeits of God’s truth and power. Think of some fake versions of things, such as an artificial plant or a baby doll. How can you tell they’re fake? Then consider the counterfeits Satan uses today to tempt you. What do you learn from\nMoses 1:13–18\nabout how to recognize and reject his counterfeits? How can the Lord help you? (see\nMoses 1:24–26\n).\nSee also\nMatthew 4:1–11\n; Gary E. Stevenson, “\nDeceive Me Not\n,”\nEnsign\nor\nLiahona\n, Nov. 2019, 93–96; “I Am a Son of God” (video), Gospel Library.\n6:31\nI Am a Son of God\nLearning at home can be planned but also spontaneous.\n“Teaching opportunities in the family frequently occur in informal, everyday moments—while eating a meal, doing chores, playing games, [or] traveling” (\nTeaching in the Savior’s Way\n, 31). For example, in addition to reading about how Moses resisted Satan in\nMoses 1\n, you might spend a few moments at dinnertime talking as a family about how you resisted the influence of the adversary.\nMoses 1:27–39\n;\nAbraham 3\nGod’s work and glory is to help me gain eternal life.\nAfter seeing a vision of God’s creations, Moses said to the Lord: “Tell me … why these things are so” (\nMoses 1:30\n). What impresses you about the Lord’s response in\nMoses 1:31–39\n? What’s the difference between immortality and eternal life? (see Topics and Questions, “\nEternal Life\n,” Gospel Library). How does Jesus Christ help bring to pass both? Abraham also had a vision, recorded in\nAbraham 3\n. What do you find in\nverses 24–26\nthat could help answer Moses’s request?\nAbraham 3:22–28\nI lived as a spirit before I was born on earth.\nWe know very little about our premortal life. But much of what we do know comes from Abraham’s vision in\nAbraham 3:22–28\n. As you read these verses, make a list of truths you find—including truths about yourself and about Jesus Christ. Why are these truths valuable to you? What difference do they make in your life?\nSee also Topics and Questions, “\nPremortal Life\n,” Gospel Library.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat is the book of Moses?\nWhat is the book of Abraham?\nWhat does it mean to “chosen,” or foreordained?\nClick to see more.\nIdeas for Teaching Children\nMoses 1:1–4, 6, 12\nI am a child of God.\nAfter you read together God’s message to Moses in\nMoses 1:4\n, consider letting your children look at their reflection in a mirror and giving themselves a similar message: “I am a child of God.” Then they could give the same message to each other: “You are a child of God.” You might even find pictures of a variety of people and invite your children to point to each one and say, “This is a child of God.” Share with each other why you are glad to know you are children of God. How does this knowledge change the way you treat yourselves and others?\nYou and your children could compare God’s message to Moses in\nMoses 1:4\nwith Satan’s message in\nverse 12\n. How can you help your children distinguish between God’s messages to them and Satan’s?\nMoses Sees Jehovah\n, by Joseph Brickey (detail)\nMoses 1:6, 39\nHeavenly Father has a work for me to do.\nAs you read\nMoses 1:6\nwith your children, you might talk to them about the “work” God had for Moses. Consider using the\nGospel Art Book\n,\nnos. 13–16\n, or\nOld Testament Stories\n,\npages 64–84\n, to help your children see what Moses accomplished with Heavenly Father’s help. What is the work God has for us to do? (see, for example,\nDoctrine and Covenants 11:20\n).\nMoses 1:12–26\nI can resist Satan’s temptations.\nAs you study\nMoses 1:12–26\nwith your children, help them discover what Moses did to resist Satan (see\nverses 13, 15, 18, 20–22, 26\n). It might be fun for them to act out things they can do to resist temptation (such as praying, walking away, or asking for help).\nAbraham 3:22–28\nI lived as a spirit before I was born on earth.\nKnowing about our premortal life can inspire your children to make choices based on eternal truths. To help them learn about it, you could give them some key words and phrases to find in\nAbraham 3:22–28\n, like “before the world was,” “spirits,” “make an earth,” and “prove.” What do these verses teach us about why Heavenly Father sent us to earth?\nA song like “\nI Will Follow God’s Plan\n” (\nChildren’s Songbook\n, 164–65) could reinforce what\nAbraham 3\nteaches. Maybe you could invite your children to draw pictures that go with the words.\nHelp your children think of situations in which they have to choose whether or not to do what God has asked them to (see\nAbraham 3:25\n; see also\nFor the Strength of Youth: A Guide for Making Choices\n). Let them practice possible responses to these situations. How can the Savior help us when we make a wrong choice?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 2: Lesson 1: Lesson 1—Introduction to the Old TestamentThis lesson is intended to help students increase their desire to come closer to Heavenly Father and Jesus Christ through their study of the Old Testament.; Lesson 2: Lesson 2—The Plan of SalvationThis lesson is intended to help students understand Heavenly Father’s plan of salvation and the central role of Jesus Christ...",
      "content": "\n--- Lesson 1 ---\nThe Old Testament contains many teachings and symbols about the Lord Jesus Christ and His role as Savior of the world. Stories from the Old Testament can help students learn about Him and see how He is involved in our lives. This lesson is intended to help students increase their desire to come closer to Heavenly Father and Jesus Christ through their study of the Old Testament. Student preparation: Consider inviting students to review a favorite story from the Old Testament and ponder what that story might teach about Heavenly Father or Jesus Christ. Possible Learning Activities Our focus To begin the lesson, think of how you can help students look more carefully for the Savior in the Old Testament. One way to do this is to put up several pictures of the Savior around the room before class. After class begins, you could ask students how many pictures of the Savior they noticed and discuss why they did or did not notice the pictures. Another way to do this is to explain to students that they are about to watch a video showing two teams: one wearing white and one wearing black. Both teams will be passing a basketball. Invite students to try to correctly count the number of passes the team in white makes. Show the video “ Focus Test ,” found at ChurchofJesusChrist.org , from time code 0:00 to 0:22. Then pause the video. 1:2 How many passes did you count? Did you notice anything else happening in the video? If so, what? Play the remainder of the video (it repeats the same passing drill) and invite students to watch for anything they may not have seen the first time. What did you notice that you hadn’t seen the first time? If needed, you could point out that an older woman walked across the floor, a ninja warrior wearing black replaced one of the players, some boys put on hats, and some passed a football instead of a basketball. Why did you not see some of those things the first time watching? How might this be similar to what someone might experience when reading the stories of the Old Testament? With either approach to starting the lesson, be sure it is clear to students that, if we are not careful, we might focus on other things and overlook what the Old Testament has to teach us about Heavenly Father and Jesus Christ. Read the following statement by Elder Michael T. Ringwood of the Seventy, looking for what we can learn about Heavenly Father and Jesus Christ as we read the Old Testament. We are the focus of Heavenly Father’s plan and the reason for our Savior’s mission. Chapter after chapter [of the Old Testament] we discover examples of how Heavenly Father and [Jesus Christ] are intimately involved in our lives. (“ For God So Loved Us ,” Liahona , May 2022, 88–89) According to Elder Ringwood, what does the Old Testament show us about Heavenly Father and Jesus Christ? Students might come up with truths similar to: We are the focus of Heavenly Father’s plan and the reason for the Savior’s mission. Heavenly Father and Jesus Christ are intimately involved in our lives. Ask students to share what they think and feel about these truths and why they may be meaningful to them. Invite students to complete the following self-assessment on their own. They can record their answers in a study journals. Think of any experiences you have had with the Old Testament. What has your experience with the Old Testament been like? If you have had experiences with the Old Testament, have they helped you feel closer to Heavenly Father and Jesus Christ? As you study this lesson, seek help through the Holy Ghost to know how to come closer to Heavenly Father and Jesus Christ through your study of the Old Testament. Heavenly Father and Jesus Christ in the Old Testament Consider asking students to share things they already know about the Old Testament. If needed, you might share that the Old Testament begins with an account of the Creation of the world and of Adam and Eve. It relates the stories of many prophets and people who mostly live in and around Israel and ends about 400 BC. Then, explain the following in your own words. As you study the Old Testament, it will refer to the Lord or Jehovah. It is helpful to know that Jehovah is Jesus Christ. Jehovah did the will of Heavenly Father in all things. As you learn about Jehovah, you also learn about Heavenly Father, who guided and empowered Him. Display several pictures in a circular pattern that depict Old Testament stories. (It might be helpful to prepare yourself before class by briefly reviewing the stories that are presented.) In the center of these pictures, place an image of Jesus Christ. You may choose to use images like the following. Alternatively, you might display the image of Jesus Christ and invite students to think of stories on their own that illustrate His involvement and love in the Old Testament. Students could write simple titles for those stories around the Savior. The stories are listed below, starting from the top and working around clockwise. Joseph in Egypt ( Genesis 37:23–28 ; 39:1–5 ). After Joseph shared his dream with his family, Joseph’s brothers conspired against him. Moses parting the Red Sea ( Exodus 14:10, 13–16, 21–22 ). The children of Israel were fleeing Egypt when Pharaoh’s army approached to attack and enslave them again. Serpent on the pole ( Numbers 21:4–9 ). After the Lord delivered the Israelites from Egypt and miraculously provided bread from heaven, the Israelites complained against God. David and Goliath ( 1 Samuel 17:43–49 ). Goliath the Philistine warrior challenged Israel to send their best fighter against him. David volunteered to face him. Fiery furnace ( Daniel 3:4–6, 12–13, 16–25 ). King Nebuchadnezzar set up a golden image and called the rulers of his land together to dedicate it. Lion’s den ( Daniel 6:7, 10, 16–23 ). Darius made Daniel a ruler in Babylon. Other rulers conspired against him so he would lose favor with the king. Consider organizing students into pairs or small groups. Students could choose one or more stories, read the associated verses, and discuss the following questions. How does this story demonstrate the love or involvement of both Heavenly Father and Jesus Christ? How can understanding the story this way be helpful to you? You might invite students to share with the class insights gained from their discussion. If students do not mention it, explain that studying how the Lord is involved in the lives of individuals in the Old Testament can help us ponder how He is involved in our lives. Invite students to ponder how the Lord has blessed and helped them. Ask a few students to share their thoughts and experiences if they are not too personal. Studying the Old Testament This may be a good opportunity to remind students of their daily scripture study goals. You could invite students to seek the guidance of the Holy Ghost as they review, adjust, or create scripture study goals. You might ask students if any of them would like to share their goals with the class to help generate ideas for others. Consider inviting students to discuss as a class or write their answers in their study journals to the following questions. What have you learned today that you think could help you in your study of the Old Testament? Why would it be a blessing to you to experience and recognize the love and involvement of both Heavenly Father and Jesus Christ in your life? To help students with their study of the Old Testament this year, you might invite them to mark in their scriptures or note in their study journals every time they see evidence of God’s love or involvement in the lives of His children. Consider concluding with your testimony of how studying the Old Testament can help us draw closer to Heavenly Father and Jesus Christ and gain faith in Their involvement in our lives. You might invite students to share with their families what they learned today. This could help their families as they study the Old Testament.\n\n\n--- Lesson 2 ---\nIn our premortal realm, we “shouted for joy” ( Job 38:7 ) as we learned about Heavenly Father’s plan for our eternal progress. Jehovah was chosen to be our Savior and Redeemer, providing the way for us to return to the Father and become as He is. This lesson can help students understand Heavenly Father’s plan of salvation and the central role of Jesus Christ. Student preparation: Invite students to ponder what they know about Heavenly Father’s plan of salvation and the Savior’s central role in our eternal progress. Students could write down elements of the plan of salvation they are familiar with and practice explaining them to a family member or friend. Possible Learning Activities Answering life’s questions To begin class, consider displaying and sharing the following. Your friend Jonathan approaches you and asks: Where did we come from? What is the purpose of life? What happens after we die? Invite students to reflect on what they already know about Heavenly Father’s plan of happiness. The following study journal activity is one way you could do this. Be sure students understand that they will have an opportunity to practice answering Jonathan’s questions later in the lesson. In your study journal, answer the following questions to help you reflect on what you already understand about Heavenly Father’s plan of salvation. How confident are you in your ability to answer Jonathan’s questions? What questions do you have about Heavenly Father’s plan? As you study today, seek the guidance of the Holy Ghost to help increase your understanding of Heavenly Father’s plan and the Savior’s central role. Jesus Christ is central to the Father’s plan of happiness Helping students identify the different titles, roles, and attributes of Jesus Christ can increase their connection to Him. To help students understand the central role Jesus Christ plays in each element of Heavenly Father’s plan of salvation, you could display the following image. Consider inviting students to share their thoughts about what this illustration teaches about the Savior. (For additional teacher training on identifying the titles, roles, and attributes of Jesus Christ, see: “ Emphasize the example of Jesus Christ ” in Teacher Development Skills.) After adequate time for students to discuss what the image is teaching, you could display the statement from President Dallin H. Oaks. President Dallin H. Oaks of the First Presidency explained the Savior’s role in Heavenly Father’s plan of salvation: What has Jesus Christ done for each of us? He has done everything that is essential for our journey through mortality toward the destiny outlined in the plan of our Heavenly Father. … His Only Begotten Son, Jesus Christ, is the central figure. (“ What Has Our Savior Done for Us? ,” Liahona , May 2021, 75) How would you summarize President Oaks’s teaching as a statement of truth? Help students identify a truth such as Jesus Christ is central to Heavenly Father’s plan of salvation and our eternal progress. It might be helpful to write this truth on the board. Heavenly Father’s plan and the Savior’s central role The following activity is intended to help students deepen their understanding of Heavenly Father’s plan of salvation and the Savior’s role in it. Students who are especially familiar with the plan of salvation could be invited to use their scripture study tools to find scripture passages and statements from Church leaders to answer Jonathan’s three questions on the board. If students need additional guidance, consider giving them a copy of the handout titled “Heavenly Father’s Plan of Salvation.” They could be invited to study the handout individually or in small groups. One way to do this could be to cut the handout into three sections and place the sections around the room. Students could rotate through each location in the room individually or with their groups as they study the plan of salvation. Display the following instructions to help guide the students as they study. As you study about Heavenly Father’s plan of salvation, look for the following: How Jesus Christ plays a central role in Heavenly Father’s plan of salvation. Truths you could share with Jonathan to help answer his questions. Record your insights in your study journal. After students have finished studying, provide an opportunity for them to share the insights and understanding they gained. Students could practice sharing what they learned by role-playing how they would answer each of Jonathan’s three questions. You could also invite them to discuss the following questions with a partner or together with the class. What did you learn about the central role Jesus Christ plays in Heavenly Father’s plan of salvation? What truths or teachings could you share with Jonathan that could help answer his questions? Think about what you learned Consider concluding the lesson by inviting the students to reflect quietly on what they felt about Heavenly Father, Jesus Christ, and the plan of salvation. Invite them to consider any actions they have felt prompted to take. They could record their insight and spiritual impressions in their study journals.\n\n\n--- Lesson 3 ---\nIn a vision, Jehovah showed Abraham His works and creations. He also showed Abraham the premortal existence, including the noble and great spirits chosen to be leaders in mortality. This lesson can help students understand how a knowledge of the premortal life in Heavenly Father’s plan can help them in their lives. Student preparation: Invite students to ask a friend or family member what they know about the premortal life and how knowing about the premortal life could help them. Possible Learning Activities How old are you? Invite several students to share how old they are. Point out that the age they shared is how long they have been in their physical body during their lifetime. Our spirits have existed far longer than our physical bodies. Before birth, we lived with Heavenly Father and the Savior Jesus Christ. We call this our premortal life. Ask students to write their answers to the following questions in their study journals. What are some of the things you know about the premortal life? How can knowledge about the premortal life help you now? Encourage students to add to their answers as they continue this lesson. Encourage them to seek help from the Heavenly Father through the Holy Ghost to learn how knowledge about the premortal life can help them. What we learn from Abraham To help students to know where the Book of Abraham came from, you could invite them to share what they know, or share some of the following in your own words. Abraham recorded an experience that can help us understand more about the premortal life. Abraham was born about 2,000 years before the birth of Jesus Christ. He recorded a few details of his life along with visions he received from God that can be found in the book of Abraham. This record originated from scrolls of papyrus discovered in Egypt and purchased by members of the Church. This record was then revealed to the Prophet Joseph Smith by the gift and power of God. Read Abraham 3:11–12, 21 to see what the Lord taught Abraham. What stood out to you from these verses? What truths did you learn about the Lord? As students share, invite them to point out phrases or verses where their insights come from so other students can mark them if they would like. How might understanding these truths about Jesus Christ influence you now? How have you witnessed or experienced these truths about the Savior in your life? Our premortal life After learning of the premortal greatness of Jesus Christ (see Abraham 3:16–21 ), Abraham also learned about our premortal existence. Before reading what the Lord showed Abraham, imagine what it would be like if you were able to view your premortal life with Heavenly Father and Jesus Christ. Ponder how it might affect you. Allow sufficient time for students to imagine the effect of observing themselves in their premortal state with Heavenly Father and Jesus Christ. Abraham 3:22–23 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Abraham 3:22–23 , looking for what Abraham learned in his vision about premortal life. It may be helpful to know that “intelligences” in these verses refer to premortal spirits. What truths do you think Abraham may have learned or understood better because of this experience? Write the various truths students share on the board. If students do not mention it, add the following: God chose His noble and great spirit children to become rulers before they were born. This is often referred to as foreordination. How do you think the world’s definition of “noble and great” would be different than the Lord’s? Are we part of the noble and great ones? In a worldwide devotional, President Russell M. Nelson spoke of one way the truth taught in Abraham 3 applies to you. Our Heavenly Father has reserved many of His most noble spirits—perhaps, I might say, His finest team—for this final phase. Those noble spirits—those finest players, those heroes—are you! … You are among the best the Lord has ever sent to this world. You have the capacity to be smarter and wiser and have more impact on the world than any previous generation! (“ Hope of Israel ” [worldwide youth devotional, June 3, 2018], 8, 16) Consider inviting students to mark their scriptures in a way that will help them remember what President Nelson taught. After verse 22 they might write the phrase “including me,” or they could write their name above Abraham’s name in verse 23 , or they could perhaps link Abraham 3:22–23 with President Nelson’s statement above in Gospel Library. If useful, give students some time to learn more about the premortal life. They could study “premortal life” in Guide to the Scriptures or the Topical Guide . Or students could make a scripture chain, linking verses about the premortal life like Jeremiah 1:4–5 ; Alma 13:3–4 ; and Doctrine and Covenants 138:55–56 . Ask students to share what they found and why it is meaningful to them. Do the following in small groups and then present some of their thoughts to the class. Imagine that someone in your class is unsure how Abraham 3:22–23 applies to them. Prepare the following: A summary of what Abraham 3:22–23 and President Nelson taught. Ideas for how you or other youth could affect others for good or bring them closer to Jesus Christ. How you feel your understanding of the premortal life can help you in your life. As students share, look for appropriate ways to emphasize that Heavenly Father sent them here at this time to help others come closer to Him. Also, offer sincere compliments and praise to students for their willingness to participate. Doing this helps students know you value their contribution. Your efforts can help increase their motivation to share their thoughts with the class again. For additional training, see “ Create an environment where all are respected and know their contributions are valued ” in Teacher Development Skills . Consider sharing your testimony of the truths in this lesson. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase is “As spirits we ‘were organized before the world was.’” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 4 ---\nOn a high mountain, Moses “saw God face to face and talked with Him” ( Moses 1:2 ). God told Moses, “Thou art my son” ( Moses 1:4 ) and “I have a work for thee” ( Moses 1:6 ). The purpose of this lesson is to help students feel that they are children of God and He has a work for them to do. Student preparation: Invite students to ponder or write what they believe their purpose is in life. Possible Learning Activities Something for you to do Write on the board, “ (Your name), I have something I want you to do.” Ask students how they feel when someone tells them they have something they want them to do. Consider asking the following questions. Do you feel differently depending on who asks? Why or why not? How would you feel if it was God that was saying it to you? Why? Invite students to answer the following questions in their scripture journals. Do you believe that God has a work for you in this life? Why or why not? How well do you feel you know what God wants you to do? What do you think you would have to know about God and yourself for that work to be motivating? As students study Moses 1 in this lesson, invite them to seek help through the Holy Ghost to know more about themselves, God, and what He wants them to do in this life. The example of Moses Invite students to find the book of Moses in the Pearl of Great Price. Explain that God revealed the Book of Moses through the Prophet Joseph Smith as he worked on the inspired translation of Genesis 1 through Genesis 6:13 . It contains the words God commanded Moses to record ( Moses 1:40 ). Consider displaying a picture of Moses such as the following. What do you know about Moses and his life? If needed, explain that before the Lord performed miracles through Moses to lead his people out of slavery, Moses was born an Israelite (a member of God’s covenant people) but was adopted by a royal Egyptian family. Eventually he had to flee from Egypt to a new land to preserve his life, leaving the only family he had known. If you were in Moses’s situation, what thoughts might you have about the purpose for your life? Some time after Moses had fled Egypt, the Savior appeared to Moses “face to face” ( Moses 1:2 ). Jesus Christ, being one with Heavenly Father, spoke to Moses as if He were God the Father. Therefore, we can read these verses to better understand both the Father and the Son. Moses learned much about Heavenly Father and His relationship to Him that led him to do an important work. To help students discover what Moses learned, draw the following chart on the board. In this activity, students could copy the chart in their study journals or complete it as a class on the board. Heavenly Father and Jesus Christ Moses Read Moses 1:1–11 , imagining what it would be like to have this experience. On the chart, write what the verses teach about Heavenly Father, Jesus Christ, and Moses. An alternative way to study these verses is to show the video “ I Am a Son of God ” from time code 0:00 to 2:49. After the video, you could invite students to read the verses, looking for important statements or details that were not in the video. Invite students to share what they found in the scriptures as they completed the chart and why it may be important or meaningful to them. If needed, ask the following questions. 6:31 What stood out to you about Heavenly Father and Jesus Christ? Why? As students share, look for ways to emphasize the greatness of God. You might ask students to point out phrases that highlight His power. What did God tell Moses in verses 4, 6–7 that also applies to you? Students might identify a truth like: We are children of God and He has a work for us to do. Consider inviting students to record this truth in their scriptures or mark phrases that teach it. How does knowing the greatness of God make being His child more meaningful? How might understanding that we are children of God help us understand our purpose or purposes in this life? Note: It may be useful to know that, in the next lesson on Moses 1:12–26 , students will study how Moses’s understanding of his identity as a son of God gave him power to resist Satan’s temptation. Also, the lesson on Genesis 1:26–27 in the following week will help students feel the importance of their identity and potential as sons and daughters of heavenly parents. The work God has for us To help students to ponder how God has an important work for each of his children, consider doing the following activity. Draw three stick figures in your study journal. Learn about the work God had for the individuals in the following examples and label the stick figures. Then write the answers to the following questions next to or below each figure. Moses. Look up “Moses” in the Bible Dictionary or Guide to the Scriptures . Girish (a man born and raised in Nepal who found the gospel and eventually moved to Utah). Read the following or watch “ I Have a Work for Thee ” (10:25) from time code 0:18 to 1:12. 10:25 Years later, when more than 1,500 refugees from camps in Nepal were relocated to Utah, Girish felt inspired to help. With native-language fluency and cultural understanding, Girish served as an interpreter, teacher, and mentor. … A Nepali-speaking branch was organized, and Girish later served as its branch president. He was also instrumental in translating the Book of Mormon into Nepali. (John C. Pingree Jr., “ I Have a Work for Thee ,” Ensign or Liahona , Nov. 2017, 32) A discouraged sister. Read the following. One day, a discouraged sister pleaded, “Lord, what is my personal ministry?” He answered, “Notice others.” … Since then, she has found joy in noticing those who are regularly forgotten, and God has worked through her to bless many. (John C. Pingree Jr., “ I Have a Work for Thee ,” Ensign or Liahona , Nov. 2017, 33) You could substitute the story of Girish or the discouraged sister with another modern-day example you know. It may be useful to display the following questions on the board. What did the individual do to help others and bring them to Jesus Christ? Why might a loving God want them to do this work? How were they uniquely prepared to help? Or how did they help in a unique or personal way? As students share what they found, look for ways to make clear that not all work the Lord wants us to do is big or grand, but it is always significant to the Lord and to those of His children we serve. The specific tasks and responsibilities the Lord may give us will help us take part in His work of salvation and exaltation (see Moses 1:39 ). There may also be tasks He wants to focus on now, but He may ask us to focus on something different in the future. A work for you Draw an additional stick figure and write your name below it. Elder John C. Pingree Jr. of the Seventy testified: To Moses, God declared, “I have a work for thee” ( Moses 1:6 ). Have you ever wondered if Heavenly Father has a work for you? Are there important things He has prepared you—and specifically you—to accomplish? I testify the answer is yes! (“ I Have a Work for Thee ,” Ensign or Liahona , Nov. 2017, 32) Consider inviting students to say a silent prayer and seek revelation from the Lord as they answer some or all of the following questions around the stick figure of themselves. It may be helpful to explain that students may not receive complete answers to these questions in class. Invite them to continue to ponder and pray about them. What am I already doing that may be part of God’s work for me in this life? What has God already revealed to me about what He wants me to do? (This could include priesthood blessings, callings, patriarchal blessings, and other moments of revelation.) How might God want me personally to do His work in my family? in my ward or branch? How might God want me to prepare to help others now or in the future? If not too personal, invite students to share impressions or feelings they had as they studied today. Consider sharing your testimony and feelings about the principles in this lesson.\n\n\n--- Lesson 5 ---\nWe all have felt Satan’s temptations. However, like Moses, as we remember who we really are, we can receive strength from God to overcome Satan and his temptations in our lives. The purpose of this lesson is to help students draw strength from God to overcome their personal temptations. Student preparation: Invite students to ponder one of the temptations they personally face and come to class prepared to learn how to overcome it. Possible Learning Activities Facing temptation To prepare students to learn about overcoming temptations, consider sharing the following statement and questions. President Jeffrey R. Holland of the Quorum of the Twelve Apostles taught: We speak boldly because Satan is a real being set on destroying you, and you face his influence at a younger and younger age. (“ We are All Enlisted ,” Ensign or Liahona , Nov. 2011, 45) How do you feel about this quote from President Holland? What are some of the temptations Latter-day Saint teenagers face? It may be helpful to write on the board the temptations that students mention. You will ask students to reflect on these later in the lesson. For the following questions, you may consider inviting students to write their answers in a study journal. Ponder a temptation you have faced or you might struggle with. Consider the following: What makes it difficult for you to resist that temptation? What do you do to seek help and strength to resist? How effective do you feel you are at overcoming your temptation? As you study Moses 1:1–26 today, seek guidance from the Holy Ghost to identify truths that can strengthen you as you face temptation. Moses is tempted by Satan Invite students to share what they remember from the previous lesson, or they could briefly review Moses 1:1–10 and reflect on what they learned. If needed, remind them that Moses “saw God face to face, and he talked with him” ( Moses 1:2 ) and that God taught Moses three times that he is His son (see verses 4, 6, and 7 ). Although Moses was a mighty prophet, he also faced great temptation. Shortly after Moses’s experience with God, he had an extremely difficult experience where “Satan came tempting him” ( Moses 1:12 ). Because of what Moses knew and did, he was able to prevail. Read Moses 1:12–22 , looking for what helped Moses overcome Satan’s temptations. Consider marking what you find. You may consider showing the video “ I Am a Son of God ” from time code 2:50 to 6:30, or the entire video if you did not show students the first part in the previous lesson. After the video, you could invite students to read the verses, looking for what helped Moses overcome Satan’s temptations. Students could then discuss the following question in pairs or small groups: 6:31 What do you learn from Moses’s experience that can help us overcome our temptations? Consider writing the following incomplete principle on the board: We can receive God’s help to overcome temptations by … Invite students to come to the board and finish the principle in their own words. If students need help, you could guide them by asking questions such as the following: What did Satan call Moses in verse 12 , and how did Moses respond in verse 13 ? What did Moses recall from his spiritual experience with God that helped him when he was faced with temptation? Students may finish the principle in a number of ways, including some of the following: … remembering that we are children of God … recalling past spiritual experiences … calling upon God for strength After multiple principles have been identified, consider using the following quote and questions to help deepen students’ understanding of the truths they discovered. President Russell M. Nelson shared the following about the power of remembering we are children of God: My dear friends, you are literally spirit children of God. You have sung this truth since you learned the words to “I Am a Child of God.” But is that eternal truth imprinted upon your heart? Has this truth rescued you when confronted with temptation? (“ Choices for Eternity ” [worldwide devotional for young adults, May 15, 2022]) What do you think it means to have the truth that you are a child of God imprinted on your heart? How might remembering we are children of God strengthen us when we face temptation? Why do you think we need God’s help to overcome temptation? Invite students to share examples of when God has strengthened someone against temptation. This could be from scriptures, people close to them, or their own lives. As temptations are personal, remind students not to share any specific temptation. Overcoming personal temptations To help your students understand how they can live the principles discussed today, invite them to select one or two temptations that were written on the board earlier in the lesson. As a class or in small groups, invite students to think of practical ways a person facing that temptation could use these principles to overcome that temptation. Consider inviting students to write their ideas on the board, or you could display some of the following ideas. Ways to apply what we learn in Moses 1:12–26 : Record in your journal a time when you felt the Lord’s love and knew you were a child of God. You could review this during times of temptation. Memorize and rehearse inspiring scriptures, hymns, or the sacrament prayers to repeat to yourself when you are tempted. (This was a strategy the Savior used in Matthew 4:1–11 .) Pray daily for the Lord’s strength and power to overcome the temptation. Report to Heavenly Father each evening to thank Him, acknowledge any weaknesses, ask for forgiveness, and pledge to continue trying (see 3 Nephi 18:15, 18 ). Recall past spiritual experiences you have had and write them down in a journal. Refer to these when temptation arises. Discuss with parents or trusted adults or friends how these principles have helped them and ways they would recommend you apply them. Invite students to make a plan to help them overcome temptations they face. You could do this by providing the following instructions: Recall the temptation you pondered at the beginning of the lesson or another that you struggle with. Share your testimony about the Lord’s power and strength that you have experienced in your life and of His wish to help your students overcome their temptations. Express your confidence in them and in their ability to overcome their temptations with God’s help. Asking Heavenly Father for guidance, complete the following statement in your study journal or in your mind: “To help me prepare against this temptation, I will .”\n\n\n--- Lesson 6 ---\nUnder the direction of Heavenly Father, Jesus Christ has created worlds without number. Heavenly Father’s greatest creations are His spirit sons and daughters. This lesson can help students feel gratitude for Heavenly Father and His work to bring immortality and eternal life to all His children. Student preparation: Invite students to reflect on the vastness of Heavenly Father’s creations and the love Heavenly Father has for each of them. One way they could do this is to look at the sky on a clear night and think about how Heavenly Father feels about them among the many stars, planets, and galaxies He has created. Possible Learning Activities Begotten sons and daughters of God Consider bringing a small container of sand and a small container of water to class. Ask a student to come to the front of the class and put his or her finger into the container of water and then dip the moistened finger into the container of sand. Alternatively, you could show students the following picture. Then ask students to estimate how many grains of sand are in this person’s hands. Read Moses 1:27–29 , looking for what Moses compared to sand upon the seashore and why. What stands out to you from this vision? To help students appreciate the vastness of God’s creations, consider showing “ This Is My Work and Glory ,” available at ChurchofJesusChrist.org , from time code 0:53 to 1:31. 17:11 To help students contemplate themselves in God’s creations and to prepare their minds to be taught by the Holy Ghost, invite them to complete the following self-assessment. Answer the following questions in your study journal: Why did God create the universe? Why did God create us? How do I feel about God and what He does for me? Invite students to add to their answers throughout the lesson. Remind them that recording their thoughts in a study journal can help invite the influence of the Holy Ghost into their learning. Heavenly Father’s work and glory Read Moses 1:30 , looking for and marking two questions Moses had as he beheld the earth and God’s begotten sons and daughters. Moses 1:39 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Read Moses 1:31–33, 39 , looking for how the Lord answered Moses’s questions. What truths can we learn from God’s responses in these verses? Among the truths students may find, help them identify God’s work and glory is to bring to pass the immortality and eternal life of His children . To learn what students understand about immortality and eternal life, you might ask them to share how they would define them. If useful, students could search “ Immortality ” and “ Eternal Life ” in Guide to the Scriptures or Topics and Questions on ChurchofJesusChrist.org . Alternatively, you could share the following definition: Immortality means to live forever as a resurrected being. “Eternal life, or exaltation, is to become like God and live in His presence eternally as families” ( General Handbook: Serving in The Church of Jesus Christ of Latter-day Saints , 1.1 , Gospel Library). How can the truth found in Moses 1:39 help you understand why God created the earth? President Dieter F. Uchtdorf, then of the First Presidency, explained the purpose of God’s creations. 19:30 While we may look at the vast expanse of the universe and say, “What is man in comparison to the glory of creation?” God Himself said we are the reason He created the universe! His work and glory—the purpose for this magnificent universe—is to save and exalt mankind. In other words, the vast expanse of eternity, the glories and mysteries of infinite space and time are all built for the benefit of ordinary mortals like you and me. Our Heavenly Father created the universe that we might reach our potential as His sons and daughters. (“ You Matter to Him ,” Ensign or Liahona , Nov. 2011, 20) What does this statement help you understand about Heavenly Father? What does this statement help you understand about yourself? Heavenly Father helps us receive immortality and eternal life Consider placing students in small groups for the following activity. You could give each group a piece of paper and invite students to write the following questions at the top of their paper. Students could then write their responses under the questions. If possible, you might invite students to find a scripture that testifies of some or all of their answers. What have Heavenly Father and Jesus Christ done to bring to pass our immortality? What have They done and continue to do to help us obtain eternal life? To help students learn for themselves, give them enough time to respond to the previous questions. Then ask them to add to their list by reading John 3:16 and the following statement by President Dieter F. Uchtdorf. President Dieter F. Uchtdorf, the of the First Presidency, shared additional ways Heavenly Father brings to pass our immortality and eternal life. [Heavenly Father] has given us the gospel and the Church of Jesus Christ. He has given us the plan of redemption, the plan of salvation, even the plan of happiness. … He has given us the priceless gift of the Holy Ghost. … He has given us 24/7 access to Him through prayers of faith and supplications of real intent. He has given us modern-day apostles and prophets, who reveal the word of God in our day. … He has restored His Church. … He has given us the holy scriptures—His written word to us. He has given myriad tools of modern technology to help us in our walk of discipleship. … Why has our Heavenly Father given us so much help? Because He loves us. And because, as He said of Himself, “This is my work and my glory—to bring to pass the immortality and eternal life of man” ( Moses 1:39 ). (“ Our Father, Our Mentor ,” Ensign , June 2016, 5) Invite students to select a few of the ways that are most meaningful to them as they respond to the following questions. How can these help us progress toward eternal life? How have some of these ways helped you become more like Heavenly Father? Invite various students to share one way they chose and their answers to the questions above. Look for ways to thank and validate them for their answers. If students do not naturally focus on the Savior, refer to John 3:16 and Mosiah 4:2 , and ask students to share how the Savior helps them progress and become more like Heavenly Father. Appreciation for Heavenly Father To help students feel a greater appreciation for Heavenly Father and His work to bring to pass their immortality and eternal life, invite them to seek the Lord’s help as they respond to the following questions in their study journals. Alternatively, students could make a journal entry expressing their appreciation to Heavenly Father for what He does for them. What have you learned or felt today that you want to remember? How do you feel about Heavenly Father and Jesus Christ and what They do to help you return to Them? Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase is “This is my work and my glory—to bring to pass the immortality and eternal life of man.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Moses 1",
      "content": "1. The words of God, which hespakeunto Moses at time when Moses was caught up into an exceedingly highmountain,\n2. And hesawGodface to face, and hetalkedwith him, and thegloryof God was upon Moses; therefore Moses could endure his presence.\n3. And God spake unto Moses, saying: Behold, I am the Lord GodAlmighty, andEndlessis myname; for I am without beginning of days or end of years; and is not this endless?\n4. And, behold, thou art my son; whereforelook, and I will show thee theworkmanshipof minehands; but not all, for myworksare withoutend, and also mywords, for they never cease.\n5. Wherefore, no man can behold all myworks, except he behold all myglory; and no man canbeholdall myglory, and afterwards remain in the flesh on the earth.\n6. And I have work for thee, Moses, my son; and thou art in thesimilitudeof mineOnlyBegotten; and mine Only Begotten is and shall be theSavior, for he is full ofgraceandtruth; but there isnoGod beside me, and all things are present with me, for Iknowthem all.\n7. And now, behold, this one thing I show unto thee, Moses, my son, for thou art in the world, and now I show it unto thee.\n8. And it came to pass that Moses looked, and beheld theworldupon which he was created; and Mosesbeheldthe world and the ends thereof, and all the children of men which are, and which were created; of the same he greatlymarveledand wondered.\n9. And thepresenceof God withdrew from Moses, that hisglorywas not upon Moses; and Moses was left unto himself. And as he was left unto himself, hefellunto the earth.\n10. And it came to pass that it was for the space of many hours before Moses did again receive his naturalstrengthlike unto man; and he said unto himself: Now, for this cause I know thatmanisnothing, which thing I never had supposed.\n11. But now mine own eyes havebeheldGod; but not mynatural, but myspiritualeyes, for mynaturaleyes could not havebeheld; for I should havewitheredanddiedin his presence; but hisglorywas upon me; and I beheld hisface, for I wastransfiguredbefore him.\n12. And it came to pass that when Moses had said these words, behold,Satancametemptinghim, saying: Moses, son of man, worship me.\n13. And it came to pass that Moses looked upon Satan and said: Who art thou? For behold, I am asonof God, in the similitude of his Only Begotten; and where is thyglory, that I should worship thee?\n14. For behold, I could not look upon God, except hisgloryshould come upon me, and I were transfigured before him. But Icanlook upon thee in the natural man. Is it not so, surely?\n15. Blessed be the name of my God, for hisSpirithath not altogether withdrawn from me, or else where is thy glory, for it is darkness unto me? And I can judge between thee and God; for God said unto me:WorshipGod, for him only shalt thouserve.\n16. Get thee hence, Satan; deceive me not; for God said unto me: Thou art after thesimilitudeof mine Only Begotten.\n17. And he also gave me commandments when hecalledunto me out of the burningbush, saying:Callupon God in the name of mine Only Begotten, and worship me.\n18. And again Moses said: I will not cease to call upon God, I have otherthings to inquire of him: for hisgloryhas been upon me, wherefore I can judge between him and thee.Departhence, Satan.\n19. And now, when Moses had said these words,Satancried with loud voice, and ranted upon the earth, and commanded, saying: I am theOnly Begotten, worship me.\n20. And it came to pass that Moses began tofearexceedingly; and as he began to fear, he saw the bitterness ofhell. Nevertheless,callingupon God, he receivedstrength, and he commanded, saying: Depart from me, Satan, for this one God only will I worship, which is the God ofglory.\n21. And now Satan began to tremble, and the earth shook; and Moses received strength, and called upon God, saying: In the name of the Only Begotten,departhence,Satan.\n22. And it came to pass that Satan cried with loud voice, with weeping, and wailing, andgnashingof teeth; and he departed hence, even from the presence of Moses, that he beheld him not.\n23. And now of this thing Moses bore record; but because ofwickednessit isnothad among the children of men.\n24. And it came to pass that when Satan had departed from the presence of Moses, that Moses lifted up his eyes unto heaven, being filled with theHoly Ghost, which beareth record of the Father and the Son;\n25. And calling upon the name of God, he beheld hisgloryagain, for it was upon him; and he heard avoice, saying: Blessed art thou, Moses, for I, the Almighty, havechosenthee, and thou shalt be made stronger than manywaters; for they shall obey thycommandas if thou wertGod.\n26. And lo, I amwith thee, even unto the end of thy days; for thou shaltdelivermy people frombondage, evenIsraelmychosen.\n27. And it came to pass, as the voice was still speaking, Moses cast his eyes andbeheldthe earth, yea, even all of it; and there was not particle of it which he did not behold,discerningit by theSpiritof God.\n28. And he beheld also the inhabitants thereof, and there was not asoulwhich he beheld not; and he discerned them by the Spirit of God; and their numbers were great, even numberless as the sand upon the sea shore.\n29. And he beheld many lands; and each land was calledearth, and there wereinhabitantson the face thereof.\n30. And it came to pass that Moses called upon God, saying:Tellme, I pray thee, why these things are so, and by what thou madest them?\n31. And behold, the glory of the Lord was upon Moses, so that Moses stood in the presence of God, andtalked with himface to face. And the Lord God said unto Moses: For mine ownpurposehave I made these things. Here iswisdomand it remaineth in me.\n32. And by thewordof my power, have I created them, which is mine Only Begotten Son, who is full ofgraceand truth.\n33. Andworldswithout number have Icreated; and I also created them for mine own purpose; and by theSonIcreatedthem, which is mineOnly Begotten.\n34. And thefirstman of all men have I calledAdam, which ismany.\n35. But only an account of this earth, and the inhabitants thereof, give I unto you. For behold, there are many worlds that have passed away by the word of my power. And there are many that now stand, and innumerable are they unto man; but all things are numbered unto me, for they are mine and Iknowthem.\n36. And it came to pass that Moses spake unto the Lord, saying: Be merciful unto thy servant, O God, andtellme concerning this earth, and the inhabitants thereof, and also the heavens, and then thy servant will be content.\n37. And the Lord God spake unto Moses, saying: Theheavens, they are many, and they cannot be numbered unto man; but they are numbered unto me, for they are mine.\n38. And as one earth shall pass away, and the heavens thereof even so shall another come; and there is noendto my works, neither to my words.\n39. For behold, this is myworkand mygloryto bring to pass theimmortalityandeternallifeof man.\n40. And now, Moses, my son, I will speak unto thee concerning this earth upon which thou standest; and thou shaltwritethe things which I shall speak.\n41. And in day when the children of men shall esteem my words asnaughtandtakemany of them from thebookwhich thou shalt write, behold, I will raise up anotherlikeunto thee; and they shall behadagain among the children of menamong as many as shall believe.\n42. (These words werespokenunto Moses in the mount, the name of which shall not be known among the children of men. And now they are spoken unto you. Show them not unto any except them that believe. Even so. Amen.)",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Abraham 3",
      "content": "1. And I, Abraham, had theUrim and Thummim, which the Lord my God had given unto me, in Ur of the Chaldees;\n2. And I saw thestars, that they were very great, and that one of them was nearest unto the throne of God; and there were many great ones which were near unto it;\n3. And the Lord said unto me: These are the governing ones; and the name of the great one isKolob, because it is near unto me, for I am the Lord thy God: I have set this one to govern all those which belong to the same order as that upon which thou standest.\n4. And the Lord said unto me, by the Urim and Thummim, that Kolob was after the manner of the Lord, according to itstimesand seasons in the revolutions thereof; that one revolution was adayunto the Lord, after his manner of reckoning, it being one thousandyearsaccording to the time appointed unto that whereon thou standest. This is the reckoning of the Lordstime, according to the reckoning of Kolob.\n5. And the Lord said unto me: The planet which is the lesser light, lesser than that which is to rule the day, even the night, is above orgreaterthan that upon which thou standest in point of reckoning, for it moveth in order more slow; this is in order because it standeth above the earth upon which thou standest, therefore the reckoning of its time is not so many as to its number of days, and of months, and of years.\n6. And the Lord said unto me: Now, Abraham, thesetwofacts exist, behold thine eyes see it; it is given unto thee to know the times of reckoning, and the set time, yea, the set time of the earth upon which thou standest, and the set time of the greater light which is set to rule the day, and the set time of the lesser light which is set to rule the night.\n7. Now the set time of the lesser light is longer time as to its reckoning than the reckoning of the time of the earth upon which thou standest.\n8. And where these two facts exist, there shall be another fact above them, that is, there shall be another planet whose reckoning of time shall be longer still;\n9. And thus there shall be the reckoning of the time of oneplanetabove another, until thou come nigh unto Kolob, which Kolob is after the reckoning of the Lords time; which Kolob is set nigh unto the throne of God, to govern all those planets which belong to the sameorderas that upon which thou standest.\n10. And it is given unto thee to know the set time of all the stars that are set to give light, until thou come near unto the throne of God.\n11. Thus I, Abraham,talkedwith the Lord, face to face, as one man talketh with another; and he told me of the works which his hands had made;\n12. And he said unto me: My son, my son (and his hand was stretched out), behold I will show you all these. And he put his hand upon mine eyes, and I saw those things which his hands had made, which were many; and they multiplied before mine eyes, and I could not see the end thereof.\n13. And he said unto me: This is Shinehah, which is the sun. And he said unto me: Kokob, which is star. And he said unto me: Olea, which is the moon. And he said unto me: Kokaubeam, which signifies stars, or all the great lights, which were in the firmament of heaven.\n14. And it was in the night time when the Lord spake these words unto me: I willmultiplythee, and thyseedafter thee, like unto these; and if thou canst count thenumberof sands, so shall be the number of thy seeds.\n15. And the Lord said unto me: Abraham, Ishowthese things unto thee before ye go into Egypt, that ye may declare all these words.\n16. Iftwothings exist, and there be one above the other, there shall be greater things above them; thereforeKolobis the greatest of all the Kokaubeam that thou hast seen, because it is nearest unto me.\n17. Now, if there be two things, one above the other, and the moon be above the earth, then it may be that planet or star may exist above it; and there is nothing that the Lord thy God shall take in his heart to do but what he willdoit.\n18. Howbeit that he made the greater star; as, also, if there be twospirits, and one shall be more intelligent than the other, yet these two spirits, notwithstanding one is more intelligent than the other, have no beginning; they existed before, they shall have no end, they shall exist after, for they aregnolaum, or eternal.\n19. And the Lord said unto me: These two facts do exist, that there are two spirits, one being more intelligent than the other; there shall be another more intelligent than they; I am the Lord thy God, I ammore intelligentthan they all.\n20. The Lord thy God sent his angel todeliverthee from the hands of the priest of Elkenah.\n21. I dwell in the midst of them all; I now, therefore, have come down unto thee to declare unto thee theworkswhich my hands have made, wherein mywisdomexcelleth them all, for Irulein the heavens above, and in the earth beneath, in all wisdom and prudence, over all the intelligences thine eyes have seen from the beginning; I came down in the beginning in the midst of all the intelligences thou hast seen.\n22. Now the Lord had shown unto me, Abraham, theintelligencesthat were organized before the world was; and among all thesethere were many of thenobleand great ones;\n23. And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wastchosenbefore thou wast born.\n24. And there stoodoneamong them that was like unto God, and he said unto those who were with him: We will go down, for there is space there, and we will take of these materials, andwewill make an earth whereon these maydwell;\n25. And we willprovethem herewith, to see if they willdoall things whatsoever the Lord their God shall command them;\n26. And they whokeeptheir firstestateshall be added upon; and they who keep not their first estate shall not have glory in the same kingdom with those who keep their first estate; and they who keep their secondestateshall havegloryadded upon their heads for ever and ever.\n27. And theLordsaid: Whom shall Isend? And one answered like unto the Son of Man: Here am I, send me. Andanotheranswered and said: Here am I, send me. And the Lord said: I willsendthe first.\n28. And thesecondwas angry, and kept not his firstestate; and, at that day, many followed after him.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Moses": {
      "1": {
        "verses": {
          "1": {
            "text": "The words of God, which hespakeunto Moses at time when Moses was caught up into an exceedingly highmountain,",
            "citation": "(Moses 1:1)"
          },
          "2": {
            "text": "And hesawGodface to face, and hetalkedwith him, and thegloryof God was upon Moses; therefore Moses could endure his presence.",
            "citation": "(Moses 1:2)"
          },
          "3": {
            "text": "And God spake unto Moses, saying: Behold, I am the Lord GodAlmighty, andEndlessis myname; for I am without beginning of days or end of years; and is not this endless?",
            "citation": "(Moses 1:3)"
          },
          "4": {
            "text": "And, behold, thou art my son; whereforelook, and I will show thee theworkmanshipof minehands; but not all, for myworksare withoutend, and also mywords, for they never cease.",
            "citation": "(Moses 1:4)"
          },
          "5": {
            "text": "Wherefore, no man can behold all myworks, except he behold all myglory; and no man canbeholdall myglory, and afterwards remain in the flesh on the earth.",
            "citation": "(Moses 1:5)"
          },
          "6": {
            "text": "And I have work for thee, Moses, my son; and thou art in thesimilitudeof mineOnlyBegotten; and mine Only Begotten is and shall be theSavior, for he is full ofgraceandtruth; but there isnoGod beside me, and all things are present with me, for Iknowthem all.",
            "citation": "(Moses 1:6)"
          },
          "7": {
            "text": "And now, behold, this one thing I show unto thee, Moses, my son, for thou art in the world, and now I show it unto thee.",
            "citation": "(Moses 1:7)"
          },
          "8": {
            "text": "And it came to pass that Moses looked, and beheld theworldupon which he was created; and Mosesbeheldthe world and the ends thereof, and all the children of men which are, and which were created; of the same he greatlymarveledand wondered.",
            "citation": "(Moses 1:8)"
          },
          "9": {
            "text": "And thepresenceof God withdrew from Moses, that hisglorywas not upon Moses; and Moses was left unto himself. And as he was left unto himself, hefellunto the earth.",
            "citation": "(Moses 1:9)"
          },
          "10": {
            "text": "And it came to pass that it was for the space of many hours before Moses did again receive his naturalstrengthlike unto man; and he said unto himself: Now, for this cause I know thatmanisnothing, which thing I never had supposed.",
            "citation": "(Moses 1:10)"
          },
          "11": {
            "text": "But now mine own eyes havebeheldGod; but not mynatural, but myspiritualeyes, for mynaturaleyes could not havebeheld; for I should havewitheredanddiedin his presence; but hisglorywas upon me; and I beheld hisface, for I wastransfiguredbefore him.",
            "citation": "(Moses 1:11)"
          },
          "12": {
            "text": "And it came to pass that when Moses had said these words, behold,Satancametemptinghim, saying: Moses, son of man, worship me.",
            "citation": "(Moses 1:12)"
          },
          "13": {
            "text": "And it came to pass that Moses looked upon Satan and said: Who art thou? For behold, I am asonof God, in the similitude of his Only Begotten; and where is thyglory, that I should worship thee?",
            "citation": "(Moses 1:13)"
          },
          "14": {
            "text": "For behold, I could not look upon God, except hisgloryshould come upon me, and I were transfigured before him. But Icanlook upon thee in the natural man. Is it not so, surely?",
            "citation": "(Moses 1:14)"
          },
          "15": {
            "text": "Blessed be the name of my God, for hisSpirithath not altogether withdrawn from me, or else where is thy glory, for it is darkness unto me? And I can judge between thee and God; for God said unto me:WorshipGod, for him only shalt thouserve.",
            "citation": "(Moses 1:15)"
          },
          "16": {
            "text": "Get thee hence, Satan; deceive me not; for God said unto me: Thou art after thesimilitudeof mine Only Begotten.",
            "citation": "(Moses 1:16)"
          },
          "17": {
            "text": "And he also gave me commandments when hecalledunto me out of the burningbush, saying:Callupon God in the name of mine Only Begotten, and worship me.",
            "citation": "(Moses 1:17)"
          },
          "18": {
            "text": "And again Moses said: I will not cease to call upon God, I have otherthings to inquire of him: for hisgloryhas been upon me, wherefore I can judge between him and thee.Departhence, Satan.",
            "citation": "(Moses 1:18)"
          },
          "19": {
            "text": "And now, when Moses had said these words,Satancried with loud voice, and ranted upon the earth, and commanded, saying: I am theOnly Begotten, worship me.",
            "citation": "(Moses 1:19)"
          },
          "20": {
            "text": "And it came to pass that Moses began tofearexceedingly; and as he began to fear, he saw the bitterness ofhell. Nevertheless,callingupon God, he receivedstrength, and he commanded, saying: Depart from me, Satan, for this one God only will I worship, which is the God ofglory.",
            "citation": "(Moses 1:20)"
          },
          "21": {
            "text": "And now Satan began to tremble, and the earth shook; and Moses received strength, and called upon God, saying: In the name of the Only Begotten,departhence,Satan.",
            "citation": "(Moses 1:21)"
          },
          "22": {
            "text": "And it came to pass that Satan cried with loud voice, with weeping, and wailing, andgnashingof teeth; and he departed hence, even from the presence of Moses, that he beheld him not.",
            "citation": "(Moses 1:22)"
          },
          "23": {
            "text": "And now of this thing Moses bore record; but because ofwickednessit isnothad among the children of men.",
            "citation": "(Moses 1:23)"
          },
          "24": {
            "text": "And it came to pass that when Satan had departed from the presence of Moses, that Moses lifted up his eyes unto heaven, being filled with theHoly Ghost, which beareth record of the Father and the Son;",
            "citation": "(Moses 1:24)"
          },
          "25": {
            "text": "And calling upon the name of God, he beheld hisgloryagain, for it was upon him; and he heard avoice, saying: Blessed art thou, Moses, for I, the Almighty, havechosenthee, and thou shalt be made stronger than manywaters; for they shall obey thycommandas if thou wertGod.",
            "citation": "(Moses 1:25)"
          },
          "26": {
            "text": "And lo, I amwith thee, even unto the end of thy days; for thou shaltdelivermy people frombondage, evenIsraelmychosen.",
            "citation": "(Moses 1:26)"
          },
          "27": {
            "text": "And it came to pass, as the voice was still speaking, Moses cast his eyes andbeheldthe earth, yea, even all of it; and there was not particle of it which he did not behold,discerningit by theSpiritof God.",
            "citation": "(Moses 1:27)"
          },
          "28": {
            "text": "And he beheld also the inhabitants thereof, and there was not asoulwhich he beheld not; and he discerned them by the Spirit of God; and their numbers were great, even numberless as the sand upon the sea shore.",
            "citation": "(Moses 1:28)"
          },
          "29": {
            "text": "And he beheld many lands; and each land was calledearth, and there wereinhabitantson the face thereof.",
            "citation": "(Moses 1:29)"
          },
          "30": {
            "text": "And it came to pass that Moses called upon God, saying:Tellme, I pray thee, why these things are so, and by what thou madest them?",
            "citation": "(Moses 1:30)"
          },
          "31": {
            "text": "And behold, the glory of the Lord was upon Moses, so that Moses stood in the presence of God, andtalked with himface to face. And the Lord God said unto Moses: For mine ownpurposehave I made these things. Here iswisdomand it remaineth in me.",
            "citation": "(Moses 1:31)"
          },
          "32": {
            "text": "And by thewordof my power, have I created them, which is mine Only Begotten Son, who is full ofgraceand truth.",
            "citation": "(Moses 1:32)"
          },
          "33": {
            "text": "Andworldswithout number have Icreated; and I also created them for mine own purpose; and by theSonIcreatedthem, which is mineOnly Begotten.",
            "citation": "(Moses 1:33)"
          },
          "34": {
            "text": "And thefirstman of all men have I calledAdam, which ismany.",
            "citation": "(Moses 1:34)"
          },
          "35": {
            "text": "But only an account of this earth, and the inhabitants thereof, give I unto you. For behold, there are many worlds that have passed away by the word of my power. And there are many that now stand, and innumerable are they unto man; but all things are numbered unto me, for they are mine and Iknowthem.",
            "citation": "(Moses 1:35)"
          },
          "36": {
            "text": "And it came to pass that Moses spake unto the Lord, saying: Be merciful unto thy servant, O God, andtellme concerning this earth, and the inhabitants thereof, and also the heavens, and then thy servant will be content.",
            "citation": "(Moses 1:36)"
          },
          "37": {
            "text": "And the Lord God spake unto Moses, saying: Theheavens, they are many, and they cannot be numbered unto man; but they are numbered unto me, for they are mine.",
            "citation": "(Moses 1:37)"
          },
          "38": {
            "text": "And as one earth shall pass away, and the heavens thereof even so shall another come; and there is noendto my works, neither to my words.",
            "citation": "(Moses 1:38)"
          },
          "39": {
            "text": "For behold, this is myworkand mygloryto bring to pass theimmortalityandeternallifeof man.",
            "citation": "(Moses 1:39)"
          },
          "40": {
            "text": "And now, Moses, my son, I will speak unto thee concerning this earth upon which thou standest; and thou shaltwritethe things which I shall speak.",
            "citation": "(Moses 1:40)"
          },
          "41": {
            "text": "And in day when the children of men shall esteem my words asnaughtandtakemany of them from thebookwhich thou shalt write, behold, I will raise up anotherlikeunto thee; and they shall behadagain among the children of menamong as many as shall believe.",
            "citation": "(Moses 1:41)"
          },
          "42": {
            "text": "(These words werespokenunto Moses in the mount, the name of which shall not be known among the children of men. And now they are spoken unto you. Show them not unto any except them that believe. Even so. Amen.)",
            "citation": "(Moses 1:42)"
          }
        }
      }
    },
    "Abraham": {
      "3": {
        "verses": {
          "1": {
            "text": "And I, Abraham, had theUrim and Thummim, which the Lord my God had given unto me, in Ur of the Chaldees;",
            "citation": "(Abraham 3:1)"
          },
          "2": {
            "text": "And I saw thestars, that they were very great, and that one of them was nearest unto the throne of God; and there were many great ones which were near unto it;",
            "citation": "(Abraham 3:2)"
          },
          "3": {
            "text": "And the Lord said unto me: These are the governing ones; and the name of the great one isKolob, because it is near unto me, for I am the Lord thy God: I have set this one to govern all those which belong to the same order as that upon which thou standest.",
            "citation": "(Abraham 3:3)"
          },
          "4": {
            "text": "And the Lord said unto me, by the Urim and Thummim, that Kolob was after the manner of the Lord, according to itstimesand seasons in the revolutions thereof; that one revolution was adayunto the Lord, after his manner of reckoning, it being one thousandyearsaccording to the time appointed unto that whereon thou standest. This is the reckoning of the Lordstime, according to the reckoning of Kolob.",
            "citation": "(Abraham 3:4)"
          },
          "5": {
            "text": "And the Lord said unto me: The planet which is the lesser light, lesser than that which is to rule the day, even the night, is above orgreaterthan that upon which thou standest in point of reckoning, for it moveth in order more slow; this is in order because it standeth above the earth upon which thou standest, therefore the reckoning of its time is not so many as to its number of days, and of months, and of years.",
            "citation": "(Abraham 3:5)"
          },
          "6": {
            "text": "And the Lord said unto me: Now, Abraham, thesetwofacts exist, behold thine eyes see it; it is given unto thee to know the times of reckoning, and the set time, yea, the set time of the earth upon which thou standest, and the set time of the greater light which is set to rule the day, and the set time of the lesser light which is set to rule the night.",
            "citation": "(Abraham 3:6)"
          },
          "7": {
            "text": "Now the set time of the lesser light is longer time as to its reckoning than the reckoning of the time of the earth upon which thou standest.",
            "citation": "(Abraham 3:7)"
          },
          "8": {
            "text": "And where these two facts exist, there shall be another fact above them, that is, there shall be another planet whose reckoning of time shall be longer still;",
            "citation": "(Abraham 3:8)"
          },
          "9": {
            "text": "And thus there shall be the reckoning of the time of oneplanetabove another, until thou come nigh unto Kolob, which Kolob is after the reckoning of the Lords time; which Kolob is set nigh unto the throne of God, to govern all those planets which belong to the sameorderas that upon which thou standest.",
            "citation": "(Abraham 3:9)"
          },
          "10": {
            "text": "And it is given unto thee to know the set time of all the stars that are set to give light, until thou come near unto the throne of God.",
            "citation": "(Abraham 3:10)"
          },
          "11": {
            "text": "Thus I, Abraham,talkedwith the Lord, face to face, as one man talketh with another; and he told me of the works which his hands had made;",
            "citation": "(Abraham 3:11)"
          },
          "12": {
            "text": "And he said unto me: My son, my son (and his hand was stretched out), behold I will show you all these. And he put his hand upon mine eyes, and I saw those things which his hands had made, which were many; and they multiplied before mine eyes, and I could not see the end thereof.",
            "citation": "(Abraham 3:12)"
          },
          "13": {
            "text": "And he said unto me: This is Shinehah, which is the sun. And he said unto me: Kokob, which is star. And he said unto me: Olea, which is the moon. And he said unto me: Kokaubeam, which signifies stars, or all the great lights, which were in the firmament of heaven.",
            "citation": "(Abraham 3:13)"
          },
          "14": {
            "text": "And it was in the night time when the Lord spake these words unto me: I willmultiplythee, and thyseedafter thee, like unto these; and if thou canst count thenumberof sands, so shall be the number of thy seeds.",
            "citation": "(Abraham 3:14)"
          },
          "15": {
            "text": "And the Lord said unto me: Abraham, Ishowthese things unto thee before ye go into Egypt, that ye may declare all these words.",
            "citation": "(Abraham 3:15)"
          },
          "16": {
            "text": "Iftwothings exist, and there be one above the other, there shall be greater things above them; thereforeKolobis the greatest of all the Kokaubeam that thou hast seen, because it is nearest unto me.",
            "citation": "(Abraham 3:16)"
          },
          "17": {
            "text": "Now, if there be two things, one above the other, and the moon be above the earth, then it may be that planet or star may exist above it; and there is nothing that the Lord thy God shall take in his heart to do but what he willdoit.",
            "citation": "(Abraham 3:17)"
          },
          "18": {
            "text": "Howbeit that he made the greater star; as, also, if there be twospirits, and one shall be more intelligent than the other, yet these two spirits, notwithstanding one is more intelligent than the other, have no beginning; they existed before, they shall have no end, they shall exist after, for they aregnolaum, or eternal.",
            "citation": "(Abraham 3:18)"
          },
          "19": {
            "text": "And the Lord said unto me: These two facts do exist, that there are two spirits, one being more intelligent than the other; there shall be another more intelligent than they; I am the Lord thy God, I ammore intelligentthan they all.",
            "citation": "(Abraham 3:19)"
          },
          "20": {
            "text": "The Lord thy God sent his angel todeliverthee from the hands of the priest of Elkenah.",
            "citation": "(Abraham 3:20)"
          },
          "21": {
            "text": "I dwell in the midst of them all; I now, therefore, have come down unto thee to declare unto thee theworkswhich my hands have made, wherein mywisdomexcelleth them all, for Irulein the heavens above, and in the earth beneath, in all wisdom and prudence, over all the intelligences thine eyes have seen from the beginning; I came down in the beginning in the midst of all the intelligences thou hast seen.",
            "citation": "(Abraham 3:21)"
          },
          "22": {
            "text": "Now the Lord had shown unto me, Abraham, theintelligencesthat were organized before the world was; and among all thesethere were many of thenobleand great ones;",
            "citation": "(Abraham 3:22)"
          },
          "23": {
            "text": "And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wastchosenbefore thou wast born.",
            "citation": "(Abraham 3:23)"
          },
          "24": {
            "text": "And there stoodoneamong them that was like unto God, and he said unto those who were with him: We will go down, for there is space there, and we will take of these materials, andwewill make an earth whereon these maydwell;",
            "citation": "(Abraham 3:24)"
          },
          "25": {
            "text": "And we willprovethem herewith, to see if they willdoall things whatsoever the Lord their God shall command them;",
            "citation": "(Abraham 3:25)"
          },
          "26": {
            "text": "And they whokeeptheir firstestateshall be added upon; and they who keep not their first estate shall not have glory in the same kingdom with those who keep their first estate; and they who keep their secondestateshall havegloryadded upon their heads for ever and ever.",
            "citation": "(Abraham 3:26)"
          },
          "27": {
            "text": "And theLordsaid: Whom shall Isend? And one answered like unto the Son of Man: Here am I, send me. Andanotheranswered and said: Here am I, send me. And the Lord said: I willsendthe first.",
            "citation": "(Abraham 3:27)"
          },
          "28": {
            "text": "And thesecondwas angry, and kept not his firstestate; and, at that day, many followed after him.",
            "citation": "(Abraham 3:28)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 63724,
  "total_sources": 4,
  "generated_at": "2025-12-14T04:01:27.361829"
}