{
  "week_number": 44,
  "date_range": "Jeremiah 31–33",
  "title": ";36–39;Lamentations 1;3",
  "primary_scriptures": [
    {
      "book": "Lamentations",
      "chapters": [
        "1"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;36–39;Lamentations 1;3 ---\nWhen the Lord first called Jeremiah to be a prophet, He told him that his mission would be “to root out, and to pull down” (\nJeremiah 1:10\n)—and in Jerusalem, there was plenty of wickedness to root out and pull down. But this was only part of Jeremiah’s mission—he was also called “to build, and to plant” (\nJeremiah 1:10\n). What could be built or planted in the desolate ruins left by the rebellion of the covenant people? Asked another way, when sin or adversity has left our lives in ruins, how can we rebuild and plant again? The answer lies in “the Branch of righteousness” (\nJeremiah 33:15\n), the promised Messiah. He brings “a new covenant” (\nJeremiah 31:31\n)—one that requires more than the outward appearance of devotion. His law must be “in [our] inward parts,” written “in [our] hearts.” That’s what it means for the Lord to “be [our] God” and for us to “be [His] people” (\nJeremiah 31:33\n). It’s a lifelong process, and we will still make mistakes and have cause to mourn from time to time. But when we do, the Lord promises, “I will turn their mourning into joy” (\nJeremiah 31:13\n).\nFor an overview of Lamentations, see “\nLamentations, Book of\n” in the Guide to the Scriptures.\nIdeas for Learning at Home and at Church\nJeremiah 31\n;\n33\nThe Lord will bring His covenant people out of captivity.\nIn\nJeremiah 31\n;\n33\nthe Lord acknowledged the “lamentation, and bitter weeping” (\nJeremiah 31:15\n) the Israelites would experience in captivity. However, he also offered words of comfort and hope. Look for them as you read these chapters. What promises do you find that apply to you?\nJeremiah 31:31–34\n;\n32:37–42\n“They shall be my people, and I will be their God.”\nAlthough the Israelites had broken their covenants, Jeremiah prophesied that the Lord would again establish a “new” and “everlasting covenant” with them (\nJeremiah 31:31\n;\n32:40\n). What is that covenant? Consider looking for insights in Guide to the Scriptures, “\nNew and Everlasting Covenant\n,” Gospel Library.\nAs you read\nJeremiah 31:31–34\n;\n32:37–42\n, ponder:\nWhat it means to you to be part of God’s covenant people.\nWhat it means to have His law written in your heart.\nWhat the Lord promises when you make covenants with Him.\nHow your covenant relationship with the Lord changes you.\nWhat promises have you made to God as you have participated in sacred ordinances? How is He fulfilling His promises to you?\nSee also David A. Bednar, “\nAbide in Me, and I in You; Therefore Walk with Me\n,”\nLiahona\n, May 2023, 123–26.\nJeremiah 36\nThe scriptures have power to turn me away from evil.\nAccording to\nJeremiah 36:2–3\n, why did the Lord command Jeremiah to record his prophecies? As you read\nJeremiah 36\n, note how the following people felt about these prophecies:\nThe Lord (see\nverses 1–3, 27–31\n)\nJeremiah (see\nverses 4–7, 32\n)\nBaruch (see\nverses 4, 8–10, 14–18\n)\nJehudi and King Jehoiakim (see\nverses 20–26\n)\nElnathan, Delaiah, and Gemariah (see\nverse 25\n)\nPonder how you feel about the scriptures. How have they helped you turn away from evil?\nJeremiah 37–39\nBe firm in following God’s prophets.\nIn\nJeremiah 37:1–3, 15–21\n;\n38:1–6, 14–28\n, what evidence do you see that King Zedekiah believed Jeremiah was the Lord’s true prophet? What evidence do you see that Zedekiah did not believe? What do you learn from this comparison? As you read\nJeremiah 39\n, ponder the difference it would have made if Zedekiah and his people had followed the prophet and kept the commandments of the Lord. (Compare what happened to Zedekiah with what happened to Lehi’s family in\n1 Nephi 1–2\n.)\nJeremiah 38:6–13\n;\n39:15–18\nI can be bold in standing up for what is right.\nThe king’s officials felt that Jeremiah’s prophecies were making their soldiers less willing to fight, so they threw Jeremiah into a filthy dungeon (see\nJeremiah 38:1–4\n). In\nJeremiah 38:6–13\n, what impresses you about the response of Ebed-melech the Ethiopian? Notice also the blessing the Lord gave Ebed-melech in\nJeremiah 39:15–18\n.\nHow could you follow Ebed-melech’s example?\nThe Cry of Jeremiah\nLamentations 1\n;\n3\nThe Lord can relieve the sorrow I experience because of sin.\nThe book of Lamentations is a collection of poems written after the destruction of Jerusalem and its temple. Why do you think it is important they were preserved? Consider what the metaphors in\nLamentations 1\nand\n3\nhelp you understand about the great sorrow Israel felt. What messages of hope in Christ do you find? (see especially\nLamentations 3:20–33\n; see also\nMatthew 5:4\n;\nJames 4:8–10\n;\nAlma 36:17–20\n).\nPresident M. Russell Ballard mentioned several situations that may cause some to lose hope, and he offered counsel about where to find hope:\n“Some of us may find our lives laden with frustration, disappointment, and sorrow. Many feel helpless to deal with the chaos that seems to prevail in the world. Others anguish over family members who are being carried downstream in a swift, raging current of weakening values and declining moral standards. … Many have even resigned themselves to accept the wickedness and cruelty of the world as being irreparable. They have given up hope. …\n“… Some among us may have lost all hope because of sin and transgression. A person can become so deeply immersed in the ways of the world that he sees no way out and loses all hope. My plea to all who have fallen into this trap of the adversary is to never give up! Regardless of how desperate things may seem or how desperate they may yet become, please believe me, you can always have hope. Always” (“\nThe Joy of Hope Fulfilled\n,”\nEnsign\n, Nov. 1992, 31–32).\nSee also “\nCome, Ye Disconsolate\n,”\nHymns\n, no. 115.\nHelp others take responsibility for their own learning.\nSometimes it seems like the easiest way to teach is to just tell learners what we think they should know. However, the easiest way is not always the best way. Elder David A. Bednar taught: “Our intent ought not to be ‘What do I tell them?’ Instead, the questions to ask ourselves are ‘What can I invite them to do? What inspired questions can I ask that, if they are willing to respond, will begin to invite the Holy Ghost into their lives?’” (\nevening with a General Authority\n, Feb. 7, 2020, broadcasts.ChurchofJesusChrist.org; see also\nTeaching in the Savior’s Way\n,\n25\n). There are many ways to help learners take responsibility for their learning. For example, in this outline learners are invited to search, ponder, make lists, look at pictures, participate in object lessons, draw, and share and apply what they learn.\nIdeas for Teaching Children\nJeremiah 31:3\nHeavenly Father and Jesus love me “with an everlasting love.”\nAs you read\nJeremiah 31:3\nwith your children, they could help you find objects (or pictures of objects) that last a long time, such as a metal coin, and some that do not, such as a piece of fruit. You could talk about what “everlasting” means and share with each other how you have felt Heavenly Father’s “everlasting love.” You could also sing together a song like “\nGod Is Watching Over All\n” (\nChildren’s Songbook\n, 229).\nJeremiah 31:31–34\n;\n32:38–41\nGod will help me keep my covenants.\nYour children might enjoy drawing a heart on a piece of paper and then writing in the heart things they learn from\nJeremiah 31:31–34\nabout making covenants with God. You may want to review the covenant they make at baptism (see\nMosiah 18:10, 13\n) and discuss what it means to have these promises written in their hearts.\nJeremiah 36:1–4\nThe scriptures are the word of God.\nThis week’s activity page could help your children learn about Jeremiah, Baruch, and the king (see\nJeremiah 36\n). They could also do actions that go along with the words in\nJeremiah 36:4–10\n, such as writing in a book (see\nverse 4\n) and reading the scriptures to the people (see\nverses 8, 10\n).\nYou and your children could look at a children’s book and a copy of the scriptures and talk about how these books are different. What makes the scriptures special? It may be inspiring to share with each other some scripture passages that are special to you.\nJeremiah 38:6–13\nI can stand up for what is right.\nYou could use the picture at the end of the outline to help your children visualize the story of Ebed-melech in\nJeremiah 38:6–13\n. Maybe you could help them find a verse where Ebed-melech did something brave to help the Lord’s prophet. What can we do to show that we know our prophet today is called of God?\nLamentations 1:1–2, 16\n;\n3:22–26\nThe Savior made it possible for me to be forgiven of my sins.\nTo introduce Lamentations, you may want to explain to your children that because the Israelites had not repented, Jerusalem and the temple were destroyed. You could share with each other how you might have felt if you were living there at that time (see\nLamentations 1:1–2, 16\n). How might the message in\nLamentations 3:22–26\nhave given you hope?\nYou could also tell each other about times you felt sad about a bad choice you made. What do we find in\nLamentations 3:22–26\nthat helps us understand the forgiveness Jesus Christ offers?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 44: Lesson 136: Lesson 136—Lamentations 1; 3This lesson can help students feel the Savior’s compassion for them, even when they sin. ---\n\n--- Lesson 136 ---\nBecause the Savior is filled with compassion, He is willing to heal, comfort, and forgive, even when we sin against Him. After Jerusalem was destroyed because of sin and rebellion, Jeremiah sought to help the Jews understand the Savior’s compassion and to find hope in it. This lesson can help students feel the Savior’s compassion for them, even when they sin. Student preparation: Invite students to recall a story from the scriptures that demonstrates the Savior’s compassionate nature. Students will have a chance to refer to this story in the lesson. Possible Learning Activities After we sin Consider beginning class by sharing the following scenario. Alternatively, you could show the video “ Painted into a Corner ” from time code 0:00 to 1:47. This video is available at ChurchofJesusChrist.org . You could show the rest of the video later in the lesson. 3:41 Imagine a young man has done his best to make good choices in his life. One day while attending a party, he gives into peer pressure and drinks alcohol because he wants to fit in. The next morning, he wakes up feeling alone, guilty, and frustrated. He slowly begins making other poor choices and starts losing hope for his future. Write students’ responses to the following questions on the board. The written responses will be referenced throughout the lesson. When people sin, how might they see or feel about themselves? How might they see or feel about Heavenly Father and Jesus Christ? Invite students to ponder the following questions to evaluate their own feelings. Have you ever thought any of the statements on the board? Which of these statements do you know are false? Which are you unsure about? It is important to remember that we all sin and “come short of the glory of God” ( Romans 3:23 ). As you study Lamentations today, look for impressions from the Holy Ghost that can help you recognize how Heavenly Father and Jesus Christ feel about you, even when you make mistakes. Sorrow for sin Consider displaying the following picture. Invite students to share what they see in this image or how it makes them feel. Explain that this image shows Jeremiah and his great sorrow. Students could share what they remember about the story of Jeremiah and why he would have felt sorrow. As needed, share details from the following paragraph. For about 40 years, the Lord told Jeremiah to prophesy to the house of Israel about Jerusalem’s destruction and captivity if they chose not to repent and turn back to God (see Jeremiah 16:1–13 ). During the reign of King Zedekiah, the Babylonians destroyed Jerusalem and brought many people into captivity, fulfilling the Lord’s prophecy (see Jeremiah 52 ). Sometime after these events, Jeremiah recorded the book of Lamentations. You might want to explain that the term lamentation refers to expressions of deep sorrow or grief. The following activity could help students understand the suffering the Lord’s people experienced. You might organize students into pairs or small groups to study the scripture passages. Explain that Jeremiah wrote most of these verses from Jerusalem’s perspective as if the city itself were speaking. Read one or two of the following passages, looking for words or phrases that express how the people felt after suffering because of their sins. Lamentations 1:1–4 Lamentations 1:16–18 Lamentations 1:20–22 What words or phrases did you discover? To help students examine what they discovered from an eternal perspective, you could ask the following question. Knowing that Heavenly Father and Jesus Christ love us, why do you think They allow us to experience this kind of suffering when we sin? If students need help answering this question, you could invite them to read passages such as 2 Corinthians 7:9–10 ; Alma 42:18, 29 ; Doctrine and Covenants 95:1 , looking for possible answers. The Savior’s compassion The remainder of the lesson can help students feel the compassion the Savior has for us even when we sin. You could organize students into pairs to study the following passages and answer the accompanying questions. For example, one student could study verses 22–26 , and the other verses 31–33 . Reflect on the statements on the board from the beginning of the lesson. Read Lamentations 3:22–26, 31–33 , looking for words or phrases you would share with someone who feels this way. What words or phrases would you share? Why? What truth from these verses would you want them to understand? As students share, they might identify the following truth: The Lord has compassion for us, even when we sin. If students need help understanding the word compassion , you could share the following definition: “In the scriptures, compassion means literally ‘to suffer with.’ It also means to show sympathy, pity, and mercy for another” (Guide to the Scriptures, “ Compassion ,” Gospel Library). To better understand the Savior’s compassion, students could do the following activity. Instead of studying one of the following options, students could think of and study a different story from the scriptures that demonstrates the Savior’s compassion. Complete one of the following study options, looking for what helps you better understand how you can experience the Savior’s compassion in your life. Study one of the following stories that demonstrate the Savior’s compassion: Matthew 18:23–35 ; John 8:1–11 . Study one or two of the following scripture passages that teach about the Savior’s compassion: Mosiah 15:7–9 ; Doctrine and Covenants 64:2–4 ; Doctrine and Covenants 101:9 . Consider inviting students to teach each other what they learned and felt. You could invite willing students to share with the class. The following testimony might also help with this discussion. Elder Dale G. Renlund of the Quorum of the Twelve Apostles testified: 15:45 Jesus Christ can forgive because He paid the price for our sins. Our Redeemer chooses to forgive because of His incomparable compassion, mercy, and love. Our Savior wants to forgive because this is one of His divine attributes. And, like the Good Shepherd He is, He is joyful when we choose to repent. Even as we feel godly sorrow for our actions, when we choose to repent, we immediately invite the Savior into our lives. (“ Repentance: A Joyful Choice ,” Ensign or Liahona , Nov. 2016, 123) Feeling the Savior’s compassion for me When have you or someone you know experienced the Savior’s compassion? (Remember not to share past sins or anything that is too personal.) Remind students of the young man from the beginning of the lesson. What would you share with this young man based on what you learned today? Consider finishing the video “ Painted into a Corner ,” from time code 1:48 to 3:41. Or if you did not show the first half of the video yet, consider showing the entire video. Students could look for evidence that the Savior showed compassion for the young man. Invite students to share what they found. 3:41 You may want to conclude with your testimony, thoughts, or feelings about the Savior.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";36–39;Lamentations 1;3",
      "content": "When the Lord first called Jeremiah to be a prophet, He told him that his mission would be “to root out, and to pull down” (\nJeremiah 1:10\n)—and in Jerusalem, there was plenty of wickedness to root out and pull down. But this was only part of Jeremiah’s mission—he was also called “to build, and to plant” (\nJeremiah 1:10\n). What could be built or planted in the desolate ruins left by the rebellion of the covenant people? Asked another way, when sin or adversity has left our lives in ruins, how can we rebuild and plant again? The answer lies in “the Branch of righteousness” (\nJeremiah 33:15\n), the promised Messiah. He brings “a new covenant” (\nJeremiah 31:31\n)—one that requires more than the outward appearance of devotion. His law must be “in [our] inward parts,” written “in [our] hearts.” That’s what it means for the Lord to “be [our] God” and for us to “be [His] people” (\nJeremiah 31:33\n). It’s a lifelong process, and we will still make mistakes and have cause to mourn from time to time. But when we do, the Lord promises, “I will turn their mourning into joy” (\nJeremiah 31:13\n).\nFor an overview of Lamentations, see “\nLamentations, Book of\n” in the Guide to the Scriptures.\nIdeas for Learning at Home and at Church\nJeremiah 31\n;\n33\nThe Lord will bring His covenant people out of captivity.\nIn\nJeremiah 31\n;\n33\nthe Lord acknowledged the “lamentation, and bitter weeping” (\nJeremiah 31:15\n) the Israelites would experience in captivity. However, he also offered words of comfort and hope. Look for them as you read these chapters. What promises do you find that apply to you?\nJeremiah 31:31–34\n;\n32:37–42\n“They shall be my people, and I will be their God.”\nAlthough the Israelites had broken their covenants, Jeremiah prophesied that the Lord would again establish a “new” and “everlasting covenant” with them (\nJeremiah 31:31\n;\n32:40\n). What is that covenant? Consider looking for insights in Guide to the Scriptures, “\nNew and Everlasting Covenant\n,” Gospel Library.\nAs you read\nJeremiah 31:31–34\n;\n32:37–42\n, ponder:\nWhat it means to you to be part of God’s covenant people.\nWhat it means to have His law written in your heart.\nWhat the Lord promises when you make covenants with Him.\nHow your covenant relationship with the Lord changes you.\nWhat promises have you made to God as you have participated in sacred ordinances? How is He fulfilling His promises to you?\nSee also David A. Bednar, “\nAbide in Me, and I in You; Therefore Walk with Me\n,”\nLiahona\n, May 2023, 123–26.\nJeremiah 36\nThe scriptures have power to turn me away from evil.\nAccording to\nJeremiah 36:2–3\n, why did the Lord command Jeremiah to record his prophecies? As you read\nJeremiah 36\n, note how the following people felt about these prophecies:\nThe Lord (see\nverses 1–3, 27–31\n)\nJeremiah (see\nverses 4–7, 32\n)\nBaruch (see\nverses 4, 8–10, 14–18\n)\nJehudi and King Jehoiakim (see\nverses 20–26\n)\nElnathan, Delaiah, and Gemariah (see\nverse 25\n)\nPonder how you feel about the scriptures. How have they helped you turn away from evil?\nJeremiah 37–39\nBe firm in following God’s prophets.\nIn\nJeremiah 37:1–3, 15–21\n;\n38:1–6, 14–28\n, what evidence do you see that King Zedekiah believed Jeremiah was the Lord’s true prophet? What evidence do you see that Zedekiah did not believe? What do you learn from this comparison? As you read\nJeremiah 39\n, ponder the difference it would have made if Zedekiah and his people had followed the prophet and kept the commandments of the Lord. (Compare what happened to Zedekiah with what happened to Lehi’s family in\n1 Nephi 1–2\n.)\nJeremiah 38:6–13\n;\n39:15–18\nI can be bold in standing up for what is right.\nThe king’s officials felt that Jeremiah’s prophecies were making their soldiers less willing to fight, so they threw Jeremiah into a filthy dungeon (see\nJeremiah 38:1–4\n). In\nJeremiah 38:6–13\n, what impresses you about the response of Ebed-melech the Ethiopian? Notice also the blessing the Lord gave Ebed-melech in\nJeremiah 39:15–18\n.\nHow could you follow Ebed-melech’s example?\nThe Cry of Jeremiah\nLamentations 1\n;\n3\nThe Lord can relieve the sorrow I experience because of sin.\nThe book of Lamentations is a collection of poems written after the destruction of Jerusalem and its temple. Why do you think it is important they were preserved? Consider what the metaphors in\nLamentations 1\nand\n3\nhelp you understand about the great sorrow Israel felt. What messages of hope in Christ do you find? (see especially\nLamentations 3:20–33\n; see also\nMatthew 5:4\n;\nJames 4:8–10\n;\nAlma 36:17–20\n).\nPresident M. Russell Ballard mentioned several situations that may cause some to lose hope, and he offered counsel about where to find hope:\n“Some of us may find our lives laden with frustration, disappointment, and sorrow. Many feel helpless to deal with the chaos that seems to prevail in the world. Others anguish over family members who are being carried downstream in a swift, raging current of weakening values and declining moral standards. … Many have even resigned themselves to accept the wickedness and cruelty of the world as being irreparable. They have given up hope. …\n“… Some among us may have lost all hope because of sin and transgression. A person can become so deeply immersed in the ways of the world that he sees no way out and loses all hope. My plea to all who have fallen into this trap of the adversary is to never give up! Regardless of how desperate things may seem or how desperate they may yet become, please believe me, you can always have hope. Always” (“\nThe Joy of Hope Fulfilled\n,”\nEnsign\n, Nov. 1992, 31–32).\nSee also “\nCome, Ye Disconsolate\n,”\nHymns\n, no. 115.\nHelp others take responsibility for their own learning.\nSometimes it seems like the easiest way to teach is to just tell learners what we think they should know. However, the easiest way is not always the best way. Elder David A. Bednar taught: “Our intent ought not to be ‘What do I tell them?’ Instead, the questions to ask ourselves are ‘What can I invite them to do? What inspired questions can I ask that, if they are willing to respond, will begin to invite the Holy Ghost into their lives?’” (\nevening with a General Authority\n, Feb. 7, 2020, broadcasts.ChurchofJesusChrist.org; see also\nTeaching in the Savior’s Way\n,\n25\n). There are many ways to help learners take responsibility for their learning. For example, in this outline learners are invited to search, ponder, make lists, look at pictures, participate in object lessons, draw, and share and apply what they learn.\nIdeas for Teaching Children\nJeremiah 31:3\nHeavenly Father and Jesus love me “with an everlasting love.”\nAs you read\nJeremiah 31:3\nwith your children, they could help you find objects (or pictures of objects) that last a long time, such as a metal coin, and some that do not, such as a piece of fruit. You could talk about what “everlasting” means and share with each other how you have felt Heavenly Father’s “everlasting love.” You could also sing together a song like “\nGod Is Watching Over All\n” (\nChildren’s Songbook\n, 229).\nJeremiah 31:31–34\n;\n32:38–41\nGod will help me keep my covenants.\nYour children might enjoy drawing a heart on a piece of paper and then writing in the heart things they learn from\nJeremiah 31:31–34\nabout making covenants with God. You may want to review the covenant they make at baptism (see\nMosiah 18:10, 13\n) and discuss what it means to have these promises written in their hearts.\nJeremiah 36:1–4\nThe scriptures are the word of God.\nThis week’s activity page could help your children learn about Jeremiah, Baruch, and the king (see\nJeremiah 36\n). They could also do actions that go along with the words in\nJeremiah 36:4–10\n, such as writing in a book (see\nverse 4\n) and reading the scriptures to the people (see\nverses 8, 10\n).\nYou and your children could look at a children’s book and a copy of the scriptures and talk about how these books are different. What makes the scriptures special? It may be inspiring to share with each other some scripture passages that are special to you.\nJeremiah 38:6–13\nI can stand up for what is right.\nYou could use the picture at the end of the outline to help your children visualize the story of Ebed-melech in\nJeremiah 38:6–13\n. Maybe you could help them find a verse where Ebed-melech did something brave to help the Lord’s prophet. What can we do to show that we know our prophet today is called of God?\nLamentations 1:1–2, 16\n;\n3:22–26\nThe Savior made it possible for me to be forgiven of my sins.\nTo introduce Lamentations, you may want to explain to your children that because the Israelites had not repented, Jerusalem and the temple were destroyed. You could share with each other how you might have felt if you were living there at that time (see\nLamentations 1:1–2, 16\n). How might the message in\nLamentations 3:22–26\nhave given you hope?\nYou could also tell each other about times you felt sad about a bad choice you made. What do we find in\nLamentations 3:22–26\nthat helps us understand the forgiveness Jesus Christ offers?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 44: Lesson 136: Lesson 136—Lamentations 1; 3This lesson can help students feel the Savior’s compassion for them, even when they sin.",
      "content": "\n--- Lesson 136 ---\nBecause the Savior is filled with compassion, He is willing to heal, comfort, and forgive, even when we sin against Him. After Jerusalem was destroyed because of sin and rebellion, Jeremiah sought to help the Jews understand the Savior’s compassion and to find hope in it. This lesson can help students feel the Savior’s compassion for them, even when they sin. Student preparation: Invite students to recall a story from the scriptures that demonstrates the Savior’s compassionate nature. Students will have a chance to refer to this story in the lesson. Possible Learning Activities After we sin Consider beginning class by sharing the following scenario. Alternatively, you could show the video “ Painted into a Corner ” from time code 0:00 to 1:47. This video is available at ChurchofJesusChrist.org . You could show the rest of the video later in the lesson. 3:41 Imagine a young man has done his best to make good choices in his life. One day while attending a party, he gives into peer pressure and drinks alcohol because he wants to fit in. The next morning, he wakes up feeling alone, guilty, and frustrated. He slowly begins making other poor choices and starts losing hope for his future. Write students’ responses to the following questions on the board. The written responses will be referenced throughout the lesson. When people sin, how might they see or feel about themselves? How might they see or feel about Heavenly Father and Jesus Christ? Invite students to ponder the following questions to evaluate their own feelings. Have you ever thought any of the statements on the board? Which of these statements do you know are false? Which are you unsure about? It is important to remember that we all sin and “come short of the glory of God” ( Romans 3:23 ). As you study Lamentations today, look for impressions from the Holy Ghost that can help you recognize how Heavenly Father and Jesus Christ feel about you, even when you make mistakes. Sorrow for sin Consider displaying the following picture. Invite students to share what they see in this image or how it makes them feel. Explain that this image shows Jeremiah and his great sorrow. Students could share what they remember about the story of Jeremiah and why he would have felt sorrow. As needed, share details from the following paragraph. For about 40 years, the Lord told Jeremiah to prophesy to the house of Israel about Jerusalem’s destruction and captivity if they chose not to repent and turn back to God (see Jeremiah 16:1–13 ). During the reign of King Zedekiah, the Babylonians destroyed Jerusalem and brought many people into captivity, fulfilling the Lord’s prophecy (see Jeremiah 52 ). Sometime after these events, Jeremiah recorded the book of Lamentations. You might want to explain that the term lamentation refers to expressions of deep sorrow or grief. The following activity could help students understand the suffering the Lord’s people experienced. You might organize students into pairs or small groups to study the scripture passages. Explain that Jeremiah wrote most of these verses from Jerusalem’s perspective as if the city itself were speaking. Read one or two of the following passages, looking for words or phrases that express how the people felt after suffering because of their sins. Lamentations 1:1–4 Lamentations 1:16–18 Lamentations 1:20–22 What words or phrases did you discover? To help students examine what they discovered from an eternal perspective, you could ask the following question. Knowing that Heavenly Father and Jesus Christ love us, why do you think They allow us to experience this kind of suffering when we sin? If students need help answering this question, you could invite them to read passages such as 2 Corinthians 7:9–10 ; Alma 42:18, 29 ; Doctrine and Covenants 95:1 , looking for possible answers. The Savior’s compassion The remainder of the lesson can help students feel the compassion the Savior has for us even when we sin. You could organize students into pairs to study the following passages and answer the accompanying questions. For example, one student could study verses 22–26 , and the other verses 31–33 . Reflect on the statements on the board from the beginning of the lesson. Read Lamentations 3:22–26, 31–33 , looking for words or phrases you would share with someone who feels this way. What words or phrases would you share? Why? What truth from these verses would you want them to understand? As students share, they might identify the following truth: The Lord has compassion for us, even when we sin. If students need help understanding the word compassion , you could share the following definition: “In the scriptures, compassion means literally ‘to suffer with.’ It also means to show sympathy, pity, and mercy for another” (Guide to the Scriptures, “ Compassion ,” Gospel Library). To better understand the Savior’s compassion, students could do the following activity. Instead of studying one of the following options, students could think of and study a different story from the scriptures that demonstrates the Savior’s compassion. Complete one of the following study options, looking for what helps you better understand how you can experience the Savior’s compassion in your life. Study one of the following stories that demonstrate the Savior’s compassion: Matthew 18:23–35 ; John 8:1–11 . Study one or two of the following scripture passages that teach about the Savior’s compassion: Mosiah 15:7–9 ; Doctrine and Covenants 64:2–4 ; Doctrine and Covenants 101:9 . Consider inviting students to teach each other what they learned and felt. You could invite willing students to share with the class. The following testimony might also help with this discussion. Elder Dale G. Renlund of the Quorum of the Twelve Apostles testified: 15:45 Jesus Christ can forgive because He paid the price for our sins. Our Redeemer chooses to forgive because of His incomparable compassion, mercy, and love. Our Savior wants to forgive because this is one of His divine attributes. And, like the Good Shepherd He is, He is joyful when we choose to repent. Even as we feel godly sorrow for our actions, when we choose to repent, we immediately invite the Savior into our lives. (“ Repentance: A Joyful Choice ,” Ensign or Liahona , Nov. 2016, 123) Feeling the Savior’s compassion for me When have you or someone you know experienced the Savior’s compassion? (Remember not to share past sins or anything that is too personal.) Remind students of the young man from the beginning of the lesson. What would you share with this young man based on what you learned today? Consider finishing the video “ Painted into a Corner ,” from time code 1:48 to 3:41. Or if you did not show the first half of the video yet, consider showing the entire video. Students could look for evidence that the Savior showed compassion for the young man. Invite students to share what they found. 3:41 You may want to conclude with your testimony, thoughts, or feelings about the Savior.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 16314,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.398728"
}