{
  "week_number": 42,
  "date_range": "Isaiah 58–66",
  "title": "",
  "primary_scriptures": [
    {
      "book": "Isaiah",
      "chapters": [
        "58",
        "59",
        "60",
        "61",
        "62",
        "63",
        "64",
        "65",
        "66"
      ],
      "verses": null,
      "book_type": "old_testament"
    },
    {
      "book": "Isaiah",
      "chapters": [
        "58",
        "59",
        "60",
        "61",
        "62",
        "63",
        "64",
        "65",
        "66"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM:  ---\nEarly in His ministry, Jesus Christ visited a synagogue in Nazareth, where He was raised. He stood there to read from the scriptures, opened the book of Isaiah, and read what we now know as\nIsaiah 61:1–2\n. He then announced, “This day is this scripture fulfilled in your ears.” This was one of the Savior’s most straightforward declarations that He was the Anointed One, who would “heal the brokenhearted” and “preach deliverance to the captives” (see\nLuke 4:16–21\n). This scripture was indeed fulfilled on that day. And, like many other prophecies of Isaiah, it is also being fulfilled in our day. The Savior continues to heal the brokenhearted who come unto Him. There are still many captives who need deliverance. And there is a glorious future to prepare for—a time when the Lord will “create new heavens and a new earth” (\nIsaiah 65:17\n) and “cause righteousness and praise to spring forth before all the nations” (\nIsaiah 61:11\n). Reading Isaiah opens our eyes to what the Lord has already done, what He is doing, and what He will yet do for His people.\nIdeas for Learning at Home and at Church\nIsaiah 58:3–12\nFasting builds spiritual power and blesses people in need.\nWhy would anyone voluntarily go without food when food is available? As you study\nIsaiah 58:3–12\n, you might think about your reasons for fasting—as well as the Lord’s reasons for giving this law. Here are some other questions to ponder:\nWhy can fasting sometimes be perceived like more of a burden than a blessing? (see\nIsaiah 58:3–5\n). How do the Lord’s teachings in this chapter change that perception for you?\nWhat might it mean to “loose the bands of wickedness” and “break every yoke”? (\nIsaiah 58:6\n). How can fasting bless others? (see\nverse 7\n).\nHow has fasting brought you the blessings described in\nIsaiah 58:8–12\n?\nIn his message “\nIs Not This the Fast That I Have Chosen?\n” (\nEnsign\nor\nLiahona\n, May 2015, 22–25), President Henry B. Eyring shared several examples of how people have been blessed by fasting and fast offerings. How have you witnessed similar blessings in your life?\nSee also “\nBless Our Fast, We Pray\n,”\nHymns\n, no. 138; Topics and Questions, “\nFasting and Fast Offerings,\n” Gospel Library.\nGet to know the people you teach.\n“Being a Christlike teacher includes getting to know the people you teach and striving to understand what is in their hearts. … You can find out how they learn best. You can ask questions, listen carefully, and observe. Above all, you can pray for the understanding that only the Spirit can give. The better you know a person, the better able you are to help him or her find personal meaning and power in the gospel of Jesus Christ. Once you understand a person’s thirst, the Spirit can teach you how to help quench it with the Savior’s living water” (\nTeaching in the Savior’s Way\n,\n13\n).\nIsaiah 58:13–14\nHonoring the Lord on the Sabbath brings joy.\nIs the Sabbath day “a delight” for you? As you study\nIsaiah 58:13–14\n, consider how you could find more delight in the Lord’s day. For example, what might it mean to turn “from doing thy pleasure on [His] holy day”? What is the difference between “[delighting] thyself in the Lord” and “doing thine own ways”?\nSee also Russell M. Nelson, “\nThe Sabbath Is a Delight\n,”\nEnsign\nor\nLiahona\n, May 2015, 129–32.\nIsaiah 59:9–21\n;\n61:1–3\n;\n63:7–9\nJesus Christ is my Savior and Redeemer.\nIsaiah 58–66\nhas multiple references to the atoning mission of Jesus Christ. Look for them as you study. In particular, note the titles and words used to describe the Savior. For example:\nWhat impresses you about the description of the “intercessor” in\nIsaiah 59:16–21\n? How does the Savior overcome the conditions described in\nverses 9–15\n?\nWhen Jesus Christ announced to the people of Nazareth that He was the Messiah, He quoted from\nIsaiah 61:1–3\n(see\nLuke 4:16–21\n; see also the video “Jesus Declares He Is the Messiah,” Gospel Library). How has Jesus Christ blessed you and others in the ways described in these verses? How has He given beauty in place of ashes?\n3:24\nJesus Declares He Is the Messiah\nWhat “lovingkindnesses of the Lord” can you “mention”? (see\nIsaiah 63:7–9\n).\nWhat other references to the Savior do you find in\nIsaiah 58–66\n?\nSee also\nMosiah 3:7\n;\nDoctrine and Covenants 133:46–53\n.\nA Gift of Light\n, by Eva Timothy\nIsaiah 60\n;\n62\n“The Lord shall be unto thee an everlasting light.”\nIsaiah 60\nand\n62\nspeak of light and dark, eyes and seeing to teach about how the gospel of Jesus Christ will bless the world in the last days. Look for these concepts in\nIsaiah 60:1–5, 19–20\n;\n62:1–2\n. As you read these chapters, ponder how God is gathering His children out of darkness to His light. What is your role in this work?\nSee also\n1 Nephi 22:3–12\n;\n3 Nephi 18:24\n;\nDoctrine and Covenants 14:9\n; Bonnie H. Cordon, “\nThat They May See\n,”\nEnsign\nor\nLiahona\n, May 2020, 78–80.\nIsaiah 64:1–5\n;\n65:17–25\n;\n66\nChrist will reign on earth during the Millennium.\nIsaiah spoke of a day when “the former troubles are forgotten” (\nIsaiah 65:16\n). While this prophecy has several fulfillments, in its fullest sense, that day is yet to come—when Jesus Christ will return. Isaiah described this future day in\nIsaiah 64:1–5\n;\n65:17–25\n;\n66\n. Notice how often he used words like “rejoice” and “rejoicing.” Why will the Savior’s return be a day of rejoicing for you? What can you do to prepare for His coming?\nSee also\nArticles of Faith 1:10\n; Russell M. Nelson, “\nThe Future of the Church: Preparing the World for the Savior’s Second Coming\n,”\nEnsign\n, Apr. 2020, 13–17.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 58:6–11\nFasting blesses me and others in need.\nPerhaps the best way to encourage your children to fast—when they are ready—is to help them understand the Lord’s purposes for this law. Consider reading together\nIsaiah 58:6–11\nto find answers to these questions: Why do we fast? How do we fast? You could also look in “\nFast, Fasting\n” in the Guide to the Scriptures.\nIf you have had a meaningful experience with fasting, share it with your children. You could also ask them how they would explain to a friend why the Lord gave us this law.\nIsaiah 58:13–14\nThe Sabbath can be a delight to me.\nAfter reading\nIsaiah 58:13–14\n, you could point to the days of the week on a calendar and invite your children to say the days with you. When you get to the Sabbath, ask them to call that day “a delight.” Tell them why the Sabbath is a delight to you.\nShare with each other ways you can “delight thyself in the Lord” on the Sabbath. Maybe your children could draw their ideas and put them in a “box of Sabbath delights.” Then, when they need ideas about things to do on the Sabbath, they could pull an idea from the box.\nOur Light\n, by Dan Wilson\nIsaiah 60:1–3\nThe Savior is like a light for me.\nYou could invite your children to close their eyes as you read\nIsaiah 60:1–3\n. Ask them to open their eyes when they hear the word “light” and close them again when they hear the word “darkness.” Explain that Jesus Christ and His gospel are like a light that helps us see our way back to Heavenly Father.\nIsaiah 65:17–25\nWhen Jesus comes again, He will bring peace and joy.\nIsaiah 65:17–25\ndescribes what the earth will be like when the Savior comes again. As you read these verses with your children, help them look for how life will be different in the “new earth” Isaiah described. Why will this be a time to be “glad and rejoice for ever”? (\nverse 18\n).\nYou could also sing together a song about the Second Coming, such as “\nWhen the Savior Comes Again\n” (Gospel Library). Share with each other what you are looking forward to about the Savior’s return. What can we do to prepare for that day?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 42: Lesson 126: Lesson 126—Isaiah 58:1–12This lesson can help students feel a desire to fast in the Lord’s way.; Lesson 127: Lesson 127—Isaiah 58:13–14This lesson can help students honor the Lord on the Sabbath day.... ---\n\n--- Lesson 126 ---\nThe Lord has asked us to fast. How do you feel about this commandment? The Jews felt like the Lord did not acknowledge their fasting. Through Isaiah, the Lord taught the people about proper fasting. This lesson can help students feel a desire to fast in the Lord’s way. Student preparation: Invite students to ponder how they feel about fasting and why. They might also ask a parent or trusted friend to share their thoughts and feelings. Possible Learning Activities Fasting To help prepare students to learn about fasting, consider doing the following. As you discuss this topic, try to create an atmosphere where students can share openly without pressure or judgment. Imagine that one Sunday morning, you are ready to eat breakfast when you remember that it is fast Sunday. What are the first thoughts that enter your mind? If needed, share the following explanation of fasting from the General Handbook: The Lord has established the law of the fast and fast offerings to bless His people and to provide a way for them to serve those in need. … Fasting may be done at any time. However, members usually observe the first Sabbath of the month as a fast day. A fast day typically includes the following: Praying Going without food and drink for a 24-hour period (if physically able) Giving a generous fast offering A fast offering is a donation to help those in need. When members fast, they are invited to give an offering that is at least equal to the value of the meals not eaten. Members are encouraged to be generous and give more than the value of these meals if they can. ( General Handbook: Serving in The Church of Jesus Christ of Latter-day Saints , 22.2.2., Gospel Library) Take a moment to ponder how you feel about fasting as you reflect on the following questions: How do you feel about fasting? Why? If you have fasted before, what have you learned about the Lord and fasting from your experience? What concerns or questions do you have about fasting? As you study today, seek the Lord’s guidance to help with any concerns you have and to feel a desire to fast. The Lord’s teachings about fasting The Lord directed Isaiah to boldly declare the sins of the house of Israel. For example, they outwardly performed religious practices, including fasting, with the wrong intent. Consider explaining or displaying any of the following information that might help students as they read the verses below: “Bulrush” ( verse 5 ) is a tall, thin grass that droops. “Sackcloth” ( verse 5 ) is coarse material that people wore anciently to symbolize their humility or sorrow. They also sprinkled ashes over themselves for the same reason. Read Isaiah 58:3–5 , looking for the answers to these two questions: What did the people ask the Lord about their fasting? What did the Lord tell the people they had done incorrectly regarding their fast? Invite students to share their answers and what stood out to them. If needed, point out that as Israel fasted, they sought their own pleasure ( verse 3 ), saw fasting as an affliction ( verses 3, 5 ), and treated others poorly ( verses 3–4 ). How might we make similar mistakes as we fast? Explain that the Lord intends for us to fast differently from these people. He intends that we fast with a humble attitude, purpose, and real intent (see Psalm 35:13 ; Joel 2:12 ; Jonah 3:4–10 ; Matthew 6:16–18 ; Alma 5:46 ; 6:6 ; 17:3, 9 ). Why do you think the Lord wants us to fast humbly, with a specific righteous purpose and real intent? Promises of the Lord Consider writing the following on the board: If we fast in the way the Lord intends, then… Read Isaiah 58:6–12 , looking for the purposes and blessings the Lord promises to those who fast as the Lord intends. You may want to mark them. Isaiah 58:6–7 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Ask students to complete the sentence based on their study. They may write their answers on the board. The following are some examples: He will loosen the hold of wickedness or sin upon us (see Isaiah 58:6 ). He will undo heavy burdens (see Isaiah 58:6 ). We will care for the poor and needy (see Isaiah 58:7 ). He will bless us with light and health (see Isaiah 58:8 ). He will answer our prayers (see Isaiah 58:9 ). The blessings of fasting To help students understand the blessings they identified, invite them to select one or two of the following situations: A young man is stressed out about his schoolwork and his future. A young woman feels like she can never be clean again because of her sins. A young man is praying to know if the Church is true but is struggling to receive an answer. A young woman wants to help the poor. A young man faces a challenge he doesn’t know if he can overcome. Find a phrase from Isaiah 58:6–12 that might motivate the person in the situation to fast and pray for God’s help. (Some situations may have more than one phrase that could apply.) In small groups or as a class, invite students to share the situations they selected and the phrases that could help and why. You might also invite them to share other situations in which the blessings the Lord promised in these verses may be helpful or ask if any of these blessings were especially meaningful to them and why. How might fasting for and receiving these blessings bring you closer to Heavenly Father and Jesus Christ? Examples of fasting and paying fast offerings To help students understand the example of the Savior, explain that He fasted and taught about fasting while also living the principle. He fasted before his earthly ministry (see Matthew 4:1–2 and note that the Joseph Smith Translation for Matthew 4:1 adjusts the phrase “to be tempted of the devil” to “to be with God”). He also taught that some evil influences only depart “by prayer and fasting” ( Matt. 17:19, 21 ). Consider showing the following modern-day example of fasting and ask students what they liked or learned from it: “ Fast Offerings: A Simple Commandment with a Marvelous Promise ” (3:01): President Henry B. Eyring tells of a woman’s experience with fast offerings in Sierra Leone during a war. 3:2 Invite students to ponder their own experiences with fasting, as well as the following questions, for a few moments: What blessings has the Lord given you or those you know because of fasting? How do you or could you make your fast more meaningful? Consider sharing your own experiences as well. Your feelings about fasting Consider any impressions you have received through the Holy Ghost during this lesson as you write in your study journal how you feel about fasting. You may choose to include blessings from the Lord you want in your life and why. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for “ Isaiah 58:6–7 ” is “the blessings of a proper fast.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 127 ---\nThe Savior taught that the Sabbath was given to bless His people (see Mark 2:27 ). What blessings have you seen by honoring Heavenly Father and Jesus Christ on the Sabbath day? In Isaiah, we learn that if we honor the Father and the Son on Their holy Sabbath, the day will be a blessing to us. This lesson can help students honor the Lord on the Sabbath day. Student preparation: Invite students to reflect on what they already know about worshipping Heavenly Father and Jesus Christ on the Sabbath. They could make a list of things they feel they are doing well to make the Sabbath day holy. Possible Learning Activities How do you feel on the Sabbath? Giving students time to ponder their feelings about gospel truths can invite the Holy Ghost to help them identify things they do well and areas they might need to improve. Take a moment to think about how you feel on Sunday. Invite the Holy Ghost to help you remember some things you do on Sunday that may contribute to your feelings about the Sabbath. Then, answer the following questions in your study journal. How would you describe your current feelings about the Sabbath? What are some things you currently try to do (or not do) on the Sabbath? Do you feel that what you usually do on Sunday is helping you feel closer to Heavenly Father and Jesus Christ? As you study Isaiah 58:13–14 today, invite the Holy Ghost to help you recognize the blessings Heavenly Father and Jesus Christ have promised as you worship Them on Their holy day. Honoring the Lord on His Sabbath Isaiah 58:13–14 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. During the seventh creative period, Heavenly Father and Jesus Christ rested from all Their labor. They blessed this day and established it as a time of sacred rest from earthly “work” (see Moses 3:3 ). Heavenly Father and Jesus Christ have invited all of us to follow this pattern (see Exodus 20:8–10 and Deuteronomy 5:12–14 ). Through His prophet Isaiah, the Lord again commanded His people to dedicate the Sabbath day to Him. Help students identify some of the invitations the Lord gives us regarding the Sabbath by writing the following incomplete statement on the board: We keep the Sabbath day holy by … When the Lord gave the Israelites the Ten Commandments, He commanded that the Sabbath be set apart as a holy day to worship Him. Read Isaiah 58:13 , marking words and phrases that stand out to you. What are some ways the Lord has asked us to make His Sabbath a holy day? Help students use their own words to explain phrases in verse 13 that complete the statement of truth. You might help them identify phrases like: not pursuing our interests or desires seeing the Sabbath as a day of joy (delight) honoring Heavenly Father and Jesus Christ each Sabbath day The following activity could be done individually by students. Select a phrase in verse 13 . Think carefully about what it might look like to apply this phrase in your life. You might want to record a few of your thoughts in your study journal. As you ponder, invite the Holy Ghost to help you have a greater understanding of things you can do. It may be helpful to explain that keeping the Sabbath day holy is filled with personal choices. Avoid discussing the right and wrong ways to keep the Sabbath day holy and encourage students to avoid judging others for their choices. Blessings for honoring the Lord on His day Read Isaiah 58:14 , marking words and phrases that help us understand some of the blessings the Lord has promised to those who honor Him on His Sabbath. How would you explain these blessings in your own words? To help students identify the blessings the Lord has promised, you might need to share the meaning of phrases such as: “ Then shalt thou delight in the Lord ” – We will have joy in the Lord. “ I will cause thee to ride upon the high places and feed thee with the heritage of Jacob ” – The Lord promises blessings to His covenant people. It might be helpful to share that “ high places ” may refer to mountains, hills, strongholds, or holy places. This phrase may mean that “the Lord will bless His covenant people to rise above all obstacles, be protected and out of the reach of danger, be victorious over enemies (see Deuteronomy 33:29 ), and be closer to the Lord.” (“ Line upon Line: Isaiah 58:13-14 ,” New Era , Feb. 2016) You could invite students to add to the board the blessings they found. If students need additional help understanding the principles of Sabbath worship, you could invite them to look for additional blessings, such as those found in Ezekiel 20:20 and Doctrine and Covenants 59:9–13 . Why might someone struggle to see that it is a “delight” to keep the Sabbath day? What obstacles might they be facing? President Russell M. Nelson shared the following about what helped him overcome an obstacle he faced when making decisions about how to honor Heavenly Father and Jesus Christ on Sundays. 14:47 The Savior identified Himself as Lord of the Sabbath. It is His day! Repeatedly, He has asked us to keep the Sabbath or to hallow the Sabbath day. We are under covenant to do so. How do we hallow the Sabbath day? In my much younger years, I studied the work of others who had compiled lists of things to do and things not to do on the Sabbath. It wasn’t until later that I learned from the scriptures that my conduct and my attitude on the Sabbath constituted a sign between me and my Heavenly Father. With that understanding, I no longer needed lists of dos and don’ts. When I had to make a decision whether or not an activity was appropriate for the Sabbath, I simply asked myself, “What sign do I want to give to God?” That question made my choices about the Sabbath day crystal clear. (“ The Sabbath Is a Delight ,” Ensign or Liahona , Apr. 2015, 130) How might Isaiah 58:13–14 and President Nelson’s message help someone who is struggling with the obstacles you identified? Students could share appropriate experiences when they have felt blessed by their efforts to focus on Heavenly Father and Jesus Christ on Sunday. The following questions could help students share their experiences. What have you found has improved your ability to honor the Lord on the Sabbath? What blessings have you seen from your efforts? What sign do you want to give to God? To help students make a plan to improve their Sabbath experience, display the following instructions. Take a moment to ponder what you have learned and felt today about the invitation in Isaiah 58:13–14 to set aside personal desires and honor Heavenly Father and Jesus Christ on the Sabbath. Invite the Holy Ghost to help you as you answer the following prompt in your study journal. To honor Heavenly Father and Jesus Christ on the Sabbath, I will . Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Isaiah 58:13–14 is, “Turn away … from doing thy pleasure on my holy day; and call the sabbath a delight.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 128 ---\nIn Isaiah 61 , Isaiah taught about Jesus Christ’s mission in Heavenly Father’s plan to heal, free, comfort, and save us. Some people may be unsure if Jesus Christ is providing that help and comfort in our lives at times. This lesson can help students increase their confidence in the Savior’s ability to heal, free, and comfort us. Student preparation: Invite students to consider the evidence they have seen in their lives or the lives of others that Jesus Christ heals, comforts, and lifts people today. Ask them to come prepared to share their thoughts. Possible Learning Activities Our need for the Messiah To help students recognize our need for Jesus Christ, consider beginning class by displaying the picture depicting the woman from the New Testament who had an issue of blood (see Mark 5:24–34 ). Ask students to share what they know about her situation. If necessary, explain that she had a health concern, an “issue of blood twelve years” ( Mark 5:25 ). She “had spent all that she had” seeking a cure from physicians, but her illness only got worse ( Mark 5:26 ). Under the law of Moses, someone with an issue of blood was considered unclean (see Leviticus 15:19–33 ), so this woman was likely excluded from society in some ways during those 12 years. Ask the following questions while displaying the picture. Open PDF What do you imagine she could have thought or felt? How might a teenager experience similar thoughts or feelings today? Students can invite personal revelation to their study by thinking about their lives and circumstances. One way to help them do this could be to display instructions like the following: Think about the challenges you or someone you know is facing right now and how the Savior’s help is needed. Isaiah prophesied how the Savior could help us and this woman. As you study Isaiah 61 today, seek guidance from the Spirit to help you see how Heavenly Father and Jesus Christ are at work in your life. The mission of the Messiah To prepare students to study Isaiah 61 , write at the top of the board the following phrase: Heavenly Father sent Jesus Christ to … In Isaiah 61 , Isaiah prophesied of the Savior and His mission. In these verses, Isaiah speaks messianically or as if the Savior is saying the words. Read Isaiah 61:1–3 , and finish the statement on the board: Heavenly Father sent Jesus Christ to … You might want to explain that anointed in verse 1 means that Jesus Christ was set apart or sent with a specific purpose. “Christ (a Greek word) and Messiah (a Hebrew word) mean ‘the anointed’” (“ Jesus Christ ,” Guide to the Scriptures). You might also explain that meek in the context of verse 1 could mean poor, afflicted, or humble. What did you find that helps you understand how the Savior can help someone today? You could either write on the board what students share or invite them to do so. As students share, they might finish the following statement: Heavenly Father sent Jesus Christ to … Preach the gospel to the poor, afflicted, and humble (see verse 1 ). Heal the brokenhearted (see verse 1 ). Free the captive (see verse 1 ). Comfort all who mourn (see verse 2 ). Give beauty and joy to those weighed down (see verse 3 ). Asking follow-up questions is an effective skill to help students analyze what they have just studied in the scriptures or what they have heard someone share. You might consider asking follow-up questions such as the following to help students consider the meaning of the text: “In what ways might someone be captive?” or “What do you think it means that he will give us ‘beauty for ashes’?” Recognizing how the Savior fulfills His mission You might want to share the following summary of Luke 4:16–21 with students. During His life on earth, Jesus Christ read from Isaiah 61 at the synagogue in his hometown of Nazareth. Through Isaiah’s words, Jesus Christ testified that He was the promised Messiah sent by Heavenly Father with a mission to heal, free, comfort, and save (see Luke 4:16–21 ). To help students begin to see how the Savior can fulfill His mission in their lives, you could invite students to study examples from the scriptures in groups. Pick one of the statements on the board. Study an example in the scriptures where the Savior fulfills His mission by helping someone with their unique challenge. You can use the scriptural example provided or find your own. You might also think of a modern example. Afflicted: Man, sick of the palsy ( Mark 2:1–12 ) Brokenhearted: The woman with an issue of blood ( Mark 5:24–34 ) Captive: Alma the Younger ( Alma 36:16–21 ) Mourning: Mary and Martha ( John 11:20–36 ) Weighed down: Alma and his people ( Mosiah 24:8–21 ) As you study, look for answers to the following questions: What does this account teach you about how Jesus Christ can fulfill His mission for you in your life? What does this account teach you about how you can invite His power into your life? As students study, be available to help answer any questions they might have. After they have finished studying, you could invite students to share what they learned that could help someone who is facing a difficult challenge. Asking questions that invite students to reflect on personal experiences, such as the following, can help them recognize Jesus Christ’s love, power, and mercy in their lives. (For additional training on giving invitations that help learners recognize the Lord’s love, power, and mercy in their experiences, see “ Help learners recognize the Lord’s love, power, and mercy in their lives ” in Teacher Development Skills .) If students would benefit from seeing a modern-day example before sharing their experiences, you could watch Darlyn’s experience in “ Feeling the Lord’s Love and Goodness in Trials ” (4:18). 4:17 In what ways have you seen Jesus Christ fulfill His mission in your life or in the life of someone you know? Sharing what you believe about Him Give students time to process how the things they have learned can affect their lives outside of class. The following activity connects to the challenge they thought about at the beginning of class. Write a message to the person you were thinking about today who is currently experiencing difficulty in their life (this person could be yourself). Seek the help of the Spirit to guide you as you write. In the letter, share truths or experiences you have heard and learned about the Savior today that you think could encourage or bring hope to this person. Consider ending with your testimony of Jesus Christ and His power.\n\n\n--- Lesson 129 ---\nWith the world in turmoil, we all long for moments of peace. The Savior Jesus Christ will return to the earth and reign for a thousand years, ushering in a time of peace. Isaiah prophesied of this period, which is called the Millennium. This lesson can help students feel an increased excitement for the Savior’s Second Coming and millennial reign. Student preparation: Invite students to consider what they know about the Savior’s Second Coming and Millennium reign. Invite them to ponder if they look forward to it and why. They might ask a parent or trusted adult how they feel about the Savior’s return. Possible Learning Activities The Millennium To help students understand why the return of the Savior will be such a blessing in our lives, consider beginning by asking the following question: What are some problems in the world that you wish would change? You could write some of the following phrases on the board to help students think of answers: Reasons people weep or hurt Examples of violence, unfairness, or destruction The influence of Satan Take a moment to ponder any problems in your life or in the lives of those you love that you wish would change. As you study today, seek the guidance of the Holy Ghost as you look for truths that may help us and the world. The final chapters of Isaiah Show a picture of the Savior’s Second Coming and explain that the scriptures teach that in the future, the Savior will return to the earth and reign for a thousand years. This period is called the Millennium. Open PDF The final chapters in the book of Isaiah contain Isaiah’s teachings and prophecies about the Savior’s Second Coming and the Millennium. Read the following verses, marking phrases that help you feel excited for the Savior’s return: Isaiah 60:18–20 Isaiah 62:11–12 Isaiah 65:17–25 Invite students to share some of the phrases they found and why they look forward to the Savior providing this blessing. Students may share phrases that show that the Savior will overcome the world’s problems. Some examples are: “Violence shall no more be heard in thy land” ( Isaiah 60:18 ) “The days of thy mourning shall be ended” ( Isaiah 60:20 ) “The voice of weeping shall be no more heard” ( Isaiah 65:19 ) “They shall not hurt nor destroy” ( Isaiah 65:25 ) Encouraging students to mark phrases in the scriptures their classmates share may also be effective. How would you summarize what the Savior will do for His people when He returns? Students may share various truths. One may be similar to the following: Because of the Savior, His people will enjoy happiness, peace, and prosperity during the Millennium . Consider writing this principle, or one like it, on the board using students’ words. Deepening understanding Refer to the picture of the Savior’s Second Coming. Invite students to remember what they know and feel about Jesus Christ. Why do you think having Jesus Christ on the earth will lead to happiness, peace, and joy? Take a moment to ponder any questions you have about the Millennium and the blessings of the Savior’s return. The Lord has revealed more on the subject. Consider displaying the following questions. Select one or two of your own questions about the Millennium or the following questions you are most interested in. Spend several minutes looking for answers in the scriptures and divinely appointed sources. The section titled “Millennium” in Guide to the Scriptures and Topics and Questions on ChurchofJesusChrist.org may be useful. What does it mean that the Lord will “create new heavens and a new earth?” ( Isaiah 65:17 ). Read Doctrine and Covenants 88:25–26 and Articles of Faith 1:10 . Think of what these verses teach about the Savior’s power and His feelings for the righteous. Will there be death during the Millennium? What does it mean that because of the Savior a child “shall die an hundred years old?” ( Isaiah 65:20 ). Read Doctrine and Covenants 101:29–31 and ponder what these verses teach you about the Savior’s power. What will happen to Satan because of the Savior’s return? Read some of the following verses: Doctrine and Covenants 45:55 , 101:28 , 1 Nephi 22:26 , and Revelation 20:1–3 . Think of what these verses teach you about the Lord. What roles will the Savior have during the Millennium? What will he do? Read Doctrine and Covenants 29:11 and 45:59 and Articles of Faith 1:10 . What else has the Lord revealed about the Millennium? Read some of the following: Doctrine and Covenants 45:54, 56–58 ; 101:26–29 ; and “ Millennium ” in Topics and Questions on ChurchofJesusChrist.org . Invite students to share what they learned. Consider asking how what they learned helps increase their excitement for the Savior’s return and the Millennium. If students ask what it means that Satan will be “loosed a little season” ( Revelation 20:3 ) at the end of the Millennium, invite them to read Doctrine and Covenants 88:111–115 . Visualizing what you learned Visualizing what you are learning can be effective at times. Close your eyes and visualize what you have learned about the Savior and when He reigns on the earth during the Millennium. Pray for the help of the Holy Ghost to make this activity meaningful for you. Picture the Savior returning and how He may bless you, your loved ones, and all mankind. You might read the following statement from Elder Andersen, inviting students to visualize what they hear. Elder Neil L. Andersen of the Quorum of the Twelve Apostles testified: The thought of His coming stirs my soul. It will be breathtaking! The scope and grandeur, the vastness and magnificence, will exceed anything mortal eyes have ever seen or experienced. … He will appear “in the clouds of heaven, clothed with power and great glory; with all the holy angels” ( Doctrine and Covenants 45:44 ). … We will kneel in reverence, “and the Lord shall utter his voice, and all the ends of the earth shall hear it” ( Doctrine and Covenants 45:49 ) … There will be unforgettable reunions with the angels of heaven and the Saints upon the earth (see Moses 7:63 ). But most important, as Isaiah declares, “All the ends of the earth shall see the salvation of our God,” ( Isaiah 52:10 ) and He “shall reign over all flesh” ( Doctrine and Covenants 133:25 ). (“ Thy Kingdom Come ,” Ensign or Liahona , May 2015, 122) Ask students to write in their study journals what they learned about the Savior today and how they feel about His return. Invite volunteers to share their thoughts and feelings. Consider sharing your thoughts and feelings as well.\n\n--- SCRIPTURE: Isaiah 58 ---\n1. Cry aloud,sparenot, lift up thyvoicelike atrumpet, andshewmy people theirtransgression, and the house of Jacob their sins.\n2. Yetthey seek me daily, and delight to know my ways, as nation that did righteousness, and forsook not the ordinance of their God: they ask of me theordinancesof justice; they take delight in approaching to God.\n3. Whereforehave we fasted,say they,and thou seest not?whereforehave we afflicted our soul, and thou takest no knowledge? Behold, in the day of yourfastye findpleasure, andexact all your labours.\n4. Behold, ye fast forstrifeanddebate, and to smite with the fist of wickedness: ye shall notfastasye do thisday, to make your voice to be heard on high.\n5. Is it such fast that I have chosen? day for man to afflict his soul?is itto bow down his head as bulrush, and to spread sackcloth and ashesunder him?wilt thou call this fast, and an acceptable day to theLord?\n6. Isnot this the fast that I have chosen? to loose thebandsof wickedness, to undo the heavy burdens, and to let the oppressed gofree, and that ye break every yoke?\n7. Is itnot to deal thy bread to thehungry, and that thou bring thepoorthat are cast out to thy house? when thou seest the naked, that thou cover him; and that thou hide not thyself fromthine own flesh?\n8. Then shall thylightbreak forth as the morning, and thinehealthshall spring forth speedily: and thy righteousness shall go before thee; the glory of theLordshall be thyrearward.\n9. Then shalt thoucall, and theLordshall answer; thou shalt cry, and he shall say, Here Iam.If thou take away from the midst of thee the yoke, theputtingforth of the finger, and speaking vanity;\n10. Andifthou draw out thy soul to thehungry, and satisfy the afflicted soul; then shall thy lightrise in obscurity, and thy darknessbeas the noonday:\n11. And theLordshallguidethee continually, and satisfy thy soul indrought, andmake fatthy bones: and thou shalt be like watered garden, and like aspringof water, whose waters fail not.\n12. Andthey that shall beof thee shall build the old waste places: thou shalt raise up the foundations of many generations; and thou shalt be called, The repairer of the breach, The restorer of paths to dwell in.\n13. If thou turn away thy foot from the sabbath,fromdoing thy pleasure on my holy day; and call thesabbatha delight, the holy of theLord, honourable; and shalt honour him, not doing thine own ways, nor finding thine own pleasure, nor speakingthine ownwords:\n14. Then shalt thou delight thyself in theLord; and I will cause thee to ride upon thehigh placesof the earth, and feed thee with the heritage of Jacob thy father: for the mouth of theLordhath spokenit.\n\n--- SCRIPTURE: Isaiah 59 ---\n1. Behold, theLordshandis notshortened, that it cannot save; neither his ear heavy, that it cannothear:\n2. But your iniquities haveseparatedbetween you and your God, and yoursinshave hidhisface from you, that he will nothear.\n3. For your hands are defiled withblood, and your fingers with iniquity; your lips have spoken lies, your tongue hath muttered perverseness.\n4. None calleth for justice, noranypleadeth for truth: theytrustin vanity, and speak lies; they conceivemischief, and bring forth iniquity.\n5. They hatch cockatrice eggs, and weave the spiders web: he that eateth of their eggs dieth, and that which is crushed breaketh out into viper.\n6. Their webs shall not become garments, neither shall they cover themselves with their works: their worksareworks of iniquity, and the act of violenceisin their hands.\n7. Their feetruntoevil, and they makehastetoshedinnocent blood: their thoughtsarethoughts of iniquity; wasting and destructionarein their paths.\n8. The way ofpeacethey know not; andthere isnojudgmentin their goings: they have made themcrookedpaths: whosoever goeth therein shall not know peace.\n9. Therefore is judgment far from us, neither dothjusticeovertake us: we wait forlight, but behold obscurity; for brightness,butwewalkin darkness.\n10. Wegropefor the wall like the blind, and we grope as ifwe hadno eyes: we stumble at noonday as in the night;we arein desolate places as deadmen.\n11. We roar all like bears, and mourn sore like doves: we look for judgment, butthere isnone; for salvation,butit is far off from us.\n12. For our transgressions are multiplied before thee, and our sinstestifyagainst us: for our transgressionsarewith us; andas forour iniquities, weknowthem;\n13. In transgressing and lying against theLord, and departing away from our God, speaking oppression and revolt, conceiving and uttering from the heart words of falsehood.\n14. And judgment is turned away backward, and justice standeth afar off: for truth is fallen in the street, andequitycannot enter.\n15. Yea, truth faileth; and hethatdeparteth from evil maketh himself prey: and theLordsawit,and it displeased him thatthere wasno judgment.\n16. And he saw thatthere wasno man, and wondered thatthere wasnointercessor: therefore hisarmbroughtsalvationunto him; and his righteousness, it sustained him.\n17. For he put onrighteousnessas abreastplate, and an helmet of salvation upon his head; and he put on the garments of vengeanceforclothing, and was clad with zeal as cloak.\n18. According totheirdeeds, accordingly he willrepay, fury to his adversaries,recompenceto his enemies; to the islands he will repay recompence.\n19. So shall theyfearthenameof theLordfrom the west, and his glory from the rising of the sun. When the enemy shall come in like flood, theSpiritof theLordshall lift up standard against him.\n20. And theRedeemershallcometoZion, and unto them thatturnfrom transgression in Jacob, saith theLord.\n21. As for me, thisismycovenantwith them, saith theLord; My spirit thatisupon thee, and my words which I have put in thy mouth, shall not depart out of thy mouth, nor out of the mouth of thy seed, nor out of the mouth of thy seeds seed, saith theLord, from henceforth and for ever.\n\n--- SCRIPTURE: Isaiah 60 ---\n1. Arise, shine; for thylightis come, and the glory of theLordis risen upon thee.\n2. For, behold, thedarknessshall cover the earth, and grossdarknessthe people: but theLordshallarise upon thee, and hisgloryshall be seen upon thee.\n3. And theGentilesshall come to thylight, and kings to the brightness of thy rising.\n4. Lift up thine eyes round about, and see: all they gather themselves together, they come to thee: thysonsshall come from far, and thy daughters shall be nursed atthyside.\n5. Then thou shalt see, andflow together, and thine heart shall fear, and be enlarged; because theabundanceof the sea shall be converted unto thee, theforcesof theGentilesshall come unto thee.\n6. The multitude of camels shall cover thee, the dromedaries of Midian and Ephah; all they from Sheba shall come: they shall bringgoldand incense; and they shall shew forth the praises of theLord.\n7. All the flocks ofKedarshall be gathered together unto thee, the rams of Nebaioth shall minister unto thee: they shall come up withacceptanceon minealtar, and I will glorify the house of myglory.\n8. Whoarethesethatfly as cloud, and as the doves to their windows?\n9. Surely theislesshall wait forme, and the ships of Tarshish first, tobringthy sons from far, their silver and their gold with them, unto the name of theLordthy God, and to the Holy One of Israel, because he hath glorified thee.\n10. And thesonsof strangers shallbuildup thy walls, and their kings shall minister unto thee: for in mywrathI smote thee, but in my favour have I had mercy on thee.\n11. Therefore thygatesshall be open continually; they shall not be shut day nor night; thatmenmay bring unto thee theforces of the Gentiles, andthattheir kingsmay bebrought.\n12. For thenationandkingdomthat will not serve thee shallperish; yea,thosenationsshall be utterly wasted.\n13. The glory ofLebanonshall come unto thee, thefirtree, the pine tree, and the box together, tobeautifythe place of my sanctuary; and I will make the place of myfeetglorious.\n14. The sons also of them that afflicted thee shall come bending unto thee; and all they that despised thee shallbowthemselves down at the soles of thy feet; and they shall call thee, The city of theLord, The Zion of the Holy One of Israel.\n15. Whereas thou hast beenforsakenand hated, so that no man went throughthee,I will make thee an eternal excellency, joy of many generations.\n16. Thou shalt also suck themilkof the Gentiles, and shalt suck the breast ofkings: and thou shalt know that I theLordamthySaviourand thy Redeemer, the mighty One of Jacob.\n17. For brass I will bring gold, and for iron I will bring silver, and for wood brass, and for stones iron: I will also make thy officers peace, and thine exactors righteousness.\n18. Violenceshall no more be heard in thy land, wasting nor destruction within thy borders; but thou shalt call thywallsSalvation, and thy gatesPraise.\n19. Thesunshall be no more thy light by day; neither for brightness shall the moon give light unto thee: but theLordshall be unto thee an everlastinglight, and thy God thy glory.\n20. Thy sun shall no more go down; neither shall thy moon withdraw itself: for theLordshall be thineeverlastinglight, and the days of thymourningshall be ended.\n21. Thy people alsoshall beallrighteous: they shall inherit thelandforever, thebranchof my planting, theworkof my hands, that I may be glorified.\n22. Alittle oneshall become thousand, and small one astrongnation: I theLordwill hasten it inhistime.\n\n--- SCRIPTURE: Isaiah 61 ---\n1. TheSpiritof the LordGodisupon me; because theLordhathanointedme topreachgood tidingsunto themeek; he hath sent me tobindup the brokenhearted, toproclaimlibertyto thecaptives, and the opening of theprisontothem that arebound;\n2. To proclaim the acceptable year of theLord, and the day ofvengeanceof our God; tocomfortall thatmourn;\n3. To appoint unto them that mourn in Zion, to give unto thembeautyfor ashes, the oil ofjoyfor mourning, the garment of praise for the spirit of heaviness; that they might be calledtreesofrighteousness, theplantingof theLord, that he might be glorified.\n4. And they shallbuildthe old wastes, they shall raise up the former desolations, and they shall repair the waste cities, the desolations of many generations.\n5. And strangers shall stand and feed your flocks, and the sons of the alienshall beyour plowmen and your vinedressers.\n6. But ye shall be named thePriestsof theLord:menshall call you the Ministers of our God: ye shall eat therichesof the Gentiles, and in their glory shall ye boast yourselves.\n7. For your shameye shall havedouble; andforconfusion they shall rejoice in their portion: therefore in their land they shall possessthe double: everlasting joy shall be unto them.\n8. For I theLordlovejudgment, I hate robbery for burnt offering; and I will direct their work in truth, and I will make an everlastingcovenantwith them.\n9. And their seed shall be known among the Gentiles, and their offspring among the people: all that see them shall acknowledge them, that theyaretheseedwhichtheLordhath blessed.\n10. I will greatly rejoice in theLord, my soul shall be joyful in my God; for he hathclothedme with thegarmentsof salvation, he hath covered me with the robe of righteousness, as bridegroom deckethhimselfwith ornaments, and as bride adornethherselfwith her jewels.\n11. For as the earth bringeth forth her bud, and as the garden causeth the things that are sown in it to spring forth; so the LordGodwill cause righteousness andpraiseto spring forth before all the nations.\n\n--- SCRIPTURE: Isaiah 62 ---\n1. For Zions sake will I not hold my peace, and for Jerusalems sake I will not rest, until the righteousness thereof go forth as brightness, andthe salvation thereof as lampthatburneth.\n2. And the Gentiles shallseethy righteousness, and all kings thy glory: and thou shalt be called by newname, which the mouth of theLordshall name.\n3. Thou shalt also be acrownof glory in the hand of theLord, and royal diadem in the hand of thy God.\n4. Thou shalt no more be termedForsaken; neither shall thylandany more be termed Desolate: but thou shalt be calledHephzi-bah, and thy landBeulah: for theLorddelighteth in thee, and thy land shall be married.\n5. Forasa young man marrieth virgin,soshall thy sons marry thee: andasthe bridegroom rejoiceth over the bride,soshall thy Godrejoiceover thee.\n6. I have setwatchmenupon thy walls, O Jerusalem,whichshall never hold their peace day nor night: ye that make mention of theLord, keep not silence,\n7. And give him no rest, till he establish, and till he make Jerusalem apraisein the earth.\n8. TheLordhath sworn by his right hand, and by the arm of his strength, Surely I will no more give thy cornto bemeat for thine enemies; and the sons of the stranger shall not drink thy wine, for the which thou hast laboured:\n9. But they that have gathered it shall eat it, and praise theLord; and they that have brought it together shall drink it in the courts of myholiness.\n10. Go through, go through the gates;prepareye the way of the people; cast up, cast up thehighway; gather out the stones; lift up astandardfor the people.\n11. Behold, theLordhath proclaimed unto the end of theworld, Say ye to thedaughterof Zion, Behold, thysalvationcometh; behold, hisrewardiswith him, and his work before him.\n12. And they shall call them, The holy people, The redeemed of theLord: and thou shalt be called, Sought out, A city not forsaken.\n\n--- SCRIPTURE: Isaiah 63 ---\n1. Whoisthis thatcomethfromEdom, with dyed garments from Bozrah? thisthat isglorious in his apparel, travelling in the greatness of his strength? I that speak in righteousness, mighty to save.\n2. Whereforeart thouredin thine apparel, and thy garments like him that treadeth in thewinefat?\n3. I have trodden thewinepressalone; and of the peoplethere wasnone with me: for I will tread them in mine anger, and trample them in my fury; and their blood shall besprinkledupon my garments, and I will stain all my raiment.\n4. For the day ofvengeanceisin mine heart, and the year of myredeemedis come.\n5. And I looked, andthere wasnone to help; and I wondered thatthere wasnone to uphold: therefore mine own arm broughtsalvationunto me; and my fury, it upheld me.\n6. And I will tread down the people in mine anger, andmake them drunkin my fury, and I will bring down their strength to the earth.\n7. I will mention thelovingkindnessesof theLord,andthe praises of theLord, according to all that theLordhath bestowed on us, and the greatgoodnesstoward the house of Israel, which he hath bestowed on them according to his mercies, and according to the multitude of his lovingkindnesses.\n8. For he said, Surely theyaremy people, childrenthatwill not lie: so he was theirSaviour.\n9. In all theirafflictionhe was afflicted, and theangelof hispresencesaved them: in hisloveand in his pity heredeemedthem; and he bare them, andcarriedthem all the days of old.\n10. But theyrebelled, andvexedhisholy Spirit: therefore he was turned to be theirenemy,andhe fought against them.\n11. Thenhe rememberedthe days of old, Moses,andhis people,saying,Whereishe that brought them up out of theseawith theshepherdof hisflock? whereishe that put his holy Spirit withinhim?\n12. That ledthemby the right hand ofMoseswith his glorious arm,dividingthe water before them, to make himself an everlasting name?\n13. That led them through the deep, as an horse in the wilderness,thatthey should not stumble?\n14. As beast goethdown into the valley, theSpiritof theLordcausedhimto rest: so didst thou lead thy people, to make thyself gloriousname.\n15. Lookdown from heaven, and behold from the habitation of thyholinessand of thy glory: whereisthy zeal and thy strength,thesounding of thy bowels and of thy mercies toward me? are they restrained?\n16. Doubtless thouartourfather, though Abrahambe ignorantof us, and Israel acknowledge us not: thou, OLord,artour father, our redeemer; thy nameisfromeverlasting.\n17. OLord, why hast thoumadeus to err from thy ways,andhardenedour heart from thy fear? Return for thy servants sake, the tribes of thine inheritance.\n18. Thepeopleof thy holiness have possesseditbut little while: our adversaries havetroddendown thy sanctuary.\n19. We arethine:thou never barest rule over them; they were not called by thyname.\n\n--- SCRIPTURE: Isaiah 64 ---\n1. Oh that thou wouldestrendthe heavens, that thou wouldest come down, that themountainsmight flow down at thypresence,\n2. Aswhenthe melting fire burneth, the fire causeth the waters to boil, to make thy name known to thine adversaries,thatthe nations maytrembleat thy presence!\n3. When thou didstterriblethingswhichwe looked not for, thou camest down, themountainsflowed down at thy presence.\n4. For since the beginning of the worldmenhave not heard, nor perceived by the ear, neither hath theeyeseen, O God, beside thee,whathe hathpreparedfor him that waiteth for him.\n5. Thou meetest him that rejoiceth and worketh righteousness,those thatremember thee in thy ways: behold, thou art wroth; for we have sinned: in those is continuance, and we shall be saved.\n6. But we are all as anuncleanthing,and all our righteousnessesareasfilthyrags; and we all do fade as leaf; and our iniquities, like the wind, have taken us away.\n7. Andthere isnone that calleth upon thy name, that stirreth up himself to take hold of thee: for thou hast hid thyfacefrom us, and hast consumed us, because of our iniquities.\n8. But now, OLord, thouartourfather; wearethe clay, and thou our potter; and we allaretheworkof thy hand.\n9. Be not wroth very sore, OLord, neither remember iniquity for ever: behold, see, we beseech thee, weareall thypeople.\n10. Thy holy cities are wilderness, Zion is wilderness, Jerusalem desolation.\n11. Our holy and ourbeautifulhouse, where our fathers praised thee, isburnedup with fire: and all our pleasant things are laidwaste.\n12. Wilt thourefrainthyself for thesethings,OLord? wilt thou hold thy peace, and afflict us very sore?\n\n--- SCRIPTURE: Isaiah 65 ---\n1. I amsoughtofthem thatasked notfor me;I am found ofthem thatsought me not: I said, Behold me, behold me, unto nationthatwas not called by myname.\n2. I have spread out my hands all the day unto arebelliouspeople, which walketh in waythat wasnot good, after their own thoughts;\n3. A people that provoketh me toangercontinually to my face; that sacrificeth in gardens, and burneth incense upon altars ofbrick;\n4. Which remainamong the graves, and lodge in the monuments, which eat swines flesh, and broth of abominablethings is intheir vessels;\n5. Which say, Stand by thyself, come not near to me; for I amholierthan thou. Thesearea smoke in my nose, fire that burneth all the day.\n6. Behold,it iswritten before me: I will not keep silence, but willrecompense, even recompense into their bosom,\n7. Your iniquities, and the iniquities of your fathers together, saith theLord, which have burned incense upon the mountains, andblasphemedme upon the hills: therefore will I measure their former work into their bosom.\n8. Thus saith theLord, As thenew wineis found in the cluster, andonesaith, Destroy it not; for blessingisin it: so will I do for my servants sakes, that I maynotdestroy them all.\n9. And I will bring forth seed out of Jacob, and out ofJudahan inheritor of my mountains: and mineelectshallinheritit, and my servants shall dwell there.\n10. And Sharon shall be fold of flocks, and the valley ofAchora place for the herds to lie down in, for my people that have sought me.\n11. But yearethey that forsake theLord, that forget my holy mountain, that prepare table for thattroop, and that furnish the drink offering unto thatnumber.\n12. Therefore will I number you to the sword, and ye shall all bow down to the slaughter: because when Icalled, ye did not answer; when I spake, ye did not hear; but did evil before mine eyes, and did choosethatwherein I delighted not.\n13. Therefore thus saith the LordGod, Behold, my servants shall eat, but ye shall be hungry: behold, my servants shall drink, but ye shall be thirsty: behold, my servants shall rejoice, but ye shall be ashamed:\n14. Behold, my servants shall sing for joy of heart, but ye shall cry for sorrow of heart, and shallhowlfor vexation of spirit.\n15. And ye shall leave your name for acurseunto my chosen: for the LordGodshall slay thee, and call his servants by anothername:\n16. That he whoblesseth himselfin the earth shall bless himself in the God of truth; and he that sweareth in the earth shallswearby the God of truth; because the former troubles are forgotten, and because they are hid from mine eyes.\n17. For, behold, Icreatenewheavensand anewearth: and theformershall not be remembered, nor come into mind.\n18. But be ye glad and rejoice for everin thatwhich I create: for, behold, I create Jerusalem arejoicing, and her people joy.\n19. And I willrejoicein Jerusalem, and joy in my people: and the voice of weeping shall be no more heard in her, nor the voice of crying.\n20. There shall be no more thence an infant of days, nor anoldman that hath not filled his days: for thechildshall die an hundred years old; but the sinnerbeingan hundred years old shall be accursed.\n21. And they shall build houses, and inhabitthem;and they shall plant vineyards, andeatthe fruit of them.\n22. They shall not build, and another inhabit; they shall not plant, and another eat: for as the days of atreearethe days of my people, and mine elect shall long enjoy the work of their hands.\n23. They shall notlabourin vain,nor bring forth for trouble; for theyaretheseedof the blessed of theLord, and theiroffspringwith them.\n24. And it shall come to pass, that before they call, I willanswer; and while they are yet speaking, I will hear.\n25. Thewolfand the lamb shallfeedtogether, and the lion shall eat straw like the bullock: and dustshall bethe serpents meat. They shall nothurtnor destroy in all my holy mountain, saith theLord.\n\n--- SCRIPTURE: Isaiah 66 ---\n1. Thus saith theLord, The heavenismythrone, and the earthismy footstool: whereisthe house that ye build unto me? and whereisthe place of my rest?\n2. For all thosethingshath mine hand made, and all thosethingshave been, saith theLord: but to thismanwill I look,eventohim that ispoor and of acontrite spirit, and trembleth at my word.\n3. Hethat killeth an oxis as ifhe slew man; he that sacrificeth lamb,as ifhe cut off dogs neck; he that offereth an oblation,as if he offeredswines blood; he that burneth incense,as ifhe blessed an idol. Yea, they have chosen their own ways, and their soul delighteth in their abominations.\n4. Ialso will choose their delusions, and will bring their fears upon them; because when Icalled, none did answer; when I spake, they did not hear: but they did evil before mine eyes, and chosethatin which I delighted not.\n5. Hear the word of theLord, ye that tremble at his word; Your brethren that hated you, thatcastyou out for my names sake, said, Let theLordbeglorified: but he shall appear to your joy, and they shall be ashamed.\n6. A voice of noise from the city, voice from the temple, voice of theLordthat rendereth recompence to his enemies.\n7. Beforeshetravailed, she brought forth; before her pain came, she was delivered of manchild.\n8. Who hath heard such thing? who hath seen such things? Shall the earth be made to bring forth in one day?orshall nation be born at once? for as soon as Zion travailed, she brought forth her children.\n9. Shall I bring to the birth, and not cause to bring forth? saith theLord: shall I cause to bring forth, and shutthe womb?saith thy God.\n10. Rejoice ye with Jerusalem, and be glad with her, all ye that love her: rejoice for joy with her, all ye that mourn for her:\n11. That ye may suck, and be satisfied with the breasts of her consolations; that ye may milk out, and be delighted with the abundance of her glory.\n12. For thus saith theLord, Behold, I will extend peace to herlike river, and the glory of theGentileslike flowing stream: then shall ye suck, ye shall be borne uponhersides, and be dandled uponherknees.\n13. As one whom hismothercomforteth, so will Icomfortyou; and ye shall becomfortedin Jerusalem.\n14. And when ye seethis,your heart shall rejoice, and your bones shall flourish like an herb: and thehandof theLordshall be known toward his servants, andhisindignationtoward his enemies.\n15. For, behold, theLordwill come withfire, and with hischariotslike whirlwind, to render his anger with fury, and his rebuke with flames of fire.\n16. For by fire and by hisswordwilltheLordpleadwith all flesh: and theslainof theLordshall be many.\n17. They that sanctify themselves, and purify themselves in the gardens behind onetreein the midst, eating swines flesh, and theabomination, and themouse, shall be consumed together, saith theLord.\n18. For Iknowtheirworksand their thoughts: it shall come, that I will gatherallnations and tongues; and they shall come, and see my glory.\n19. And I will set asignamong them, and I will send those that escape of them unto the nations,toTarshish, Pul, andLud, that draw the bow,toTubal, and Javan,tothe isles afar off, that have not heard my fame, neither have seen my glory; and they shalldeclaremy glory among theGentiles.\n20. And they shall bring all your brethrenforanofferingunto theLordout of all nations upon horses, and in chariots, and in litters, and upon mules, and upon swift beasts, to my holy mountain Jerusalem, saith theLord, as the children of Israel bring an offering in clean vessel into the house of theLord.\n21. And I will also take of them forpriestsandfor Levites, saith theLord.\n22. For as thenewheavens and the new earth, which I will make, shall remain before me, saith theLord, so shall yourseedand your name remain.\n23. And it shall come to pass,thatfrom one new moon to another, and from one sabbath to another, shall all flesh come toworshipbefore me, saith theLord.\n24. And they shall go forth, and look upon the carcases of the men that have transgressed against me: for theirwormshall not die, neither shall theirfirebe quenched; and they shall be an abhorring unto all flesh.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": "",
      "content": "Early in His ministry, Jesus Christ visited a synagogue in Nazareth, where He was raised. He stood there to read from the scriptures, opened the book of Isaiah, and read what we now know as\nIsaiah 61:1–2\n. He then announced, “This day is this scripture fulfilled in your ears.” This was one of the Savior’s most straightforward declarations that He was the Anointed One, who would “heal the brokenhearted” and “preach deliverance to the captives” (see\nLuke 4:16–21\n). This scripture was indeed fulfilled on that day. And, like many other prophecies of Isaiah, it is also being fulfilled in our day. The Savior continues to heal the brokenhearted who come unto Him. There are still many captives who need deliverance. And there is a glorious future to prepare for—a time when the Lord will “create new heavens and a new earth” (\nIsaiah 65:17\n) and “cause righteousness and praise to spring forth before all the nations” (\nIsaiah 61:11\n). Reading Isaiah opens our eyes to what the Lord has already done, what He is doing, and what He will yet do for His people.\nIdeas for Learning at Home and at Church\nIsaiah 58:3–12\nFasting builds spiritual power and blesses people in need.\nWhy would anyone voluntarily go without food when food is available? As you study\nIsaiah 58:3–12\n, you might think about your reasons for fasting—as well as the Lord’s reasons for giving this law. Here are some other questions to ponder:\nWhy can fasting sometimes be perceived like more of a burden than a blessing? (see\nIsaiah 58:3–5\n). How do the Lord’s teachings in this chapter change that perception for you?\nWhat might it mean to “loose the bands of wickedness” and “break every yoke”? (\nIsaiah 58:6\n). How can fasting bless others? (see\nverse 7\n).\nHow has fasting brought you the blessings described in\nIsaiah 58:8–12\n?\nIn his message “\nIs Not This the Fast That I Have Chosen?\n” (\nEnsign\nor\nLiahona\n, May 2015, 22–25), President Henry B. Eyring shared several examples of how people have been blessed by fasting and fast offerings. How have you witnessed similar blessings in your life?\nSee also “\nBless Our Fast, We Pray\n,”\nHymns\n, no. 138; Topics and Questions, “\nFasting and Fast Offerings,\n” Gospel Library.\nGet to know the people you teach.\n“Being a Christlike teacher includes getting to know the people you teach and striving to understand what is in their hearts. … You can find out how they learn best. You can ask questions, listen carefully, and observe. Above all, you can pray for the understanding that only the Spirit can give. The better you know a person, the better able you are to help him or her find personal meaning and power in the gospel of Jesus Christ. Once you understand a person’s thirst, the Spirit can teach you how to help quench it with the Savior’s living water” (\nTeaching in the Savior’s Way\n,\n13\n).\nIsaiah 58:13–14\nHonoring the Lord on the Sabbath brings joy.\nIs the Sabbath day “a delight” for you? As you study\nIsaiah 58:13–14\n, consider how you could find more delight in the Lord’s day. For example, what might it mean to turn “from doing thy pleasure on [His] holy day”? What is the difference between “[delighting] thyself in the Lord” and “doing thine own ways”?\nSee also Russell M. Nelson, “\nThe Sabbath Is a Delight\n,”\nEnsign\nor\nLiahona\n, May 2015, 129–32.\nIsaiah 59:9–21\n;\n61:1–3\n;\n63:7–9\nJesus Christ is my Savior and Redeemer.\nIsaiah 58–66\nhas multiple references to the atoning mission of Jesus Christ. Look for them as you study. In particular, note the titles and words used to describe the Savior. For example:\nWhat impresses you about the description of the “intercessor” in\nIsaiah 59:16–21\n? How does the Savior overcome the conditions described in\nverses 9–15\n?\nWhen Jesus Christ announced to the people of Nazareth that He was the Messiah, He quoted from\nIsaiah 61:1–3\n(see\nLuke 4:16–21\n; see also the video “Jesus Declares He Is the Messiah,” Gospel Library). How has Jesus Christ blessed you and others in the ways described in these verses? How has He given beauty in place of ashes?\n3:24\nJesus Declares He Is the Messiah\nWhat “lovingkindnesses of the Lord” can you “mention”? (see\nIsaiah 63:7–9\n).\nWhat other references to the Savior do you find in\nIsaiah 58–66\n?\nSee also\nMosiah 3:7\n;\nDoctrine and Covenants 133:46–53\n.\nA Gift of Light\n, by Eva Timothy\nIsaiah 60\n;\n62\n“The Lord shall be unto thee an everlasting light.”\nIsaiah 60\nand\n62\nspeak of light and dark, eyes and seeing to teach about how the gospel of Jesus Christ will bless the world in the last days. Look for these concepts in\nIsaiah 60:1–5, 19–20\n;\n62:1–2\n. As you read these chapters, ponder how God is gathering His children out of darkness to His light. What is your role in this work?\nSee also\n1 Nephi 22:3–12\n;\n3 Nephi 18:24\n;\nDoctrine and Covenants 14:9\n; Bonnie H. Cordon, “\nThat They May See\n,”\nEnsign\nor\nLiahona\n, May 2020, 78–80.\nIsaiah 64:1–5\n;\n65:17–25\n;\n66\nChrist will reign on earth during the Millennium.\nIsaiah spoke of a day when “the former troubles are forgotten” (\nIsaiah 65:16\n). While this prophecy has several fulfillments, in its fullest sense, that day is yet to come—when Jesus Christ will return. Isaiah described this future day in\nIsaiah 64:1–5\n;\n65:17–25\n;\n66\n. Notice how often he used words like “rejoice” and “rejoicing.” Why will the Savior’s return be a day of rejoicing for you? What can you do to prepare for His coming?\nSee also\nArticles of Faith 1:10\n; Russell M. Nelson, “\nThe Future of the Church: Preparing the World for the Savior’s Second Coming\n,”\nEnsign\n, Apr. 2020, 13–17.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 58:6–11\nFasting blesses me and others in need.\nPerhaps the best way to encourage your children to fast—when they are ready—is to help them understand the Lord’s purposes for this law. Consider reading together\nIsaiah 58:6–11\nto find answers to these questions: Why do we fast? How do we fast? You could also look in “\nFast, Fasting\n” in the Guide to the Scriptures.\nIf you have had a meaningful experience with fasting, share it with your children. You could also ask them how they would explain to a friend why the Lord gave us this law.\nIsaiah 58:13–14\nThe Sabbath can be a delight to me.\nAfter reading\nIsaiah 58:13–14\n, you could point to the days of the week on a calendar and invite your children to say the days with you. When you get to the Sabbath, ask them to call that day “a delight.” Tell them why the Sabbath is a delight to you.\nShare with each other ways you can “delight thyself in the Lord” on the Sabbath. Maybe your children could draw their ideas and put them in a “box of Sabbath delights.” Then, when they need ideas about things to do on the Sabbath, they could pull an idea from the box.\nOur Light\n, by Dan Wilson\nIsaiah 60:1–3\nThe Savior is like a light for me.\nYou could invite your children to close their eyes as you read\nIsaiah 60:1–3\n. Ask them to open their eyes when they hear the word “light” and close them again when they hear the word “darkness.” Explain that Jesus Christ and His gospel are like a light that helps us see our way back to Heavenly Father.\nIsaiah 65:17–25\nWhen Jesus comes again, He will bring peace and joy.\nIsaiah 65:17–25\ndescribes what the earth will be like when the Savior comes again. As you read these verses with your children, help them look for how life will be different in the “new earth” Isaiah described. Why will this be a time to be “glad and rejoice for ever”? (\nverse 18\n).\nYou could also sing together a song about the Second Coming, such as “\nWhen the Savior Comes Again\n” (Gospel Library). Share with each other what you are looking forward to about the Savior’s return. What can we do to prepare for that day?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 42: Lesson 126: Lesson 126—Isaiah 58:1–12This lesson can help students feel a desire to fast in the Lord’s way.; Lesson 127: Lesson 127—Isaiah 58:13–14This lesson can help students honor the Lord on the Sabbath day....",
      "content": "\n--- Lesson 126 ---\nThe Lord has asked us to fast. How do you feel about this commandment? The Jews felt like the Lord did not acknowledge their fasting. Through Isaiah, the Lord taught the people about proper fasting. This lesson can help students feel a desire to fast in the Lord’s way. Student preparation: Invite students to ponder how they feel about fasting and why. They might also ask a parent or trusted friend to share their thoughts and feelings. Possible Learning Activities Fasting To help prepare students to learn about fasting, consider doing the following. As you discuss this topic, try to create an atmosphere where students can share openly without pressure or judgment. Imagine that one Sunday morning, you are ready to eat breakfast when you remember that it is fast Sunday. What are the first thoughts that enter your mind? If needed, share the following explanation of fasting from the General Handbook: The Lord has established the law of the fast and fast offerings to bless His people and to provide a way for them to serve those in need. … Fasting may be done at any time. However, members usually observe the first Sabbath of the month as a fast day. A fast day typically includes the following: Praying Going without food and drink for a 24-hour period (if physically able) Giving a generous fast offering A fast offering is a donation to help those in need. When members fast, they are invited to give an offering that is at least equal to the value of the meals not eaten. Members are encouraged to be generous and give more than the value of these meals if they can. ( General Handbook: Serving in The Church of Jesus Christ of Latter-day Saints , 22.2.2., Gospel Library) Take a moment to ponder how you feel about fasting as you reflect on the following questions: How do you feel about fasting? Why? If you have fasted before, what have you learned about the Lord and fasting from your experience? What concerns or questions do you have about fasting? As you study today, seek the Lord’s guidance to help with any concerns you have and to feel a desire to fast. The Lord’s teachings about fasting The Lord directed Isaiah to boldly declare the sins of the house of Israel. For example, they outwardly performed religious practices, including fasting, with the wrong intent. Consider explaining or displaying any of the following information that might help students as they read the verses below: “Bulrush” ( verse 5 ) is a tall, thin grass that droops. “Sackcloth” ( verse 5 ) is coarse material that people wore anciently to symbolize their humility or sorrow. They also sprinkled ashes over themselves for the same reason. Read Isaiah 58:3–5 , looking for the answers to these two questions: What did the people ask the Lord about their fasting? What did the Lord tell the people they had done incorrectly regarding their fast? Invite students to share their answers and what stood out to them. If needed, point out that as Israel fasted, they sought their own pleasure ( verse 3 ), saw fasting as an affliction ( verses 3, 5 ), and treated others poorly ( verses 3–4 ). How might we make similar mistakes as we fast? Explain that the Lord intends for us to fast differently from these people. He intends that we fast with a humble attitude, purpose, and real intent (see Psalm 35:13 ; Joel 2:12 ; Jonah 3:4–10 ; Matthew 6:16–18 ; Alma 5:46 ; 6:6 ; 17:3, 9 ). Why do you think the Lord wants us to fast humbly, with a specific righteous purpose and real intent? Promises of the Lord Consider writing the following on the board: If we fast in the way the Lord intends, then… Read Isaiah 58:6–12 , looking for the purposes and blessings the Lord promises to those who fast as the Lord intends. You may want to mark them. Isaiah 58:6–7 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. Ask students to complete the sentence based on their study. They may write their answers on the board. The following are some examples: He will loosen the hold of wickedness or sin upon us (see Isaiah 58:6 ). He will undo heavy burdens (see Isaiah 58:6 ). We will care for the poor and needy (see Isaiah 58:7 ). He will bless us with light and health (see Isaiah 58:8 ). He will answer our prayers (see Isaiah 58:9 ). The blessings of fasting To help students understand the blessings they identified, invite them to select one or two of the following situations: A young man is stressed out about his schoolwork and his future. A young woman feels like she can never be clean again because of her sins. A young man is praying to know if the Church is true but is struggling to receive an answer. A young woman wants to help the poor. A young man faces a challenge he doesn’t know if he can overcome. Find a phrase from Isaiah 58:6–12 that might motivate the person in the situation to fast and pray for God’s help. (Some situations may have more than one phrase that could apply.) In small groups or as a class, invite students to share the situations they selected and the phrases that could help and why. You might also invite them to share other situations in which the blessings the Lord promised in these verses may be helpful or ask if any of these blessings were especially meaningful to them and why. How might fasting for and receiving these blessings bring you closer to Heavenly Father and Jesus Christ? Examples of fasting and paying fast offerings To help students understand the example of the Savior, explain that He fasted and taught about fasting while also living the principle. He fasted before his earthly ministry (see Matthew 4:1–2 and note that the Joseph Smith Translation for Matthew 4:1 adjusts the phrase “to be tempted of the devil” to “to be with God”). He also taught that some evil influences only depart “by prayer and fasting” ( Matt. 17:19, 21 ). Consider showing the following modern-day example of fasting and ask students what they liked or learned from it: “ Fast Offerings: A Simple Commandment with a Marvelous Promise ” (3:01): President Henry B. Eyring tells of a woman’s experience with fast offerings in Sierra Leone during a war. 3:2 Invite students to ponder their own experiences with fasting, as well as the following questions, for a few moments: What blessings has the Lord given you or those you know because of fasting? How do you or could you make your fast more meaningful? Consider sharing your own experiences as well. Your feelings about fasting Consider any impressions you have received through the Holy Ghost during this lesson as you write in your study journal how you feel about fasting. You may choose to include blessings from the Lord you want in your life and why. Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for “ Isaiah 58:6–7 ” is “the blessings of a proper fast.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 127 ---\nThe Savior taught that the Sabbath was given to bless His people (see Mark 2:27 ). What blessings have you seen by honoring Heavenly Father and Jesus Christ on the Sabbath day? In Isaiah, we learn that if we honor the Father and the Son on Their holy Sabbath, the day will be a blessing to us. This lesson can help students honor the Lord on the Sabbath day. Student preparation: Invite students to reflect on what they already know about worshipping Heavenly Father and Jesus Christ on the Sabbath. They could make a list of things they feel they are doing well to make the Sabbath day holy. Possible Learning Activities How do you feel on the Sabbath? Giving students time to ponder their feelings about gospel truths can invite the Holy Ghost to help them identify things they do well and areas they might need to improve. Take a moment to think about how you feel on Sunday. Invite the Holy Ghost to help you remember some things you do on Sunday that may contribute to your feelings about the Sabbath. Then, answer the following questions in your study journal. How would you describe your current feelings about the Sabbath? What are some things you currently try to do (or not do) on the Sabbath? Do you feel that what you usually do on Sunday is helping you feel closer to Heavenly Father and Jesus Christ? As you study Isaiah 58:13–14 today, invite the Holy Ghost to help you recognize the blessings Heavenly Father and Jesus Christ have promised as you worship Them on Their holy day. Honoring the Lord on His Sabbath Isaiah 58:13–14 is a doctrinal mastery passage. Consider inviting students to mark doctrinal mastery passages in a distinctive way so they can locate them easily. During the seventh creative period, Heavenly Father and Jesus Christ rested from all Their labor. They blessed this day and established it as a time of sacred rest from earthly “work” (see Moses 3:3 ). Heavenly Father and Jesus Christ have invited all of us to follow this pattern (see Exodus 20:8–10 and Deuteronomy 5:12–14 ). Through His prophet Isaiah, the Lord again commanded His people to dedicate the Sabbath day to Him. Help students identify some of the invitations the Lord gives us regarding the Sabbath by writing the following incomplete statement on the board: We keep the Sabbath day holy by … When the Lord gave the Israelites the Ten Commandments, He commanded that the Sabbath be set apart as a holy day to worship Him. Read Isaiah 58:13 , marking words and phrases that stand out to you. What are some ways the Lord has asked us to make His Sabbath a holy day? Help students use their own words to explain phrases in verse 13 that complete the statement of truth. You might help them identify phrases like: not pursuing our interests or desires seeing the Sabbath as a day of joy (delight) honoring Heavenly Father and Jesus Christ each Sabbath day The following activity could be done individually by students. Select a phrase in verse 13 . Think carefully about what it might look like to apply this phrase in your life. You might want to record a few of your thoughts in your study journal. As you ponder, invite the Holy Ghost to help you have a greater understanding of things you can do. It may be helpful to explain that keeping the Sabbath day holy is filled with personal choices. Avoid discussing the right and wrong ways to keep the Sabbath day holy and encourage students to avoid judging others for their choices. Blessings for honoring the Lord on His day Read Isaiah 58:14 , marking words and phrases that help us understand some of the blessings the Lord has promised to those who honor Him on His Sabbath. How would you explain these blessings in your own words? To help students identify the blessings the Lord has promised, you might need to share the meaning of phrases such as: “ Then shalt thou delight in the Lord ” – We will have joy in the Lord. “ I will cause thee to ride upon the high places and feed thee with the heritage of Jacob ” – The Lord promises blessings to His covenant people. It might be helpful to share that “ high places ” may refer to mountains, hills, strongholds, or holy places. This phrase may mean that “the Lord will bless His covenant people to rise above all obstacles, be protected and out of the reach of danger, be victorious over enemies (see Deuteronomy 33:29 ), and be closer to the Lord.” (“ Line upon Line: Isaiah 58:13-14 ,” New Era , Feb. 2016) You could invite students to add to the board the blessings they found. If students need additional help understanding the principles of Sabbath worship, you could invite them to look for additional blessings, such as those found in Ezekiel 20:20 and Doctrine and Covenants 59:9–13 . Why might someone struggle to see that it is a “delight” to keep the Sabbath day? What obstacles might they be facing? President Russell M. Nelson shared the following about what helped him overcome an obstacle he faced when making decisions about how to honor Heavenly Father and Jesus Christ on Sundays. 14:47 The Savior identified Himself as Lord of the Sabbath. It is His day! Repeatedly, He has asked us to keep the Sabbath or to hallow the Sabbath day. We are under covenant to do so. How do we hallow the Sabbath day? In my much younger years, I studied the work of others who had compiled lists of things to do and things not to do on the Sabbath. It wasn’t until later that I learned from the scriptures that my conduct and my attitude on the Sabbath constituted a sign between me and my Heavenly Father. With that understanding, I no longer needed lists of dos and don’ts. When I had to make a decision whether or not an activity was appropriate for the Sabbath, I simply asked myself, “What sign do I want to give to God?” That question made my choices about the Sabbath day crystal clear. (“ The Sabbath Is a Delight ,” Ensign or Liahona , Apr. 2015, 130) How might Isaiah 58:13–14 and President Nelson’s message help someone who is struggling with the obstacles you identified? Students could share appropriate experiences when they have felt blessed by their efforts to focus on Heavenly Father and Jesus Christ on Sunday. The following questions could help students share their experiences. What have you found has improved your ability to honor the Lord on the Sabbath? What blessings have you seen from your efforts? What sign do you want to give to God? To help students make a plan to improve their Sabbath experience, display the following instructions. Take a moment to ponder what you have learned and felt today about the invitation in Isaiah 58:13–14 to set aside personal desires and honor Heavenly Father and Jesus Christ on the Sabbath. Invite the Holy Ghost to help you as you answer the following prompt in your study journal. To honor Heavenly Father and Jesus Christ on the Sabbath, I will . Memorize You may want to help students memorize the doctrinal mastery reference and key scripture phrase during this lesson and review them in future lessons. The key scripture phrase for Isaiah 58:13–14 is, “Turn away … from doing thy pleasure on my holy day; and call the sabbath a delight.” Ideas for memorization activities are in the appendix materials under “ Doctrinal Mastery Review Activities .”\n\n\n--- Lesson 128 ---\nIn Isaiah 61 , Isaiah taught about Jesus Christ’s mission in Heavenly Father’s plan to heal, free, comfort, and save us. Some people may be unsure if Jesus Christ is providing that help and comfort in our lives at times. This lesson can help students increase their confidence in the Savior’s ability to heal, free, and comfort us. Student preparation: Invite students to consider the evidence they have seen in their lives or the lives of others that Jesus Christ heals, comforts, and lifts people today. Ask them to come prepared to share their thoughts. Possible Learning Activities Our need for the Messiah To help students recognize our need for Jesus Christ, consider beginning class by displaying the picture depicting the woman from the New Testament who had an issue of blood (see Mark 5:24–34 ). Ask students to share what they know about her situation. If necessary, explain that she had a health concern, an “issue of blood twelve years” ( Mark 5:25 ). She “had spent all that she had” seeking a cure from physicians, but her illness only got worse ( Mark 5:26 ). Under the law of Moses, someone with an issue of blood was considered unclean (see Leviticus 15:19–33 ), so this woman was likely excluded from society in some ways during those 12 years. Ask the following questions while displaying the picture. Open PDF What do you imagine she could have thought or felt? How might a teenager experience similar thoughts or feelings today? Students can invite personal revelation to their study by thinking about their lives and circumstances. One way to help them do this could be to display instructions like the following: Think about the challenges you or someone you know is facing right now and how the Savior’s help is needed. Isaiah prophesied how the Savior could help us and this woman. As you study Isaiah 61 today, seek guidance from the Spirit to help you see how Heavenly Father and Jesus Christ are at work in your life. The mission of the Messiah To prepare students to study Isaiah 61 , write at the top of the board the following phrase: Heavenly Father sent Jesus Christ to … In Isaiah 61 , Isaiah prophesied of the Savior and His mission. In these verses, Isaiah speaks messianically or as if the Savior is saying the words. Read Isaiah 61:1–3 , and finish the statement on the board: Heavenly Father sent Jesus Christ to … You might want to explain that anointed in verse 1 means that Jesus Christ was set apart or sent with a specific purpose. “Christ (a Greek word) and Messiah (a Hebrew word) mean ‘the anointed’” (“ Jesus Christ ,” Guide to the Scriptures). You might also explain that meek in the context of verse 1 could mean poor, afflicted, or humble. What did you find that helps you understand how the Savior can help someone today? You could either write on the board what students share or invite them to do so. As students share, they might finish the following statement: Heavenly Father sent Jesus Christ to … Preach the gospel to the poor, afflicted, and humble (see verse 1 ). Heal the brokenhearted (see verse 1 ). Free the captive (see verse 1 ). Comfort all who mourn (see verse 2 ). Give beauty and joy to those weighed down (see verse 3 ). Asking follow-up questions is an effective skill to help students analyze what they have just studied in the scriptures or what they have heard someone share. You might consider asking follow-up questions such as the following to help students consider the meaning of the text: “In what ways might someone be captive?” or “What do you think it means that he will give us ‘beauty for ashes’?” Recognizing how the Savior fulfills His mission You might want to share the following summary of Luke 4:16–21 with students. During His life on earth, Jesus Christ read from Isaiah 61 at the synagogue in his hometown of Nazareth. Through Isaiah’s words, Jesus Christ testified that He was the promised Messiah sent by Heavenly Father with a mission to heal, free, comfort, and save (see Luke 4:16–21 ). To help students begin to see how the Savior can fulfill His mission in their lives, you could invite students to study examples from the scriptures in groups. Pick one of the statements on the board. Study an example in the scriptures where the Savior fulfills His mission by helping someone with their unique challenge. You can use the scriptural example provided or find your own. You might also think of a modern example. Afflicted: Man, sick of the palsy ( Mark 2:1–12 ) Brokenhearted: The woman with an issue of blood ( Mark 5:24–34 ) Captive: Alma the Younger ( Alma 36:16–21 ) Mourning: Mary and Martha ( John 11:20–36 ) Weighed down: Alma and his people ( Mosiah 24:8–21 ) As you study, look for answers to the following questions: What does this account teach you about how Jesus Christ can fulfill His mission for you in your life? What does this account teach you about how you can invite His power into your life? As students study, be available to help answer any questions they might have. After they have finished studying, you could invite students to share what they learned that could help someone who is facing a difficult challenge. Asking questions that invite students to reflect on personal experiences, such as the following, can help them recognize Jesus Christ’s love, power, and mercy in their lives. (For additional training on giving invitations that help learners recognize the Lord’s love, power, and mercy in their experiences, see “ Help learners recognize the Lord’s love, power, and mercy in their lives ” in Teacher Development Skills .) If students would benefit from seeing a modern-day example before sharing their experiences, you could watch Darlyn’s experience in “ Feeling the Lord’s Love and Goodness in Trials ” (4:18). 4:17 In what ways have you seen Jesus Christ fulfill His mission in your life or in the life of someone you know? Sharing what you believe about Him Give students time to process how the things they have learned can affect their lives outside of class. The following activity connects to the challenge they thought about at the beginning of class. Write a message to the person you were thinking about today who is currently experiencing difficulty in their life (this person could be yourself). Seek the help of the Spirit to guide you as you write. In the letter, share truths or experiences you have heard and learned about the Savior today that you think could encourage or bring hope to this person. Consider ending with your testimony of Jesus Christ and His power.\n\n\n--- Lesson 129 ---\nWith the world in turmoil, we all long for moments of peace. The Savior Jesus Christ will return to the earth and reign for a thousand years, ushering in a time of peace. Isaiah prophesied of this period, which is called the Millennium. This lesson can help students feel an increased excitement for the Savior’s Second Coming and millennial reign. Student preparation: Invite students to consider what they know about the Savior’s Second Coming and Millennium reign. Invite them to ponder if they look forward to it and why. They might ask a parent or trusted adult how they feel about the Savior’s return. Possible Learning Activities The Millennium To help students understand why the return of the Savior will be such a blessing in our lives, consider beginning by asking the following question: What are some problems in the world that you wish would change? You could write some of the following phrases on the board to help students think of answers: Reasons people weep or hurt Examples of violence, unfairness, or destruction The influence of Satan Take a moment to ponder any problems in your life or in the lives of those you love that you wish would change. As you study today, seek the guidance of the Holy Ghost as you look for truths that may help us and the world. The final chapters of Isaiah Show a picture of the Savior’s Second Coming and explain that the scriptures teach that in the future, the Savior will return to the earth and reign for a thousand years. This period is called the Millennium. Open PDF The final chapters in the book of Isaiah contain Isaiah’s teachings and prophecies about the Savior’s Second Coming and the Millennium. Read the following verses, marking phrases that help you feel excited for the Savior’s return: Isaiah 60:18–20 Isaiah 62:11–12 Isaiah 65:17–25 Invite students to share some of the phrases they found and why they look forward to the Savior providing this blessing. Students may share phrases that show that the Savior will overcome the world’s problems. Some examples are: “Violence shall no more be heard in thy land” ( Isaiah 60:18 ) “The days of thy mourning shall be ended” ( Isaiah 60:20 ) “The voice of weeping shall be no more heard” ( Isaiah 65:19 ) “They shall not hurt nor destroy” ( Isaiah 65:25 ) Encouraging students to mark phrases in the scriptures their classmates share may also be effective. How would you summarize what the Savior will do for His people when He returns? Students may share various truths. One may be similar to the following: Because of the Savior, His people will enjoy happiness, peace, and prosperity during the Millennium . Consider writing this principle, or one like it, on the board using students’ words. Deepening understanding Refer to the picture of the Savior’s Second Coming. Invite students to remember what they know and feel about Jesus Christ. Why do you think having Jesus Christ on the earth will lead to happiness, peace, and joy? Take a moment to ponder any questions you have about the Millennium and the blessings of the Savior’s return. The Lord has revealed more on the subject. Consider displaying the following questions. Select one or two of your own questions about the Millennium or the following questions you are most interested in. Spend several minutes looking for answers in the scriptures and divinely appointed sources. The section titled “Millennium” in Guide to the Scriptures and Topics and Questions on ChurchofJesusChrist.org may be useful. What does it mean that the Lord will “create new heavens and a new earth?” ( Isaiah 65:17 ). Read Doctrine and Covenants 88:25–26 and Articles of Faith 1:10 . Think of what these verses teach about the Savior’s power and His feelings for the righteous. Will there be death during the Millennium? What does it mean that because of the Savior a child “shall die an hundred years old?” ( Isaiah 65:20 ). Read Doctrine and Covenants 101:29–31 and ponder what these verses teach you about the Savior’s power. What will happen to Satan because of the Savior’s return? Read some of the following verses: Doctrine and Covenants 45:55 , 101:28 , 1 Nephi 22:26 , and Revelation 20:1–3 . Think of what these verses teach you about the Lord. What roles will the Savior have during the Millennium? What will he do? Read Doctrine and Covenants 29:11 and 45:59 and Articles of Faith 1:10 . What else has the Lord revealed about the Millennium? Read some of the following: Doctrine and Covenants 45:54, 56–58 ; 101:26–29 ; and “ Millennium ” in Topics and Questions on ChurchofJesusChrist.org . Invite students to share what they learned. Consider asking how what they learned helps increase their excitement for the Savior’s return and the Millennium. If students ask what it means that Satan will be “loosed a little season” ( Revelation 20:3 ) at the end of the Millennium, invite them to read Doctrine and Covenants 88:111–115 . Visualizing what you learned Visualizing what you are learning can be effective at times. Close your eyes and visualize what you have learned about the Savior and when He reigns on the earth during the Millennium. Pray for the help of the Holy Ghost to make this activity meaningful for you. Picture the Savior returning and how He may bless you, your loved ones, and all mankind. You might read the following statement from Elder Andersen, inviting students to visualize what they hear. Elder Neil L. Andersen of the Quorum of the Twelve Apostles testified: The thought of His coming stirs my soul. It will be breathtaking! The scope and grandeur, the vastness and magnificence, will exceed anything mortal eyes have ever seen or experienced. … He will appear “in the clouds of heaven, clothed with power and great glory; with all the holy angels” ( Doctrine and Covenants 45:44 ). … We will kneel in reverence, “and the Lord shall utter his voice, and all the ends of the earth shall hear it” ( Doctrine and Covenants 45:49 ) … There will be unforgettable reunions with the angels of heaven and the Saints upon the earth (see Moses 7:63 ). But most important, as Isaiah declares, “All the ends of the earth shall see the salvation of our God,” ( Isaiah 52:10 ) and He “shall reign over all flesh” ( Doctrine and Covenants 133:25 ). (“ Thy Kingdom Come ,” Ensign or Liahona , May 2015, 122) Ask students to write in their study journals what they learned about the Savior today and how they feel about His return. Invite volunteers to share their thoughts and feelings. Consider sharing your thoughts and feelings as well.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 58",
      "content": "1. Cry aloud,sparenot, lift up thyvoicelike atrumpet, andshewmy people theirtransgression, and the house of Jacob their sins.\n2. Yetthey seek me daily, and delight to know my ways, as nation that did righteousness, and forsook not the ordinance of their God: they ask of me theordinancesof justice; they take delight in approaching to God.\n3. Whereforehave we fasted,say they,and thou seest not?whereforehave we afflicted our soul, and thou takest no knowledge? Behold, in the day of yourfastye findpleasure, andexact all your labours.\n4. Behold, ye fast forstrifeanddebate, and to smite with the fist of wickedness: ye shall notfastasye do thisday, to make your voice to be heard on high.\n5. Is it such fast that I have chosen? day for man to afflict his soul?is itto bow down his head as bulrush, and to spread sackcloth and ashesunder him?wilt thou call this fast, and an acceptable day to theLord?\n6. Isnot this the fast that I have chosen? to loose thebandsof wickedness, to undo the heavy burdens, and to let the oppressed gofree, and that ye break every yoke?\n7. Is itnot to deal thy bread to thehungry, and that thou bring thepoorthat are cast out to thy house? when thou seest the naked, that thou cover him; and that thou hide not thyself fromthine own flesh?\n8. Then shall thylightbreak forth as the morning, and thinehealthshall spring forth speedily: and thy righteousness shall go before thee; the glory of theLordshall be thyrearward.\n9. Then shalt thoucall, and theLordshall answer; thou shalt cry, and he shall say, Here Iam.If thou take away from the midst of thee the yoke, theputtingforth of the finger, and speaking vanity;\n10. Andifthou draw out thy soul to thehungry, and satisfy the afflicted soul; then shall thy lightrise in obscurity, and thy darknessbeas the noonday:\n11. And theLordshallguidethee continually, and satisfy thy soul indrought, andmake fatthy bones: and thou shalt be like watered garden, and like aspringof water, whose waters fail not.\n12. Andthey that shall beof thee shall build the old waste places: thou shalt raise up the foundations of many generations; and thou shalt be called, The repairer of the breach, The restorer of paths to dwell in.\n13. If thou turn away thy foot from the sabbath,fromdoing thy pleasure on my holy day; and call thesabbatha delight, the holy of theLord, honourable; and shalt honour him, not doing thine own ways, nor finding thine own pleasure, nor speakingthine ownwords:\n14. Then shalt thou delight thyself in theLord; and I will cause thee to ride upon thehigh placesof the earth, and feed thee with the heritage of Jacob thy father: for the mouth of theLordhath spokenit.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 59",
      "content": "1. Behold, theLordshandis notshortened, that it cannot save; neither his ear heavy, that it cannothear:\n2. But your iniquities haveseparatedbetween you and your God, and yoursinshave hidhisface from you, that he will nothear.\n3. For your hands are defiled withblood, and your fingers with iniquity; your lips have spoken lies, your tongue hath muttered perverseness.\n4. None calleth for justice, noranypleadeth for truth: theytrustin vanity, and speak lies; they conceivemischief, and bring forth iniquity.\n5. They hatch cockatrice eggs, and weave the spiders web: he that eateth of their eggs dieth, and that which is crushed breaketh out into viper.\n6. Their webs shall not become garments, neither shall they cover themselves with their works: their worksareworks of iniquity, and the act of violenceisin their hands.\n7. Their feetruntoevil, and they makehastetoshedinnocent blood: their thoughtsarethoughts of iniquity; wasting and destructionarein their paths.\n8. The way ofpeacethey know not; andthere isnojudgmentin their goings: they have made themcrookedpaths: whosoever goeth therein shall not know peace.\n9. Therefore is judgment far from us, neither dothjusticeovertake us: we wait forlight, but behold obscurity; for brightness,butwewalkin darkness.\n10. Wegropefor the wall like the blind, and we grope as ifwe hadno eyes: we stumble at noonday as in the night;we arein desolate places as deadmen.\n11. We roar all like bears, and mourn sore like doves: we look for judgment, butthere isnone; for salvation,butit is far off from us.\n12. For our transgressions are multiplied before thee, and our sinstestifyagainst us: for our transgressionsarewith us; andas forour iniquities, weknowthem;\n13. In transgressing and lying against theLord, and departing away from our God, speaking oppression and revolt, conceiving and uttering from the heart words of falsehood.\n14. And judgment is turned away backward, and justice standeth afar off: for truth is fallen in the street, andequitycannot enter.\n15. Yea, truth faileth; and hethatdeparteth from evil maketh himself prey: and theLordsawit,and it displeased him thatthere wasno judgment.\n16. And he saw thatthere wasno man, and wondered thatthere wasnointercessor: therefore hisarmbroughtsalvationunto him; and his righteousness, it sustained him.\n17. For he put onrighteousnessas abreastplate, and an helmet of salvation upon his head; and he put on the garments of vengeanceforclothing, and was clad with zeal as cloak.\n18. According totheirdeeds, accordingly he willrepay, fury to his adversaries,recompenceto his enemies; to the islands he will repay recompence.\n19. So shall theyfearthenameof theLordfrom the west, and his glory from the rising of the sun. When the enemy shall come in like flood, theSpiritof theLordshall lift up standard against him.\n20. And theRedeemershallcometoZion, and unto them thatturnfrom transgression in Jacob, saith theLord.\n21. As for me, thisismycovenantwith them, saith theLord; My spirit thatisupon thee, and my words which I have put in thy mouth, shall not depart out of thy mouth, nor out of the mouth of thy seed, nor out of the mouth of thy seeds seed, saith theLord, from henceforth and for ever.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 60",
      "content": "1. Arise, shine; for thylightis come, and the glory of theLordis risen upon thee.\n2. For, behold, thedarknessshall cover the earth, and grossdarknessthe people: but theLordshallarise upon thee, and hisgloryshall be seen upon thee.\n3. And theGentilesshall come to thylight, and kings to the brightness of thy rising.\n4. Lift up thine eyes round about, and see: all they gather themselves together, they come to thee: thysonsshall come from far, and thy daughters shall be nursed atthyside.\n5. Then thou shalt see, andflow together, and thine heart shall fear, and be enlarged; because theabundanceof the sea shall be converted unto thee, theforcesof theGentilesshall come unto thee.\n6. The multitude of camels shall cover thee, the dromedaries of Midian and Ephah; all they from Sheba shall come: they shall bringgoldand incense; and they shall shew forth the praises of theLord.\n7. All the flocks ofKedarshall be gathered together unto thee, the rams of Nebaioth shall minister unto thee: they shall come up withacceptanceon minealtar, and I will glorify the house of myglory.\n8. Whoarethesethatfly as cloud, and as the doves to their windows?\n9. Surely theislesshall wait forme, and the ships of Tarshish first, tobringthy sons from far, their silver and their gold with them, unto the name of theLordthy God, and to the Holy One of Israel, because he hath glorified thee.\n10. And thesonsof strangers shallbuildup thy walls, and their kings shall minister unto thee: for in mywrathI smote thee, but in my favour have I had mercy on thee.\n11. Therefore thygatesshall be open continually; they shall not be shut day nor night; thatmenmay bring unto thee theforces of the Gentiles, andthattheir kingsmay bebrought.\n12. For thenationandkingdomthat will not serve thee shallperish; yea,thosenationsshall be utterly wasted.\n13. The glory ofLebanonshall come unto thee, thefirtree, the pine tree, and the box together, tobeautifythe place of my sanctuary; and I will make the place of myfeetglorious.\n14. The sons also of them that afflicted thee shall come bending unto thee; and all they that despised thee shallbowthemselves down at the soles of thy feet; and they shall call thee, The city of theLord, The Zion of the Holy One of Israel.\n15. Whereas thou hast beenforsakenand hated, so that no man went throughthee,I will make thee an eternal excellency, joy of many generations.\n16. Thou shalt also suck themilkof the Gentiles, and shalt suck the breast ofkings: and thou shalt know that I theLordamthySaviourand thy Redeemer, the mighty One of Jacob.\n17. For brass I will bring gold, and for iron I will bring silver, and for wood brass, and for stones iron: I will also make thy officers peace, and thine exactors righteousness.\n18. Violenceshall no more be heard in thy land, wasting nor destruction within thy borders; but thou shalt call thywallsSalvation, and thy gatesPraise.\n19. Thesunshall be no more thy light by day; neither for brightness shall the moon give light unto thee: but theLordshall be unto thee an everlastinglight, and thy God thy glory.\n20. Thy sun shall no more go down; neither shall thy moon withdraw itself: for theLordshall be thineeverlastinglight, and the days of thymourningshall be ended.\n21. Thy people alsoshall beallrighteous: they shall inherit thelandforever, thebranchof my planting, theworkof my hands, that I may be glorified.\n22. Alittle oneshall become thousand, and small one astrongnation: I theLordwill hasten it inhistime.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 61",
      "content": "1. TheSpiritof the LordGodisupon me; because theLordhathanointedme topreachgood tidingsunto themeek; he hath sent me tobindup the brokenhearted, toproclaimlibertyto thecaptives, and the opening of theprisontothem that arebound;\n2. To proclaim the acceptable year of theLord, and the day ofvengeanceof our God; tocomfortall thatmourn;\n3. To appoint unto them that mourn in Zion, to give unto thembeautyfor ashes, the oil ofjoyfor mourning, the garment of praise for the spirit of heaviness; that they might be calledtreesofrighteousness, theplantingof theLord, that he might be glorified.\n4. And they shallbuildthe old wastes, they shall raise up the former desolations, and they shall repair the waste cities, the desolations of many generations.\n5. And strangers shall stand and feed your flocks, and the sons of the alienshall beyour plowmen and your vinedressers.\n6. But ye shall be named thePriestsof theLord:menshall call you the Ministers of our God: ye shall eat therichesof the Gentiles, and in their glory shall ye boast yourselves.\n7. For your shameye shall havedouble; andforconfusion they shall rejoice in their portion: therefore in their land they shall possessthe double: everlasting joy shall be unto them.\n8. For I theLordlovejudgment, I hate robbery for burnt offering; and I will direct their work in truth, and I will make an everlastingcovenantwith them.\n9. And their seed shall be known among the Gentiles, and their offspring among the people: all that see them shall acknowledge them, that theyaretheseedwhichtheLordhath blessed.\n10. I will greatly rejoice in theLord, my soul shall be joyful in my God; for he hathclothedme with thegarmentsof salvation, he hath covered me with the robe of righteousness, as bridegroom deckethhimselfwith ornaments, and as bride adornethherselfwith her jewels.\n11. For as the earth bringeth forth her bud, and as the garden causeth the things that are sown in it to spring forth; so the LordGodwill cause righteousness andpraiseto spring forth before all the nations.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 62",
      "content": "1. For Zions sake will I not hold my peace, and for Jerusalems sake I will not rest, until the righteousness thereof go forth as brightness, andthe salvation thereof as lampthatburneth.\n2. And the Gentiles shallseethy righteousness, and all kings thy glory: and thou shalt be called by newname, which the mouth of theLordshall name.\n3. Thou shalt also be acrownof glory in the hand of theLord, and royal diadem in the hand of thy God.\n4. Thou shalt no more be termedForsaken; neither shall thylandany more be termed Desolate: but thou shalt be calledHephzi-bah, and thy landBeulah: for theLorddelighteth in thee, and thy land shall be married.\n5. Forasa young man marrieth virgin,soshall thy sons marry thee: andasthe bridegroom rejoiceth over the bride,soshall thy Godrejoiceover thee.\n6. I have setwatchmenupon thy walls, O Jerusalem,whichshall never hold their peace day nor night: ye that make mention of theLord, keep not silence,\n7. And give him no rest, till he establish, and till he make Jerusalem apraisein the earth.\n8. TheLordhath sworn by his right hand, and by the arm of his strength, Surely I will no more give thy cornto bemeat for thine enemies; and the sons of the stranger shall not drink thy wine, for the which thou hast laboured:\n9. But they that have gathered it shall eat it, and praise theLord; and they that have brought it together shall drink it in the courts of myholiness.\n10. Go through, go through the gates;prepareye the way of the people; cast up, cast up thehighway; gather out the stones; lift up astandardfor the people.\n11. Behold, theLordhath proclaimed unto the end of theworld, Say ye to thedaughterof Zion, Behold, thysalvationcometh; behold, hisrewardiswith him, and his work before him.\n12. And they shall call them, The holy people, The redeemed of theLord: and thou shalt be called, Sought out, A city not forsaken.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 63",
      "content": "1. Whoisthis thatcomethfromEdom, with dyed garments from Bozrah? thisthat isglorious in his apparel, travelling in the greatness of his strength? I that speak in righteousness, mighty to save.\n2. Whereforeart thouredin thine apparel, and thy garments like him that treadeth in thewinefat?\n3. I have trodden thewinepressalone; and of the peoplethere wasnone with me: for I will tread them in mine anger, and trample them in my fury; and their blood shall besprinkledupon my garments, and I will stain all my raiment.\n4. For the day ofvengeanceisin mine heart, and the year of myredeemedis come.\n5. And I looked, andthere wasnone to help; and I wondered thatthere wasnone to uphold: therefore mine own arm broughtsalvationunto me; and my fury, it upheld me.\n6. And I will tread down the people in mine anger, andmake them drunkin my fury, and I will bring down their strength to the earth.\n7. I will mention thelovingkindnessesof theLord,andthe praises of theLord, according to all that theLordhath bestowed on us, and the greatgoodnesstoward the house of Israel, which he hath bestowed on them according to his mercies, and according to the multitude of his lovingkindnesses.\n8. For he said, Surely theyaremy people, childrenthatwill not lie: so he was theirSaviour.\n9. In all theirafflictionhe was afflicted, and theangelof hispresencesaved them: in hisloveand in his pity heredeemedthem; and he bare them, andcarriedthem all the days of old.\n10. But theyrebelled, andvexedhisholy Spirit: therefore he was turned to be theirenemy,andhe fought against them.\n11. Thenhe rememberedthe days of old, Moses,andhis people,saying,Whereishe that brought them up out of theseawith theshepherdof hisflock? whereishe that put his holy Spirit withinhim?\n12. That ledthemby the right hand ofMoseswith his glorious arm,dividingthe water before them, to make himself an everlasting name?\n13. That led them through the deep, as an horse in the wilderness,thatthey should not stumble?\n14. As beast goethdown into the valley, theSpiritof theLordcausedhimto rest: so didst thou lead thy people, to make thyself gloriousname.\n15. Lookdown from heaven, and behold from the habitation of thyholinessand of thy glory: whereisthy zeal and thy strength,thesounding of thy bowels and of thy mercies toward me? are they restrained?\n16. Doubtless thouartourfather, though Abrahambe ignorantof us, and Israel acknowledge us not: thou, OLord,artour father, our redeemer; thy nameisfromeverlasting.\n17. OLord, why hast thoumadeus to err from thy ways,andhardenedour heart from thy fear? Return for thy servants sake, the tribes of thine inheritance.\n18. Thepeopleof thy holiness have possesseditbut little while: our adversaries havetroddendown thy sanctuary.\n19. We arethine:thou never barest rule over them; they were not called by thyname.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 64",
      "content": "1. Oh that thou wouldestrendthe heavens, that thou wouldest come down, that themountainsmight flow down at thypresence,\n2. Aswhenthe melting fire burneth, the fire causeth the waters to boil, to make thy name known to thine adversaries,thatthe nations maytrembleat thy presence!\n3. When thou didstterriblethingswhichwe looked not for, thou camest down, themountainsflowed down at thy presence.\n4. For since the beginning of the worldmenhave not heard, nor perceived by the ear, neither hath theeyeseen, O God, beside thee,whathe hathpreparedfor him that waiteth for him.\n5. Thou meetest him that rejoiceth and worketh righteousness,those thatremember thee in thy ways: behold, thou art wroth; for we have sinned: in those is continuance, and we shall be saved.\n6. But we are all as anuncleanthing,and all our righteousnessesareasfilthyrags; and we all do fade as leaf; and our iniquities, like the wind, have taken us away.\n7. Andthere isnone that calleth upon thy name, that stirreth up himself to take hold of thee: for thou hast hid thyfacefrom us, and hast consumed us, because of our iniquities.\n8. But now, OLord, thouartourfather; wearethe clay, and thou our potter; and we allaretheworkof thy hand.\n9. Be not wroth very sore, OLord, neither remember iniquity for ever: behold, see, we beseech thee, weareall thypeople.\n10. Thy holy cities are wilderness, Zion is wilderness, Jerusalem desolation.\n11. Our holy and ourbeautifulhouse, where our fathers praised thee, isburnedup with fire: and all our pleasant things are laidwaste.\n12. Wilt thourefrainthyself for thesethings,OLord? wilt thou hold thy peace, and afflict us very sore?",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 65",
      "content": "1. I amsoughtofthem thatasked notfor me;I am found ofthem thatsought me not: I said, Behold me, behold me, unto nationthatwas not called by myname.\n2. I have spread out my hands all the day unto arebelliouspeople, which walketh in waythat wasnot good, after their own thoughts;\n3. A people that provoketh me toangercontinually to my face; that sacrificeth in gardens, and burneth incense upon altars ofbrick;\n4. Which remainamong the graves, and lodge in the monuments, which eat swines flesh, and broth of abominablethings is intheir vessels;\n5. Which say, Stand by thyself, come not near to me; for I amholierthan thou. Thesearea smoke in my nose, fire that burneth all the day.\n6. Behold,it iswritten before me: I will not keep silence, but willrecompense, even recompense into their bosom,\n7. Your iniquities, and the iniquities of your fathers together, saith theLord, which have burned incense upon the mountains, andblasphemedme upon the hills: therefore will I measure their former work into their bosom.\n8. Thus saith theLord, As thenew wineis found in the cluster, andonesaith, Destroy it not; for blessingisin it: so will I do for my servants sakes, that I maynotdestroy them all.\n9. And I will bring forth seed out of Jacob, and out ofJudahan inheritor of my mountains: and mineelectshallinheritit, and my servants shall dwell there.\n10. And Sharon shall be fold of flocks, and the valley ofAchora place for the herds to lie down in, for my people that have sought me.\n11. But yearethey that forsake theLord, that forget my holy mountain, that prepare table for thattroop, and that furnish the drink offering unto thatnumber.\n12. Therefore will I number you to the sword, and ye shall all bow down to the slaughter: because when Icalled, ye did not answer; when I spake, ye did not hear; but did evil before mine eyes, and did choosethatwherein I delighted not.\n13. Therefore thus saith the LordGod, Behold, my servants shall eat, but ye shall be hungry: behold, my servants shall drink, but ye shall be thirsty: behold, my servants shall rejoice, but ye shall be ashamed:\n14. Behold, my servants shall sing for joy of heart, but ye shall cry for sorrow of heart, and shallhowlfor vexation of spirit.\n15. And ye shall leave your name for acurseunto my chosen: for the LordGodshall slay thee, and call his servants by anothername:\n16. That he whoblesseth himselfin the earth shall bless himself in the God of truth; and he that sweareth in the earth shallswearby the God of truth; because the former troubles are forgotten, and because they are hid from mine eyes.\n17. For, behold, Icreatenewheavensand anewearth: and theformershall not be remembered, nor come into mind.\n18. But be ye glad and rejoice for everin thatwhich I create: for, behold, I create Jerusalem arejoicing, and her people joy.\n19. And I willrejoicein Jerusalem, and joy in my people: and the voice of weeping shall be no more heard in her, nor the voice of crying.\n20. There shall be no more thence an infant of days, nor anoldman that hath not filled his days: for thechildshall die an hundred years old; but the sinnerbeingan hundred years old shall be accursed.\n21. And they shall build houses, and inhabitthem;and they shall plant vineyards, andeatthe fruit of them.\n22. They shall not build, and another inhabit; they shall not plant, and another eat: for as the days of atreearethe days of my people, and mine elect shall long enjoy the work of their hands.\n23. They shall notlabourin vain,nor bring forth for trouble; for theyaretheseedof the blessed of theLord, and theiroffspringwith them.\n24. And it shall come to pass, that before they call, I willanswer; and while they are yet speaking, I will hear.\n25. Thewolfand the lamb shallfeedtogether, and the lion shall eat straw like the bullock: and dustshall bethe serpents meat. They shall nothurtnor destroy in all my holy mountain, saith theLord.",
      "url": null,
      "purpose": "Full scripture text"
    },
    {
      "source_type": "scripture",
      "title": "Isaiah 66",
      "content": "1. Thus saith theLord, The heavenismythrone, and the earthismy footstool: whereisthe house that ye build unto me? and whereisthe place of my rest?\n2. For all thosethingshath mine hand made, and all thosethingshave been, saith theLord: but to thismanwill I look,eventohim that ispoor and of acontrite spirit, and trembleth at my word.\n3. Hethat killeth an oxis as ifhe slew man; he that sacrificeth lamb,as ifhe cut off dogs neck; he that offereth an oblation,as if he offeredswines blood; he that burneth incense,as ifhe blessed an idol. Yea, they have chosen their own ways, and their soul delighteth in their abominations.\n4. Ialso will choose their delusions, and will bring their fears upon them; because when Icalled, none did answer; when I spake, they did not hear: but they did evil before mine eyes, and chosethatin which I delighted not.\n5. Hear the word of theLord, ye that tremble at his word; Your brethren that hated you, thatcastyou out for my names sake, said, Let theLordbeglorified: but he shall appear to your joy, and they shall be ashamed.\n6. A voice of noise from the city, voice from the temple, voice of theLordthat rendereth recompence to his enemies.\n7. Beforeshetravailed, she brought forth; before her pain came, she was delivered of manchild.\n8. Who hath heard such thing? who hath seen such things? Shall the earth be made to bring forth in one day?orshall nation be born at once? for as soon as Zion travailed, she brought forth her children.\n9. Shall I bring to the birth, and not cause to bring forth? saith theLord: shall I cause to bring forth, and shutthe womb?saith thy God.\n10. Rejoice ye with Jerusalem, and be glad with her, all ye that love her: rejoice for joy with her, all ye that mourn for her:\n11. That ye may suck, and be satisfied with the breasts of her consolations; that ye may milk out, and be delighted with the abundance of her glory.\n12. For thus saith theLord, Behold, I will extend peace to herlike river, and the glory of theGentileslike flowing stream: then shall ye suck, ye shall be borne uponhersides, and be dandled uponherknees.\n13. As one whom hismothercomforteth, so will Icomfortyou; and ye shall becomfortedin Jerusalem.\n14. And when ye seethis,your heart shall rejoice, and your bones shall flourish like an herb: and thehandof theLordshall be known toward his servants, andhisindignationtoward his enemies.\n15. For, behold, theLordwill come withfire, and with hischariotslike whirlwind, to render his anger with fury, and his rebuke with flames of fire.\n16. For by fire and by hisswordwilltheLordpleadwith all flesh: and theslainof theLordshall be many.\n17. They that sanctify themselves, and purify themselves in the gardens behind onetreein the midst, eating swines flesh, and theabomination, and themouse, shall be consumed together, saith theLord.\n18. For Iknowtheirworksand their thoughts: it shall come, that I will gatherallnations and tongues; and they shall come, and see my glory.\n19. And I will set asignamong them, and I will send those that escape of them unto the nations,toTarshish, Pul, andLud, that draw the bow,toTubal, and Javan,tothe isles afar off, that have not heard my fame, neither have seen my glory; and they shalldeclaremy glory among theGentiles.\n20. And they shall bring all your brethrenforanofferingunto theLordout of all nations upon horses, and in chariots, and in litters, and upon mules, and upon swift beasts, to my holy mountain Jerusalem, saith theLord, as the children of Israel bring an offering in clean vessel into the house of theLord.\n21. And I will also take of them forpriestsandfor Levites, saith theLord.\n22. For as thenewheavens and the new earth, which I will make, shall remain before me, saith theLord, so shall yourseedand your name remain.\n23. And it shall come to pass,thatfrom one new moon to another, and from one sabbath to another, shall all flesh come toworshipbefore me, saith theLord.\n24. And they shall go forth, and look upon the carcases of the men that have transgressed against me: for theirwormshall not die, neither shall theirfirebe quenched; and they shall be an abhorring unto all flesh.",
      "url": null,
      "purpose": "Full scripture text"
    }
  ],
  "scripture_content": {
    "Isaiah": {
      "58": {
        "verses": {
          "1": {
            "text": "Cry aloud,sparenot, lift up thyvoicelike atrumpet, andshewmy people theirtransgression, and the house of Jacob their sins.",
            "citation": "(Isaiah 58:1)"
          },
          "2": {
            "text": "Yetthey seek me daily, and delight to know my ways, as nation that did righteousness, and forsook not the ordinance of their God: they ask of me theordinancesof justice; they take delight in approaching to God.",
            "citation": "(Isaiah 58:2)"
          },
          "3": {
            "text": "Whereforehave we fasted,say they,and thou seest not?whereforehave we afflicted our soul, and thou takest no knowledge? Behold, in the day of yourfastye findpleasure, andexact all your labours.",
            "citation": "(Isaiah 58:3)"
          },
          "4": {
            "text": "Behold, ye fast forstrifeanddebate, and to smite with the fist of wickedness: ye shall notfastasye do thisday, to make your voice to be heard on high.",
            "citation": "(Isaiah 58:4)"
          },
          "5": {
            "text": "Is it such fast that I have chosen? day for man to afflict his soul?is itto bow down his head as bulrush, and to spread sackcloth and ashesunder him?wilt thou call this fast, and an acceptable day to theLord?",
            "citation": "(Isaiah 58:5)"
          },
          "6": {
            "text": "Isnot this the fast that I have chosen? to loose thebandsof wickedness, to undo the heavy burdens, and to let the oppressed gofree, and that ye break every yoke?",
            "citation": "(Isaiah 58:6)"
          },
          "7": {
            "text": "Is itnot to deal thy bread to thehungry, and that thou bring thepoorthat are cast out to thy house? when thou seest the naked, that thou cover him; and that thou hide not thyself fromthine own flesh?",
            "citation": "(Isaiah 58:7)"
          },
          "8": {
            "text": "Then shall thylightbreak forth as the morning, and thinehealthshall spring forth speedily: and thy righteousness shall go before thee; the glory of theLordshall be thyrearward.",
            "citation": "(Isaiah 58:8)"
          },
          "9": {
            "text": "Then shalt thoucall, and theLordshall answer; thou shalt cry, and he shall say, Here Iam.If thou take away from the midst of thee the yoke, theputtingforth of the finger, and speaking vanity;",
            "citation": "(Isaiah 58:9)"
          },
          "10": {
            "text": "Andifthou draw out thy soul to thehungry, and satisfy the afflicted soul; then shall thy lightrise in obscurity, and thy darknessbeas the noonday:",
            "citation": "(Isaiah 58:10)"
          },
          "11": {
            "text": "And theLordshallguidethee continually, and satisfy thy soul indrought, andmake fatthy bones: and thou shalt be like watered garden, and like aspringof water, whose waters fail not.",
            "citation": "(Isaiah 58:11)"
          },
          "12": {
            "text": "Andthey that shall beof thee shall build the old waste places: thou shalt raise up the foundations of many generations; and thou shalt be called, The repairer of the breach, The restorer of paths to dwell in.",
            "citation": "(Isaiah 58:12)"
          },
          "13": {
            "text": "If thou turn away thy foot from the sabbath,fromdoing thy pleasure on my holy day; and call thesabbatha delight, the holy of theLord, honourable; and shalt honour him, not doing thine own ways, nor finding thine own pleasure, nor speakingthine ownwords:",
            "citation": "(Isaiah 58:13)"
          },
          "14": {
            "text": "Then shalt thou delight thyself in theLord; and I will cause thee to ride upon thehigh placesof the earth, and feed thee with the heritage of Jacob thy father: for the mouth of theLordhath spokenit.",
            "citation": "(Isaiah 58:14)"
          }
        }
      },
      "59": {
        "verses": {
          "1": {
            "text": "Behold, theLordshandis notshortened, that it cannot save; neither his ear heavy, that it cannothear:",
            "citation": "(Isaiah 59:1)"
          },
          "2": {
            "text": "But your iniquities haveseparatedbetween you and your God, and yoursinshave hidhisface from you, that he will nothear.",
            "citation": "(Isaiah 59:2)"
          },
          "3": {
            "text": "For your hands are defiled withblood, and your fingers with iniquity; your lips have spoken lies, your tongue hath muttered perverseness.",
            "citation": "(Isaiah 59:3)"
          },
          "4": {
            "text": "None calleth for justice, noranypleadeth for truth: theytrustin vanity, and speak lies; they conceivemischief, and bring forth iniquity.",
            "citation": "(Isaiah 59:4)"
          },
          "5": {
            "text": "They hatch cockatrice eggs, and weave the spiders web: he that eateth of their eggs dieth, and that which is crushed breaketh out into viper.",
            "citation": "(Isaiah 59:5)"
          },
          "6": {
            "text": "Their webs shall not become garments, neither shall they cover themselves with their works: their worksareworks of iniquity, and the act of violenceisin their hands.",
            "citation": "(Isaiah 59:6)"
          },
          "7": {
            "text": "Their feetruntoevil, and they makehastetoshedinnocent blood: their thoughtsarethoughts of iniquity; wasting and destructionarein their paths.",
            "citation": "(Isaiah 59:7)"
          },
          "8": {
            "text": "The way ofpeacethey know not; andthere isnojudgmentin their goings: they have made themcrookedpaths: whosoever goeth therein shall not know peace.",
            "citation": "(Isaiah 59:8)"
          },
          "9": {
            "text": "Therefore is judgment far from us, neither dothjusticeovertake us: we wait forlight, but behold obscurity; for brightness,butwewalkin darkness.",
            "citation": "(Isaiah 59:9)"
          },
          "10": {
            "text": "Wegropefor the wall like the blind, and we grope as ifwe hadno eyes: we stumble at noonday as in the night;we arein desolate places as deadmen.",
            "citation": "(Isaiah 59:10)"
          },
          "11": {
            "text": "We roar all like bears, and mourn sore like doves: we look for judgment, butthere isnone; for salvation,butit is far off from us.",
            "citation": "(Isaiah 59:11)"
          },
          "12": {
            "text": "For our transgressions are multiplied before thee, and our sinstestifyagainst us: for our transgressionsarewith us; andas forour iniquities, weknowthem;",
            "citation": "(Isaiah 59:12)"
          },
          "13": {
            "text": "In transgressing and lying against theLord, and departing away from our God, speaking oppression and revolt, conceiving and uttering from the heart words of falsehood.",
            "citation": "(Isaiah 59:13)"
          },
          "14": {
            "text": "And judgment is turned away backward, and justice standeth afar off: for truth is fallen in the street, andequitycannot enter.",
            "citation": "(Isaiah 59:14)"
          },
          "15": {
            "text": "Yea, truth faileth; and hethatdeparteth from evil maketh himself prey: and theLordsawit,and it displeased him thatthere wasno judgment.",
            "citation": "(Isaiah 59:15)"
          },
          "16": {
            "text": "And he saw thatthere wasno man, and wondered thatthere wasnointercessor: therefore hisarmbroughtsalvationunto him; and his righteousness, it sustained him.",
            "citation": "(Isaiah 59:16)"
          },
          "17": {
            "text": "For he put onrighteousnessas abreastplate, and an helmet of salvation upon his head; and he put on the garments of vengeanceforclothing, and was clad with zeal as cloak.",
            "citation": "(Isaiah 59:17)"
          },
          "18": {
            "text": "According totheirdeeds, accordingly he willrepay, fury to his adversaries,recompenceto his enemies; to the islands he will repay recompence.",
            "citation": "(Isaiah 59:18)"
          },
          "19": {
            "text": "So shall theyfearthenameof theLordfrom the west, and his glory from the rising of the sun. When the enemy shall come in like flood, theSpiritof theLordshall lift up standard against him.",
            "citation": "(Isaiah 59:19)"
          },
          "20": {
            "text": "And theRedeemershallcometoZion, and unto them thatturnfrom transgression in Jacob, saith theLord.",
            "citation": "(Isaiah 59:20)"
          },
          "21": {
            "text": "As for me, thisismycovenantwith them, saith theLord; My spirit thatisupon thee, and my words which I have put in thy mouth, shall not depart out of thy mouth, nor out of the mouth of thy seed, nor out of the mouth of thy seeds seed, saith theLord, from henceforth and for ever.",
            "citation": "(Isaiah 59:21)"
          }
        }
      },
      "60": {
        "verses": {
          "1": {
            "text": "Arise, shine; for thylightis come, and the glory of theLordis risen upon thee.",
            "citation": "(Isaiah 60:1)"
          },
          "2": {
            "text": "For, behold, thedarknessshall cover the earth, and grossdarknessthe people: but theLordshallarise upon thee, and hisgloryshall be seen upon thee.",
            "citation": "(Isaiah 60:2)"
          },
          "3": {
            "text": "And theGentilesshall come to thylight, and kings to the brightness of thy rising.",
            "citation": "(Isaiah 60:3)"
          },
          "4": {
            "text": "Lift up thine eyes round about, and see: all they gather themselves together, they come to thee: thysonsshall come from far, and thy daughters shall be nursed atthyside.",
            "citation": "(Isaiah 60:4)"
          },
          "5": {
            "text": "Then thou shalt see, andflow together, and thine heart shall fear, and be enlarged; because theabundanceof the sea shall be converted unto thee, theforcesof theGentilesshall come unto thee.",
            "citation": "(Isaiah 60:5)"
          },
          "6": {
            "text": "The multitude of camels shall cover thee, the dromedaries of Midian and Ephah; all they from Sheba shall come: they shall bringgoldand incense; and they shall shew forth the praises of theLord.",
            "citation": "(Isaiah 60:6)"
          },
          "7": {
            "text": "All the flocks ofKedarshall be gathered together unto thee, the rams of Nebaioth shall minister unto thee: they shall come up withacceptanceon minealtar, and I will glorify the house of myglory.",
            "citation": "(Isaiah 60:7)"
          },
          "8": {
            "text": "Whoarethesethatfly as cloud, and as the doves to their windows?",
            "citation": "(Isaiah 60:8)"
          },
          "9": {
            "text": "Surely theislesshall wait forme, and the ships of Tarshish first, tobringthy sons from far, their silver and their gold with them, unto the name of theLordthy God, and to the Holy One of Israel, because he hath glorified thee.",
            "citation": "(Isaiah 60:9)"
          },
          "10": {
            "text": "And thesonsof strangers shallbuildup thy walls, and their kings shall minister unto thee: for in mywrathI smote thee, but in my favour have I had mercy on thee.",
            "citation": "(Isaiah 60:10)"
          },
          "11": {
            "text": "Therefore thygatesshall be open continually; they shall not be shut day nor night; thatmenmay bring unto thee theforces of the Gentiles, andthattheir kingsmay bebrought.",
            "citation": "(Isaiah 60:11)"
          },
          "12": {
            "text": "For thenationandkingdomthat will not serve thee shallperish; yea,thosenationsshall be utterly wasted.",
            "citation": "(Isaiah 60:12)"
          },
          "13": {
            "text": "The glory ofLebanonshall come unto thee, thefirtree, the pine tree, and the box together, tobeautifythe place of my sanctuary; and I will make the place of myfeetglorious.",
            "citation": "(Isaiah 60:13)"
          },
          "14": {
            "text": "The sons also of them that afflicted thee shall come bending unto thee; and all they that despised thee shallbowthemselves down at the soles of thy feet; and they shall call thee, The city of theLord, The Zion of the Holy One of Israel.",
            "citation": "(Isaiah 60:14)"
          },
          "15": {
            "text": "Whereas thou hast beenforsakenand hated, so that no man went throughthee,I will make thee an eternal excellency, joy of many generations.",
            "citation": "(Isaiah 60:15)"
          },
          "16": {
            "text": "Thou shalt also suck themilkof the Gentiles, and shalt suck the breast ofkings: and thou shalt know that I theLordamthySaviourand thy Redeemer, the mighty One of Jacob.",
            "citation": "(Isaiah 60:16)"
          },
          "17": {
            "text": "For brass I will bring gold, and for iron I will bring silver, and for wood brass, and for stones iron: I will also make thy officers peace, and thine exactors righteousness.",
            "citation": "(Isaiah 60:17)"
          },
          "18": {
            "text": "Violenceshall no more be heard in thy land, wasting nor destruction within thy borders; but thou shalt call thywallsSalvation, and thy gatesPraise.",
            "citation": "(Isaiah 60:18)"
          },
          "19": {
            "text": "Thesunshall be no more thy light by day; neither for brightness shall the moon give light unto thee: but theLordshall be unto thee an everlastinglight, and thy God thy glory.",
            "citation": "(Isaiah 60:19)"
          },
          "20": {
            "text": "Thy sun shall no more go down; neither shall thy moon withdraw itself: for theLordshall be thineeverlastinglight, and the days of thymourningshall be ended.",
            "citation": "(Isaiah 60:20)"
          },
          "21": {
            "text": "Thy people alsoshall beallrighteous: they shall inherit thelandforever, thebranchof my planting, theworkof my hands, that I may be glorified.",
            "citation": "(Isaiah 60:21)"
          },
          "22": {
            "text": "Alittle oneshall become thousand, and small one astrongnation: I theLordwill hasten it inhistime.",
            "citation": "(Isaiah 60:22)"
          }
        }
      },
      "61": {
        "verses": {
          "1": {
            "text": "TheSpiritof the LordGodisupon me; because theLordhathanointedme topreachgood tidingsunto themeek; he hath sent me tobindup the brokenhearted, toproclaimlibertyto thecaptives, and the opening of theprisontothem that arebound;",
            "citation": "(Isaiah 61:1)"
          },
          "2": {
            "text": "To proclaim the acceptable year of theLord, and the day ofvengeanceof our God; tocomfortall thatmourn;",
            "citation": "(Isaiah 61:2)"
          },
          "3": {
            "text": "To appoint unto them that mourn in Zion, to give unto thembeautyfor ashes, the oil ofjoyfor mourning, the garment of praise for the spirit of heaviness; that they might be calledtreesofrighteousness, theplantingof theLord, that he might be glorified.",
            "citation": "(Isaiah 61:3)"
          },
          "4": {
            "text": "And they shallbuildthe old wastes, they shall raise up the former desolations, and they shall repair the waste cities, the desolations of many generations.",
            "citation": "(Isaiah 61:4)"
          },
          "5": {
            "text": "And strangers shall stand and feed your flocks, and the sons of the alienshall beyour plowmen and your vinedressers.",
            "citation": "(Isaiah 61:5)"
          },
          "6": {
            "text": "But ye shall be named thePriestsof theLord:menshall call you the Ministers of our God: ye shall eat therichesof the Gentiles, and in their glory shall ye boast yourselves.",
            "citation": "(Isaiah 61:6)"
          },
          "7": {
            "text": "For your shameye shall havedouble; andforconfusion they shall rejoice in their portion: therefore in their land they shall possessthe double: everlasting joy shall be unto them.",
            "citation": "(Isaiah 61:7)"
          },
          "8": {
            "text": "For I theLordlovejudgment, I hate robbery for burnt offering; and I will direct their work in truth, and I will make an everlastingcovenantwith them.",
            "citation": "(Isaiah 61:8)"
          },
          "9": {
            "text": "And their seed shall be known among the Gentiles, and their offspring among the people: all that see them shall acknowledge them, that theyaretheseedwhichtheLordhath blessed.",
            "citation": "(Isaiah 61:9)"
          },
          "10": {
            "text": "I will greatly rejoice in theLord, my soul shall be joyful in my God; for he hathclothedme with thegarmentsof salvation, he hath covered me with the robe of righteousness, as bridegroom deckethhimselfwith ornaments, and as bride adornethherselfwith her jewels.",
            "citation": "(Isaiah 61:10)"
          },
          "11": {
            "text": "For as the earth bringeth forth her bud, and as the garden causeth the things that are sown in it to spring forth; so the LordGodwill cause righteousness andpraiseto spring forth before all the nations.",
            "citation": "(Isaiah 61:11)"
          }
        }
      },
      "62": {
        "verses": {
          "1": {
            "text": "For Zions sake will I not hold my peace, and for Jerusalems sake I will not rest, until the righteousness thereof go forth as brightness, andthe salvation thereof as lampthatburneth.",
            "citation": "(Isaiah 62:1)"
          },
          "2": {
            "text": "And the Gentiles shallseethy righteousness, and all kings thy glory: and thou shalt be called by newname, which the mouth of theLordshall name.",
            "citation": "(Isaiah 62:2)"
          },
          "3": {
            "text": "Thou shalt also be acrownof glory in the hand of theLord, and royal diadem in the hand of thy God.",
            "citation": "(Isaiah 62:3)"
          },
          "4": {
            "text": "Thou shalt no more be termedForsaken; neither shall thylandany more be termed Desolate: but thou shalt be calledHephzi-bah, and thy landBeulah: for theLorddelighteth in thee, and thy land shall be married.",
            "citation": "(Isaiah 62:4)"
          },
          "5": {
            "text": "Forasa young man marrieth virgin,soshall thy sons marry thee: andasthe bridegroom rejoiceth over the bride,soshall thy Godrejoiceover thee.",
            "citation": "(Isaiah 62:5)"
          },
          "6": {
            "text": "I have setwatchmenupon thy walls, O Jerusalem,whichshall never hold their peace day nor night: ye that make mention of theLord, keep not silence,",
            "citation": "(Isaiah 62:6)"
          },
          "7": {
            "text": "And give him no rest, till he establish, and till he make Jerusalem apraisein the earth.",
            "citation": "(Isaiah 62:7)"
          },
          "8": {
            "text": "TheLordhath sworn by his right hand, and by the arm of his strength, Surely I will no more give thy cornto bemeat for thine enemies; and the sons of the stranger shall not drink thy wine, for the which thou hast laboured:",
            "citation": "(Isaiah 62:8)"
          },
          "9": {
            "text": "But they that have gathered it shall eat it, and praise theLord; and they that have brought it together shall drink it in the courts of myholiness.",
            "citation": "(Isaiah 62:9)"
          },
          "10": {
            "text": "Go through, go through the gates;prepareye the way of the people; cast up, cast up thehighway; gather out the stones; lift up astandardfor the people.",
            "citation": "(Isaiah 62:10)"
          },
          "11": {
            "text": "Behold, theLordhath proclaimed unto the end of theworld, Say ye to thedaughterof Zion, Behold, thysalvationcometh; behold, hisrewardiswith him, and his work before him.",
            "citation": "(Isaiah 62:11)"
          },
          "12": {
            "text": "And they shall call them, The holy people, The redeemed of theLord: and thou shalt be called, Sought out, A city not forsaken.",
            "citation": "(Isaiah 62:12)"
          }
        }
      },
      "63": {
        "verses": {
          "1": {
            "text": "Whoisthis thatcomethfromEdom, with dyed garments from Bozrah? thisthat isglorious in his apparel, travelling in the greatness of his strength? I that speak in righteousness, mighty to save.",
            "citation": "(Isaiah 63:1)"
          },
          "2": {
            "text": "Whereforeart thouredin thine apparel, and thy garments like him that treadeth in thewinefat?",
            "citation": "(Isaiah 63:2)"
          },
          "3": {
            "text": "I have trodden thewinepressalone; and of the peoplethere wasnone with me: for I will tread them in mine anger, and trample them in my fury; and their blood shall besprinkledupon my garments, and I will stain all my raiment.",
            "citation": "(Isaiah 63:3)"
          },
          "4": {
            "text": "For the day ofvengeanceisin mine heart, and the year of myredeemedis come.",
            "citation": "(Isaiah 63:4)"
          },
          "5": {
            "text": "And I looked, andthere wasnone to help; and I wondered thatthere wasnone to uphold: therefore mine own arm broughtsalvationunto me; and my fury, it upheld me.",
            "citation": "(Isaiah 63:5)"
          },
          "6": {
            "text": "And I will tread down the people in mine anger, andmake them drunkin my fury, and I will bring down their strength to the earth.",
            "citation": "(Isaiah 63:6)"
          },
          "7": {
            "text": "I will mention thelovingkindnessesof theLord,andthe praises of theLord, according to all that theLordhath bestowed on us, and the greatgoodnesstoward the house of Israel, which he hath bestowed on them according to his mercies, and according to the multitude of his lovingkindnesses.",
            "citation": "(Isaiah 63:7)"
          },
          "8": {
            "text": "For he said, Surely theyaremy people, childrenthatwill not lie: so he was theirSaviour.",
            "citation": "(Isaiah 63:8)"
          },
          "9": {
            "text": "In all theirafflictionhe was afflicted, and theangelof hispresencesaved them: in hisloveand in his pity heredeemedthem; and he bare them, andcarriedthem all the days of old.",
            "citation": "(Isaiah 63:9)"
          },
          "10": {
            "text": "But theyrebelled, andvexedhisholy Spirit: therefore he was turned to be theirenemy,andhe fought against them.",
            "citation": "(Isaiah 63:10)"
          },
          "11": {
            "text": "Thenhe rememberedthe days of old, Moses,andhis people,saying,Whereishe that brought them up out of theseawith theshepherdof hisflock? whereishe that put his holy Spirit withinhim?",
            "citation": "(Isaiah 63:11)"
          },
          "12": {
            "text": "That ledthemby the right hand ofMoseswith his glorious arm,dividingthe water before them, to make himself an everlasting name?",
            "citation": "(Isaiah 63:12)"
          },
          "13": {
            "text": "That led them through the deep, as an horse in the wilderness,thatthey should not stumble?",
            "citation": "(Isaiah 63:13)"
          },
          "14": {
            "text": "As beast goethdown into the valley, theSpiritof theLordcausedhimto rest: so didst thou lead thy people, to make thyself gloriousname.",
            "citation": "(Isaiah 63:14)"
          },
          "15": {
            "text": "Lookdown from heaven, and behold from the habitation of thyholinessand of thy glory: whereisthy zeal and thy strength,thesounding of thy bowels and of thy mercies toward me? are they restrained?",
            "citation": "(Isaiah 63:15)"
          },
          "16": {
            "text": "Doubtless thouartourfather, though Abrahambe ignorantof us, and Israel acknowledge us not: thou, OLord,artour father, our redeemer; thy nameisfromeverlasting.",
            "citation": "(Isaiah 63:16)"
          },
          "17": {
            "text": "OLord, why hast thoumadeus to err from thy ways,andhardenedour heart from thy fear? Return for thy servants sake, the tribes of thine inheritance.",
            "citation": "(Isaiah 63:17)"
          },
          "18": {
            "text": "Thepeopleof thy holiness have possesseditbut little while: our adversaries havetroddendown thy sanctuary.",
            "citation": "(Isaiah 63:18)"
          },
          "19": {
            "text": "We arethine:thou never barest rule over them; they were not called by thyname.",
            "citation": "(Isaiah 63:19)"
          }
        }
      },
      "64": {
        "verses": {
          "1": {
            "text": "Oh that thou wouldestrendthe heavens, that thou wouldest come down, that themountainsmight flow down at thypresence,",
            "citation": "(Isaiah 64:1)"
          },
          "2": {
            "text": "Aswhenthe melting fire burneth, the fire causeth the waters to boil, to make thy name known to thine adversaries,thatthe nations maytrembleat thy presence!",
            "citation": "(Isaiah 64:2)"
          },
          "3": {
            "text": "When thou didstterriblethingswhichwe looked not for, thou camest down, themountainsflowed down at thy presence.",
            "citation": "(Isaiah 64:3)"
          },
          "4": {
            "text": "For since the beginning of the worldmenhave not heard, nor perceived by the ear, neither hath theeyeseen, O God, beside thee,whathe hathpreparedfor him that waiteth for him.",
            "citation": "(Isaiah 64:4)"
          },
          "5": {
            "text": "Thou meetest him that rejoiceth and worketh righteousness,those thatremember thee in thy ways: behold, thou art wroth; for we have sinned: in those is continuance, and we shall be saved.",
            "citation": "(Isaiah 64:5)"
          },
          "6": {
            "text": "But we are all as anuncleanthing,and all our righteousnessesareasfilthyrags; and we all do fade as leaf; and our iniquities, like the wind, have taken us away.",
            "citation": "(Isaiah 64:6)"
          },
          "7": {
            "text": "Andthere isnone that calleth upon thy name, that stirreth up himself to take hold of thee: for thou hast hid thyfacefrom us, and hast consumed us, because of our iniquities.",
            "citation": "(Isaiah 64:7)"
          },
          "8": {
            "text": "But now, OLord, thouartourfather; wearethe clay, and thou our potter; and we allaretheworkof thy hand.",
            "citation": "(Isaiah 64:8)"
          },
          "9": {
            "text": "Be not wroth very sore, OLord, neither remember iniquity for ever: behold, see, we beseech thee, weareall thypeople.",
            "citation": "(Isaiah 64:9)"
          },
          "10": {
            "text": "Thy holy cities are wilderness, Zion is wilderness, Jerusalem desolation.",
            "citation": "(Isaiah 64:10)"
          },
          "11": {
            "text": "Our holy and ourbeautifulhouse, where our fathers praised thee, isburnedup with fire: and all our pleasant things are laidwaste.",
            "citation": "(Isaiah 64:11)"
          },
          "12": {
            "text": "Wilt thourefrainthyself for thesethings,OLord? wilt thou hold thy peace, and afflict us very sore?",
            "citation": "(Isaiah 64:12)"
          }
        }
      },
      "65": {
        "verses": {
          "1": {
            "text": "I amsoughtofthem thatasked notfor me;I am found ofthem thatsought me not: I said, Behold me, behold me, unto nationthatwas not called by myname.",
            "citation": "(Isaiah 65:1)"
          },
          "2": {
            "text": "I have spread out my hands all the day unto arebelliouspeople, which walketh in waythat wasnot good, after their own thoughts;",
            "citation": "(Isaiah 65:2)"
          },
          "3": {
            "text": "A people that provoketh me toangercontinually to my face; that sacrificeth in gardens, and burneth incense upon altars ofbrick;",
            "citation": "(Isaiah 65:3)"
          },
          "4": {
            "text": "Which remainamong the graves, and lodge in the monuments, which eat swines flesh, and broth of abominablethings is intheir vessels;",
            "citation": "(Isaiah 65:4)"
          },
          "5": {
            "text": "Which say, Stand by thyself, come not near to me; for I amholierthan thou. Thesearea smoke in my nose, fire that burneth all the day.",
            "citation": "(Isaiah 65:5)"
          },
          "6": {
            "text": "Behold,it iswritten before me: I will not keep silence, but willrecompense, even recompense into their bosom,",
            "citation": "(Isaiah 65:6)"
          },
          "7": {
            "text": "Your iniquities, and the iniquities of your fathers together, saith theLord, which have burned incense upon the mountains, andblasphemedme upon the hills: therefore will I measure their former work into their bosom.",
            "citation": "(Isaiah 65:7)"
          },
          "8": {
            "text": "Thus saith theLord, As thenew wineis found in the cluster, andonesaith, Destroy it not; for blessingisin it: so will I do for my servants sakes, that I maynotdestroy them all.",
            "citation": "(Isaiah 65:8)"
          },
          "9": {
            "text": "And I will bring forth seed out of Jacob, and out ofJudahan inheritor of my mountains: and mineelectshallinheritit, and my servants shall dwell there.",
            "citation": "(Isaiah 65:9)"
          },
          "10": {
            "text": "And Sharon shall be fold of flocks, and the valley ofAchora place for the herds to lie down in, for my people that have sought me.",
            "citation": "(Isaiah 65:10)"
          },
          "11": {
            "text": "But yearethey that forsake theLord, that forget my holy mountain, that prepare table for thattroop, and that furnish the drink offering unto thatnumber.",
            "citation": "(Isaiah 65:11)"
          },
          "12": {
            "text": "Therefore will I number you to the sword, and ye shall all bow down to the slaughter: because when Icalled, ye did not answer; when I spake, ye did not hear; but did evil before mine eyes, and did choosethatwherein I delighted not.",
            "citation": "(Isaiah 65:12)"
          },
          "13": {
            "text": "Therefore thus saith the LordGod, Behold, my servants shall eat, but ye shall be hungry: behold, my servants shall drink, but ye shall be thirsty: behold, my servants shall rejoice, but ye shall be ashamed:",
            "citation": "(Isaiah 65:13)"
          },
          "14": {
            "text": "Behold, my servants shall sing for joy of heart, but ye shall cry for sorrow of heart, and shallhowlfor vexation of spirit.",
            "citation": "(Isaiah 65:14)"
          },
          "15": {
            "text": "And ye shall leave your name for acurseunto my chosen: for the LordGodshall slay thee, and call his servants by anothername:",
            "citation": "(Isaiah 65:15)"
          },
          "16": {
            "text": "That he whoblesseth himselfin the earth shall bless himself in the God of truth; and he that sweareth in the earth shallswearby the God of truth; because the former troubles are forgotten, and because they are hid from mine eyes.",
            "citation": "(Isaiah 65:16)"
          },
          "17": {
            "text": "For, behold, Icreatenewheavensand anewearth: and theformershall not be remembered, nor come into mind.",
            "citation": "(Isaiah 65:17)"
          },
          "18": {
            "text": "But be ye glad and rejoice for everin thatwhich I create: for, behold, I create Jerusalem arejoicing, and her people joy.",
            "citation": "(Isaiah 65:18)"
          },
          "19": {
            "text": "And I willrejoicein Jerusalem, and joy in my people: and the voice of weeping shall be no more heard in her, nor the voice of crying.",
            "citation": "(Isaiah 65:19)"
          },
          "20": {
            "text": "There shall be no more thence an infant of days, nor anoldman that hath not filled his days: for thechildshall die an hundred years old; but the sinnerbeingan hundred years old shall be accursed.",
            "citation": "(Isaiah 65:20)"
          },
          "21": {
            "text": "And they shall build houses, and inhabitthem;and they shall plant vineyards, andeatthe fruit of them.",
            "citation": "(Isaiah 65:21)"
          },
          "22": {
            "text": "They shall not build, and another inhabit; they shall not plant, and another eat: for as the days of atreearethe days of my people, and mine elect shall long enjoy the work of their hands.",
            "citation": "(Isaiah 65:22)"
          },
          "23": {
            "text": "They shall notlabourin vain,nor bring forth for trouble; for theyaretheseedof the blessed of theLord, and theiroffspringwith them.",
            "citation": "(Isaiah 65:23)"
          },
          "24": {
            "text": "And it shall come to pass, that before they call, I willanswer; and while they are yet speaking, I will hear.",
            "citation": "(Isaiah 65:24)"
          },
          "25": {
            "text": "Thewolfand the lamb shallfeedtogether, and the lion shall eat straw like the bullock: and dustshall bethe serpents meat. They shall nothurtnor destroy in all my holy mountain, saith theLord.",
            "citation": "(Isaiah 65:25)"
          }
        }
      },
      "66": {
        "verses": {
          "1": {
            "text": "Thus saith theLord, The heavenismythrone, and the earthismy footstool: whereisthe house that ye build unto me? and whereisthe place of my rest?",
            "citation": "(Isaiah 66:1)"
          },
          "2": {
            "text": "For all thosethingshath mine hand made, and all thosethingshave been, saith theLord: but to thismanwill I look,eventohim that ispoor and of acontrite spirit, and trembleth at my word.",
            "citation": "(Isaiah 66:2)"
          },
          "3": {
            "text": "Hethat killeth an oxis as ifhe slew man; he that sacrificeth lamb,as ifhe cut off dogs neck; he that offereth an oblation,as if he offeredswines blood; he that burneth incense,as ifhe blessed an idol. Yea, they have chosen their own ways, and their soul delighteth in their abominations.",
            "citation": "(Isaiah 66:3)"
          },
          "4": {
            "text": "Ialso will choose their delusions, and will bring their fears upon them; because when Icalled, none did answer; when I spake, they did not hear: but they did evil before mine eyes, and chosethatin which I delighted not.",
            "citation": "(Isaiah 66:4)"
          },
          "5": {
            "text": "Hear the word of theLord, ye that tremble at his word; Your brethren that hated you, thatcastyou out for my names sake, said, Let theLordbeglorified: but he shall appear to your joy, and they shall be ashamed.",
            "citation": "(Isaiah 66:5)"
          },
          "6": {
            "text": "A voice of noise from the city, voice from the temple, voice of theLordthat rendereth recompence to his enemies.",
            "citation": "(Isaiah 66:6)"
          },
          "7": {
            "text": "Beforeshetravailed, she brought forth; before her pain came, she was delivered of manchild.",
            "citation": "(Isaiah 66:7)"
          },
          "8": {
            "text": "Who hath heard such thing? who hath seen such things? Shall the earth be made to bring forth in one day?orshall nation be born at once? for as soon as Zion travailed, she brought forth her children.",
            "citation": "(Isaiah 66:8)"
          },
          "9": {
            "text": "Shall I bring to the birth, and not cause to bring forth? saith theLord: shall I cause to bring forth, and shutthe womb?saith thy God.",
            "citation": "(Isaiah 66:9)"
          },
          "10": {
            "text": "Rejoice ye with Jerusalem, and be glad with her, all ye that love her: rejoice for joy with her, all ye that mourn for her:",
            "citation": "(Isaiah 66:10)"
          },
          "11": {
            "text": "That ye may suck, and be satisfied with the breasts of her consolations; that ye may milk out, and be delighted with the abundance of her glory.",
            "citation": "(Isaiah 66:11)"
          },
          "12": {
            "text": "For thus saith theLord, Behold, I will extend peace to herlike river, and the glory of theGentileslike flowing stream: then shall ye suck, ye shall be borne uponhersides, and be dandled uponherknees.",
            "citation": "(Isaiah 66:12)"
          },
          "13": {
            "text": "As one whom hismothercomforteth, so will Icomfortyou; and ye shall becomfortedin Jerusalem.",
            "citation": "(Isaiah 66:13)"
          },
          "14": {
            "text": "And when ye seethis,your heart shall rejoice, and your bones shall flourish like an herb: and thehandof theLordshall be known toward his servants, andhisindignationtoward his enemies.",
            "citation": "(Isaiah 66:14)"
          },
          "15": {
            "text": "For, behold, theLordwill come withfire, and with hischariotslike whirlwind, to render his anger with fury, and his rebuke with flames of fire.",
            "citation": "(Isaiah 66:15)"
          },
          "16": {
            "text": "For by fire and by hisswordwilltheLordpleadwith all flesh: and theslainof theLordshall be many.",
            "citation": "(Isaiah 66:16)"
          },
          "17": {
            "text": "They that sanctify themselves, and purify themselves in the gardens behind onetreein the midst, eating swines flesh, and theabomination, and themouse, shall be consumed together, saith theLord.",
            "citation": "(Isaiah 66:17)"
          },
          "18": {
            "text": "For Iknowtheirworksand their thoughts: it shall come, that I will gatherallnations and tongues; and they shall come, and see my glory.",
            "citation": "(Isaiah 66:18)"
          },
          "19": {
            "text": "And I will set asignamong them, and I will send those that escape of them unto the nations,toTarshish, Pul, andLud, that draw the bow,toTubal, and Javan,tothe isles afar off, that have not heard my fame, neither have seen my glory; and they shalldeclaremy glory among theGentiles.",
            "citation": "(Isaiah 66:19)"
          },
          "20": {
            "text": "And they shall bring all your brethrenforanofferingunto theLordout of all nations upon horses, and in chariots, and in litters, and upon mules, and upon swift beasts, to my holy mountain Jerusalem, saith theLord, as the children of Israel bring an offering in clean vessel into the house of theLord.",
            "citation": "(Isaiah 66:20)"
          },
          "21": {
            "text": "And I will also take of them forpriestsandfor Levites, saith theLord.",
            "citation": "(Isaiah 66:21)"
          },
          "22": {
            "text": "For as thenewheavens and the new earth, which I will make, shall remain before me, saith theLord, so shall yourseedand your name remain.",
            "citation": "(Isaiah 66:22)"
          },
          "23": {
            "text": "And it shall come to pass,thatfrom one new moon to another, and from one sabbath to another, shall all flesh come toworshipbefore me, saith theLord.",
            "citation": "(Isaiah 66:23)"
          },
          "24": {
            "text": "And they shall go forth, and look upon the carcases of the men that have transgressed against me: for theirwormshall not die, neither shall theirfirebe quenched; and they shall be an abhorring unto all flesh.",
            "citation": "(Isaiah 66:24)"
          }
        }
      }
    }
  },
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 61487,
  "total_sources": 11,
  "generated_at": "2025-12-14T04:01:27.396754"
}