{
  "week_number": 50,
  "date_range": "Haggai 1–2",
  "title": ";Zechariah 1–4;7–14",
  "primary_scriptures": [
    {
      "book": "Zechariah",
      "chapters": [
        "1",
        "2",
        "3",
        "4"
      ],
      "verses": null,
      "book_type": "old_testament"
    }
  ],
  "all_content": "\n\n--- CFM: ;Zechariah 1–4;7–14 ---\nAfter decades of captivity, a group of Israelites, probably including the prophets Haggai and Zechariah, were allowed to return to Jerusalem. Some in this group remembered what the temple looked like before it was destroyed. To those who wondered whether it would ever again resemble the Lord’s “house in her first glory” (\nHaggai 2:3\n), Haggai spoke the Lord’s words of encouragement: “Be strong, all ye people of the land, saith the Lord, and work: for I am with you, … fear ye not.” “I will fill this house with glory, … and in this place will I give peace” (\nHaggai 2:4–5, 7, 9\n).\nBut it wasn’t just the holy temple that needed rebuilding. In many ways, God’s people were spiritually in ruins. And rebuilding a holy people takes more than cutting stones and positioning them to build a holy house. It means the inscription “Holiness unto the Lord” must be engraved not just on a temple wall, or even on “the bells of the horses” and “every pot in Jerusalem” (\nZechariah 14:20–21\n). They must also be engraved on every heart.\nFor an overview of the books of Haggai and Zechariah, see “\nHaggai\n” and “\nZechariah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nHaggai 1\n;\n2:1–9\n“Consider your ways.”\nThere were many important things to do to rebuild Jerusalem. But after roughly 15 years had passed since the Israelites’ return, the Lord was displeased that the rebuilding of the temple had not been given higher priority (see\nHaggai 1:2–5\n; see also\nEzra 4:24\n). As you read\nHaggai 1\n;\n2:1–9\n, consider questions like these:\nWhat consequences did the Israelites face because they had not finished the temple?\nWhat blessings did the Lord promise them if they finished building His house?\nWhat is the Lord’s message to you in\nHaggai 1:5–7\n? How could you align your priorities with the Lord’s? When have you been blessed for putting God first in your life?\nThe early Latter-day Saints faced a similar situation to the Israelites in Haggai’s day (see\nDoctrine and Covenants 95\n). What do you learn from these two examples about the Lord’s feelings about temples?\nSee also Dale G. Renlund, “\nJesus Christ Is the Treasure\n,”\nLiahona\n, Nov. 2023, 96–99; Terence M. Vinson, “\nTrue Disciples of the Savior\n,”\nEnsign\nor\nLiahona\n, Nov. 2019, 9–11; “\nWe Love Thy House, O God\n,”\nHymns\n, no. 247; “Provo City Center Temple Completed” (video),\nChurchofJesusChrist.org\n.\n7:17\nProvo City Center Temple Completed\nZechariah 1–3\n;\n7–8\n;\n14\nThe Lord can make me holy.\nIn your opinion, what’s the value of having “holiness unto the Lord” engraved on everyday objects like those mentioned in\nZechariah 14:20\n? (see also\nExodus 28:36–38\n). What’s the value of having it engraved on temples today? What does this phrase mean to you? How can you make holiness part of your daily life? Ponder these questions as you read the Lord’s invitations to His people to become more holy in\nZechariah 1:1–6\n;\n3:1–7\n;\n7:8–10\n;\n8:16–17\n.\nYou could also read\nZechariah 2:10–11\n;\n8:1–8\n;\n14:9–11, 20–21\nto learn what life will be like in a future day when we all dwell with the Lord in a state of holiness. What impresses you about Zechariah’s vision of the future of Jerusalem? What do you find here that you would like to see in your community? How can you prepare to live in the conditions Zechariah described?\n“Behold, thy King cometh unto thee: he is just, and having salvation; lowly, and riding upon an ass” (\nZechariah 9:9\n).\nTriumphal Entry\n, by Harry Anderson\nZechariah 9:9–11\n;\n11:12–13\n;\n12:10\n;\n13:6–7\n;\n14:1–9\nJesus Christ is the promised Messiah.\nSeveral of Zechariah’s writings point both to the earthly ministry of Jesus Christ and to His eventual Second Coming. Below are some of Zechariah’s prophecies, along with scriptures about their fulfillment. As you study these passages, ask yourself: What does this teach me about the Savior?\nZechariah 9:9–11\n(see\nMatthew 21:1–11\n;\n1 Peter 3:18–19\n)\nZechariah 11:12–13\n(see\nMatthew 26:14–16\n;\n27:1–7\n)\nZechariah 12:10\n(see\nJohn 19:37\n;\nRevelation 1:7\n)\nZechariah 13:6–7\n;\n14:1–9\n(see\nMatthew 26:31\n;\nDoctrine and Covenants 45:47–53\n)\nWhat do you think it would have been like to be among the people welcoming Jesus into Jerusalem as described in\nZechariah 9:9–11\n? How can you welcome Him into your life, your homes, and your community?\nSee also Guide to the Scriptures, “\nMessiah\n,” Gospel Library; “The Lord’s Triumphal Entry into Jerusalem” (video), Gospel Library; Ronald A. Rasband, “\nHosanna to the Most High God\n,”\nLiahona\n, May 2023, 108–12.\n1:22\nThe Lord's Triumphal Entry into Jerusalem\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nHaggai 1:2–8\n“Consider your ways.”\nAs you read parts of\nHaggai 1:2–5\nwith your children, help them find out why the Lord was not pleased with the people. Perhaps your children could pick a phrase from\nverse 6\nand draw a picture of it. They could show it to each other and guess what phrase each drawing represents. When we spend time on things other than what the Lord wants, how is that like eating but not being filled? You might talk with each other about how you can make time for the things that are important to the Lord.\nYou could also read\nverse 8\nto your children and invite them to pretend to “go up to the mountain,” “bring wood,” and “build the house [of the Lord].” Your children could make a list of things they do in a typical day, including things the Lord has asked them to do. Ask your children to “consider [their] ways” by circling what the Lord might say are the most important things on their list.\nHome-centered teaching.\nPresident Russell M. Nelson has taught that the home should be the “center of gospel learning” (“\nBecoming Exemplary Latter-day Saints\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 113). As your family studies Haggai’s counsel to “consider your ways,” you could talk about how to put God first in your family life.\nZechariah 3:1–7\nMaking and keeping covenants can help me be more like Heavenly Father and Jesus Christ.\nIn a vision, Zechariah saw a high priest who was “clothed with filthy garments” (\nZechariah 3:3\n). An angel gave him clean clothing. You could help your children discover important truths by reading together\nZechariah 3:1–7\nand talking about what the dirty clothing and clean clothing might represent. How do we become clean from our sins, even after we are baptized? How does our baptismal covenant help us “walk in [the Lord’s] ways”?\nYou and your children could look at a picture of a baptism, like the one in this outline. Why do we wear white at our baptism? You could also sing a song about baptism, such as “\nWhen I Am Baptized\n” (\nChildren’s Songbook\n, 103); what does the song teach about why the Lord wants us to be baptized?\nZechariah 9:9–11\n;\n11:12\n;\n13:6–7\nJesus Christ is the promised Messiah.\nYour children might like to visualize the event foretold in\nZechariah 9:9\n, when Jesus came into Jerusalem during the last week of His mortal life. To help with this, show them a picture of the event, like the one in this outline. You could also share with them “\nThe Savior Goes to Jerusalem\n” (in\nNew Testament Stories\n, 110–12). Your children could point to people in the pictures who are “rejoicing greatly.” Who is the King in\nZechariah 9:9\n? Why are we thankful for Him?\n1:35\nChapter 44: The Savior Goes to Jerusalem\nConsider helping your children compare prophecies from Zechariah with the New Testament verses describing their fulfillment. Here are some examples:\nZechariah 9:9\nand\nMatthew 21:5–9\n;\nZechariah 9:11\nand\n1 Peter 3:18–19\n;\nZechariah 11:12\nand\nMatthew 26:14–16\n;\nZechariah 13:7\nand\nMatthew 26:31\n. What do we learn about the Savior from these verses?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n\n\n--- SEMINARY_TEACHER: Seminary Teacher Week 50: Lesson 155: Lesson 155—HaggaiThis lesson can help students put God first in their lives.; Lesson 156: Lesson 156—Zechariah 1–8This lesson can help students understand ways they can turn to the Lord.... ---\n\n--- Lesson 155 ---\nIn our busy lives, how can we make time for the Lord and the things He asks us to do? We can benefit from following the Lord’s invitation to the Jews to “consider [our] ways” ( Haggai 1:5 ) regarding how we make time for Him. This lesson can help students put God first in their lives. Student preparation: Invite students to make a list of things they do on a typical day. Students could label which things they feel are most important and ponder why they consider those things important. They could bring their lists to class. Possible Learning Activities Prioritizing the Lord The following object lesson is in the article “ Making Good Use of Your Time ” ( New Era , July 2020, 34–35). Before class, fill a jar with rocks, then add sand to the top, shaking it to settle. This is to ensure you have enough sand to fill the jar. Then, separate the sand and rocks again. Bring the jar, sand, and rocks to class. As class begins, show the items to students, explaining that the jar represents our time, the rocks our priorities, and the sand our daily activities. What are things you spend your time doing each day? What are things the Lord asks each of us to prioritize? Students might respond to the second question with answers such as scripture study, prayer, family time, service, and so on. Consider writing students’ answers on the rocks. To help students see the value of prioritizing, first fill the jar with sand. Then try adding the rocks, which won’t fit. Discuss how to fit both. Empty the jar and try again. Add the rocks first, then the sand, shaking the jar to settle in the gaps. What can we learn from this object lesson? Why can it be difficult to make time for the Lord and the things He asks us to do each day? As you study Haggai, look for inspiration from the Holy Ghost about how the Lord can bless your life as you make time for Him. Rebuilding the temple To help your students understand the context of Haggai, consider sharing the following summary. After the Jews returned to Jerusalem from their captivity in Babylon, they put great effort into rebuilding their temple, city, homes, and lives (see Ezra 1:1–6 ). But after about 15 years had passed, the Lord was displeased that they had not given higher priority to rebuilding the temple (see Ezra 4:24 ; Haggai 1:3–4 ). He sent His prophet Haggai to persuade the people to prioritize building the Lord’s house. Read Haggai 1:2–4 , looking for words or phrases that show that the Jews were not focused on rebuilding the temple. You might need to explain that “ceiled” means paneled. This might indicate that while they left the temple unfinished, the people built comfortable and well-furnished houses for themselves. How might this relate to the object lesson? Read Haggai 1:5–11 , looking for consequences the Jews faced because they prioritized other things instead of rebuilding the temple. What are some consequences we might experience if we don’t prioritize the Lord in our lives? You could invite students to point out or mark the repeated phrase in verses 5 and 7 . What do you think the Lord meant when He invited the people to “consider [their] ways”? ( Haggai 1:5, 7 ) “From this day will I bless you” Consider reading or summarizing the following paragraph to help students understand the remainder of the account. The Jews and their leaders obeyed the voice of the Lord. Zerubbabel (the governor) and Joshua (the high priest) led the efforts to rebuild the temple (see Haggai 1:12–14 ). The prophet Haggai helped too (see Ezra 5:1–2 ). As they worked, the Lord offered words of encouragement. Write the following incomplete truth on the board: If we put God first in our lives … Consider dividing the class into three sections, with each section reading one of the following passages. Read one or more of the following passages, looking for encouragement from the Lord that can complete the sentence on the board: Haggai 2:4–5 Haggai 2:6–9 Haggai 2:18–19 Students could come to the board and write how they would complete the statement. The following are examples of what they might write: … He will be with us. … He will give us peace. … He will bless us spiritually and temporally. To find additional blessings that we can receive by putting God first, students could read Mosiah 2:41 and 3 Nephi 13:31–33 . You could then add what they find to the board. Which of the Lord’s blessings from these verses do you want most? Why? Help students recognize ways they can put God first to invite His blessings. If you did not show the video “ The Soul’s Sincere Desire ” (3:28) when you taught Lesson 93: “ Nehemiah ,” then consider showing it here from time code 0:00 to 2:01. This video is available at ChurchofJesusChrist.org . You could invite students to look for ways they could respond to the questions below. 3:29 Alternatively, you could share the following scenario. Students can then answer the accompanying questions in pairs, small groups, or as a class. Imagine you have a friend named Alex who feels she does not have any time to prioritize God in her life. Her days are filled with schoolwork, friends, and hobbies, leaving her exhausted and unmotivated for spiritual things. She sees a need to change but doesn’t know what to do. What advice would you give Alex to help her put God first? How might God bless her for putting Him first? After enough time, you could show the rest of “ The Soul’s Sincere Desire ” from time code 2:02 to 3:28, inviting students to look for what Alex does to change. 3:29 What other advice would you give someone who feels they cannot put God first in their life for any other reason? How has God blessed you or others you know from putting Him first? Make a plan This section can help students apply what they learned. Consider displaying the following statement. Personally reflect on the following invitation from Elder David A. Bednar of the Quorum of the Twelve Apostles: 13:57 I repeat the admonition of the Lord to His people delivered through the Old Testament prophet Haggai: “Now therefore thus saith the Lord of hosts; Consider your ways” [ Haggai 1:5 ]. Each of us should evaluate our temporal and spiritual priorities sincerely and prayerfully to identify the things in our lives that may impede the bounteous blessings that Heavenly Father and the Savior are willing to bestow upon us. And surely the Holy Ghost will help us to see ourselves as we really are. (“ Put On Thy Strength, O Zion ,” Liahona , Nov. 2022, 94) Act on the Lord’s invitation to “consider your ways” ( Haggai 1:5, 7 ) by pondering your own priorities. Ponder if there are things you need to prioritize or remove from your life to invite blessings Heavenly Father and Jesus Christ are willing to give you. In your journal, sketch a jar with rocks, and label the rocks with commitments you will make to prioritize God. Draw sand outside the jar, and label it with things you’d like to eliminate. Choose a rock or two and plan what, when, and how you will fulfill these commitments. Consider sharing your testimony or thoughts about Heavenly Father and Jesus Christ’s blessings as we put Them first in our lives.\n\n\n--- Lesson 156 ---\nAfter 50 years of captivity in Babylon and Persia, a remnant of the house of Israel had physically returned to their holy land, but spiritually they were still far from the Lord. Through the prophet Zechariah, the Savior renewed His invitation, “turn ye unto me” ( Zechariah 1:3 ), with the promise that He would “dwell in the midst of [His people]” ( Zechariah 2:10 ). This lesson can help students understand ways they can turn to the Lord. Student preparation: Invite students to ponder what they would say to a friend who feels far away from the Lord’s love. Students could prepare to share their advice with the class. Students might ask a trusted friend or parent what counsel they would give in this situation. Possible Learning Activities Why do some people turn away from Jesus Christ? Consider beginning class by displaying an image of the Savior next to a stick figure with an arrow pointing away from him. What are some reasons teenagers might turn away from the Lord? Remind students that throughout the Old Testament, prophets declared the Savior’s invitation to turn or return to Him regardless of the reason they turned away (see Deuteronomy 4:30–31 ; Nehemiah 1:9 ). Sometimes we turn away without recognizing that we are drifting. Invite students to think about if they or people they love might be turning away from the Lord. You could invite students to reflect on the following self-assessment. Which of the following statements do you feel is true of you? I want to help people I care about who are turning away from the Lord. I haven’t really thought about how close I am to the Lord. I am feeling tempted to turn away from the Lord. I am doing my best to stay close to the Lord and hope I can stay strong. As you study Zechariah, seek inspiration from the Holy Ghost to help you in your personal circumstances. Turning to the Lord After 50 years of captivity, many Israelites finally returned to Jerusalem and the surrounding area. They rebuilt the city and started rebuilding the Lord’s temple (see Ezra 5:1–2 ; 6:14 ). But though they had physically returned to Jerusalem, many people were still far from the Lord spiritually. He sent the prophet Zechariah to help the people turn to Him so that He could “dwell in the midst of [them]” ( Zechariah 2:10 ). Read Zechariah 1:1–3 , looking for what the Lord invited His people to do. Create four columns on the board. Write or have a student write the following incomplete truth on the board above the columns: We turn to the Lord by … You could write the following scripture passages on the board, one in each column. Organize students into groups of four and invite each group member to study one of the passages. Students could then complete the statement of truth using their passage. Zechariah 1:4 Zechariah 3:7 (“I will give thee places to walk among these that stand by” can refer to feeling clean and worthy in the presence of heavenly messengers; see footnote c .) Zechariah 7:9–10 Zechariah 8:16–17 (note the phrase “peace in your gates”) Students might share different wordings, but help them complete the bolded truth with statements like: … turning away from evil ( Zechariah 1:4 ). … walking in the Lord’s ways ( Zechariah 3:7 ). … treating others with mercy and compassion ( Zechariah 7:9–10 ). … acting as peacemakers ( Zechariah 8:16–17 ). Consider writing each phrase on the board in the proper columns. The following activity can help deepen students’ understanding of the truths they identified from Zechariah. Give each group copies of the handout “ We Can Turn to the Lord By … ” Invite students to work in pairs or small groups to complete the handout. Alternatively, you could assign different scenarios to different pairs and have them prepare to share with pairs that worked on a different scenario. Open PDF Share what you have learned Invite the groups to share what they learned. One way to do this is to invite each group to write their responses to prompt 2 or 3 for one of the scenarios in the appropriate column on the board. When students finish sharing, help them reflect on what they have learned by inviting them to do the following. In your study journal, write down one or two things you feel could help you turn to the Lord. Prayerfully invite your Heavenly Father to help you with your efforts. You might conclude with your witness of the love Heavenly Father and Jesus Christ have for us and Their constant loving invitation to turn to Them.\n\n\n--- Lesson 157 ---\nThrough His prophets, the Lord reveals details about future events so we can recognize and look forward to them with confidence. Zechariah prophesied that the Savior will return and protect His people from the nations gathered to fight against them. This lesson can help students feel confident that the Savior will be with them during the events preceding the Second Coming. Student preparation: Invite students to read “ Second Coming of Jesus Christ ” in Topics and Questions (Gospel Library). Encourage them to come to class prepared to share what they learned or what questions they have. Possible Learning Activities Anticipating the Savior’s Second Coming Consider starting class by asking students to think about some big events they anticipate in the future, like going on a vacation, serving a mission, or getting married. Invite them to share how they feel about these events. Then show an image of the Savior’s Second Coming. Invite students to list several words on the board that could represent how individuals might feel about this event. The list might include words like excited , ready , confident , peaceful , scared , uncertain , nervous , or unsure . To assess how they feel about the Savior’s Second Coming, students could do the following. In your study journal, answer the following questions: Which words describe how you feel about the Savior’s Second Coming? What influences how you feel about this event? Write down any questions you have about the Savior’s Second Coming. As you study events related to the Second Coming, listen for impressions from the Spirit to know how you can feel more confident that the Savior will be with you during these events. You might invite students to share what they wrote. Encourage students to look for answers to their questions as they study Zechariah. Note: You do not need to answer every question about the Savior’s Second Coming. If students want to learn more, they can study resources like “ Second Coming of Jesus Christ ” in Topics and Questions (Gospel Library). Zechariah prophesied the Savior’s Second Coming To help students understand Zechariah’s prophecies about the Savior’s Second Coming, you could read or summarize the following paragraph. Students could also read the chapter headings for Zechariah 10 ; 12–14 . Zechariah prophesied that in the last days, a great battle, known as the battle of Armageddon (see Revelation 16:16 ), will take place near Jerusalem. All the nations of the earth will gather against Jerusalem (see Zechariah 12:2–3 ). As part of the battle, Jerusalem will be under siege as armies encompass the city (see Zechariah 14:2 ). The Savior will then appear on the Mount of Olives (see Zechariah 14:4 ). To help students learn more about how the Savior will help His people during these events, consider using the handout “ What Will the Savior Do For … ” You could read the verses as a class and invite students to write below each question the words or phrases that describe what the Savior promised to do for the faithful. Alternatively, you could organize the class into three groups and assign each group a question to study and share with the class. If students have questions about what will happen to the wicked at the Savior’s Second Coming, you could invite them to read Zechariah 14:12–13, 17–19 . These verses describe conditions for people who choose not to follow Jesus Christ. Open PDF After students complete the handout, invite them to ask questions about what they studied. If you are uncertain about an answer, tell them you don’t know. Invite them to search for an answer. You could also search for an answer with them in or out of class. The following question can help students identify truths from Zechariah’s teachings. What do these passages teach you about Jesus Christ? As part of the discussion, invite students to summarize what they learned about the Savior in a simple statement of truth. Students might share a variety of answers, including Jesus Christ will return in the last days and gather, save, and protect His people. Power comes when students recognize that the truths they are learning from the scriptures are evidence of the love, power, and mercy of Heavenly Father and Jesus Christ in their lives. This realization can help students feel a closer connection to Them. The following questions can help students reach this understanding. (For additional training on asking questions that connect the Lord’s love, power, and mercy to the truths being taught in the scriptures, see “ Help learners recognize the Lord’s love, power, and mercy in their lives ” in Teacher Development Skills .) How can knowing this truth about Jesus Christ help us face His Second Coming with confidence? What are some ways Jesus Christ gathers, saves, and protects His people today? Answers to the previous question could include: Jesus Christ gathers by inviting all to come to Him, follow His gospel, and receive the blessings of the temple. He saves by offering the gift of His Atonement and the ordinances of the gospel. He protects by revealing His will through living prophets and scriptures. Show what you know The following activity can help students express their confidence in what the Savior promised to do for His people when He comes again. Students could work individually or in groups. Invite them to use the scripture verses from the handout to complete the activity. To prepare students to write their own lyrics, you could show the video “ Come, O Thou King of Kings ” (3:43) on ChurchofJesusChrist.org . 3:44 Read the lyrics to the hymn “ Come, O Thou King of Kings ” ( Hymns , no. 59). Then write an additional verse to the hymn. Include Zechariah’s teachings about what the Savior promised to do for His people during His Second Coming, and how these promises help you feel confident that the Savior will be with His people in the last days. Invite students to share the lyrics they wrote. You might consider singing the hymn together as a class, including one or more of the verses students wrote. To conclude, you could share your testimony of the Savior and how He helps you look forward to His Second Coming with confidence.",
  "content_sources": [
    {
      "source_type": "cfm",
      "title": ";Zechariah 1–4;7–14",
      "content": "After decades of captivity, a group of Israelites, probably including the prophets Haggai and Zechariah, were allowed to return to Jerusalem. Some in this group remembered what the temple looked like before it was destroyed. To those who wondered whether it would ever again resemble the Lord’s “house in her first glory” (\nHaggai 2:3\n), Haggai spoke the Lord’s words of encouragement: “Be strong, all ye people of the land, saith the Lord, and work: for I am with you, … fear ye not.” “I will fill this house with glory, … and in this place will I give peace” (\nHaggai 2:4–5, 7, 9\n).\nBut it wasn’t just the holy temple that needed rebuilding. In many ways, God’s people were spiritually in ruins. And rebuilding a holy people takes more than cutting stones and positioning them to build a holy house. It means the inscription “Holiness unto the Lord” must be engraved not just on a temple wall, or even on “the bells of the horses” and “every pot in Jerusalem” (\nZechariah 14:20–21\n). They must also be engraved on every heart.\nFor an overview of the books of Haggai and Zechariah, see “\nHaggai\n” and “\nZechariah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nHaggai 1\n;\n2:1–9\n“Consider your ways.”\nThere were many important things to do to rebuild Jerusalem. But after roughly 15 years had passed since the Israelites’ return, the Lord was displeased that the rebuilding of the temple had not been given higher priority (see\nHaggai 1:2–5\n; see also\nEzra 4:24\n). As you read\nHaggai 1\n;\n2:1–9\n, consider questions like these:\nWhat consequences did the Israelites face because they had not finished the temple?\nWhat blessings did the Lord promise them if they finished building His house?\nWhat is the Lord’s message to you in\nHaggai 1:5–7\n? How could you align your priorities with the Lord’s? When have you been blessed for putting God first in your life?\nThe early Latter-day Saints faced a similar situation to the Israelites in Haggai’s day (see\nDoctrine and Covenants 95\n). What do you learn from these two examples about the Lord’s feelings about temples?\nSee also Dale G. Renlund, “\nJesus Christ Is the Treasure\n,”\nLiahona\n, Nov. 2023, 96–99; Terence M. Vinson, “\nTrue Disciples of the Savior\n,”\nEnsign\nor\nLiahona\n, Nov. 2019, 9–11; “\nWe Love Thy House, O God\n,”\nHymns\n, no. 247; “Provo City Center Temple Completed” (video),\nChurchofJesusChrist.org\n.\n7:17\nProvo City Center Temple Completed\nZechariah 1–3\n;\n7–8\n;\n14\nThe Lord can make me holy.\nIn your opinion, what’s the value of having “holiness unto the Lord” engraved on everyday objects like those mentioned in\nZechariah 14:20\n? (see also\nExodus 28:36–38\n). What’s the value of having it engraved on temples today? What does this phrase mean to you? How can you make holiness part of your daily life? Ponder these questions as you read the Lord’s invitations to His people to become more holy in\nZechariah 1:1–6\n;\n3:1–7\n;\n7:8–10\n;\n8:16–17\n.\nYou could also read\nZechariah 2:10–11\n;\n8:1–8\n;\n14:9–11, 20–21\nto learn what life will be like in a future day when we all dwell with the Lord in a state of holiness. What impresses you about Zechariah’s vision of the future of Jerusalem? What do you find here that you would like to see in your community? How can you prepare to live in the conditions Zechariah described?\n“Behold, thy King cometh unto thee: he is just, and having salvation; lowly, and riding upon an ass” (\nZechariah 9:9\n).\nTriumphal Entry\n, by Harry Anderson\nZechariah 9:9–11\n;\n11:12–13\n;\n12:10\n;\n13:6–7\n;\n14:1–9\nJesus Christ is the promised Messiah.\nSeveral of Zechariah’s writings point both to the earthly ministry of Jesus Christ and to His eventual Second Coming. Below are some of Zechariah’s prophecies, along with scriptures about their fulfillment. As you study these passages, ask yourself: What does this teach me about the Savior?\nZechariah 9:9–11\n(see\nMatthew 21:1–11\n;\n1 Peter 3:18–19\n)\nZechariah 11:12–13\n(see\nMatthew 26:14–16\n;\n27:1–7\n)\nZechariah 12:10\n(see\nJohn 19:37\n;\nRevelation 1:7\n)\nZechariah 13:6–7\n;\n14:1–9\n(see\nMatthew 26:31\n;\nDoctrine and Covenants 45:47–53\n)\nWhat do you think it would have been like to be among the people welcoming Jesus into Jerusalem as described in\nZechariah 9:9–11\n? How can you welcome Him into your life, your homes, and your community?\nSee also Guide to the Scriptures, “\nMessiah\n,” Gospel Library; “The Lord’s Triumphal Entry into Jerusalem” (video), Gospel Library; Ronald A. Rasband, “\nHosanna to the Most High God\n,”\nLiahona\n, May 2023, 108–12.\n1:22\nThe Lord's Triumphal Entry into Jerusalem\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nHaggai 1:2–8\n“Consider your ways.”\nAs you read parts of\nHaggai 1:2–5\nwith your children, help them find out why the Lord was not pleased with the people. Perhaps your children could pick a phrase from\nverse 6\nand draw a picture of it. They could show it to each other and guess what phrase each drawing represents. When we spend time on things other than what the Lord wants, how is that like eating but not being filled? You might talk with each other about how you can make time for the things that are important to the Lord.\nYou could also read\nverse 8\nto your children and invite them to pretend to “go up to the mountain,” “bring wood,” and “build the house [of the Lord].” Your children could make a list of things they do in a typical day, including things the Lord has asked them to do. Ask your children to “consider [their] ways” by circling what the Lord might say are the most important things on their list.\nHome-centered teaching.\nPresident Russell M. Nelson has taught that the home should be the “center of gospel learning” (“\nBecoming Exemplary Latter-day Saints\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 113). As your family studies Haggai’s counsel to “consider your ways,” you could talk about how to put God first in your family life.\nZechariah 3:1–7\nMaking and keeping covenants can help me be more like Heavenly Father and Jesus Christ.\nIn a vision, Zechariah saw a high priest who was “clothed with filthy garments” (\nZechariah 3:3\n). An angel gave him clean clothing. You could help your children discover important truths by reading together\nZechariah 3:1–7\nand talking about what the dirty clothing and clean clothing might represent. How do we become clean from our sins, even after we are baptized? How does our baptismal covenant help us “walk in [the Lord’s] ways”?\nYou and your children could look at a picture of a baptism, like the one in this outline. Why do we wear white at our baptism? You could also sing a song about baptism, such as “\nWhen I Am Baptized\n” (\nChildren’s Songbook\n, 103); what does the song teach about why the Lord wants us to be baptized?\nZechariah 9:9–11\n;\n11:12\n;\n13:6–7\nJesus Christ is the promised Messiah.\nYour children might like to visualize the event foretold in\nZechariah 9:9\n, when Jesus came into Jerusalem during the last week of His mortal life. To help with this, show them a picture of the event, like the one in this outline. You could also share with them “\nThe Savior Goes to Jerusalem\n” (in\nNew Testament Stories\n, 110–12). Your children could point to people in the pictures who are “rejoicing greatly.” Who is the King in\nZechariah 9:9\n? Why are we thankful for Him?\n1:35\nChapter 44: The Savior Goes to Jerusalem\nConsider helping your children compare prophecies from Zechariah with the New Testament verses describing their fulfillment. Here are some examples:\nZechariah 9:9\nand\nMatthew 21:5–9\n;\nZechariah 9:11\nand\n1 Peter 3:18–19\n;\nZechariah 11:12\nand\nMatthew 26:14–16\n;\nZechariah 13:7\nand\nMatthew 26:31\n. What do we learn about the Savior from these verses?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n\n",
      "url": null,
      "purpose": "Come Follow Me home and church study"
    },
    {
      "source_type": "seminary_teacher",
      "title": "Seminary Teacher Week 50: Lesson 155: Lesson 155—HaggaiThis lesson can help students put God first in their lives.; Lesson 156: Lesson 156—Zechariah 1–8This lesson can help students understand ways they can turn to the Lord....",
      "content": "\n--- Lesson 155 ---\nIn our busy lives, how can we make time for the Lord and the things He asks us to do? We can benefit from following the Lord’s invitation to the Jews to “consider [our] ways” ( Haggai 1:5 ) regarding how we make time for Him. This lesson can help students put God first in their lives. Student preparation: Invite students to make a list of things they do on a typical day. Students could label which things they feel are most important and ponder why they consider those things important. They could bring their lists to class. Possible Learning Activities Prioritizing the Lord The following object lesson is in the article “ Making Good Use of Your Time ” ( New Era , July 2020, 34–35). Before class, fill a jar with rocks, then add sand to the top, shaking it to settle. This is to ensure you have enough sand to fill the jar. Then, separate the sand and rocks again. Bring the jar, sand, and rocks to class. As class begins, show the items to students, explaining that the jar represents our time, the rocks our priorities, and the sand our daily activities. What are things you spend your time doing each day? What are things the Lord asks each of us to prioritize? Students might respond to the second question with answers such as scripture study, prayer, family time, service, and so on. Consider writing students’ answers on the rocks. To help students see the value of prioritizing, first fill the jar with sand. Then try adding the rocks, which won’t fit. Discuss how to fit both. Empty the jar and try again. Add the rocks first, then the sand, shaking the jar to settle in the gaps. What can we learn from this object lesson? Why can it be difficult to make time for the Lord and the things He asks us to do each day? As you study Haggai, look for inspiration from the Holy Ghost about how the Lord can bless your life as you make time for Him. Rebuilding the temple To help your students understand the context of Haggai, consider sharing the following summary. After the Jews returned to Jerusalem from their captivity in Babylon, they put great effort into rebuilding their temple, city, homes, and lives (see Ezra 1:1–6 ). But after about 15 years had passed, the Lord was displeased that they had not given higher priority to rebuilding the temple (see Ezra 4:24 ; Haggai 1:3–4 ). He sent His prophet Haggai to persuade the people to prioritize building the Lord’s house. Read Haggai 1:2–4 , looking for words or phrases that show that the Jews were not focused on rebuilding the temple. You might need to explain that “ceiled” means paneled. This might indicate that while they left the temple unfinished, the people built comfortable and well-furnished houses for themselves. How might this relate to the object lesson? Read Haggai 1:5–11 , looking for consequences the Jews faced because they prioritized other things instead of rebuilding the temple. What are some consequences we might experience if we don’t prioritize the Lord in our lives? You could invite students to point out or mark the repeated phrase in verses 5 and 7 . What do you think the Lord meant when He invited the people to “consider [their] ways”? ( Haggai 1:5, 7 ) “From this day will I bless you” Consider reading or summarizing the following paragraph to help students understand the remainder of the account. The Jews and their leaders obeyed the voice of the Lord. Zerubbabel (the governor) and Joshua (the high priest) led the efforts to rebuild the temple (see Haggai 1:12–14 ). The prophet Haggai helped too (see Ezra 5:1–2 ). As they worked, the Lord offered words of encouragement. Write the following incomplete truth on the board: If we put God first in our lives … Consider dividing the class into three sections, with each section reading one of the following passages. Read one or more of the following passages, looking for encouragement from the Lord that can complete the sentence on the board: Haggai 2:4–5 Haggai 2:6–9 Haggai 2:18–19 Students could come to the board and write how they would complete the statement. The following are examples of what they might write: … He will be with us. … He will give us peace. … He will bless us spiritually and temporally. To find additional blessings that we can receive by putting God first, students could read Mosiah 2:41 and 3 Nephi 13:31–33 . You could then add what they find to the board. Which of the Lord’s blessings from these verses do you want most? Why? Help students recognize ways they can put God first to invite His blessings. If you did not show the video “ The Soul’s Sincere Desire ” (3:28) when you taught Lesson 93: “ Nehemiah ,” then consider showing it here from time code 0:00 to 2:01. This video is available at ChurchofJesusChrist.org . You could invite students to look for ways they could respond to the questions below. 3:29 Alternatively, you could share the following scenario. Students can then answer the accompanying questions in pairs, small groups, or as a class. Imagine you have a friend named Alex who feels she does not have any time to prioritize God in her life. Her days are filled with schoolwork, friends, and hobbies, leaving her exhausted and unmotivated for spiritual things. She sees a need to change but doesn’t know what to do. What advice would you give Alex to help her put God first? How might God bless her for putting Him first? After enough time, you could show the rest of “ The Soul’s Sincere Desire ” from time code 2:02 to 3:28, inviting students to look for what Alex does to change. 3:29 What other advice would you give someone who feels they cannot put God first in their life for any other reason? How has God blessed you or others you know from putting Him first? Make a plan This section can help students apply what they learned. Consider displaying the following statement. Personally reflect on the following invitation from Elder David A. Bednar of the Quorum of the Twelve Apostles: 13:57 I repeat the admonition of the Lord to His people delivered through the Old Testament prophet Haggai: “Now therefore thus saith the Lord of hosts; Consider your ways” [ Haggai 1:5 ]. Each of us should evaluate our temporal and spiritual priorities sincerely and prayerfully to identify the things in our lives that may impede the bounteous blessings that Heavenly Father and the Savior are willing to bestow upon us. And surely the Holy Ghost will help us to see ourselves as we really are. (“ Put On Thy Strength, O Zion ,” Liahona , Nov. 2022, 94) Act on the Lord’s invitation to “consider your ways” ( Haggai 1:5, 7 ) by pondering your own priorities. Ponder if there are things you need to prioritize or remove from your life to invite blessings Heavenly Father and Jesus Christ are willing to give you. In your journal, sketch a jar with rocks, and label the rocks with commitments you will make to prioritize God. Draw sand outside the jar, and label it with things you’d like to eliminate. Choose a rock or two and plan what, when, and how you will fulfill these commitments. Consider sharing your testimony or thoughts about Heavenly Father and Jesus Christ’s blessings as we put Them first in our lives.\n\n\n--- Lesson 156 ---\nAfter 50 years of captivity in Babylon and Persia, a remnant of the house of Israel had physically returned to their holy land, but spiritually they were still far from the Lord. Through the prophet Zechariah, the Savior renewed His invitation, “turn ye unto me” ( Zechariah 1:3 ), with the promise that He would “dwell in the midst of [His people]” ( Zechariah 2:10 ). This lesson can help students understand ways they can turn to the Lord. Student preparation: Invite students to ponder what they would say to a friend who feels far away from the Lord’s love. Students could prepare to share their advice with the class. Students might ask a trusted friend or parent what counsel they would give in this situation. Possible Learning Activities Why do some people turn away from Jesus Christ? Consider beginning class by displaying an image of the Savior next to a stick figure with an arrow pointing away from him. What are some reasons teenagers might turn away from the Lord? Remind students that throughout the Old Testament, prophets declared the Savior’s invitation to turn or return to Him regardless of the reason they turned away (see Deuteronomy 4:30–31 ; Nehemiah 1:9 ). Sometimes we turn away without recognizing that we are drifting. Invite students to think about if they or people they love might be turning away from the Lord. You could invite students to reflect on the following self-assessment. Which of the following statements do you feel is true of you? I want to help people I care about who are turning away from the Lord. I haven’t really thought about how close I am to the Lord. I am feeling tempted to turn away from the Lord. I am doing my best to stay close to the Lord and hope I can stay strong. As you study Zechariah, seek inspiration from the Holy Ghost to help you in your personal circumstances. Turning to the Lord After 50 years of captivity, many Israelites finally returned to Jerusalem and the surrounding area. They rebuilt the city and started rebuilding the Lord’s temple (see Ezra 5:1–2 ; 6:14 ). But though they had physically returned to Jerusalem, many people were still far from the Lord spiritually. He sent the prophet Zechariah to help the people turn to Him so that He could “dwell in the midst of [them]” ( Zechariah 2:10 ). Read Zechariah 1:1–3 , looking for what the Lord invited His people to do. Create four columns on the board. Write or have a student write the following incomplete truth on the board above the columns: We turn to the Lord by … You could write the following scripture passages on the board, one in each column. Organize students into groups of four and invite each group member to study one of the passages. Students could then complete the statement of truth using their passage. Zechariah 1:4 Zechariah 3:7 (“I will give thee places to walk among these that stand by” can refer to feeling clean and worthy in the presence of heavenly messengers; see footnote c .) Zechariah 7:9–10 Zechariah 8:16–17 (note the phrase “peace in your gates”) Students might share different wordings, but help them complete the bolded truth with statements like: … turning away from evil ( Zechariah 1:4 ). … walking in the Lord’s ways ( Zechariah 3:7 ). … treating others with mercy and compassion ( Zechariah 7:9–10 ). … acting as peacemakers ( Zechariah 8:16–17 ). Consider writing each phrase on the board in the proper columns. The following activity can help deepen students’ understanding of the truths they identified from Zechariah. Give each group copies of the handout “ We Can Turn to the Lord By … ” Invite students to work in pairs or small groups to complete the handout. Alternatively, you could assign different scenarios to different pairs and have them prepare to share with pairs that worked on a different scenario. Open PDF Share what you have learned Invite the groups to share what they learned. One way to do this is to invite each group to write their responses to prompt 2 or 3 for one of the scenarios in the appropriate column on the board. When students finish sharing, help them reflect on what they have learned by inviting them to do the following. In your study journal, write down one or two things you feel could help you turn to the Lord. Prayerfully invite your Heavenly Father to help you with your efforts. You might conclude with your witness of the love Heavenly Father and Jesus Christ have for us and Their constant loving invitation to turn to Them.\n\n\n--- Lesson 157 ---\nThrough His prophets, the Lord reveals details about future events so we can recognize and look forward to them with confidence. Zechariah prophesied that the Savior will return and protect His people from the nations gathered to fight against them. This lesson can help students feel confident that the Savior will be with them during the events preceding the Second Coming. Student preparation: Invite students to read “ Second Coming of Jesus Christ ” in Topics and Questions (Gospel Library). Encourage them to come to class prepared to share what they learned or what questions they have. Possible Learning Activities Anticipating the Savior’s Second Coming Consider starting class by asking students to think about some big events they anticipate in the future, like going on a vacation, serving a mission, or getting married. Invite them to share how they feel about these events. Then show an image of the Savior’s Second Coming. Invite students to list several words on the board that could represent how individuals might feel about this event. The list might include words like excited , ready , confident , peaceful , scared , uncertain , nervous , or unsure . To assess how they feel about the Savior’s Second Coming, students could do the following. In your study journal, answer the following questions: Which words describe how you feel about the Savior’s Second Coming? What influences how you feel about this event? Write down any questions you have about the Savior’s Second Coming. As you study events related to the Second Coming, listen for impressions from the Spirit to know how you can feel more confident that the Savior will be with you during these events. You might invite students to share what they wrote. Encourage students to look for answers to their questions as they study Zechariah. Note: You do not need to answer every question about the Savior’s Second Coming. If students want to learn more, they can study resources like “ Second Coming of Jesus Christ ” in Topics and Questions (Gospel Library). Zechariah prophesied the Savior’s Second Coming To help students understand Zechariah’s prophecies about the Savior’s Second Coming, you could read or summarize the following paragraph. Students could also read the chapter headings for Zechariah 10 ; 12–14 . Zechariah prophesied that in the last days, a great battle, known as the battle of Armageddon (see Revelation 16:16 ), will take place near Jerusalem. All the nations of the earth will gather against Jerusalem (see Zechariah 12:2–3 ). As part of the battle, Jerusalem will be under siege as armies encompass the city (see Zechariah 14:2 ). The Savior will then appear on the Mount of Olives (see Zechariah 14:4 ). To help students learn more about how the Savior will help His people during these events, consider using the handout “ What Will the Savior Do For … ” You could read the verses as a class and invite students to write below each question the words or phrases that describe what the Savior promised to do for the faithful. Alternatively, you could organize the class into three groups and assign each group a question to study and share with the class. If students have questions about what will happen to the wicked at the Savior’s Second Coming, you could invite them to read Zechariah 14:12–13, 17–19 . These verses describe conditions for people who choose not to follow Jesus Christ. Open PDF After students complete the handout, invite them to ask questions about what they studied. If you are uncertain about an answer, tell them you don’t know. Invite them to search for an answer. You could also search for an answer with them in or out of class. The following question can help students identify truths from Zechariah’s teachings. What do these passages teach you about Jesus Christ? As part of the discussion, invite students to summarize what they learned about the Savior in a simple statement of truth. Students might share a variety of answers, including Jesus Christ will return in the last days and gather, save, and protect His people. Power comes when students recognize that the truths they are learning from the scriptures are evidence of the love, power, and mercy of Heavenly Father and Jesus Christ in their lives. This realization can help students feel a closer connection to Them. The following questions can help students reach this understanding. (For additional training on asking questions that connect the Lord’s love, power, and mercy to the truths being taught in the scriptures, see “ Help learners recognize the Lord’s love, power, and mercy in their lives ” in Teacher Development Skills .) How can knowing this truth about Jesus Christ help us face His Second Coming with confidence? What are some ways Jesus Christ gathers, saves, and protects His people today? Answers to the previous question could include: Jesus Christ gathers by inviting all to come to Him, follow His gospel, and receive the blessings of the temple. He saves by offering the gift of His Atonement and the ordinances of the gospel. He protects by revealing His will through living prophets and scriptures. Show what you know The following activity can help students express their confidence in what the Savior promised to do for His people when He comes again. Students could work individually or in groups. Invite them to use the scripture verses from the handout to complete the activity. To prepare students to write their own lyrics, you could show the video “ Come, O Thou King of Kings ” (3:43) on ChurchofJesusChrist.org . 3:44 Read the lyrics to the hymn “ Come, O Thou King of Kings ” ( Hymns , no. 59). Then write an additional verse to the hymn. Include Zechariah’s teachings about what the Savior promised to do for His people during His Second Coming, and how these promises help you feel confident that the Savior will be with His people in the last days. Invite students to share the lyrics they wrote. You might consider singing the hymn together as a class, including one or more of the verses students wrote. To conclude, you could share your testimony of the Savior and how He helps you look forward to His Second Coming with confidence.",
      "url": null,
      "purpose": "Seminary teacher manual content"
    }
  ],
  "scripture_content": {},
  "subsections": [],
  "teaching_ideas": [],
  "discussion_questions": [],
  "themes": [],
  "cross_references": [],
  "doctrinal_mastery": [],
  "total_content_length": 25868,
  "total_sources": 2,
  "generated_at": "2025-12-14T04:01:27.403821"
}