{
  "week_number": 5,
  "title": "Week 5: January 26–February 1 - Genesis 5; Moses 6",
  "date_range": "January 26–February 1",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Walking with God Together",
      "scripture": {
        "reference": "Moses 6:34",
        "text": "Behold my Spirit is upon you, wherefore all thy words shall be my words; and thou shalt walk with me."
      },
      "thought": "This week, we dive into the powerful story of Enoch and the early generations of Adam and Eve’s family in Genesis 5 and Moses 6. We’ll explore how Enoch walked with God, overcoming his insecurities to become a mighty prophet. We’ll also learn about the gospel principles taught from the beginning, like faith, repentance, baptism, and receiving the Holy Ghost. These timeless truths remind us that God has always had a plan for His children. As we study, we can find inspiration to face our own challenges with faith and to teach these eternal doctrines in our homes. Let’s start this week with a desire to walk closer to the Savior, just as Enoch did.",
      "application": "Set a goal as a family to read or discuss a portion of Moses 6 each day this week.",
      "question": "What does it mean to you to ‘walk with God’ in your daily life?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Challenges",
      "title": "Overcoming Weakness with God",
      "scripture": {
        "reference": "Moses 6:31",
        "text": "And when Enoch had heard these words, he bowed himself to the earth, before the Lord, and spake before the Lord, saying: Why is it that I have found favor in thy sight, and am but a lad, and all the people hate me; for I am slow of speech; wherefore am I thy servant?"
      },
      "thought": "Enoch felt overwhelmed when God called him to be a prophet, doubting himself because he was young, slow of speech, and unpopular. Many of us can relate to feeling inadequate when faced with big responsibilities or callings. Yet, God saw Enoch’s potential and promised to be with him. This reminds us that the Lord often calls us despite our weaknesses, not because we’re already perfect. He wants to help us grow as we rely on Him. Today, let’s remember that God can help us do hard things, just as He did for Enoch.",
      "application": "Write down one thing you feel inadequate about and pray specifically for the Lord’s help with it today.",
      "question": "How have you seen God help you with something you thought you couldn’t do?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Faith",
      "title": "Faith from the Beginning",
      "scripture": {
        "reference": "Moses 6:52",
        "text": "And he also said unto him: If thou wilt turn unto me, and hearken unto my voice, and believe, and repent of all thy transgressions, and be baptized, even in water, in the name of mine Only Begotten Son, who is full of grace and truth, which is Jesus Christ, the only name which shall be given under heaven, whereby salvation shall come unto the children of men, ye shall receive the gift of the Holy Ghost, asking all things in his name, and whatsoever ye shall ask, it shall be given you."
      },
      "thought": "From the very beginning, God taught Adam and his family the gospel of Jesus Christ, including faith, repentance, baptism, and receiving the Holy Ghost. This shows us that the Savior’s Atonement has always been central to God’s plan, even before He came to earth. We, too, can turn to Him, believe in His name, and receive the blessings of salvation. This scripture invites us to renew our faith in Jesus Christ every day. As we follow these principles, we draw closer to God and feel His Spirit in our lives. Let’s hold fast to these truths that have been taught since the dawn of time.",
      "application": "Choose one principle from this verse (faith, repentance, baptism, or Holy Ghost) and focus on strengthening it in your life today.",
      "question": "How does knowing the gospel was taught from the beginning strengthen your faith in Jesus Christ?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Relationships",
      "title": "Teaching Children God’s Ways",
      "scripture": {
        "reference": "Moses 6:58",
        "text": "Therefore I give unto you a commandment, to teach these things freely unto your children, saying:"
      },
      "thought": "God commanded Adam and Eve to teach their children the gospel, ensuring that future generations would know His plan. This responsibility continues today as parents and family members are called to share truths about faith and redemption. Teaching isn’t just about words; it’s about showing love, setting an example, and creating moments of connection. We can help the rising generation feel God’s love through our efforts. Even small conversations or shared scripture readings can plant seeds of faith. Let’s embrace this sacred duty to nurture the spirituality of those we love.",
      "application": "Plan a short family moment today to read a verse from Moses 6 together and share what it means to you.",
      "question": "What is one gospel truth you want to teach or reinforce with your family this week?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Repentance",
      "title": "Born Again Through Baptism",
      "scripture": {
        "reference": "Moses 6:59",
        "text": "That by reason of transgression cometh the fall, which fall bringeth death, and inasmuch as ye were born into the world by water, and blood, and the spirit, which I have made, and so became of dust a living soul, even so ye must be born again into the kingdom of heaven, of water, and of the Spirit, and be cleansed by blood, even the blood of mine Only Begotten; that ye might be sanctified from all sin, and enjoy the words of eternal life in this world, and eternal life in the world to come, even immortal glory;"
      },
      "thought": "God taught Adam that baptism is like being ‘born again’—a fresh start through water, the Spirit, and the cleansing blood of Christ. This powerful symbol reminds us that through repentance and the Savior’s Atonement, we can leave behind sin and become new. Each time we partake of the sacrament, we renew this covenant and continue the process of being born again. It’s a lifelong journey of turning to Christ. This scripture invites us to reflect on how we can keep our hearts open to change. Let’s seek that renewal today, trusting in the Savior’s power to sanctify us.",
      "application": "Take a quiet moment today to ponder how repentance has helped you feel ‘born again’ and write down one thing to improve.",
      "question": "What does being ‘born again’ mean to you, and how can you seek that renewal this week?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Growth",
      "title": "Seeing Through God’s Eyes",
      "scripture": {
        "reference": "Moses 6:35-36",
        "text": "And the Lord spake unto Enoch, and said unto him: Anoint thine eyes with clay, and wash them, and thou shalt see. And he did so. And he beheld the spirits that God had created; and he beheld also things which were not visible to the natural eye; and from thenceforth came the saying abroad in the land: A seer hath the Lord raised up unto his people."
      },
      "thought": "When Enoch anointed his eyes with clay and washed them as the Lord instructed, he gained spiritual vision to see things beyond the natural eye. This teaches us that God can help us grow by opening our eyes to His truths and purposes. Sin can cloud our ability to see, feel, and hear spiritual things, but through obedience and faith, we can gain clarity. Enoch became a seer, a powerful witness for God’s people. We, too, can seek spiritual insight as we turn to the Lord. Let’s strive to see our lives and others through His perspective today.",
      "application": "Pray for spiritual clarity today, asking God to help you see a situation or person in a new, Christlike way.",
      "question": "How can you invite the Lord to help you see things more clearly in your life?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Strengthened by Ancient Truths",
      "scripture": {
        "reference": "Moses 6:61",
        "text": "Therefore it is given to abide in you; the record of heaven; the Comforter; the peaceable things of immortal glory; the truth of all things; that which quickeneth all things, which maketh alive all things; that which knoweth all things, and hath all power according to wisdom, mercy, truth, justice, and judgment."
      },
      "thought": "This week, we’ve journeyed through the lives of Adam, Eve, and Enoch, learning timeless lessons from Moses 6 and Genesis 5. We’ve seen Enoch overcome his weaknesses with God’s help, discovered the gospel’s ancient roots, and felt the call to teach these truths to our families. The Holy Ghost, described as the Comforter and truth of all things, can abide in us as we follow these principles. We’ve been reminded that walking with God is possible, even in our imperfections. Let’s carry forward the inspiration to rely on the Savior and share His gospel. As we reflect on this week, may we feel strengthened by these eternal truths.",
      "application": "Share one thing you learned this week with a family member or friend and discuss how it can bless your lives.",
      "question": "What is one lesson from this week’s study that you want to remember and apply in the coming days?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:27:05",
  "source_week_file": "cfm_2026_week_05.json"
}