{
  "week_number": 22,
  "title": "Week 22: May 25–31 - Judges 2–4; 6–8; 13–16",
  "date_range": "May 25–31",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "The Lord Delivers Us",
      "scripture": {
        "reference": "Judges 3:9",
        "text": "And when the children of Israel cried unto the Lord, the Lord raised up a deliverer to the children of Israel, who delivered them, even Othniel the son of Kenaz, Caleb’s younger brother."
      },
      "thought": "This week, as we dive into the book of Judges, we’ll see a powerful pattern of God’s love and mercy. The Israelites often turned away from the Lord, facing captivity and hardship as a result, yet each time they cried out for help, He raised up a deliverer to save them. This cycle reminds us of our own lives—how we sometimes stray but can always turn back to Jesus Christ, our ultimate Deliverer. Stories of judges like Deborah, Gideon, and Samson will show us how God works through faithful individuals and even through our weaknesses. These accounts invite us to reflect on how the Lord delivers us personally from sin and struggle. Let’s open our hearts this week to His redeeming power and grace.",
      "application": "Take a quiet moment today to write down one way the Lord has delivered you in the past, and keep it somewhere you can see it throughout the week.",
      "question": "How has Jesus Christ been a deliverer in my life, and how can I turn to Him more fully this week?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Repentance",
      "title": "Returning to God’s Grace",
      "scripture": {
        "reference": "Judges 2:19",
        "text": "And it came to pass, when the judge was dead, that they returned, and corrupted themselves more than their fathers, in following other gods to serve them, and to bow down unto them; they ceased not from their own doings, nor from their stubborn way."
      },
      "thought": "In Judges, we see a recurring cycle where the Israelites turn away from God after a judge dies, falling back into sin and idol worship. This verse reminds us how easy it is to slip into old habits or temptations when we lose sight of our spiritual anchors. Yet, just as the Lord repeatedly offered the Israelites a chance to repent, He offers us the same mercy today. No matter how often we stumble, Jesus Christ is ready to forgive and help us start anew. This pattern encourages us to recognize our weaknesses and seek His strength. Let’s remember that repentance is not a one-time act but a continual return to Him.",
      "application": "Identify one habit or temptation you struggle with, and say a prayer asking for strength to turn away from it today.",
      "question": "What personal ‘idols’ or distractions pull me away from God, and how can I refocus on Him?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Faith",
      "title": "Inspiring Faith Like Deborah",
      "scripture": {
        "reference": "Judges 4:14",
        "text": "And Deborah said unto Barak, Up; for this is the day in which the Lord hath delivered Sisera into thine hand: is not the Lord gone out before thee? So Barak went down from mount Tabor, and ten thousand men after him."
      },
      "thought": "Deborah’s bold faith in the Lord inspired Barak and thousands of Israelites to trust in God’s power and fight for their freedom. Her question, ‘Is not the Lord gone out before thee?’ reminds us that God is always ahead of us, preparing the way even when we can’t see it. Her example shows how one person’s faith can uplift and strengthen an entire community. Today, we can be like Deborah by sharing our testimony of Jesus Christ with others. Whether through a kind word or a shared experience, our faith can encourage those around us to trust in the Savior. Let’s look for opportunities to let our light shine.",
      "application": "Share a simple testimony of Jesus Christ with a family member or friend today, focusing on one way He has blessed your life.",
      "question": "Who in my life needs to feel the Savior’s love through my faith, and how can I reach out to them?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Trust",
      "title": "Trusting God’s Unlikely Ways",
      "scripture": {
        "reference": "Judges 7:2",
        "text": "And the Lord said unto Gideon, The people that are with thee are too many for me to give the Midianites into their hands, lest Israel vaunt themselves against me, saying, Mine own hand hath saved me."
      },
      "thought": "When Gideon prepared to fight the Midianites, the Lord reduced his army from thousands to just 300 men, teaching that victory comes from God, not human strength. This might have seemed unlikely or even impossible to Gideon, yet he trusted God’s plan. In our lives, the Lord often works in ways that don’t make sense to us at first—through small acts, unexpected challenges, or quiet promptings. This story reminds us to trust in His wisdom, even when the path seems unclear. By relying on Him, we can see miracles unfold. Let’s seek His guidance today, knowing He sees the bigger picture.",
      "application": "When faced with a challenge today, pause and pray for trust in God’s plan, even if it feels uncertain.",
      "question": "When have I seen the Lord work in unexpected ways in my life, and how can I trust Him more fully now?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Covenant",
      "title": "Strength Through Sacred Covenants",
      "scripture": {
        "reference": "Judges 13:5",
        "text": "For, lo, thou shalt conceive, and bear a son; and no razor shall come on his head: for the child shall be a Nazarite unto God from the womb: and he shall begin to deliver Israel out of the hand of the Philistines."
      },
      "thought": "Samson was set apart from birth as a Nazarite, with specific covenants that gave him extraordinary strength to deliver Israel. When he honored those covenants, God’s power was with him, but when he broke them, he lost that strength. This teaches us the importance of keeping our own covenants, like baptism or temple promises, which bring spiritual strength into our lives. Just as physical exercise builds our bodies, covenant-keeping builds our spirits to face life’s challenges. The Lord blesses us with His power as we remain faithful. Let’s reflect on how our covenants connect us to Him today.",
      "application": "Choose one covenant you’ve made, such as keeping the Sabbath holy, and focus on honoring it with extra care today.",
      "question": "How have my covenants with God given me strength, and what can I do to honor them more fully?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Deliverance",
      "title": "Christ, Our True Deliverer",
      "scripture": {
        "reference": "Judges 3:15",
        "text": "But when the children of Israel cried unto the Lord, the Lord raised up a deliverer for them, Ehud the son of Gera, a Benjamite, a man lefthanded: and by him the children of Israel sent a present unto Eglon the king of Moab."
      },
      "thought": "Again and again in Judges, we see the Lord raising up deliverers like Ehud to save the Israelites when they cried out for help. This pattern points us to Jesus Christ, the ultimate Deliverer who frees us from the bondage of sin and despair. No matter how far we’ve strayed, when we turn to Him, He is ready to rescue us with His grace and love. This story reminds us that we’re never too far gone for His help. Just as the Israelites found hope through a deliverer, we can find peace through the Savior. Let’s lean on Him today for strength and healing.",
      "application": "Spend a few minutes in prayer today, asking Jesus Christ to help deliver you from a specific burden or struggle.",
      "question": "What burden do I need the Savior’s help to lift, and how can I cry unto Him for deliverance?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Delivered by His Love",
      "scripture": {
        "reference": "Judges 6:12",
        "text": "And the angel of the Lord appeared unto him, and said unto him, The Lord is with thee, thou mighty man of valour."
      },
      "thought": "This week, we’ve explored the book of Judges and seen how the Lord never gave up on His covenant people, raising up deliverers like Deborah, Gideon, and Samson to save them. Their stories remind us of Jesus Christ, our ultimate Deliverer, who is always with us, as He was with Gideon. We’ve learned about the power of repentance, the strength of covenants, and the importance of trusting God’s ways, even when they seem unlikely. Deborah’s faith inspired others, and Samson’s struggles taught us the cost of turning away from promises. These lessons encourage us to stay close to the Savior and share His light with others. As we move forward, let’s hold fast to His love and power to deliver us every day.",
      "application": "Gather as a family or individually to share one key lesson from this week’s study and set a goal to apply it in the coming days.",
      "question": "What is one way I’ve felt the Lord’s delivering power this week, and how will I carry that forward?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:37:58",
  "source_week_file": "cfm_2026_week_22.json"
}