{
  "week_number": 48,
  "title": "Week 48: November 23–29 - Amos; Obadiah; Jonah",
  "date_range": "November 23–29",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Seek the Lord Always",
      "scripture": {
        "reference": "Amos 5:4",
        "text": "For thus saith the Lord unto the house of Israel, Seek ye me, and ye shall live."
      },
      "thought": "This week, as we study Amos, Obadiah, and Jonah, we are invited to seek the Lord and find life in His presence. These prophets delivered powerful messages of repentance, mercy, and hope to ancient Israel and even to their enemies. Their words remind us that God never gives up on His children, no matter how far we stray. Through their stories, we learn that the Lord sends prophets to guide us, offers mercy when we turn to Him, and restores us when we feel lost. As we explore these scriptures, let’s reflect on how we can seek Him in our daily lives. His promise of life and love is always within reach if we turn to Him.",
      "application": "Take a moment today to pray and ask how you can better seek the Lord this week.",
      "question": "What does it mean to you personally to 'seek the Lord' in your daily life?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Revelation",
      "title": "Prophets Reveal God’s Will",
      "scripture": {
        "reference": "Amos 3:7",
        "text": "Surely the Lord God will do nothing, but he revealeth his secret unto his servants the prophets."
      },
      "thought": "Amos teaches us a profound truth: God speaks to His prophets to guide His people. Just as He revealed His will to Amos, He continues to do so through living prophets today. This is a sign of His love for us, ensuring we are never left without direction. When we listen to prophetic counsel, we gain insight into God’s plan for our lives. Think of recent messages from our prophets—how have they helped you navigate challenges or find peace? God’s voice through His servants is a precious gift we can rely on every day.",
      "application": "Read or listen to a recent conference talk by the current prophet and note one piece of guidance to apply this week.",
      "question": "How have the words of modern prophets helped you feel God’s love in your life?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Repentance",
      "title": "Return and Find Life",
      "scripture": {
        "reference": "Amos 5:14-15",
        "text": "Seek good, and not evil, that ye may live: and so the Lord, the God of hosts, shall be with you, as ye have spoken. Hate the evil, and love the good, and establish judgment in the gate: it may be that the Lord God of hosts will be gracious unto the remnant of Joseph."
      },
      "thought": "Amos calls us to turn from evil and seek good, promising that the Lord will be with us when we do. This invitation to repent is not a burden but a pathway to life and grace. No matter our past mistakes, God is ready to show mercy if we choose to follow Him. Think about a time when turning to the Lord brought you peace or strength. His grace is always available when we seek Him with a sincere heart. Let’s commit today to choose good and feel His presence.",
      "application": "Identify one habit or thought pattern you’d like to change, and take a small step toward seeking good today.",
      "question": "How have you felt the Lord’s grace when you’ve chosen to turn away from evil and seek good?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Obedience",
      "title": "Obeying Brings God’s Help",
      "scripture": {
        "reference": "Jonah 3:5",
        "text": "So the people of Nineveh believed God, and proclaimed a fast, and put on sackcloth, from the greatest of them even to the least of them."
      },
      "thought": "Jonah’s story shows us that obedience, even after reluctance, can bring powerful results. When Jonah finally delivered God’s message, the people of Nineveh listened and turned to Him, and their city was spared. This teaches us that God is patient with us, helping us obey even when it’s hard. Like Jonah, we might face tasks that seem daunting, but the Lord supports us when we choose to follow His will. Their example of repentance also reminds us that no one is beyond God’s reach. Let’s trust Him to guide us as we strive to obey.",
      "application": "Think of one thing the Lord has asked you to do that feels hard, and take a small step toward obedience today.",
      "question": "How has the Lord helped you obey Him when you’ve faced something difficult?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Grace",
      "title": "Mercy for All People",
      "scripture": {
        "reference": "Jonah 4:2",
        "text": "And he prayed unto the Lord, and said, I pray thee, O Lord, was not this my saying, when I was yet in my country? Therefore I fled before unto Tarshish: for I knew that thou art a gracious God, and merciful, slow to anger, and of great kindness, and repentest thee of the evil."
      },
      "thought": "Jonah struggled to accept that God’s mercy extended even to the people of Nineveh, Israel’s enemies. Yet, this verse reveals Jonah’s recognition of God’s true nature—gracious, merciful, and kind. This reminds us that God’s love knows no bounds; He offers forgiveness to everyone who turns to Him. We, too, can sometimes find it hard to show mercy to others, but Jonah’s story encourages us to reflect God’s kindness. Think of someone in your life who needs understanding. How can you mirror the Lord’s mercy today?",
      "application": "Reach out to someone you’ve struggled to forgive and offer a kind word or gesture today.",
      "question": "How can learning about God’s mercy toward Nineveh help you show more kindness to others?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Service",
      "title": "Saviors on Mount Zion",
      "scripture": {
        "reference": "Obadiah 1:21",
        "text": "And saviours shall come up on mount Zion to judge the mount of Esau; and the kingdom shall be the Lord’s."
      },
      "thought": "Obadiah’s prophecy speaks of 'saviours on mount Zion,' which President Gordon B. Hinckley taught refers to temple work for the dead. When we participate in ordinances for our ancestors, we become like the Savior in a small way, helping others receive eternal blessings. This sacred service connects us to our families and to Christ, who made salvation possible for all. Think of how this work deepens your bond with the Savior. Even if you can’t attend the temple, preparing names or learning about your ancestors can bring you closer to Him. Let’s serve with love and gratitude today.",
      "application": "Spend a few minutes researching a family name or story to prepare for temple work, or write down a memory of an ancestor.",
      "question": "How does serving in the temple or learning about your ancestors help you feel closer to the Savior?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Live Through His Mercy",
      "scripture": {
        "reference": "Amos 8:11",
        "text": "Behold, the days come, saith the Lord God, that I will send a famine in the land, not a famine of bread, nor a thirst for water, but of hearing the words of the Lord."
      },
      "thought": "This week, we’ve explored the messages of Amos, Obadiah, and Jonah, seeing how God’s love shines through prophets, mercy, and restoration. Amos warned of a spiritual famine, reminding us to cherish the word of God that fills our lives today through scriptures and living prophets. Jonah’s journey taught us about obedience and the boundless mercy of the Lord, even for those who seem far from Him. Obadiah inspired us to serve as saviors on Mount Zion through temple work. Together, these lessons call us to seek the Lord, repent, and extend His love to others. Let’s carry this spirit of seeking and serving into the coming week.",
      "application": "Share with a family member or friend one lesson from this week’s study that touched your heart.",
      "question": "How has seeking the Lord this week helped you feel His presence and mercy in your life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:53:30",
  "source_week_file": "cfm_2026_week_48.json"
}