{
  "week_number": 12,
  "title": "Week 12: March 16–22 - Genesis 42–50",
  "date_range": "March 16–22",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "God Meant It for Good",
      "scripture": {
        "reference": "Genesis 50:20",
        "text": "But as for you, ye thought evil against me; but God meant it unto good, to bring to pass, as it is this day, to save much people alive."
      },
      "thought": "This week, we dive into the powerful conclusion of Joseph’s story in Genesis 42–50, where we see themes of forgiveness, divine purpose, and family reconciliation. Joseph, after enduring years of hardship and betrayal by his brothers, rises to a position of power in Egypt and ultimately saves his family from famine. His words in Genesis 50:20 remind us that God can turn even our hardest trials into blessings for ourselves and others. Like Joseph, who reflects the Savior’s mercy, we are invited to seek healing through forgiveness and recognize God’s hand in our lives. As we study these chapters, let’s ponder how the Savior’s example of love and redemption can guide us in our own challenges. This week offers a chance to strengthen our faith in God’s plan and our relationships with those around us.",
      "application": "Take a moment today to write down one challenge you’re facing and consider how God might be working through it for your good.",
      "question": "How can I trust God more fully to turn my trials into opportunities for growth or service?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Forgiveness",
      "title": "Healing Through Forgiving Others",
      "scripture": {
        "reference": "Genesis 45:5",
        "text": "Now therefore be not grieved, nor angry with yourselves, that ye sold me hither: for God did send me before you to preserve life."
      },
      "thought": "Joseph’s words to his brothers in Genesis 45 reveal a heart full of forgiveness, even after they sold him into slavery. Despite the pain they caused, he saw God’s purpose in his suffering and chose to release any bitterness. This act of mercy not only healed his relationship with his brothers but also saved their family from famine. Forgiveness can be hard, especially when we’ve been deeply hurt, but Joseph’s example shows us that it brings peace and opens the way for God’s blessings. Like Joseph, we can turn to the Savior for strength to let go of grudges. His healing power can mend broken bonds in our lives if we’re willing to forgive.",
      "application": "Think of someone you’ve struggled to forgive and write a short note or prayer asking for help to let go of any resentment.",
      "question": "What might change in my life if I fully forgave someone who has hurt me?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Deliverance",
      "title": "Saved by God’s Plan",
      "scripture": {
        "reference": "Genesis 45:7",
        "text": "And God sent me before you to preserve you a posterity in the earth, and to save your lives by a great deliverance."
      },
      "thought": "Joseph’s role in saving his family from famine mirrors the Savior’s mission to deliver us from sin and death. In Genesis 45:7, Joseph recognizes that his trials in Egypt were part of God’s plan to preserve his family. Similarly, Jesus Christ was sent to offer us a great deliverance through His Atonement. When we face hardships, it’s comforting to know that God often places people or circumstances in our path to help us through. Joseph’s story invites us to trust that God has a purpose for our struggles, even when we can’t see it yet. Let’s look for His hand in our lives today, knowing He desires to save us.",
      "application": "Share with a family member or friend a time when you felt God helped you through a difficult situation.",
      "question": "How have I seen God’s hand delivering me or my family from challenges?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Blessings",
      "title": "Priesthood Blessings Bring Strength",
      "scripture": {
        "reference": "Genesis 48:9",
        "text": "And Joseph said unto his father, They are my sons, whom God hath given me in this place. And he said, Bring them, I pray thee, unto me, and I will bless them."
      },
      "thought": "In Genesis 48, Jacob prepares to give priesthood blessings to Joseph’s sons, showing his desire to pass on spiritual strength and guidance. These blessings were a sacred way to connect his family to God’s promises and care. Today, we can also receive priesthood blessings that offer comfort, direction, and healing in our lives. Just as Jacob blessed his grandsons, we can turn to worthy priesthood holders for help in times of need. These blessings remind us that God is aware of us and wants to support us through life’s challenges. Let’s value this divine gift and seek it when we need the Lord’s guidance.",
      "application": "If you or someone in your family needs support, consider requesting a priesthood blessing this week.",
      "question": "When have I felt God’s love or guidance through a priesthood blessing?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Hope",
      "title": "Finding Purpose in Trials",
      "scripture": {
        "reference": "Genesis 50:19-20",
        "text": "And Joseph said unto them, Fear not: for am I in the place of God? But as for you, ye thought evil against me; but God meant it unto good, to bring to pass, as it is this day, to save much people alive."
      },
      "thought": "Joseph’s perspective on his trials in Genesis 50 offers profound hope for us all. Despite being sold into slavery and enduring years of hardship, he saw that God used those experiences for a greater purpose—to save lives during a famine. This reminds us that even in our darkest moments, God can bring good from our pain. When we’re struggling, it’s hard to see the bigger picture, but Joseph’s faith encourages us to trust in God’s plan. Like him, we can hold onto hope that our challenges are shaping us for something meaningful. Let’s lean on the Savior’s strength to find purpose in our trials today.",
      "application": "Reflect on a past trial and write down one way it has helped you grow or bless others.",
      "question": "How can I find hope in my current challenges by trusting in God’s greater plan?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Relationships",
      "title": "Love Unites Our Family",
      "scripture": {
        "reference": "Genesis 45:14-15",
        "text": "And he fell upon his brother Benjamin’s neck, and wept; and Benjamin wept upon his neck. Moreover he kissed all his brethren, and wept upon them: and after that his brethren talked with him."
      },
      "thought": "The emotional reunion in Genesis 45 shows the power of love and forgiveness in restoring family bonds. After years of separation and pain, Joseph embraces his brothers with tears of joy, letting go of past wrongs. This tender moment reminds us how much healing can come from showing love, even when relationships have been strained. Joseph’s example invites us to prioritize unity in our own families, no matter the challenges we’ve faced. Like the Savior, who loves us despite our mistakes, we can choose to mend broken ties with kindness. Let’s seek to build stronger connections with those we love today.",
      "application": "Reach out to a family member today with a kind word, call, or small act of service to strengthen your bond.",
      "question": "What can I do to show more love and forgiveness to someone in my family?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Trusting God’s Healing Power",
      "scripture": {
        "reference": "Genesis 47:12",
        "text": "And Joseph nourished his father, and his brethren, and all his father’s household, with bread, according to their families."
      },
      "thought": "As we wrap up this week’s study of Genesis 42–50, let’s reflect on Joseph’s incredible journey from betrayal to deliverance. His story teaches us about forgiveness, as he reconciled with his brothers, and about trust in God’s plan, as he saw divine purpose in his trials. In Genesis 47:12, we see Joseph providing for his family, much like the Savior nourishes us spiritually. We’ve also seen how Joseph’s life points us to Jesus Christ, who saves us from sin and offers healing. This week has invited us to strengthen family bonds, seek priesthood blessings, and find hope in adversity. Let’s carry these lessons forward, trusting in the Savior’s power to make all things work for our good.",
      "application": "Take time today to discuss with your family one key lesson from this week’s study and how you can apply it together.",
      "question": "How has studying Joseph’s story deepened my faith in God’s ability to heal and guide my life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:31:30",
  "source_week_file": "cfm_2026_week_12.json"
}