{
  "week_number": 15,
  "title": "Week 15: April 6–12 - Exodus 7–13",
  "date_range": "April 6–12",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Remembering God’s Deliverance",
      "scripture": {
        "reference": "Exodus 7:5",
        "text": "And the Egyptians shall know that I am the Lord, when I stretch forth mine hand upon Egypt, and bring out the children of Israel from among them."
      },
      "thought": "This week, we dive into Exodus 7–13, where we witness God’s incredible power through the plagues in Egypt and the miraculous deliverance of the Israelites. These chapters remind us that God is always in control, even when challenges seem overwhelming, and He desires for us to know Him as the Lord. The story of Pharaoh’s hard heart teaches us the importance of softening our own hearts to God’s will. The Passover, a key event in these chapters, points us to Jesus Christ and His Atonement, showing how His sacrifice frees us from the bondage of sin. As we study, let’s reflect on how God has delivered us in our own lives. How can we remember His power and love each day?",
      "application": "Take a moment today to write down one way God has delivered or blessed your family, and share it during a family discussion.",
      "question": "What personal experiences remind you of God’s power and deliverance in your life?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Trusting God’s Power",
      "scripture": {
        "reference": "Exodus 9:14",
        "text": "For I will at this time send all my plagues upon thine heart, and upon thy servants, and upon thy people; that thou mayest know that there is none like me in all the earth."
      },
      "thought": "In Exodus 9, God declares His unmatched power through the plagues, intending for Pharaoh and the Egyptians to recognize His divine authority. This message wasn’t just for Pharaoh—it was also for the Israelites, to strengthen their faith in God’s ability to save them. We, too, can trust in the Lord’s power when we face challenges that seem impossible. Just as He showed His might in Egypt, He can work miracles in our lives if we have faith in Him. Let’s remember that there is truly ‘none like [Him] in all the earth.’ How can we build our faith in His strength today?",
      "application": "Share a story with your family about a time when you felt God’s power in your life, even in a small way.",
      "question": "How can I strengthen my faith in God’s ability to help me through difficult times?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Repentance",
      "title": "Softening Our Hearts",
      "scripture": {
        "reference": "Exodus 8:28-29",
        "text": "And Pharaoh said, I will let you go, that ye may sacrifice to the Lord your God in the wilderness; only ye shall not go very far away: intreat for me. And Moses said, Behold, I go out from thee, and I will intreat the Lord that the swarms of flies may depart from Pharaoh, from his servants, and from his people, to morrow: but let not Pharaoh deal deceitfully any more in not letting the people go to sacrifice to the Lord."
      },
      "thought": "Pharaoh’s repeated promises to let the Israelites go, followed by his refusal, show the hardness of his heart in Exodus 8. Even when faced with God’s power, he resisted change and clung to his own will. This teaches us the danger of a hard heart that refuses to repent or listen to God. In contrast, a soft heart is open to the Lord’s guidance and willing to turn away from wrong choices. We can choose to soften our hearts by being humble and seeking God’s help. What steps can we take today to be more receptive to His will?",
      "application": "Identify one area in your life where you can be more open to God’s guidance, and pray for help to soften your heart in that area.",
      "question": "What is one thing I can change to show the Lord I want a soft heart?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Deliverance",
      "title": "Freed by the Lamb",
      "scripture": {
        "reference": "Exodus 12:5-7",
        "text": "Your lamb shall be without blemish, a male of the first year: ye shall take it out from the sheep, or from the goats: And ye shall keep it up until the fourteenth day of the same month: and the whole assembly of the congregation of Israel shall kill it in the evening. And they shall take of the blood, and strike it on the two side posts and on the upper door post of the houses, wherein they shall eat it."
      },
      "thought": "In Exodus 12, the Passover instructions include using the blood of a lamb without blemish to mark the doorposts, protecting the Israelites from the destroyer. This powerful symbol points directly to Jesus Christ, the Lamb of God, whose perfect sacrifice saves us from the bondage of sin. Just as the blood on the doorposts delivered the Israelites, Christ’s Atonement offers us freedom if we accept it. This reminds us that deliverance comes through Him alone. How can we show gratitude for His saving power in our daily lives? Let’s reflect on the gift of His sacrifice today.",
      "application": "Express gratitude for Christ’s Atonement in your personal or family prayer today, specifically mentioning His role as your Deliverer.",
      "question": "How does knowing Jesus is the Lamb of God help me feel His love and power in my life?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Worship",
      "title": "Remembering Through the Sacrament",
      "scripture": {
        "reference": "Exodus 12:14",
        "text": "And this day shall be unto you for a memorial; and ye shall keep it a feast to the Lord throughout your generations; ye shall keep it a feast by an ordinance for ever."
      },
      "thought": "God commanded the Israelites in Exodus 12 to observe the Passover as a lasting memorial of their deliverance from Egypt. This annual remembrance helped them never forget God’s power and love. Similarly, we partake of the sacrament each week to remember Jesus Christ and His sacrifice for us. Just as the Passover pointed to Christ, the sacrament renews our commitment to always remember Him. This sacred ordinance helps us feel His peace and strength. How can we make the sacrament a more meaningful part of our worship?",
      "application": "Prepare for the sacrament this week by reading or singing a hymn about Jesus Christ before attending church.",
      "question": "What can I do during the sacrament to focus more on Jesus Christ and His Atonement?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Finding Hope in Deliverance",
      "scripture": {
        "reference": "Exodus 13:3",
        "text": "And Moses said unto the people, Remember this day, in which ye came out from Egypt, out of the house of bondage; for by strength of hand the Lord brought you out from this place: there shall no leavened bread be eaten."
      },
      "thought": "In Exodus 13, Moses reminds the Israelites to remember the day they were freed from bondage in Egypt by the Lord’s mighty hand. This deliverance gave them hope for a new future as they left behind years of suffering. We, too, can find hope in the ways God delivers us from our struggles, whether they are physical, emotional, or spiritual. Christ’s Atonement offers us the ultimate hope of freedom from sin and sorrow. Let’s hold on to that hope as we face our own challenges. How has God’s strength given you hope in your life?",
      "application": "Write down one challenge you’re facing and a way you can trust God to help you through it, then pray for His strength.",
      "question": "How does remembering past blessings from God give me hope for the future?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Delivered by His Power",
      "scripture": {
        "reference": "Exodus 12:31-32",
        "text": "And he called for Moses and Aaron by night, and said, Rise up, and get you forth from among my people, both ye and the children of Israel; and go, serve the Lord, as ye have said. Also take your flocks and your herds, as ye have said, and be gone; and bless me also."
      },
      "thought": "As we conclude our study of Exodus 7–13 this week, we’ve seen God’s unmatched power in the plagues, Pharaoh’s hard heart, and the ultimate deliverance of the Israelites through the Passover. These stories teach us to trust in the Lord’s strength, soften our hearts to His will, and remember His saving grace through the sacrament. The Passover symbols remind us of Jesus Christ, the Lamb of God, whose Atonement frees us from sin. We’ve reflected on how God delivers us personally and gives us hope for the future. Let’s carry these lessons forward, always remembering that His power can overcome any challenge we face. How will you keep these truths alive in your heart?",
      "application": "Discuss with your family or write in a journal one key lesson from this week’s study that you want to remember and apply.",
      "question": "What is the most important way I can remember God’s deliverance in my life moving forward?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:33:29",
  "source_week_file": "cfm_2026_week_15.json"
}