{
  "week_number": 49,
  "title": "Week 49: November 30–December 6 - Micah; Nahum; Habakkuk; Zephaniah",
  "date_range": "November 30–December 6",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Prophets of Doom and Deliverance",
      "scripture": {
        "reference": "Micah 7:18",
        "text": "Who is a God like unto thee, that pardoneth iniquity, and passeth by the transgression of the remnant of his heritage? he retaineth not his anger for ever, because he delighteth in mercy."
      },
      "thought": "This week, we dive into the words of Micah, Nahum, Habakkuk, and Zephaniah—prophets who warned ancient cities of destruction due to pride and wickedness. Their messages, though rooted in a time long past, speak directly to us today as we confront similar challenges in our hearts and world. These prophets weren’t just heralds of doom; they offered hope through invitations to turn to Christ and receive His mercy. As Micah reminds us, the Lord delights in mercy, not condemnation. Let’s use this week to reflect on how we can turn away from pride and seek the deliverance only He provides. Their timeless words show us that God’s ways are everlasting.",
      "application": "Set a goal to read at least one chapter from each prophet this week to understand their dual message of warning and hope.",
      "question": "How can the warnings and promises of these ancient prophets help me draw closer to Christ today?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Trusting God’s Perfect Timing",
      "scripture": {
        "reference": "Habakkuk 2:3",
        "text": "For the vision is yet for an appointed time, but at the end it shall speak, and not lie: though it tarry, wait for it; because it will surely come, it will not tarry."
      },
      "thought": "Habakkuk wrestled with questions about God’s ways, wondering when the Lord would intervene in a world full of wickedness. The Lord’s response was a call to patience, assuring him that His promises would be fulfilled at the right time. Like Habakkuk, we often face moments when answers or solutions seem delayed. Yet, this scripture reminds us that God’s timing is perfect, even when we can’t see it. Trusting Him means waiting with faith, knowing His plans for us are sure. Let’s hold on to this promise as we navigate life’s uncertainties.",
      "application": "Write down one concern or question you’ve been waiting on God for, and commit to trust His timing by praying for patience today.",
      "question": "How have I seen God’s timing work out in my life, even when I didn’t understand it at first?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Hope",
      "title": "Finding Strength in God",
      "scripture": {
        "reference": "Nahum 1:7",
        "text": "The Lord is good, a strong hold in the day of trouble; and he knoweth them that trust in him."
      },
      "thought": "Nahum prophesied the destruction of Nineveh, a city representing cruelty and violence, yet amidst his warnings, he shared a beautiful truth about God’s nature. The Lord is good and a stronghold for us in times of trouble. Life can feel like a ‘day of trouble’ with personal struggles or worldly chaos, but this verse reminds us that we are never alone. God knows us personally and offers His strength as a refuge. Turning to Him can give us the courage to face any challenge. Let’s lean on this promise today and find peace in His protection.",
      "application": "Take a moment to pray and thank God for being your stronghold, asking for strength to face a specific challenge you’re encountering.",
      "question": "In what ways has the Lord been a stronghold for me during difficult times?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Repentance",
      "title": "What the Lord Requires",
      "scripture": {
        "reference": "Micah 6:8",
        "text": "He hath shewed thee, O man, what is good; and what doth the Lord require of thee, but to do justly, and to love mercy, and to walk humbly with thy God?"
      },
      "thought": "Micah invites us to consider what truly matters to the Lord as we stand before Him. It’s not grand gestures or elaborate offerings, but simple, heartfelt actions: doing justly, loving mercy, and walking humbly with God. In our daily lives, this means treating others fairly, showing kindness, and keeping our hearts aligned with His will. This verse is a gentle reminder to focus on the essentials of discipleship. As we strive to live this way, we draw closer to the Lord. Let’s reflect on how we can embody these principles today.",
      "application": "Choose one person today to show mercy or kindness to, perhaps by offering a kind word or helping with a task.",
      "question": "How can I better walk humbly with God in my everyday actions?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Worship",
      "title": "Rejoicing in the Lord",
      "scripture": {
        "reference": "Zephaniah 3:14",
        "text": "Sing, O daughter of Zion; shout, O Israel; be glad and rejoice with all the heart, O daughter of Jerusalem."
      },
      "thought": "Zephaniah’s prophecy includes a beautiful call to rejoice, even after warnings of destruction. He reminds the people that the Lord is with them and will bring joy to their hearts. In our own lives, we can find reasons to sing and be glad, knowing that Jesus Christ loves and supports us. This invitation to rejoice is personal—He wants us to feel His joy in our hearts. No matter the challenges we face, we can find strength in worshipping Him with gratitude. Let’s take a moment today to celebrate His presence in our lives.",
      "application": "Sing or listen to a joyful hymn or song about the Savior, and let it lift your spirit as an act of worship.",
      "question": "What blessings from the Lord make my heart want to rejoice today?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Growth",
      "title": "Faith Amidst Hardship",
      "scripture": {
        "reference": "Habakkuk 3:18",
        "text": "Yet I will rejoice in the Lord, I will joy in the God of my salvation."
      },
      "thought": "Habakkuk’s prayer in chapter 3 shows a remarkable shift from questioning to praising God, even imagining a world with no harvests or flocks. Despite such loss, he chooses to rejoice in the Lord, finding joy in God’s salvation. We, too, face times when life feels barren or unfair, yet this verse teaches us to focus on eternal blessings over temporary struggles. Our faith can grow as we choose to trust God, no matter the circumstances. Habakkuk’s example invites us to look beyond hardship and find strength in the Savior. Let’s seek that same resilience in our challenges today.",
      "application": "List three spiritual blessings you’re grateful for, and reflect on how they sustain you even when temporal things are lacking.",
      "question": "How can I cultivate joy in the Lord, even when life feels difficult?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Turning to Christ’s Mercy",
      "scripture": {
        "reference": "Zephaniah 2:3",
        "text": "Seek ye the Lord, all ye meek of the earth, which have wrought his judgment; seek righteousness, seek meekness: it may be ye shall be hid in the day of the Lord’s anger."
      },
      "thought": "This week, we’ve explored the powerful messages of Micah, Nahum, Habakkuk, and Zephaniah, who warned of destruction but also pointed us toward deliverance through Christ. Their words remind us to trust God’s timing, find strength in Him as our stronghold, and live with justice, mercy, and humility. We’ve learned to rejoice in the Lord, even in hardship, and to seek Him with meekness. Zephaniah’s call to seek righteousness is a fitting summary of our journey—it’s an invitation to turn our hearts to God. These ancient prophets show us that His mercy is always available. Let’s carry these lessons forward, trusting in His everlasting ways.",
      "application": "Share one insight from this week’s study with a family member or friend, and discuss how it can strengthen your faith.",
      "question": "Which message from these prophets has most inspired me to change or grow closer to the Lord?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:53:57",
  "source_week_file": "cfm_2026_week_49.json"
}