{
  "week_number": 47,
  "title": "Week 47: November 16–22 - Hosea 1–6; 10–14; Joel",
  "date_range": "November 16–22",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "God's Unfailing Love Awaits",
      "scripture": {
        "reference": "Hosea 14:4",
        "text": "I will heal their backsliding, I will love them freely: for mine anger is turned away from him."
      },
      "thought": "This week, as we dive into Hosea and Joel, we’re reminded of the deep, covenant relationship God has with His people, likened to a marriage. Just as Israel strayed from their promises, we sometimes falter in our devotion to the Lord. Yet, through Hosea, God declares His willingness to heal and love us freely, inviting us back with open arms. Joel echoes this mercy, promising an outpouring of the Spirit in the last days. These readings encourage us to reflect on our own faithfulness and the boundless grace God offers. Let’s use this week to strengthen our bond with Him, knowing He is always ready to welcome us home.",
      "application": "Set aside 10 minutes today to read the introduction in the Come, Follow Me manual and pray about how you can draw closer to the Lord this week.",
      "question": "How does knowing God loves me freely impact the way I approach my relationship with Him?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Covenant",
      "title": "Faithful in Covenant Love",
      "scripture": {
        "reference": "Hosea 2:19-20",
        "text": "And I will betroth thee unto me for ever; yea, I will betroth thee unto me in righteousness, and in judgment, and in lovingkindness, and in mercies. I will even betroth thee unto me in faithfulness: and thou shalt know the Lord."
      },
      "thought": "God compares His covenant with us to a marriage, full of commitment, love, and loyalty. In Hosea, He promises to betroth us forever in righteousness and mercy, even when we’ve been unfaithful. This shows us that His love is steadfast, always inviting us to return. As we ponder this, we can see how our daily choices reflect our devotion to Him. Are we showing the same loyalty and love in our covenant relationship? Let’s strive to honor our promises to God with wholehearted dedication.",
      "application": "Write down one way you can show loyalty to your covenants today, such as keeping a commandment with greater care, and act on it.",
      "question": "What does it mean to me to be betrothed to the Lord in faithfulness?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Repentance",
      "title": "Return with a Rend Heart",
      "scripture": {
        "reference": "Joel 2:13",
        "text": "And rend your heart, and not your garments, and turn unto the Lord your God: for he is gracious and merciful, slow to anger, and of great kindness, and repenteth him of the evil."
      },
      "thought": "Joel teaches us that true repentance goes beyond outward actions—it’s about a change of heart. Rending our hearts means sincerely mourning our sins and turning fully to God. The Lord promises to meet us with grace, mercy, and kindness when we do. This invites us to examine our own repentance. Are we just going through the motions, or are we truly seeking to align our hearts with His will? His patience and love make returning to Him a safe and hopeful journey.",
      "application": "Take a quiet moment today to sincerely pray for forgiveness for something specific, focusing on changing your heart rather than just your actions.",
      "question": "How can I rend my heart and show true repentance in my life?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Revelation",
      "title": "Spirit Poured Out Today",
      "scripture": {
        "reference": "Joel 2:28",
        "text": "And it shall come to pass afterward, that I will pour out my spirit upon all flesh; and your sons and your daughters shall prophesy, your old men shall dream dreams, your young men shall see visions."
      },
      "thought": "Joel’s prophecy of the Spirit being poured out on all flesh is being fulfilled in our day, as seen in the Restoration and personal revelation. President Nelson has taught that spiritual survival depends on the constant guidance of the Holy Ghost. This outpouring isn’t just rare or dramatic—it’s meant to be a steady presence in our lives. Think about how often you feel the Spirit’s whisper. Are you inviting His influence daily? Let’s seek this blessing to navigate the challenges of our time with divine help.",
      "application": "Spend a few minutes today in quiet reflection or scripture study, specifically asking for the Holy Ghost to guide your thoughts and decisions.",
      "question": "How have I felt the Spirit being poured out in my life recently?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Growth",
      "title": "Seek the Lord Always",
      "scripture": {
        "reference": "Hosea 10:12",
        "text": "Sow to yourselves in righteousness, reap in mercy; break up your fallow ground: for it is time to seek the Lord, till he come and rain righteousness upon you."
      },
      "thought": "Hosea uses farming imagery to teach us about spiritual growth—sowing righteousness leads to reaping mercy. Breaking up fallow ground means preparing our hearts to receive God’s blessings. He urges us that now is the time to seek the Lord, promising that righteousness will rain upon us. This reminds us that spiritual growth requires effort and timing. Just as a farmer works diligently, we must actively seek God in our daily lives. Let’s prepare our hearts today for His abundant blessings.",
      "application": "Choose a specific time today to pray or read scriptures, focusing on seeking the Lord with a prepared and open heart.",
      "question": "What fallow ground in my heart needs to be broken up to better seek the Lord?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Grace",
      "title": "Mercy Over Mere Sacrifice",
      "scripture": {
        "reference": "Hosea 6:6",
        "text": "For I desired mercy, and not sacrifice; and the knowledge of God more than burnt offerings."
      },
      "thought": "Hosea teaches that God values our inward devotion over outward rituals. While the Israelites offered sacrifices, they neglected mercy and true knowledge of God. This challenges us to examine our own worship—are we just checking boxes, or are we living with compassion and a deep connection to Him? Jesus later echoed this verse, showing its timeless importance. God’s grace calls us to prioritize heartfelt righteousness over mere actions. Let’s focus on what truly matters to Him today.",
      "application": "Show mercy to someone today through a kind word or small act of service, reflecting God’s desire for genuine compassion.",
      "question": "How can I focus more on mercy and knowing God rather than just outward actions?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Returning to His Love",
      "scripture": {
        "reference": "Hosea 14:5-6",
        "text": "I will be as the dew unto Israel: he shall grow as the lily, and cast forth his roots as Lebanon. His branches shall spread, and his beauty shall be as the olive tree, and his smell as Lebanon."
      },
      "thought": "This week, Hosea and Joel have shown us God’s unwavering love and invitation to return to Him, no matter how far we’ve strayed. Through covenants likened to marriage, we’ve seen His desire for our loyalty and heartfelt devotion. Joel’s promise of the Spirit’s outpouring reminds us of the guidance available today. Hosea’s plant metaphors, like growing as a lily, illustrate how repentance brings beauty and strength. We’ve learned that true worship is inward, not just outward, and that seeking God brings righteousness like rain. Let’s carry this message forward, trusting in His mercy to heal and guide us.",
      "application": "Reflect on one key insight from this week and write down how you’ll apply it in the coming days to strengthen your relationship with God.",
      "question": "What has touched my heart most about God’s love and mercy this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:52:53",
  "source_week_file": "cfm_2026_week_47.json"
}