{
  "week_number": 20,
  "title": "Week 20: May 11–17 - Deuteronomy 6–8; 15; 18; 29–30; 34",
  "date_range": "May 11–17",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Remembering the Lord Always",
      "scripture": {
        "reference": "Deuteronomy 6:12",
        "text": "Then beware lest thou forget the Lord, which brought thee forth out of the land of Egypt, from the house of bondage."
      },
      "thought": "This week, as we dive into Deuteronomy 6–8, 15, 18, 29–30, and 34, we’ll explore Moses’s final teachings to the Israelites before they entered the promised land. His urgent message was to love God with all their hearts, obey His commandments, and never forget His miracles and mercies. These chapters remind us that our journey to eternal life is less about outward achievements and more about inward transformation. Moses’s life, from the burning bush to Mount Nebo, shows us the importance of preparing our hearts to follow God. As we study, let’s consider how we can keep the Lord at the center of our lives. What can we do to ensure we don’t forget Him amid daily distractions?",
      "application": "Take a few minutes today to write down one way God has blessed your life recently, and place it somewhere you’ll see it often this week.",
      "question": "What helps you remember the Lord’s hand in your life each day?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Worship",
      "title": "Love God with Everything",
      "scripture": {
        "reference": "Deuteronomy 6:5",
        "text": "And thou shalt love the Lord thy God with all thine heart, and with all thy soul, and with all thy might."
      },
      "thought": "Moses taught the Israelites that true devotion to God isn’t just about rituals—it’s about giving Him our whole heart, soul, and strength. This verse invites us to examine how we prioritize God in our busy lives. Are we offering Him our best efforts, thoughts, and love? Loving God this way means turning to Him in prayer, seeking His guidance, and living His teachings every day. For families, this can be a reminder to show love for God together through simple acts of worship. How can we make Him the center of our hearts today?",
      "application": "During family prayer tonight, express gratitude for one specific way God has blessed your family.",
      "question": "What is one way you can show God you love Him with all your heart this week?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Service",
      "title": "Open Hands to Help",
      "scripture": {
        "reference": "Deuteronomy 15:11",
        "text": "For the poor shall never cease out of the land: therefore I command thee, saying, Thou shalt open thine hand wide unto thy brother, to thy poor, and to thy needy, in thy land."
      },
      "thought": "In Deuteronomy 15, the Lord teaches that helping those in need is not just a suggestion but a commandment. He asks us to open our hands wide, giving generously without hesitation or resentment. This principle applies to us today as we encounter friends, neighbors, or even strangers who need support. Whether it’s sharing resources, time, or a kind word, our attitude matters as much as the act itself. The Lord reminds us of His own generosity in freeing the Israelites from bondage, inspiring us to reflect that same love. How can we follow His example in our daily interactions?",
      "application": "Look for someone in need today—perhaps a neighbor or coworker—and offer a small act of kindness, like a helping hand or encouraging note.",
      "question": "How does serving others help you feel closer to God?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Faith",
      "title": "Prophets Point to Christ",
      "scripture": {
        "reference": "Deuteronomy 18:15",
        "text": "The Lord thy God will raise up unto thee a Prophet from the midst of thee, of thy brethren, like unto me; unto him ye shall hearken;"
      },
      "thought": "Moses prophesied of a future Prophet who would be like him, and we know this refers to Jesus Christ. Just as Moses led the Israelites out of physical bondage, Christ leads us out of spiritual bondage through His teachings and Atonement. This verse reminds us of the importance of listening to prophets, both ancient and modern, who guide us to the Savior. Their words help us build faith in Christ and follow His path. For children and adults alike, this is a chance to reflect on how prophets’ teachings shape our lives. How has a prophet’s message strengthened your faith in Jesus Christ?",
      "application": "Read or listen to a recent conference talk by the current prophet and note one teaching about Jesus Christ to share with someone.",
      "question": "How have the words of modern prophets helped you come closer to the Savior?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Covenant",
      "title": "Belonging to God’s People",
      "scripture": {
        "reference": "Deuteronomy 29:13",
        "text": "That he may establish thee to day for a people unto himself, and that he may be unto thee a God, as he hath said unto thee, and as he hath sworn unto thy fathers, to Abraham, to Isaac, and to Jacob."
      },
      "thought": "Moses reminded the Israelites that their covenants made them God’s chosen people, bound to Him through sacred promises. This truth applies to us today as we make and keep covenants like baptism and temple ordinances. These commitments connect us to God and to each other, giving us a sense of belonging and purpose. They remind us that we are never alone—God is our God, and we are His people. For families, discussing covenants can help children understand their importance. How do our covenants strengthen our relationship with Heavenly Father?",
      "application": "Talk with your family or a friend today about a covenant you’ve made and how it helps you feel connected to God.",
      "question": "What does it mean to you to be part of God’s covenant people?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Choose Life and Blessings",
      "scripture": {
        "reference": "Deuteronomy 30:19",
        "text": "I call heaven and earth to record this day against you, that I have set before you life and death, blessing and cursing: therefore choose life, that both thou and thy seed may live:"
      },
      "thought": "Moses’s powerful invitation to ‘choose life’ reminds us that every day we face choices between good and evil, blessings and consequences. Choosing life means aligning our actions with God’s will, trusting that His path leads to lasting happiness. This message gives us hope, knowing that we have the power to decide and that God desires our joy. It’s a call to prioritize faith, obedience, and love in our decisions. For families, this can be a reminder to support each other in making righteous choices. How can we choose life today in our thoughts and actions?",
      "application": "Make a conscious choice today to do something that brings you closer to God, like reading a scripture or serving someone.",
      "question": "What is one choice you can make this week to ‘choose life’ and follow God’s path?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Never Forget the Lord",
      "scripture": {
        "reference": "Deuteronomy 8:11",
        "text": "Beware that thou forget not the Lord thy God, in not keeping his commandments, and his judgments, and his statutes, which I command thee this day:"
      },
      "thought": "As we wrap up this week’s study of Deuteronomy, Moses’s warnings and teachings echo in our hearts—don’t forget the Lord. From loving God with all our heart to serving others, keeping covenants, and choosing life, we’ve seen how every aspect of life can point us to Him. These chapters remind us that true preparation for eternal life is about our inward devotion, not just outward actions. Moses’s life of faith, even though he never entered the promised land, shows us the power of trusting God’s plan. Let’s carry forward this week’s lessons by remembering God’s goodness every day. How will you keep Him in your heart in the coming weeks?",
      "application": "Reflect on one key insight from this week’s study and write a short goal to apply it in your life next week.",
      "question": "What is one way you’ve felt closer to God through studying Deuteronomy this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:36:30",
  "source_week_file": "cfm_2026_week_20.json"
}