{
  "week_number": 6,
  "title": "Week 6: February 2–8 - Moses 7",
  "date_range": "February 2–8",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Building Zion Together",
      "scripture": {
        "reference": "Moses 7:18",
        "text": "And the Lord called his people Zion, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them."
      },
      "thought": "This week, we dive into Moses 7, a chapter filled with powerful lessons about Enoch and the city of Zion. Zion isn’t just a place—it’s a condition of the heart, a community united in love and righteousness. As we study, we’ll explore how Enoch’s people achieved this unity and what it means for us today. The Lord desires us to build Zion in our homes and communities by becoming 'the pure in heart.' Let’s start this week with a desire to understand how we can contribute to this sacred goal. How can our family or personal choices reflect the unity and love of Zion?",
      "application": "Take a few minutes today to discuss as a family or individually write down one way you can show more unity or kindness this week.",
      "question": "What does being 'of one heart and one mind' mean to you in your daily interactions?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Identity",
      "title": "Christ, King of Zion",
      "scripture": {
        "reference": "Moses 7:53",
        "text": "And the Lord said: Blessed is he through whose seed Messiah shall come; for he saith—I am Messiah, the King of Zion, the Rock of Heaven, which is broad as eternity; whoso cometh in at the gate and climbeth up by me shall never fall; wherefore, blessed are they of whom I have spoken, for they shall come forth with songs of everlasting joy."
      },
      "thought": "In this verse, Jesus Christ declares Himself the 'King of Zion,' a title that reminds us of His central role in our lives and in building Zion. As our King, He invites us to come to Him and climb up by His strength, promising that we will never fall. This gives us confidence that as we strive to build Zion in our hearts and homes, we are not alone. Christ leads the way, offering His guidance and grace. Reflecting on His titles, like 'Rock of Heaven,' can deepen our trust in His power to help us. How can we more fully accept Him as our King today?",
      "application": "Spend a quiet moment today pondering or singing 'Come, O Thou King of Kings' (Hymns, no. 59) to feel closer to Christ as your King.",
      "question": "What does it mean to you to 'climb up by' Jesus Christ in your daily life?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Challenges",
      "title": "God Weeps With Us",
      "scripture": {
        "reference": "Moses 7:28-29",
        "text": "And it came to pass that the God of Heaven looked upon the residue of the people, and he wept; and Enoch bore record of it, saying: How is it that the heavens weep, and shed forth their tears as the rain upon the mountains? And Enoch said unto the Lord: How is it that thou canst weep, seeing thou art holy, and from all eternity to all eternity?"
      },
      "thought": "Enoch was astonished to see God weep over the wickedness of His children, revealing a tender, loving side of our Heavenly Father. This teaches us that God is not distant—He feels our pain and sorrows deeply. When we face challenges or see loved ones struggle, we can find comfort knowing that God weeps with us. His tears remind us that we are never alone in our trials. As we build Zion, this empathy can inspire us to reach out to others in their pain. How can knowing God cares so deeply change the way we face difficulties?",
      "application": "Reach out to someone who might be struggling today with a kind word or small act of support, mirroring God’s compassion.",
      "question": "How does knowing that God weeps for His children affect the way you view your own challenges?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Hope",
      "title": "Rejoice Despite Bitterness",
      "scripture": {
        "reference": "Moses 7:44",
        "text": "And as Enoch saw this, he had bitterness of soul, and wept over his brethren, and said unto the heavens: I will refuse to be comforted; but the Lord said unto Enoch: Lift up thine heart, and be glad; and look."
      },
      "thought": "Enoch felt deep sorrow as he saw the suffering and wickedness around him, yet the Lord encouraged him to lift up his heart and be glad. This reminds us that even in our darkest moments, there are reasons to hope and rejoice. God shared with Enoch visions of future redemption and joy, showing that His plan ultimately brings light. In our lives, we can look for God’s promises amid our 'bitterness' and trust in His greater purpose. Building Zion includes holding onto hope, even when things seem bleak. What can help us lift our hearts today?",
      "application": "Write down one thing that brings you joy or hope, no matter how small, and keep it somewhere visible as a reminder to 'be glad.'",
      "question": "What helps you to 'lift up your heart' when you feel overwhelmed or sad?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Faith",
      "title": "Preparing for Christ’s Return",
      "scripture": {
        "reference": "Moses 7:60",
        "text": "And the Lord said unto Enoch: As I live, even so will I come in the last days, in the days of wickedness and vengeance, to fulfil the oath which I have made unto you concerning the children of Noah;"
      },
      "thought": "Enoch’s vision included a powerful prophecy of the Savior’s Second Coming, a reminder that Christ will return to earth as promised. This gives us something to look forward to, even in a world full of challenges. As we build Zion, we prepare not just our hearts but our lives for His return. Thinking about this event can motivate us to live righteously and help others do the same. We can feel excitement, just like waiting for a loved one to come home. How can we ready ourselves for that glorious day?",
      "application": "Choose one small way to prepare for Christ’s return today, like praying for strength to live more righteously.",
      "question": "How does the promise of Christ’s Second Coming influence the choices you make each day?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Relationships",
      "title": "Unity in Zion’s Heart",
      "scripture": {
        "reference": "Moses 7:19",
        "text": "And Enoch continued his preaching in righteousness unto the people of God. And it came to pass in his days, that he built a city that was called the City of Holiness, even Zion."
      },
      "thought": "Enoch’s efforts led to the creation of Zion, a city of holiness where people lived in unity and righteousness. This shows us that building Zion starts with relationships—how we treat and love one another. As Latter-day Saints, we’re called to foster this unity in our families and communities, reflecting the 'one heart and one mind' of Enoch’s people. Small acts of kindness and understanding can strengthen our bonds and bring us closer to Zion. Imagine how our homes could change with this focus. What can we do to build a 'city of holiness' in our relationships?",
      "application": "Do one intentional act of unity today, like helping a family member with a task or resolving a small conflict with patience.",
      "question": "What is one way you can help your family or community feel more like Zion through your relationships?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Zion in Our Hearts",
      "scripture": {
        "reference": "Moses 7:62",
        "text": "And righteousness will I send down out of heaven; and truth will I send forth out of the earth, to bear testimony of mine Only Begotten; his resurrection from the dead; yea, and also the resurrection of all men; and righteousness and truth will I cause to sweep the earth as with a flood, to gather out mine elect from the four quarters of the earth, unto a place which I shall prepare, an Holy City, that my people may gird up their loins, and be looking forth for the time of my coming; for there shall be my tabernacle, and it shall be called Zion, a New Jerusalem."
      },
      "thought": "This week, we’ve explored Moses 7 and the inspiring story of Enoch’s Zion—a people united in heart and mind, led by Christ, the King of Zion. We’ve seen God’s deep love as He weeps for His children and His promise of hope through Christ’s return. Building Zion starts within us, in how we prepare, love, and unite with others. Let’s carry forward the lessons of unity, compassion, and faith as we strive to make our hearts and homes places of holiness. Reflect on how this week’s study has inspired you to contribute to Zion. How can we continue this sacred work together?",
      "application": "As a family or individually, set a goal for the coming week to build Zion by choosing one principle from this week’s study to focus on.",
      "question": "How has studying Moses 7 this week changed your understanding of what it means to build Zion in your life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:27:47",
  "source_week_file": "cfm_2026_week_06.json"
}