{
  "week_number": 18,
  "title": "Week 18: April 27–May 3 - Exodus 35–40; Leviticus 1; 4; 16; 19",
  "date_range": "April 27–May 3",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Holiness to the Lord",
      "scripture": {
        "reference": "Leviticus 19:2",
        "text": "Speak unto all the congregation of the children of Israel, and say unto them, Ye shall be holy: for I the Lord your God am holy."
      },
      "thought": "This week, we dive into the sacred teachings of Exodus and Leviticus, where God invites His people to become holy as He is holy. The Israelites, having left Egypt, were not just journeying to a promised land but toward a deeper transformation of heart and spirit. Through the building of the tabernacle and the giving of laws, God provided a path for them to draw closer to Him. These ancient practices, like sacrifices and ordinances, point us to Jesus Christ, the true source of holiness. As we study, let’s consider how we, too, can leave behind the captivity of sin and follow the Savior’s promise to make us holy. What steps can we take this week to align our lives with His sacred call?",
      "application": "Set a goal this week to create a 'holy space' in your home or heart by dedicating time each day to scripture study or prayer.",
      "question": "What does holiness mean to you, and how can you invite more of it into your life this week?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Worship",
      "title": "Building with Willing Hearts",
      "scripture": {
        "reference": "Exodus 35:5",
        "text": "Take ye from among you an offering unto the Lord: whosoever is of a willing heart, let him bring it, an offering of the Lord; gold, and silver, and brass."
      },
      "thought": "In Exodus 35, the Israelites were asked to contribute to the building of the tabernacle, a sacred place of worship, with a willing heart. Their response was overwhelming, as they gave generously of their resources and talents. This teaches us that true worship involves offering what we have—whether it’s time, skills, or love—with sincerity and joy. God doesn’t measure the size of our offering but the spirit behind it. As we think about our contributions to His work today, let’s remember that a willing heart transforms even small acts into sacred offerings. How can we give more fully to the Lord this week?",
      "application": "Identify one way you can contribute to your ward or family today, such as helping with a service project or sharing a talent.",
      "question": "What do you feel the Lord is asking you to offer with a willing heart right now?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Repentance",
      "title": "Forgiveness Through Sacrifice",
      "scripture": {
        "reference": "Leviticus 1:4",
        "text": "And he shall put his hand upon the head of the burnt offering; and it shall be accepted for him to make atonement for him."
      },
      "thought": "In Leviticus 1, we read about animal sacrifices that symbolized atonement for sin, teaching the Israelites about the need for forgiveness. This act of placing hands on the offering represented transferring guilt and seeking reconciliation with God. While we no longer offer animals, these rituals remind us of Jesus Christ’s ultimate sacrifice, through which we receive forgiveness. His Atonement allows us to lay our burdens at His feet and find peace. As we reflect on this, let’s consider how we approach repentance today. Are we truly seeking the Savior’s help to cleanse our hearts?",
      "application": "Take a quiet moment today to pray for forgiveness and thank the Savior for His atoning sacrifice.",
      "question": "How does understanding Christ’s sacrifice change the way you approach repentance?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Covenant",
      "title": "Sacred Ordinances Draw Us Near",
      "scripture": {
        "reference": "Exodus 40:12-13",
        "text": "And thou shalt bring Aaron and his sons unto the door of the tabernacle of the congregation, and wash them with water. And thou shalt put upon Aaron the holy garments, and anoint him, and sanctify him; that he may minister unto me in the priest’s office."
      },
      "thought": "Exodus 40 describes ancient ordinances like washing and anointing, which prepared Aaron and his sons for sacred service. These rituals, also present in our temples today, symbolize purification and dedication to God. They remind us of our covenants to follow the Savior and draw closer to Him. Through these sacred acts, we are set apart for holy purposes, just as Aaron was. Let’s ponder how participating in or preparing for temple ordinances can strengthen our connection to Christ. How do these covenants help us become more like Him?",
      "application": "If possible, plan a time to attend the temple this month or reflect on your temple covenants during personal prayer.",
      "question": "How do temple ordinances help you feel closer to Jesus Christ?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Growth",
      "title": "Becoming Holy Through Obedience",
      "scripture": {
        "reference": "Leviticus 19:18",
        "text": "Thou shalt not avenge, nor bear any grudge against the children of thy people, but thou shalt love thy neighbour as thyself: I am the Lord."
      },
      "thought": "Leviticus 19 offers commandments to help the Israelites grow in holiness, including the powerful directive to love our neighbor as ourselves. This law challenges us to set aside grudges and act with kindness, reflecting God’s love in our actions. Obedience to such principles shapes our hearts, helping us become more like the Savior. Holiness isn’t just about avoiding sin; it’s about actively choosing love and compassion. As we strive to follow this commandment, we invite the Lord’s transforming power into our lives. How can loving others help us grow spiritually today?",
      "application": "Reach out to a neighbor or friend today with a kind word or small act of service.",
      "question": "Who in your life could use a little more love, and how can you show it?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Faith",
      "title": "Feeling God in Holy Places",
      "scripture": {
        "reference": "Exodus 40:34",
        "text": "Then a cloud covered the tent of the congregation, and the glory of the Lord filled the tabernacle."
      },
      "thought": "In Exodus 40, after the tabernacle was completed, the glory of the Lord filled it, showing His presence among His people. This sacred space became a place where the Israelites could feel closer to God. Today, we have temples, churches, and even our homes as holy places where we can seek His Spirit. Faith grows as we intentionally enter these spaces to connect with Him. Let’s trust that the Lord desires to be near us, just as He was with the Israelites. How can we invite His presence into our lives today?",
      "application": "Spend a few minutes in a quiet, sacred space today—whether at home or elsewhere—to pray and feel God’s presence.",
      "question": "Where do you feel closest to the Lord, and how can you visit that place more often?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "A Path to Holiness",
      "scripture": {
        "reference": "Doctrine and Covenants 60:7",
        "text": "And in this place let them lift up their voice and declare my word with loud voices, without wrath or doubting, lifting up holy hands, and taking upon them my name. For I am able to make you holy, and your sins are forgiven you."
      },
      "thought": "As we wrap up this week’s study of Exodus and Leviticus, we’ve seen how God invited the Israelites to become holy through the tabernacle, sacrifices, and commandments. Each lesson pointed to Jesus Christ, the true source of holiness and forgiveness. From willing offerings to sacred ordinances, we’ve explored ways to draw closer to Him. The Savior’s promise in Doctrine and Covenants 60:7 reminds us that He can make us holy, no matter where we’ve been. Let’s carry forward this week’s insights by seeking holiness in our daily choices. How has this study deepened your desire to follow Christ?",
      "application": "Write down one key lesson from this week and commit to applying it in the coming days.",
      "question": "How has learning about holiness this week changed your perspective on your relationship with the Savior?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:35:10",
  "source_week_file": "cfm_2026_week_18.json"
}