{
  "week_number": 44,
  "title": "Week 44: October 26–November 1 - Jeremiah 31–33; 36–38; Lamentations 1; 3",
  "date_range": "October 26–November 1",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Turning Mourning into Joy",
      "scripture": {
        "reference": "Jeremiah 31:13",
        "text": "Then shall the virgin rejoice in the dance, both young men and old together: for I will turn their mourning into joy, and will comfort them, and make them rejoice from their sorrow."
      },
      "thought": "This week, we dive into the powerful messages of Jeremiah and Lamentations, where we see a people in captivity and sorrow due to sin and rebellion. Yet, amidst the ruins, the Lord offers hope through a new covenant and the promise of a Messiah, the 'Branch of righteousness.' Jeremiah’s mission wasn’t just to warn but to build and plant seeds of faith for a brighter future. As we study, we’ll discover how God can transform our personal struggles into joy when we turn to Him. These chapters remind us that no matter the depth of our challenges, the Lord’s love and promises are everlasting. Let’s open our hearts to His healing as we explore these scriptures together.",
      "application": "Take a moment today to write down one personal struggle or sorrow you’re facing, and pray for the Lord to turn it into joy this week.",
      "question": "How have I seen the Lord bring joy out of difficult moments in my life?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Covenant",
      "title": "Hearts Written with Covenants",
      "scripture": {
        "reference": "Jeremiah 31:33",
        "text": "But this shall be the covenant that I will make with the house of Israel; After those days, saith the Lord, I will put my law in their inward parts, and write it in their hearts; and will be their God, and they shall be my people."
      },
      "thought": "Jeremiah speaks of a new covenant, one that goes beyond outward actions to a deep, personal connection with God. Having His law written in our hearts means our devotion isn’t just in rituals but in how we live every day. As part of God’s covenant people, we’re invited to let His teachings shape our thoughts and choices. This promise reminds us that through sacred ordinances like baptism, we commit to follow Him, and He commits to be with us. Imagine the strength that comes from such a bond! Let’s reflect on how our covenants change us from the inside out.",
      "application": "Spend a few minutes today reviewing the covenants you’ve made, such as at baptism, and write one way you can live them more fully.",
      "question": "What does it mean to me to have God’s law written in my heart?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Revelation",
      "title": "Scriptures Turn Us to God",
      "scripture": {
        "reference": "Jeremiah 36:3",
        "text": "It may be that the house of Judah will hear all the evil which I purpose to do unto them; that they may return every man from his evil way; that I may forgive their iniquity and their sin."
      },
      "thought": "The Lord commanded Jeremiah to write down His prophecies, hoping the people would hear and turn away from evil. The scriptures are a powerful tool for revelation, guiding us back to God when we stray. In this chapter, we see varied reactions—some reject the words, while others heed them. This reminds us of the importance of valuing the scriptures in our lives as a source of divine guidance. They can warn us, comfort us, and show us the path to forgiveness. How do we respond when we read God’s words?",
      "application": "Choose a short passage from the Book of Mormon or Bible to read aloud today, and note one insight or warning it offers you.",
      "question": "How have the scriptures helped me turn away from wrong choices in the past?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Obedience",
      "title": "Following the Prophet’s Voice",
      "scripture": {
        "reference": "Jeremiah 37:2",
        "text": "But neither he, nor his servants, nor the people of the land, did hearken unto the words of the Lord, which he spake by the prophet Jeremiah."
      },
      "thought": "King Zedekiah’s story in Jeremiah 37 shows a tragic mix of belief and disbelief in the prophet’s words. He sought Jeremiah’s counsel but refused to fully obey, leading to dire consequences. This teaches us the importance of not just hearing but acting on the guidance of God’s prophets. When we follow their counsel, we align ourselves with the Lord’s will and find safety. Ignoring their warnings, as Zedekiah did, can lead to unnecessary suffering. Let’s commit to listening and obeying with full trust.",
      "application": "Listen to or read a recent conference talk by the prophet today, and choose one piece of counsel to act on this week.",
      "question": "What is one way I can better follow the living prophet’s guidance in my daily life?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Faith",
      "title": "Boldly Standing for Right",
      "scripture": {
        "reference": "Jeremiah 38:9-10",
        "text": "My lord the king, these men have done evil in all that they have done to Jeremiah the prophet, whom they have cast into the dungeon; and he is like to die for hunger in the place where he is: for there is no more bread in the city. Then the king commanded Ebed-melech the Ethiopian, saying, Take from hence thirty men with thee, and take up Jeremiah the prophet out of the dungeon, before he die."
      },
      "thought": "Ebed-melech’s courage in Jeremiah 38 is inspiring—he risked his position to save Jeremiah from a dungeon, showing faith in standing up for what is right. His actions remind us that defending truth, even when it’s unpopular, brings blessings from the Lord. We may not face dungeons, but we do encounter moments where we must speak up for our beliefs. Ebed-melech’s example encourages us to be bold, knowing God sees and honors our faithfulness. His story shows that one person’s bravery can make a difference. How can we follow his lead in our own lives?",
      "application": "Look for an opportunity today to kindly stand up for a gospel principle in a conversation or situation.",
      "question": "When have I felt the strength to stand up for what’s right, even when it was hard?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Hope",
      "title": "Finding Hope in Sorrow",
      "scripture": {
        "reference": "Lamentations 3:22-23",
        "text": "It is of the Lord’s mercies that we are not consumed, because his compassions fail not. They are new every morning: great is thy faithfulness."
      },
      "thought": "Lamentations captures the deep sorrow of Israel after Jerusalem’s destruction, yet it also offers hope through God’s unending mercy. These verses remind us that even in our darkest moments, the Lord’s compassion renews each day. Whether we’re mourning sin, loss, or hardship, Christ’s love provides a way forward. As President Ballard taught, we must never give up, for hope is always available through the Savior. This message can lift us when we feel overwhelmed by life’s challenges. Let’s hold onto the promise that God’s faithfulness is great and ever-present.",
      "application": "Write down one thing you’re struggling with, and beside it, write a way you’ve seen God’s mercy in your life recently.",
      "question": "How can I rely on the Lord’s daily compassion to find hope in my current challenges?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Rebuilding with God’s Love",
      "scripture": {
        "reference": "Jeremiah 33:15",
        "text": "In those days, and at that time, will I cause the Branch of righteousness to grow up unto David; and he shall execute judgment and righteousness in the land."
      },
      "thought": "This week, we’ve explored Jeremiah’s prophecies and the laments of a fallen Jerusalem, seeing both destruction and the promise of restoration through the Messiah, the 'Branch of righteousness.' We’ve learned about the new covenant written in our hearts, the power of scriptures to turn us from evil, and the courage to stand for truth like Ebed-melech. We’ve also found hope in God’s mercies that renew each morning, even amidst sorrow. These lessons remind us that no matter the ruins in our lives, Christ offers rebuilding and joy. As we’ve pondered obedience to prophets and the strength of covenants, we see how God’s love guides us. Let’s carry this hope and commitment into the coming week.",
      "application": "Share one insight from this week’s study with a family member or friend, and discuss how it can strengthen you both.",
      "question": "What is one way I’ve felt God turning my mourning into joy this week?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:51:06",
  "source_week_file": "cfm_2026_week_44.json"
}