{
  "week_number": 51,
  "title": "Week 51: December 14–20 - Malachi",
  "date_range": "December 14–20",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "God’s Enduring Love Revealed",
      "scripture": {
        "reference": "Malachi 1:2",
        "text": "I have loved you, saith the Lord. Yet ye say, Wherein hast thou loved us?"
      },
      "thought": "This week, as we study the book of Malachi, we are reminded of God’s unwavering love for His covenant people, even when they struggled to see it. Despite Israel’s history of rebellion and hardship, the Lord continually reached out to them with mercy and promises of redemption. Malachi’s message invites us to reflect on how we feel God’s love in our own lives, even amid challenges. It’s a call to examine our relationship with Him and recognize His hand in our story. As we dive into these chapters, let’s look for ways the Lord asks us to return to Him. His love is the foundation of every lesson this week.",
      "application": "Take a moment today to write down one way you’ve felt God’s love in your life, no matter how small it seems.",
      "question": "How can I better recognize the Lord’s love for me in my daily experiences?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Worship",
      "title": "Offering Pure Sacrifices Today",
      "scripture": {
        "reference": "Malachi 1:11",
        "text": "For from the rising of the sun even unto the going down of the same my name shall be great among the Gentiles; and in every place incense shall be offered unto my name, and a pure offering: for my name shall be great among the heathen, saith the Lord of hosts."
      },
      "thought": "In Malachi’s time, the priests offered sacrifices that did not honor God, reflecting a lack of reverence in their worship. The Lord desired a 'pure offering,' one given with a sincere heart. Today, our offerings might include our time, talents, or devotion in serving Him. When we give half-heartedly, it’s like offering something 'polluted,' but when we give with love, it becomes a pure sacrifice. Let’s consider how our daily actions show honor to the Lord. Are we giving Him our best, or just what’s left over?",
      "application": "Choose one way to worship today—perhaps through prayer or service—and do it with full intention and focus.",
      "question": "What can I do to make my offerings to the Lord more sincere and meaningful?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Faith",
      "title": "Tithing Opens Heaven’s Windows",
      "scripture": {
        "reference": "Malachi 3:10",
        "text": "Bring ye all the tithes into the storehouse, that there may be meat in mine house, and prove me now herewith, saith the Lord of hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall not be room enough to receive it."
      },
      "thought": "Malachi teaches that paying tithing is an act of faith that invites the Lord to bless us abundantly. The phrase 'windows of heaven' suggests blessings so great they overflow, beyond what we can imagine. When we pay tithing, we show trust in God’s promises, even when it feels hard to give. This obedience strengthens our relationship with Him and helps us become more generous and faithful. Think of the subtle ways the Lord has blessed you through tithing. His promises are sure, and He waits to pour out those blessings.",
      "application": "If you pay tithing, reflect on a blessing you’ve received from this act; if not, consider taking a small step toward this principle today.",
      "question": "How has paying tithing helped me grow closer to Heavenly Father and Jesus Christ?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Repentance",
      "title": "Return and Be Blessed",
      "scripture": {
        "reference": "Malachi 3:7",
        "text": "Even from the days of your fathers ye are gone away from mine ordinances, and have not kept them. Return unto me, and I will return unto you, saith the Lord of hosts."
      },
      "thought": "The Lord’s invitation in Malachi to 'return unto me' is a tender call to repentance. He promises that if we turn back to Him, He will draw near to us with love and mercy. This reminds us that no matter how far we’ve strayed, the path back to God is always open. In our busy lives, we might drift from His ordinances or priorities without realizing it. Let’s take this invitation to heart and identify one area where we can return to Him. His promise to return to us is a beautiful assurance of His grace.",
      "application": "Spend a quiet moment today identifying one habit or attitude you can change to return closer to the Lord.",
      "question": "In what specific ways do I need to return to the Lord right now?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Hope",
      "title": "Healing in His Wings",
      "scripture": {
        "reference": "Malachi 4:2",
        "text": "But unto you that fear my name shall the Sun of Righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall."
      },
      "thought": "Malachi describes Jesus Christ as the 'Sun of Righteousness,' bringing healing and hope to those who revere God. The imagery of 'healing in his wings' reminds us of the Savior’s power to mend our broken hearts and lives. No matter the struggles we face, His light can warm and restore us. This promise gives us hope to keep moving forward, trusting in His care. As we approach the Christmas season, let’s look for His healing presence in our daily lives. He is always near, ready to lift us up.",
      "application": "Take a moment today to thank the Savior for a specific way He has brought healing to your life.",
      "question": "How can I seek the Savior’s healing power in my current challenges?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Relationships",
      "title": "Turning Hearts to Ancestors",
      "scripture": {
        "reference": "Malachi 4:5-6",
        "text": "Behold, I will send you Elijah the prophet before the coming of the great and dreadful day of the Lord: And he shall turn the heart of the fathers to the children, and the heart of the children to their fathers, lest I come and smite the earth with a curse."
      },
      "thought": "Malachi’s prophecy about Elijah turning hearts to families is a powerful reminder of the importance of our ancestors in God’s plan. This promise was fulfilled when Elijah appeared in the Kirtland Temple, restoring the sealing power that binds families for eternity. When we turn our hearts to our ancestors through family history or temple work, we participate in this sacred promise. It strengthens our connection to those who came before us and to God’s eternal plan. Even small efforts to learn about our heritage can bring us closer to our loved ones. Let’s cherish these eternal relationships today.",
      "application": "Spend a few minutes on FamilySearch.org or share a family story with a loved one to connect with your ancestors.",
      "question": "What experiences have helped me feel a connection to my ancestors?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Reflecting on God’s Love",
      "scripture": {
        "reference": "Malachi 3:8-9",
        "text": "Will a man rob God? Yet ye have robbed me. But ye say, Wherein have we robbed thee? In tithes and offerings. Ye are cursed with a curse: for ye have robbed me, even this whole nation."
      },
      "thought": "As we close our study of Malachi this week, let’s reflect on the powerful themes of God’s love, repentance, and covenant promises. From recognizing His enduring love to offering pure sacrifices, paying tithing, and turning our hearts to family, Malachi’s words invite us to draw closer to the Lord. We’ve seen how returning to Him brings blessings and healing through the Savior, the 'Sun of Righteousness.' Each lesson reminds us that God never stops reaching out to us, even when we falter. Let’s carry this message into the coming week, striving to honor Him in all we do. His love is the thread that ties our story together.",
      "application": "Review your notes or thoughts from this week and choose one principle to focus on improving in the days ahead.",
      "question": "How has studying Malachi helped me feel God’s love and guidance more deeply in my life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:55:15",
  "source_week_file": "cfm_2026_week_51.json"
}