{
  "week_number": 50,
  "title": "Week 50: December 7–13 - Haggai 1–2; Zechariah 1–4; 7–14",
  "date_range": "December 7–13",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Rebuilding with God's Strength",
      "scripture": {
        "reference": "Haggai 2:4-5",
        "text": "Yet now be strong, O Zerubbabel, saith the Lord; and be strong, O Joshua, son of Josedech, the high priest; and be strong, all ye people of the land, saith the Lord, and work: for I am with you, saith the Lord of hosts: According to the word that I covenanted with you when ye came out of Egypt, so my spirit remaineth among you: fear ye not."
      },
      "thought": "This week, we dive into the messages of Haggai and Zechariah, prophets who encouraged the Israelites returning from captivity to rebuild the temple and their spiritual lives. Their words remind us that God is with us as we work to prioritize Him in our lives. Just as the Israelites faced the daunting task of restoring the temple, we too face challenges in building holiness in our hearts and homes. Haggai’s call to 'be strong' and Zechariah’s visions of a holy future inspire us to trust in the Lord’s presence. Let’s explore how we can rebuild our spiritual foundations and welcome the Savior into our lives. As we study, we’ll find promises of peace and glory that apply to us today.",
      "application": "Take a moment to pray as a family or individually, asking for strength to focus on spiritual priorities this week.",
      "question": "What in my life needs rebuilding to better align with God’s will?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Priorities",
      "title": "Consider Your Ways Today",
      "scripture": {
        "reference": "Haggai 1:5-6",
        "text": "Now therefore thus saith the Lord of hosts; Consider your ways. Ye have sown much, and bring in little; ye eat, but ye have not enough; ye drink, but ye are not filled with drink; ye clothe you, but there is none warm; and he that earneth wages earneth wages to put it into a bag with holes."
      },
      "thought": "The Lord’s message through Haggai to the Israelites was clear: they had neglected the temple while focusing on their own needs, and as a result, their efforts felt empty. This can resonate with us when we prioritize worldly concerns over spiritual matters, finding ourselves unfulfilled despite our busyness. The Lord invites us to 'consider our ways' and realign our focus on Him. Just as the Israelites were called to rebuild the temple, we are called to build our lives around God’s will. When we put Him first, our efforts gain purpose and satisfaction. Let’s reflect on how we spend our time and energy today.",
      "application": "Make a list of your daily activities and identify one way to prioritize a spiritual practice, like prayer or scripture study.",
      "question": "How can I shift my focus to put God first in my daily routine?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Holiness",
      "title": "Holiness in Everyday Life",
      "scripture": {
        "reference": "Zechariah 14:20-21",
        "text": "In that day shall there be upon the bells of the horses, Holiness Unto The Lord; and the pots in the Lord’s house shall be like the bowls before the altar. Yea, every pot in Jerusalem and in Judah shall be holiness unto the Lord of hosts: and all they that sacrifice shall come and take of them, and seethe therein: and in that day there shall be no more the Canaanite in the house of the Lord of hosts."
      },
      "thought": "Zechariah’s vision of a future where even everyday objects bear the inscription 'Holiness unto the Lord' is a powerful reminder of God’s desire for us to live holy lives. This isn’t just about temples or sacred spaces—it’s about bringing holiness into our daily actions and surroundings. Imagine if everything we touched or did reflected our devotion to God. This can inspire us to treat our homes, relationships, and even mundane tasks with reverence. As we strive for holiness, we prepare ourselves to dwell with the Lord. Let’s consider how we can make holiness a part of our everyday lives.",
      "application": "Choose one everyday object or task today and dedicate it to the Lord by doing it with extra care or gratitude.",
      "question": "What can I do to bring a sense of holiness into my home or daily routines?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Covenants",
      "title": "Clean Through His Covenant",
      "scripture": {
        "reference": "Zechariah 3:3-4",
        "text": "Now Joshua was clothed with filthy garments, and stood before the angel. And he answered and spake unto those that stood before him, saying, Take away the filthy garments from him. And unto him he said, Behold, I have caused thine iniquity to pass from thee, and I will clothe thee with change of raiment."
      },
      "thought": "In Zechariah’s vision, the high priest Joshua stands in filthy garments, symbolizing sin, but an angel removes them and gives him clean clothing, representing forgiveness and renewal. This teaches us about the power of covenants, like baptism, to cleanse us from sin and help us become more like Heavenly Father and Jesus Christ. Each time we repent and renew our covenants, especially through the sacrament, we are offered a fresh start. This vision reminds us that the Lord desires to make us clean and holy. We can trust in His grace to transform us. How can we honor our covenants today to stay clean before Him?",
      "application": "Reflect on your baptismal covenant by reading or singing 'When I Am Baptized' and commit to one way to keep it today.",
      "question": "How do my covenants help me feel closer to God and become more like Him?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Hope",
      "title": "The Messiah Brings Salvation",
      "scripture": {
        "reference": "Zechariah 9:9",
        "text": "Rejoice greatly, O daughter of Zion; shout, O daughter of Jerusalem: behold, thy King cometh unto thee: he is just, and having salvation; lowly, and riding upon an ass, and upon a colt the foal of an ass."
      },
      "thought": "Zechariah’s prophecy of the Messiah entering Jerusalem on a donkey was fulfilled during Jesus Christ’s triumphal entry, a moment of great joy and hope for His followers. This reminds us that Jesus is our King who brings salvation, even in humble ways. His life and Atonement offer us hope no matter our circumstances. We can rejoice in knowing He has come and will come again. As we prepare for His Second Coming, we can welcome Him into our lives now. Let’s hold onto this hope and share it with others today.",
      "application": "Share a message of hope about Jesus Christ with a family member or friend through a note or conversation.",
      "question": "How can I welcome Jesus more fully into my heart and home?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Faith",
      "title": "Trust in God’s Promises",
      "scripture": {
        "reference": "Haggai 2:9",
        "text": "The glory of this latter house shall be greater than of the former, saith the Lord of hosts: and in this place will I give peace, saith the Lord of hosts."
      },
      "thought": "The Lord promised the Israelites through Haggai that the rebuilt temple would surpass the glory of the former one, and He would bring peace to that place. This assurance must have strengthened their faith as they worked on a task that seemed overwhelming. Similarly, we can trust in God’s promises when we face challenges in building our spiritual lives or serving in His kingdom. His peace is available to us as we move forward with faith. Even when the path is unclear, we can rely on His word. Let’s hold fast to His promises today.",
      "application": "Write down one promise from the scriptures or a Church leader that gives you peace, and keep it somewhere visible today.",
      "question": "What promise from God can I trust in during a current challenge?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Building Holiness Together",
      "scripture": {
        "reference": "Zechariah 8:16-17",
        "text": "These are the things that ye shall do; Speak ye every man the truth to his neighbour; execute the judgment of truth and peace in your gates: And let none of you imagine evil in your hearts against his neighbour; and love no false oath: for all these are things that I hate, saith the Lord."
      },
      "thought": "This week, we’ve learned from Haggai and Zechariah about rebuilding not just physical temples but also our spiritual lives. Haggai taught us to consider our ways and prioritize God, while Zechariah’s visions of holiness and the Messiah filled us with hope for the future. We’ve seen how covenants cleanse us and how the Savior’s coming brings salvation. These prophets remind us to live with integrity, truth, and peace, as Zechariah counsels. Together, we can build lives of holiness unto the Lord. Let’s carry these lessons forward, trusting in God’s strength and promises.",
      "application": "Discuss as a family or individually one key lesson from this week’s study and set a goal to apply it in the coming days.",
      "question": "How has this week’s study helped me grow closer to God and prioritize holiness in my life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:54:38",
  "source_week_file": "cfm_2026_week_50.json"
}