{
  "week_number": 7,
  "title": "Week 7: February 9–15 - Genesis 6–11; Moses 8",
  "date_range": "February 9–15",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Noah’s Grace Guides Us",
      "scripture": {
        "reference": "Moses 8:27",
        "text": "And thus Noah found grace in the eyes of the Lord; for Noah was a just man, and perfect in his generation; and he walked with God, as did also his three sons, Shem, Ham, and Japheth."
      },
      "thought": "This week, we dive into the stories of Noah and the Flood, as well as the Tower of Babel, from Genesis 6–11 and Moses 8. These ancient accounts mirror our own time, showing a world filled with corruption and violence, yet also revealing how God’s grace can protect and guide us. Noah found favor with the Lord by living righteously, and his story teaches us how to seek safety in turbulent times. Similarly, the Tower of Babel reminds us of the consequences of pride and the importance of following God’s way. As we study, we’ll see how following the prophet and making covenants with the Lord can shield our families today. Let’s explore how these lessons apply to our lives in the latter days.",
      "application": "Set a goal as a family to discuss one key lesson from this week’s reading each day during a meal or family time.",
      "question": "How can Noah’s example of finding grace with God inspire us to live righteously in our challenging world?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Faith",
      "title": "Building Faith Like Noah",
      "scripture": {
        "reference": "Genesis 6:13-14",
        "text": "And God said unto Noah, The end of all flesh is come before me; for the earth is filled with violence through them; and, behold, I will destroy them with the earth. Make thee an ark of gopher wood; rooms shalt thou make in the ark, and shalt pitch it within and without with pitch."
      },
      "thought": "Noah’s faith in God’s command to build an ark must have been immense, especially in a world filled with violence and corruption. He didn’t just hear the warning; he acted on it, preparing for a flood that seemed impossible to others. Today, we live in a world with similar challenges, but God has given us a living prophet to guide us, much like Noah guided his family. Following prophetic counsel requires faith, even when it’s hard or unpopular. Noah’s obedience saved his family, and our faith in following the prophet can protect us too. Let’s trust in the Lord’s warnings and invitations as Noah did.",
      "application": "Listen to or read a recent message from the living prophet and write down one invitation to act on this week.",
      "question": "What is one way following the prophet today requires faith, like Noah’s faith in building the ark?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Covenant",
      "title": "Rainbows Remind Us Always",
      "scripture": {
        "reference": "Genesis 9:15-16",
        "text": "And I will remember my covenant, which is between me and you and every living creature of all flesh; and the waters shall no more become a flood to destroy all flesh. And the bow shall be in the cloud; and I will look upon it, that I may remember the everlasting covenant between God and every living creature of all flesh that is upon the earth."
      },
      "thought": "After the Flood, God gave Noah and his family the rainbow as a token of His covenant—a promise that He would never again destroy the earth with a flood. This beautiful symbol reminds us that God keeps His promises to His children. Every time we see a rainbow, we can reflect on our own covenants, like baptism or temple promises, and how they connect us to God. Just as the rainbow was a reminder to Noah, symbols in our lives—like the sacrament—help us remember to follow Jesus Christ. God’s love is constant, and His covenants offer us hope and safety. Let’s cherish these reminders in our daily walk with Him.",
      "application": "Draw or color a rainbow with your family and discuss what covenants mean to each of you.",
      "question": "What symbols in your life help you remember your promises to God, and how do they strengthen your faith?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Obedience",
      "title": "Prophets Warn and Protect",
      "scripture": {
        "reference": "Moses 8:20",
        "text": "And it came to pass that Noah called upon the children of men that they should repent; but they hearkened not unto his words."
      },
      "thought": "Noah, as a prophet, tirelessly warned the people to repent, but they refused to listen, choosing their own ways over God’s. His story shows us the vital role of prophets in guiding us back to safety. Today, our living prophet warns us of spiritual dangers and invites us to follow Christ, just as Noah did. Ignoring these warnings can lead to confusion and loss, much like in Noah’s day. But when we obey, we find protection and peace for ourselves and our families. Let’s be quick to heed the prophet’s voice in these latter days.",
      "application": "Discuss as a family one recent teaching from the prophet and decide on a small way to follow it today.",
      "question": "How has following the prophet’s counsel protected or blessed you during a challenging time?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Challenges",
      "title": "Overcoming Pride at Babel",
      "scripture": {
        "reference": "Genesis 11:4",
        "text": "And they said, Go to, let us build us a city and a tower, whose top may reach unto heaven; and let us make us a name, lest we be scattered abroad upon the face of the whole earth."
      },
      "thought": "The people of Babel sought to reach heaven through their own prideful efforts, building a tower to make a name for themselves. Their story reminds us that relying on our own strength or worldly ideas often leads to confusion and division. In contrast, God has provided the true way to return to Him—through Jesus Christ and His gospel. Today, we face similar temptations to follow popular trends or personal pride instead of God’s path. By choosing humility and obedience, we can avoid the pitfalls of Babel. Let’s focus on building our lives on Christ, the only sure foundation.",
      "application": "Write down one thing that might distract you from following Christ and replace it with a Christ-centered activity today.",
      "question": "What are some modern ‘towers’ we build that take us away from God, and how can we turn back to Him?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Grace",
      "title": "God’s Mercy in Judgment",
      "scripture": {
        "reference": "Genesis 6:7-8",
        "text": "And the Lord said, I will destroy man whom I have created from the face of the earth; both man, and beast, and the creeping thing, and the fowls of the air; for it repenteth me that I have made them. But Noah found grace in the eyes of the Lord."
      },
      "thought": "At first glance, the Flood seems like harsh judgment, but it was also an act of God’s mercy, protecting future generations from a world so corrupt that agency was nearly lost. Amid this judgment, Noah found grace because of his righteousness, showing us that God’s love is always present, even in difficult times. Today, when we face personal or societal challenges, we can trust that God’s actions are rooted in mercy and care. His grace is available to us as we strive to live righteously. Let’s seek His guidance and trust His plan, knowing He desires our ultimate good. Noah’s story reminds us that God saves those who turn to Him.",
      "application": "Take a moment to pray and thank God for His mercy in your life, asking for help to see His hand in challenges.",
      "question": "How have you seen God’s mercy in a difficult situation, and how did it strengthen your trust in Him?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Safe in God’s Way",
      "scripture": {
        "reference": "Genesis 9:12-13",
        "text": "And God said, This is the token of the covenant which I make between me and you and every living creature that is with you, for perpetual generations: I do set my bow in the cloud, and it shall be for a token of a covenant between me and the earth."
      },
      "thought": "This week, we’ve learned from Noah and the people of Babel how to navigate a world filled with challenges similar to our own. Noah’s faith and obedience to God’s prophet-like warnings show us the path to spiritual safety, while the Tower of Babel warns against pride and self-reliance. The rainbow reminds us of God’s covenants and His unfailing promises to protect and guide us. We’ve seen that following Jesus Christ is the only true way to return to Heavenly Father. These stories teach us to trust in the Lord’s mercy, heed prophetic counsel, and build our lives on Christ. Let’s carry these lessons forward, knowing God’s grace is always within reach.",
      "application": "Review the week’s lessons as a family and choose one principle to focus on in the coming days, such as obedience or covenant-keeping.",
      "question": "Which story or principle from this week’s reading has most inspired you to draw closer to God, and why?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:28:24",
  "source_week_file": "cfm_2026_week_07.json"
}