{
  "week_number": 24,
  "title": "Week 24: June 8–14 - 1 Samuel 8–10; 13; 15–16",
  "date_range": "June 8–14",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "The Lord Sees Hearts",
      "scripture": {
        "reference": "1 Samuel 16:7",
        "text": "But the Lord said unto Samuel, Look not on his countenance, or on the height of his stature; because I have refused him: for the Lord seeth not as man seeth; for man looketh on the outward appearance, but the Lord looketh on the heart."
      },
      "thought": "This week, as we study 1 Samuel 8–10, 13, and 15–16, we’ll explore stories of Saul and David, two very different kings chosen by God. Their journeys teach us that the Lord looks beyond outward appearances and sees the heart. Whether it’s Saul’s initial humility or David’s unexpected courage, we’re reminded that God values our inner qualities and potential. These chapters also challenge us to consider who we look to as our true King and how we obey His will. As we read, let’s reflect on how we can align our hearts with the Lord’s vision for us. What might He see in us that we overlook in ourselves?",
      "application": "Take a moment today to write down one quality you believe the Lord sees in your heart that you might not always recognize.",
      "question": "How can I better trust the Lord’s perspective of me over how I or others see myself?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Identity",
      "title": "Chosen Beyond Appearance",
      "scripture": {
        "reference": "1 Samuel 16:6-7",
        "text": "And it came to pass, when they were come, that he looked on Eliab, and said, Surely the Lord’s anointed is before him. But the Lord said unto Samuel, Look not on his countenance, or on the height of his stature; because I have refused him: for the Lord seeth not as man seeth; for man looketh on the outward appearance, but the Lord looketh on the heart."
      },
      "thought": "When Samuel sought a new king, he nearly chose Eliab based on his impressive appearance, but the Lord taught a powerful lesson: He looks on the heart. This reminds us that our worth isn’t tied to how we look or what others think of us. Like David, who was overlooked by his own family, we might feel unqualified or invisible at times. Yet, God sees our true potential and calls us based on who we are inside. Let’s trust that He knows us better than we know ourselves. How can we see ourselves and others through His eyes today?",
      "application": "Compliment someone today on a quality of their heart, like their kindness or patience, rather than their appearance.",
      "question": "What is one way I can remind myself that my true value comes from what’s in my heart?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Obedience",
      "title": "Obedience Over Sacrifice",
      "scripture": {
        "reference": "1 Samuel 15:22",
        "text": "And Samuel said, Hath the Lord as great delight in burnt offerings and sacrifices, as in obeying the voice of the Lord? Behold, to obey is better than sacrifice, and to hearken than the fat of rams."
      },
      "thought": "Saul thought he could justify disobedience by offering sacrifices, but Samuel’s words cut to the core: obedience matters more to the Lord than any outward act. This teaches us that doing what God asks, even when it’s hard or doesn’t make sense to us, is the truest form of worship. Sometimes, we might prioritize things that seem good—like achievements or traditions—over simply listening to the Lord’s voice. Saul’s story warns us of the consequences of stubbornness. Let’s examine our own lives and ensure we’re placing obedience to God above all else. What might we need to let go of to fully follow Him?",
      "application": "Identify one small way you can obey a prompting from the Lord today, even if it feels inconvenient.",
      "question": "What is something I might be prioritizing over simple obedience to the Lord’s will?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Faith",
      "title": "A New Heart Given",
      "scripture": {
        "reference": "1 Samuel 10:9",
        "text": "And it was so, that when he had turned his back to go from Samuel, God gave him another heart: and all those signs came to pass that day."
      },
      "thought": "When Saul was called to be king, God gave him ‘another heart,’ transforming him for the role ahead. This shows us that the Lord doesn’t just call us as we are—He helps us become what we need to be. Even if we feel inadequate like Saul did, we can trust that God will strengthen our hearts with faith and courage. His power can change us from the inside out. Think of a time when you felt unprepared for a task or calling. How might God be working to give you a new heart today?",
      "application": "Pray specifically today for the Lord to change or strengthen your heart for a challenge you’re facing.",
      "question": "How have I seen God give me ‘another heart’ in a difficult moment or calling?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Revelation",
      "title": "Called by God’s Voice",
      "scripture": {
        "reference": "1 Samuel 9:15-16",
        "text": "Now the Lord had told Samuel in his ear a day before Saul came, saying, To morrow about this time I will send thee a man out of the land of Benjamin, and thou shalt anoint him to be captain over my people Israel, that he may save my people out of the hand of the Philistines: for I have looked upon my people, because their cry is come unto me."
      },
      "thought": "God spoke directly to Samuel, revealing Saul as the chosen king before they even met, showing us how callings in His kingdom come through revelation. Just as Samuel received guidance, leaders in the Church today are inspired to call individuals to serve. This reminds us that our assignments aren’t random—they’re part of God’s plan for His people. Whether we’re called to teach, lead, or serve in small ways, we can trust the Lord’s voice behind it. Think about how you’ve felt His guidance in your own callings. How can we honor the sacred process of revelation in His Church?",
      "application": "Express gratitude today to a Church leader or teacher for their inspired service in their calling.",
      "question": "How can I better seek and recognize the Lord’s voice in the callings or assignments I receive?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Worship",
      "title": "Christ as My King",
      "scripture": {
        "reference": "1 Samuel 8:7",
        "text": "And the Lord said unto Samuel, Hearken unto the voice of the people in all that they say unto thee: for they have not rejected thee, but they have rejected me, that I should not reign over them."
      },
      "thought": "The Israelites wanted an earthly king, but in doing so, they rejected the Lord as their true ruler. This story invites us to reflect on who or what we allow to ‘reign’ over our lives. Is it worldly influences, personal desires, or Jesus Christ? Choosing Christ as our King means prioritizing His teachings and guidance above all else. When we do, we find true safety and direction, unlike the temporary solutions earthly kings offered. Let’s commit to worshiping Him as the center of our lives today.",
      "application": "Choose one worldly distraction today (like social media or entertainment) and replace it with a moment of worship, such as reading a hymn or scripture.",
      "question": "What is one way I can better show that Jesus Christ is my King in my daily choices?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Hearts Aligned with God",
      "scripture": {
        "reference": "1 Samuel 16:7",
        "text": "But the Lord said unto Samuel, Look not on his countenance, or on the height of his stature; because I have refused him: for the Lord seeth not as man seeth; for man looketh on the outward appearance, but the Lord looketh on the heart."
      },
      "thought": "This week in 1 Samuel, we’ve seen how God looks on the heart, choosing Saul and David despite their outward appearances or insecurities. We’ve learned the importance of obedience over sacrifice, the power of revelation in callings, and the transformation of a new heart from God. Most importantly, we’ve been reminded to let Jesus Christ reign as our true King. These stories challenge us to align our hearts with His will, trusting His vision over the world’s. As we reflect on Saul’s rebellion and David’s faith, let’s choose to follow the Lord’s way. How has your heart grown closer to Him this week?",
      "application": "Share with a family member or friend one insight from this week’s study that touched your heart.",
      "question": "What is one change I can make to keep my heart more aligned with the Lord’s will?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:39:19",
  "source_week_file": "cfm_2026_week_24.json"
}