{
  "week_number": 17,
  "title": "Week 17: April 20–26 - Exodus 19–20; 24; 31–34",
  "date_range": "April 20–26",
  "days": [
    {
      "day": 1,
      "day_name": "Sunday",
      "theme": "Week Overview",
      "title": "Covenants Draw Us Near",
      "scripture": {
        "reference": "Exodus 24:7",
        "text": "And he took the book of the covenant, and read in the audience of the people: and they said, All that the Lord hath said will we do, and be obedient."
      },
      "thought": "This week, we explore the powerful moments at Mount Sinai where the children of Israel covenanted to obey God’s law. Their promise, 'All that the Lord hath said will we do,' reminds us of the commitments we make to follow Him. We’ll study the Ten Commandments, the importance of preparation for sacred experiences, and the mercy of God even when we falter, as the Israelites did with the golden calf. These chapters show us that God treasures His covenant people and desires to dwell among us. As we dive into Exodus 19–20, 24, and 31–34, let’s reflect on how our covenants bring us closer to Him. How can we show our willingness to obey as the Israelites promised?",
      "application": "Take a moment today to write down one covenant or promise you’ve made with God, and consider how you can honor it this week.",
      "question": "How do my covenants with God help me feel His presence in my life?"
    },
    {
      "day": 2,
      "day_name": "Monday",
      "theme": "Identity",
      "title": "Treasured by the Lord",
      "scripture": {
        "reference": "Exodus 19:5-6",
        "text": "Now therefore, if ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people: for all the earth is mine: And ye shall be unto me a kingdom of priests, and an holy nation. These are the words which thou shalt speak unto the children of Israel."
      },
      "thought": "The Lord calls the children of Israel a 'peculiar treasure,' a term that President Russell M. Nelson explains means 'valued property.' This shows how much God cherishes His covenant people, including us today. When we obey His voice and keep our covenants, we become part of His holy nation. This identity reminds us of our worth in His eyes, no matter our imperfections. Think of the ways God has shown you that you are treasured—perhaps through answered prayers or feelings of peace. How can knowing you are valued by Him change the way you see yourself?",
      "application": "Write down or share with a family member one way you’ve felt treasured by the Lord.",
      "question": "How does knowing I am a 'peculiar treasure' to God influence my daily choices?"
    },
    {
      "day": 3,
      "day_name": "Tuesday",
      "theme": "Obedience",
      "title": "Blessings of God’s Commands",
      "scripture": {
        "reference": "Exodus 20:6",
        "text": "And shewing mercy unto thousands of them that love me, and keep my commandments."
      },
      "thought": "As the Israelites received the Ten Commandments at Mount Sinai, they learned that obedience brings God’s mercy and blessings. This verse promises that God shows mercy to those who love Him and keep His commandments. Obedience isn’t just about rules; it’s about showing our love for God and receiving His guidance in return. When we put God first and follow His laws, we often see blessings like peace in our hearts or stronger family bonds. Reflect on a time when keeping a commandment brought a specific blessing into your life. How can we trust in God’s promises as we strive to obey?",
      "application": "Choose one of the Ten Commandments to focus on today, and make a conscious effort to live it more fully.",
      "question": "What blessings have I noticed in my life when I’ve chosen to obey God’s commandments?"
    },
    {
      "day": 4,
      "day_name": "Wednesday",
      "theme": "Worship",
      "title": "Sabbath as a Sign",
      "scripture": {
        "reference": "Exodus 31:13",
        "text": "Speak thou also unto the children of Israel, saying, Verily my sabbaths ye shall keep: for it is a sign between me and you throughout your generations; that ye may know that I am the Lord that doth sanctify you."
      },
      "thought": "The Lord teaches that keeping the Sabbath is a sign between Him and His people, a way to show our love and commitment. President Russell M. Nelson taught that our Sabbath conduct is a sign to God of our devotion. When we honor the Sabbath, we set aside worldly distractions to focus on Him, which helps us feel sanctified, or made holy. This can be as simple as resting from daily work or spending time in prayer and scripture study. How do your Sabbath choices reflect your relationship with God? Let’s make the Sabbath a day that truly points us toward Him.",
      "application": "Plan one specific activity for this coming Sabbath that will show God your love, such as family prayer or serving someone.",
      "question": "What sign do I want to give God through my Sabbath observance?"
    },
    {
      "day": 5,
      "day_name": "Thursday",
      "theme": "Repentance",
      "title": "God’s Mercy in Forgiveness",
      "scripture": {
        "reference": "Exodus 34:6-7",
        "text": "And the Lord passed by before him, and proclaimed, The Lord, The Lord God, merciful and gracious, longsuffering, and abundant in goodness and truth, Keeping mercy for thousands, forgiving iniquity and transgression and sin, and that will by no means clear the guilty; visiting the iniquity of the fathers upon the children, and upon the children’s children, unto the third and to the fourth generation."
      },
      "thought": "Even after the Israelites turned to worship a golden calf, God revealed Himself as 'merciful and gracious, longsuffering, and abundant in goodness.' This reminds us that while sin turns us away from God, repentance turns us back to Him. The Israelites’ story shows that God doesn’t give up on us, even when we make serious mistakes. His mercy is always there, waiting for us to return. Think of a time when you felt God’s forgiveness after repenting. How can we trust in His goodness when we need to turn back to Him?",
      "application": "Take a quiet moment today to pray for forgiveness for something specific, trusting in God’s mercy.",
      "question": "How have I experienced God’s mercy and forgiveness in my own life?"
    },
    {
      "day": 6,
      "day_name": "Friday",
      "theme": "Covenant",
      "title": "Prepared for God’s Presence",
      "scripture": {
        "reference": "Exodus 19:10-11",
        "text": "And the Lord said unto Moses, Go unto the people, and sanctify them to day and to morrow, and let them wash their clothes, And be ready against the third day: for the third day the Lord will come down in the sight of all the people upon mount Sinai."
      },
      "thought": "Before the Israelites could meet with God at Mount Sinai, they were instructed to prepare themselves spiritually and physically. This preparation was essential to receive God’s covenant and hear His voice. In our lives, we also prepare for sacred experiences like taking the sacrament or attending the temple. Preparation might mean praying, repenting, or simply quieting our hearts to hear Him. When we take time to prepare, we show God that we value His presence. How can we better prepare to feel close to Him in our daily lives?",
      "application": "Before your next sacrament meeting or personal prayer, spend a few minutes quietly preparing your heart to meet with God.",
      "question": "What can I do to better prepare myself for spiritual experiences with the Lord?"
    },
    {
      "day": 7,
      "day_name": "Saturday",
      "theme": "Week Summary",
      "title": "Committed to His Path",
      "scripture": {
        "reference": "Exodus 32:8",
        "text": "They have turned aside quickly out of the way which I commanded them: they have made them a molten calf, and have worshipped it, and have sacrificed thereunto, and said, These be thy gods, O Israel, which have brought thee up out of the land of Egypt."
      },
      "thought": "This week, we’ve seen the highs and lows of the Israelites’ journey at Mount Sinai—from their covenant to obey God to their quick turn to idol worship. Their story mirrors our own struggles to stay on God’s path amidst temptations and doubts. Yet, God’s mercy, as shown in Exodus 34, reminds us He never gives up on us. We’ve learned about being treasured by Him, the blessings of obedience, the sign of the Sabbath, and the importance of preparation and repentance. Let’s carry forward the commitment to say, 'All that the Lord hath spoken we will do.' How will you stay on His path in the week ahead?",
      "application": "Reflect on this week’s lessons and set one goal to strengthen your commitment to God’s commandments.",
      "question": "What is one lesson from this week that I want to apply more fully in my life?"
    }
  ],
  "generated_timestamp": "2025-12-25 23:34:40",
  "source_week_file": "cfm_2026_week_17.json"
}