{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "scripture_block": "",
  "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\nThe Bible begins with the words “in the beginning God created the heaven and the earth” (Genesis 1:1). But what was there before this “beginning”? And why did God create all of this? Through the Prophet Joseph Smith, the Lord has shed light on these questions.\n\nFor example, He gave us the record of a vision in which Abraham saw our existence as spirits “before the world was” (see Abraham 3:22–28). The Lord also gave us an inspired translation or revision of the first six chapters of Genesis, called the book of Moses—which doesn’t begin with “in the beginning.” Instead, it begins with an experience Moses had that provides some context for the Creation story. Together, these latter-day scriptures are a good place to start our study of the Old Testament because they address some fundamental questions that can frame our reading: Who is God? Who are we? What is God’s work, and what is our place in it? The opening chapters of Genesis could be seen as the Lord’s response to Moses’s request: “Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens” (Moses 1:36).",
  "learning_at_home_church": [
    {
      "title": "As a child of God, I have a divine destiny.",
      "content": "“If the Lord were speaking to you directly,” President Russell M. Nelson taught, “the first thing He would make sure you understand is your true identity” (“Choices for Eternity” [worldwide devotional for young adults, May 2022], Gospel Library). It follows that Satan would try to confuse you on that same point. Look for this pattern in God’s message to Moses in Moses 1:4, 6 and in Satan’s messages in Moses 1:12. What do you learn from these verses about the differences between God and Satan?\n\nPresident Nelson also taught, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”). Consider making a list of choices you make because your identity as a child of God comes before other labels.\n\nWhat additional verses or phrases in Moses 1 help you understand your divine worth? You might also read more of President Nelson’s message in the section of “Choices for Eternity” titled “First: Know the truth about who you are.” What do you feel inspired to do to make your identity as a child of God your most important identifier?\n\nSee also “I Am a Child of God,” Hymns (1985), no. 301; “Our True Identity” (video), Gospel Library; Topics and Questions, “Children of God,” Gospel Library.\n\nOur True Identity\n\nMoses 1:12–26"
    },
    {
      "title": "With the Lord’s help, I can resist Satan.",
      "content": "As Moses 1 clearly shows, powerful spiritual experiences do not mean we’ll never be tempted again. In fact, one of Satan’s tactics is to tempt us to doubt these experiences. As you read Moses’s response to Satan in verses 12–26, what do you learn that can help you stay true to the testimony you have received? What was it that finally helped Moses overcome Satan?\n\nAnother lesson from Moses’s experience is that Satan tempts us with counterfeits of God’s truth and power. Think of some fake versions of things, such as an artificial plant or a baby doll. How can you tell they’re fake? Then consider the counterfeits Satan uses today to tempt you. What do you learn from Moses 1:13–18 about how to recognize and reject his counterfeits? How can the Lord help you? (see Moses 1:24–26).\n\nSee also Matthew 4:1–11; Gary E. Stevenson, “Deceive Me Not,” Ensign or Liahona, Nov. 2019, 93–96; “I Am a Son of God” (video), Gospel Library.\n\nI Am a Son of God\n\nLearning at home can be planned but also spontaneous. “Teaching opportunities in the family frequently occur in informal, everyday moments—while eating a meal, doing chores, playing games, [or] traveling” (Teaching in the Savior’s Way, 31). For example, in addition to reading about how Moses resisted Satan in Moses 1, you might spend a few moments at dinnertime talking as a family about how you resisted the influence of the adversary.\n\nMoses 1:27–39; Abraham 3"
    },
    {
      "title": "God’s work and glory is to help me gain eternal life.",
      "content": "After seeing a vision of God’s creations, Moses said to the Lord: “Tell me … why these things are so” (Moses 1:30). What impresses you about the Lord’s response in Moses 1:31–39? What’s the difference between immortality and eternal life? (see Topics and Questions, “Eternal Life,” Gospel Library). How does Jesus Christ help bring to pass both? Abraham also had a vision, recorded in Abraham 3. What do you find in verses 24–26 that could help answer Moses’s request?\n\nAbraham 3:22–28"
    },
    {
      "title": "I lived as a spirit before I was born on earth.",
      "content": "We know very little about our premortal life. But much of what we do know comes from Abraham’s vision in Abraham 3:22–28. As you read these verses, make a list of truths you find—including truths about yourself and about Jesus Christ. Why are these truths valuable to you? What difference do they make in your life?\n\nSee also Topics and Questions, “Premortal Life,” Gospel Library.\n\nFor more, see this month’s issues of the Liahona and For the Strength of Youth magazines."
    }
  ],
  "teaching_children": [
    {
      "title": "I am a child of God.",
      "content": "After you read together God’s message to Moses in Moses 1:4, consider letting your children look at their reflection in a mirror and giving themselves a similar message: “I am a child of God.” Then they could give the same message to each other: “You are a child of God.” You might even find pictures of a variety of people and invite your children to point to each one and say, “This is a child of God.” Share with each other why you are glad to know you are children of God. How does this knowledge change the way you treat yourselves and others?\n\nYou and your children could compare God’s message to Moses in Moses 1:4 with Satan’s message in verse 12. How can you help your children distinguish between God’s messages to them and Satan’s?\n\nMoses Sees Jehovah, by Joseph Brickey (detail)\n\nMoses 1:6, 39"
    },
    {
      "title": "Heavenly Father has a work for me to do.",
      "content": "As you read Moses 1:6 with your children, you might talk to them about the “work” God had for Moses. Consider using the Gospel Art Book, nos. 13–16, or Old Testament Stories, pages 64–84, to help your children see what Moses accomplished with Heavenly Father’s help. What is the work God has for us to do? (see, for example, Doctrine and Covenants 11:20).\n\nMoses 1:12–26"
    },
    {
      "title": "I can resist Satan’s temptations.",
      "content": "As you study Moses 1:12–26 with your children, help them discover what Moses did to resist Satan (see verses 13, 15, 18, 20–22, 26). It might be fun for them to act out things they can do to resist temptation (such as praying, walking away, or asking for help).\n\nAbraham 3:22–28"
    },
    {
      "title": "I lived as a spirit before I was born on earth.",
      "content": "Knowing about our premortal life can inspire your children to make choices based on eternal truths. To help them learn about it, you could give them some key words and phrases to find in Abraham 3:22–28, like “before the world was,” “spirits,” “make an earth,” and “prove.” What do these verses teach us about why Heavenly Father sent us to earth?\n\nA song like “I Will Follow God’s Plan” (Children’s Songbook, 164–65) could reinforce what Abraham 3 teaches. Maybe you could invite your children to draw pictures that go with the words.\n\nHelp your children think of situations in which they have to choose whether or not to do what God has asked them to (see Abraham 3:25; see also For the Strength of Youth: A Guide for Making Choices). Let them practice possible responses to these situations. How can the Savior help us when we make a wrong choice?\n\nFor more, see this month’s issue of the Friend magazine.\n\nMoses Overcomes Satan, by Joseph Brickey"
    }
  ],
  "scriptures": [
    {
      "reference": "Moses 1",
      "title": "Selections from the Book of Moses",
      "summary": "God reveals Himself to Moses— Moses is transfigured— He is confronted by Satan— Moses sees many inhabited worlds— Worlds without number were created by the Son— God’s work and glory is to bring to pass the immortality and eternal life of man.",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/pgp/moses/1?lang=eng",
      "text": "1 The words of God, which he spake unto Moses at a time when Moses was caught up into an exceedingly high mountain,\n2 And he saw God face to face, and he talked with him, and the glory of God was upon Moses; therefore Moses could endure his presence.\n3 And God spake unto Moses, saying: Behold, I am the Lord God Almighty, and Endless is my name; for I am without beginning of days or end of years; and is not this endless?\n4 And, behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands; but not all, for my works are without end, and also my words, for they never cease.\n5 Wherefore, no man can behold all my works, except he behold all my glory; and no man can behold all my glory, and afterwards remain in the flesh on the earth.\n6 And I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten; and mine Only Begotten is and shall be the Savior, for he is full of grace and truth; but there is no God beside me, and all things are present with me, for I know them all.\n7 And now, behold, this one thing I show unto thee, Moses, my son, for thou art in the world, and now I show it unto thee.\n8 And it came to pass that Moses looked, and beheld the world upon which he was created; and Moses beheld the world and the ends thereof, and all the children of men which are, and which were created; of the same he greatly marveled and wondered.\n9 And the presence of God withdrew from Moses, that his glory was not upon Moses; and Moses was left unto himself. And as he was left unto himself, he fell unto the earth.\n10 And it came to pass that it was for the space of many hours before Moses did again receive his natural strength like unto man; and he said unto himself: Now, for this cause I know that man is nothing, which thing I never had supposed.\n11 But now mine own eyes have beheld God; but not my natural, but my spiritual eyes, for my natural eyes could not have beheld; for I should have withered and died in his presence; but his glory was upon me; and I beheld his face, for I was transfigured before him.\n12 And it came to pass that when Moses had said these words, behold, Satan came tempting him, saying: Moses, son of man, worship me.\n13 And it came to pass that Moses looked upon Satan and said: Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?\n14 For behold, I could not look upon God, except his glory should come upon me, and I were transfigured before him. But I can look upon thee in the natural man. Is it not so, surely?\n15 Blessed be the name of my God, for his Spirit hath not altogether withdrawn from me, or else where is thy glory, for it is darkness unto me? And I can judge between thee and God; for God said unto me: Worship God, for him only shalt thou serve.\n16 Get thee hence, Satan; deceive me not; for God said unto me: Thou art after the similitude of mine Only Begotten.\n17 And he also gave me commandments when he called unto me out of the burning bush, saying: Call upon God in the name of mine Only Begotten, and worship me.\n18 And again Moses said: I will not cease to call upon God, I have other things to inquire of him: for his glory has been upon me, wherefore I can judge between him and thee. Depart hence, Satan.\n19 And now, when Moses had said these words, Satan cried with a loud voice, and ranted upon the earth, and commanded, saying: I am the Only Begotten, worship me.\n20 And it came to pass that Moses began to fear exceedingly; and as he began to fear, he saw the bitterness of hell. Nevertheless, calling upon God, he received strength, and he commanded, saying: Depart from me, Satan, for this one God only will I worship, which is the God of glory.\n21 And now Satan began to tremble, and the earth shook; and Moses received strength, and called upon God, saying: In the name of the Only Begotten, depart hence, Satan.\n22 And it came to pass that Satan cried with a loud voice, with weeping, and wailing, and gnashing of teeth; and he departed hence, even from the presence of Moses, that he beheld him not.\n23 And now of this thing Moses bore record; but because of wickedness it is not had among the children of men.\n24 And it came to pass that when Satan had departed from the presence of Moses, that Moses lifted up his eyes unto heaven, being filled with the Holy Ghost, which beareth record of the Father and the Son;\n25 And calling upon the name of God, he beheld his glory again, for it was upon him; and he heard a voice, saying: Blessed art thou, Moses, for I, the Almighty, have chosen thee, and thou shalt be made stronger than many waters; for they shall obey thy command as if thou wert God.\n26 And lo, I am with thee, even unto the end of thy days; for thou shalt deliver my people from bondage, even Israel my chosen.\n27 And it came to pass, as the voice was still speaking, Moses cast his eyes and beheld the earth, yea, even all of it; and there was not a particle of it which he did not behold, discerning it by the Spirit of God.\n28 And he beheld also the inhabitants thereof, and there was not a soul which he beheld not; and he discerned them by the Spirit of God; and their numbers were great, even numberless as the sand upon the sea shore.\n29 And he beheld many lands; and each land was called earth, and there were inhabitants on the face thereof.\n30 And it came to pass that Moses called upon God, saying: Tell me, I pray thee, why these things are so, and by what thou madest them?\n31 And behold, the glory of the Lord was upon Moses, so that Moses stood in the presence of God, and talked with him face to face. And the Lord God said unto Moses: For mine own purpose have I made these things. Here is wisdom and it remaineth in me.\n32 And by the word of my power, have I created them, which is mine Only Begotten Son, who is full of grace and truth.\n33 And worlds without number have I created; and I also created them for mine own purpose; and by the Son I created them, which is mine Only Begotten.\n34 And the first man of all men have I called Adam, which is many.\n35 But only an account of this earth, and the inhabitants thereof, give I unto you. For behold, there are many worlds that have passed away by the word of my power. And there are many that now stand, and innumerable are they unto man; but all things are numbered unto me, for they are mine and I know them.\n36 And it came to pass that Moses spake unto the Lord, saying: Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens, and then thy servant will be content.\n37 And the Lord God spake unto Moses, saying: the heavens, they are many, and they cannot be numbered unto man; but they are numbered unto me, for they are mine.\n38 And as one earth shall pass away, and the heavens thereof even so shall another come; and there is no end to my works, neither to my words.\n39 For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.\n40 And now, Moses, my son, I will speak unto thee concerning this earth upon which thou standest; and thou shalt write the things which I shall speak.\n41 And in a day when the children of men shall esteem my words as naught and take many of them from the book which thou shalt write, behold, I will raise up another like unto thee; and they shall be had again among the children of men—among as many as shall believe.\n42 (These words were spoken unto Moses in the mount, the name of which shall not be known among the children of men. And now they are spoken unto you. Show them not unto any except them that believe. Even so. Amen.)",
      "verse_count": 42
    },
    {
      "reference": "Abraham 3",
      "title": "Abraham 3",
      "summary": "Abraham learns about the sun, moon, and stars by means of the Urim and Thummim— The Lord reveals to him the eternal nature of spirits— He learns of pre-earth life, foreordination, the Creation, the choosing of a Redeemer, and the second estate of man.",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/pgp/abr/3?lang=eng",
      "text": "1 And I, Abraham, had the Urim and Thummim, which the Lord my God had given unto me, in Ur of the Chaldees;\n2 And I saw the stars, that they were very great, and that one of them was nearest unto the throne of God; and there were many great ones which were near unto it;\n3 And the Lord said unto me: These are the governing ones; and the name of the great one is Kolob, because it is near unto me, for I am the Lord thy God: I have set this one to govern all those which belong to the same order as that upon which thou standest.\n4 And the Lord said unto me, by the Urim and Thummim, that Kolob was after the manner of the Lord, according to its times and seasons in the revolutions thereof; that one revolution was a day unto the Lord, after his manner of reckoning, it being one thousand years according to the time appointed unto that whereon thou standest. This is the reckoning of the Lord’s time, according to the reckoning of Kolob.\n5 And the Lord said unto me: The planet which is the lesser light, lesser than that which is to rule the day, even the night, is above or greater than that upon which thou standest in point of reckoning, for it moveth in order more slow; this is in order because it standeth above the earth upon which thou standest, therefore the reckoning of its time is not so many as to its number of days, and of months, and of years.\n6 And the Lord said unto me: Now, Abraham, these two facts exist, behold thine eyes see it; it is given unto thee to know the times of reckoning, and the set time, yea, the set time of the earth upon which thou standest, and the set time of the greater light which is set to rule the day, and the set time of the lesser light which is set to rule the night.\n7 Now the set time of the lesser light is a longer time as to its reckoning than the reckoning of the time of the earth upon which thou standest.\n8 And where these two facts exist, there shall be another fact above them, that is, there shall be another planet whose reckoning of time shall be longer still;\n9 And thus there shall be the reckoning of the time of one planet above another, until thou come nigh unto Kolob, which Kolob is after the reckoning of the Lord’s time; which Kolob is set nigh unto the throne of God, to govern all those planets which belong to the same order as that upon which thou standest.\n10 And it is given unto thee to know the set time of all the stars that are set to give light, until thou come near unto the throne of God.\n11 Thus I, Abraham, talked with the Lord, face to face, as one man talketh with another; and he told me of the works which his hands had made;\n12 And he said unto me: My son, my son (and his hand was stretched out), behold I will show you all these. And he put his hand upon mine eyes, and I saw those things which his hands had made, which were many; and they multiplied before mine eyes, and I could not see the end thereof.\n13 And he said unto me: This is Shinehah, which is the sun. And he said unto me: Kokaubeam, which is star. And he said unto me: Olea, which is the moon. And he said unto me: Kokaubeam, which signifies stars, or all the great lights, which were in the firmament of heaven.\n14 And it was in the night time when the Lord spake these words unto me: I will multiply thee, and thy seed after thee, like unto these; and if thou canst count the number of the sands, so shall be the number of thy seeds.\n15 And the Lord said unto me: Abraham, I show these things unto thee before ye go into Egypt, that ye may declare all these words.\n16 If two things exist, and there be one above the other, there shall be greater things above them; therefore Kolob is the greatest of all the Kokaubeam that thou hast seen, because it is nearest unto me.\n17 Now, if there be two things, one above the other, and the moon be above the earth, then it may be that a planet or a star may exist above it; and there is nothing that the Lord thy God shall take in his heart to do but what he will do it.\n18 Howbeit that he made the greater star; as, also, if there be two spirits, and one shall be more intelligent than the other, yet these two spirits, notwithstanding one is more intelligent than the other, have no beginning; they existed before, they shall have no end, they shall exist after, for they are gnolaum, or eternal.\n19 And the Lord said unto me: These two facts do exist, that there are two spirits, one being more intelligent than the other; there shall be another more intelligent than they; I am the Lord thy God, I am more intelligent than they all.\n20 The Lord thy God sent his angel to deliver thee from the hands of the priest of Elkenah.\n21 I dwell in the midst of them all; I now, therefore, have come down unto thee to declare unto thee the works which my hands have made, wherein my wisdom excelleth them all, for I rule in the heavens above, and in the earth beneath, in all wisdom and prudence, over all the intelligences thine eyes have seen from the beginning; I came down in the beginning in the midst of all the intelligences thou hast seen.\n22 Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones;\n23 And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born.\n24 And there stood one among them that was like unto God, and he said unto those who were with him: We will go down, for there is space there, and we will take of these materials, and we will make an earth whereon these may dwell;\n25 And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them;\n26 And they who keep their first estate shall be added upon; and they who keep not their first estate shall not have glory in the same kingdom with those who keep their first estate; and they who keep their second estate shall have glory added upon their heads for ever and ever.\n27 And the Lord said: Whom shall I send? And one answered like unto the Son of Man: Here am I, send me. And another answered and said: Here am I, send me. And the Lord said: I will send the first.\n28 And the second was angry, and kept not his first estate; and, at that day, many followed after him.",
      "verse_count": 28
    }
  ],
  "scripture_count": 2,
  "seminary_content": null,
  "study_helps": [],
  "additional_resources": [],
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/02?lang=eng",
  "source_week_file": "cfm_2026_week_02.json",
  "extracted_timestamp": "2026-01-04 21:54:01",
  "total_character_count": 22239,
  "total_word_count": 4028
}