{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "scripture_block": "",
  "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\nBecause the world around us is so beautiful and majestic, it’s hard to imagine the earth when it was “without form, and void” and “empty and desolate” (Genesis 1:2; Abraham 4:2). One thing the Creation story teaches us is that God can, over time, make something magnificent out of something unorganized. That’s helpful to remember when life seems chaotic. Heavenly Father and Jesus Christ are Creators, and Their creative work with us is not finished. They can make light shine in dark moments in our lives. They can fill our emptiness with life. They can transform us into the divine beings we were meant to be. That’s what it means to be created in God’s image, after His likeness (see Genesis 1:26). We have the potential to become like Him: exalted, glorified, heavenly.\n\nFor an overview of the book of Genesis, see “Genesis” in the Bible Dictionary.",
  "learning_at_home_church": [
    {
      "title": "“By mine Only Begotten I created these things.”",
      "content": "Although we don’t know everything about how the world was created, it’s interesting to note what God has chosen to reveal about the Creation. What does God teach you about it in Genesis 1:1–25; Moses 2:1–25; and Abraham 4:1–25? Why does He want you to know these things? As you ponder these accounts, you might also consider what they teach you about Heavenly Father, Jesus Christ, the world, and yourself.\n\nTo enrich your study, consider reading these verses while out among God’s creations or while listening to a song like “All Creatures of Our God and King” (Hymns, no. 62). You could find pictures of His creations that help you feel reverence for the Creator. Consider sharing these pictures, along with your testimony, with others.\n\nSee also Doctrine and Covenants 101:32–34.\n\nThe Garden of Eden, by Grant Romney Clawson\n\nGenesis 1:26–27; Moses 2:26–27; Abraham 4:26–27"
    },
    {
      "title": "I am created in the image of God.",
      "content": "As you read Genesis 1:26–27; Moses 2:26–27; and Abraham 4:26–27, ponder what it means to be created in God’s “image” or “likeness,” male and female. Why is it important to you to know the truths in these verses? For example, how do these truths affect the way you see yourself, others, and God? How can they help you when you have negative feelings about yourself?\n\nTo help you think about these questions, try completing a sentence like this one: “Because I know I am created in God’s image, I choose to …” Reviewing “Your body is sacred” in For the Strength of Youth: A Guide for Making Choices (pages 22–29) can help. Consider choosing something you will do to show God that you know your body is sacred.\n\nIn the video “God’s Greatest Creation” (Gospel Library), President Russell M. Nelson bears testimony of the miraculous human body. As you watch this video, ask yourself, “How does Heavenly Father want me to feel about my body?” How is this different from messages you might hear from others?\n\nGod's Greatest Creation\n\nSome people might say that being created in God’s image means that all of our thoughts, feelings, and desires are approved by Him and that we don’t need to (or cannot) improve. What would you say to that? What insights do you gain from Mosiah 3:19 and Ether 12:27?\n\nSee also Russell M. Nelson, “Your Body: A Magnificent Gift to Cherish,” Liahona, Aug. 2019, 50–55.\n\nGenesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18"
    },
    {
      "title": "Marriage between a man and a woman is ordained of God.",
      "content": "“Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87). Ponder this as you read Genesis 1:27–28; 2:18–25; Moses 3:18, 21–25; and Abraham 5:14–19. How can you treat marriage with the sacredness God has given it?\n\nSee also 1 Corinthians 11:11; “The Family: A Proclamation to the World,” Gospel Library.\n\nGenesis 1:28; Moses 2:28; Abraham 4:28"
    },
    {
      "title": "I am responsible for caring for God’s creations.",
      "content": "What do Genesis 1:28; Moses 2:28; and Abraham 4:28 suggest about our responsibility toward God’s creations? What do Doctrine and Covenants 59:16–21 and 104:13–18 add to your understanding?\n\nSee also Gérald Caussé, “Our Earthly Stewardship,” Liahona, Nov. 2022, 57–59; Topics and Questions, “Environmental Stewardship and Conservation,” Gospel Library.\n\nGenesis 2:2–3; Moses 3:2–3; Abraham 5:2–3"
    },
    {
      "title": "God blessed and sanctified the Sabbath day.",
      "content": "God made the Sabbath day holy, and He asks us to keep it holy. As you read Genesis 2:2–3; Moses 3:2–3; and Abraham 5:2–3, think about what makes the Sabbath “blessed” to you.\n\nSee also Doctrine and Covenants 59:9–13; “The Sabbath Is a Delight” (video), Gospel Library.\n\nHighlight: The Sabbath Is a Delight\n\nFor more, see this month’s issues of the Liahona and For the Strength of Youth magazines."
    }
  ],
  "teaching_children": [
    {
      "title": "Jesus created the earth.",
      "content": "How will you make learning about the Creation fun for your children? You could take them on a search outside for the kinds of things that were made during each period of Creation. Your children might also look at pictures of things Jesus created (see “The Creation of the Earth” in Old Testament Stories, 8–12). Then you and your children could talk about how you feel about Jesus Christ after reading about the Creation.\n\nConsider singing a song together about our beautiful world, such as “My Heavenly Father Loves Me” (Children’s Songbook, 228–29). Maybe your children could add to the song other things God has created that help them feel His love.\n\nHelp children express their creativity. “When you invite children to draw, build, color, or write something related to a gospel principle, you help them better understand the principle and you give them a tangible reminder of what they have learned” (Teaching in the Savior’s Way, 32).\n\nGenesis 1:26–27; Moses 2:26–27; Abraham 4:26–27"
    },
    {
      "title": "I was created in God’s image.",
      "content": "Your children can develop a sense of reverence and respect for their own and others’ bodies as they learn that we were all created in God’s image. To help them understand what this means, you could let your children look at their image in a mirror or picture while you read Moses 2:26–27 to them. You could also show them how baby animals are often in the “likeness” of their parents (see the picture in this outline, for example). This could lead to a conversation about why it’s important to you to know that you are created in your Heavenly Father’s image.\n\nYou and your children might enjoy drawing a human body and cutting the drawings into puzzles. As your children put their puzzles together, they could talk about ways they can show Heavenly Father that they are thankful for their bodies.\n\nGenesis 2:2–3; Moses 3:2–3; Abraham 5:2–3"
    },
    {
      "title": "The Sabbath day is holy.",
      "content": "As you read Moses 3:2–3, ask your children to listen for what God did on the seventh day. Help your children find or draw pictures of things they can do on Sunday to make it a holy day and different from other days. Share with each other why it is important to you to keep the Sabbath day holy.\n\nHelp your children role-play explaining to a friend why they choose to do things on Sunday that honor Heavenly Father and Jesus. Suggest that they use Genesis 2:2–3 in their explanations. How does keeping the Sabbath day holy show our love for Heavenly Father and Jesus Christ?\n\nFor more, see this month’s issue of the Friend magazine.\n\nThe Creation, by Annie Henrie Nader"
    }
  ],
  "scriptures": [
    {
      "reference": "Genesis 1",
      "title": "The First Book of Moses Called Genesis",
      "summary": "God creates this earth and its heaven and all forms of life in six days—The creative acts of each day are described—God creates man, both male and female, in His own image—Man is given dominion over all things and is commanded to multiply and fill the earth.",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/1?lang=eng",
      "text": "1 In the beginning God created the heaven and the earth. 2 And the earth was without form, and void; and darkness was upon the face of the deep. And the Spirit of God moved upon the face of the waters. 3 And God said, Let there be light: and there was light. 4 And God saw the light, that it was good: and God divided the light from the darkness. 5 And God called the light Day, and the darkness he called Night. And the evening and the morning were the first day. 6 ¶ And God said, Let there be a firmament in the midst of the waters, and let it divide the waters from the waters. 7 And God made the firmament, and divided the waters which were under the firmament from the waters which were above the firmament: and it was so. 8 And God called the firmament Heaven. And the evening and the morning were the second day. 9 ¶ And God said, Let the waters under the heaven be gathered together unto one place, and let the dry land appear: and it was so. 10 And God called the dry land Earth; and the gathering together of the waters called he Seas: and God saw that it was good. 11 And God said, Let the earth bring forth grass, the herb yielding seed, and the fruit tree yielding fruit after his kind, whose seed is in itself, upon the earth: and it was so. 12 And the earth brought forth grass, and herb yielding seed after his kind, and the tree yielding fruit, whose seed was in itself, after his kind: and God saw that it was good. 13 And the evening and the morning were the third day. 14 ¶ And God said, Let there be lights in the firmament of the heaven to divide the day from the night; and let them be for signs, and for seasons, and for days, and years: 15 And let them be for lights in the firmament of the heaven to give light upon the earth: and it was so. 16 And God made two great lights; the greater light to rule the day, and the lesser light to rule the night: he made the stars also. 17 And God set them in the firmament of the heaven to give light upon the earth, 18 And to rule over the day and over the night, and to divide the light from the darkness: and God saw that it was good. 19 And the evening and the morning were the fourth day. 20 And God said, Let the waters bring forth abundantly the moving creature that hath life, and fowl that may fly above the earth in the open firmament of heaven. 21 And God created great whales, and every living creature that moveth, which the waters brought forth abundantly, after their kind, and every winged fowl after his kind: and God saw that it was good. 22 And God blessed them, saying, Be fruitful, and multiply, and fill the waters in the seas, and let fowl multiply in the earth. 23 And the evening and the morning were the fifth day. 24 ¶ And God said, Let the earth bring forth the living creature after his kind, cattle, and creeping thing, and beast of the earth after his kind: and it was so. 25 And God made the beast of the earth after his kind, and cattle after their kind, and every thing that creepeth upon the earth after his kind: and God saw that it was good. 26 ¶ And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. 27 So God created man in his own image, in the image of God created he him; male and female created he them. 28 And God blessed them, and God said unto them, Be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth. 29 ¶ And God said, Behold, I have given you every herb bearing seed, which is upon the face of all the earth, and every tree, in the which is the fruit of a tree yielding seed; to you it shall be for meat. 30 And to every beast of the earth, and to every fowl of the air, and to every thing that creepeth upon the earth, wherein there is life, I have given every green herb for meat: and it was so. 31 And God saw every thing that he had made, and, behold, it was very good. And the evening and the morning were the sixth day.",
      "verse_count": 31
    },
    {
      "reference": "Genesis 2",
      "title": "Genesis 2",
      "summary": "The Creation is completed—God rests on the seventh day—The prior spirit creation is explained—Adam and Eve are placed in the Garden of Eden—They are forbidden to eat of the tree of knowledge of good and evil—Adam names every living creature—Adam and Eve are married by the Lord.",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/2?lang=eng",
      "text": "1 Thus the heavens and the earth were finished, and all the host of them. 2 And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made. 3 And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made. 4 ¶ These are the generations of the heavens and of the earth when they were created, in the day that the Lord God made the earth and the heavens, 5 And every plant of the field before it was in the earth, and every herb of the field before it grew: for the Lord God had not caused it to rain upon the earth, and there was not a man to till the ground. 6 But there went up a mist from the earth, and watered the whole face of the ground. 7 And the Lord God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul. 8 ¶ And the Lord God planted a garden eastward in Eden; and there he put the man whom he had formed. 9 And out of the ground made the Lord God to grow every tree that is pleasant to the sight, and good for food; the tree of life also in the midst of the garden, and the tree of knowledge of good and evil. 10 And a river went out of Eden to water the garden; and from thence it was parted, and became into four heads. 11 The name of the first is Pison: that is it which compasseth the whole land of Havilah, where there is gold; 12 And the gold of that land is good: there is bdellium and the onyx stone. 13 And the name of the second river is Gihon: the same is it that compasseth the whole land of Ethiopia. 14 And the name of the third river is Hiddekel: that is it which goeth toward the east of Assyria. And the fourth river is Euphrates. 15 And the Lord God took the man, and put him into the garden of Eden to dress it and to keep it. 16 And the Lord God commanded the man, saying, Of every tree of the garden thou mayest freely eat: 17 But of the tree of the knowledge of good and evil, thou shalt not eat of it: for in the day that thou eatest thereof thou shalt surely die. 18 ¶ And the Lord God said, It is not good that the man should be alone; I will make him an help meet for him. 19 And out of the ground the Lord God formed every beast of the field, and every fowl of the air; and brought them unto Adam to see what he would call them: and whatsoever Adam called every living creature, that was the name thereof. 20 And Adam gave names to all cattle, and to the fowl of the air, and to every beast of the field; but for Adam there was not found an help meet for him. 21 And the Lord God caused a deep sleep to fall upon Adam, and he slept: and he took one of his ribs, and closed up the flesh instead thereof; 22 And the rib, which the Lord God had taken from man, made he a woman, and brought her unto the man. 23 And Adam said, This is now bone of my bones, and flesh of my flesh: she shall be called Woman, because she was taken out of Man. 24 Therefore shall a man leave his father and his mother, and shall cleave unto his wife: and they shall be one flesh. 25 And they were both naked, the man and his wife, and were not ashamed.",
      "verse_count": 25
    },
    {
      "reference": "Moses 2",
      "title": "Moses 2",
      "summary": "God creates the heavens and the earth—All forms of life are created—God makes man and gives him dominion over all else.",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/pgp/moses/2?lang=eng",
      "text": "1 And it came to pass that the Lord spake unto Moses, saying: Behold, I reveal unto you concerning this heaven, and this earth; write the words which I speak. I am the Beginning and the End, the Almighty God; by mine Only Begotten I created these things; yea, in the beginning I created the heaven, and the earth upon which thou standest. 2 And the earth was without form, and void; and I caused darkness to come up upon the face of the deep; and my Spirit moved upon the face of the water; for I am God. 3 And I, God, said: Let there be light; and there was light. 4 And I, God, saw the light; and that light was good. And I, God, divided the light from the darkness. 5 And I, God, called the light Day; and the darkness, I called Night; and this I did by the word of my power, and it was done as I spake; and the evening and the morning were the first day. 6 And again, I, God, said: Let there be a firmament in the midst of the water, and it was so, even as I spake; and I said: Let it divide the waters from the waters; and it was done; 7 And I, God, made the firmament and divided the waters, yea, the great waters under the firmament from the waters which were above the firmament, and it was so even as I spake. 8 And I, God, called the firmament Heaven; and the evening and the morning were the second day. 9 And I, God, said: Let the waters under the heaven be gathered together unto one place, and it was so; and I, God, said: Let there be dry land; and it was so. 10 And I, God, called the dry land Earth; and the gathering together of the waters, called I the Sea; and I, God, saw that all things which I had made were good. 11 And I, God, said: Let the earth bring forth grass, the herb yielding seed, the fruit tree yielding fruit, after his kind, and the tree yielding fruit, whose seed should be in itself upon the earth, and it was so even as I spake. 12 And the earth brought forth grass, every herb yielding seed after his kind, and the tree yielding fruit, whose seed should be in itself, after his kind; and I, God, saw that all things which I had made were good; 13 And the evening and the morning were the third day. 14 And I, God, said: Let there be lights in the firmament of the heaven, to divide the day from the night, and let them be for signs, and for seasons, and for days, and for years; 15 And let them be for lights in the firmament of the heaven to give light upon the earth; and it was so. 16 And I, God, made two great lights; the greater light to rule the day, and the lesser light to rule the night, and the greater light was the sun, and the lesser light was the moon; and the stars also were made even according to my word. 17 And I, God, set them in the firmament of the heaven to give light upon the earth, 18 And the sun to rule over the day, and the moon to rule over the night, and to divide the light from the darkness; and I, God, saw that all things which I had made were good; 19 And the evening and the morning were the fourth day. 20 And I, God, said: Let the waters bring forth abundantly the moving creature that hath life, and fowl which may fly above the earth in the open firmament of heaven. 21 And I, God, created great whales, and every living creature that moveth, which the waters brought forth abundantly, after their kind, and every winged fowl after his kind; and I, God, saw that all things which I had created were good. 22 And I, God, blessed them, saying: Be fruitful, and multiply, and fill the waters in the sea; and let fowl multiply in the earth; 23 And the evening and the morning were the fifth day. 24 And I, God, said: Let the earth bring forth the living creature after his kind, cattle, and creeping things, and beasts of the earth after their kind, and it was so; 25 And I, God, made the beasts of the earth after their kind, and cattle after their kind, and everything which creepeth upon the earth after his kind; and I, God, saw that all these things were good. 26 And I, God, said unto mine Only Begotten, which was with me from the beginning: Let us make man in our image, after our likeness; and it was so. And I, God, said: Let them have dominion over the fishes of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. 27 And I, God, created man in mine own image, in the image of mine Only Begotten created I him; male and female created I them. 28 And I, God, blessed them, and said unto them: Be fruitful, and multiply, and replenish the earth, and subdue it, and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth. 29 And I, God, said unto man: Behold, I have given you every herb bearing seed, which is upon the face of all the earth, and every tree in the which shall be the fruit of a tree yielding seed; to you it shall be for meat. 30 And to every beast of the earth, and to every fowl of the air, and to everything that creepeth upon the earth, wherein I grant life, there shall be given every clean herb for meat; and it was so, even as I spake. 31 And I, God, saw everything that I had made, and, behold, all things which I had made were very good; and the evening and the morning were the sixth day.",
      "verse_count": 31
    },
    {
      "reference": "Moses 3",
      "title": "Moses 3",
      "summary": "God created all things spiritually before they were naturally upon the earth—He created man, the first flesh, upon the earth—Woman is a help meet for man.",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/pgp/moses/3?lang=eng",
      "text": "1 Thus the heaven and the earth were finished, and all the host of them. 2 And on the seventh day I, God, ended my work, and all things which I had made; and I rested on the seventh day from all my work, and all things which I had made were finished, and I, God, saw that they were good; 3 And I, God, blessed the seventh day, and sanctified it; because that in it I had rested from all my work which I, God, had created and made. 4 And now, behold, I say unto you, that these are the generations of the heaven and of the earth, when they were created, in the day that I, the Lord God, made the heaven and the earth, 5 And every plant of the field before it was in the earth, and every herb of the field before it grew. For I, the Lord God, created all things, of which I have spoken, spiritually, before they were naturally upon the face of the earth. For I, the Lord God, had not caused it to rain upon the face of the earth. And I, the Lord God, had created all the children of men; and not yet a man to till the ground; for in heaven created I them; and there was not yet flesh upon the earth, neither in the water, neither in the air; 6 But I, the Lord God, spake, and there went up a mist from the earth, and watered the whole face of the ground. 7 And I, the Lord God, formed man from the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul, the first flesh upon the earth, the first man also; nevertheless, all things were before created; but spiritually were they created and made according to my word. 8 And I, the Lord God, planted a garden eastward in Eden, and there I put the man whom I had formed. 9 And out of the ground made I, the Lord God, to grow every tree, naturally, that is pleasant to the sight of man; and man could behold it. And it became also a living soul. For it was spiritual in the day that I created it; for it remaineth in the sphere in which I, God, created it, yea, even all things which I prepared for the use of man; and man saw that it was good for food. And I, the Lord God, planted the tree of life also in the midst of the garden, and also the tree of knowledge of good and evil. 10 And I, the Lord God, caused a river to go out of Eden to water the garden; and from thence it was parted, and became into four heads. 11 And I, the Lord God, called the name of the first Pison, and it compasseth the whole land of Havilah, where I, the Lord God, created much gold; 12 And the gold of that land was good, and there was bdellium and the onyx stone. 13 And the name of the second river was called Gihon; the same that compasseth the whole land of Ethiopia. 14 And the name of the third river was Hiddekel; that which goeth toward the east of Assyria. And the fourth river was the Euphrates. 15 And I, the Lord God, took the man, and put him into the Garden of Eden, to dress it, and to keep it. 16 And I, the Lord God, commanded the man, saying: Of every tree of the garden thou mayest freely eat, 17 But of the tree of the knowledge of good and evil, thou shalt not eat of it, nevertheless, thou mayest choose for thyself, for it is given unto thee; but, remember that I forbid it, for in the day thou eatest thereof thou shalt surely die. 18 And I, the Lord God, said unto mine Only Begotten, that it was not good that the man should be alone; wherefore, I will make an help meet for him. 19 And out of the ground I, the Lord God, formed every beast of the field, and every fowl of the air; and commanded that they should come unto Adam, to see what he would call them; and they were also living souls; for I, God, breathed into them the breath of life, and commanded that whatsoever Adam called every living creature, that should be the name thereof. 20 And Adam gave names to all cattle, and to the fowl of the air, and to every beast of the field; but as for Adam, there was not found an help meet for him. 21 And I, the Lord God, caused a deep sleep to fall upon Adam; and he slept, and I took one of his ribs and closed up the flesh in the stead thereof; 22 And the rib which I, the Lord God, had taken from man, made I a woman, and brought her unto the man. 23 And Adam said: This I know now is bone of my bones, and flesh of my flesh; she shall be called Woman, because she was taken out of man. 24 Therefore shall a man leave his father and his mother, and shall cleave unto his wife; and they shall be one flesh. 25 And they were both naked, the man and his wife, and were not ashamed.",
      "verse_count": 25
    },
    {
      "reference": "Abraham 4",
      "title": "Abraham 4",
      "summary": "The Gods plan the creation of the earth and all life thereon—Their plans for the six days of creation are set forth.",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/pgp/abr/4?lang=eng",
      "text": "1 And then the Lord said: Let us go down. And they went down at the beginning, and they, that is the Gods, organized and formed the heavens and the earth. 2 And the earth, after it was formed, was empty and desolate, because they had not formed anything but the earth; and darkness reigned upon the face of the deep, and the Spirit of the Gods was brooding upon the face of the waters. 3 And they (the Gods) said: Let there be light; and there was light. 4 And they (the Gods) comprehended the light, for it was bright; and they divided the light, or caused it to be divided, from the darkness. 5 And the Gods called the light Day, and the darkness they called Night. And it came to pass that from the evening until morning they called night; and from the morning until the evening they called day; and this was the first, or the beginning, of that which they called day and night. 6 And the Gods also said: Let there be an expanse in the midst of the waters, and it shall divide the waters from the waters. 7 And the Gods ordered the expanse, so that it divided the waters which were under the expanse from the waters which were above the expanse; and it was so, even as they ordered. 8 And the Gods called the expanse, Heaven. And it came to pass that it was from evening until morning that they called night; and it came to pass that it was from morning until evening that they called day; and this was the second time that they called night and day. 9 And the Gods ordered, saying: Let the waters under the heaven be gathered together unto one place, and let the earth come up dry; and it was so as they ordered; 10 And the Gods pronounced the dry land, Earth; and the gathering together of the waters, pronounced they, Great Waters; and the Gods saw that they were obeyed. 11 And the Gods said: Let us prepare the earth to bring forth grass; the herb yielding seed; the fruit tree yielding fruit, after his kind, whose seed in itself yieldeth its own likeness upon the earth; and it was so, even as they ordered. 12 And the Gods organized the earth to bring forth grass from its own seed, and the herb to bring forth herb from its own seed, yielding seed after his kind; and the earth to bring forth the tree from its own seed, yielding fruit, whose seed could only bring forth the same in itself, after his kind; and the Gods saw that they were obeyed. 13 And it came to pass that they numbered the days; from the evening until the morning they called night; and it came to pass, from the morning until the evening they called day; and it was the third time. 14 And the Gods organized the lights in the expanse of the heaven, and caused them to divide the day from the night; and organized them to be for signs and for seasons, and for days and for years; 15 And organized them to be for lights in the expanse of the heaven to give light upon the earth; and it was so. 16 And the Gods organized the two great lights, the greater light to rule the day, and the lesser light to rule the night; with the lesser light they set the stars also; 17 And the Gods set them in the expanse of the heavens, to give light upon the earth, and to rule over the day and over the night, and to cause to divide the light from the darkness. 18 And the Gods watched those things which they had ordered until they obeyed. 19 And it came to pass that it was from evening until morning that it was night; and it came to pass that it was from morning until evening that it was day; and it was the fourth time. 20 And the Gods said: Let us prepare the waters to bring forth abundantly the moving creatures that have life; and the fowl, that they may fly above the earth in the open expanse of heaven. 21 And the Gods prepared the waters that they might bring forth great whales, and every living creature that moveth, which the waters were to bring forth abundantly after their kind; and every winged fowl after their kind. And the Gods saw that they would be obeyed, and that their plan was good. 22 And the Gods said: We will bless them, and cause them to be fruitful and multiply, and fill the waters in the seas or great waters; and cause the fowl to multiply in the earth. 23 And it came to pass that it was from evening until morning that they called night; and it came to pass that it was from morning until evening that they called day; and it was the fifth time. 24 And the Gods prepared the earth to bring forth the living creature after his kind, cattle and creeping things, and beasts of the earth after their kind; and it was so, as they had said. 25 And the Gods organized the earth to bring forth the beasts after their kind, and cattle after their kind, and every thing that creepeth upon the earth after its kind; and the Gods saw they would obey. 26 And the Gods took counsel among themselves and said: Let us go down and form man in our image, after our likeness; and we will give them dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. 27 So the Gods went down to organize man in their own image, in the image of the Gods to form they him, male and female to form they them. 28 And the Gods said: We will bless them. And the Gods said: We will cause them to be fruitful and multiply, and replenish the earth, and subdue it, and to have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth. 29 And the Gods said: Behold, we will give them every herb bearing seed that shall come upon the face of all the earth, and every tree which shall have fruit upon it; yea, the fruit of the tree yielding seed to them we will give it; it shall be for their meat. 30 And to every beast of the earth, and to every fowl of the air, and to every thing that creepeth upon the earth, behold, we will give them life, and also we will give to them every green herb for meat, and all these things shall be thus organized. 31 And the Gods said: We will do everything that we have said, and organize them; and behold, they shall be very obedient. And it came to pass that it was from evening until morning they called night; and it came to pass that it was from morning until evening that they called day; and they numbered the sixth time.",
      "verse_count": 31
    },
    {
      "reference": "Abraham 5",
      "title": "Abraham 5",
      "summary": "The Gods finish Their planning of the creation of all things—They bring to pass the Creation according to Their plans—Adam names every living creature.",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/pgp/abr/5?lang=eng",
      "text": "1 And thus we will finish the heavens and the earth, and all the hosts of them. 2 And the Gods said among themselves: On the seventh time we will end our work, which we have counseled; and we will rest on the seventh time from all our work which we have counseled. 3 And the Gods concluded upon the seventh time, because that on the seventh time they would rest from all their works which they (the Gods) counseled among themselves to form; and sanctified it. And thus were their decisions at the time that they counseled among themselves to form the heavens and the earth. 4 And the Gods came down and formed these the generations of the heavens and of the earth, when they were formed in the day that the Gods formed the earth and the heavens, 5 According to all that which they had said concerning every plant of the field before it was in the earth, and every herb of the field before it grew; for the Gods had not caused it to rain upon the earth when they counseled to do them, and had not formed a man to till the ground. 6 But there went up a mist from the earth, and watered the whole face of the ground. 7 And the Gods formed man from the dust of the ground, and took his spirit (that is, the man’s spirit), and put it into him; and breathed into his nostrils the breath of life, and man became a living soul. 8 And the Gods planted a garden, eastward in Eden, and there they put the man, whose spirit they had put into the body which they had formed. 9 And out of the ground made the Gods to grow every tree that is pleasant to the sight and good for food; the tree of life, also, in the midst of the garden, and the tree of knowledge of good and evil. 10 There was a river running out of Eden, to water the garden, and from thence it was parted and became into four heads. 11 And the Gods took the man and put him in the Garden of Eden, to dress it and to keep it. 12 And the Gods commanded the man, saying: Of every tree of the garden thou mayest freely eat, 13 But of the tree of knowledge of good and evil, thou shalt not eat of it; for in the time that thou eatest thereof, thou shalt surely die. Now I, Abraham, saw that it was after the Lord’s time, which was after the time of Kolob; for as yet the Gods had not appointed unto Adam his reckoning. 14 And the Gods said: Let us make an help meet for the man, for it is not good that the man should be alone, therefore we will form an help meet for him. 15 And the Gods caused a deep sleep to fall upon Adam; and he slept, and they took one of his ribs, and closed up the flesh in the stead thereof; 16 And of the rib which the Gods had taken from man, formed they a woman, and brought her unto the man. 17 And Adam said: This was bone of my bones, and flesh of my flesh; now she shall be called Woman, because she was taken out of man; 18 Therefore shall a man leave his father and his mother, and shall cleave unto his wife, and they shall be one flesh. 19 And they were both naked, the man and his wife, and were not ashamed. 20 And out of the ground the Gods formed every beast of the field, and every fowl of the air, and brought them unto Adam to see what he would call them; and whatsoever Adam called every living creature, that should be the name thereof. 21 And Adam gave names to all cattle, to the fowl of the air, to every beast of the field; and for Adam, there was found an help meet for him.",
      "verse_count": 21
    }
  ],
  "scripture_count": 6,
  "seminary_content": null,
  "study_helps": [],
  "additional_resources": [],
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/03?lang=eng",
  "source_week_file": "cfm_2026_week_03.json",
  "extracted_timestamp": "2026-01-04 21:54:37",
  "total_character_count": 35283,
  "total_word_count": 6560
}