{
  "week_number": 8,
  "title": "Week 8: February 16–22 - Genesis 12–17; Abraham 1–2",
  "date_range": "February 16–22",
  "study_level": "essential",
  "duration_estimate": "~8.6 minutes",
  "word_count": 1292,
  "character_count": 7376,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine for a moment that you’re standing in a vast, arid land, the sun beating down, and you hear a voice—a divine call—urging you to leave everything familiar behind. That’s where we find Abraham in Genesis 12, stepping into the unknown because of a promise from God. Today, we’re diving into Genesis 12 through 17 and Abraham 1 through 2, exploring what it means to be a greater follower of righteousness, to trust in God’s covenants, and to know that He hears us, no matter our circumstances. Let’s walk this journey together and see how Abraham’s story speaks directly to your life.\n\nLet’s start with Abraham’s desire to follow righteousness, even when his surroundings pulled him in the opposite direction. In Abraham 1:2, he shares his heart with us, saying, “And, finding there was greater happiness and peace and rest for me, I sought for the blessings of the fathers, and the right whereunto I should be ordained to administer the same; having been myself a follower of righteousness, desiring also to be one who possessed great knowledge, and to be a greater follower of righteousness.” Think about that. Abraham wasn’t just content with being good enough; he yearned for more—more knowledge, more righteousness, more connection with God. And this was despite his own father turning away from true worship and even trying to have Abraham sacrificed to false gods, as we read in Abraham 1:7. What does that tell you about the power of personal desire? Even in a family or culture that might not support your faith, can you, like Abraham, choose to seek God?\n\nThis truth leads us to a powerful reality: God honors those desires. When Abraham’s life was in danger, as described in Abraham 1:12-17, he called on God, and the Lord delivered him. God said in verse 18, “Behold, I will lead thee by my hand, and I will take thee, to put upon thee my name, even the Priesthood of thy father, and my power shall be over thee.” Pause to let that resonate. God didn’t just save Abraham; He promised to lead him by the hand. Have you ever felt God’s hand guiding you through a difficult moment? Maybe it’s worth reflecting on how He’s supported your righteous desires, even when the path felt uncertain.\n\nBuilding on that vision, let’s turn to the covenants God made with Abraham—promises that extend to you and me today. In Abraham 2:9-11, the Lord declares, “And I will make of thee a great nation, and I will bless thee above measure, and make thy name great among all nations, and thou shalt be a blessing unto thy seed after thee, that in their hands they shall bear this ministry and Priesthood unto all nations; And I will bless them through thy name; for as many as receive this Gospel shall be called after thy name, and shall be accounted thy seed, and shall rise up and bless thee, as their father.” Notice how this covenant isn’t just about Abraham. It’s about his posterity—and through the gospel, that includes us. When you were baptized, or when you made covenants in the temple, you became part of this family, this promise. What does it mean to you to be counted as Abraham’s seed, to carry forward his legacy of faith?\n\nLet’s look closer at some of these covenant blessings. In Genesis 13:16, God promises Abraham, “And I will make thy seed as the dust of the earth: so that if a man can number the dust of the earth, then shall thy seed also be numbered.” And in Genesis 15:5, He says, “Look now toward heaven, and tell the stars, if thou be able to number them: and he said unto him, So shall thy seed be.” Imagine gazing at the night sky, trying to count the stars, or holding a handful of sand, knowing each grain represents a promise of posterity. These aren’t just earthly blessings; they point to eternal realities. As we learn in Doctrine and Covenants 132:30-31, Abraham’s covenant continues into eternity, promising exaltation and continuation of family forever. How does that change the way you see your own covenants? Take a quiet moment to ponder how these eternal promises give meaning to your daily choices.\n\nThis brings us to another layer of the covenant: God told Abraham to “be a blessing” in Genesis 12:2. Think about that for a second. It’s not just about receiving blessings; it’s about becoming a source of light for others. Abraham lived this by being a peacemaker, as we see in Genesis 13:5-12, when he let Lot choose the land first to avoid strife. He also showed his faith through tithing, as recorded in Genesis 14:20, giving a tenth of all he had to Melchizedek. How can you be a blessing in your family or community? Maybe it’s through small acts of kindness, resolving conflicts with love, or faithfully living gospel principles like tithing. These actions ripple outward, just as Abraham’s did.\n\nSpeaking of Melchizedek, let’s linger on this remarkable figure for a moment. In the Joseph Smith Translation of Genesis 14:26-27, we learn, “Now Melchizedek was a man of faith, who wrought righteousness; and when a child he feared God, and stopped the mouths of lions, and quenched the violence of fire.” This man, a type of Christ, held the priesthood that bears his name, as confirmed in Doctrine and Covenants 107:2-4. His life reminds us of the power and holiness of the Melchizedek Priesthood today. How does knowing about Melchizedek’s faith deepen your appreciation for the priesthood ordinances you participate in, like the sacrament or temple blessings?\n\nNow, let’s shift to a tender moment in Abraham’s story—his long wait for a child with Sarah. In Genesis 15:2-3, Abraham expresses his sorrow, saying, “Lord God, what wilt thou give me, seeing I go childless?” Yet God reassures him in verse 4, “This shall not be thine heir; but he that shall come forth out of thine own bowels shall be thine heir.” Hebrews 11:11 tells us that Sarah, through faith, received strength to conceive, even when it seemed impossible. Reflect on that for a second. What promises are you waiting for in your life? How can Abraham and Sarah’s patience and trust in God’s timing inspire you to hold on with faith?\n\nFinally, let’s touch on Hagar’s story in Genesis 16. When she felt alone and mistreated, fleeing into the wilderness, the angel of the Lord found her and promised her a son, Ishmael, whose name means “God hears.” In Genesis 16:11, the angel says, “Behold, thou art with child, and shalt bear a son, and shalt call his name Ishmael; because the Lord hath heard thy affliction.” Let that truth settle in your heart. God heard Hagar in her pain, just as He hears you. When have you felt that God has heard your cries, even in moments of loneliness or struggle?\n\nAs we close, consider how Abraham’s journey—from seeking righteousness to trusting in covenants to knowing God hears—mirrors the path God invites you to walk. His story shows us that no matter our past or our challenges, we can choose to follow righteousness, and God will honor that choice with His promises and presence. I invite you to take a moment this week to ponder one desire of your heart—something you’re seeking from God. Write it down, pray about it, and notice how He supports you in that righteous pursuit. Let Abraham’s faith remind you that God is leading you by the hand, every step of the way. Thank you for joining me today, and I look forward to exploring more of God’s word with you soon.",
  "generated_timestamp": "2025-12-26 20:21:33",
  "source_week_file": "cfm_2026_week_08.json"
}