{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~7.4 minutes",
  "word_count": 1109,
  "character_count": 6291,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on the edge of a vast desert, the wind carrying whispers of ancient stories—tales of prophets, covenants, and a God who never stops reaching out to His people. As we step into this new year of studying the Old Testament, we’re embarking on a journey through some of the oldest sacred writings in the world. These stories might feel distant, even foreign at times, but they hold treasures of truth that can light our path today, just as the psalmist declared, “Thy word is a lamp unto my feet, and a light unto my path” (Psalm 119:105). So, are you ready to uncover the ways God moved in the lives of people like Abraham, Sarah, and Daniel—and to see how He’s moving in yours?\n\nLet’s start by recognizing why the Old Testament matters so deeply. At its heart, this collection of writings isn’t just history or law or poetry—it’s a witness of Jesus Christ. Long before He walked the earth as the Savior, His presence was woven into every page. Think about the manna that sustained the children of Israel in the wilderness, as described in Exodus 16:4, where the Lord says, “Behold, I will rain bread from heaven for you.” Doesn’t that point directly to Christ, who later declared, “I am the bread of life” (John 6:35)? Or consider the sacrificial lamb of the Passover in Exodus 12:3-5, a pure and spotless offering, echoing John’s testimony of Jesus as “the Lamb of God, which taketh away the sin of the world” (John 1:29). From the brass serpent lifted up by Moses in Numbers 21:4-10 to Jonah’s three days in the belly of the great fish in Jonah 1:4-17, these symbols and stories are like signposts, all directing us to the Messiah. Pause for a moment. What do these images teach you about who Jesus is and what He offers you?\n\nBuilding on this truth, let’s go a step deeper. Did you know that when the Old Testament speaks of “the Lord” or “God,” it’s almost always referring to Jehovah—and that Jehovah is Jesus Christ Himself? President Dallin H. Oaks taught that the words spoken by “God” or the “Lord” in scripture are most often the words of our risen Savior (Liahona, May 2023). Think about when Jesus declared to the leaders of the Jews, “Before Abraham was, I am” (John 8:58). That statement shocked them because it echoed the sacred name revealed to Moses in Exodus 3:14, where God says, “I AM THAT I AM.” Jesus was claiming His divine identity as Jehovah, the God of the Old Testament. Reflect on that for a second. How does knowing that Jesus is Jehovah change the way you read these ancient stories? When you hear Him speak to Moses or Abraham, it’s the voice of the Savior reaching across time to you.\n\nThis truth leads us to another layer of wonder in our study this year. Through the Prophet Joseph Smith, the Lord restored many “plain and precious things” that had been lost from the Bible over centuries. In 1 Nephi 13:28-29, Nephi saw in vision that “many plain and precious things” were taken from the scriptures, but the Lord promised to bring them forth again. Think of treasures like the Book of Moses, which restores sacred truths about Adam, Eve, and Enoch—truths we wouldn’t have in Genesis alone. Or the Book of Abraham, revealing profound visions of the council in heaven in Abraham 3:22-28. These restored writings help us see the Old Testament with clearer eyes. They show us God’s plan, His covenants, and His love in ways that were hidden for generations. Take a quiet moment. Why do these restored truths feel precious to you? How do they help you feel closer to God?\n\nNotice how this pattern continues in the theme of covenants, which runs like a golden thread through the Old Testament. In Exodus 19:5, the Lord tells His people, “If ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people.” Isn’t that beautiful? God yearns to make us His treasure through sacred promises. As you read stories of Abraham, Isaac, and Jacob this year, you’ll see how covenants shaped their lives—and how they shape yours. President Russell M. Nelson has taught that the everlasting covenant is central to God’s plan (Liahona, October 2022). Whether it’s the covenant of baptism, as described in Mosiah 18:10, where we promise to bear one another’s burdens, or the sacred ordinances of the temple, these promises bind us to God with a special kind of love and mercy. Let that truth settle in your heart. How do your covenants with God make you feel treasured by Him?\n\nAs we prepare to dive into these ancient writings, let’s not forget the youngest among us. If you’re studying with children, help them see Jesus in the stories and symbols. Read Isaiah 7:14 together, where the prophet foretells, “Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel.” Or share Isaiah 9:6, which calls Him “Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.” Let them point out details in pictures like “The Prophet Isaiah Foretells Christ’s Birth” and talk about how these prophecies make the Savior feel close. You can also talk about covenants in simple ways—maybe by discussing promises they make with friends or family, then connecting that to the promise of baptism. Sing a song like “When I Am Baptized” from the Children’s Songbook to help these truths sink into their hearts.\n\nAs we close this introduction to the Old Testament, let’s reflect on the journey ahead. These scriptures are more than ancient history—they’re a lamp to guide us, a light to show us Jesus Christ in every chapter. They reveal Him as Jehovah, the God who speaks to prophets and to us. They restore precious truths through Joseph Smith, and they teach us the power of covenants that make us God’s peculiar treasure. So, as you begin this year of study, I invite you to look for the Savior on every page. Whether you’re reading alone, with your family, or with children, ask yourself, “How does this story or symbol point me to Jesus Christ?” Write down what you find, and let it draw you closer to Him. This journey through the Old Testament is an invitation to see God’s hand in ancient lives—and in your own. Let’s walk this path together, with faith, with wonder, and with hearts open to the light of His word.",
  "generated_timestamp": "2025-12-31 23:59:54",
  "source_week_file": "cfm_2026_week_01.json"
}