{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "essential",
  "duration_estimate": "~8.6 minutes",
  "word_count": 1290,
  "character_count": 6942,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, the world stretched out below you, and suddenly, the heavens open. You’re not just seeing the earth, but you’re beholding the very glory of God Himself. That’s where we find Moses in Moses 1, caught up in a vision so powerful it changes everything he understands about himself, about God, and about the purpose of life. Today, as we dive into Moses 1 and Abraham 3, we’re going to explore some of the most profound questions you’ve ever asked: Who are you, really? What is God’s work for you? And how does knowing where you came from shape where you’re going? Let’s step into these sacred records together and see what the Lord has to teach us.\n\nLet’s start with Moses. In Moses 1:4, the Lord speaks directly to him and says, “Behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands.” Think about that for a moment. God calls Moses His son. Not just a servant, not just a prophet, but His son. And then, in verse 6, He adds, “And I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten.” Pause to let that resonate. Moses isn’t just being given a task; he’s being reminded of his divine identity and his connection to Jesus Christ. This is where it all begins—knowing who we are in God’s eyes. As President Russell M. Nelson has taught, if the Lord were speaking to you directly, the first thing He’d want you to understand is your true identity as a child of God. So, let me ask you: How does it feel to know that you, too, are a son or daughter of God? How does that truth shape the way you see yourself today?\n\nNow, contrast that with what happens just a few verses later in Moses 1:12. Satan comes to Moses and sneers, “Moses, son of man, worship me.” Notice the difference. God lifts Moses up by affirming his divine heritage, while Satan tries to tear him down, reducing him to nothing more than a “son of man.” It’s a stark reminder of how the adversary works—he wants to confuse us about who we are. He wants us to forget our divine worth. But Moses doesn’t fall for it. In verse 13, he responds with confidence, “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?” Take a quiet moment here. What can we learn from Moses’s response? When you’re tempted to doubt your worth or to follow a path that pulls you away from God, how can remembering your identity as a child of God give you strength?\n\nThis truth leads us to another powerful lesson from Moses’s experience—how to resist Satan’s counterfeits. Satan doesn’t just leave after Moses rebukes him. He keeps pushing, even raging in verse 19, trying to intimidate Moses with false displays of power. But Moses stands firm. In verse 18, he calls upon God, saying, “I will not cease to call upon God, I have other things to inquire of him.” And by verse 26, with the Lord’s help, Moses overcomes. What stands out to you here? For me, it’s the reminder that spiritual experiences don’t mean we’ll never be tempted again. Temptation often comes right after moments of revelation. But like Moses, we can call on God. We can refuse to be deceived by counterfeits—whether those are false ideas about who we are or empty promises of happiness that can’t last. So, think about your own life. What counterfeits does Satan try to offer you? How can turning to the Lord help you see through them?\n\nBuilding on that vision, let’s turn to Moses 1:39, where the Lord reveals His purpose. He says, “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” Let that truth settle in your heart. God’s entire work, His greatest joy, is to help you gain eternal life. Immortality means living forever, which comes through the Resurrection because of Jesus Christ. But eternal life is more—it’s living with God, becoming like Him. This isn’t just a distant hope; it’s the reason for everything. When Moses asked in verse 30, “Tell me, I pray thee, why these things are so, and by what thou madest them,” God’s answer points to you and me. The earth, the heavens, all of creation—it’s for us, His children, to help us return to Him. How does knowing that God’s glory is tied to your eternal happiness change the way you see your daily choices?\n\nNow, let’s connect this to Abraham 3, where we get a glimpse of life before this earth. In Abraham 3:22-23, we read, “Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones; And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good.” Reflect on that for a second. Before you were born, you existed as a spirit. You were known by God, seen as good, and some were chosen as noble and great ones. Does that include you? What does it mean to know that your life didn’t start here on earth, that you have a history with God?\n\nThen, in Abraham 3:25, the Lord explains why we’re here: “And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” This earth life is a test, a chance to choose, to grow, to show our love for God by following Him. And verse 26 adds a beautiful promise: those who keep their first estate—meaning they chose to follow God in the premortal life—and keep their second estate here on earth, “shall have glory added upon their heads for ever and ever.” That’s the plan. That’s why you’re here. How does knowing you lived with God before this life help you make choices now? How does it help you trust that He has a purpose for you?\n\nAs we tie these truths together, notice how they all point to one thing: you are a child of God with a divine destiny. Moses learned it on the mountain when God called him His son. Abraham saw it in vision, understanding our premortal existence and God’s plan to prove us. And through their experiences, we see that God’s work is all about helping us return to Him, with the Savior at the center of that plan. So, let’s bring this home. How can you let your identity as a child of God shape your decisions this week? Maybe it’s in how you treat yourself with more kindness, or how you lift others by seeing them as God’s children too. Perhaps it’s in resisting temptation by calling on Him, just as Moses did.\n\nI invite you to take a moment today to ponder Moses 1:4 and Abraham 3:23. Look in the mirror, if you’d like, and remind yourself, “I am a child of God.” Let that truth guide you. Write down one choice you’ll make this week because of who you are. Carry that with you, and let it draw you closer to the Lord. Thank you for joining me today. Let’s keep seeking Him together as we study His word.",
  "generated_timestamp": "2025-12-26 20:08:27",
  "source_week_file": "cfm_2026_week_02.json"
}