{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "duration_estimate": "~8.6 minutes",
  "word_count": 1289,
  "character_count": 7613,
  "segment_count": 36,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’ve got a question that’s been burning in my mind. In John 8:58, Jesus says just three words—'Before Abraham was, I am'—and the Jews are so enraged they pick up stones to kill Him. Why such an extreme reaction over a simple statement?"
    },
    {
      "speaker": "David",
      "text": "Oh, Sarah, that’s the perfect mystery to unpack the identity of Jesus in the Old Testament. Those three words weren’t just a statement—they were a declaration of divinity. To understand why the Jews reacted that way, we have to go back 1,400 years to a burning bush in Exodus 3. Hold on to that question, because the answer will shift everything."
    },
    {
      "speaker": "Sarah",
      "text": "Wait, what? A burning bush? I’m already hooked. Let’s dive into this from multiple angles—how did ancient Israel understand this, how did Christ frame it, and what do we see today?"
    },
    {
      "speaker": "David",
      "text": "Exactly. Let’s start with ancient Israel. In Exodus 3:13-15, when Moses asks God for His name, God replies, 'I AM THAT I AM.' This name, 'I AM,' or Jehovah, was sacred—it represented the eternal, self-existent God of Israel. So when Jesus says, 'I am,' He’s claiming to be that same Jehovah."
    },
    {
      "speaker": "Sarah",
      "text": "That’s fascinating, but how does that connect to Christ’s time? Did the Jews in His day make that leap instantly?"
    },
    {
      "speaker": "David",
      "text": "They did, and that’s why they were furious. In their minds, Jesus was committing blasphemy by equating Himself with Jehovah. Notice this pattern—Jehovah in the Old Testament is the pre-mortal Christ, as President Dallin H. Oaks taught: 'The scriptural records of words spoken by God or the Lord are almost always the words of Jehovah, our risen Lord, Jesus Christ.' That’s from the Liahona, May 2023. So Christ’s statement was a direct claim to be their God."
    },
    {
      "speaker": "Sarah",
      "text": "I never saw it that clearly before! So from a modern perspective, as Latter-day Saints, how does this deepen our understanding of who Jesus is?"
    },
    {
      "speaker": "David",
      "text": "It’s profound. Knowing Jesus is Jehovah ties the Old Testament directly to the Restoration. Through Joseph Smith, we learn 'plain and precious things' that clarify this identity—like in 1 Nephi 13:38-42, where the Lord promises to restore truths lost from the Bible. Jesus as Jehovah isn’t just a title; it’s the key to seeing Him in every page of the Old Testament."
    },
    {
      "speaker": "Sarah",
      "text": "That’s remarkable. Let’s trace this theme of Jesus as Jehovah across dispensations. Where do we see it first in the Old Testament?"
    },
    {
      "speaker": "David",
      "text": "Let’s start with Adam and Eve. In Moses 6:63, the Lord teaches Adam that 'all things are created and made to bear record of me.' From the very beginning, every symbol—think of the sacrificial lamb in Exodus 12:3-5—points to Christ as Jehovah, the one who would redeem them."
    },
    {
      "speaker": "Sarah",
      "text": "And that lamb connects to John 1:29, right? Where John the Baptist calls Jesus 'the Lamb of God'?"
    },
    {
      "speaker": "David",
      "text": "Precisely! Notice this pattern—it stretches to Moses with the brass serpent in Numbers 21:4-10, which Jesus Himself links to His crucifixion in John 3:14. Then fast forward to Jonah, whose three days in the whale prefigure Christ’s resurrection, as noted in Matthew 12:38-41. This theme of Jehovah as Redeemer echoes through every era."
    },
    {
      "speaker": "Sarah",
      "text": "I’m seeing it now—a web of symbols across time. How does this show up in the Restoration, in our modern dispensation?"
    },
    {
      "speaker": "David",
      "text": "Here’s where it gets powerful. Through Joseph Smith, we get restored accounts like the Book of Moses and the Book of Abraham. In Abraham 3:22-28, we see Jehovah as the pre-mortal Christ organizing the council in heaven. It’s a direct line from ancient covenants to our modern understanding of the plan of salvation."
    },
    {
      "speaker": "Sarah",
      "text": "That’s incredible. Let’s add some historical context to this. Are there archaeological or cultural insights that bring this idea of Jehovah to life?"
    },
    {
      "speaker": "David",
      "text": "Absolutely. One fascinating discovery is the reverence for the name 'YHWH'—the Tetragrammaton, or Jehovah—in ancient Israelite culture. Scholars have found that this name was so sacred it was rarely spoken aloud; instead, they used substitutes like 'Adonai.' This shows why Jesus saying 'I am' in John 8:58 was so shocking—it was as if He uttered the unutterable name."
    },
    {
      "speaker": "Sarah",
      "text": "A time collapse moment! I feel like I’m standing in that ancient crowd, hearing the weight of those words. What’s another cultural piece that helps us understand this reaction?"
    },
    {
      "speaker": "David",
      "text": "Here’s something striking. Ancient Jewish texts and traditions, supported by findings like the Dead Sea Scrolls, emphasize a deep messianic expectation. The Jews were waiting for a deliverer, but many couldn’t fathom that Jehovah Himself would come as a humble carpenter. That cultural lens explains their outrage—Jesus didn’t fit their mold."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so eye-opening. Now, let’s circle back to our opening mystery. Why did those three words provoke such violence, and what’s the deeper truth here?"
    },
    {
      "speaker": "David",
      "text": "Here’s the resolution, Sarah. When Jesus said, 'Before Abraham was, I am,' He wasn’t just claiming pre-existence; He was declaring that He is Jehovah, the God of Israel, as seen in Exodus 3:14. The Jews understood this as blasphemy because it meant their God was standing before them in the flesh, challenging everything they thought they knew."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a powerful reveal. I feel the weight of that moment. So, knowing Jesus is Jehovah, what hidden connections can we uncover in the Old Testament that most people miss?"
    },
    {
      "speaker": "David",
      "text": "Let’s look at two surprising cross-references. First, in Isaiah 7:14, we read, 'Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel.' Immanuel means 'God with us'—a direct hint that Jehovah would dwell among men as Jesus."
    },
    {
      "speaker": "Sarah",
      "text": "Wow, that’s subtle but clear. What’s the second connection?"
    },
    {
      "speaker": "David",
      "text": "Notice this in Psalm 23:1, 'The Lord is my shepherd; I shall not want.' The Hebrew word for 'Lord' here is Jehovah. Jesus later claims this title in John 10:11, saying, 'I am the good shepherd.' It’s a quiet but profound link across centuries."
    },
    {
      "speaker": "Sarah",
      "text": "I never caught that before! It’s like a thread weaving through time. How does this tie into the bigger picture of the plan of salvation?"
    },
    {
      "speaker": "David",
      "text": "It’s central. Jehovah as Jesus is the architect of the plan—He’s the one who covenanted with Abraham, led Israel, and ultimately atoned for us. Every Old Testament symbol, from manna to the lamb, points to His role as our Redeemer, fulfilling the eternal covenant we renew today through ordinances."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautiful. Speaking of covenants, how can this understanding of Jesus as Jehovah shape how we see our relationship with God today?"
    },
    {
      "speaker": "David",
      "text": "It brings the Old Testament to life in a personal way. In Exodus 19:5, God calls Israel His 'peculiar treasure' through covenant. As modern Saints, we’re part of that same covenant family—Jesus as Jehovah is still calling us to be His people, to trust Him as our Shepherd and Redeemer."
    },
    {
      "speaker": "Sarah",
      "text": "I love that connection. It makes the ancient feel so immediate. What about prophetic echoes—how do modern prophets reinforce this truth?"
    },
    {
      "speaker": "David",
      "text": "Think of President Russell M. Nelson’s teachings on the everlasting covenant in the Liahona, October 2022. He emphasizes that God’s covenant love spans all dispensations. Just as Jehovah sought Israel, modern prophets remind us that Christ seeks us through the same restored gospel."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so unifying. Before we wrap up, how can we apply this discovery to our lives right now?"
    },
    {
      "speaker": "David",
      "text": "Here’s an invitation. As you read the Old Testament this year, look for Jehovah—Jesus—in every story and symbol. Ask yourself, 'How is Christ speaking to me here?' Let His identity as your God deepen your faith in His power to guide and save you."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a challenge I’m excited to take on. David, thank you for unraveling this mystery with me. I feel like I’m seeing the scriptures with new eyes."
    },
    {
      "speaker": "David",
      "text": "It’s been a joy, Sarah. There’s so much more to discover together in these sacred pages."
    }
  ],
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-01 02:08:04",
  "source_week_file": "cfm_2026_week_01.json"
}