{
  "week_number": 7,
  "title": "Week 7: February 9–15 - Genesis 6–11; Moses 8",
  "date_range": "February 9–15",
  "study_level": "essential",
  "duration_estimate": "~8.1 minutes",
  "word_count": 1219,
  "character_count": 6702,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a hill, watching dark clouds gather over a world spiraling into chaos. The air feels heavy with corruption, violence everywhere, and hearts turned far from God. In the midst of this darkness, one man stands out—Noah, a preacher of righteousness, who found grace in the eyes of the Lord. What was it about Noah that set him apart in such a wicked time? And what can his story teach us as we live in a world that often mirrors the days before the Flood?\n\nLet’s dive into Genesis 6 through 11 and Moses 8, where we find not just a story of destruction, but a powerful message of hope, mercy, and covenant. These chapters remind us that even in the darkest of times, God provides a way for safety and salvation. As we explore Noah’s journey, the Flood, and even the Tower of Babel, we’ll see patterns that apply directly to our lives today. After all, the Savior Himself taught that the last days before His return would be like the days of Noah, as recorded in Joseph Smith—Matthew 1:41. So, let’s ask ourselves: How can we, like Noah, find grace and safety in a turbulent world?\n\nStarting with Moses 8, we get a vivid picture of why the Flood was necessary. The Lord saw that the wickedness of man was great, that “every imagination of the thoughts of his heart was only evil continually,” as Genesis 6:5 describes. Moses 8:28 adds that the earth was “corrupt before God, and it was filled with violence.” Pause to let that resonate. Can you see echoes of this in our own day? Perhaps in the ways selfishness, anger, or disregard for sacred things seem to spread. Yet, in the middle of this darkness, Noah stood as a light. Moses 8:27 tells us, “Noah found grace in the eyes of the Lord; for Noah was a just man, and perfect in his generation; and he walked with God.” What does it mean to walk with God when the world around you is falling apart? It means listening to His voice through His prophets, holding fast to righteousness, even when it’s unpopular or hard.\n\nThis truth leads us to a key theme: there is spiritual safety in following the Lord’s prophet. Noah was called as a prophet in a time of crisis, as we read in Moses 8:16, where “Noah prophesied, and taught the things of God, even as it was in the beginning.” Despite the mockery and rejection he faced, described in Moses 8:21, Noah kept preaching repentance, warning of the coming destruction. Think about that for a moment. How is our living prophet today like Noah? While we’re not building an ark, our prophet is warning us of spiritual dangers and inviting us to come unto Christ for safety. Maybe it’s a call to strengthen our families, to turn away from worldly distractions, or to prepare for the Savior’s return. What warning or invitation from our prophet feels most urgent to you right now?\n\nBuilding on that vision, let’s consider the Flood itself, not just as a story of judgment, but as an act of mercy. Genesis 6:7 records the Lord saying, “I will destroy man whom I have created from the face of the earth.” At first, that might seem harsh, but look closer at Genesis 6:5-6, where we see the Lord’s heart: “And God saw that the wickedness of man was great in the earth... and it grieved him at his heart.” The Flood wasn’t just punishment; it was a way to stop a world so corrupt that, as Elder Neal A. Maxwell explained, spirits could no longer be sent here in justice. It was mercy to end a cycle of agency-destroying evil. And for Noah and his family, it was a new beginning, a chance to start fresh under God’s covenant. How often does God, in His mercy, clear away the chaos in our own lives to help us rebuild on a stronger foundation?\n\nThis idea of covenant brings us to a beautiful symbol in Genesis 9:8-17, where God establishes His promise with Noah, saying, “I do set my bow in the cloud, and it shall be for a token of a covenant between me and the earth” (Genesis 9:13). The rainbow isn’t just a pretty sight; it’s a reminder of God’s promise never to destroy the earth by flood again. The Joseph Smith Translation in Genesis 9:21-25 adds even deeper meaning, teaching that this token would remind every generation of God’s mercy and covenant. Take a quiet moment. What symbols in your own life remind you of promises you’ve made with God? Maybe it’s the sacrament each Sunday, a temple recommend in your wallet, or even a simple family tradition. How do these tokens help you remember to stay close to Him?\n\nNow, let’s shift to another story in these chapters—the Tower of Babel in Genesis 11:1-9. Here we see a stark contrast to Noah’s righteousness. The people of Babel sought to “build us a city and a tower, whose top may reach unto heaven” (Genesis 11:4). But their motive wasn’t to draw closer to God; as Helaman 6:28 explains, it was inspired by pride and a desire to make a name for themselves, influenced by Satan. Their tower led to confusion and division, scattering them across the earth. Compare that to the people of Zion in Enoch’s day, who reached heaven not by building a tower, but by building unity, love, and obedience, as we read in Moses 7:18-19. What a powerful lesson for us. Are we trying to reach God through our own strength or pride, or are we following the true path He’s provided through His Son? John 3:16 reminds us, “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” That’s the way to heaven—through Jesus Christ.\n\nNotice how this pattern continues in our lives. Just as the people of Babel needed to turn from pride to find God, we too must choose the Savior’s way over the world’s. And just as Noah found safety by heeding God’s voice through a prophet, we can find protection by listening to our prophet today. These ancient stories aren’t just history; they’re a guide for navigating our own latter-day challenges.\n\nAs we close, let’s reflect on what we’ve learned from Noah and the Tower of Babel. We live in a time that mirrors the corruption and violence of Noah’s day, but we also have access to the same grace he found. God has given us a living prophet, covenants with sacred tokens like the rainbow, and the path of Jesus Christ to lead us home. Let that truth settle in your heart. What is one way you can follow Noah’s example this week? Perhaps it’s taking time to listen to the prophet’s most recent conference talk and acting on one of his invitations. Whatever it is, seek that spiritual safety by walking with God, just as Noah did. I invite you to ponder how you can draw closer to the Lord through His prophet and His Son, knowing that their guidance will always lead you to peace.",
  "generated_timestamp": "2025-12-26 20:19:19",
  "source_week_file": "cfm_2026_week_07.json"
}