{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "duration_estimate": "~10.8 minutes",
  "word_count": 1620,
  "character_count": 9448,
  "segment_count": 31,
  "script": [
    {
      "speaker": "David",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "And I'm Sarah. Happy to be here!"
    },
    {
      "speaker": "David",
      "text": "Sarah, I have to start with a question that's been burning in my mind. Why did the Jews try to stone Jesus when He said just three simple words: 'I am'? What was so shocking about that phrase that they picked up rocks to kill Him on the spot? And more importantly, what does this reveal about who Jesus really is in the Old Testament?"
    },
    {
      "speaker": "Sarah",
      "text": "David, that’s a fantastic question, and it cuts right to the heart of one of the most profound revelations in scripture. Those three words, 'I am,' weren’t just a statement—they were a declaration of divinity. If we look at John 8:58-59, Jesus says, 'Before Abraham was, I am,' and the reaction is immediate and violent. What they heard was a claim to be God Himself, and to understand why, we need to go back to a pivotal moment in the Old Testament."
    },
    {
      "speaker": "David",
      "text": "Wait, so you’re saying this reaction ties directly to something in the Old Testament? I’m intrigued. Where do we look, and what’s the connection?"
    },
    {
      "speaker": "Sarah",
      "text": "Exactly, David. Turn to Exodus 3:13-15, where Moses asks God for His name at the burning bush. God responds, 'I AM THAT I AM,' and tells Moses to say to the children of Israel, 'I AM hath sent me unto you.' That name, 'I AM,' or in Hebrew, 'YHWH,' often rendered as Jehovah, was sacred—a name so holy that many Jews wouldn’t even pronounce it. So when Jesus says, 'I am,' He’s invoking that divine name, claiming to be Jehovah Himself."
    },
    {
      "speaker": "David",
      "text": "That’s astonishing! So from an ancient Israelite perspective, Jesus wasn’t just making a bold statement—He was saying He’s the God of their fathers. But how does this play out across different viewpoints? I mean, what would the Jews of Jesus’ day think versus what we understand now in the Restoration?"
    },
    {
      "speaker": "Sarah",
      "text": "Great point. From the perspective of first-century Jews, this was blasphemy of the highest order—claiming equality with God was unthinkable, which is why they sought to stone Him. But from Christ’s own view, as recorded in John, He’s revealing His eternal identity as the pre-mortal Jehovah, the same being who spoke to Moses. And in our modern Restoration understanding, we have confirmation from leaders like President Dallin H. Oaks, who taught in the May 2023 Liahona that when we read 'God' or 'Lord' in the Old Testament, it’s almost always referring to Jehovah, who is Jesus Christ."
    },
    {
      "speaker": "David",
      "text": "I love how those perspectives converge. It’s like a thread weaving through history. So let’s trace this thread—how does this identity of Jesus as Jehovah show up as a pattern across different dispensations in the Old Testament?"
    },
    {
      "speaker": "Sarah",
      "text": "I’m glad you asked, because this pattern is everywhere once you start looking. Notice how Jehovah is the covenant-making God in the Old Testament—think of the covenants with Abraham, Isaac, and Jacob. In Exodus 19:5, Jehovah says, 'ye shall be a peculiar treasure unto me above all people,' establishing that covenant relationship. This same Jehovah is Jesus Christ, who in His mortal ministry and in the Restoration continues to offer covenants, as we see in the Book of Mormon and Doctrine and Covenants."
    },
    {
      "speaker": "David",
      "text": "That’s fascinating. So the covenant theme ties directly to Christ across time. What about other symbols or types of Christ in the Old Testament that reinforce this pattern?"
    },
    {
      "speaker": "Sarah",
      "text": "Absolutely, and here’s where it gets powerful. Look at the manna in Exodus 16:4, where God provides bread from heaven for Israel. Jesus directly connects this to Himself in John 6:35, saying, 'I am the bread of life.' Then there’s the sacrificial lamb in Exodus 12:3-5, which John 1:29 echoes when John the Baptist declares Jesus as 'the Lamb of God, which taketh away the sin of the world.' These aren’t just symbols—they’re deliberate pointers to Christ as Jehovah."
    },
    {
      "speaker": "David",
      "text": "I’m seeing it now—there’s a deliberate design here. What about the brass serpent in Numbers 21? I’ve always wondered how that fits."
    },
    {
      "speaker": "Sarah",
      "text": "That’s another perfect example. In Numbers 21:4-10, the people are bitten by serpents, and Moses raises a brass serpent on a pole—those who look to it live. Jesus Himself explains this in John 3:14, saying, 'as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.' It’s a direct foreshadowing of His crucifixion and the healing power of His Atonement."
    },
    {
      "speaker": "David",
      "text": "That gives me chills. These aren’t random stories—they’re orchestrated to point to Christ. Let’s dive into some historical context. What do we know about the culture of ancient Israel that makes these symbols so vivid?"
    },
    {
      "speaker": "Sarah",
      "text": "Let’s ground this in the world of ancient Israel. Archaeologically, we know that the Israelites lived in a world surrounded by cultures with multiple gods, often tied to nature or fertility. Yet Jehovah insists on being the one true God, as seen in the Ten Commandments. Excavations of ancient altars and inscriptions, like those found at Kuntillet Ajrud, show how unique Israel’s monotheism was, and how central the name of Jehovah was to their identity—making Jesus’ claim all the more explosive in that cultural setting."
    },
    {
      "speaker": "David",
      "text": "That’s so vivid—it’s like I can feel the tension of that moment when Jesus speaks. And knowing how sacred that name was, no wonder the reaction was so intense. Let’s circle back to that original question about 'I am.' How does understanding Jesus as Jehovah resolve the mystery of why they tried to stone Him?"
    },
    {
      "speaker": "Sarah",
      "text": "Here’s the resolution, David. By saying 'I am,' Jesus wasn’t just claiming to exist before Abraham—He was declaring Himself to be the eternal Jehovah, the God who delivered Israel from Egypt, the one whose name was too sacred to speak lightly. To the Jews of His day, this was not just a theological debate; it was an affront to everything they held dear unless they accepted His divinity. Understanding Him as Jehovah bridges the Old and New Testaments, showing He’s the same God across all dispensations."
    },
    {
      "speaker": "David",
      "text": "That’s a powerful payoff. It’s like the entire Old Testament is a prelude to Christ’s ministry. Are there other hidden connections we might miss that tie this identity across scriptures?"
    },
    {
      "speaker": "Sarah",
      "text": "Definitely. One connection most people don’t notice is in Jonah 1:4-17, where Jonah is cast into the sea and spends three days in the belly of the great fish. Jesus references this in Matthew 12:38-41 as a sign of His own death and resurrection—three days in the tomb. It’s a subtle but profound link between an Old Testament prophet’s experience and Christ’s ultimate victory over death."
    },
    {
      "speaker": "David",
      "text": "I’ve read Jonah a hundred times and never caught that parallel. What else?"
    },
    {
      "speaker": "Sarah",
      "text": "Another is in the Restoration scriptures. In Moses 6:63, the Lord teaches Adam that 'all things are created and made to bear record of me.' This principle, restored through Joseph Smith, confirms that every story, symbol, and covenant in the Old Testament is designed to point to Christ. Then in 1 Nephi 13:21-29, we learn how plain and precious truths were lost from the Bible, but restored through the Book of Mormon and other records—many of which clarify Christ’s role as Jehovah."
    },
    {
      "speaker": "David",
      "text": "That’s remarkable. It’s like a web of connections spanning thousands of years. How about one more before we think about applying this today?"
    },
    {
      "speaker": "Sarah",
      "text": "Let’s look at Isaiah. In Isaiah 7:14, we read, 'Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel,' which means 'God with us.' And in Isaiah 9:6, He’s called 'Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.' These prophecies aren’t just poetic—they’re direct testimonies of Jehovah coming to earth as Jesus Christ, fulfilling His role as our Savior."
    },
    {
      "speaker": "David",
      "text": "That ties it all together so beautifully. Now, how does understanding Jesus as Jehovah in the Old Testament change the way we live or study today?"
    },
    {
      "speaker": "Sarah",
      "text": "It transforms everything, David. When we read the Old Testament knowing that Jehovah is Jesus Christ, every interaction, every covenant, every promise becomes personal. It’s not just history—it’s His voice speaking to us, inviting us into a covenant relationship, just as He did with Abraham and Moses. Elder Dale G. Renlund’s counsel from the November 2023 Liahona to 'remember and always focus on Jesus Christ' becomes a guiding principle for our study."
    },
    {
      "speaker": "David",
      "text": "I love that—it makes the Old Testament feel alive and relevant. It’s not just ancient stories; it’s a direct line to Christ. What’s one practical way we can carry this into our daily lives or teaching?"
    },
    {
      "speaker": "Sarah",
      "text": "One way is to actively look for Christ in every chapter we read. Whether it’s a symbol like the brass serpent or a prophecy like Isaiah’s, ask, 'How does this point to Jesus?' For teachers, help students or family members see these connections by asking questions like, 'What does this teach us about the Savior’s role in our lives?' It deepens faith and makes scripture study a treasure hunt for His presence."
    },
    {
      "speaker": "David",
      "text": "That’s a challenge I’m excited to take on. Sarah, this has been an incredible journey—from the mystery of 'I am' to seeing Christ woven through every page of the Old Testament. I’m walking away with a renewed desire to search for Him in my study."
    },
    {
      "speaker": "Sarah",
      "text": "I’m thrilled to hear that, David. As we embark on this year of studying the Old Testament, let’s keep our eyes on Jesus Christ, the Bread of Life, the Lamb of God, and Jehovah Himself. Let’s invite everyone listening to join us in looking for Him in every story and symbol."
    },
    {
      "speaker": "David",
      "text": "Absolutely. Thank you, Sarah, for unpacking this with me. To our listeners, dive into the Old Testament with us, and let’s discover Christ together in these sacred pages. We’ll see you next time on the Come Follow Me Podcast."
    }
  ],
  "host": "David",
  "guest": "Sarah",
  "voices": {
    "Sarah": "aoede",
    "David": "enceladus"
  },
  "generated_timestamp": "2026-01-04 20:29:45",
  "source_week_file": "cfm_2026_week_01.json"
}