{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "connected",
  "duration_estimate": "~9.9 minutes",
  "word_count": 1486,
  "character_count": 8524,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, the world stretching endlessly before you, and hearing the voice of God Himself declare, “Behold, thou art my son” (Moses 1:4). What would that moment do to your heart? How would it change the way you see yourself? Today, as we dive into Moses 1 and Abraham 3, we’re stepping into sacred revelations given through Joseph Smith—revelations that pull back the veil on who God is, who we are, and why we’re here on this earth. These chapters aren’t just ancient history; they’re a divine mirror reflecting our eternal identity and purpose. So, let’s journey together into these truths and see how they can transform us.\n\nLet’s start with Moses, who, in a breathtaking vision, encounters the Lord on a mountain. The Lord speaks words that resonate with eternal weight: “And behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands” (Moses 1:4). Think about that. Before showing Moses the vastness of creation, God first affirms his identity as His child. This isn’t just a casual statement—it’s the foundation of everything that follows. God then says, “And I have a work for thee, Moses, my son” (Moses 1:6). Pause to let that resonate. God has a work for Moses, tailored to him as His son. Doesn’t that make you wonder—what work does God have for you, as His child?\n\nThis truth of our divine identity stands in stark contrast to the voice of Satan, who soon after confronts Moses. Notice the difference in tone and intent. Satan sneers, “Moses, son of man, worship me” (Moses 1:12). Where God uplifts with truth, Satan distorts and diminishes, trying to strip away Moses’s sense of worth. But Moses stands firm, declaring, “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten” (Moses 1:13). What a powerful response! Moses clings to the truth of his identity, and it becomes his shield. Reflect on that for a second. How often do we hear voices—whether from the world or within—that try to make us forget who we really are? How can knowing you’re a child of God help you stand against those lies?\n\nBuilding on that vision, let’s see how Moses’s experience teaches us to resist Satan’s counterfeits. After this initial confrontation, Satan doesn’t give up. He rages, tempts, and tries to instill fear, but Moses calls upon God’s strength, saying, “In the name of the Only Begotten, depart hence, Satan” (Moses 1:21). And finally, after persistent prayer, “Satan cried with a loud voice, and ranted upon the earth, and commanded, saying: I am the Only Begotten, worship me. And it came to pass that Moses looked upon Satan and said: I will not cease to call upon God, I have other things to inquire of him” (Moses 1:19-20). What do we learn here? Satan offers fake power, fake promises, fake identity—but Moses discerns the counterfeit by staying connected to the true source of light. Think about the counterfeits in our world today—maybe it’s the lure of fleeting pleasures or the pressure to define ourselves by worldly standards. How can we, like Moses, turn to God in prayer to see through these deceptions?\n\nThis pattern of resisting through divine truth leads us to another profound revelation in Moses 1. After overcoming Satan, Moses is shown the vastness of God’s creations and asks, “Tell me, I pray thee, why these things are so, and by what thou madest them?” (Moses 1:30). The Lord’s response is one of the most beautiful declarations in scripture: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39). Let that truth settle in your heart. God’s entire purpose, the reason behind every star and every soul, is to help us gain eternal life—to become like Him. Immortality is to live forever, but eternal life is to live forever with God, in His presence and with His nature. How does knowing that God’s greatest joy is your eternal progress change the way you see your daily struggles and choices?\n\nNow, let’s weave this thread into the vision of Abraham, recorded in Abraham 3, where we glimpse our existence before this earth was even formed. The Lord shows Abraham the premortal realm, saying, “Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones” (Abraham 3:22). Picture that—before the foundations of this earth, you were there, a spirit, known and loved by God. The Lord continues, explaining His plan: “We will make an earth whereon these may dwell; And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them” (Abraham 3:24-25). This life is a test, a proving ground, but it’s not random. It’s part of a divine plan crafted by a loving Father who wants us to grow into our eternal potential. How does knowing you existed before this life, with a purpose to fulfill, shape the way you face challenges today?\n\nNotice how this vision also reveals the Savior’s central role. Among those spirits, the Lord says, “And there stood one among them that was like unto God, and he said unto those who were with him: We will go down, for there is space there, and we will take of these materials, and we will make an earth whereon these may dwell” (Abraham 3:24). This is Jesus Christ, chosen and foreordained before the world was to be our Redeemer. His willingness to come down, to create, to sacrifice, ensures that God’s work and glory can be fulfilled in us. Isn’t it incredible to see how every piece of the plan—our premortal life, this earthly test, and the Savior’s Atonement—fits together to bring us back to God?\n\nLet’s deepen this understanding by connecting these truths across the scriptures. In Matthew 4:1-11, we see the Savior Himself resisting Satan’s temptations in the wilderness, much like Moses did. Each time Satan offers a counterfeit—power, glory, safety—Jesus responds with the word of God, saying things like, “It is written, Man shall not live by bread alone, but by every word that proceedeth out of the mouth of God” (Matthew 4:4). This echoes Moses’s reliance on divine truth to overcome deception. And in modern revelation, we’re reminded of our divine identity in places like Doctrine and Covenants 11:20, where the Lord says, “Behold, this is your work, to keep my commandments, yea, with all your might, mind and strength.” Just as Moses and Abraham were called to specific works, we too have a purpose tied to our identity as children of God. How do these connections across time and scripture strengthen your resolve to live true to who you are?\n\nAs we reflect on these powerful revelations, let’s consider how they apply to our lives right now. President Russell M. Nelson has taught that if the Lord were speaking to you directly, the first thing He’d ensure you understand is your true identity as His child. He’s also said, “The way you think about who you really are affects almost every decision you will ever make” (Choices for Eternity, worldwide devotional for young adults, May 2022). Take a quiet moment to ponder that. How does seeing yourself as a child of God influence the choices you make each day—whether it’s how you treat others, how you handle temptation, or how you pursue your purpose?\n\nLet’s close with a few invitations to carry these truths into your life. First, individually, take some time this week to read Moses 1:4-6 and Abraham 3:22-25 again, and write down in a journal or notebook how knowing you’re a child of God with a premortal past shapes your sense of worth. What decisions might you approach differently because of this? Second, as a family or with a friend, discuss a time when you’ve had to resist a temptation or counterfeit, like Moses did. Share how turning to God in prayer or scripture helped you through it. And third, ponder a specific work or purpose God might have for you right now. Maybe it’s a calling, a relationship, or a personal goal—ask Him in prayer to help you see it clearly.\n\nThese revelations in Moses 1 and Abraham 3 are more than stories; they’re a divine blueprint of who we are and why we’re here. As you carry these truths with you, remember that you are a child of God, known and loved from before the world was, with a purpose that ties into His eternal plan. Let that guide you, strengthen you, and inspire you to draw closer to Him every day. Until we meet again, keep seeking, keep learning, and keep following Him.",
  "generated_timestamp": "2026-01-01 00:02:16",
  "source_week_file": "cfm_2026_week_02.json"
}