{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~6.8 minutes",
  "word_count": 1023,
  "character_count": 5997,
  "segment_count": 25,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’ve got a question that’s been nagging at me. What if I told you there’s a single statement from Jesus that nearly got Him stoned by the Jews—and it’s tied directly to the Old Testament? Most people miss the weight of this moment. What’s going on there?"
    },
    {
      "speaker": "David",
      "text": "Oh, Sarah, that’s a fantastic place to start. You’re referring to John 8:58, where Jesus says, ‘Before Abraham was, I am.’ That statement was explosive because it connects directly to Jehovah’s declaration in Exodus 3:14, where God tells Moses, ‘I AM THAT I AM.’ Jesus is claiming to be Jehovah Himself, and the Jews understood that as blasphemy."
    },
    {
      "speaker": "Sarah",
      "text": "Wait, so you’re saying Jesus is identifying Himself as the God of the Old Testament? That’s huge! How do we even begin to unpack what that means for reading these ancient stories?"
    },
    {
      "speaker": "David",
      "text": "Exactly, Sarah. It shifts everything. When we read the Old Testament, we’re not just reading about ‘God’ in a distant sense—we’re often hearing the voice of Jesus Christ, Jehovah, speaking to prophets like Moses and Abraham. Let’s look at this from multiple angles: the ancient Israelite perspective, Christ’s own view, and how we understand it today through the Restoration."
    },
    {
      "speaker": "Sarah",
      "text": "I love that approach. Let’s start with the ancient Israelites. How would they have understood Jehovah in their day-to-day lives?"
    },
    {
      "speaker": "David",
      "text": "For the Israelites, Jehovah was their deliverer, their lawgiver, and their covenant God. Think of Exodus 19:5, where He calls them His ‘peculiar treasure’ through a covenant relationship. They saw Him as the one who brought them out of Egypt, provided manna, and spoke through prophets. But they didn’t fully grasp that this was the pre-mortal Christ."
    },
    {
      "speaker": "Sarah",
      "text": "That’s fascinating. And from Christ’s perspective, when He’s speaking as Jehovah, what’s His purpose in those interactions?"
    },
    {
      "speaker": "David",
      "text": "Christ, as Jehovah, is preparing them for His future mortal mission. Every symbol, every covenant points to Him. Take the manna in Exodus 16:4—He’s literally feeding them, but in John 6:35, He says, ‘I am the bread of life.’ He’s teaching them to rely on Him for both physical and spiritual sustenance."
    },
    {
      "speaker": "Sarah",
      "text": "I’m starting to see a pattern here. It’s like there’s this thread of divine provision running through the Old Testament, pointing to Christ. Can we trace that across a few more examples?"
    },
    {
      "speaker": "David",
      "text": "Absolutely. Notice this pattern of divine sustenance: the manna in Exodus, the sacrificial lamb in Exodus 12:3-5 pointing to John 1:29 where Christ is ‘the Lamb of God,’ and even the brass serpent in Numbers 21:8-9, which Christ Himself connects to His crucifixion in John 3:14. Across dispensations, He’s the source of life and healing."
    },
    {
      "speaker": "Sarah",
      "text": "That’s remarkable! Each of these symbols is like a signpost to Jesus. I never realized how layered the Old Testament is with these connections. What’s a historical detail that can help us feel closer to these ancient stories?"
    },
    {
      "speaker": "David",
      "text": "Here’s something that brings it to life. Archaeologists have uncovered evidence of ancient Israelite altars and sacrificial practices that align with descriptions in Exodus. For instance, remains of unblemished lambs from that era show how seriously they took the command for a perfect sacrifice—mirroring the perfection of Christ as the ultimate offering. It makes you feel the weight of their rituals."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so vivid. It’s like I can picture them preparing that lamb, not fully knowing it was pointing to the Savior. Now, let’s circle back to that shocking moment in John 8. Why was Jesus’ claim so upsetting to the Jews?"
    },
    {
      "speaker": "David",
      "text": "Here’s where it gets powerful. By saying ‘I am,’ Jesus isn’t just claiming divinity—He’s using the very name Jehovah revealed to Moses in Exodus 3:14. To the Jews, this was a direct assertion that He was their God, the one who spoke to Abraham and Moses. That’s why John 8:59 says they took up stones to cast at Him—it was unthinkable unless it was true."
    },
    {
      "speaker": "Sarah",
      "text": "That’s such a clarifying moment. It’s like the Old Testament and New Testament snap together in that single phrase. Are there other hidden connections like this that most people might overlook?"
    },
    {
      "speaker": "David",
      "text": "Definitely. Look at Jonah’s story in Jonah 1:4-17. Jesus Himself references it in Matthew 12:40, saying Jonah’s three days in the whale’s belly foreshadowed His three days in the tomb. It’s a subtle but stunning link between an ancient prophet’s ordeal and the Resurrection."
    },
    {
      "speaker": "Sarah",
      "text": "I’ve never caught that before! It’s like the Old Testament is a treasure map to Christ if you know where to look. What about another connection—maybe something restored through Joseph Smith?"
    },
    {
      "speaker": "David",
      "text": "Here’s a gem. In the Book of Moses, we get restored truths about Enoch’s city of Zion in Moses 7:18-19, showing a people so united in righteousness they were taken up to God. This echoes Christ’s teachings on unity in John 17 and connects to modern revelations about building Zion today. It’s a thread across thousands of years."
    },
    {
      "speaker": "Sarah",
      "text": "That’s incredible. It makes me wonder how these ancient patterns apply to us right now. How can we use this idea of looking for Christ in the Old Testament in our daily lives?"
    },
    {
      "speaker": "David",
      "text": "It’s simpler than we might think. As we study the Old Testament this year, we can ask ourselves: where do I see Christ in this story or symbol? Like Elder Dale G. Renlund said in his message ‘Jesus Christ Is the Treasure,’ we should always focus on finding Him. It turns scripture study into a personal quest for the Savior."
    },
    {
      "speaker": "Sarah",
      "text": "I love that idea of it being a quest. It makes me excited to dive into these ancient texts with fresh eyes. David, as we wrap up, what’s one invitation you’d give our listeners based on what we’ve discovered?"
    },
    {
      "speaker": "David",
      "text": "I’d invite everyone to pick one Old Testament symbol we discussed—like the manna or the sacrificial lamb—and ponder how it points to Christ. Spend a few minutes this week reflecting on how He sustains or redeems you personally. It can deepen your connection to Him."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a beautiful challenge. Thank you, David, for helping us see the Old Testament in such a powerful way. I can’t wait to keep exploring with you!"
    }
  ],
  "host": "Sarah",
  "guest": "David",
  "voices": {
    "Sarah": "aoede",
    "David": "enceladus"
  },
  "generated_timestamp": "2026-01-04 20:27:50",
  "source_week_file": "cfm_2026_week_01.json"
}