{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~5.2 minutes",
  "word_count": 782,
  "character_count": 4364,
  "segment_count": 19,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’m so excited to kick off this year with an introduction to the Old Testament. How do you feel about diving into these ancient scriptures with our listeners?"
    },
    {
      "speaker": "David",
      "text": "I’m thrilled, Sarah. The Old Testament can feel a bit intimidating at first because it’s so ancient and the culture is different, but it’s full of powerful stories and truths that still speak to us today. I love that we get to uncover those together."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so true. I think one thing that helps me connect with it is looking for Jesus Christ in these stories. Can you share why that’s such an important focus as we start this journey?"
    },
    {
      "speaker": "David",
      "text": "Absolutely. The Old Testament is really a testimony of Jesus Christ, even though it was written long before He was born. When we look for Him, we see symbols and prophecies everywhere—like the manna in Exodus 16:4, which points to Christ as the Bread of Life in John 6:35. It helps us see that God’s plan has always centered on the Savior."
    },
    {
      "speaker": "Sarah",
      "text": "I love that connection with the manna. It makes the Old Testament feel so relevant. What are some other symbols of Christ that stand out to you?"
    },
    {
      "speaker": "David",
      "text": "One that really strikes me is the sacrificial lamb from Exodus 12:3-5. It’s a direct foreshadowing of Christ as the Lamb of God, as John 1:29 describes. Also, the brass serpent in Numbers 21:4-10, which Jesus Himself references in John 3:14, shows how looking to Him brings healing and salvation. These symbols remind us of His role in every part of God’s plan."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautiful. It’s amazing how these ancient stories point to the Savior in such clear ways. Now, I’ve also heard that Jesus Christ is actually Jehovah in the Old Testament. Can you explain what that means?"
    },
    {
      "speaker": "David",
      "text": "Yes, that’s a profound truth. President Dallin H. Oaks taught that when we read ‘God’ or ‘Lord’ in the Old Testament, it’s almost always referring to Jehovah, who is Jesus Christ before His mortal life. For example, in Exodus 3:13-15, when God reveals His name as ‘I AM,’ Jesus later echoes that in John 8:58, saying, ‘Before Abraham was, I am.’ It shows us that Christ was central to God’s work from the very beginning."
    },
    {
      "speaker": "Sarah",
      "text": "Wow, that gives me chills. Knowing that Jesus is Jehovah makes the Old Testament feel even more personal. How does that change the way we might read these stories?"
    },
    {
      "speaker": "David",
      "text": "It invites us to see His voice and His hand in every interaction. When Jehovah speaks to Moses or guides the Israelites, it’s the pre-mortal Christ showing His love and authority. It deepens our understanding of His eternal role as our Savior and Redeemer."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly! Now, let’s talk about how the Old Testament ties into our lives today. I know it’s full of covenants, like the ones God made with Abraham. Why are those covenants so important for us to understand?"
    },
    {
      "speaker": "David",
      "text": "Covenants are at the heart of the Old Testament, Sarah. In Exodus 19:5, God calls His people a ‘peculiar treasure’ through covenant. These promises show God’s desire to have a special relationship with us, just like He did with ancient Israel. When we keep our covenants today, like at baptism or in the temple, we experience that same kind of love and mercy."
    },
    {
      "speaker": "Sarah",
      "text": "That’s such a comforting thought. It makes me want to look for those covenant moments as we study. How can we apply this idea of covenants to our daily lives?"
    },
    {
      "speaker": "David",
      "text": "I think it starts with remembering the promises we’ve made with God. Whether it’s through baptism or other ordinances, we can ask ourselves how we’re living up to those commitments. The Old Testament shows us that even when people struggled, like Abraham or Jacob, God never gave up on them. That reminds us to keep trying and to rely on His grace."
    },
    {
      "speaker": "Sarah",
      "text": "I love that perspective. It’s so encouraging to know God is patient with us, just like He was with them. As we wrap up, what’s one thing you hope listeners will take away from this introduction to the Old Testament?"
    },
    {
      "speaker": "David",
      "text": "I hope they’ll feel excited to look for Jesus Christ in these pages. Whether it’s through symbols, prophecies, or the covenants, the Old Testament is a witness of Him. I’d invite everyone to start by reading a few verses and asking, ‘How does this point me to the Savior?’"
    },
    {
      "speaker": "Sarah",
      "text": "That’s a wonderful invitation, David. Thank you for sharing your insights today. Let’s all take that challenge to heart and seek the Savior as we begin studying the Old Testament together. We’ll see you next time!"
    }
  ],
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-01 01:05:21",
  "source_week_file": "cfm_2026_week_01.json"
}