{
  "week_number": 8,
  "title": "Week 8: February 16–22 - Genesis 12–17; Abraham 1–2",
  "date_range": "February 16–22",
  "study_level": "connected",
  "duration_estimate": "~10.0 minutes",
  "word_count": 1500,
  "character_count": 8694,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine for a moment that you’re standing in the ancient land of Ur, surrounded by a culture steeped in idol worship, where even your own father has turned away from the true God. In the midst of this darkness, a young man named Abraham feels a burning desire in his heart—a longing to be different, to seek something higher. He yearns, as he later records, “to be a greater follower of righteousness” (Abraham 1:2). What kind of courage does it take to stand apart like that? What kind of faith does it require to trust that God will honor such a desire, even when everything around you pulls in the opposite direction? Today, as we dive into Genesis 12 through 17 and Abraham 1 through 2, we’re going to explore how Abraham’s story is not just history—it’s a pattern for each of us. It’s a story of desires, covenants, and divine promises that can shape your life as much as they shaped his.\n\nLet’s start with that desire Abraham felt. In Abraham 1:2, he tells us he sought for the blessings of the fathers and the right to administer them, wanting to be “a follower of righteousness” and to possess “a greater knowledge.” Think about that. Despite his family’s choices—despite his own father’s attempt to have him sacrificed to false gods—Abraham chose to create something different within himself. As Elder Neil L. Andersen has taught, there is a place inside each of us that we uniquely control, where our inner desires are given life through our choices and actions. Abraham’s desires weren’t just wishes; they were evident in how he lived. He sought God. He prayed. He resisted the wickedness around him. And God responded. In Abraham 1:15-16, we read that when Abraham was bound on the altar, he called upon the Lord, and an angel came, loosed his bands, and delivered him. God supported Abraham’s righteous desires with divine intervention. Pause to let that resonate. What are your deepest desires? Are they leading you closer to God? And how might He be supporting you, even now, in ways you may not yet fully see?\n\nThis truth leads us to consider not just Abraham’s desires, but also the trials that tested them. For years, Abraham and Sarah longed for a child—a righteous desire that remained unfulfilled. In Genesis 15:2-3, Abraham expresses his concern to the Lord, wondering who will inherit his house since he remains childless. Yet God reassures him in verse 5, saying, “Look now toward heaven, and tell the stars, if thou be able to number them: and he said unto him, So shall thy seed be.” Abraham believed God, as we’re told in verse 6: “And he believed in the Lord; and he counted it to him for righteousness.” The book of Hebrews in the New Testament adds depth to this moment. Hebrews 11:11 tells us that Sarah herself “through faith also… received strength to conceive seed… because she judged him faithful who had promised.” Even when the fulfillment of God’s promise seemed “afar off,” they embraced it with faith (Hebrews 11:13). Reflect on that for a second. What promises are you waiting on? How does the Savior help you hold onto hope when answers seem delayed?\n\nBuilding on that vision of faith, let’s turn to the heart of Abraham’s story—the covenant God made with him. In Abraham 2:9-11, the Lord promises Abraham a land of inheritance, a posterity as numerous as the dust of the earth, and that through his seed, all the families of the earth would be blessed. We see these promises echoed in Genesis 12:2-3, where God says, “I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing… and in thee shall all families of the earth be blessed.” Why does this matter to you? Because, as Abraham 2:10 teaches, “as many as receive this Gospel shall be called after thy name, and shall be accounted thy seed.” Through baptism and temple covenants, you are part of this promise. You are Abraham’s seed, heirs to the same blessings. Take a quiet moment to think about that. How do promises like a land of inheritance or a great posterity find eternal fulfillment? Doctrine and Covenants 132:30-31 reminds us that Abraham’s covenant continues in us, promising exaltation and continuation of the seeds forever if we remain faithful. What a breathtaking scope—your choices today tie you to an eternal heritage.\n\nNotice how this pattern continues in the way God invites Abraham not just to receive blessings, but to be a blessing. In Genesis 12:2, the Lord says, “thou shalt be a blessing.” Abraham 2:11 expands this, promising that through Abraham’s seed, “all the families of the earth [shall] be blessed, even with the blessings of the Gospel, which are the blessings of salvation, even of life eternal.” How are you called to be a blessing to others? Maybe it’s through sharing the gospel, serving in your family, or simply showing kindness. As Elder Dale G. Renlund has taught, covenants give us access to God’s power—power to lift and bless those around us. Think about a time when keeping your covenants has enabled you to help someone else. How did that strengthen your connection to God?\n\nLet’s deepen this understanding by looking at another figure in Abraham’s story—Melchizedek, a man of profound faith who blessed Abraham. In the Joseph Smith Translation of Genesis 14:26-27, we learn that Melchizedek “was a man of faith, who wrought righteousness; and when a child he feared God, and stopped the mouths of lions, and quenched the violence of fire.” Alma 13:18 tells us he “did preach repentance unto his people. And behold, they did repent.” This is the man after whom the higher priesthood is named, as Doctrine and Covenants 107:2-4 explains. Melchizedek’s life reflects Christlike qualities—faith, righteousness, courage, and a commitment to leading others to God. When Abraham met him, as recorded in Genesis 14:18-19, Melchizedek blessed him and received tithes from him. Reflect on how studying Melchizedek’s life shapes your view of the priesthood. How does it inspire you to honor the priesthood in your own life or to seek its blessings?\n\nThis encounter also teaches us about Abraham’s attitude toward wealth. In Genesis 14:23, after rescuing Lot and reclaiming goods from the king of Sodom, Abraham declares, “I will not take from a thread even to a shoelatchet… lest thou shouldest say, I have made Abram rich.” His focus wasn’t on material gain; it was on giving glory to God. The Joseph Smith Translation of Genesis 14:37-39 adds that Abraham paid tithes to Melchizedek, showing his commitment to God’s law. How does tithing shape your perspective on wealth? Does it help you prioritize eternal treasures over temporary ones?\n\nLet’s shift to another powerful theme in these chapters—God hears us. In Genesis 16, we meet Hagar, Sarah’s handmaid, who flees into the wilderness after being treated harshly. Alone and despairing, she encounters an angel of the Lord, who tells her in verse 11, “Behold, thou art with child, and shalt bear a son, and shalt call his name Ishmael; because the Lord hath heard thy affliction.” Ishmael means “God hears.” Similarly, in Abraham 1:15, when Abraham’s life was in danger on the altar, he called out, and God heard him, sending an angel to deliver him. Let that truth settle in your heart. When have you felt that God heard you in a moment of need? How does knowing He hears you change the way you approach prayer?\n\nAs we draw this journey through Abraham’s life to a close, let’s reflect on what his story teaches us about becoming greater followers of righteousness. Abraham’s life shows that no matter our past or our family’s choices, God honors our righteous desires. His covenant with Abraham extends to us, promising blessings of eternal significance if we remain faithful. And through it all, God hears us, just as He heard Abraham and Hagar. These stories are not just ancient history; they’re invitations to trust God more deeply, to align our desires with His will, and to be a blessing to others.\n\nSo, I invite you to ponder a few things this week. First, take some time to write in your journal about a righteous desire you feel in your heart. How can you act on it, trusting that God will support you? Second, as a family, discuss one way you can be a blessing to someone else—perhaps by serving a neighbor or sharing a gospel truth. And third, reflect on a moment when you felt God heard you. Let that memory strengthen your prayers this week. As you do these things, you’ll find yourself walking closer to the path Abraham walked—a path of faith, covenant, and divine connection. Thank you for joining me today, and I look forward to exploring more of God’s word with you soon.",
  "generated_timestamp": "2025-12-26 20:22:16",
  "source_week_file": "cfm_2026_week_08.json"
}