{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "essential",
  "duration_estimate": "~7.9 minutes",
  "word_count": 1191,
  "character_count": 6553,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, gazing at the vast expanse of the heavens, feeling the weight of your own smallness, and then hearing the voice of God Himself say to you, “Thou art my son.” That’s the breathtaking moment Moses experienced in Moses 1, a moment that reshapes everything we understand about who we are and why we’re here. Today, as we dive into Moses 1 and Abraham 3, we’re not just starting our study of the Old Testament—we’re stepping into revelations that answer life’s deepest questions: Who is God? Who am I? And what is my purpose in His grand plan? Let’s explore these sacred truths together and see how they can light up our lives.\n\nLet’s begin with Moses on that mountain. In Moses 1:4, the Lord speaks directly to him, saying, “Behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands.” Just a few verses later, in Moses 1:6, God reinforces this identity: “And I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten.” Pause to let that resonate. God calls Moses His son, not just once, but with purpose—there’s a work for him to do. This isn’t just about Moses; it’s about you and me. We, too, are children of God, each with a divine identity and a unique work to fulfill. Think about that for a moment: How does knowing you’re a child of God change the way you see yourself or the choices you make each day?\n\nNow, contrast this with what happens next in Moses 1:12, when Satan comes to tempt Moses, saying, “Moses, son of man, worship me.” Do you hear the difference? God lifts Moses up with his true identity as a son of God, while Satan tries to drag him down, reducing him to mere mortality, a “son of man.” It’s a tactic the adversary still uses today—trying to make us forget who we really are. But Moses doesn’t falter. In verse 13, he responds with clarity: “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?” Moses knows his identity, and that knowledge becomes his shield. Reflect on that for a second. When have you felt tempted to doubt your worth or your purpose? How can remembering that you’re a child of God help you stand firm like Moses did?\n\nThis truth of our divine identity ties beautifully into what we learn in Abraham 3 about our premortal existence. In Abraham 3:22-23, the Lord shows Abraham the spirits that were with Him before the world was, saying, “These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born.” Take a quiet moment to picture that scene. Before this earth was even created, you and I were there as spirits, known and loved by God. Some, like Abraham, were chosen for specific roles, but all of us were sent here with a purpose—to be tested and proven, as verse 25 explains: “And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” This life is our proving ground. How does knowing you lived with God before coming here shape the way you face challenges or make decisions now?\n\nBuilding on that vision, let’s look at why God created all of this. Moses, after seeing the vastness of God’s creations, asks in Moses 1:30, “Tell me, I pray thee, why these things are so, and by what thou madest them?” The Lord’s answer in Moses 1:39 is profound: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” Let that truth settle in your heart. Every star, every mountain, every moment of this earth’s existence is part of God’s plan to help you and me return to Him, not just to live forever, but to have eternal life—to become like Him. In Abraham 3:24-26, we see this plan unfolding as the Lord describes making an earth where we can dwell and be proven. Jesus Christ, chosen as our Redeemer before the foundation of the world, is central to this plan. Without Him, immortality and eternal life would be out of reach. How does it feel to know that everything God does is for your eternal happiness?\n\nNow, let’s circle back to Moses’s encounter with Satan, because it teaches us how to hold on to these truths when opposition comes. After God withdraws for a time, Satan returns, tempting Moses to doubt and worship him. But Moses stands strong. In Moses 1:18, he calls upon God, saying, “I will not cease to call upon God, I have other things to inquire of him.” And in verse 20, after being commanded to depart, Satan trembles, but Moses persists in prayer until, in verse 26, the Lord’s Spirit returns to strengthen him. What can we learn from this? Even after powerful spiritual experiences, temptation will come. Satan often offers counterfeits—fake versions of God’s truth or power. Think about the counterfeits you encounter today: empty promises of happiness, distractions that pull you from your purpose. How can you, like Moses, call upon God and rely on His strength to overcome them?\n\nThis pattern of resisting Satan isn’t just for ancient prophets—it’s for us, in our everyday moments. Maybe it’s a quiet choice at dinnertime to turn away from a negative thought, or a decision to pray when you feel overwhelmed. Teaching in the Savior’s Way reminds us that these lessons can happen spontaneously in families—while eating a meal or doing chores. Could you take a moment with your family to talk about how you’ve resisted temptation, just as Moses did? These small conversations can build strength for the bigger battles.\n\nAs we close, let’s reflect on what we’ve uncovered today. You are a child of God, known and loved before this world was even formed. Your life here is part of a divine plan, a proving ground where God’s work and glory are to bring you back to Him through Jesus Christ. And even when Satan tries to pull you down with doubts or counterfeits, you have the power, like Moses, to stand firm by calling on God. I invite you to take some time this week to look in the mirror, as you might with a child, and say to yourself, “I am a child of God.” Let that truth guide one choice you make—maybe how you treat yourself or someone else. Write down how it feels to put your divine identity first.\n\nNext week, we’ll dive deeper into the Creation and the Fall, exploring how these events set the stage for our journey back to God. Until then, may you feel His love and purpose in every step you take.",
  "generated_timestamp": "2025-12-26 19:45:53",
  "source_week_file": "cfm_2026_week_02.json"
}