{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~7.1 minutes",
  "word_count": 1064,
  "character_count": 6125,
  "segment_count": 22,
  "script": [
    {
      "speaker": "David",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "And I'm Sarah. Happy to be here!"
    },
    {
      "speaker": "David",
      "text": "Sarah, I’ve got a question that’s been nagging at me as we dive into the Old Testament this year. What if I told you there’s a hidden connection in the very first stories of the Bible that most people completely miss—a connection that points directly to Jesus Christ? I’m curious to see if you’ve noticed it too."
    },
    {
      "speaker": "Sarah",
      "text": "Oh, David, I love where you’re going with this! There are so many layers in those early accounts, but I think I know what you’re hinting at. Let’s start with something fundamental—think about the symbols right from the beginning, like in the story of Adam and Eve. There’s something there that whispers of the Savior if you look closely."
    },
    {
      "speaker": "David",
      "text": "Wait, are you talking about their sacrifices? I’ve read about them offering sacrifices, but I never really connected the dots. How does that tie to Christ? Help me see this."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly, David! In Moses 5, we learn about Adam and Eve offering sacrifices as they were commanded. But here’s what shifts everything: they didn’t fully understand why until an angel explained that it was a similitude of the sacrifice of the Only Begotten of the Father. This is one of those moments where the Old Testament is already pointing to Jesus Christ, right from the very first family."
    },
    {
      "speaker": "David",
      "text": "That’s fascinating! So, from the perspective of Adam and Eve, they’re obeying a commandment, maybe even puzzled by it. But from God’s view, it’s a teaching tool about the Atonement. How does this play out as we move through other Old Testament stories?"
    },
    {
      "speaker": "Sarah",
      "text": "It’s a pattern that repeats over and over. Think about the sacrificial lamb in Exodus 12:3-5, where the Israelites are told to choose a lamb without blemish for the Passover. Then, in John 1:29, John the Baptist declares, ‘Behold the Lamb of God, which taketh away the sin of the world.’ From an ancient Israelite perspective, it’s about deliverance from Egypt, but from a gospel lens, it’s a direct foreshadowing of Christ’s sacrifice."
    },
    {
      "speaker": "David",
      "text": "I’m starting to see this thread now. So, let’s trace this pattern a bit further. Where else does this idea of sacrifice or deliverance show up as a type of Christ across different dispensations?"
    },
    {
      "speaker": "Sarah",
      "text": "Let’s look at the brass serpent in Numbers 21:4-10. The Israelites are bitten by fiery serpents, and Moses raises a serpent on a pole—those who look to it are healed. Jesus Himself connects this to His mission in John 3:14, saying, ‘And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.’ It’s this incredible thread of being saved by looking to a symbol of Christ."
    },
    {
      "speaker": "David",
      "text": "That’s remarkable! So we’ve got Adam’s sacrifices, the Passover lamb, the brass serpent—all pointing to the same truth across centuries. Is there a modern parallel to this pattern that ties it to us today?"
    },
    {
      "speaker": "Sarah",
      "text": "Absolutely. Think about the sacrament we partake of each week. Just as the ancients looked to these symbols for deliverance, we look to the bread and water as emblems of Christ’s body and blood. It’s the same pattern—physical symbols teaching us to turn to the Savior for healing and redemption, echoing all the way back to the Old Testament."
    },
    {
      "speaker": "David",
      "text": "I never saw that connection so clearly before. Now, let’s shift gears for a moment. I read something intriguing about the historical context of the Old Testament that might add another layer. What do we know about how these ancient people understood sacrifice in their day-to-day lives?"
    },
    {
      "speaker": "Sarah",
      "text": "That’s a great question. In ancient Near Eastern cultures, sacrifice wasn’t just a religious act—it was deeply tied to survival and covenant relationships. Archaeological findings, like altars and animal remains from that era, show that sacrifices were often public, communal events meant to secure favor from deity or seal agreements. For the Israelites, this context made their sacrifices to Jehovah not just ritual, but a profound act of trust and dependence on God."
    },
    {
      "speaker": "David",
      "text": "That really brings the ancient world to life for me. It’s like I can almost feel their desperation and hope in those moments. So, circling back to that original mystery of the hidden connection—how does knowing Christ is behind these symbols change how we read the Old Testament?"
    },
    {
      "speaker": "Sarah",
      "text": "Here’s where it gets powerful, David. Knowing that Jesus Christ is Jehovah—the God of the Old Testament, as President Dallin H. Oaks taught—means every interaction, every covenant, every symbol is Him reaching out to His people. When we read in John 8:58 where Jesus says, ‘Before Abraham was, I am,’ it’s a direct claim to being the same God who spoke to Moses in Exodus 3:14. It transforms the Old Testament into a personal witness of the Savior’s love and mission."
    },
    {
      "speaker": "David",
      "text": "That’s an ‘aha’ moment for me. I’m curious about one more connection before we wrap up. Are there other cross-references or restored truths that most people might miss that tie into this?"
    },
    {
      "speaker": "Sarah",
      "text": "Definitely. One that stands out is in the Book of Moses, a restoration through Joseph Smith. In Moses 6:63, the Lord teaches Adam that ‘all things are created and made to bear record of me.’ That’s a key to unlocking the Old Testament—everything, from the manna in Exodus 16 to Jonah’s three days in the whale as a type of resurrection in Jonah 1:17, is designed to point us to Christ if we look for it."
    },
    {
      "speaker": "David",
      "text": "That’s incredible. So, it’s like the Old Testament is a treasure map, and Christ is the treasure. How does this apply to us right now, in our daily lives?"
    },
    {
      "speaker": "Sarah",
      "text": "It’s a reminder to seek Him in everything we do. Just as the ancients looked for deliverance through these symbols, we can look for Christ in our challenges, in our covenants, and in the scriptures. Elder Dale G. Renlund said to ‘remember and always focus on Jesus Christ,’ and that focus can guide us through uncertainty just as it did for Abraham or Moses."
    },
    {
      "speaker": "David",
      "text": "I love that. So, as we start this journey through the Old Testament, let’s take that invitation to heart. Let’s look for Jesus Christ in every story, every symbol, and every covenant. Sarah, thanks for opening my eyes to these connections today."
    },
    {
      "speaker": "Sarah",
      "text": "My pleasure, David. I’m excited to keep uncovering these treasures together. Let’s keep looking for the Savior in every page."
    }
  ],
  "host": "David",
  "guest": "Sarah",
  "voices": {
    "Sarah": "aoede",
    "David": "enceladus"
  },
  "generated_timestamp": "2026-01-04 19:42:26",
  "source_week_file": "cfm_2026_week_01.json"
}