{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "duration_estimate": "~9.5 minutes",
  "word_count": 1419,
  "character_count": 8052,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on the edge of a vast, ancient landscape, the dust of centuries under your feet, as you hear the echoes of prophets like Abraham, Moses, and Isaiah calling out to God. Their voices, though distant in time, resonate with a longing for a Savior—a longing that threads through every page of the Old Testament. How does it feel to step into their world this year, to uncover the stories and symbols that point directly to Jesus Christ? Let’s embark on this journey together, not just to read history, but to find the living Christ in these ancient words and to understand our covenant relationship with God in a deeper way.\n\nAs we begin our study of the Old Testament, let’s anchor ourselves in a powerful truth: this sacred record, though ancient and sometimes unfamiliar, is a witness of Jesus Christ. The Come Follow Me manual reminds us that even in a culture that can seem foreign, we’ll find familiar experiences—family joys and struggles, moments of faith and doubt, and the persistent hope for a Redeemer. Think about that for a moment. The same Savior we worship today was the center of their hope thousands of years ago. Isn’t that incredible? The Old Testament isn’t just a collection of old stories; it’s a lamp to our feet, as the psalmist wrote in Psalm 119:105, “Thy word is a lamp unto my feet, and a light unto my path.” Let that image settle in your heart—a guiding light through the challenges and triumphs of life, just as it was for those ancient covenant people.\n\nLet’s dive into one of the central themes of our study this year: Jesus Christ is the treasure of the Old Testament. Elder Dale G. Renlund taught us to “remember and always focus on Jesus Christ” as we read these scriptures. So, how do we find Him here? The manual points us to symbols that bear record of the Savior. Consider the manna in Exodus 16:4, where the Lord tells Moses, “Behold, I will rain bread from heaven for you.” This miraculous bread sustained the children of Israel in the wilderness, just as Jesus declared in John 6:35, “I am the bread of life: he that cometh to me shall never hunger.” Can you see the connection? The manna wasn’t just food; it was a type of Christ, the spiritual sustenance we all need. Or think of the sacrificial lamb in Exodus 12:3-5, a lamb without blemish, offered for the Passover. John the Baptist saw this fulfilled when he proclaimed in John 1:29, “Behold the Lamb of God, which taketh away the sin of the world.” Pause to let that resonate. Christ’s atoning sacrifice was foreshadowed in every unblemished lamb offered on those ancient altars.\n\nThis pattern continues with the brass serpent in Numbers 21:4-10, where the Lord instructed Moses to raise a serpent of brass on a pole, promising that all who looked upon it would live. Jesus Himself explained this in John 3:14, saying, “And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.” What a vivid image—looking to Christ for healing, for life, just as the Israelites looked to that serpent. And then there’s Jonah, whose three days in the belly of the great fish, as recorded in Jonah 1:17, prefigured the Savior’s three days in the tomb, as Jesus taught in Matthew 12:40. Do you see how every story, every symbol, is woven with the thread of Christ’s mission? As the Lord told Adam in Moses 6:63, “All things have their likeness, and all things are created and made to bear record of me.” Take a quiet moment to ponder that. How might these symbols deepen your appreciation for the Savior as you read the Old Testament this year?\n\nBuilding on that vision, let’s explore another profound truth: Jesus Christ is Jehovah, the God of the Old Testament. President Dallin H. Oaks taught that when we read of “God” or the “Lord” speaking in these scriptures, it is almost always Jehovah, our risen Lord, Jesus Christ. This truth comes alive when we consider Jesus’ own words in John 8:58, “Before Abraham was, I am.” Those who heard Him were shocked, even ready to stone Him, because they understood He was claiming to be the great I AM, the God who spoke to Moses in Exodus 3:14, saying, “I AM THAT I AM.” Reflect on that for a second. The same Jehovah who led Israel out of Egypt, who gave the law on Sinai, is the Savior who walked the roads of Galilee. Why does this matter to you? How does knowing that Jesus is Jehovah change the way you read His words in the Old Testament?\n\nThis truth leads us to another layer of understanding—the restoration of “plain and precious things” through the Prophet Joseph Smith. In 1 Nephi 13:28-29, Nephi saw in vision that many plain and precious truths would be taken from the Bible over time. But the Lord promised to restore them, as we read in 1 Nephi 13:38-42, through “other books” that would come forth. Think about that promise as it unfolds in the Book of Mormon, the Book of Moses, the Book of Abraham, and the Joseph Smith Translation of the Bible. These restored records bring clarity to the Old Testament. For instance, in Moses 7:18-19, we learn of Enoch’s city of Zion, where the people were of one heart and one mind, and there was no poor among them. Or consider Abraham’s vision of the premortal council in Abraham 3:22-28, revealing the noble and great ones chosen before the world was. And through the Joseph Smith Translation in Genesis 14:25-40, we gain insight into Melchizedek’s priesthood and ministry. Aren’t these restored truths precious? They illuminate the Old Testament, helping us see God’s plan and Christ’s role with greater clarity. As 2 Nephi 3:12 teaches, the Bible and the Book of Mormon grow together to confound false doctrines and bring us to a knowledge of God’s covenants. How do these restored truths strengthen your faith in the Lord’s promises?\n\nNotice how this pattern continues in the theme of covenants, a cornerstone of the Old Testament. In Exodus 19:5, the Lord declares, “If ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people.” This covenant relationship is the story of God drawing us close, offering a special kind of love and mercy, as President Russell M. Nelson taught in his message “The Everlasting Covenant.” Think about the covenants you’ve made—baptism, the sacrament, or temple covenants. How do they connect you to the same God who covenanted with Abraham, Isaac, and Jacob? As you read the Old Testament this year, look for what the Lord wants to teach you about your covenant bond with Him. Jeremiah 31:33 promises, “I will put my law in their inward parts, and write it in their hearts; and will be their God, and they shall be my people.” Let that truth settle in your heart. What does it mean to be His people, His peculiar treasure?\n\nAs we close, let’s reflect on the journey ahead. The Old Testament is more than ancient history; it’s a living witness of Jesus Christ, Jehovah, who guides us through covenants and restored truths. Every symbol, from the manna to the brass serpent, every story of faith and redemption, points to Him. And through the Prophet Joseph Smith, we’ve been given plain and precious insights to see these truths more clearly. So, as you step into this sacred text, carry with you the psalmist’s love for God’s word as a light and a lamp. I invite you to ponder how the symbols of Christ in the Old Testament can deepen your relationship with Him—maybe take a moment to journal about one symbol, like the sacrificial lamb, and what it teaches you about His Atonement. For families, consider sitting down together to look at a picture of Isaiah foretelling Christ’s birth, as suggested in the manual, and read Isaiah 9:6, discussing how Jesus is the “Wonderful, Counsellor, The mighty God.” And individually, ask yourself as you read, “How is Jehovah speaking to me today through these ancient words?” Let these invitations guide you as we embark on this year of discovery, finding the Savior in every page and drawing closer to Him through our covenants.",
  "generated_timestamp": "2026-01-01 00:00:26",
  "source_week_file": "cfm_2026_week_01.json"
}