{
  "week_number": 6,
  "title": "Week 6: February 2–8 - Moses 7",
  "date_range": "February 2–8",
  "study_level": "scholarly",
  "duration_estimate": "~12.6 minutes",
  "word_count": 1891,
  "character_count": 10381,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, gazing across a world drowning in wickedness, yet in the midst of that darkness, you see a city glowing with righteousness—a place where contention has no foothold, where every heart beats as one, and where the very presence of God dwells. This is the vision of Zion, the city of Enoch, revealed in Moses 7, and it’s a vision that beckons to us even now. What would it be like to live in such a place? And more importantly, how can we build that kind of unity and holiness in our own hearts, homes, and communities today? Let’s journey into this sacred chapter from the Pearl of Great Price and uncover the divine blueprint for Zion, a blueprint that is as relevant for us as it was for Enoch thousands of years ago.\n\nLet’s begin by stepping into the world of Enoch as described in Moses 7. Here we find a prophet who walked with God, a man who saw visions that spanned the breadth of human history. In this chapter, we’re given a glimpse of something extraordinary—a people who transcended the chaos of their time. Moses 7:18 tells us, “And the Lord called his people Zion, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them.” Pause to let that resonate. One heart. One mind. No poor among them. This wasn’t just a city; it was a condition of the soul, a collective covenant to live as God lives. How did they achieve this? What does it mean to be of one heart and one mind in a world that often feels fragmented by division and self-interest? As we ponder these questions, we see that Zion isn’t merely a destination on a map—it’s a way of being, a reflection of the pure in heart, as the Lord later taught in Doctrine and Covenants 97:21, “Let Zion rejoice, for this is Zion—the pure in heart.”\n\nThis truth leads us to consider how Enoch’s people stood apart from the world around them. Moses 7:16-17 describes how the Lord blessed them with His presence, saying, “And from that time forth there were wars and bloodshed among them; but the Lord came and dwelt with his people, and they dwelt in righteousness. The fear of the Lord was upon all nations, so great was the glory of the Lord, which was upon his people.” Despite the violence and corruption surrounding them, Zion became a beacon of peace and divine glory. It’s a powerful reminder that God’s presence can transform any circumstance. But notice the condition—they dwelt in righteousness. Their unity and purity of heart invited the Lord to dwell among them. So let’s ask ourselves: How can we cultivate that same righteousness in our lives? What steps can we take to make our homes and wards places where the Lord’s glory can rest?\n\nBuilding on that vision, let’s explore another layer of Zion’s identity through the lens of Jesus Christ, who is central to this sacred concept. In Moses 7:53, the Lord declares, “And the Lord said unto Enoch: Then shalt thou and all thy city meet me there, and we will receive them into our bosom, and they shall see us; and we will fall upon their necks, and they shall fall upon ours, and we will kiss each other.” Here, Christ is revealed as “the King of Zion,” a title that underscores His role as the source and center of all true unity and righteousness. What does it mean to have Jesus Christ as our King? How does submitting to His reign shape the way we interact with others? This verse also speaks of coming “in at the gate and [climbing] up by [Him].” It’s a beautiful image of progression, of aligning our lives with His teachings and His Atonement, so that we, like Enoch’s people, might one day be received into His embrace.\n\nThis connection to Christ deepens as we witness a profoundly moving moment in Enoch’s vision. In Moses 7:28-31, we see something astonishing—God Himself weeps. The scripture reads, “And it came to pass that the God of heaven looked upon the residue of the people, and he wept; and Enoch bore record of it, saying: How is it that the heavens weep, and shed forth their tears as the rain upon the mountains? And Enoch said unto the Lord: How is it that thou canst weep, seeing thou art holy, and from all eternity to all eternity?” Enoch is stunned. Why would a perfect, all-powerful God shed tears? The answer comes in verse 32-33, where the Lord explains, “The Lord said unto Enoch: Behold these thy brethren; they are the workmanship of mine own hands, and I gave unto them their knowledge, in the day I created them; and in the Garden of Eden, gave I unto man his agency; And unto thy brethren have I said, and also given commandment, that they should love one another, and that they should choose me, their Father; but behold, they are without affection, and they hate their own blood.” God weeps because His children reject Him and one another. Take a quiet moment to let that truth settle in your heart. This isn’t a distant, unfeeling deity; this is a Father who feels deeply for His children, who mourns when we turn away from love and righteousness.\n\nBut the vision doesn’t end in sorrow. As we move through Moses 7:41-69, we see that Enoch also weeps, sharing in God’s grief for the wickedness of the world. Yet, God offers hope—a promise of redemption and rejoicing. In verse 44, the Lord tells Enoch, “Lift up your heart, and be glad; and look.” And as Enoch looks, he sees the coming of the Son of Man, the Atonement, and the ultimate triumph of righteousness. This brings us to a stunning prophecy of the Second Coming in Moses 7:59-67. Enoch asks, “When shall the day of the Lord come?” And the Lord responds in verse 60, “As I live, even so will I come in the last days, in the days of wickedness and vengeance, to fulfil the oath which I have made unto you concerning the children of Noah.” The Savior will return, and as verse 62 declares, “Righteousness will I send down out of heaven; and truth will I send forth out of the earth, to bear testimony of mine Only Begotten; his resurrection from the dead; yea, and also the resurrection of all men; and righteousness and truth will I cause to sweep the earth as with a flood, to gather out mine elect from the four quarters of the earth, unto a place which I shall prepare, an Holy City, that my people may gird up their loins, and be looking forth for the time of my coming; for there shall be my tabernacle, and it shall be called Zion, a New Jerusalem.” What a powerful image—righteousness and truth sweeping the earth as a flood, gathering the elect to Zion. How do you see this prophecy being fulfilled today? What role do we play in preparing for that holy city, that New Jerusalem?\n\nNotice how this pattern continues in the way Zion is described as both a present reality and a future promise. In Moses 7:68-69, we read, “And all the days of Zion, in the days of Enoch, were three hundred and sixty-five years. And Enoch and all his people walked with God, and he dwelt in the midst of Zion; and it came to pass that Zion was not, for God received it up into his own bosom; and from thence went forth the saying, Zion is Fled.” Zion was taken up, translated into God’s presence, a type and shadow of what awaits the faithful in the latter days. This historical event points us forward to a spiritual reality. We, too, are called to build Zion now, in our hearts and communities, as we prepare for the Savior’s return. Cross-referencing this with 4 Nephi 1:15-16, we see a similar pattern after Christ’s ministry among the Nephites: “And it came to pass that there was no contention in the land, because of the love of God which did dwell in the hearts of the people. And there were no envyings, nor strifes, nor tumults, nor whoredoms, nor lyings, nor murders, nor any manner of lasciviousness; and surely there could not be a happier people among all the people who had been created by the hand of God.” Unity, love, and righteousness—these are the hallmarks of Zion, whether in Enoch’s day, among the Nephites, or in our own time.\n\nSo how do we apply this in our lives? Let’s turn to Philippians 2:1-2 for additional insight, where Paul pleads, “If there be therefore any consolation in Christ, if any comfort of love, if any fellowship of the Spirit, if any bowels and mercies, Fulfil ye my joy, that ye be likeminded, having the same love, being of one accord, of one mind.” Being of one accord starts with small, deliberate choices—choosing to love, to serve, to forgive. Think of a time when you felt that unity with others, perhaps in your family, ward, or a group of friends. What created that bond? Was it shared sacrifice, common goals, or simply a commitment to love as Christ loves? Reflect on that for a second. Now consider how you might foster that same spirit in your current relationships. Zion begins with us, in the quiet corners of our daily interactions.\n\nThis brings us full circle to the invitation inherent in Moses 7—to build Zion by becoming the pure in heart. Let’s reflect on what we’ve explored today. We’ve seen Zion as a city of holiness, a people united in righteousness, centered on Jesus Christ, the King of Zion. We’ve felt the depth of God’s love as He weeps for His children, and we’ve glimpsed the hope of the Second Coming, when righteousness will sweep the earth and gather the elect to a New Jerusalem. These truths aren’t just ancient history; they are a call to action for you and me. So I invite you to ponder a few things. First, take time this week to study Moses 7:18-21 and ask yourself, “What can I do to be of one heart and one mind with those around me?” Write down any impressions that come. Second, consider how you can prepare your heart for the Savior’s return—perhaps by deepening your personal scripture study or seeking a closer connection through prayer. Third, discuss with your family or a trusted friend what Zion means to you and how you can build it together. And finally, if possible, spend a quiet moment in the temple, reflecting on how the covenants you make there draw you closer to the King of Zion.\n\nAs you carry these invitations into your week, remember that Zion starts within. It’s in the way you choose to love, to lift, and to walk with God, just as Enoch did. May we each take a step closer to that holy city, not just in a distant future, but in the sacred now. Until we meet again, let’s keep seeking the pure in heart, for that is Zion.",
  "generated_timestamp": "2025-12-26 20:18:49",
  "source_week_file": "cfm_2026_week_06.json"
}