{
  "week_number": 6,
  "title": "Week 6: February 2–8 - Moses 7",
  "date_range": "February 2–8",
  "study_level": "connected",
  "duration_estimate": "~10.1 minutes",
  "word_count": 1520,
  "character_count": 8345,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, gazing across a vast landscape, and witnessing a city so pure, so united, that it seems to glow with the very light of heaven. This is the vision Enoch beheld—a city called Zion, a place where the people were of “one heart and one mind” and dwelt in righteousness, as we read in Moses 7:18. What would it feel like to live in such a place, where contention vanishes, where poverty and violence are unknown, and where the presence of God is felt in every heart? Today, as we dive into Moses 7, we’re going to explore this breathtaking vision of Zion, uncover how Enoch and his people achieved such unity, and ask ourselves: How can we build Zion in our own lives, starting right where we are?\n\nLet’s begin by stepping into Enoch’s world. In Moses 7, we find Enoch, a prophet who walked with God, receiving a sweeping vision of humanity’s past, present, and future. But what strikes me most in this chapter is the profound glimpse into the heart of God Himself. As Enoch looks upon the earth, he sees wickedness and destruction, and then, in a moment that stops him in his tracks, he beholds God weeping. In Moses 7:28-29, we read, “And it came to pass that the God of heaven looked upon the residue of the people, and he wept; and Enoch bore record of it, saying: How is it that the heavens weep, and shed forth their tears as the rain upon the mountains?” Enoch is astonished. Why would the Almighty, the Creator of all things, shed tears over His children? This moment reveals a truth so tender: God feels deeply for us. He isn’t distant or unmoved; He grieves over our pain and our choices when they lead us away from Him. Pause to let that resonate. Have you ever considered how much your joys and struggles matter to your Heavenly Father?\n\nAs we move through this vision, we see Enoch’s heart break as well. In Moses 7:41, it says, “And it came to pass that the Lord spake unto Enoch, and told Enoch all the doings of the children of men; wherefore Enoch knew, and looked upon their wickedness, and their misery, and wept and stretched forth his arms, and his heart swelled wide as eternity; and his bowels yearned; and all eternity shook.” Enoch’s compassion mirrors God’s. But amid this sorrow, the Lord offers hope—a vision of redemption and a future where righteousness will triumph. This brings us to the heart of Zion. In Moses 7:18, we learn that “the Lord called his people Zion, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them.” Notice those elements: unity, righteousness, and care for each other. Zion isn’t just a physical city; it’s a condition of the spirit, a way of living where we align our hearts with God and with one another.\n\nSo how did Enoch’s people achieve this? Let’s look closer. In Moses 7:16-17, we see that “the Lord came and dwelt with his people, and they dwelt in righteousness. The fear of the Lord was upon all nations, so great was the glory of the Lord, which was upon his people.” Their unity and righteousness invited God’s presence, and His presence transformed them. This truth leads us to a powerful question: How can we invite that same divine presence into our lives, our homes, and our communities? It starts with the choices we make, as the Lord teaches in Moses 7:32-33, saying, “Behold these thy brethren; they are the workmanship of mine own hands, and I gave unto them their knowledge, in the day I created them; and in the Garden of Eden, gave I unto man his agency; And unto thy brethren have I said, and also given commandment, that they should love one another, and that they should choose me, their Father.” Choosing God, loving one another—these are the building blocks of Zion. Reflect on that for a second. Are there choices you’re making that draw you closer to God and to those around you?\n\nBuilding on that vision, let’s connect this to other scriptures that deepen our understanding of Zion. In Doctrine and Covenants 97:21, the Lord declares, “Therefore, verily, thus saith the Lord, let Zion rejoice, for this is Zion—the pure in heart.” Zion is purity of heart—a heart free from envy, pride, or selfishness. And in 4 Nephi 1:15-16, we see this lived out after the Savior’s visit to the Nephites: “And it came to pass that there was no contention in the land, because of the love of God which did dwell in the hearts of the people. And there were no envies, nor strifes, nor tumults, nor whoredoms, nor lyings, nor murders, nor any manner of lasciviousness; and surely there could not be a happier people among all the people who had been created by the hand of God.” Don’t you see the pattern? When God’s love fills our hearts, contention fades, and we become a Zion people. This echoes what Elder Ulisses Soares taught in the November 2023 Liahona, saying that true unity comes when we see each other as brothers and sisters in Christ, bound by covenant love. What would change in your life if you saw every person through that lens?\n\nNow, let’s turn to the glorious promise woven through Enoch’s vision—the Second Coming of Jesus Christ, the “King of Zion,” as named in Moses 7:53. In this verse, the Lord is also called “the Messiah,” “the Son of Man,” and the one by whom we “climb up” to salvation. What does it mean to you to have Christ as your King, guiding you upward? Later, in Moses 7:62, we read a prophecy of the last days: “And righteousness will I send down out of heaven; and truth will I send forth out of the earth, to bear testimony of mine Only Begotten; his resurrection from the dead; yea, and also the resurrection of all men; and righteousness and truth will I cause to sweep the earth as with a flood, to gather out mine elect from the four quarters of the earth, unto a place which I shall prepare, an Holy City, that my people may gird up their loins, and be looking forth for the time of my coming; for there shall be my tabernacle, and it shall be called Zion, a New Jerusalem.” This imagery of righteousness and truth sweeping the earth like a flood stirs the soul. Can you feel how this is unfolding today through the gathering of Israel, the spread of the gospel, and the building of temples? Take a quiet moment. How does this vision of Zion as a New Jerusalem inspire you to prepare for the Savior’s return?\n\nNotice how this pattern continues in Moses 7:63-64, where the Lord promises that the saints of the last days will meet Enoch’s city, and together they will “fall upon their necks, and they shall kiss each other; And there shall be mine abode, and it shall be Zion, which shall come forth out of all the creations which I have made.” This reunion, this ultimate Zion, is what we’re striving for—a place where heaven and earth unite in the presence of God. As President Henry B. Eyring taught in the November 2020 Liahona, we are called to be sisters and brothers in Zion, preparing together for that day. How are you contributing to that preparation?\n\nAs we close, let’s reflect on what Enoch’s vision means for us right now. Zion begins in our hearts, in the way we choose God, love others, and seek unity. It’s in the small acts—reaching out to a struggling neighbor, forgiving a family member, or serving in our wards with a willing spirit. God weeps for us when we stray, but He also rejoices when we turn to Him, as we see throughout Moses 7:41-69. Let that truth settle in your heart. You are part of His plan to build Zion, today and in the glorious future when Christ returns.\n\nI invite you to take a few specific steps to apply what we’ve explored. First, ponder individually: What is one choice you can make this week to align your heart more fully with God, perhaps through prayer or repentance? Second, as a family, discuss what it means to be “of one heart and one mind” and choose a way to serve someone together, showing the love of Christ. Finally, in your journal, write down what Zion means to you after studying Moses 7, and record any impressions about how you can help build it in your life. As you act on these invitations, may you feel the Spirit guiding you closer to the King of Zion, Jesus Christ, and may your heart become a little piece of that holy city we all long for. Until we meet again, keep seeking the Lord and building Zion, one step at a time.",
  "generated_timestamp": "2025-12-26 20:17:54",
  "source_week_file": "cfm_2026_week_06.json"
}