{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "study_level": "connected",
  "duration_estimate": "~8.7 minutes",
  "word_count": 1303,
  "character_count": 7425,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on the edge of a vast, empty void—darkness all around, no form, no life, just an endless expanse of nothing. Then, out of that chaos, a voice speaks, a divine command pierces the silence: “Let there be light” (Genesis 1:3). And suddenly, there is light. Can you feel the awe of that moment? The power of a Creator who transforms emptiness into beauty, disorder into purpose? This is where our journey begins today, in the sacred accounts of the Creation found in Genesis 1 and 2, Moses 2 and 3, and Abraham 4 and 5. These chapters aren’t just about the making of the earth—they’re about understanding who God is, who we are, and the divine potential woven into every part of His work.\n\nLet’s start by stepping into the rhythm of Creation itself. In Genesis 1:1-25, Moses 2:1-25, and Abraham 4:1-25, we see a deliberate, step-by-step process. Day by day, God organizes chaos into order. Light appears, then the heavens, the seas, the dry land, plants, animals—each element finds its place under His guiding hand. But notice something remarkable in Abraham 4:1: it says, “And then the Lord said: Let us go down. And they went down at the beginning, and they, that is the Gods, organized and formed the heavens and the earth.” Did you catch that? “Let us go down.” This isn’t a solitary act—there’s a divine council, a collaboration. It points us to the truth that Heavenly Father and Jesus Christ, together with others, were involved in this sacred work. What does that teach you about the nature of God? About the way He works with unity and purpose? As you ponder these verses, consider what they reveal about His patience, His power to bring beauty from barrenness. Maybe take a moment outside, surrounded by His creations, and let the vastness of the sky or the intricacy of a leaf speak to your soul.\n\nThis truth leads us to a profound realization about ourselves. In Genesis 1:26-27, we read, “And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. So God created man in his own image, in the image of God created he him; male and female created he them.” This is echoed in Moses 2:26-27 and Abraham 4:26-27. Pause to let that resonate. You are created in the image of God—male and female, bearing His likeness. What does that mean for how you see yourself? How does it shape the way you view others? This isn’t just about physical appearance; it’s about divine potential, about carrying within you the capacity to become like Him. When the world whispers doubts about your worth, or when you struggle with negative feelings about yourself, remember this truth. Cross-reference it with Mosiah 3:19, which teaches that the natural man is an enemy to God, but through Christ, we can put off that natural state and become saints. Or look to Ether 12:27, where the Lord promises that if we come unto Him, He will show us our weakness and make weak things strong. Being in God’s image doesn’t mean we’re perfect yet—it means we’re on a journey of transformation, with His help.\n\nBuilding on that vision of our divine identity, let’s turn to another sacred aspect of Creation: the relationship between man and woman. In Genesis 2:18, the Lord declares, “It is not good that the man should be alone; I will make him an help meet for him.” Then, in verses 21-24, we see the creation of Eve, and Adam’s recognition of her as “bone of my bones, and flesh of my flesh.” Moses 3:18 and 21-24, as well as Abraham 5:14-18, mirror this account. Marriage, as instituted by God, is no afterthought—it’s a divine ordinance, a partnership ordained for eternity. As President Russell M. Nelson taught, Adam and Eve were joined together for time and all eternity by the power of the everlasting priesthood. Consider how 1 Corinthians 11:11 reinforces this: “Nevertheless neither is the man without the woman, neither the woman without the man, in the Lord.” How does this perspective elevate the way you view marriage, whether you’re married now or preparing for that covenant? It’s a sacred union, reflecting God’s design for unity and mutual support.\n\nNotice how this pattern continues in the responsibilities God entrusts to us. In Genesis 1:28, Moses 2:28, and Abraham 4:28, God commands Adam and Eve to “be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.” This isn’t just about having children—it’s a call to stewardship. Look at Doctrine and Covenants 59:16-21, where the Lord teaches that the earth and its fullness are given for our use, but we must not waste or destroy. Or consider Doctrine and Covenants 104:13-18, which reminds us that we are stewards over earthly things and must be accountable. What does this stewardship mean to you? How can caring for the earth—whether through conservation, gratitude, or mindful use—reflect your reverence for the Creator?\n\nLet’s shift now to another gift woven into the Creation story: the Sabbath day. In Genesis 2:2-3, we read, “And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made. And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made.” This is mirrored in Moses 3:2-3 and Abraham 5:2-3. God didn’t rest because He was tired—He rested to set apart a holy day, a time for us to pause, reflect, and reconnect with Him. Doctrine and Covenants 59:9-13 adds depth, urging us to keep the Sabbath holy by offering our oblations and resting from our labors. Think about that for a moment. What makes the Sabbath “blessed” in your life? How does stepping away from the chaos of the week to focus on worship and family mirror the very order God brought to Creation?\n\nAs we tie these threads together, let’s reflect on the broader picture. The Creation isn’t just a historical event—it’s a revelation of God’s nature and our purpose. He transforms chaos into order, emptiness into life, just as He can transform our struggles into strength. We are made in His image, called to sacred relationships, entrusted with stewardship, and invited to rest in His holiness on the Sabbath. These accounts in Genesis, Moses, and Abraham aren’t merely stories; they’re invitations to see ourselves and our world through divine eyes.\n\nSo, I invite you to carry these truths into your week. First, take a quiet moment—maybe during a walk or while gazing at the stars—to ponder what it means to be created in God’s image. How can you honor that truth in the way you treat yourself and others? Second, as a family or with friends, discuss how you can better care for God’s creations. Perhaps plan a small act of stewardship, like cleaning up a local park or reducing waste. And third, journal about your Sabbath experiences. What can you do to make the seventh day more holy, more set apart? Let that truth settle in your heart as you seek to align your life with the divine order of Creation.\n\nThank you for joining me in this sacred exploration. May these scriptures continue to light your path as we strive to become more like our Creator.",
  "generated_timestamp": "2025-12-26 20:11:24",
  "source_week_file": "cfm_2026_week_03.json"
}