{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~5.0 minutes",
  "word_count": 757,
  "character_count": 4259,
  "segment_count": 21,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’m so excited to kick off this year with an introduction to the Old Testament. How do you feel about diving into these ancient scriptures with our listeners?"
    },
    {
      "speaker": "David",
      "text": "I’m thrilled, Sarah. The Old Testament can seem intimidating at first because it’s so ancient and the culture feels foreign. But it’s also incredibly rich with stories and truths that point us to Jesus Christ. I can’t wait to explore it together!"
    },
    {
      "speaker": "Sarah",
      "text": "I love that perspective. For someone who might feel a bit uncertain about starting this study, what’s one thing you’d say to help them feel more at ease?"
    },
    {
      "speaker": "David",
      "text": "I’d remind them that the Old Testament isn’t just history—it’s a witness of Jesus Christ. Even though the people and customs are different, their experiences of faith, struggle, and hope are so relatable. Just look for the Savior in the stories, and it starts to feel more familiar."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautiful. Speaking of looking for the Savior, the Come Follow Me manual points out specific symbols like the manna in Exodus 16 or the sacrificial lamb in Exodus 12. How do these point to Christ?"
    },
    {
      "speaker": "David",
      "text": "Oh, these are powerful examples. Take the manna from Exodus 16:4, where God provides bread from heaven for the Israelites. Jesus Himself says in John 6:35, 'I am the bread of life: he that cometh to me shall never hunger.' It’s a direct connection—He sustains us spiritually just as manna sustained them physically."
    },
    {
      "speaker": "Sarah",
      "text": "That’s such a clear link! What about the sacrificial lamb?"
    },
    {
      "speaker": "David",
      "text": "The sacrificial lamb from Exodus 12:3-5 represents Christ as the ultimate sacrifice. John 1:29 calls Him 'the Lamb of God, which taketh away the sin of the world.' The lamb’s blood protected the Israelites from death during the Passover, just as Christ’s Atonement saves us from spiritual death."
    },
    {
      "speaker": "Sarah",
      "text": "I love that imagery. It makes me want to keep my eyes open for more of these symbols as we read. Now, another big idea from the manual is that Jesus Christ is Jehovah in the Old Testament. Can you explain why that’s significant?"
    },
    {
      "speaker": "David",
      "text": "Absolutely, Sarah. President Dallin H. Oaks taught that when we read 'God' or 'Lord' in the Old Testament, it’s almost always referring to Jehovah, who is Jesus Christ before His mortal life. Knowing this helps us see that Christ was actively guiding His people long before He was born. It’s a reminder of His eternal role as our Savior."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so powerful. It adds a whole new layer to reading these stories. How can this understanding help us in our daily lives?"
    },
    {
      "speaker": "David",
      "text": "It shows us that Christ is always near, just as He was for the ancient prophets. When we face challenges, we can trust that the same Jehovah who led Moses or spoke to Isaiah is with us today. It builds confidence in His constant care for us."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly! I also think it ties into another theme from the manual—our covenant relationship with God. How does the Old Testament help us understand that better?"
    },
    {
      "speaker": "David",
      "text": "The Old Testament is really the story of God making covenants with His people, calling them His 'peculiar treasure' in Exodus 19:5. These covenants, like the ones with Abraham, show God’s desire to bless us and be close to us. It helps us see our own covenants, like baptism, as part of that same eternal promise."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a wonderful connection. It makes me think about how keeping covenants brings that special love and mercy into our lives today. Do you have an example of how this can feel relevant now?"
    },
    {
      "speaker": "David",
      "text": "Sure, think about the peace that comes from attending the temple or renewing covenants during the sacrament. Just as God guided the Israelites through their covenant journey, He guides us through ours. It’s a reminder that we’re never alone in our struggles or joys."
    },
    {
      "speaker": "Sarah",
      "text": "I love that. As we wrap up, David, what’s one thought you’d like to leave with our listeners as they start studying the Old Testament this year?"
    },
    {
      "speaker": "David",
      "text": "I’d encourage everyone to approach the Old Testament with an open heart, looking for Jesus Christ in every story and symbol. Let it be a lamp to your feet, as Psalm 119:105 says, 'Thy word is a lamp unto my feet, and a light unto my path.' It will guide you closer to Him."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a perfect invitation. Thank you, David, for sharing your insights. Let’s all take that challenge to look for the Savior as we study. We’ll see you next time!"
    }
  ],
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-01 01:06:39",
  "source_week_file": "cfm_2026_week_01.json"
}