{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "duration_estimate": "~7.3 minutes",
  "word_count": 1097,
  "character_count": 6737,
  "segment_count": 50,
  "script": [
    {
      "speaker": "David",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "And I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "Sarah, I have to start with a question that's puzzled scholars and everyday readers for centuries. In John 8:58, Jesus declares three simple words: 'Before Abraham was, I am.' And immediately, the Jews pick up stones to kill Him. Why such a shocking, violent reaction?"
    },
    {
      "speaker": "Sarah",
      "text": "David, that's the perfect mystery to crack open the entire Old Testament. Those words weren't just a claim about being old—they were Jesus directly identifying Himself with the divine name revealed to Moses at the burning bush. Let's go back to Exodus 3:13-15 to see why it hit them like blasphemy."
    },
    {
      "speaker": "David",
      "text": "Wait, what? A burning bush from 1,400 years earlier? Lay it out for me."
    },
    {
      "speaker": "Sarah",
      "text": "In Exodus 3:13-15, Moses asks God, 'What is thy name?' And God answers, 'I AM THAT I AM... Thus shalt thou say unto the children of Israel, I AM hath sent me unto you.' That's the Hebrew name Jehovah, YHWH, the sacred name of God Himself. When Jesus said 'I am,' He was claiming to be Jehovah."
    },
    {
      "speaker": "David",
      "text": "That's fascinating. So ancient Israel saw Jehovah as their God, the one who delivered them from Egypt."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly. And notice this pattern: President Dallin H. Oaks taught that 'the scriptural records of words spoken by “God” or the “Lord” are almost always the words of Jehovah, our risen Lord, Jesus Christ.' From ancient Israel's perspective, Jehovah was their covenant God walking among them."
    },
    {
      "speaker": "David",
      "text": "Hold on—that changes everything. But how does Christ Himself view this? Does He confirm it?"
    },
    {
      "speaker": "Sarah",
      "text": "He does, repeatedly. Think about it from Christ's viewpoint: In the New Testament, He speaks as the same Jehovah. And in our modern restoration view, through Joseph Smith, we learn even more plainly that Jesus Christ is Jehovah."
    },
    {
      "speaker": "David",
      "text": "I need to understand this multi-perspective shift. Walk me through ancient Israel first."
    },
    {
      "speaker": "Sarah",
      "text": "Ancient Israel knew Jehovah as the God of the covenant, appearing to Abraham, Moses, and prophets. Exodus 6:3 says, 'I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them.' That's key—Jehovah was His name to Moses' people."
    },
    {
      "speaker": "David",
      "text": "Remarkable. Now, from Christ's side?"
    },
    {
      "speaker": "Sarah",
      "text": "Christ steps into that identity boldly. John 8:58 isn't isolated—it's Him saying He's the eternal I AM, preexistent before Abraham. The Jews knew exactly what He meant, hence the stones."
    },
    {
      "speaker": "David",
      "text": "And modern Saints? How does restoration clarify it?"
    },
    {
      "speaker": "Sarah",
      "text": "Through the Prophet Joseph Smith, the Lord restores plain truths. Like in the Book of Moses and Joseph Smith Translation, confirming Jehovah is Christ. It's like three lenses sharpening the same truth."
    },
    {
      "speaker": "David",
      "text": "That's powerful scaffolding. Now, let's trace this Jehovah theme across dispensations—starting with Adam?"
    },
    {
      "speaker": "Sarah",
      "text": "Perfect. Notice this pattern across dispensations: The Lord taught Adam in Moses 6:63, 'All things have their likeness, and all things are created and made to bear record of me.' Even from the beginning, creation testifies of Jehovah, who is Christ."
    },
    {
      "speaker": "David",
      "text": "Across to Abraham and Moses we see it. What about prophets like Isaiah?"
    },
    {
      "speaker": "Sarah",
      "text": "Isaiah foreshadows Christ as Jehovah perfectly. Isaiah 7:14 and 9:6 describe the coming Immanuel, Wonderful Counselor—echoing Jehovah's covenant promises."
    },
    {
      "speaker": "David",
      "text": "Building excitement here. And in Christ's dispensation?"
    },
    {
      "speaker": "Sarah",
      "text": "Christ fulfills it. He says in John 8:58, claiming the name. Then in our dispensation, modern prophets like President Oaks echo it: Jesus Christ is Jehovah speaking in the Old Testament."
    },
    {
      "speaker": "David",
      "text": "I never saw that pattern web so clearly across four dispensations. Here's where it gets even deeper—historical context."
    },
    {
      "speaker": "Sarah",
      "text": "What most people don't know is the cultural weight of YHWH in ancient Israel. Archaeologists find it inscribed on artifacts from Moses' time, like the Moabite Stone, showing it was THE sacred, unpronounceable name of God. No one dared claim it lightly."
    },
    {
      "speaker": "David",
      "text": "Wait, what? Real artifacts proving the name's antiquity?"
    },
    {
      "speaker": "Sarah",
      "text": "Yes—Mesha Stele mentions YHWH as Israel's God around 840 BC. And in temple practices, priests whispered it once a year. Jesus uttering 'I am' in public was explosive, like storming the Holy of Holies."
    },
    {
      "speaker": "David",
      "text": "That makes ancient events feel so immediate and real. Now, resolving our opening mystery fully?"
    },
    {
      "speaker": "Sarah",
      "text": "Here's what shifts everything: The Jews tried to stone Him because He equated Himself with Jehovah, the eternal God of Exodus. John 8:59 confirms they understood—'for blasphemy.' But He was right; He is Jehovah."
    },
    {
      "speaker": "David",
      "text": "That's the satisfying reveal. Mind blown. Now, hidden connections—symbols testifying of this Jehovah-Christ?"
    },
    {
      "speaker": "Sarah",
      "text": "Absolutely. Look for the Bread of Life: Manna in Exodus 16:4, 11-15 foreshadows Jesus as the true Bread in John 6:35. Both sustain life eternally."
    },
    {
      "speaker": "David",
      "text": "Notice that parallel. What's next?"
    },
    {
      "speaker": "Sarah",
      "text": "The sacrificial lamb: Exodus 12:3-5, spotless for Passover, points to John 1:29, 'Behold the Lamb of God.' Jehovah provides the lamb—Himself."
    },
    {
      "speaker": "David",
      "text": "That's remarkable! Keep going."
    },
    {
      "speaker": "Sarah",
      "text": "Brass serpent in Numbers 21:4-10—lifted up to heal those who look. Jesus says in John 3:14, it's like the Son of man lifted on the cross. Look and live."
    },
    {
      "speaker": "David",
      "text": "Another cross-reference most miss. And Jonah?"
    },
    {
      "speaker": "Sarah",
      "text": "Jonah 1:4-17, three days in the fish, mirrors Jesus' resurrection as in Matthew 12:38-41. These types bear record of Him, as Moses 6:63 promises."
    },
    {
      "speaker": "David",
      "text": "Profound web. How does this tie to the Plan of Salvation?"
    },
    {
      "speaker": "Sarah",
      "text": "These symbols connect to the eternal plan: From premortal council in Abraham 3:22-28, restored by Joseph Smith, Jehovah creates and redeems under the Father's plan. Lamb, bread, serpent—all point to Atonement covenants."
    },
    {
      "speaker": "David",
      "text": "Exactly! Prophetic echoes today?"
    },
    {
      "speaker": "Sarah",
      "text": "President Russell M. Nelson teaches in 'The Everlasting Covenant' how God seeks to make us His 'peculiar treasure' by covenant, like Exodus 19:5. Modern prophets mirror ancient Jehovah's promises."
    },
    {
      "speaker": "David",
      "text": "So ancient and modern feel immediately connected. How do we apply this introduction to our Old Testament study?"
    },
    {
      "speaker": "Sarah",
      "text": "Focus on covenants—your relationship with God. As you read, watch for Jehovah-Christ in symbols and stories. Ask: Why are covenants important to me?"
    },
    {
      "speaker": "David",
      "text": "And those plain and precious things restored?"
    },
    {
      "speaker": "Sarah",
      "text": "Nephi foresaw them in 1 Nephi 13:21-29, 38-42—restored through Book of Moses like Enoch’s Zion in Moses 7:18-19, Abraham’s council. They make Bible and Book of Mormon work together per 2 Nephi 3:12."
    },
    {
      "speaker": "David",
      "text": "That's transformative for this year. One more: Elder Dale G. Renlund says to 'remember and always focus on Jesus Christ' like a treasure."
    },
    {
      "speaker": "Sarah",
      "text": "Yes—seek Him as the treasure in every page. Notice patterns like Psalm 119:105, 'Thy word is a lamp unto my feet.'"
    },
    {
      "speaker": "David",
      "text": "Sarah, this mystery unlocked so much. Listeners, as you start the Old Testament, hunt for Jehovah-Christ in symbols, covenants, and restored truths."
    },
    {
      "speaker": "Sarah",
      "text": "Dive in with eyes open to these connections. You'll see God moving in ancient lives just as in yours—building faith toward the Savior."
    },
    {
      "speaker": "David",
      "text": "Thanks, Sarah. Until next time, keep studying."
    },
    {
      "speaker": "Sarah",
      "text": "Happy studying!"
    }
  ],
  "host": "David",
  "guest": "Sarah",
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-10 22:29:11",
  "source_week_file": "cfm_2026_week_01.json"
}