{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "connected",
  "duration_estimate": "~10.3 minutes",
  "word_count": 1546,
  "character_count": 8685,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, the wind whispering around you, as you’re suddenly caught up in a vision so vast it takes your breath away. You see the very glory of God, and His voice pierces your soul with a truth so powerful it changes everything: “Thou art my son.” That’s the moment Moses experienced in Moses 1, a revelation that didn’t just define who he was, but who we all are. Today, we’re diving into Moses 1 and Abraham 3, exploring the profound truths of our divine identity, our premortal existence, and God’s eternal purpose for us. These chapters aren’t just ancient history—they’re a personal message from Heaven about who you are and why you’re here.\n\nLet’s start with Moses on that mountain. In Moses 1:4, the Lord declares to him, “Behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands.” Two verses later, in Moses 1:6, God reinforces this identity, saying, “And I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten.” Pause to let that resonate. Before Moses is shown the Creation, before he’s given any grand assignment, God makes sure he knows who he is—a son of God, created in the image of Christ Himself. This isn’t just a title; it’s the foundation of everything. But notice what happens next. As soon as Moses receives this divine affirmation, Satan appears in verse 12, sneering, “Moses, son of man, worship me.” Do you see the contrast? Where God uplifts with truth, Satan distorts with lies, trying to strip away that sacred identity. It’s a pattern that plays out in our lives too. How often do we hear whispers that we’re not enough, that we’re defined by our mistakes or the world’s labels? Yet Moses stands firm, responding in verse 13, “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?” His certainty in his identity becomes his shield.\n\nThis truth leads us to a deeper question: How does knowing you’re a child of God shape your choices? Think about that for a moment. President Russell M. Nelson has taught that the way we think about who we really are affects almost every decision we make. When you see yourself as God’s child first—before any other label—how does that change the way you treat yourself or others? Maybe it’s in the patience you show, the courage to stand for truth, or the way you lift someone who feels forgotten. As you read through Moses 1, look for other verses that affirm your divine worth. Let them sink into your heart as a reminder of who you are when the adversary tries to pull you down.\n\nBuilding on that vision of identity, let’s turn to how Moses resists Satan’s temptations in Moses 1:12-26. After God withdraws His presence, Satan doesn’t just leave Moses alone—he doubles down, demanding worship and offering counterfeits of God’s power. But Moses isn’t swayed. In verse 15, he declares, “I can judge between thee and God; for God said unto me: Worship God, for him only shalt thou serve.” Later, in verse 18, after calling upon God, Moses receives strength and commands Satan to depart. What do we learn here? Spiritual experiences don’t exempt us from temptation; in fact, they often invite opposition. But Moses shows us the path—anchor yourself in God’s truth, discern the counterfeit, and call upon the Lord for strength. Reflect on that for a second. What counterfeits does Satan offer in our day? Maybe it’s the fleeting approval of the world or the illusion of happiness through selfish choices. How can you, like Moses, recognize and reject those lies? Notice in verse 25 that it’s only after persistent prayer and reliance on God that Moses finally overcomes, with the Lord’s Spirit returning to strengthen him. The message is clear: we don’t face the adversary alone.\n\nThis pattern of divine help ties beautifully into God’s purpose for us, revealed later in Moses 1:39, where the Lord proclaims, “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” Take a quiet moment to let that settle in. Immortality is to live forever, but eternal life is to live with God, in His presence, as His heirs. That’s the heart of God’s plan—everything He does, from the Creation to the Atonement of Jesus Christ, is to bring you home to Him. When Moses asks in verse 30, “Tell me, I pray thee, why these things are so, and by what thou madest them,” God doesn’t just explain the how of Creation; He reveals the why. It’s all for you, for us, to have the chance to become like Him.\n\nThis same purpose echoes in Abraham 3, where we glimpse our premortal existence. In verses 22-23, Abraham sees the spirits that were with God before the world was, and the Lord says, “These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born.” Can you feel the weight of that? You were there. Before this earth was formed, you were known, loved, and even chosen for specific purposes. In verses 24-25, the Lord explains the plan: “We will make an earth whereon these may dwell; and we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” This life is a test, a proving ground, but it’s not random. It’s part of a divine design, centered on Jesus Christ, who in verse 27 volunteers, saying, “Here am I, send me.” He was chosen as our Savior before the foundation of the world, ensuring we’d have a way back when we falter.\n\nNotice how this pattern continues in both Moses and Abraham’s visions. Whether it’s God affirming Moses’s sonship or revealing to Abraham the premortal council, the message is consistent: you are not an accident. You have a divine origin, a purpose, and a path home through Christ. Cross-referencing this with Doctrine and Covenants 11:20, we’re reminded that our work is to “keep my commandments, yea, with all your might, mind and strength.” Just as Moses had a work to do, so do we. And like Abraham, we were prepared for it long before we came to earth. How does knowing you lived as a spirit with God influence the way you face challenges today? Does it give you strength to choose His will over the world’s distractions?\n\nLet’s deepen this understanding by connecting these truths to the Savior’s own experience in Matthew 4:1-11. After His baptism, Jesus is tempted by Satan in the wilderness, much like Moses. Satan offers counterfeits—turning stones to bread, worldly power, false glory—but Jesus, like Moses, stands firm, rooted in scripture and His divine mission. Each time, He responds with the word of God, showing us that truth is our defense. Elder Gary E. Stevenson has taught that Satan’s deceptions are subtle, often cloaked as good, but we can discern them through the Holy Ghost and by clinging to God’s commandments. How can you apply this in your life? When temptation comes, what truths or scriptures can you hold to, as Jesus and Moses did?\n\nAs we reflect on these chapters, let’s bring it all together. Moses 1 and Abraham 3 are not just stories of ancient prophets; they’re revelations of your story. You are a child of God, known and loved before this world was created. You were sent here with a purpose, to be proven and to grow, with Jesus Christ as your Savior to lift you when you fall. God’s entire work—His glory—is to bring you to eternal life, to live with Him forever. Let that truth settle in your heart. Amid life’s noise and the adversary’s lies, these scriptures stand as a beacon, reminding you of who you are and whose you are.\n\nSo, I invite you to take a few specific steps to apply these truths. First, individually, spend some time this week pondering Moses 1:4 and Abraham 3:23. Write in your journal how knowing you’re a child of God, chosen before the world was, changes the way you see yourself or a current struggle. Second, as a family, read Moses 1:12-26 together and discuss how you can resist Satan’s temptations. Maybe over dinner, share a time you felt strength from God to overcome a challenge. Third, consider singing or listening to “I Am a Child of God” from the Hymns or “I Will Follow God’s Plan” from the Children’s Songbook, and let the words remind you of your divine identity and purpose. As you do these things, I pray you’ll feel the Lord’s voice whispering to you, as He did to Moses, that you are His, and He has a work for you to do. Thank you for joining me today on this journey through the scriptures. Until next time, keep seeking the Lord’s light in your life.",
  "generated_timestamp": "2025-12-26 20:09:13",
  "source_week_file": "cfm_2026_week_02.json"
}