{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "duration_estimate": "~11.7 minutes",
  "word_count": 1748,
  "character_count": 10042,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on the dusty plains of ancient Israel, the sun dipping low on the horizon, as a prophet like Isaiah gazes into the future and declares with unshakable certainty, “Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel” (Isaiah 7:14). That prophecy, spoken centuries before the Savior’s birth, pierces through time, inviting us to see Jesus Christ woven into the very fabric of the Old Testament. As we embark on this year-long journey through these sacred writings, let’s ask ourselves: How can these ancient stories, so distant in culture and time, illuminate our path to the Savior today?\n\nThe Old Testament can feel like a vast, unfamiliar landscape. Its pages are filled with customs and language that might seem foreign, even intimidating. Yet, as we read in the introduction to this year’s study, these writings reveal people like Abraham, Sarah, Hannah, and Daniel—people who, despite living in a world so different from ours, experienced the same joys and struggles we face: family discord, moments of doubt, and the yearning for divine connection. More profoundly, they clung to the promise of a Savior, exercising faith, repenting, and making covenants with God. Their stories echo the psalmist’s words: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105, 140). So, as we open these pages, let’s look for that light—let’s look for Jesus Christ.\n\nOne of the most powerful ways to find the Savior in the Old Testament is to recognize Him as Jehovah, the God of ancient Israel. President Dallin H. Oaks has taught us, “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). Think about that for a moment. When Moses heard the voice from the burning bush, declaring, “I AM THAT I AM” (Exodus 3:14), it was Jesus Christ speaking. When the children of Israel were led through the Red Sea, it was Jesus Christ guiding them. This truth transforms how we read the Old Testament. Every command, every covenant, every act of mercy points us to the One who would come to fulfill them all.\n\nThis leads us to a striking moment in the New Testament. When Jesus declared to the Jewish leaders, “Before Abraham was, I am” (John 8:58), they were ready to stone Him. Why? Because they understood exactly what He was claiming. Turn with me to Exodus 3:13-15, where God reveals His name to Moses as “I AM.” By using this sacred name, Jesus was asserting His identity as Jehovah, the God of their fathers. Pause to let that resonate. What does it mean to you that the same Being who spoke to Moses, who made covenants with Abraham, is the Savior who walked the earth, atoned for your sins, and lives today to intercede for you?\n\nBuilding on that vision, let’s explore how the Old Testament is saturated with symbols and types of Christ. The Lord Himself taught Adam, “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). Consider the manna that sustained the Israelites in the wilderness. In Exodus 16:4, the Lord promises, “Behold, I will rain bread from heaven for you.” Later, in John 6:35, Jesus declares, “I am the bread of life: he that cometh to me shall never hunger.” Or think of the sacrificial lamb of the Passover, described in Exodus 12:3-5 as “without blemish,” pointing directly to John 1:29, where John the Baptist proclaims, “Behold the Lamb of God, which taketh away the sin of the world.” Then there’s the brass serpent, raised by Moses in Numbers 21:8-9, so that all who looked upon it might live—a direct foreshadowing of Christ, as He Himself explains in John 3:14: “As Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.” Even Jonah, swallowed by the great fish for three days and nights (Jonah 1:17), becomes a type of Christ’s death and resurrection, as Jesus notes in Matthew 12:40. What do these symbols stir in your heart? How do they deepen your understanding of the Savior’s mission?\n\nNotice how this pattern continues in the prophetic writings. Isaiah, often called the “messianic prophet,” paints vivid portraits of the coming Redeemer. In Isaiah 9:6, we read, “For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.” And in Isaiah 53:3-5, we see the suffering Servant: “He is despised and rejected of men; a man of sorrows, and acquainted with grief. … Surely he hath borne our griefs, and carried our sorrows. … He was wounded for our transgressions, he was bruised for our iniquities.” As you ponder these verses, what aspects of Christ’s life and Atonement come alive for you? How do these ancient words draw you closer to Him?\n\nThis truth leads us to another layer of the Old Testament’s richness: the restoration of “plain and precious things” through the Prophet Joseph Smith. In 1 Nephi 13:28-29, Nephi saw in vision that many truths would be taken from the Bible, but the Lord promised to “make known the plain and precious things” (1 Nephi 13:35). Through Joseph Smith, we have received treasures like the Book of Moses, which restores profound accounts of Enoch’s city of Zion, where “the Lord called his people Zion, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them” (Moses 7:18). We also have the Book of Abraham, revealing the premortal council in heaven, where the Lord declared, “These I will make my rulers; for he stood among those that were spirits, and he saw that they were good” (Abraham 3:23). And consider the Joseph Smith Translation of Genesis 14:25-40, which unveils the ministry of Melchizedek, a type of Christ, who “brake bread and blest it; and he blest the wine, he being the priest of the most high God.” Reflect on that for a second. Why are these restored truths so vital to our understanding of God’s plan? How do they enrich your study of the Old Testament?\n\nAs we weave these threads together, let’s turn to another central theme: the Old Testament as a story of covenant. In Exodus 19:5, the Lord declares, “If ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people.” This covenant relationship—God seeking to make us His own through sacred promises—runs through every page of the Old Testament. President Russell M. Nelson has taught powerfully about “The Everlasting Covenant” (Liahona, October 2022, 4-11), inviting us to see how covenants bind us to God with a special kind of love and mercy. Think about that as you read stories of Abraham, Isaac, and Jacob. What does God want to teach you about your own covenant relationship with Him? How do passages like Jeremiah 31:31-34, where the Lord promises a new covenant written in our hearts, speak to the promises you’ve made at baptism or in the temple?\n\nThis covenant focus is something we can share with our children as well. Imagine sitting with a young child, looking at a picture of baptism, and discussing the promises we make with God, as described in Mosiah 18:10, “to bear one another’s burdens, that they may be light.” Or showing them an image of the temple and talking about the sacred covenants made there. Even singing a song like “When I Am Baptized” from the Children’s Songbook can plant these truths in their hearts. How might you help the children in your life see Jesus Christ in the Old Testament stories? Could you read Psalm 23 together, finding words like “shepherd” that point to the Savior?\n\nLet’s deepen this connection by considering how the Old Testament and the Book of Mormon work together. In 2 Nephi 3:12, we learn that the writings of Judah (the Bible) and Joseph (the Book of Mormon) “shall grow together, unto the confounding of false doctrines and laying down of contentions, and establishing peace.” As you study the Old Testament this year alongside restored scriptures, notice how they illuminate each other. How do they strengthen your faith in Jesus Christ as the center of God’s plan?\n\nAs we draw to a close, let’s reflect on the invitation from Elder Dale G. Renlund to “remember and always focus on Jesus Christ” (Liahona, November 2023, 98). The Old Testament, though ancient, is a living witness of the Savior. Its symbols, stories, and covenants all point to Him—the Bread of Life, the Lamb of God, the Great I AM. Take a quiet moment to consider: Where do you see Him in your life right now? How does recognizing Him as Jehovah change the way you approach these scriptures?\n\nI invite you to carry these questions into your personal study this week. Open the Old Testament with a prayerful heart, asking to see Jesus Christ in its pages. Look for one symbol or story—perhaps the manna or the brass serpent—and ponder what it teaches you about the Savior’s love. If you have a family or study group, discuss together how the Old Testament testifies of Christ. Read Isaiah 9:6 or Psalm 23 aloud, and share what words or images stand out to you. And consider taking a moment in the temple, if possible, to reflect on your covenant relationship with God, asking how the ancient promises to Abraham and Israel apply to you today. Finally, dive into President Nelson’s message on “The Everlasting Covenant” in the October 2022 Liahona, and let his words guide your understanding of God’s love for you.\n\nThe Old Testament is a lamp and a light, a sacred record that invites us to come unto Christ. Let’s step into this journey with faith, trusting that as we seek Him, we will find Him—on every page, in every story, and in every covenant promise. Until we meet again, may His light guide your path.",
  "generated_timestamp": "2025-12-26 20:07:55",
  "source_week_file": "cfm_2026_week_01.json"
}