{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "duration_estimate": "~6.6 minutes",
  "word_count": 988,
  "character_count": 5857,
  "segment_count": 49,
  "script": [
    {
      "speaker": "David",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "And I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "Sarah, I want to start with something that has always puzzled me. In John 8:58, Jesus declares, 'Before Abraham was, I am,' and the Jews immediately pick up stones to kill Him. Why such a strong reaction to those words?"
    },
    {
      "speaker": "Sarah",
      "text": "That's a fantastic question, David. It unlocks so much about the Old Testament. To understand their outrage, we need to go back to Exodus 3:13-15, where Moses asks God what His name is at the burning bush."
    },
    {
      "speaker": "David",
      "text": "Tell me more about that moment."
    },
    {
      "speaker": "Sarah",
      "text": "God replies, 'I AM THAT I AM,' and says, 'Thus shalt thou say unto the children of Israel, I AM hath sent me unto you.' That's the divine name—YHWH, or Jehovah. When Jesus claimed 'I am,' He was directly identifying Himself as Jehovah, the God of the Old Testament."
    },
    {
      "speaker": "David",
      "text": "That's profound. So the Jews recognized it as blasphemy because they saw it as Jesus equating Himself with God."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly. President Dallin H. Oaks taught that scriptural records of words spoken by 'God' or the 'Lord' are almost always the words of Jehovah, our risen Lord, Jesus Christ. It's significant to realize Jesus Christ is Jehovah throughout the Old Testament."
    },
    {
      "speaker": "David",
      "text": "I'm intrigued by how this changes our reading of the Old Testament. What strikes me is how many symbols point to Him right from the start."
    },
    {
      "speaker": "Sarah",
      "text": "One powerful way to nourish ourselves in the Old Testament is to look for Jesus Christ as the Bread of Life. Take manna in Exodus 16:4, 11-15. God provides it daily, and Jesus says in John 6:35, 'I am the bread of life.'"
    },
    {
      "speaker": "David",
      "text": "That's a clear connection. What else stands out to you?"
    },
    {
      "speaker": "Sarah",
      "text": "The sacrificial lamb in Exodus 12:3-5 mirrors John 1:29, where John the Baptist calls Jesus 'the Lamb of God.' Then there's the brass serpent in Numbers 21:4-10, lifted up so the people could look and live, just as Jesus describes in John 3:14."
    },
    {
      "speaker": "David",
      "text": "And Jonah, right? Jonah 1:4-17 and Matthew 12:38-41."
    },
    {
      "speaker": "Sarah",
      "text": "Yes, Jonah in the great fish for three days and nights foreshadows Christ's Resurrection. These symbols teach us about His role as provider, sacrifice, healer, and conqueror of death."
    },
    {
      "speaker": "David",
      "text": "I hadn't connected them all like that before. It makes the Old Testament feel alive with testimony of Him."
    },
    {
      "speaker": "Sarah",
      "text": "The Lord told Adam in Moses 6:63, 'All things have their likeness, and all things are created and made to bear record of me.' Focusing on Christ helps us find deep meaning."
    },
    {
      "speaker": "David",
      "text": "How does knowing Jesus is Jehovah shift our perspective on ancient events?"
    },
    {
      "speaker": "Sarah",
      "text": "Consider Exodus 6:3-5. God says to Moses, 'I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them.' The Joseph Smith Translation clarifies this further."
    },
    {
      "speaker": "David",
      "text": "So ancient patriarchs knew Him differently?"
    },
    {
      "speaker": "Sarah",
      "text": "Yes, different dispensations reveal Him progressively. Abraham, Isaac, and Jacob knew Him as God Almighty, but Moses learns the name Jehovah more fully."
    },
    {
      "speaker": "David",
      "text": "That's fascinating—almost like layers of understanding building over time."
    },
    {
      "speaker": "Sarah",
      "text": "And it continues with Christ openly declaring it, then restored plainly today. What many don't realize is how the Old Testament's ancient culture, though foreign, shows familiar struggles—family joys, doubts, faith—like ours."
    },
    {
      "speaker": "David",
      "text": "People like Abraham and Sarah experienced real life, yet made covenants and trusted the Savior's promise."
    },
    {
      "speaker": "Sarah",
      "text": "Precisely. The Old Testament is full of covenant stories. God seeks to make us His 'peculiar treasure' by covenant, as in Exodus 19:5."
    },
    {
      "speaker": "David",
      "text": "Help me understand how covenants tie into this week's focus."
    },
    {
      "speaker": "Sarah",
      "text": "President Russell M. Nelson's message 'The Everlasting Covenant' highlights this. It's the same covenant offered to ancient prophets like Abraham and his posterity, connecting to our temple covenants today."
    },
    {
      "speaker": "David",
      "text": "So the Old Testament reveals our covenant path."
    },
    {
      "speaker": "Sarah",
      "text": "Yes, and Jeremiah 31:31-34 prophesies a new covenant written in our hearts. These patterns span dispensations."
    },
    {
      "speaker": "David",
      "text": "What about the plain and precious things restored?"
    },
    {
      "speaker": "Sarah",
      "text": "Nephi saw in vision that many plain and precious things were removed from the Bible, in 1 Nephi 13:21-29, 38-42. The Lord restores them through Joseph Smith—like the book of Moses and book of Abraham."
    },
    {
      "speaker": "David",
      "text": "Give me an example."
    },
    {
      "speaker": "Sarah",
      "text": "Moses 7:18-19 restores Enoch's city of Zion. Abraham 3:22-28 shows the council in heaven. And Joseph Smith Translation, Genesis 14:25-40 details Melchizedek's ministry. These fill in vital truths."
    },
    {
      "speaker": "David",
      "text": "That's transformative. Why are they plain and precious?"
    },
    {
      "speaker": "Sarah",
      "text": "They clarify the plan of salvation, premortal life, Zion's possibility, and priesthood power—core to our covenants."
    },
    {
      "speaker": "David",
      "text": "I see how ancient Israel saw Jehovah through symbols, Christ revealed Himself directly, and modern prophets restore the full picture."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly. Elder Dale G. Renlund urges us to always focus on Jesus Christ, as in his message 'Jesus Christ Is the Treasure.'"
    },
    {
      "speaker": "David",
      "text": "What strikes me is how this applies today. How do these symbols strengthen our faith now?"
    },
    {
      "speaker": "Sarah",
      "text": "When we face uncertainty, like manna daily, we trust Christ as our sustenance. The lamb reminds us of His Atonement in our sacrifices."
    },
    {
      "speaker": "David",
      "text": "And covenants give that special love and mercy from God."
    },
    {
      "speaker": "Sarah",
      "text": "Yes, as we keep them, we become His peculiar treasure. Psalm 119:105 says, 'Thy word is a lamp unto my feet, and a light unto my path.'"
    },
    {
      "speaker": "David",
      "text": "This really deepens my anticipation for the year."
    },
    {
      "speaker": "Sarah",
      "text": "Mine too. As we study, let's watch for how God teaches us about our covenant relationship with Him."
    },
    {
      "speaker": "David",
      "text": "That's a perfect invitation. Notice the brass serpent—looking to Christ heals us today, just as it did then."
    },
    {
      "speaker": "Sarah",
      "text": "Beautiful. And 2 Nephi 3:12 shows how Bible and Book of Mormon together make these truths plain."
    },
    {
      "speaker": "David",
      "text": "I hadn't thought of it that way. It ties ancient and modern seamlessly."
    },
    {
      "speaker": "Sarah",
      "text": "The plan of salvation shines through—symbols bearing record of Him across time."
    },
    {
      "speaker": "David",
      "text": "Sarah, this conversation has me eager to dive deeper into the Old Testament, seeing Christ everywhere."
    },
    {
      "speaker": "Sarah",
      "text": "Me too, David. Listeners, as you begin this year, seek Him in every page, and let covenants draw you closer."
    },
    {
      "speaker": "David",
      "text": "Thanks, Sarah. Until next time, keep studying."
    }
  ],
  "host": "David",
  "guest": "Sarah",
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-17 17:23:02",
  "source_week_file": "cfm_2026_week_01.json"
}