{
  "week_number": 5,
  "title": "Week 5: January 26–February 1 - Genesis 5; Moses 6",
  "date_range": "January 26–February 1",
  "study_level": "essential",
  "duration_estimate": "~8.4 minutes",
  "word_count": 1264,
  "character_count": 7001,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine for a moment that you’re standing on a rugged hillside, the air heavy with the weight of a world slipping into darkness. You see a man named Enoch, called by God to be a prophet, yet he’s trembling with doubt. He looks at himself and sees only weakness, wondering, “Why me? How can I possibly speak to these people?” And yet, in that very moment of uncertainty, the Lord speaks to him with power and promise. Today, we’re diving into Genesis 5 and Moses 6, where we uncover the remarkable story of Enoch—a story of divine calling, overcoming weakness, and the eternal gospel taught from the very beginning. Let’s walk this path together and see what the Lord has to teach us through these sacred verses.\n\nLet’s start with Enoch, a name that briefly appears in Genesis 5:24 with a mysterious note: “And Enoch walked with God: and he was not; for God took him.” That single verse sparks curiosity, doesn’t it? What does it mean to walk with God? What happened to Enoch? Thankfully, Moses 6 pulls back the curtain and gives us the full picture. As we read in Moses 6:26-31, the Spirit of God descends upon Enoch, and the Lord calls him to preach repentance to a wicked people. But Enoch hesitates. He says in verse 31, “Why is it that I have found favor in thy sight, and am but a lad, and all the people hate me; for I am slow of speech; wherefore am I thy servant?” Can you feel the weight of his fear? He’s overwhelmed, feeling inadequate for such a monumental task. Maybe you’ve felt that way too—called to do something hard, whether it’s teaching a lesson, serving in a calling, or even standing up for what’s right. Enoch’s story reminds us that feeling unqualified isn’t a sign of failure; it’s often the starting point for God’s greatest work.\n\nNow, notice how the Lord responds to Enoch’s doubts in Moses 6:32-34. He doesn’t dismiss Enoch’s fears; instead, He empowers him. The Lord says, “Go forth and do as I have commanded thee, and no man shall pierce thee. Open thy mouth, and it shall be filled, and I will give thee utterance… Behold my Spirit is upon thee, wherefore all thy words will I justify; and the mountains shall flee before thee, and the rivers shall turn from their course; and thou shalt abide in me, and I in thee; therefore walk with me.” Pause to let that resonate. What a promise! The Lord assures Enoch that He will be with him, filling his mouth with words and giving him strength beyond his own. This truth leads us to a powerful principle: God doesn’t call the qualified; He qualifies those He calls. Think about that in your own life. When have you felt the Lord’s strength lift you beyond your weaknesses? How has He helped you do hard things?\n\nBuilding on that vision, let’s see how Enoch’s journey unfolds. In Moses 6:37-47, we read that as Enoch begins to preach, something incredible happens. Verse 37 tells us, “And it came to pass that Enoch went forth in the land, among the people, standing upon the hills and the high places, and cried with a loud voice, testifying against their works; and all men were offended because of him.” Yet, despite the opposition, the Lord’s power is with him. By Moses 7:13, we learn that “so great was the faith of Enoch that he led the people of God, and their enemies came to battle against them; and he spake the word of the Lord, and the earth trembled, and the mountains fled, even according to his command.” What a transformation! From a man who felt slow of speech to a prophet whose words moved mountains—literally. This shows us that when we trust in the Lord’s promises, He can turn our weaknesses into strengths, just as He did for Enoch.\n\nNow, let’s shift to another beautiful theme in Moses 6—the teaching of the gospel from the very beginning. As we turn to Moses 6:48-68, we see that God taught Adam and Eve the plan of redemption right after they left the Garden of Eden. In verses 50-52, the Lord declares, “If thou wilt turn unto me, and hearken unto my voice, and believe, and repent of all thy transgressions, and be baptized, even in water, in the name of mine Only Begotten Son, who is full of grace and truth, which is Jesus Christ, the only name which shall be given under heaven, whereby salvation shall come unto the children of men, ye shall receive the gift of the Holy Ghost.” Take a quiet moment to reflect on that. Even in the earliest days of humanity, the gospel of Jesus Christ—faith, repentance, baptism, and receiving the Holy Ghost—was the path back to God. Isn’t it comforting to know that the same principles we follow today were taught to Adam and his family?\n\nThis pattern continues in verse 59, where the Lord compares baptism to being born again, saying, “That by reason of transgression cometh the fall, which fall bringeth death, and inasmuch as ye were born into the world by water, and blood, and the spirit, which I have made, and so became of dust a living soul, even so ye must be born again into the kingdom of heaven, of water, and of the Spirit, and be cleansed by blood, even the blood of mine Only Begotten.” What a powerful symbol! Just as we’re born physically through water, blood, and spirit, we’re reborn spiritually through baptism and the cleansing power of Christ’s Atonement. How does that imagery deepen your understanding of what it means to be born again? How can you seek that renewal in your life each day?\n\nNotice how this truth ties to the responsibility of teaching these principles. In Moses 6:58, the Lord commands, “Therefore I give unto you a commandment, to teach these things freely unto your children, saying: That by reason of transgression cometh the fall, which fall bringeth death.” Parents in Adam’s day were instructed to teach their children the gospel, just as we’re called to do today. Think about that for a second. Whether you’re a parent, a sibling, or a friend, you have the opportunity to share these eternal truths with those around you. How can you help the rising generation understand the importance of faith in Jesus Christ, repentance, and the ordinances of salvation?\n\nAs we draw to a close, let’s reflect on what Enoch and Adam teach us. Enoch shows us that God can help us overcome any weakness when we trust in Him and walk with Him. Adam reminds us that the gospel of Jesus Christ has always been the way back to our Heavenly Father, and it’s our privilege to teach it to others. These stories aren’t just history; they’re invitations to see God’s hand in our own lives. So, I invite you to ponder this question: What is one thing the Lord is calling you to do—big or small—that feels overwhelming? Take a moment this week to pray for His strength, just as Enoch did, and trust that He will walk with you. Let that promise from Moses 6:34—“walk with me”—guide your steps. As you do, you’ll feel His presence, just as Enoch did, and find the courage to do hard things. Thank you for joining me today, and may the Lord bless you as you seek to walk with Him.",
  "generated_timestamp": "2025-12-26 20:14:54",
  "source_week_file": "cfm_2026_week_05.json"
}