{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "essential",
  "duration_estimate": "~7.8 minutes",
  "word_count": 1174,
  "character_count": 6340,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, the vastness of creation stretching endlessly before you, and hearing the voice of God Himself declare, “Thou art my son.” That’s the breathtaking moment Moses experienced in Moses 1, a moment that not only changed his life but can transform how you see yourself and your purpose. Today, we’re diving into Moses 1 and Abraham 3, sacred scriptures revealed through the Prophet Joseph Smith, to explore profound truths about who God is, who you are, and why you’re here on this earth. Let’s journey together into these divine revelations and uncover how they speak directly to your heart.\n\nLet’s start with Moses on that mountain. In Moses 1:4, the Lord speaks with such tenderness and power, saying, “Behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands.” Just a few verses later, in Moses 1:6, God reaffirms, “I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten.” Can you feel the weight of those words? God isn’t just calling Moses His servant or His creation—He’s calling him His son, someone with a divine identity and a unique purpose. This isn’t just about Moses. It’s about you. You are a child of God, created in His image, with a work to do that only you can fulfill. Pause for a moment and let that sink in. How does knowing you’re a child of God change the way you see yourself?\n\nNow, contrast this with what happens next in Moses 1:12. Satan comes to Moses and sneers, “Moses, son of man, worship me.” Notice the difference. Where God uplifts with truth and love, Satan seeks to degrade and deceive, stripping away Moses’s divine identity by calling him merely a “son of man.” It’s a counterfeit, a lie meant to make Moses—and us—forget who we really are. But Moses doesn’t fall for it. In verse 13, he boldly responds, “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?” Moses clings to the truth of his identity, and with the Lord’s help, he resists. This leads us to a vital question: How often do we encounter voices or influences that try to make us forget our divine worth? Maybe it’s a thought that says you’re not enough, or a temptation to follow a path that pulls you away from God. What can you learn from Moses about standing firm in those moments?\n\nBuilding on that, let’s look at how Moses overcomes Satan in verses 18 and 20-21. After commanding Satan to depart in the name of the Only Begotten, Moses prays for strength, and the Lord’s power fills him until Satan finally flees. It’s a reminder that we’re not alone in our battles. The Lord is ready to help us resist, just as He helped Moses. Think about a time when you’ve felt tempted or discouraged. How can turning to God in prayer, like Moses did, bring you the strength you need? Let that thought settle in your heart for a second.\n\nThis truth about our identity and God’s power leads us to another profound vision in Moses 1:27-39. After showing Moses the vastness of His creations, the Lord answers Moses’s question about why all this exists. In Moses 1:39, God declares, “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” Every star, every mountain, every soul—it’s all for you. God’s entire purpose is to help you return to Him and live with Him forever. Isn’t that incredible? It shows how much He loves you and how central you are to His plan. Reflect on that for a quiet moment. How does knowing God’s work is for your eternal life change the way you view your daily struggles or choices?\n\nNow, let’s turn to Abraham 3, where we get a glimpse into our existence before this earth was even created. In Abraham 3:22-23, we read, “Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones; And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good.” You were there. Before you were born, you lived as a spirit with God, and He saw your goodness. Then, in verses 24-25, the Lord explains the purpose of creating this earth: “And there stood one among us that was like unto God, and he said unto us: We will go down, for there is space there, and we will take of these materials, and we will make an earth whereon these may dwell; And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” That “one like unto God” is Jesus Christ, chosen to be our Savior from the beginning. This life is a test, a chance to choose God’s will and grow closer to Him. How does knowing you lived with God before this life influence the choices you make today?\n\nConnecting these visions, we see a beautiful pattern. In both Moses 1 and Abraham 3, God reveals our divine origin and destiny. You’re not an accident or a random speck in the universe. You’re a child of God, known and loved by Him from before the world was. And through Jesus Christ, He has provided a way for you to return to Him. This ties back to Moses 1:39—God’s work and glory is your eternal life. Every commandment, every trial, every blessing is designed to help you become like Him. Take a moment to let that resonate. What does it mean to you that God’s greatest joy is your salvation?\n\nAs we close, let’s reflect on these truths. You are a child of God with a divine destiny. You lived with Him before this life, and He has a work for you to do here on earth. Even when Satan tries to deceive or discourage you, the Lord stands ready to help you resist, just as He helped Moses. And through it all, God’s purpose is to bring you home to eternal life with Him. I invite you to take some quiet time this week to ponder your identity as a child of God. Maybe write down one choice you can make—big or small—that reflects who you really are. As you do, pray for the strength to see yourself as God sees you, and let that truth guide your path. Thank you for joining me today on this sacred journey through the scriptures. Until we meet again, may you feel the Lord’s love in every step.",
  "generated_timestamp": "2026-01-01 00:01:33",
  "source_week_file": "cfm_2026_week_02.json"
}