{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "duration_estimate": "~9.0 minutes",
  "word_count": 1353,
  "character_count": 7870,
  "segment_count": 29,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’m diving right in with something that’s always puzzled me. In John 8:58, Jesus says, ‘Before Abraham was, I am,’ and the Jews immediately pick up stones to kill Him. Why such a violent reaction to just three words? What did they hear that we might be missing?"
    },
    {
      "speaker": "David",
      "text": "That’s a fantastic question, Sarah, and it’s the key to unlocking a massive truth about the Old Testament. Those three words, ‘I am,’ weren’t just a statement—they were a declaration of divinity. To understand why the Jews reacted so strongly, we need to go back over a thousand years to a burning bush in Exodus 3. Hold that thought, because this connection is going to shift everything."
    },
    {
      "speaker": "Sarah",
      "text": "Wait, what? A burning bush? I’m already intrigued. Let’s set the stage—how do we even approach the Old Testament to see these kinds of connections?"
    },
    {
      "speaker": "David",
      "text": "Great starting point. The Old Testament can feel intimidating with its ancient culture and language, but it’s really a treasure map pointing to Jesus Christ. We can look at it from multiple angles: the perspective of ancient Israel, who saw God as Jehovah; the lens of Christ’s ministry, where He reveals Himself as that same Jehovah; and our modern view as Latter-day Saints, where restored truths fill in the gaps. Each perspective adds a layer to the story."
    },
    {
      "speaker": "Sarah",
      "text": "I love that idea of layers. So, for ancient Israel, Jehovah was their God, their deliverer. How does that shift when we see Christ claiming that name?"
    },
    {
      "speaker": "David",
      "text": "It’s profound. In Exodus 3:14, when Moses asks God His name at the burning bush, God answers, ‘I AM THAT I AM.’ That phrase, ‘I am,’ is tied directly to Jehovah’s identity. When Jesus says in John 8:58, ‘Before Abraham was, I am,’ He’s claiming to be Jehovah Himself—the God of Israel. To the Jews, this was blasphemy unless it was true, which is why they grabbed stones."
    },
    {
      "speaker": "Sarah",
      "text": "That’s remarkable! So, they weren’t just upset about a random claim—they heard Him say He was their God. I need to understand how this identity of Jehovah as Christ runs through the Old Testament. Are there patterns we can trace?"
    },
    {
      "speaker": "David",
      "text": "Absolutely, and this is where it gets exciting. Let’s trace the theme of divine identity across dispensations. Start with Moses in Exodus, where Jehovah reveals Himself as ‘I am.’ Then move to Isaiah, who prophesies of a Messiah who will be called ‘Immanuel,’ meaning ‘God with us’ in Isaiah 7:14. Fast forward to Christ’s ministry in John, where He explicitly claims that identity. And finally, in our day, modern revelation through Joseph Smith confirms that Jesus is Jehovah, as taught by President Dallin H. Oaks in the May 2023 Liahona."
    },
    {
      "speaker": "Sarah",
      "text": "I’m seeing it! That thread ties the whole plan together. But let’s zoom in on ancient Israel for a moment. What’s a cultural detail that helps us feel how they understood Jehovah?"
    },
    {
      "speaker": "David",
      "text": "Here’s something fascinating from historical context. In ancient Israel, the name of God—often written as YHWH, or Jehovah—was so sacred they wouldn’t even pronounce it. They substituted it with ‘Adonai,’ meaning ‘Lord,’ out of reverence. So when Jesus says ‘I am,’ directly echoing Jehovah’s name from Exodus 3:14, it’s not just a theological claim—it’s a cultural lightning bolt. They felt the weight of that name in their bones."
    },
    {
      "speaker": "Sarah",
      "text": "That gives me chills. It’s like the air in the room changed when He said it. What about another historical insight? Is there something tangible that connects us to their world?"
    },
    {
      "speaker": "David",
      "text": "Yes, let’s talk about the Dead Sea Scrolls, discovered in the mid-20th century. These ancient manuscripts, dating back to before Christ’s time, include fragments of almost every Old Testament book. They confirm how meticulously the Israelites preserved their scriptures, especially passages about Jehovah. Knowing that, when we read prophecies like Isaiah 9:6—‘unto us a child is born, unto us a son is given’—we’re touching the same words ancient Israel revered as pointing to their Messiah."
    },
    {
      "speaker": "Sarah",
      "text": "That makes the Old Testament feel so immediate, like we’re holding history in our hands. Now, let’s circle back to that mystery of ‘I am.’ How does this resolve for us as modern readers?"
    },
    {
      "speaker": "David",
      "text": "Here’s where it gets powerful. Understanding that Jesus is Jehovah means every interaction with God in the Old Testament is a direct encounter with the Savior. When Jehovah speaks to Moses, delivers manna in Exodus 16, or guides through the wilderness, it’s Christ. This isn’t just a name—it’s a revelation of His eternal role as our Redeemer across all time."
    },
    {
      "speaker": "Sarah",
      "text": "I never saw it that way before. It’s like the Old Testament is a prequel to the New Testament, all centered on Christ. Are there other connections most people might miss that tie this together?"
    },
    {
      "speaker": "David",
      "text": "Definitely. Notice this pattern of symbols pointing to Christ. Take the brass serpent in Numbers 21:4-9, where Moses raises a serpent on a pole for Israel to look upon and live. Jesus Himself links this to His crucifixion in John 3:14, saying, ‘As Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.’ It’s a direct parallel to His Atonement."
    },
    {
      "speaker": "Sarah",
      "text": "That’s incredible. What’s another hidden connection we should notice?"
    },
    {
      "speaker": "David",
      "text": "Look at the Passover lamb in Exodus 12:3-5. The lamb had to be without blemish, sacrificed to save Israel from death. John the Baptist calls Jesus ‘the Lamb of God, which taketh away the sin of the world’ in John 1:29. It’s a stunning foreshadowing of Christ’s sacrifice, woven right into Israel’s rituals."
    },
    {
      "speaker": "Sarah",
      "text": "I’m blown away by how deliberate these symbols are. It’s like every page is whispering about the Savior. What’s one more connection that ties this to the bigger picture?"
    },
    {
      "speaker": "David",
      "text": "Let’s look at Jonah, specifically in Jonah 1:4-17, where he’s in the belly of the whale for three days. Jesus references this in Matthew 12:38-41 as a sign of His own death and resurrection—three days in the tomb. It’s not just a story of repentance; it’s a prophetic type of Christ’s victory over death, showing the plan of salvation from the very beginning."
    },
    {
      "speaker": "Sarah",
      "text": "That just deepens everything. These aren’t random stories—they’re pieces of an eternal puzzle. How does this understanding of Christ as Jehovah change how we see our own relationship with God?"
    },
    {
      "speaker": "David",
      "text": "It brings the Old Testament right into our lives. When we read about Jehovah making covenants with Abraham or delivering Israel, we’re seeing the same Savior who offers us covenants today through baptism and the temple. As President Russell M. Nelson taught in the October 2022 Liahona, the everlasting covenant shows God’s ‘special kind of love and mercy’—a love that spans from ancient Israel to us."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautiful. It’s like the ancient and modern worlds collapse into one story—our story. I’m starting to see my own covenants in a new light. How can we carry this forward as we study?"
    },
    {
      "speaker": "David",
      "text": "Here’s a practical way to apply it. As you read the Old Testament, ask yourself: How does this story or symbol point to Christ? Whether it’s manna, a prophet’s words, or a covenant, look for Him. Elder Dale G. Renlund’s counsel from the November 2023 Liahona to ‘always focus on Jesus Christ’ can guide us to find Him on every page."
    },
    {
      "speaker": "Sarah",
      "text": "I’m excited to do that. It feels like a treasure hunt now, not just a history lesson. David, before we wrap up, what’s one final thought you want listeners to hold onto from this discussion?"
    },
    {
      "speaker": "David",
      "text": "I’d invite everyone to remember that the Old Testament isn’t just ancient—it’s personal. Every story of deliverance, every covenant, every symbol of Christ is a reminder that He’s been with His people from the beginning. Let’s dive into these scriptures with open hearts, looking for Him, because as Psalm 119:105 says, ‘Thy word is a lamp unto my feet, and a light unto my path.’"
    },
    {
      "speaker": "Sarah",
      "text": "That’s the perfect note to end on. Thank you, David, for helping us see the Savior in a whole new way. Listeners, join us next time as we continue this journey through the Old Testament, uncovering more connections and truths together."
    }
  ],
  "host": "Sarah",
  "guest": "David",
  "voices": {
    "Sarah": "aoede",
    "David": "enceladus"
  },
  "generated_timestamp": "2026-01-04 20:28:47",
  "source_week_file": "cfm_2026_week_01.json"
}