{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "duration_estimate": "~10.1 minutes",
  "word_count": 1517,
  "character_count": 8747,
  "segment_count": 28,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’m thrilled to kick off this year with an introduction to the Old Testament. There’s so much richness in these ancient writings, but I know they can feel a bit daunting for some. How do you approach the Old Testament to make it feel accessible and relevant?"
    },
    {
      "speaker": "David",
      "text": "That’s a great question, Sarah. I like to start by remembering that the Old Testament isn’t just a history book—it’s a witness of Jesus Christ. I focus on looking for Him in the stories and symbols, like the manna in Exodus or the brass serpent in Numbers. That perspective helps bridge the gap between ancient times and our modern lives."
    },
    {
      "speaker": "Sarah",
      "text": "I love that focus on Christ as the center. It reminds me of what Elder Dale G. Renlund said in his message ‘Jesus Christ Is the Treasure,’ where he encouraged us to always focus on the Savior. When you think about the Old Testament testifying of Christ, what are some of the symbols or types that stand out to you?"
    },
    {
      "speaker": "David",
      "text": "Oh, there are so many. One that immediately comes to mind is the sacrificial lamb from Exodus 12:3-5, which points so clearly to John 1:29, where Christ is called the ‘Lamb of God.’ It’s a powerful reminder of His atoning sacrifice. Another is Jonah’s three days in the whale, as described in Jonah 1:4-17, which Christ Himself referenced in Matthew 12:38-41 as a sign of His death and resurrection."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautiful. Those connections really bring the Old Testament to life. Let’s dive deeper into one of those—say, the brass serpent from Numbers 21:4-10. How do you see that story teaching us about the Savior?"
    },
    {
      "speaker": "David",
      "text": "I’m glad you brought that up. In Numbers 21, the children of Israel are bitten by fiery serpents, and the Lord instructs Moses to make a brass serpent and set it on a pole. Those who look upon it are healed, as we read in verse 9: ‘And it came to pass, that if a serpent had bitten any man, when he beheld the serpent of brass, he lived.’ Jesus directly ties this to Himself in John 3:14, saying, ‘And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.’ It’s a profound type of how we must look to Christ to be saved."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly! It’s such a vivid image of turning to the Savior for healing. I also love how it shows His role as our Redeemer, even in these early scriptures. Speaking of His identity, let’s talk about the significance of Jesus Christ being Jehovah in the Old Testament. How does that shape your reading of these texts?"
    },
    {
      "speaker": "David",
      "text": "It’s transformative, Sarah. President Dallin H. Oaks taught in his May 2023 Liahona message, ‘The Teachings of Jesus Christ,’ that when we read ‘God’ or ‘Lord’ in the scriptures, it’s almost always referring to Jehovah, who is Jesus Christ. So, when we see Jehovah speaking to Moses in Exodus 3:13-15, where He declares His name as ‘I AM,’ and then hear Jesus echo that in John 8:58 with ‘Before Abraham was, I am,’ it’s a powerful declaration of His divine identity. It means that every covenant, every promise in the Old Testament is coming directly from our Savior."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so striking. It adds such depth to know that it’s Christ Himself guiding His people all along. I’m curious about how this ties into the idea of covenants, since the Old Testament is so much about God’s covenant relationship with His people. What insights do you have on that?"
    },
    {
      "speaker": "David",
      "text": "Covenants are at the heart of the Old Testament, aren’t they? In Exodus 19:5, the Lord says, ‘Now therefore, if ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people.’ This idea of being a covenant people is reiterated through prophets like Abraham and Jeremiah. President Russell M. Nelson’s message ‘The Everlasting Covenant’ in the October 2022 Liahona really unpacks how these covenants show God’s desire to bind us to Him through a special kind of love and mercy."
    },
    {
      "speaker": "Sarah",
      "text": "I love that phrase, ‘peculiar treasure.’ It makes me feel so valued by the Lord. Building on that, how do the restorations through Joseph Smith enhance our understanding of these covenant relationships in the Old Testament?"
    },
    {
      "speaker": "David",
      "text": "They’re absolutely essential. In 1 Nephi 13:21-29, we learn that many ‘plain and precious things’ were taken from the Bible over time, but the Lord promised to restore them. Through Joseph Smith, we have the Book of Moses, which gives us insights into Enoch’s city of Zion in Moses 7:18-19, and the Book of Abraham, with its incredible vision of the premortal council in Abraham 3:22-28. These restorations clarify the covenant framework, showing us how God’s plan has always been centered on bringing us back to Him."
    },
    {
      "speaker": "Sarah",
      "text": "That’s fascinating. Those restored truths really do fill in so many gaps. I’m thinking about the ministry of Melchizedek, for instance, from the Joseph Smith Translation of Genesis 14:25-40. How does that add to our understanding of priesthood and covenants?"
    },
    {
      "speaker": "David",
      "text": "It’s a game-changer, Sarah. In the JST of Genesis 14, we learn that Melchizedek was a high priest after the order of the Son of God, and he blessed Abraham. Verses 26-27 describe how this priesthood is ‘without beginning of days or end of years,’ pointing directly to the eternal nature of Christ’s priesthood. It shows that the covenant blessings Abraham received were tied to an eternal priesthood, which we participate in today through ordinances like baptism and temple covenants."
    },
    {
      "speaker": "Sarah",
      "text": "That’s such a powerful connection. It makes me appreciate how the Old Testament isn’t just ancient history—it’s our history as covenant people. Let’s shift to how these themes apply to us today. How can studying the Old Testament help us in our modern lives?"
    },
    {
      "speaker": "David",
      "text": "I think it’s incredibly practical. The Old Testament shows us how God moves in the lives of real, imperfect people—think of Abraham’s moments of doubt or Hannah’s heartfelt prayers. Their stories remind us that God is with us in our struggles and joys, just as He was with them. It also teaches us to look for Christ in everything, which can guide our daily decisions and strengthen our faith."
    },
    {
      "speaker": "Sarah",
      "text": "I agree completely. It’s comforting to see those human experiences and know that God’s promises hold true for us too. I also think focusing on covenants can remind us of our purpose. How do you see that playing out for families or individuals today?"
    },
    {
      "speaker": "David",
      "text": "Absolutely, Sarah. For families, discussing covenants—like the ones we make at baptism, as described in Mosiah 18:10, 13—can be a way to teach children about promises and accountability. For individuals, reflecting on the everlasting covenant, as President Nelson taught, can inspire us to seek that ‘special kind of love and mercy’ in our relationship with God. It’s a reminder to prioritize our spiritual commitments amidst life’s distractions."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a wonderful application. I also think looking for Christ in the Old Testament can be a family activity—maybe reading Isaiah 7:14 or 9:6 together and talking about the Savior’s birth. It’s a way to center our homes on Him. What are some other ways you’d encourage listeners to engage with these stories?"
    },
    {
      "speaker": "David",
      "text": "I’d suggest starting with curiosity. When you read about symbols like the manna or the brass serpent, ask yourself, ‘How does this point to Christ?’ Cross-reference with New Testament passages like John 6:35, where Jesus says, ‘I am the bread of life.’ Also, don’t shy away from the restored scriptures—dive into the Book of Moses or Abraham and see how they expand your view of God’s plan."
    },
    {
      "speaker": "Sarah",
      "text": "Those are great ideas. I love the invitation to be curious and to connect the dots across scriptures. As we wrap up, David, what’s one key thought you hope listeners take away from this introduction to the Old Testament?"
    },
    {
      "speaker": "David",
      "text": "I hope they remember that the Old Testament is a testament of Jesus Christ. It’s not just ancient—it’s alive with His presence. Every story, every covenant, every symbol is an invitation to come unto Him. I hope listeners feel excited to discover Him in these pages."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautifully said. I echo that excitement. I’d invite everyone to take some time this week to open the Old Testament with a prayerful heart—ask the Lord to help you see the Savior in these writings. Maybe ponder your own covenant relationship with Him, or spend a quiet moment in the temple reflecting on His promises."
    },
    {
      "speaker": "David",
      "text": "I second that. Also, consider journaling your thoughts as you study. Write down how a particular story or symbol speaks to you. And don’t hesitate to discuss these insights with family or friends—it can deepen your understanding."
    },
    {
      "speaker": "Sarah",
      "text": "Wonderful advice, David. Thank you so much for joining me today. I’m already looking forward to our next conversation. To our listeners, keep studying, keep seeking, and we’ll see you next time on the Come Follow Me Podcast by Gospel Study App."
    },
    {
      "speaker": "David",
      "text": "Thanks, Sarah. Can’t wait to be back. Take care, everyone!"
    }
  ],
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-01 01:08:19",
  "source_week_file": "cfm_2026_week_01.json"
}