{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "duration_estimate": "~9.5 minutes",
  "word_count": 1425,
  "character_count": 8233,
  "segment_count": 33,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’ve got to start with something that’s puzzled me for years. In John 8:58, Jesus says, ‘Before Abraham was, I am,’ and the Jews immediately pick up stones to kill Him. Why such a violent reaction to just three words?"
    },
    {
      "speaker": "David",
      "text": "Sarah, that’s the perfect question to unlock a massive mystery in the Old Testament. Those three words weren’t just a statement—they were a declaration of divinity. To understand why the Jews reacted that way, we need to go back over a thousand years to a burning bush in Exodus 3. Hold on to that thought, because this is going to shift everything."
    },
    {
      "speaker": "Sarah",
      "text": "Wait, what? A burning bush? I’m already intrigued. Lay out the foundation for me—how do we even start connecting these dots?"
    },
    {
      "speaker": "David",
      "text": "Let’s start with the big picture. The Old Testament isn’t just a history book; it’s a testimony of Jesus Christ as Jehovah, the God of Israel. When we read it, we can look at it from three perspectives: the ancient Israelites who lived it, Christ Himself who spoke as Jehovah, and us as modern Saints with restored truths. Each lens reveals something profound about who He is."
    },
    {
      "speaker": "Sarah",
      "text": "I love that—three perspectives. So, for the ancient Israelites, how did they understand Jehovah? And how does that tie into what Jesus said?"
    },
    {
      "speaker": "David",
      "text": "For the Israelites, Jehovah was the name of God, the great ‘I AM’ revealed to Moses in Exodus 3:14, where God says, ‘I AM THAT I AM.’ That name carried immense power and identity—it was the covenant name of their God. So when Jesus says, ‘Before Abraham was, I am,’ in John 8:58, He’s claiming to be Jehovah Himself. To the Jews, that was blasphemy worthy of stoning because they didn’t accept Him as their God."
    },
    {
      "speaker": "Sarah",
      "text": "That’s fascinating, but also kind of shocking. Let’s dig into this pattern of Jehovah across time. I’m guessing this ‘I AM’ identity doesn’t just stop with Moses or Jesus’ time, right?"
    },
    {
      "speaker": "David",
      "text": "Exactly. Notice this pattern: Jehovah as the ‘I AM’ shows up in multiple dispensations. It starts with Moses at the burning bush in Exodus 3, then echoes in Christ’s declaration in John 8, and even ties into modern revelation. Think about how President Dallin H. Oaks taught that when we read ‘God’ or ‘Lord’ in the scriptures, it’s almost always Jehovah, our risen Lord Jesus Christ. That’s from his talk in the May 2023 Liahona."
    },
    {
      "speaker": "Sarah",
      "text": "I never saw it that way before. So this identity of Jehovah as Jesus spans from ancient Israel to His mortal ministry and even to us today. What’s another spot in the Old Testament where we see this clearly?"
    },
    {
      "speaker": "David",
      "text": "Let’s look at the symbols that point to Him. Take the manna in Exodus 16:4, where God provides bread from heaven for the Israelites. Jesus directly connects this to Himself in John 6:35, saying, ‘I am the bread of life.’ Notice this pattern of divine provision—it’s Jehovah sustaining His people then, and Christ offering spiritual sustenance now."
    },
    {
      "speaker": "Sarah",
      "text": "That’s remarkable! It’s like a thread of divine care woven through time. What about another symbol? I’ve heard of the brass serpent—how does that fit?"
    },
    {
      "speaker": "David",
      "text": "Perfect example. In Numbers 21:8-9, Moses raises a brass serpent on a pole, and those who look to it are healed. Jesus explains in John 3:14 that this symbolizes Him being lifted up on the cross. It’s Jehovah again, showing the way to salvation across dispensations."
    },
    {
      "speaker": "Sarah",
      "text": "I’m seeing this web forming. These aren’t just isolated stories—they’re pointing to Christ every time. Let’s add some historical context here. What do we know about how the ancient Israelites viewed these symbols in their day?"
    },
    {
      "speaker": "David",
      "text": "Great question. Archaeologically, we know that ancient Israel lived in a world full of serpent imagery—often tied to healing or protection in Near Eastern cultures. But for them, the brass serpent wasn’t just a cultural symbol; it was a direct command from Jehovah, a test of faith. What most people don’t know is that later, this same serpent became an idol called Nehushtan, which King Hezekiah had to destroy because it distracted from true worship, as noted in 2 Kings 18:4."
    },
    {
      "speaker": "Sarah",
      "text": "Wait, so a symbol of Christ became an idol? That’s a powerful cautionary tale. What’s another historical insight that brings this time period to life?"
    },
    {
      "speaker": "David",
      "text": "Here’s where it gets fascinating. Ancient covenant-making often involved physical tokens or markers, like altars or sacrifices, to seal promises with God. When we read about covenants in the Old Testament, like in Exodus 19:5 where God calls Israel His ‘peculiar treasure,’ it’s rooted in a culture where covenants were tangible, communal acts. This helps us understand why the Old Testament emphasizes rituals and symbols so much—they were living reminders of Jehovah’s promises."
    },
    {
      "speaker": "Sarah",
      "text": "That creates such a time collapse moment for me. I can almost feel how real those covenants were to them, just like ours are today at the temple. Now, let’s circle back to that mystery with Jesus’ words. How does all this resolve the reaction of the Jews in John 8?"
    },
    {
      "speaker": "David",
      "text": "Here’s the key that unlocks it all. When Jesus says, ‘Before Abraham was, I am,’ He’s not just claiming preexistence—He’s using the sacred name of Jehovah, ‘I AM,’ from Exodus 3:14. To the Jews, this was Him saying, ‘I am the God of your fathers, the God of the burning bush.’ That’s why they wanted to stone Him—it was either the ultimate truth or the ultimate blasphemy."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a huge ‘aha’ moment. It’s not just about the words; it’s about the identity behind them. I’m blown away by how this connects across centuries."
    },
    {
      "speaker": "David",
      "text": "And there’s more. Notice this hidden connection: in modern revelation, the Book of Abraham restores truths about Jehovah’s premortal identity. In Abraham 3:22-28, we see Christ as the chosen one in the council in heaven. It’s a direct link from Old Testament Jehovah to the premortal Christ we understand today."
    },
    {
      "speaker": "Sarah",
      "text": "I’ve never put those pieces together. So we’ve got Exodus, John, and now Abraham all pointing to the same truth. What’s another cross-reference most people might miss?"
    },
    {
      "speaker": "David",
      "text": "Let’s look at Jonah. In Jonah 1:17, he’s in the belly of the whale for three days and nights, and Jesus references this in Matthew 12:40 as a sign of His own death and resurrection. It’s subtle, but Jehovah orchestrates these events in the Old Testament to foreshadow Christ’s mission. It’s like a divine blueprint hidden in plain sight."
    },
    {
      "speaker": "Sarah",
      "text": "That’s incredible. These stories aren’t random—they’re prophetic echoes. How does this tie into the Plan of Salvation overall?"
    },
    {
      "speaker": "David",
      "text": "Here’s where it gets powerful. Every symbol—manna, the brass serpent, Jonah—points to Christ’s role in the Plan of Salvation. They show Jehovah as the Redeemer, the one who provides, heals, and rises again. It’s all about bringing us back to God through covenants, just as Exodus 19:5 promises Israel as His treasure if they obey."
    },
    {
      "speaker": "Sarah",
      "text": "I’m seeing it so clearly now. These aren’t just ancient stories; they’re about our eternal journey. How can we apply this as modern Saints?"
    },
    {
      "speaker": "David",
      "text": "Think about President Russell M. Nelson’s talk on ‘The Everlasting Covenant’ from the October 2022 Liahona. He teaches that covenants are how God shows His special love and mercy. As we study the Old Testament, we can ask: How am I living my covenants? How do these ancient patterns of Jehovah’s care strengthen my faith in Christ today?"
    },
    {
      "speaker": "Sarah",
      "text": "That’s such a grounding thought. It makes the Old Testament feel so personal. I’m starting to see my own covenant relationship with God in a new light."
    },
    {
      "speaker": "David",
      "text": "Exactly. And remember what Elder Dale G. Renlund said in the November 2023 Liahona: ‘Jesus Christ Is the Treasure.’ As we search for Him in these ancient pages, we find the treasure of His love and Atonement in our lives right now."
    },
    {
      "speaker": "Sarah",
      "text": "David, this has been mind-blowing. I feel like we’ve uncovered a map to Christ in the Old Testament. I’d love for our listeners to join us in this journey—look for Jehovah in every story and symbol as you read. How about you, David? Any final invitation?"
    },
    {
      "speaker": "David",
      "text": "Absolutely, Sarah. I invite everyone to pick one symbol we discussed—maybe the manna or the brass serpent—and study it with the question: How does this point me to Christ? Let the Old Testament be a lamp to your feet, as Psalm 119:105 says, guiding you to Him."
    },
    {
      "speaker": "Sarah",
      "text": "Beautifully said. Thank you, David, for helping us see Jesus Christ as Jehovah in such a powerful way. We’ll see you all next time on the Come Follow Me Podcast."
    }
  ],
  "host": "Sarah",
  "guest": "David",
  "voices": {
    "Sarah": "aoede",
    "David": "enceladus"
  },
  "generated_timestamp": "2026-01-04 19:43:19",
  "source_week_file": "cfm_2026_week_01.json"
}