{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "connected",
  "duration_estimate": "~8.6 minutes",
  "word_count": 1287,
  "character_count": 7353,
  "segment_count": 26,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’m so excited to kick off this year with an introduction to the Old Testament. It can feel a bit daunting for some, with its ancient context and sometimes unfamiliar stories. What are your initial thoughts as we dive into this sacred text?"
    },
    {
      "speaker": "David",
      "text": "Oh, I’m thrilled, Sarah. Yes, the Old Testament can seem intimidating at first with its cultural differences, but I love how it’s ultimately a story of God’s relationship with His people. It’s full of familiar human experiences—joy, struggle, faith, and doubt. And most importantly, it points us to Jesus Christ in such powerful ways."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so true. I’ve been thinking about how the Old Testament constantly testifies of Jesus Christ, even if it’s through symbols and types. For instance, the Come Follow Me manual highlights examples like the manna in Exodus 16, the sacrificial lamb in Exodus 12, and even Jonah’s story. How do you see the Savior in these?"
    },
    {
      "speaker": "David",
      "text": "Those are beautiful examples. Take the manna from Exodus 16:4 and 11-15, where God provides daily bread for the Israelites in the wilderness. Jesus Himself draws that connection in John 6:35 when He says, ‘I am the bread of life: he that cometh to me shall never hunger.’ It shows how He sustains us spiritually, just as manna sustained them physically."
    },
    {
      "speaker": "Sarah",
      "text": "I love that parallel. What about the sacrificial lamb? That one always strikes me as so poignant."
    },
    {
      "speaker": "David",
      "text": "Absolutely, in Exodus 12:3-5, the lamb had to be without blemish, a perfect offering. And in John 1:29, John the Baptist declares, ‘Behold the Lamb of God, which taketh away the sin of the world.’ It’s a direct foreshadowing of Christ’s atoning sacrifice—pure, spotless, and given for us."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautiful. And it’s amazing to think that Jesus is actually Jehovah in the Old Testament, speaking as the voice of God. I was reading President Dallin H. Oaks’ words in the Liahona from May 2023, where he says that the words of ‘God’ or the ‘Lord’ in scripture are almost always the words of Jehovah, our risen Lord. How does that deepen your perspective?"
    },
    {
      "speaker": "David",
      "text": "It’s profound, Sarah. Knowing that Jesus is Jehovah—like when He declares in John 8:58, ‘Before Abraham was, I am’—connects the Old and New Testaments in such a personal way. It’s Him speaking in Exodus 3:13-15, revealing His name as ‘I AM THAT I AM.’ It shows that He’s been guiding His people all along, preparing the way for His mortal ministry."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly! That continuity is so comforting. And building on that, I’m struck by how much the Old Testament teaches us about covenants. The manual references Exodus 19:5, where God calls His people a ‘peculiar treasure’ through covenant. What stands out to you about this theme?"
    },
    {
      "speaker": "David",
      "text": "Covenants are the heartbeat of the Old Testament. That phrase in Exodus 19:5 shows God’s desire to make us His own, to bind us to Him through promises. I also love President Russell M. Nelson’s message in the October 2022 Liahona, ‘The Everlasting Covenant,’ where he teaches that these covenants reveal a special kind of love and mercy. It’s a reminder that God’s commitment to us is eternal, and He invites us into that relationship."
    },
    {
      "speaker": "Sarah",
      "text": "That’s such a powerful way to frame it. And it’s not just in the Old Testament—we see how the Lord restored ‘plain and precious things’ through Joseph Smith to help us understand these covenants better. For example, the Book of Moses gives us insights into Enoch’s city of Zion in Moses 7:18-19. Why do you think these restorations are so valuable?"
    },
    {
      "speaker": "David",
      "text": "They’re invaluable, Sarah. In Moses 7:18, we read about Zion as a place where people were ‘of one heart and one mind, and dwelt in righteousness; and there was no poor among them.’ That’s a vision of covenant living we don’t get in the traditional Genesis account. It shows us what God intends for His covenant people—unity, righteousness, and care for each other."
    },
    {
      "speaker": "Sarah",
      "text": "I love that vision of Zion. It also makes me think of other restorations, like Abraham’s vision of the premortal council in Abraham 3:22-28. That adds so much depth to the Old Testament narrative. How does that connect to our understanding of God’s plan?"
    },
    {
      "speaker": "David",
      "text": "Oh, it’s a game-changer. In Abraham 3:22-23, we learn about the ‘noble and great ones’ chosen before the foundation of the world, including Abraham himself. It ties directly to the covenant God makes with him later—showing that these promises were part of a divine plan from the very beginning. It helps us see our own place in that eternal story."
    },
    {
      "speaker": "Sarah",
      "text": "That’s an ‘aha’ moment for me—seeing how personal and eternal these covenants are. Let’s shift a bit to how this applies to us today. With all these symbols of Christ and covenant teachings, how can studying the Old Testament help us in our modern lives?"
    },
    {
      "speaker": "David",
      "text": "I think it grounds us, Sarah. The Old Testament shows us that God is the same yesterday, today, and forever. Whether it’s finding Christ in the stories, like the brass serpent in Numbers 21:4-10 pointing to His healing power, or learning from covenants, it reminds us that God is still active in our lives. We can turn to Him for sustenance, forgiveness, and guidance just as the ancients did."
    },
    {
      "speaker": "Sarah",
      "text": "So true. And I think it also invites us to look for Christ in everything. Elder Dale G. Renlund’s message in the November 2023 Liahona, ‘Jesus Christ Is the Treasure,’ encourages us to always focus on Him. How can we practically do that as we study this year?"
    },
    {
      "speaker": "David",
      "text": "One way is to actively search for those symbols and types of Christ as we read—like asking, ‘How does this story or law point to the Savior?’ Another is to cross-reference with the New Testament, like pairing the brass serpent with John 3:14, where Jesus says, ‘As Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.’ It’s about making those connections and letting them deepen our faith."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a great approach. I also think it’s about reflecting on how these stories mirror our own struggles and triumphs. The Old Testament figures faced family challenges, moments of doubt, and yet they kept turning to God. It inspires me to do the same."
    },
    {
      "speaker": "David",
      "text": "Exactly. Their faith in a coming Savior, even when they didn’t see Him, can strengthen our faith in the Savior who has come and will come again. It’s a reminder to hold fast to our covenants, trusting in His promises."
    },
    {
      "speaker": "Sarah",
      "text": "What a wonderful perspective to carry into this year of study. As we wrap up, David, what are some key takeaways you hope listeners will hold onto from this introduction to the Old Testament?"
    },
    {
      "speaker": "David",
      "text": "I hope they’ll remember that the Old Testament is a witness of Jesus Christ, from the symbols to the very voice of Jehovah. I also hope they’ll see it as a story of covenants—God’s relentless desire to draw us close. And finally, that it’s a personal invitation to find Him in our own lives through these ancient words."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautifully said. I’d like to invite our listeners to take a few specific steps as they begin this journey. First, read the introduction in the Come Follow Me manual and note one symbol of Christ that stands out to you. Second, ponder Exodus 19:5 and what it means to be God’s ‘peculiar treasure’ through covenants. And third, as Elder Renlund suggests, focus on finding Jesus Christ in your study and in your life. David, thanks so much for this insightful discussion."
    },
    {
      "speaker": "David",
      "text": "Thanks, Sarah. I’m excited to see what the Old Testament reveals to all of us this year."
    }
  ],
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-01 01:07:26",
  "source_week_file": "cfm_2026_week_01.json"
}