{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "duration_estimate": "~8.4 minutes",
  "word_count": 1256,
  "character_count": 8115,
  "segment_count": 62,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "David, let's dive right into a mystery that's shocked readers for centuries. In John 8:58-59, Jesus says just five words: 'Before Abraham was, I am.' And the Jews immediately pick up stones to stone him. Why this explosive reaction to such a simple statement?"
    },
    {
      "speaker": "David",
      "text": "Sarah, those words were no accident—they were a bold claim to divinity. Jesus was directly invoking the sacred name God revealed to Moses in Exodus 3:13-15: 'I AM THAT I AM.' In Hebrew, that's YHWH, the eternal name of Jehovah. To claim 'I am' was to say, 'I am Jehovah God Himself.'"
    },
    {
      "speaker": "Sarah",
      "text": "That's fascinating. So the Jews recognized it as blasphemy unless He truly was that God. But how does Exodus 6:3 fit in? It says God appeared to Abraham, Isaac, and Jacob as God Almighty, but not as Jehovah."
    },
    {
      "speaker": "David",
      "text": "Exactly, it reveals a divine pattern of progressive revelation. The Joseph Smith Translation clarifies in the footnote to Exodus 6:3 that God was known to them by Jehovah but the fullness of that name wasn't fully comprehended until Moses. This sets up Jesus as the same Jehovah speaking throughout the Old Testament."
    },
    {
      "speaker": "Sarah",
      "text": "Hold on—that shifts everything. President Oaks taught that scriptural records of 'God' or 'Lord' are almost always Jehovah, our Savior Jesus Christ. So the Old Testament is filled with Christ's voice?"
    },
    {
      "speaker": "David",
      "text": "Precisely, Sarah. It's like peeling back layers of a mystery. Ancient Israel heard Jehovah's covenants and laws, but now we see it's pre-mortal Christ preparing His people for His mortal ministry."
    },
    {
      "speaker": "Sarah",
      "text": "I love that multi-perspective view: Israel's ancient encounters, Christ's own claims, and our restored understanding. But let's trace a pattern—how does knowing Jesus is Jehovah change how we read symbols that testify of Him?"
    },
    {
      "speaker": "David",
      "text": "Here's where it gets powerful. Moses 6:63 teaches, 'All things have their likeness, and all things are created and made to bear record of me.' Look at manna in Exodus 16:4, 11-15—it's the bread from heaven, just as Jesus declares in John 6:35, 'I am the bread of life.'"
    },
    {
      "speaker": "Sarah",
      "text": "That's remarkable! So everyday provision points to the Savior. What else stands out?"
    },
    {
      "speaker": "David",
      "text": "The sacrificial lamb in Exodus 12:3-5 foreshadows John 1:29: 'Behold the Lamb of God, which taketh away the sin of the world.' Then Numbers 21:4-10's brass serpent lifted up heals those who look—echoed in John 3:14 as Christ's crucifixion."
    },
    {
      "speaker": "Sarah",
      "text": "And Jonah, swallowed for three days in Jonah 1:4-17, prefigures Christ's resurrection, as in Matthew 12:38-41. These aren't coincidences; they're divine patterns across dispensations."
    },
    {
      "speaker": "David",
      "text": "Right, Sarah. From Adam's sacrifices bearing record of Christ, to Abraham's covenant, Moses' symbols, Christ's fulfillment, and restoration through Joseph Smith—it's a thread of redemption woven through time."
    },
    {
      "speaker": "Sarah",
      "text": "Speaking of restoration, the Lord told Nephi in 1 Nephi 13:21-29, 38-42 that plain and precious things were removed from the Bible. How does that connect to our Old Testament study?"
    },
    {
      "speaker": "David",
      "text": "Beautiful question. 2 Nephi 3:12 shows the Bible and Book of Mormon confirming each other. Joseph Smith restored key accounts: Enoch's Zion in Moses 7:18-19, Abraham's council in heaven in Abraham 3:22-28, and Melchizedek's ministry in JST Genesis 14:25-40."
    },
    {
      "speaker": "Sarah",
      "text": "I never connected those as 'plain and precious' restorations. Why are they so vital?"
    },
    {
      "speaker": "David",
      "text": "They reveal the Plan of Salvation in vivid detail—pre-mortal councils, gathering of Zion, priesthood power—all tying back to Jehovah's covenants with ancient prophets."
    },
    {
      "speaker": "Sarah",
      "text": "This builds such anticipation. Now, let's dive into historical context. What made the name Jehovah so sacred to ancient Israel?"
    },
    {
      "speaker": "David",
      "text": "In ancient Near Eastern culture, knowing a god's name gave power and intimacy. Exodus 3 shows Moses at the burning bush, trembling to ask. Jehovah's response, 'I AM THAT I AM,' asserts eternal self-existence—no beginning, no end."
    },
    {
      "speaker": "Sarah",
      "text": "That cultural insight makes it immediate. No wonder Jesus' claim provoked stones. But from Israel's view, Jehovah was their covenant God."
    },
    {
      "speaker": "David",
      "text": "Yes, Exodus 19:5 calls Israel His 'peculiar treasure' through covenant. This echoes across dispensations: Abraham's posterity, Mosaic law, even Jeremiah 31:31-34's new covenant written on hearts."
    },
    {
      "speaker": "Sarah",
      "text": "Pattern emerging—covenants as Jehovah's way to gather His people. How does this resolve our opening mystery?"
    },
    {
      "speaker": "David",
      "text": "It culminates in Christ revealing Himself as that covenant Jehovah. The stoning attempt highlights the veil over His identity, lifted in restoration. Suddenly, the Old Testament pulses with His voice calling us to covenants."
    },
    {
      "speaker": "Sarah",
      "text": "That's the resolution I needed! Now, hidden connections—what most people miss linking Psalms to these?"
    },
    {
      "speaker": "David",
      "text": "Psalm 119:105: 'Thy word is a lamp unto my feet, and a light unto my path.' This light motif traces to divine light in Moses, Christ's light of the world, and D&C temples."
    },
    {
      "speaker": "Sarah",
      "text": "Wait, like Enoch's Zion taken to God's light in Moses 7?"
    },
    {
      "speaker": "David",
      "text": "Exactly. And Abraham 3's intelligences organized under Jehovah's light. It's a Plan of Salvation pattern: from premortal light, through mortal covenants, to eternal glory."
    },
    {
      "speaker": "Sarah",
      "text": "Profound. Elder Renlund urges focusing on Jesus as the treasure. How do these symbols do that?"
    },
    {
      "speaker": "David",
      "text": "They transform reading: every symbol whispers Christ. Isaiah 53:3-9's suffering servant, Psalm 23's shepherd— all Jehovah leading to Atonement."
    },
    {
      "speaker": "Sarah",
      "text": "Isaiah 7:14 and 9:6 foretell the virgin birth and Prince of Peace. Even children can see baby Jesus there."
    },
    {
      "speaker": "David",
      "text": "And covenants for children: baptism like Mosiah 18:10, temple promises. President Nelson's 'The Everlasting Covenant' ties it all—special love and mercy for covenant keepers."
    },
    {
      "speaker": "Sarah",
      "text": "That's modern convergence. Pioneer sacrifices mirrored ancient covenants, now ours in daily discipleship."
    },
    {
      "speaker": "David",
      "text": "Notice the typology: lamb's blood on doorposts saves firstborn, Christ's blood saves us eternally. Cultural insight—Passover lamb without blemish, inspected publicly, just as Christ was."
    },
    {
      "speaker": "Sarah",
      "text": "Archaeological echoes make it real. Brass serpent on pole—ancient healing symbols, but Christ elevates it to faith in Him."
    },
    {
      "speaker": "David",
      "text": "Yes, Numbers 21's context: Israelites murmuring, bitten by serpents, healed by looking. Parallels sin's bite, looking to cross."
    },
    {
      "speaker": "Sarah",
      "text": "Jonah's three days in the fish—resurrection type, tied to Nineveh's repentance. Cross-reference web is stunning."
    },
    {
      "speaker": "David",
      "text": "And manna gathered daily teaches reliance on Jehovah daily, like manna from heaven."
    },
    {
      "speaker": "Sarah",
      "text": "These connections change everything. How do we teach this pattern to others?"
    },
    {
      "speaker": "David",
      "text": "Start with questions like our hook. Use visuals: pictures of Isaiah foretelling Christ. Sing 'Seek the Lord Early' or 'When I Am Baptized' for covenants."
    },
    {
      "speaker": "Sarah",
      "text": "Perfect for families. Now, generational mapping—from Adam learning sacrifices, to Abraham's altar, Moses' tabernacle."
    },
    {
      "speaker": "David",
      "text": "To Christ's temple body, restoration temples. Each dispensation builds the same covenant path home."
    },
    {
      "speaker": "Sarah",
      "text": "JST restores Adam's full understanding, linking sacrifices to Christ explicitly."
    },
    {
      "speaker": "David",
      "text": "Moses 5 shows it. Plain and precious indeed."
    },
    {
      "speaker": "Sarah",
      "text": "What about Melchizedek? JST Genesis 14 shows his city of Salem becoming Zion."
    },
    {
      "speaker": "David",
      "text": "Order of Melchizedek priesthood, high priesthood after Son of God. Echoes Enoch, prepares for Christ's."
    },
    {
      "speaker": "Sarah",
      "text": "Priesthood pattern across dispensations. This is scriptural detective work at its best."
    },
    {
      "speaker": "David",
      "text": "Sarah, here's a deeper layer: Exodus 6:3's JST footnote reveals God as Jehovah from the beginning, but manifest progressively."
    },
    {
      "speaker": "Sarah",
      "text": "Resolves apparent contradictions. Modern prophets like Oaks confirm it."
    },
    {
      "speaker": "David",
      "text": "Yes, 'hear Him' from the Father points to Jehovah's words as Christ's."
    },
    {
      "speaker": "Sarah",
      "text": "Applying today: as we study Old Testament, watch for covenants making us peculiar treasure."
    },
    {
      "speaker": "David",
      "text": "Jeremiah 31 promises inward law, fulfilled in baptism, sacrament, temple."
    },
    {
      "speaker": "Sarah",
      "text": "President Nelson teaches covenants bring mercy amid trials, like ancient saints."
    },
    {
      "speaker": "David",
      "text": "Family joy, discord, faith—universal, pointing to Savior."
    },
    {
      "speaker": "Sarah",
      "text": "Despite intimidating ancient culture, familiar gospel themes emerge."
    },
    {
      "speaker": "David",
      "text": "Enoch wept for worlds, but rejoiced in Zion—hope amid destruction."
    },
    {
      "speaker": "Sarah",
      "text": "Abraham's council shows premortal us choosing covenants."
    },
    {
      "speaker": "Sarah",
      "text": "This hooks me for the year. Listeners, notice Jehovah everywhere."
    },
    {
      "speaker": "David",
      "text": "Look for symbols, covenants, His voice. Transform your study."
    },
    {
      "speaker": "Sarah",
      "text": "Thanks, David. Dive into the Old Testament this week—find Christ as Jehovah."
    },
    {
      "speaker": "David",
      "text": "Until next time, keep seeking those plain and precious truths."
    },
    {
      "speaker": "Sarah",
      "text": "See you soon on the Come Follow Me Podcast."
    }
  ],
  "host": "Sarah",
  "guest": "David",
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-10 22:29:43",
  "source_week_file": "cfm_2026_week_01.json"
}