{
  "week_number": 7,
  "title": "Week 7: February 9–15 - Genesis 6–11; Moses 8",
  "date_range": "February 9–15",
  "study_level": "scholarly",
  "duration_estimate": "~11.2 minutes",
  "word_count": 1679,
  "character_count": 9664,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a windswept hill, watching dark clouds gather on the horizon as a man named Noah, undeterred by the mocking voices around him, drives another nail into a massive wooden ark. The air is thick with tension, not just from the coming storm, but from a world steeped in corruption and violence—a world so far from God that it seems beyond saving. Yet, in this very moment, we read in Moses 8:27 that “Noah found grace in the eyes of the Lord.” What does it mean to find grace in a world of wickedness? How does one man’s faith stand as a beacon against such overwhelming darkness? Today, as we dive into Genesis 6 through 11 and Moses 8, we’ll explore the stories of Noah, the Flood, and the Tower of Babel—not just as ancient history, but as piercingly relevant lessons for our own latter days, where, as the Savior Himself warned, conditions will mirror those of Noah’s time before His return.\n\nLet’s begin by stepping into Noah’s world. In Moses 8:28, we’re told that “the earth was corrupt before God, and it was filled with violence.” This isn’t just a passing description—it’s a chilling echo of our own day, isn’t it? Think about the headlines you see, the discord that seems to permeate so much of society. As you read Moses 8:15–24, notice the specific sins that grieved the Lord: the daughters of men marrying outside the covenant, hearts turned from righteousness, and a refusal to hearken to God’s voice. It’s a sobering parallel to the Savior’s prophecy in Joseph Smith—Matthew 1:41, where He says, “As it was in the days of Noah, so it shall be also at the coming of the Son of Man.” So, what can we learn from Noah’s example? How do we find grace, as he did, amidst corruption? Pause to let that resonate. Consider the state of your own heart—are there influences or choices pulling you away from the Lord’s voice?\n\nOne powerful answer lies in the role of a prophet. Noah wasn’t just a righteous man; he was God’s chosen mouthpiece. In Moses 8:16, we read that “Noah prophesied, and taught the things of God, even as it was in the beginning.” Despite the world’s rejection, he persistently called them to repentance, warning of the coming destruction. Does this not mirror the role of our living prophet today? Though we’re not building an ark or preparing for a literal flood, our prophet warns us of spiritual dangers—cultural shifts, moral decay, and the subtle ways Satan seeks to bind us. Elder Allen D. Haynie has taught, “A perfect and loving Father in Heaven has chosen the pattern of revealing truth to His children through a prophet.” Reflect on that for a second. How has following prophetic counsel brought safety or clarity to your life? Perhaps you can think of a recent general conference message that felt like a personal warning or invitation. Take a moment to ponder one specific counsel from our prophet that you feel drawn to act on—maybe it’s strengthening your family through home-centered gospel learning or heeding a call to gather Israel. The pattern is clear: just as Noah’s voice was a lifeline in his day, so is the prophet’s voice in ours.\n\nBuilding on that truth, let’s consider the Flood itself—not as a mere act of destruction, but as an expression of divine mercy. Some might question the justice of God in sending the Flood, as described in Genesis 6:7, where the Lord says, “I will destroy man whom I have created from the face of the earth.” But Elder Neal A. Maxwell provides profound perspective, explaining that “corruption had reached an agency-destroying point that spirits could not, in justice, be sent here.” Think about that. The Flood wasn’t just judgment; it was protection—protection for future generations who would otherwise inherit a world devoid of choice or hope. Read Genesis 6:5–13 and notice the Lord’s grief over the wickedness of man, how “every imagination of the thoughts of his heart was only evil continually.” Yet, even in this, His mercy shines through—He preserves Noah and his family to carry forward the covenant. Isn’t this a pattern of God’s love? Even when the world seems irredeemable, He provides a way for the faithful to endure. Let that truth settle in your heart. How have you seen God’s mercy in moments of personal or societal darkness?\n\nThis brings us to a beautiful symbol of that mercy—the rainbow. After the Flood, in Genesis 9:12–17, the Lord establishes the rainbow as “the token of the covenant which I make between me and you and every living creature that is with you, for perpetual generations.” It’s a reminder that God will never again destroy the earth by flood. But the Joseph Smith Translation adds even deeper meaning. In JST, Genesis 9:21–25, found in the Bible appendix, the Lord ties the rainbow to the promise of the Second Coming, saying that it will be a sign that “I will look upon it, that I may remember the everlasting covenant, which I made unto thy father Enoch; that, when men should keep all my commandments, Zion should again come on the earth.” Isn’t that striking? The rainbow isn’t just a reminder of past mercy; it points to future redemption. Think about other tokens or symbols in your life that recall your covenants—perhaps the sacrament emblems, a temple garment, or even a simple family heirloom tied to a spiritual promise. How do these symbols anchor you to God’s promises? Take a quiet moment to consider one symbol that holds special meaning for you and how it draws you closer to Him.\n\nNow, let’s shift our gaze to another story in these chapters—the Tower of Babel, found in Genesis 11:1–9. Here we see a people united in language and purpose, but tragically misdirected. They declare, “Let us build us a city and a tower, whose top may reach unto heaven; and let us make us a name, lest we be scattered abroad upon the face of the whole earth.” Notice their motive—it’s not to seek God, but to elevate themselves. Helaman 6:28 reveals the deeper influence behind this act, stating that “it was that same being who led on the people who came from that tower against the Lord; and it was that same being who did plot to destroy the people of God.” Satan’s hand is evident in their pride. Contrast this with the people of Zion under Enoch, whom we read about in Moses 7:18–19, where “the Lord called his people Zion, because they were of one heart and one mind, and dwelt in righteousness.” While Babel sought heaven through human achievement, Zion reached God through unity in righteousness. What a powerful lesson for us. How often do we, even unintentionally, build our own “towers”—relying on worldly success, personal acclaim, or self-sufficiency to find meaning, instead of turning to the Savior?\n\nThis contrast leads us to a central truth: following Jesus Christ is the only way to Heavenly Father. In John 3:16, we’re reminded that “God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” Unlike the tower builders, we don’t need to construct our own path to heaven—God has provided the way through His Son. Helaman 3:28 reinforces this, declaring that “the gate of heaven is open unto all, even to those who will believe on the name of Jesus Christ, who is the Son of God.” And in 2 Nephi 31:20–21, Nephi teaches that we must press forward with a steadfastness in Christ, enduring to the end, for “this is the way; and there is none other way nor name given under heaven whereby man can be saved in the kingdom of God.” Reflect on that for a second. Where in your life might you be building a “tower” of self-reliance instead of trusting in the Savior’s path? How can you more fully surrender to His way?\n\nAs we draw these stories together, notice how they weave a tapestry of warning and hope for our latter days. Noah’s faithfulness amidst a corrupt world teaches us to cling to prophetic guidance, even when it’s unpopular. The Flood reminds us of God’s justice balanced with mercy, preserving the faithful through unimaginable trials. The rainbow stands as a token of His covenant, pointing us toward the ultimate redemption of Zion. And the Tower of Babel warns against prideful self-sufficiency, urging us to seek heaven through Christ alone. These ancient accounts aren’t just relics of the past—they’re mirrors reflecting our own challenges and divine invitations to rise above them. Take a quiet moment to consider how these lessons apply to your life right now. What is one area where you feel called to greater faithfulness, whether it’s heeding the prophet, trusting in God’s mercy, or realigning your priorities to Christ’s path?\n\nI invite you to carry these reflections forward in specific ways. First, set aside time this week to study a recent message from our living prophet—perhaps in the Gospel Library under Teachings of Presidents of the Church or a general conference talk. Write down one warning and one invitation that stand out to you, and prayerfully consider how to act on them. Second, ponder the symbols of your covenants—maybe during the sacrament or while gazing at a rainbow in the sky—and let them deepen your commitment to the Lord. Third, discuss these stories with your family or a friend. Ask how following the prophet or trusting in Christ has blessed their lives, and share your own insights. Finally, take a moment in the temple or in personal prayer to seek the Savior’s guidance on letting go of any “towers” of pride or self-reliance in your heart. As you do, may you feel the same grace that Noah found in the eyes of the Lord, guiding you safely through the storms of our day toward the promised redemption of Zion.",
  "generated_timestamp": "2025-12-26 20:20:52",
  "source_week_file": "cfm_2026_week_07.json"
}