{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~4.5 minutes",
  "word_count": 674,
  "character_count": 4048,
  "segment_count": 30,
  "script": [
    {
      "speaker": "David",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "And I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "Sarah, I have a question that's puzzled people for years. Why did the Jews try to stone Jesus just for saying three simple words: 'Before Abraham was, I am'? What was so shocking about that?"
    },
    {
      "speaker": "Sarah",
      "text": "That's a great hook, David. Those words directly echo what God told Moses at the burning bush in Exodus 3:13–15. Jesus was claiming to be Jehovah, the God of the Old Testament."
    },
    {
      "speaker": "David",
      "text": "Wait, so Jesus is Jehovah? That changes everything I thought I knew about the Old Testament."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly. President Dallin H. Oaks taught that the scriptural records of words spoken by 'God' or the 'Lord' are almost always the words of Jehovah, our risen Lord, Jesus Christ. From the ancient Israelite perspective, Jehovah was their God who delivered them from Egypt and gave the law."
    },
    {
      "speaker": "David",
      "text": "Fascinating. But from Christ's view, He's revealing His eternal identity. How does the restoration make this plain?"
    },
    {
      "speaker": "Sarah",
      "text": "In the restoration, we see it clearly. The Father introduced the Son as our Savior, but Jehovah's voice in the Old Testament is Christ's. The Joseph Smith Translation and other revelations restore these plain and precious truths."
    },
    {
      "speaker": "David",
      "text": "Let's trace this Jehovah theme. Start with Exodus—God says to Moses, 'I AM THAT I AM.' Then Jesus says 'I am' and they pick up stones."
    },
    {
      "speaker": "Sarah",
      "text": "Yes, and notice the pattern across dispensations. In Moses 6:63, the Lord says all things bear record of Him. Jehovah appears to Adam, to Abraham, and speaks through prophets."
    },
    {
      "speaker": "David",
      "text": "Hold on, so every time we read 'the Lord spake,' it's Jesus? That's profound."
    },
    {
      "speaker": "Sarah",
      "text": "Precisely. Now, look at symbols that testify of Him right from the start. Take manna in Exodus 16:4, 11–15—the bread from heaven. Jesus calls Himself the Bread of Life in John 6:35."
    },
    {
      "speaker": "David",
      "text": "I see it! Manna sustained Israel daily, pointing to Christ sustaining us spiritually."
    },
    {
      "speaker": "Sarah",
      "text": "And it continues: the sacrificial lamb in Exodus 12:3–5 foreshadows the Lamb of God in John 1:29. Then the brass serpent in Numbers 21:4–10, which Jesus references in John 3:14."
    },
    {
      "speaker": "David",
      "text": "The pattern is everywhere. What about Jonah? Jonah 1:4–17 parallels Matthew 12:38–41."
    },
    {
      "speaker": "Sarah",
      "text": "Spot on. Jonah in the fish for three days mirrors Christ's resurrection. These aren't coincidences—they're divine patterns pointing to the Savior across time."
    },
    {
      "speaker": "David",
      "text": "For historical context, ancient Israel saw these as literal miracles from Jehovah. What made them feel so immediate back then?"
    },
    {
      "speaker": "Sarah",
      "text": "Imagine wilderness survival—manna appearing each morning was God's covenant provision. Archaeologically, we know manna-like substances exist, but this was miraculous, tied to obedience, much like our sacrament today."
    },
    {
      "speaker": "David",
      "text": "That's remarkable. So the mystery resolves: Jesus' 'I am' wasn't blasphemy—it was truth. He was Jehovah all along."
    },
    {
      "speaker": "Sarah",
      "text": "Yes! The Jews understood Exodus 6:3–5, where God says He appeared to Abraham, Isaac, and Jacob as God Almighty, but to Moses as Jehovah. Jesus unites it all."
    },
    {
      "speaker": "David",
      "text": "Now, hidden connections: Nephi saw plain and precious things removed from the Bible in 1 Nephi 13:21–29. The Book of Moses restores Enoch's Zion in Moses 7:18–19."
    },
    {
      "speaker": "Sarah",
      "text": "And Abraham's council in heaven, Abraham 3:22–28. These show Jehovah's role in the premortal plan, linking Old Testament to our covenants."
    },
    {
      "speaker": "David",
      "text": "Covenants! The Old Testament is God making us His 'peculiar treasure' in Exodus 19:5."
    },
    {
      "speaker": "Sarah",
      "text": "Right, the everlasting covenant to prophets like Abraham. President Russell M. Nelson teaches it brings special love and mercy as we keep it."
    },
    {
      "speaker": "David",
      "text": "How does this apply today? These symbols make the plan of salvation vivid."
    },
    {
      "speaker": "Sarah",
      "text": "Elder Dale G. Renlund urges us to focus on Jesus Christ as the treasure. In the Old Testament, we see Him in every page, strengthening our covenants."
    },
    {
      "speaker": "David",
      "text": "This year, as we study, we'll uncover more. Notice these patterns in your reading."
    },
    {
      "speaker": "Sarah",
      "text": "Start by asking: How does this testify of Christ? It transforms the ancient words into personal light, like Psalm 119:105—'Thy word is a lamp unto my feet.'"
    },
    {
      "speaker": "David",
      "text": "Thanks, Sarah. Listeners, dive into the Old Testament this week—look for Jehovah, the symbols, the covenants. You won't see it the same way again."
    },
    {
      "speaker": "Sarah",
      "text": "Can't wait to explore more together. God bless your study."
    }
  ],
  "host": "David",
  "guest": "Sarah",
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-10 22:28:48",
  "source_week_file": "cfm_2026_week_01.json"
}