{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "scholarly",
  "duration_estimate": "~11.7 minutes",
  "word_count": 1762,
  "character_count": 9924,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, the vast expanse of creation unfolding before your eyes—mountains, rivers, stars, and countless souls stretching into eternity. This is the scene Moses beheld as he conversed with God face to face, as recorded in Moses 1. In that sacred moment, he wasn’t just seeing the works of God; he was learning who he is, who God is, and why this magnificent creation exists. Today, as we dive into Moses 1 and Abraham 3, we’re invited to stand on that same spiritual summit. What would it mean for you to truly see yourself as God sees you? Let’s explore these revelations together and uncover the divine truths that shape our identity and purpose.\n\nLet’s begin with Moses 1, where the Lord speaks directly to Moses in verse 4, saying, “Behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands.” Pause to let that resonate. God doesn’t just call Moses a servant or a prophet—He calls him “my son.” This isn’t merely a title; it’s a declaration of identity, a reminder of divine relationship. A few verses later, in Moses 1:6, the Lord reinforces this, saying, “And I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten; and mine Only Begotten is and shall be the Savior, for he is full of grace and truth.” Here, God not only affirms Moses’s sonship but connects him to the Savior, Jesus Christ, highlighting a pattern of divine purpose. Each of us, like Moses, is a child of God, created in the image of the Savior, with a work to do in His kingdom. Have you ever considered what specific work God might have for you? How does knowing you are His child change the way you see your daily choices?\n\nThis truth of identity stands in stark contrast to the voice of the adversary. In Moses 1:12, after Moses has experienced this glorious vision, Satan comes tempting, saying, “Moses, son of man, worship me.” Notice the deliberate distortion. Where God declares, “thou art my son,” Satan reduces Moses to a mere “son of man,” stripping away his divine heritage. This tactic reveals a profound truth: the adversary’s primary aim is to obscure who we really are. If he can make you forget your identity as a child of God, he can influence your decisions and lead you away from your divine destiny. Reflect on that for a second. How often do the voices of the world or temptation try to redefine who you are, labeling you by your failures, your doubts, or your circumstances? Moses’s response in verse 13 is instructive: “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?” Moses clings to the truth of his identity, and it becomes his shield. What can you do to hold fast to your divine identity when temptation or doubt creeps in?\n\nBuilding on that vision, let’s consider how Moses resists Satan’s counterfeits. In Moses 1:15, Moses declares, “I can judge between thee and God; for God said unto me: Worship God, for him only shalt thou serve.” He discerns the difference between the genuine power and glory of God and the hollow imitation offered by Satan. This discernment is vital for us today. Satan often presents counterfeits—false sources of happiness, distorted versions of truth, or fleeting pleasures that mimic God’s promises. Think about the counterfeits you encounter. Maybe it’s the lure of validation through social media instead of seeking God’s approval, or the temptation to prioritize worldly success over spiritual growth. How can you, like Moses, judge between these counterfeits and the real thing? In verse 18, after repeated attempts by Satan, Moses calls upon God, saying, “I will not cease to call upon God, I have other things to inquire of him.” This persistence in prayer and focus on God’s will ultimately leads to Satan’s departure. Take a quiet moment. When have you felt the strength to resist temptation by turning to the Lord in prayer?\n\nThis pattern of resisting Satan leads us to a deeper understanding of God’s purpose for us, revealed in Moses 1:39, where the Lord declares, “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” Let that truth settle in your heart. God’s entire work—every creation, every commandment, every act of mercy—centers on helping you and me achieve eternal life, which is more than just living forever; it’s living with Him in a state of endless joy and progression. Immortality is the gift of resurrection, given to all through Jesus Christ, but eternal life is the quality of life God lives, offered to those who follow His Son. How does this focus of God’s work shape the way you view your challenges and opportunities? Notice how this purpose connects to the vision Abraham receives in Abraham 3, where the Lord shows him the premortal existence of spirits. In Abraham 3:24-25, the Lord explains, “We will make an earth whereon these may dwell; and we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” The earth isn’t just a random creation; it’s a testing ground, a place where we, as God’s children, can grow through choice and obedience toward eternal life. What does it mean to you that your life on earth is part of God’s deliberate plan to help you become like Him?\n\nLet’s linger in Abraham 3 for a moment, because it unveils truths about our premortal life that anchor our sense of purpose. In Abraham 3:22-23, we read, “Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones; and God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born.” Pause and reflect on that. Before this earth was even formed, you existed as a spirit, known and loved by God. Some, like Abraham, were chosen for specific roles, but all of us were prepared for this mortal journey. This isn’t just ancient history; it’s your story. How does knowing you lived with God before this life influence the way you face trials or make decisions today? In verse 25, the purpose of this earthly test is clarified: to prove if we will do all things the Lord commands. Every choice you make is part of that proving process, an opportunity to align your will with His.\n\nThis premortal perspective also reveals the central role of Jesus Christ. In Abraham 3:27, when the Lord asks, “Whom shall I send?” one answers, “Here am I, send me.” This is the premortal Christ, volunteering to be our Savior, to redeem us from sin and death. His willingness contrasts sharply with another who sought to destroy agency and take God’s glory. Christ’s role as the Chosen One, foreordained before the foundation of the world, ties directly to God’s work and glory in Moses 1:39. He is the means by which immortality and eternal life are brought to pass. Think about that for a moment. How does the Savior’s premortal commitment to you deepen your gratitude for His Atonement? How can you honor that commitment by choosing to follow Him now?\n\nAs we weave these truths together, let’s consider how they apply to our lives. Knowing you are a child of God, with a premortal history and a divine destiny, should influence every decision, every interaction. President Russell M. Nelson has taught that the way you think about who you really are affects almost every choice you make. So, what choices are you making because your identity as a child of God comes first? Maybe it’s how you treat others, recognizing them as fellow children of God. Maybe it’s prioritizing prayer and scripture study to stay connected to your Heavenly Father. Or perhaps it’s resisting the counterfeits of the world by seeking the Lord’s guidance, as Moses did. Take a moment to ponder a specific choice you’re facing. How would remembering your divine identity guide you in that decision?\n\nLet’s also reflect on the work God has for each of us. In Moses 1:6, God told Moses he had a work to do, just as He has a work for you. That work might be in your family, your community, or your personal growth in becoming more like Christ. Cross-referencing this with Doctrine and Covenants 11:20, the Lord says, “Behold, this is your work, to keep my commandments, yea, with all your might, mind and strength.” Obedience, love, and service are at the heart of our work. How can you seek to understand the specific work God has for you right now? What steps can you take to align your life more fully with His purposes?\n\nAs we close, let’s stand once more on that spiritual mountaintop with Moses and Abraham, gazing at the grand scope of God’s plan. You are a child of God, known and loved before the world was, entrusted with a mortal journey to prove your willingness to follow Him. God’s work and glory center on you—on bringing you home to eternal life through His Son, Jesus Christ. Let that truth fill your heart with hope and determination. I invite you to take time this week to ponder your divine identity. Write down choices you can make to prioritize being a child of God above all other labels. Study Moses 1 and Abraham 3 again, looking for personal messages from the Lord about who you are and what He desires for you. Discuss with your family or a trusted friend how knowing you lived as a spirit before this earth influences your perspective on life. And finally, spend a quiet moment in the temple or in prayer, asking Heavenly Father to help you discern the work He has for you. As you do these things, may you feel His love and guidance drawing you closer to Him, step by step, toward the eternal life He longs to share with you.",
  "generated_timestamp": "2026-01-01 00:02:58",
  "source_week_file": "cfm_2026_week_02.json"
}