{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "connected",
  "duration_estimate": "~10.1 minutes",
  "word_count": 1514,
  "character_count": 8941,
  "segment_count": 37,
  "script": [
    {
      "speaker": "David",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "And I'm Sarah. Happy to be here!"
    },
    {
      "speaker": "David",
      "text": "Sarah, I’ve got to start with something that’s been nagging at me. In Moses 1:12, Satan comes to Moses after this incredible vision of God and says, 'Moses, son of man, worship me.' Why does Satan use that specific phrase, 'son of man,' when just moments earlier God called Moses 'my son' in verse 4? What’s the deeper game here?"
    },
    {
      "speaker": "Sarah",
      "text": "Oh, David, that’s the perfect question to unlock a profound truth. Satan isn’t just tempting Moses; he’s attacking his very identity. Notice this pattern—God affirms Moses as 'my son' in Moses 1:4 and 6, establishing a divine relationship, while Satan immediately counters with 'son of man,' trying to reduce him to a mere mortal. It’s a deliberate attempt to strip away the divine destiny God just revealed."
    },
    {
      "speaker": "David",
      "text": "Wait, what? So this isn’t just a random insult—it’s a calculated strike at who Moses is? That’s chilling. How does this play into what happens next?"
    },
    {
      "speaker": "Sarah",
      "text": "Exactly, it’s strategic. Satan wants Moses to forget the truth God spoke—that he’s a child of God with a divine purpose. If Moses doubts his identity, he’s vulnerable. Let’s hold that thought and look at how this identity clash echoes through different perspectives—ancient Israel, Christ’s time, and ours today."
    },
    {
      "speaker": "David",
      "text": "I’m hooked already. Let’s start with ancient Israel. How would Moses and his people have understood this identity struggle?"
    },
    {
      "speaker": "Sarah",
      "text": "For ancient Israel, identity was everything. They saw themselves as God’s covenant people, chosen and set apart. When God tells Moses, 'Thou art my son' in Moses 1:4, it’s not just personal—it’s a reminder of Israel’s collective identity as children of the covenant. Satan’s attack on Moses mirrors the constant pull they felt to forget that and blend into surrounding cultures."
    },
    {
      "speaker": "David",
      "text": "Fascinating. So it’s almost like Satan is trying to erase their spiritual heritage. What about in Christ’s time? How does this identity theme show up there?"
    },
    {
      "speaker": "Sarah",
      "text": "In Christ’s time, we see this same battle over identity in a powerful way. Think of Matthew 4:1-11, where Satan tempts Jesus in the wilderness. Just as with Moses, Satan questions Jesus’ divine sonship with 'If thou be the Son of God.' It’s the same tactic—undermine the divine identity to weaken resolve."
    },
    {
      "speaker": "David",
      "text": "That’s remarkable! I never connected those two moments before. So this pattern of attacking identity spans dispensations. How does it look in our modern context?"
    },
    {
      "speaker": "Sarah",
      "text": "Today, it’s just as relevant. President Russell M. Nelson has taught that the first thing the Lord wants us to understand is our true identity as children of God. In his devotional 'Choices for Eternity,' he says, 'The way you think about who you really are affects almost every decision you will ever make.' Satan still tries to make us forget that through worldly labels or doubts."
    },
    {
      "speaker": "David",
      "text": "That’s a time collapse moment right there—ancient and modern struggles merging into one. Let’s trace this identity theme further. Where else do we see it across dispensations?"
    },
    {
      "speaker": "Sarah",
      "text": "Let’s look at Abraham 3:22-23. Here, Abraham sees the premortal spirits and learns that among them were 'noble and great ones,' including himself, chosen before the world was. This reinforces the divine identity theme—our worth and purpose were established long before earth life. It’s a direct counter to Satan’s lie in Moses 1:12."
    },
    {
      "speaker": "David",
      "text": "So we’ve got Moses, Abraham, Christ, and us today—all tied to this idea of divine identity. That’s a powerful web. Is there another layer to this pattern?"
    },
    {
      "speaker": "Sarah",
      "text": "Absolutely. Notice this in Moses 1:39, where God declares, 'For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.' Our identity as children of God isn’t just a title; it’s tied to His purpose for us—eternal life. That’s the ultimate stakes of this battle with Satan."
    },
    {
      "speaker": "David",
      "text": "I’m seeing it now. Satan’s attack on identity isn’t just personal—it’s an attempt to derail God’s entire plan. That’s mind-blowing. Let’s dive into some historical context. What do we know about the culture of Moses’ time that adds depth here?"
    },
    {
      "speaker": "Sarah",
      "text": "In Moses’ era, around the 13th or 14th century BC, identity was deeply tied to lineage and divine favor in the ancient Near East. To be called a 'son' of a god was a claim to authority and protection—think of Egyptian pharaohs claiming divine sonship. So when God calls Moses 'my son' in Moses 1:4, it’s a radical affirmation of his divine backing against Pharaoh’s false claims."
    },
    {
      "speaker": "David",
      "text": "That’s incredible. It’s not just a spiritual title—it’s a cultural power statement. What about another historical angle? Is there more that shifts our understanding?"
    },
    {
      "speaker": "Sarah",
      "text": "Yes, consider the archaeological evidence of ancient Israelite inscriptions, like the Kuntillet Ajrud findings from the 8th century BC, which mention Yahweh and His covenant relationship with Israel. This shows how central the idea of being God’s people was to their identity, even centuries after Moses. Satan’s attack in Moses 1:12 would have felt like a direct assault on that sacred bond."
    },
    {
      "speaker": "David",
      "text": "That’s another layer of depth. It’s like Satan is trying to sever a covenantal lifeline. Let’s circle back to that opening mystery. Why 'son of man'? What’s the big reveal here?"
    },
    {
      "speaker": "Sarah",
      "text": "Here’s where it gets powerful. By calling Moses 'son of man' in Moses 1:12, Satan is not only denying his divine sonship but also echoing a phrase often used in the Old Testament to emphasize human frailty and mortality—think Ezekiel being called 'son of man' over 90 times. Satan is saying, 'You’re nothing special, just dust,' directly contradicting God’s affirmation of eternal worth and purpose."
    },
    {
      "speaker": "David",
      "text": "That’s the 'aha' moment I was waiting for. It’s a complete inversion of God’s truth. Satan’s tactic is so insidious—it’s not just temptation, it’s identity theft."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly! And Moses counters it brilliantly in verse 13, saying, 'Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten.' He reclaims his identity and ties it to Christ, showing where his true power lies."
    },
    {
      "speaker": "David",
      "text": "I love that. Let’s explore some hidden connections now. Are there cross-references most people miss that tie this identity theme together?"
    },
    {
      "speaker": "Sarah",
      "text": "One that stands out is in Abraham 3:24-25, where the Lord explains the purpose of creating an earth: 'We will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.' This connects directly to Moses resisting Satan—it’s part of the proving process tied to our premortal identity."
    },
    {
      "speaker": "David",
      "text": "That’s a connection I hadn’t seen before. It’s like our identity gives us the 'why' behind the test. Is there another link?"
    },
    {
      "speaker": "Sarah",
      "text": "Yes, look at Doctrine and Covenants 11:20, which says, 'Behold, this is your work, to keep my commandments, yea, with all your might, mind and strength.' It echoes the purpose tied to our identity in Abraham 3 and Moses 1—our divine heritage comes with a call to action, just as Moses was called to a specific work in Moses 1:6."
    },
    {
      "speaker": "David",
      "text": "That’s beautiful. It’s like a thread running from premortal life to ancient prophets to modern revelation. How does this all tie into the Plan of Salvation?"
    },
    {
      "speaker": "Sarah",
      "text": "It’s at the heart of it. Our identity as children of God, seen in Abraham 3:22-23, is the foundation of why we’re here. The Plan of Salvation—immortality and eternal life as described in Moses 1:39—is God’s way of bringing us back to Him, fully realizing that divine potential. Satan’s attack on identity is an attack on the plan itself."
    },
    {
      "speaker": "David",
      "text": "That’s profound. It changes how I see every temptation now. Let’s bring this to our lives today. How can understanding our identity as children of God impact our daily choices?"
    },
    {
      "speaker": "Sarah",
      "text": "It reframes everything. When we truly internalize that we are children of God, as President Nelson teaches, it influences how we treat ourselves and others. It can guide decisions—whether to stand up against peer pressure or to show kindness—because we know our worth isn’t based on worldly standards but on divine truth."
    },
    {
      "speaker": "David",
      "text": "That’s so practical. It’s not just a lofty idea; it’s a lens for living. What’s one specific way listeners might apply this?"
    },
    {
      "speaker": "Sarah",
      "text": "I’d suggest taking a moment each day to affirm this truth. Look in the mirror and say, 'I am a child of God,' just as we might teach children to do with Moses 1:4. Let that identity shape how you face challenges or temptations, remembering Moses’ strength in verse 13 when he declared who he was."
    },
    {
      "speaker": "David",
      "text": "I love that actionable step. Sarah, this conversation has been eye-opening—from Satan’s attack on identity to seeing this theme across dispensations. I’m walking away with a renewed sense of who I am. What’s your final thought for our listeners?"
    },
    {
      "speaker": "Sarah",
      "text": "I’d invite everyone to ponder Moses 1:39 and Abraham 3:22-23 this week. Reflect on how knowing you’re a child of God with a premortal identity changes how you see yourself and your purpose. Let that truth anchor you, just as it did Moses, against any lie Satan might whisper."
    },
    {
      "speaker": "David",
      "text": "That’s a powerful invitation. Thanks, Sarah, for joining me on this journey of discovery. We’ll see you all next time on the Come Follow Me Podcast by Gospel Study App."
    }
  ],
  "host": "David",
  "guest": "Sarah",
  "voices": {
    "Sarah": "aoede",
    "David": "enceladus"
  },
  "generated_timestamp": "2026-01-04 19:46:09",
  "source_week_file": "cfm_2026_week_02.json"
}