{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "study_level": "scholarly",
  "duration_estimate": "~10.4 minutes",
  "word_count": 1553,
  "character_count": 8826,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on the edge of a vast, formless void—darkness stretching endlessly before you, an earth described as “without form, and void” and “empty and desolate” as we read in Genesis 1:2 and Abraham 4:2. Then, with a voice that pierces the chaos, the Creator speaks: “Let there be light,” and suddenly, brilliance floods the emptiness. This is the beginning of all things, the moment when Heavenly Father and Jesus Christ, through Their divine power, begin to shape a world of breathtaking beauty and purpose. Today, we’re diving into the sacred accounts of the Creation in Genesis 1 and 2, Moses 2 and 3, and Abraham 4 and 5. These chapters are more than a history of the earth—they’re a revelation of who God is, who we are, and the divine potential woven into every aspect of our lives. So, let’s step into this story together and uncover the truths waiting for us.\n\nLet’s start with the sweeping narrative of creation itself. In Genesis 1:1-25, Moses 2:1-25, and Abraham 4:1-25, we witness a process of transformation. Day by day, order emerges from chaos. Light separates from darkness, waters divide to form seas and sky, dry land appears adorned with vegetation, and then the heavens are filled with stars, the earth with living creatures. Each step is deliberate, purposeful, a testament to the power of the Creator. But notice something profound in Abraham 4:1, where we read that “the Gods took counsel among themselves” to organize this world. This plural language in Abraham’s account gives us a glimpse into the collaborative nature of the Creation, reflecting the unity of the Godhead. What does this teach you about Heavenly Father and Jesus Christ? How does it feel to know that the same hands that formed galaxies and oceans are still at work in your life, shaping your own chaos into something magnificent?\n\nThis truth leads us to a pivotal moment in Genesis 1:26-27, echoed in Moses 2:26-27 and Abraham 4:26-27, where we read, “And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth… So God created man in his own image, in the image of God created he him; male and female created he them.” Pause to let that resonate. You are not a random creation—you bear the divine imprint of your Heavenly Father. This isn’t just about physical appearance; it’s about your eternal nature, your capacity to become like Him. Think about that for a moment. How does knowing you are created in God’s image change the way you see yourself? How does it shape the way you treat others, knowing they too carry this sacred likeness?\n\nBuilding on that vision, let’s consider the deeper implications of being made in God’s image. In Mosiah 3:19, we’re reminded that the natural man is an enemy to God and must yield to the enticings of the Holy Spirit to become a saint through the Atonement of Christ. And in Ether 12:27, the Lord promises that if we come unto Him, He will show us our weakness and make it strong through His grace. Being created in God’s image doesn’t mean we’re already perfect—it means we have the potential for perfection through Christ. So, when the world or even your own thoughts whisper that you’re not enough, how can these truths anchor you? Imagine completing this sentence in your heart: “Because I know I am created in God’s image, I choose to…” What would you say? Let that thought settle in your heart for a moment.\n\nNow, let’s turn to another sacred aspect of the Creation story—the establishment of marriage. In Genesis 2:18-25, Moses 3:18-24, and Abraham 5:14-18, we see the formation of Eve and the union of Adam and Eve as husband and wife. Genesis 2:24 declares, “Therefore shall a man leave his father and his mother, and shall cleave unto his wife: and they shall be one flesh.” This isn’t just a partnership; it’s a divine covenant, ordained of God. As President Russell M. Nelson taught, “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood.” Reflect on that. How does this perspective elevate the way you view marriage—whether it’s your own, your parents’, or the covenant you hope for one day? Notice how this sacred union reflects the unity of the Godhead we saw earlier in Abraham 4. What does that parallel teach you about the purpose of marriage in God’s plan?\n\nThis pattern continues in Genesis 1:28, Moses 2:28, and Abraham 4:28, where God commands Adam and Eve to “be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over… every living thing that moveth upon the earth.” This isn’t just about having children—it’s a call to stewardship over all of God’s creations. Doctrine and Covenants 59:16-21 adds that the fullness of the earth is ours to use with judgment, not to excess, and to please the eye and gladden the heart. And in Doctrine and Covenants 104:13-18, we’re taught that we are stewards over earthly things, accountable to God. So, what does this responsibility mean for you today? How can you care for the earth, whether it’s through small acts of conservation or teaching your family to reverence nature as a gift from God?\n\nLet’s shift now to another divine gift woven into the Creation—the Sabbath day. In Genesis 2:2-3, Moses 3:2-3, and Abraham 5:2-3, we read, “And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made. And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made.” God didn’t just rest—He blessed and sanctified this day, setting it apart as holy. Doctrine and Covenants 59:9-13 further instructs us to keep the Sabbath holy by offering our oblations to the Most High and resting from our labors. Think about that. What makes the Sabbath a blessing in your life? Is it the quiet moments of worship, the time with family, or the chance to step away from the world’s noise? How can you make this day more distinct, more sacred, as a reflection of the Creator’s own rest?\n\nAs we deepen our understanding, let’s connect these themes through a broader lens. The Creation isn’t just a past event—it’s a pattern for our lives. Just as God brought order to a formless void, He can bring order to the chaos in our hearts. Just as He created us in His image, He invites us to grow into that divine potential through the Atonement of Jesus Christ. And just as He established sacred covenants like marriage and holy days like the Sabbath, He offers us structures of peace and purpose in a turbulent world. Consider Doctrine and Covenants 101:32-34, where the Lord promises that in the last days, He will reveal all things—things of the earth, the heavens, and the Creation. What does that tell you about the importance of understanding these early chapters of scripture? How does it inspire you to seek more revelation about your place in God’s grand design?\n\nLet’s reflect for a moment on how these accounts in Genesis, Moses, and Abraham speak to you personally. Maybe you’re drawn to the image of light piercing darkness, reminding you that God can illuminate even your darkest moments. Or perhaps the stewardship over creation calls you to act with greater care for the world around you. Take a quiet moment to ponder this: What is the Spirit whispering to you right now about your divine nature, your responsibilities, or your relationship with the Creator?\n\nAs we close, let’s carry these truths into our lives with purpose. I invite you to spend time this week immersed in God’s creations—whether it’s a walk in nature, gazing at the stars, or simply marveling at the intricate design of your own body. As you do, read Genesis 1:26-27 or Moses 2:26-27 and reflect on what it means to be made in His image. I also encourage you to discuss with your family or a trusted friend how you can honor the sacredness of marriage and the Sabbath day, drawing on the principles in Genesis 2 and Moses 3. And finally, take a moment in the temple or in personal prayer to ask Heavenly Father how He is shaping your life, just as He shaped the earth from a void into a world of beauty. Let that question linger in your heart as you seek His guidance.\n\nThe story of the Creation is ultimately a story of hope—a reminder that Heavenly Father and Jesus Christ are still creating, still transforming, still bringing light where there is darkness. You are part of that divine work. So, let’s embrace our potential, honor our covenants, and rest in the assurance that the Creator who formed the heavens and the earth is shaping us to become like Him. Until we meet again, may you feel His hand in every detail of your life.",
  "generated_timestamp": "2025-12-26 20:12:07",
  "source_week_file": "cfm_2026_week_03.json"
}