{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "duration_estimate": "~10.4 minutes",
  "word_count": 1561,
  "character_count": 8957,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on the edge of a vast, ancient landscape, the dust of the desert beneath your feet, the echoes of prophets’ voices carried on the wind. Before you stretches the story of the Old Testament—a collection of sacred writings so ancient, so profound, that it can feel both thrilling and daunting to step into its pages. Yet, as you take that first step, you realize this isn’t just a history of a distant people; it’s a mirror to your own soul, a testimony of Jesus Christ, and a guide to understanding your covenant relationship with God. Today, we embark on a journey through the Introduction to the Old Testament, uncovering how these ancient words can illuminate our path and draw us closer to the Savior.\n\nLet’s begin by considering a simple yet powerful truth: the Old Testament, at its heart, is a witness of Jesus Christ. Though it predates His mortal ministry by centuries, its pages are saturated with His presence. Think about the manna that fell from heaven to sustain the children of Israel in the wilderness, as described in Exodus 16:4 and 11–15. The Lord said, “I will rain bread from heaven for you.” This wasn’t just physical nourishment; it pointed to something greater. In John 6:35, Jesus declares, “I am the bread of life: he that cometh to me shall never hunger.” Can you see it? The manna was a type, a shadow, of the spiritual sustenance only Christ can provide. Or consider the sacrificial lamb of the Passover in Exodus 12:3–5, unblemished and pure, a direct symbol of the Lamb of God, who, as John 1:29 proclaims, “taketh away the sin of the world.” What about the brass serpent raised by Moses in Numbers 21:4–10, where those who looked upon it were healed? Jesus Himself draws the parallel in John 3:14, saying, “As Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.” These are not mere coincidences; they are divine fingerprints, evidence that the Old Testament is a tapestry woven with threads of the Savior’s mission. Pause for a moment. How does recognizing Christ in these symbols deepen your appreciation for His role in your life?\n\nBuilding on this vision, let’s explore another layer of His identity revealed in these ancient texts. President Dallin H. Oaks has taught us something remarkable: when we read the words of “God” or the “Lord” in the Old Testament, we are almost always hearing the voice of Jehovah, who is Jesus Christ Himself. In John 8:58, Jesus boldly declares to the Jewish leaders, “Before Abraham was, I am.” This statement stunned them—why? Turn to Exodus 3:14, where the Lord reveals His name to Moses: “I AM THAT I AM.” By claiming this title, Jesus was asserting His divine identity as Jehovah, the God of the Old Testament. This truth transforms how we read these scriptures. Every command, every covenant, every act of mercy or judgment—it’s the pre-mortal Christ speaking, guiding, and preparing His people for His coming. Reflect on that for a second. How does knowing that Jesus is Jehovah change the way you hear His voice in the stories of Abraham, Moses, or Isaiah?\n\nThis truth leads us to another profound aspect of studying the Old Testament: the restoration of “plain and precious things” through the Prophet Joseph Smith. In 1 Nephi 13:21–29, Nephi sees in vision that many truths would be lost from the Bible over time, but the Lord promises to bring them forth again. One way He fulfills this is through Joseph Smith’s inspired translations and revelations. Consider the Book of Moses, which restores accounts like Enoch’s city of Zion in Moses 7:18–19, where “the Lord called his people Zion, because they were of one heart and one mind.” Or think of the Book of Abraham, revealing the pre-mortal council in heaven in Abraham 3:22–28, where the Lord shows Abraham the “intelligences that were organized before the world was.” These restored truths aren’t just historical footnotes; they are windows into God’s eternal plan. They help us see the Old Testament not as a fragmented relic, but as part of a greater whole, complemented by the Book of Mormon, which, as 2 Nephi 3:12 teaches, grows together with the Bible to “confound false doctrines” and establish truth. Let that settle in your heart. How do these restored accounts enrich your understanding of God’s work across time?\n\nNow, let’s turn to a central theme of the Old Testament: covenants. In Exodus 19:5, the Lord declares to Israel, “If ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people.” This isn’t just a promise to an ancient nation; it’s an invitation to you. The Old Testament is the story of God seeking to bind us to Him through sacred promises, what President Russell M. Nelson has called “the everlasting covenant.” This covenant, offered to prophets like Abraham, Isaac, and Jacob, is the same one we enter through baptism and renew in the temple. As Jeremiah 31:33 prophesies, the Lord says, “I will put my law in their inward parts, and write it in their hearts; and will be their God, and they shall be my people.” Isn’t that beautiful? The Old Testament isn’t merely about laws or rituals; it’s about a relationship—a “special kind of love and mercy,” as President Nelson describes it, that flows from keeping our covenants. Take a quiet moment. What does it mean to you to be part of this covenant family, stretching back to the days of Adam and forward to eternity?\n\nNotice how this pattern continues as we consider how the Old Testament can speak to every heart, including the youngest among us. If you’re teaching children, imagine sitting with them and looking at a painting like “The Prophet Isaiah Foretells Christ’s Birth” by Harry Anderson. Let them point out details—the baby Jesus, the light surrounding Him. Then read Isaiah 7:14 together: “Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel.” Or Isaiah 9:6: “For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.” Help them feel the wonder of these prophecies. Or turn to Psalm 23, where the Lord is described as our shepherd, and ask, “How does Jesus care for us like a shepherd?” These simple connections can plant seeds of faith that grow over a lifetime. And when teaching about covenants, talk about promises they make with friends or family, then show a picture of baptism and read Mosiah 18:10, where we covenant to “bear one another’s burdens.” How can we help children—and ourselves—feel the joy of belonging to God’s covenant people?\n\nAs we deepen our understanding, let’s connect these themes to our daily walk with Christ. The Old Testament isn’t just a record of the past; it’s a lamp to our feet, as Psalm 119:105 beautifully states: “Thy word is a lamp unto my feet, and a light unto my path.” When we seek Jesus in its pages—whether through the manna, the lamb, or the prophecies of Isaiah—we find spiritual nourishment. Elder Dale G. Renlund has urged us to “remember and always focus on Jesus Christ.” So, as you read, ask yourself: How does this story or symbol point to the Savior? How does it reveal His love, His sacrifice, or His power to redeem? And when you ponder covenants, consider: What is God teaching me about my promises to Him? How can I more fully live as His “peculiar treasure”? These questions aren’t just academic; they are invitations to let the Spirit guide you into deeper communion with the Lord.\n\nLet’s close with a reflective thought. The Old Testament may seem like a foreign land at first—its culture, its language, its ancient struggles. Yet, as we’ve seen today, it is a sacred space where we meet Jesus Christ as Jehovah, where we uncover restored truths through Joseph Smith, and where we learn what it means to be bound to God by covenant. Its stories of faith, repentance, and hope—whether from Abraham, Hannah, or Daniel—mirror our own. They remind us that God moves in our lives just as He did in theirs. So, I invite you to take this journey with an open heart. As you begin reading the Old Testament, look for Christ in every page—perhaps start by exploring one of the symbols we discussed, like the brass serpent or the sacrificial lamb. Ponder how these point to Him. Then, spend a quiet moment in prayer, asking the Lord to help you see your covenant relationship with Him more clearly. If you can, discuss with your family or friends: What does it mean to you that Jesus is Jehovah, the God of the Old Testament? And consider taking these reflections to the temple, where covenants come alive in sacred ways. Let the words of the psalmist echo in your soul: “Thy word is a lamp unto my feet, and a light unto my path.” May this light guide you through the coming year as we study these ancient, holy writings together.",
  "generated_timestamp": "2026-01-01 00:01:07",
  "source_week_file": "cfm_2026_week_01.json"
}