{
  "week_number": 5,
  "title": "Week 5: January 26–February 1 - Genesis 5; Moses 6",
  "date_range": "January 26–February 1",
  "study_level": "scholarly",
  "duration_estimate": "~12.1 minutes",
  "word_count": 1819,
  "character_count": 10291,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a windswept hill, gazing across a world newly formed yet already shadowed by the choices of its first inhabitants. You hear a voice, deep and resonant, calling out to a man named Enoch, a man who feels utterly unworthy, trembling at the thought of speaking for God. “Why is it that I have found favor in thy sight, and am but a lad, and all the people hate me; for I am slow of speech; wherefore am I thy servant?” (Moses 6:31). That question echoes through the ages, doesn’t it? Have you ever felt like Enoch, overwhelmed by a calling or a challenge that seems far beyond your reach? Today, as we dive into Genesis 5 and Moses 6, we’ll uncover the story behind the cryptic line, “Enoch walked with God: and he was not; for God took him” (Genesis 5:24). More than that, we’ll explore how God calls the weak to do His mighty work, how the gospel of Jesus Christ was taught from the very beginning, and how these ancient truths invite us to walk with the Savior today.\n\nLet’s start with Enoch, a figure who emerges briefly in Genesis 5 as a name in a long genealogy, a list of generations stretching from Adam to Noah. But in Moses 6, through the restored writings of the Pearl of Great Price, we receive a window into his soul and his sacred mission. Picture this: Enoch, likely a young man, stands before the Lord, burdened by his own inadequacies. He confesses his youth, his slowness of speech, and the disdain of the people around him. Yet the Lord’s response is not a dismissal but a divine reassurance. “Open thy mouth, and it shall be filled, and I will give thee utterance,” the Lord declares in Moses 6:32. “Behold my Spirit is upon thee, wherefore all thy words will I justify; and the mountains shall flee before thee, and the rivers shall turn from their course; and thou shalt abide in me, and I in you; therefore walk with me” (Moses 6:34). Pause to let that resonate. What a promise! The Lord doesn’t just call Enoch; He equips him, surrounds him with divine power, and invites him into a sacred companionship—to walk with Him.\n\nThis truth leads us to a profound principle: God calls us despite our weaknesses, not because of our strengths. Think about that in your own life. When have you felt inadequate for a task the Lord placed before you? Maybe it’s a calling in your ward, a prompting to share the gospel, or simply the daily challenge of living as a disciple in a world that often rejects truth. Enoch’s story reminds us that feelings of inadequacy are not a disqualification but an invitation to rely on the Lord. Cross-reference this with other prophets who felt the same way. Moses, in Exodus 4:10, pleaded, “O my Lord, I am not eloquent, neither heretofore, nor since thou hast spoken unto thy servant: but I am slow of speech, and of a slow tongue.” Jeremiah, in Jeremiah 1:6, lamented, “Ah, Lord God! behold, I cannot speak: for I am a child.” And Moroni, in Ether 12:27, received the Lord’s promise that “my grace is sufficient for all men that humble themselves before me; for if they humble themselves before me, and have faith in me, then will I make weak things become strong unto them.” Do you see the pattern? The Lord’s call is always accompanied by His strength. Reflect on that for a second. What weakness in your life might the Lord be inviting you to surrender to Him so He can transform it?\n\nBuilding on that vision, let’s look at how Enoch’s ministry unfolded. In Moses 6:37-47, we see the fruits of his obedience. After the Lord’s reassurance, Enoch goes forth with power, preaching repentance to a wicked people. The text tells us, “And he heard a voice from heaven, saying: Enoch, my son, prophesy unto this people, and say unto them—Repent, for thus saith the Lord: I am angry with this people, and my fierce anger is kindled against them” (Moses 6:27). Notice the state of the world around Enoch. Sin had dulled their senses; their hearts were hardened, their ears could not hear, their eyes could not see the things of God (Moses 6:27). Yet Enoch, empowered by the Spirit, becomes a seer—a man who sees with spiritual eyes what others cannot. In Moses 6:35, the Lord anoints Enoch’s eyes with clay, a symbolic act, and commands him to wash in water, after which Enoch beholds things “not visible to the natural eye.” This imagery of clay and water points us to the cleansing and illuminating power of the gospel, doesn’t it? Just as physical sight is restored, spiritual sight comes through obedience and the Spirit. How often do we need our own eyes washed, our own hearts softened, to see the Lord’s hand in our lives?\n\nThis brings us to another layer of Enoch’s story: the transformative power of walking with God. The Lord’s invitation to “walk with me” in Moses 6:34 isn’t just a metaphor; it’s a lived reality for Enoch. His obedience and faith lead to such intimacy with the divine that, as Genesis 5:24 records, “he was not; for God took him.” Through the Book of Moses, we understand this as translation, a state of being changed to dwell in God’s presence without tasting death. But beyond the miraculous, this phrase “walk with me” echoes as an invitation to each of us. What does it mean to walk with the Savior in your daily life? Does it mean aligning your will with His, seeking His guidance in prayer, or striving to emulate His compassion? Take a quiet moment to ponder that. This year’s youth theme, drawn from Moses 6:34, is “Walk with Me.” It’s a reminder that the Savior is not a distant figure but a constant companion, ready to guide us if we choose to walk by His side.\n\nNow, let’s shift our gaze from Enoch to the broader family of Adam and Eve, because Moses 6 gives us a remarkable glimpse into the gospel’s presence from the very beginning. In Moses 6:48-68, we find a sermon of sorts, a divine discourse delivered to Adam about the plan of redemption. The Lord teaches, “If thou wilt turn unto me, and hearken unto my voice, and believe, and repent of all thy transgressions, and be baptized, even in water, in the name of mine Only Begotten Son, who is full of grace and truth, which is Jesus Christ, the only name which shall be given under heaven, whereby salvation shall come unto the children of men, ye shall receive the gift of the Holy Ghost” (Moses 6:52). Stop and let that truth settle in your heart. Here, in the earliest generations of humanity, the gospel of Jesus Christ is taught—faith, repentance, baptism, and the gift of the Holy Ghost. This isn’t a New Testament innovation; it’s the eternal plan, as the Lord Himself declares in Moses 6:7, “this same Priesthood, which was in the beginning, shall be in the end of the world also.”\n\nNotice the symbolism woven into this teaching. In Moses 6:59, the Lord compares baptism to being “born again,” saying, “That by reason of transgression cometh the fall, which fall bringeth death, and inasmuch as ye were born into the world by water, and blood, and the spirit, which I have made, and so became of dust a living soul, even so ye must be born again into the kingdom of heaven, of water, and of the Spirit, and be cleansed by blood, even the blood of mine Only Begotten.” This imagery of water, blood, and spirit ties physical birth to spiritual rebirth, pointing us to the Atonement of Christ as the means of our cleansing. How does this deepen your understanding of baptism? And more, how can you continue to experience that rebirth throughout your life—through repentance, partaking of the sacrament, or seeking the Spirit’s sanctifying power?\n\nThis truth flows naturally into another vital theme in Moses 6: the sacred responsibility of parents to teach these gospel truths to their children. In Moses 6:58, the Lord commands, “Therefore I give unto you a commandment, to teach these things freely unto your children, saying: That by reason of transgression cometh the fall, which fall bringeth death.” This echoes through other scriptures, like Doctrine and Covenants 68:25, where the Lord instructs parents to teach their children “to understand the doctrine of repentance, faith in Christ the Son of the living God, and of baptism and the gift of the Holy Ghost by the laying on of the hands.” Think about Adam and Eve, gathering their posterity, teaching them the ways of God even as Satan’s dominion grew around them (Moses 6:15, 21). What a powerful example of steadfastness! How are you teaching these eternal truths in your home? If you’re not a parent, how can you support the rising generation—perhaps as a teacher, a mentor, or a friend?\n\nAs we near the end of our journey through these sacred chapters, let’s reflect on the “book of remembrance” mentioned in Moses 6:5, a record kept by Adam’s family to preserve their genealogy and, presumably, their spiritual history. This practice invites us to consider our own records. What stories of faith, what lessons from your walk with the Savior, do you want to preserve for your posterity? Could you begin your own book of remembrance, perhaps through journaling or contributing to FamilySearch.org?\n\nLet’s close by returning to where we began—with Enoch, trembling yet faithful, stepping forward to walk with God. His story, and the gospel teachings in Moses 6, remind us that the Lord sees potential in us we cannot see in ourselves. He calls us in our weakness, equips us with His strength, and invites us to walk with Him through every step of life. The gospel of Jesus Christ, taught from the days of Adam, remains our path to redemption—through faith, repentance, baptism, and the companionship of the Holy Ghost. So, I invite you to ponder a few questions in your personal study this week: What weaknesses is the Lord asking you to surrender to Him? How can you more fully walk with the Savior in your daily choices? Take time to pray about these things, seeking His guidance. If you’re able, visit the temple and reflect on the eternal nature of the gospel plan as taught in Moses 6. And consider discussing these chapters with your family or friends—share how Enoch’s example or Adam’s teachings have touched your heart. As you do, may you feel the Savior walking beside you, just as He promised Enoch so long ago. Until we meet again, keep seeking, keep walking, and keep trusting in His strength.",
  "generated_timestamp": "2025-12-26 20:16:31",
  "source_week_file": "cfm_2026_week_05.json"
}