{
  "week_number": 7,
  "title": "Week 7: February 9–15 - Genesis 6–11; Moses 8",
  "date_range": "February 9–15",
  "study_level": "connected",
  "duration_estimate": "~10.6 minutes",
  "word_count": 1591,
  "character_count": 8715,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine for a moment a world so steeped in darkness that every thought of the human heart is only evil continually. Picture a lone family, standing apart from the chaos, led by a man who walks with God in a way that sets him apart as a beacon of hope. This is the world of Noah, a world on the brink of divine judgment, yet also a world where mercy shines through the storm clouds. Today, as we dive into Genesis 6 through 11 and Moses 8, we’re not just stepping into ancient history. We’re stepping into a mirror of our own day, a time when corruption and violence surround us, yet the voice of a prophet calls us to safety. So, let’s journey together through the Flood, the rainbow, and the Tower of Babel, and uncover how these stories teach us to find grace in the eyes of the Lord, even now.\n\nLet’s begin with Noah, a man who stands out in a world described as utterly corrupt. In Genesis 6:5, we read, “And God saw that the wickedness of man was great in the earth, and that every imagination of the thoughts of his heart was only evil continually.” Pause to let that resonate. Every thought, only evil, all the time. It’s hard to fathom a society so far gone, yet as we look around today, don’t we see echoes of this? In Moses 8:28, the record adds, “The earth was corrupt before God, and it was filled with violence.” This wasn’t just a few bad apples; this was a civilization rotting at its core. But amid this darkness, there’s a piercing light. Moses 8:27 tells us, “Noah found grace in the eyes of the Lord; for Noah was a just man, and perfect in his generation; and he walked with God.” What does it mean to walk with God when everyone else is walking away? It means listening to His voice through a prophet, even when the message is hard. Noah was called to warn the people, to preach repentance, as we see in Moses 8:20, where he pleads, “Believe and repent of your sins and be baptized in the name of Jesus Christ, the Son of God, even as our fathers, and ye shall receive the Holy Ghost.” But the people refused. Their hearts were set on evil, and they mocked the very idea of a coming flood.\n\nThis brings us to a powerful parallel for our time. Jesus Himself taught in Joseph Smith—Matthew 1:41, “As it was in the days of Noah, so it shall be also at the coming of the Son of Man.” Think about that for a moment. The conditions of Noah’s day—corruption, violence, a rejection of God’s warnings—are a blueprint for the last days before Christ returns. And just as God called Noah as His prophet then, He has called a living prophet today. In Moses 8:16, we see that “Noah prophesied, and taught the things of God, even as it was in the beginning.” Isn’t that what our prophet does now? He teaches eternal truths, warns us of spiritual dangers, and invites us to build our lives on the foundation of Christ. Elder Allen D. Haynie has said, “A perfect and loving Father in Heaven has chosen the pattern of revealing truth to His children through a prophet.” Following that pattern brings safety. So, ask yourself: What warnings or invitations from our living prophet resonate most with you right now? How are they like Noah’s call to prepare for the storm?\n\nBuilding on that truth, let’s turn to the Flood itself. Some might question the justice of God in sending such destruction, as Genesis 6:7 records, “And the Lord said, I will destroy man whom I have created from the face of the earth.” But consider this perspective from Elder Neal A. Maxwell: he taught that “corruption had reached an agency-destroying point that spirits could not, in justice, be sent here.” The Flood wasn’t just judgment; it was mercy. It preserved the possibility of agency for future generations by cleansing a world too broken to sustain righteousness. And even in this act, God’s love shines through. Genesis 6:8 reminds us, “But Noah found grace in the eyes of the Lord.” God preserved a remnant, a family who would carry forward His covenant. Reflect on that for a second. How often does God’s mercy show up in ways we don’t expect, even in the midst of what looks like judgment?\n\nThis theme of mercy carries us to the aftermath of the Flood, where God establishes a covenant with Noah and his family. In Genesis 9:12-13, we read, “And God said, This is the token of the covenant which I make between me and you and every living creature that is with you, for perpetual generations: I do set my bow in the cloud, and it shall be for a token of a covenant between me and the earth.” The rainbow—a symbol of God’s promise never again to destroy the earth by flood. But there’s more depth in the Joseph Smith Translation of Genesis 9:21-22, which clarifies, “And when I shall cover the earth with a cloud, then I shall set my bow in the cloud; and I will look upon it, that I may remember the everlasting covenant, which I made unto thy father Enoch; that, when men should keep all my commandments, Zion should again come on the earth.” Take a quiet moment to let that sink in. The rainbow isn’t just a reminder for us; it’s a reminder for God of His covenant to bring Zion, a place of righteousness, back to the earth when we keep His commandments. How beautiful is that? It connects us back to Enoch’s story and forward to the hope of Christ’s return. What other tokens or symbols in your life remind you of God’s promises? Perhaps the sacrament emblems, a temple recommend, or even a simple hymn—how do they help you remember your covenants?\n\nNow, let’s shift to another story in these chapters that feels strikingly relevant to our day: the Tower of Babel in Genesis 11. Here we find a people united in language and purpose, but their purpose is rooted in pride. Genesis 11:4 records their intent: “And they said, Go to, let us build us a city and a tower, whose top may reach unto heaven; and let us make us a name, lest we be scattered abroad upon the face of the whole earth.” They wanted to reach heaven on their own terms, through their own strength. But Helaman 6:28 reveals the deeper source of this idea: “And it came to pass that they did have their signs, yea, their secret signs, and their secret words; and this that they might distinguish a brother who had entered into the covenant, that whatsoever wickedness his brother should do he should not be injured by his brother.” This wasn’t just misguided ambition; it was inspired by Satan himself. Contrast this with the way to heaven taught in 2 Nephi 31:20-21, which says, “Wherefore, ye must press forward with a steadfastness in Christ, having a perfect brightness of hope, and a love of God and of all men… for there is none other way nor name given under heaven whereby man can be saved in the kingdom of God.” Reflect on that truth. The people of Babel sought heaven through pride and secret works; God’s way is through Jesus Christ, humility, and love.\n\nThis contrast echoes the difference between Babel and Zion. Remember Enoch’s people from Moses 7:18, where “the Lord called his people Zion, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them.” Zion reaches heaven through unity in Christ, not a tower of human making. So, what does this mean for us? In a world often driven by pride, self-reliance, and division, how do we choose the path of Zion? John 3:16 reminds us of the way: “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” Christ is the way, the truth, and the life. He is the ladder to heaven, not a tower we build ourselves.\n\nAs we close this journey through these sacred stories, let’s reflect on the patterns we’ve seen. Noah’s day mirrors our own, with a prophet’s voice calling us to safety amid corruption. The Flood shows us God’s mercy even in judgment, and the rainbow reminds us of His everlasting covenants. The Tower of Babel warns us against pride and points us to Christ as the only path to heaven. These aren’t just ancient tales; they’re guideposts for living in the latter days. So, I invite you to ponder a few things. First, individually, take a moment this week to read a recent message from our living prophet and write down one warning or invitation that speaks to your heart—then act on it. Second, with your family, discuss what the rainbow or other covenant symbols mean to you, and how they help you remember God’s promises. And third, in your journal, reflect on the contrast between Babel and Zion—how can you build unity in Christ in your own life and relationships? Let these stories linger in your mind and guide your steps as you seek to find grace in the eyes of the Lord, just as Noah did.",
  "generated_timestamp": "2025-12-26 20:19:57",
  "source_week_file": "cfm_2026_week_07.json"
}