{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "study_level": "scholarly",
  "duration_estimate": "~11.9 minutes",
  "word_count": 1781,
  "character_count": 9974,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine for a moment the pristine beauty of the Garden of Eden, a place of perfect peace, where Adam and Eve walked with God in a state of innocence. The air is warm, the colors vivid, the harmony unbroken. But then, a choice—a choice that changes everything. What if that choice, often seen as a tragic fall, was actually the necessary step toward something far greater? Today, as we dive into Genesis 3 and 4, and Moses 4 and 5, we’re going to explore the Fall of Adam and Eve not as a story of loss, but as a story of possibility, of growth, and of profound redemption through Jesus Christ. Let’s journey together into these sacred accounts and uncover how the Fall fits into God’s divine plan for you and for me.\n\nLet’s begin by setting the scene in the Garden of Eden, as described in Genesis 3 and Moses 4. Adam and Eve are in a state of innocence, unaware of opposition, untouched by sorrow or pain. But then comes the serpent, described in Moses 4:4 as “Satan, that old serpent, who is the devil, who rebelled against God, and sought to take the kingdom of our God and his Christ.” Satan tempts Eve, and through a series of deceptions, both she and Adam partake of the forbidden fruit. The consequences are immediate and stark. In Genesis 3:16-19, we read of the curses pronounced: to Eve, pain in childbirth and subjection to her husband; to Adam, toil and sweat to bring forth bread from a cursed ground; and to both, mortality and death. They are cast out of the garden, separated from the immediate presence of God. At first glance, this seems like a devastating loss. But let’s pause to let that resonate. What if this expulsion, this so-called tragedy, was the very doorway to something essential?\n\nThe Book of Moses, revealed through the Prophet Joseph Smith, gives us a lens to see beyond the surface. In Moses 5:10-11, Adam and Eve themselves reflect on their choice after receiving divine instruction. Adam declares, “Blessed be the name of God, for because of my transgression my eyes are opened, and in this life I shall have joy, and again in the flesh I shall see God.” Eve adds, “Were it not for our transgression we never should have had seed, and never should have known good and evil, and the joy of our redemption, and the eternal life which God giveth unto all the obedient.” Do you hear the gratitude in their voices? They recognize that the Fall, though it introduced pain and opposition, also opened the way for family, for growth, for the knowledge of good and evil, and ultimately for redemption through the Savior. This wasn’t a mistake to be mourned; it was a necessary step in God’s plan. So, let me ask you: How does this perspective shift the way you view the challenges and opposition in your own life? Could the very struggles you face be part of your path to becoming more like God?\n\nThis truth leads us to a deeper understanding of why the Fall was essential. In 2 Nephi 2:22-23, Lehi teaches, “And if Adam had not transgressed he would not have fallen, but he would have remained in the garden of Eden. And all things which were created must have remained in the same state in which they were after they were created; and they must have remained forever, and had no end. And they would have had no children; wherefore they would have remained in a state of innocence, having no joy, for they knew no misery; doing no good, for they knew no sin.” Without the Fall, there would be no progression, no family, no opportunity to choose between right and wrong. Opposition, as Lehi explains in 2 Nephi 2:11, is necessary: “For it must needs be, that there is an opposition in all things. If not so… righteousness could not be brought to pass, neither wickedness, neither holiness nor misery, neither good nor bad.” Reflect on that for a second. How has opposition in your life helped you grow closer to God? How has it shaped your ability to choose righteousness?\n\nBuilding on that vision, let’s turn to the theme of agency, so central to Heavenly Father’s plan. In Moses 4:1-3, we learn of the premortal council where Satan proposed to “redeem all mankind, that one soul shall not be lost,” but at the cost of destroying agency. The Lord recounts, “Wherefore, because that Satan rebelled against me, and sought to destroy the agency of man, which I, the Lord God, had given him, and also, that I should give unto him mine own power; by the power of mine Only Begotten, I caused that he should be cast down.” Agency—your ability to choose—is so sacred that the Savior Himself defended it, even at great cost. Lehi reinforces this in 2 Nephi 2:27: “Wherefore, men are free according to the flesh; and all things are given them which are expedient unto man. And they are free to choose liberty and eternal life, through the great Mediator of all men, or to choose captivity and death, according to the captivity and power of the devil.” Take a quiet moment. How does knowing that Christ fought for your agency change the way you view your daily choices? How can you honor that gift by choosing to follow Him?\n\nNotice how this pattern continues in the story of redemption that emerges after the Fall. In Moses 5:4-8, we see Adam and Eve, now outside the garden, calling upon the Lord through prayer and offering sacrifices as commanded. An angel appears and teaches them the meaning of those sacrifices, saying in verse 7, “This thing is a similitude of the sacrifice of the Only Begotten of the Father, which is full of grace and truth.” Their eyes are opened to the plan of redemption, to the role of Jesus Christ in overcoming the effects of the Fall. By verse 11, as we heard earlier, Eve rejoices in “the joy of our redemption.” The Fall introduced death and sin, but Christ’s Atonement offers life and forgiveness. This is echoed in Alma 11:42, where Amulek teaches that Christ “shall loose the bands of this temporal death, that all shall be raised from this temporal death.” So, let me ask: How does the promise of redemption through Christ give you hope amidst the struggles of mortality? What effects of the Fall do you see in your life, and how does the Savior’s grace heal them?\n\nLet’s deepen this by exploring a poignant symbol from Moses 4:13-16 and 27. After partaking of the fruit, Adam and Eve realize their nakedness and attempt to cover themselves with fig leaves. But the Lord provides something better. In verse 27, we read, “Unto Adam, and also unto his wife, did I, the Lord God, make coats of skins, and clothed them.” This act of clothing them is rich with meaning. In scriptures like Revelation 7:9 and 13-15, white robes symbolize purity and redemption through Christ’s blood. In 2 Nephi 9:14, we learn that the righteous “shall have a perfect knowledge of their enjoyment, and their righteousness, being clothed with purity, yea, even with the robe of righteousness.” The Lord’s act of clothing Adam and Eve points to His desire to cover our sins, to protect us, and to prepare us for His presence. If you’ve received temple ordinances, consider the sacred clothing you wear as a reminder of this divine covering, this covenant protection. Let that truth settle in your heart. How does this imagery of being clothed by the Lord inspire you to seek His covering in your life?\n\nAnother layer to ponder is the contrast between Cain and Abel in Moses 5:16-26. Both offer sacrifices, but their hearts differ. Abel offers his sacrifice in faith, “in the name of the Son,” while Cain, influenced by Satan, offers his with resentment, and the Lord rejects it. In verse 21, the Lord warns Cain, “If thou doest well, thou shalt be accepted. And if thou doest not well, sin lieth at the door.” Cain’s refusal to heed this warning leads to tragic consequences. This story invites us to examine our own offerings to the Lord—whether it’s our time, our talents, or our obedience. Are we giving with a willing heart, or out of obligation? Reflect on that for a moment. What sacrifices is the Lord asking of you right now, and how can you offer them with the faith of Abel?\n\nAs we draw this exploration to a close, let’s reflect on the overarching narrative of the Fall and redemption. The story of Adam and Eve is not a tragedy; it’s a story of divine foresight and love. The Fall was necessary for growth, for agency, for family, and for the very possibility of joy through opposition. And through it all, Jesus Christ stands as the center of the plan, offering redemption from every effect of the Fall. As Moses 5:15 promises, “And as many as believed in the Son, and repented of their sins, should be saved; and as many as believed not and repented not, should be damned.” The choice is ours, just as it was for Adam and Eve, for Cain and Abel. So, let’s carry this forward into our lives.\n\nI invite you to ponder a few things this week. First, take time in your personal study to read Moses 5:10-11 again, and write down how the words of Adam and Eve about the joy of redemption speak to your own experiences in this fallen world. Second, pray to understand how the Savior’s Atonement heals the specific effects of the Fall in your life—whether it’s pain, sin, or separation from God. Third, discuss with your family or a trusted friend the role of agency in your spiritual growth. How has opposition helped you choose righteousness? And finally, if possible, spend a quiet moment in the temple or in prayer, reflecting on the symbolism of being clothed by the Lord, and seek to feel His covering in your life. These invitations are pathways to deeper connection with the truths we’ve explored today.\n\nThank you for joining me on this sacred journey through the scriptures. The story of the Fall is your story, too—a story of choice, of growth, and of returning to God through the infinite love of Jesus Christ. May you feel His redeeming power as you ponder and apply these eternal truths. Until we meet again, keep seeking, keep choosing, and keep following Him.",
  "generated_timestamp": "2025-12-26 20:14:20",
  "source_week_file": "cfm_2026_week_04.json"
}