{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "duration_estimate": "~10.6 minutes",
  "word_count": 1588,
  "character_count": 9457,
  "segment_count": 34,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I want to start with a mystery that’s been nagging at me as we dive into the Old Testament this year. Why would the Jews try to stone Jesus for saying just three words—‘Before Abraham was, I am’—as recorded in John 8:58-59? What’s hidden in those words that caused such an explosive reaction?"
    },
    {
      "speaker": "David",
      "text": "Sarah, that’s a fantastic question, and it cuts right to the heart of a profound truth. Those three words, ‘I am,’ aren’t just a statement of existence—they’re a direct claim to divinity. If we look at Exodus 3:14, where God reveals Himself to Moses as ‘I AM THAT I AM,’ we see that Jesus is invoking the very name of Jehovah, essentially declaring Himself to be the God of the Old Testament. That’s why the Jews were ready to stone Him—it was blasphemy in their eyes unless, of course, it was true."
    },
    {
      "speaker": "Sarah",
      "text": "Wait, so you’re saying Jesus is Jehovah? That’s a huge claim! How does this connect to what we’re studying in the Old Testament, and how can we see this identity woven through those ancient texts?"
    },
    {
      "speaker": "David",
      "text": "Exactly, Sarah. President Dallin H. Oaks has taught that when we read ‘God’ or ‘Lord’ in the scriptures, it’s almost always referring to Jehovah, who is Jesus Christ. So, as we study the Old Testament, we’re not just reading about a distant God—we’re seeing the pre-mortal Christ interacting with His people. Think about every story, every covenant, every miracle as a direct encounter with the Savior."
    },
    {
      "speaker": "Sarah",
      "text": "That’s mind-blowing. So, from an ancient Israelite perspective, they’re covenanting with Jehovah, not knowing He’s the same Jesus who will come later. But from Christ’s perspective, He’s preparing them for His mortal mission. How does this shift when we look at it through a modern lens, with the Restoration?"
    },
    {
      "speaker": "David",
      "text": "Great point. In the modern Restoration, through prophets like Joseph Smith, we get the fuller picture. For instance, in 1 Nephi 13:21-29, Nephi sees that many ‘plain and precious things’ were lost from the Bible, but the Lord promises to restore them. Through the Book of Mormon, the Book of Moses, and the Joseph Smith Translation, we understand that Jehovah is Jesus, and His covenant relationship with us spans all dispensations."
    },
    {
      "speaker": "Sarah",
      "text": "I love that idea of continuity across time. Let’s explore a pattern here—can we trace this theme of Jehovah as Jesus through different dispensations in the Old Testament? Maybe starting with some symbols that point to Him?"
    },
    {
      "speaker": "David",
      "text": "Absolutely, let’s do that. One powerful pattern is the recurring symbols of Christ throughout the Old Testament. Take the manna in Exodus 16:4, 11-15, where God provides bread from heaven for the Israelites. Jesus Himself connects this to His identity in John 6:35, saying, ‘I am the bread of life.’ This isn’t just sustenance—it’s a type of Christ’s spiritual nourishment across time."
    },
    {
      "speaker": "Sarah",
      "text": "That’s beautiful. So the manna is like a physical reminder of a spiritual truth. What’s another example of this pattern we can see?"
    },
    {
      "speaker": "David",
      "text": "Another striking one is the brass serpent in Numbers 21:4-10. The Israelites are bitten by serpents, and Moses raises a brass serpent on a pole—anyone who looks at it is healed. Jesus directly ties this to His crucifixion in John 3:14, saying, ‘As Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.’ It’s a clear foreshadowing of His Atonement, showing His role as healer and Savior."
    },
    {
      "speaker": "Sarah",
      "text": "I’m seeing this pattern now—Jehovah in the Old Testament is consistently pointing to Christ’s mission. Can we take this further? Maybe to another dispensation or story?"
    },
    {
      "speaker": "David",
      "text": "Let’s look at Jonah. In Jonah 1:4-17, he’s cast into the sea and swallowed by a great fish, emerging after three days. Jesus references this in Matthew 12:38-41 as a sign of His own death and resurrection. This pattern of death and rebirth, of deliverance, echoes across dispensations—from Jonah to Christ to our own resurrection through Him."
    },
    {
      "speaker": "Sarah",
      "text": "That’s remarkable! It’s like the Old Testament is a treasure map, with clues pointing to Jesus everywhere. Let’s pivot for a moment to some historical context. Are there archaeological or cultural insights that can help us feel closer to these ancient stories of Jehovah?"
    },
    {
      "speaker": "David",
      "text": "Definitely. One fascinating insight comes from the cultural understanding of names in ancient Israel. The name ‘Jehovah’ or ‘YHWH’—the Tetragrammaton—was so sacred that it was rarely spoken aloud, often replaced with ‘Adonai’ or ‘Lord.’ When Jesus says ‘I am’ in John 8:58, He’s invoking that sacred identity in a public setting, which would have been utterly shocking to His audience, as it directly ties to Exodus 3:14."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a time collapse moment for me—imagining the weight of that declaration in their culture. It makes the reaction of the Jews so much more understandable. What’s another historical piece that brings this to life?"
    },
    {
      "speaker": "David",
      "text": "Another is the practice of sacrifice, central to Old Testament worship. The sacrificial lamb in Exodus 12:3-5, for instance, had to be without blemish, mirroring Christ as the perfect Lamb of God, as John 1:29 states. Archaeologically, we’ve found altars and evidence of these rituals across ancient Israel, grounding these spiritual symbols in real, tangible history. It shows how deeply embedded the idea of atonement was in their daily lives, pointing to Christ’s ultimate sacrifice."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so powerful—seeing the physical remnants of spiritual truths. Now, let’s circle back to that opening mystery. Why was Jesus’ statement so explosive, and what does it reveal about His identity as Jehovah?"
    },
    {
      "speaker": "David",
      "text": "Here’s where it gets profound, Sarah. Jesus claiming to be ‘I am’ isn’t just a name—it’s a declaration of eternal existence and divine authority. He’s telling them He is the same Jehovah who spoke to Moses, who made covenants with Abraham, and who delivered Israel. This resolves the tension: the Jews saw it as blasphemy, but through the lens of the Restoration, we know it’s the key to understanding the Old Testament as His story."
    },
    {
      "speaker": "Sarah",
      "text": "That’s the ‘aha’ moment I was waiting for. It’s not just a name—it’s the thread that ties everything together. So, knowing Jesus is Jehovah, are there hidden connections in the Old Testament that most people might miss?"
    },
    {
      "speaker": "David",
      "text": "Oh, absolutely. One connection is in the restored truths through Joseph Smith. Take Moses 6:63, where the Lord teaches Adam, ‘All things have their likeness, and all things are created and made to bear record of me.’ This isn’t in our current Genesis, but it’s a key that unlocks the purpose of every symbol and story in the Old Testament—they all testify of Christ."
    },
    {
      "speaker": "Sarah",
      "text": "I’ve never noticed that verse before. It’s like a mission statement for the scriptures. What’s another hidden connection?"
    },
    {
      "speaker": "David",
      "text": "Another is in the Book of Abraham. In Abraham 3:22-28, we get a glimpse of the pre-mortal council in heaven, where the Savior volunteers to be our Redeemer. This isn’t in the traditional Old Testament, but it shows Jehovah—Jesus—planning our salvation before the world was even created. It connects directly to His role in every covenant made with ancient prophets."
    },
    {
      "speaker": "Sarah",
      "text": "That’s incredible. It’s like seeing behind the curtain of history. How does this connect to something else we might read?"
    },
    {
      "speaker": "David",
      "text": "It ties beautifully to Exodus 19:5, where God calls Israel His ‘peculiar treasure’ through covenant. This covenant relationship, orchestrated by Jehovah, is the same one Christ extends to us today through the Restoration. It’s also echoed in modern teachings, like President Russell M. Nelson’s message on ‘The Everlasting Covenant’ in the October 2022 Liahona, where he emphasizes that this covenant spans all time."
    },
    {
      "speaker": "Sarah",
      "text": "I’m seeing this web of connections now—from Adam to Abraham to us today. Let’s talk about how these ancient patterns apply to our lives. How does understanding Jesus as Jehovah change how we approach the Old Testament this year?"
    },
    {
      "speaker": "David",
      "text": "It transforms everything, Sarah. When we read the Old Testament, we’re not just studying history—we’re studying our Savior’s direct interactions with His people. Every covenant, like the one in Jeremiah 31:31-34 about a new covenant written in our hearts, becomes personal. It’s an invitation to see how He’s working in our lives right now."
    },
    {
      "speaker": "Sarah",
      "text": "That’s so meaningful. It makes the Old Testament feel alive and relevant. What’s one practical way we can look for Him as we study?"
    },
    {
      "speaker": "David",
      "text": "One way is to focus on symbols, as Elder Dale G. Renlund suggested in his message ‘Jesus Christ Is the Treasure’ in the November 2023 Liahona. Look for types of Christ—like the manna or the brass serpent—and ask, ‘What does this teach me about the Savior’s role in my life?’ It deepens our connection to Him and to the scriptures."
    },
    {
      "speaker": "Sarah",
      "text": "I love that approach. It’s like going on a treasure hunt with every chapter. David, before we wrap up, what’s one final thought or invitation you’d like to leave with our listeners as we start this journey through the Old Testament?"
    },
    {
      "speaker": "David",
      "text": "I’d invite everyone to approach the Old Testament with fresh eyes, looking for Jesus Christ in every story, symbol, and covenant. Remember the words of the psalmist in Psalm 119:105, ‘Thy word is a lamp unto my feet, and a light unto my path.’ Let that light guide you to see the Savior’s hand throughout this sacred record."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a beautiful invitation, David. I’m so excited to dive into these stories with this new perspective. Thank you for joining me today, and I can’t wait to continue uncovering these truths together."
    },
    {
      "speaker": "David",
      "text": "Thanks, Sarah. I’m thrilled to be part of this journey with you and our listeners. Let’s keep searching for that light!"
    }
  ],
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-01 02:08:54",
  "source_week_file": "cfm_2026_week_01.json"
}