{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "connected",
  "duration_estimate": "~10.7 minutes",
  "word_count": 1601,
  "character_count": 9033,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, the world sprawling endlessly beneath you, as a divine voice speaks directly to your soul, saying, “Behold, thou art my son.” Can you feel the weight of that moment? That’s exactly what Moses experienced in a vision that transformed his understanding of himself and his place in God’s plan, as recorded in Moses chapter 1. Today, we’re diving into this sacred account alongside Abraham chapter 3, exploring profound truths about who we are, where we came from, and what God’s ultimate purpose is for each of us. These chapters aren’t just ancient history—they’re a personal invitation to see yourself through Heaven’s eyes. So, let’s journey together into these revelations and uncover how they speak to your life right now.\n\nLet’s start with Moses on that mountain. In Moses 1:4, the Lord declares to him, “Behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands.” Two verses later, in Moses 1:6, God reaffirms, “And I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten.” Notice the tenderness here—God doesn’t just call Moses by name; He claims him as His own, His son, created in the image of Jesus Christ. This isn’t merely a title; it’s an identity that shapes everything. But contrast this with what happens soon after. In Moses 1:12, Satan appears, tempting Moses with a counterfeit message, saying, “Moses, son of man, worship me.” Do you see the difference? God lifts Moses up with divine identity, while Satan seeks to diminish him, reducing him to mere mortality. This clash of messages isn’t just Moses’s story—it’s yours and mine. How often do we hear voices, whether from the world or within, that try to strip away our divine worth? Pause to let that resonate. What voices are you listening to about who you are?\n\nThis truth of identity as children of God is foundational, and it’s something President Russell M. Nelson has emphasized powerfully. He taught, “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity.” That’s from his worldwide devotional for young adults in May 2022, titled “Choices for Eternity.” He also said, “The way you think about who you really are affects almost every decision you will ever make.” Think about that for a moment. If you truly see yourself as a child of God, how does that change the way you treat yourself, others, or even the choices you face daily? This isn’t just theology—it’s practical, life-altering truth. And Moses’s experience shows us that embracing this identity equips us to resist the adversary. When Satan pressed harder, Moses responded in Moses 1:13, “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?” Moses stood firm because he knew who he was. Let that truth settle in your heart. How can knowing you’re a child of God give you strength to stand against temptation today?\n\nBuilding on that vision, let’s turn to how Moses’s story unfolds after this confrontation. After resisting Satan—through prayer, faith, and calling upon God’s name, as we see in Moses 1:18 and 20-21—the Lord returns to show Moses the vastness of His creations. In Moses 1:27-28, Moses beholds the earth and all its inhabitants, marveling at the scope of God’s work. But he’s not content just to see; he wants to understand. In Moses 1:30, he asks, “Tell me, I pray thee, why these things are so, and by what thou madest them?” Don’t you love that curiosity? Moses wants the “why” behind it all. And the Lord’s answer in Moses 1:39 is one of the most beautiful declarations in scripture: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” Stop and reflect on that for a second. God’s entire purpose, His endless creations, His infinite power—it’s all for you, for me, to help us gain eternal life. Immortality is to live forever, but eternal life is to live with God, in His presence, becoming like Him. And at the center of this plan is Jesus Christ, the Only Begotten, who makes it all possible through His Atonement.\n\nThis truth leads us seamlessly into Abraham chapter 3, where we get another glimpse into God’s plan, this time through Abraham’s vision of the premortal world. In Abraham 3:22-23, we read, “Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones; And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born.” Can you picture that scene? Before this earth even existed, you and I were there as spirits, known and loved by God. Some, like Abraham, were chosen for specific roles, but all of us were part of this grand council. And in verses 24-25, the purpose of this earth becomes clear: “And there stood one among us that was like unto God, and he said unto us: I will go down, for there is space there, and we will take of these materials, and we will make an earth whereon these may dwell; And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” That “one like unto God” is Jesus Christ, chosen to be our Savior, to create this world, and to redeem us. This life, then, is a test, a proving ground, to see if we will choose God’s will over our own.\n\nNotice how this pattern continues in both Moses and Abraham’s accounts. God reveals identity, purpose, and the central role of Jesus Christ. In Abraham 3:26, we learn the promise tied to this test: “And they who keep their first estate shall be added upon; and they who keep not their first estate shall not have glory in the same kingdom with those who keep their first estate; and they who keep their second estate shall have glory added upon their heads for ever and ever.” Keeping our “first estate” meant choosing to follow God’s plan in the premortal life; keeping our “second estate” means being faithful here on earth. What a powerful reminder that our choices matter, then and now, and that Christ’s Atonement offers us the way to return to glory. How does knowing you lived as a spirit before this life, with a purpose to fulfill, shape the way you see your daily struggles or decisions?\n\nLet’s deepen this understanding by connecting these truths across the scriptures. Think about Matthew 4:1-11, where Jesus Himself is tempted by Satan in the wilderness. Just as Moses faced counterfeit offers, Jesus was tempted with power and glory apart from God’s plan. Yet, like Moses, He stood firm, relying on the word of God to resist. This pattern shows us that no one is exempt from temptation, not even the Savior, but with divine help, we can overcome. Elder Gary E. Stevenson, in his October 2019 General Conference talk “Deceive Me Not,” warned of Satan’s modern counterfeits—false ideas about identity, worth, or happiness that pull us away from truth. How can you discern those counterfeits in your own life? What helps you hold to God’s voice over the noise?\n\nAs we draw this exploration to a close, let’s reflect on what these chapters reveal about God’s love for you. From Moses 1, we see that you are a child of God, with a divine identity and a work to do. From Abraham 3, we understand that your life began long before this earth, that you were part of a heavenly plan, and that Christ stands at the center of it all to bring you home. God’s work and glory, as declared in Moses 1:39, is your eternal life. Take a quiet moment to let that sink in. How does this vision of your divine worth and premortal origin change the way you see yourself or the challenges you face?\n\nI invite you to act on these truths in a few specific ways. First, individually, take time this week to ponder Moses 1:4 and Abraham 3:22-23. Write in your journal how knowing you’re a child of God, chosen before this world, influences a specific decision or struggle you’re facing. Second, as a family, discuss during a meal or family time how you can resist Satan’s counterfeits, using Moses 1:12-18 as a guide. Share experiences where you’ve felt God’s strength in overcoming temptation. Third, consider singing or reading the lyrics to “I Am a Child of God” from the hymnal or “I Will Follow God’s Plan” from the Children’s Songbook, and talk about how these songs reinforce the truths we’ve studied. Let these activities draw you closer to the reality of who you are in God’s eyes.\n\nNext week, we’ll continue this journey into the Creation and the Fall, exploring how these early events in Genesis set the stage for God’s covenant promises. Until then, may you carry the truth of your divine identity deep in your heart, guiding every step you take.",
  "generated_timestamp": "2025-12-26 19:46:37",
  "source_week_file": "cfm_2026_week_02.json"
}