{
  "week_number": 8,
  "title": "Week 8: February 16–22 - Genesis 12–17; Abraham 1–2",
  "date_range": "February 16–22",
  "study_level": "scholarly",
  "duration_estimate": "~12.0 minutes",
  "word_count": 1800,
  "character_count": 10333,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a dusty hill in ancient Canaan, the sun dipping low on the horizon, as a man named Abram—soon to be Abraham—gazes across a vast, unfamiliar land. The Lord has just spoken to him, saying, “Get thee out of thy country, and from thy kindred, and from thy father’s house, unto a land that I will shew thee” (Genesis 12:1). This is no small request. Abram is leaving behind everything familiar—his home, his culture, and even a family steeped in idolatry. Yet, with a heart full of faith, he steps forward into the unknown. What drives a man to abandon all for a divine promise? What kind of trust does that require? Today, as we dive into Genesis 12 through 17 and Abraham 1 through 2, we’ll explore the life of Abraham, the father of the faithful, and uncover how his journey of righteousness and covenant-making can illuminate our own path toward God.\n\nLet’s begin with Abraham’s burning desire, a longing that sets the tone for his entire story. In Abraham 1:2, he reveals his heart, saying, “I sought for the blessings of the fathers, and the right whereunto I should be ordained to administer the same; having been myself a follower of righteousness, desiring also to be one who possessed great knowledge, and to be a greater follower of righteousness, and to possess a greater knowledge, and to be a father of many nations, a prince of peace.” Pause for a moment to let that resonate. Abraham isn’t content with mediocrity. He yearns for more—more righteousness, more knowledge, more connection to God. And notice how his desires shape his actions. Despite coming from a troubled family—his own father sought to have him sacrificed to false gods, as we read in Abraham 1:7-12—Abraham chooses a different path. He seeks the priesthood, the blessings of the fathers, and ultimately, the presence of Jehovah Himself. How did God respond to such a desire? In Abraham 1:18, the Lord declares, “Behold, I will lead thee by my hand, and I will take thee, to put upon thee my name, even the Priesthood of thy father.” God honors Abraham’s righteous longing by leading him, protecting him, and covenanting with him.\n\nThis truth leads us to a powerful question: What are the desires of your heart? Are they drawing you closer to God, as Abraham’s did? Think about how your deepest yearnings show up in your choices. Maybe you’ve felt a pull to know the scriptures better, to serve more fully, or to overcome a personal struggle. Consider how God might be supporting those desires right now, just as He supported Abraham. And if your family or surroundings make righteousness feel like an uphill battle, take heart from Abraham’s story. His past didn’t define his future—his desires and faith did. How might God be inviting you to trust Him, even when the way forward feels unclear?\n\nBuilding on that vision of trust, let’s turn to the covenant God makes with Abraham, a promise so profound it echoes through generations and reaches even to us. In Genesis 12:2-3, the Lord says, “And I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing: And I will bless them that bless thee, and curse him that curseth thee: and in thee shall all families of the earth be blessed.” Later, in Abraham 2:9-11, this covenant expands: “And I will make of thee a great nation, and I will bless thee above measure, and make thy name great among all nations, and thou shalt be a blessing unto thy seed after thee, that in their hands they shall bear this ministry and Priesthood unto all nations; And I will bless them through thy name; for as many as receive this Gospel shall be called after thy name, and shall be accounted thy seed, and shall rise up and bless thee, as their father.” Reflect on that for a second. This isn’t just about Abraham’s immediate family—it’s about you and me. Through the gospel of Jesus Christ, we are accounted as Abraham’s seed, heirs to these promises, as affirmed in Galatians 3:26-29.\n\nWhat are these promises, exactly? As we study Genesis 13:15-16, 15:1-6, and 17:1-8, we see a land of inheritance, a posterity as numerous as the stars or the sand, and an everlasting connection to God. In Doctrine and Covenants 132:30-32, we learn that these blessings have eternal parallels—think of the celestial kingdom as the ultimate land of inheritance, or eternal increase as the fulfillment of a vast posterity. But notice something else in Genesis 12:2: God tells Abraham to “be a blessing.” It’s not enough to receive; Abraham is called to give, to lift others through his faith and priesthood. How are you called to be a blessing in your family, your ward, or your community? Perhaps it’s through sharing the gospel, offering a kind word, or simply living with integrity. Let that thought settle in your heart.\n\nThis covenant theme deepens when we consider how Abraham and Sarah faced delays in receiving their promised posterity. In Genesis 15:2-3, Abraham laments, “Lord God, what wilt thou give me, seeing I go childless, and the steward of my house is this Eliezer of Damascus? … Behold, to me thou hast given no seed.” Yet God reassures him in verse 5, saying, “Look now toward heaven, and tell the stars, if thou be able to number them: and he said unto him, So shall thy seed be.” Hebrews 11:11-12 adds that Sarah, through faith, “received strength to conceive seed, and was delivered of a child when she was past age, because she judged him faithful who had made the promise.” Take a quiet moment to ponder their patience. How do you hold on to God’s promises when they seem far off? Whether it’s waiting for a personal blessing, a family need, or a spiritual answer, the Savior invites you to embrace His promises with faith, just as Abraham and Sarah did. How might He be strengthening you in your waiting?\n\nLet’s shift now to another figure in Abraham’s story—Melchizedek, a man whose brief appearance carries immense significance. In Genesis 14:18-19, we read, “And Melchizedek king of Salem brought forth bread and wine: and he was the priest of the most high God. And he blessed him, and said, Blessed be Abram of the most high God, possessor of heaven and earth.” The Joseph Smith Translation in Genesis 14:26-27 expands on this, revealing that Melchizedek “was a man of faith, who wrought righteousness; and when a child he feared God, and stopped the mouths of lions, and quenched the violence of fire.” Further, in Alma 13:18-19, we learn that Melchizedek’s people “had waxed strong in iniquity and abomination,” yet he “did establish peace in the land in his days; therefore he was called the prince of peace.” What a powerful type of Christ we see here—a priest, a king, a peacemaker, one who administers sacred ordinances symbolized by bread and wine. As you reflect on Melchizedek, how does his life shape your understanding of the Melchizedek Priesthood today? If you hold this priesthood, how might you emulate his faith and righteousness? If you receive its blessings, how can you honor its sacred power in your life?\n\nNotice how this pattern continues in Abraham’s own faithfulness, particularly in his attitude toward worldly wealth. After a victorious battle, the king of Sodom offers him spoils, yet Abraham responds in Genesis 14:23, “I will not take from a thread even to a shoelatchet, and that I will not take any thing that is thine, lest thou shouldest say, I have made Abram rich.” The Joseph Smith Translation in Genesis 14:37-39 adds that Abraham “paid unto Melchizedek tithes of all that he had, of all the riches which he possessed, which God had given him more than that which he had need.” Abraham’s priority isn’t material gain; it’s spiritual integrity. He gives to God through tithing and refuses to let worldly wealth define him. How does tithing shape your own view of money? Does it help you, like Abraham, to keep your heart aligned with heavenly priorities?\n\nLet’s turn now to a tender moment in Genesis 16, where we meet Hagar, Sarah’s handmaid, who faces deep sorrow and feels unheard. Fleeing into the wilderness, she encounters an angel of the Lord, who says in verse 11, “Behold, thou art with child, and shalt bear a son, and shalt call his name Ishmael; because the Lord hath heard thy affliction.” Ishmael means “God hears.” Pause to let that truth sink in. Just as God heard Hagar in her loneliness, He hears you. Think of a time when you felt unseen or burdened. How did the Lord show you that He was listening? Maybe it was through a prompting, a kind friend, or a quiet assurance in prayer. Hagar’s story, alongside Abraham’s deliverance from danger in Abraham 1:15-17, reminds us that God is ever attentive to our cries.\n\nAs we draw this journey to a close, let’s reflect on what Abraham’s life teaches us about becoming greater followers of righteousness. His story is one of desire—yearning for God’s blessings and choosing faith over familiarity. It’s a story of covenant—entering into sacred promises that bind us to God and to each other across generations. And it’s a story of trust—holding fast to divine assurances even when the fulfillment seems distant. Abraham’s path wasn’t easy, but it was guided by the hand of the Lord, as we read in Abraham 1:18. So, where is the Lord leading you by the hand today? What righteous desires is He inviting you to pursue? How might your covenants with Him—whether through baptism, the temple, or daily devotion—become a source of strength and purpose?\n\nI invite you to take some time this week to ponder these questions in your personal study. Open Genesis 15 or Abraham 2 and list the promises God made to Abraham, then consider how they apply to you as part of his covenant family. Share your thoughts with a loved one or in a family discussion—how can you together be a blessing to others, as Abraham was called to be? If possible, spend a quiet moment in the temple, reflecting on the eternal nature of these covenants and seeking the Lord’s guidance. And finally, in your prayers, ask God to help you recognize how He hears you, just as He heard Hagar and Abraham in their moments of need. May you feel His hand leading you, step by step, as you strive to be a greater follower of righteousness. Until we meet again, keep seeking, keep trusting, and keep covenanting with Him.",
  "generated_timestamp": "2025-12-26 20:23:04",
  "source_week_file": "cfm_2026_week_08.json"
}