{
  "week_number": 6,
  "title": "Week 6: February 2–8 - Moses 7",
  "date_range": "February 2–8",
  "study_level": "essential",
  "duration_estimate": "~9.3 minutes",
  "word_count": 1392,
  "character_count": 7549,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, gazing across a world filled with chaos and strife, when suddenly, you see a city shining with light, a place of peace and unity unlike anything you've ever known. This is the vision Enoch received in Moses 7, a glimpse of Zion, a city so holy that it was taken up to God. But Zion isn’t just a far-off dream or a distant place. It’s something we’re called to build right now, in our hearts, in our homes, and in our communities. So, what can we learn from Enoch’s story about creating a Zion-like spirit wherever we are? Let’s dive into this sacred chapter together and uncover the answers.\n\nAs we open Moses 7, we find Enoch, a prophet who walked with God, receiving a powerful vision. He sees the Lord Himself and learns profound truths about the nature of God and His desires for His children. One of the first things that strikes us is in verse 18, where we read, “And the Lord called his people Zion, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them.” Pause to let that resonate. One heart and one mind. No poverty. Complete righteousness. What would it feel like to live in a place like that? What would it take for us to create that kind of unity in our own lives?\n\nThis idea of Zion isn’t just about a physical city. It’s a condition of the heart. As we’re taught in Doctrine and Covenants 97:21, “Zion is the pure in heart.” So, building Zion starts within us. Think about your own life for a moment. Are there relationships where you feel that sense of being of one heart with someone? Maybe it’s with a family member, a friend, or a group at church. What made that unity possible? Was it shared goals, kindness, or simply listening to each other? Enoch’s people show us that Zion comes when we align our hearts with God’s will and with each other, putting aside selfishness and contention.\n\nNow, let’s look deeper into how Enoch’s vision reveals God’s nature, because understanding Him is the foundation of building Zion. In Moses 7:28-29, Enoch sees something astonishing. The heavens weep, and God Himself sheds tears over the wickedness of His children. Enoch asks in verse 29, “How is it that the heavens weep, and shed forth their tears as the rain upon the mountains?” He’s stunned. Why would the Creator of all things feel such sorrow? The Lord answers in verse 33, saying, “Unto thy brethren have I said, and also given commandment, that they should love one another, and that they should choose me, their Father; but behold, they are without affection, and they hate their own blood.” God’s grief comes from seeing His children turn away from Him and from each other. Reflect on that for a second. The God of the universe feels pain when we choose division over unity, hatred over love. What does that teach us about how much He cares for each of us?\n\nBut this vision isn’t just about sorrow. It’s also about hope. As Enoch continues to see the future, he weeps with God over the suffering of the world, but then the Lord shows him reasons to rejoice. In Moses 7:62, we read a beautiful prophecy of the last days: “And righteousness will I send down out of heaven; and truth will I send forth out of the earth, to bear testimony of mine Only Begotten; his resurrection from the dead; yea, and also the resurrection of all men; and righteousness and truth will I cause to sweep the earth as with a flood, to gather out mine elect from the four quarters of the earth, unto a place which I shall prepare, an Holy City, that my people may gird up their loins, and be looking forth for the time of my coming; for there shall be my tabernacle, and it shall be called Zion, a New Jerusalem.” Let that truth settle in your heart. God promises a future Zion, a New Jerusalem, where righteousness and truth will prevail. This isn’t just a dream for Enoch’s time—it’s a promise for ours. How does that give you hope as you face the challenges of the world today?\n\nBuilding on that vision, let’s connect this to another powerful truth in Moses 7:53, where the Lord declares, “And the Lord said unto Enoch: Then shalt thou and all thy city meet them there, and we will receive them into our bosom, and they shall see us; and we will fall upon their necks, and they shall fall upon our necks, and we will kiss each other.” Here, Jesus Christ is called “the King of Zion.” What does it mean to you to have Him as your King? Think about His other titles in this verse—Messiah, Son of Man, the Right Hand. Each name reveals His power, His love, and His role as our Savior. To come to Zion, we must climb up by Him, entering through the gate of His gospel. How can you draw closer to Him as your King today?\n\nThis truth leads us to consider how we prepare for His return, which Enoch saw in vivid detail. In Moses 7:60, the Lord tells Enoch, “As I live, even so will I come in the last days, in the days of wickedness and vengeance, to fulfil the oath which I have made unto you concerning the children of Noah.” Jesus will come again, and Zion will be established. Imagine that day. What will it be like to see Him? How can we prepare our hearts and our lives for that moment? Perhaps it’s by striving to live as Enoch’s people did—being of one heart with those around us, caring for the poor, and seeking righteousness.\n\nNotice how this pattern continues in other scriptures. In 4 Nephi 1:15-16, we read about another Zion-like society after Christ’s visit to the Americas: “And it came to pass that there was no contention in the land, because of the love of God which did dwell in the hearts of the people. And there were no envies, nor strifes, nor tumults, nor whoredoms, nor lyings, nor murders, nor any manner of lasciviousness; and surely there could not be a happier people among all the people who had been created by the hand of God.” What created this happiness? The love of God in their hearts. That’s the same key Enoch’s people used to build Zion. So, how can we invite more of God’s love into our lives to transform our relationships and communities?\n\nAs we reflect on these truths, let’s bring this closer to home. Zion starts with us, in the small choices we make every day. Maybe it’s reaching out to someone who feels left out, sharing what we have with someone in need, or simply praying to see others as God sees them. Building Zion is about becoming pure in heart, as we’re reminded in Doctrine and Covenants 97:21. It’s about letting go of pride and selfishness and choosing unity over division. Take a quiet moment to think about one relationship or situation in your life where you could foster more unity. What’s one step you can take this week to be of one heart and one mind with someone?\n\nAs we close, remember that Enoch’s vision is not just a story from the past—it’s a call to action for us today. God weeps over His children when we stray, but He also rejoices in our efforts to return to Him and build Zion. He promises a future where righteousness will sweep the earth, and He invites us to be part of that work now. So, I invite you to ponder Moses 7:18 this week. Read it again, and ask yourself, “How can I help create a Zion spirit in my home or community?” Write down one specific thing you feel prompted to do, whether it’s serving someone, forgiving someone, or drawing closer to the King of Zion through prayer. Let’s start building Zion today, one heart at a time. Until we meet again, may you feel the Lord’s love guiding you in this sacred work.",
  "generated_timestamp": "2025-12-26 20:17:03",
  "source_week_file": "cfm_2026_week_06.json"
}