{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~8.7 minutes",
  "word_count": 1302,
  "character_count": 7331,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on the edge of a vast, ancient landscape, the dust of the desert under your feet, the whispers of a thousand stories carried on the wind. You’re about to embark on a journey through the Old Testament, a collection of sacred writings that are among the oldest in the world. These stories, laws, and prophecies might feel distant or even intimidating at first. But as you step into this world, you’ll find something remarkable: echoes of your own life. People like Abraham and Sarah, Hannah and Daniel, faced family joys and struggles, moments of faith and doubt, just as we do. And through it all, they clung to the promise of a Savior. So, let’s begin this journey together, discovering how these ancient words can light our path today, just as the psalmist declared, “Thy word is a lamp unto my feet, and a light unto my path” (Psalm 119:105).\n\nLet’s start by asking a simple question: When you think about studying the Old Testament this year, how do you feel? Maybe you’re eager to uncover hidden treasures, or perhaps a little uncertain about diving into something so vast and ancient. Those feelings are completely understandable. The culture and context of the Old Testament can seem foreign, even strange at times. Yet, within these pages, we find universal human experiences—faith, repentance, covenants, and the longing for divine help. More than anything, we find Jesus Christ woven into every story, every symbol, every prophecy. The Old Testament isn’t just a history of an ancient people; it’s a witness of the divinity of our Savior and His gospel. So, how can we see Him as we read?\n\nConsider some powerful examples. Think about the manna that sustained the children of Israel in the wilderness, as described in Exodus 16:4, where the Lord says, “Behold, I will rain bread from heaven for you.” Jesus Himself pointed to this symbol when He declared, “I am the bread of life” (John 6:35). Or picture the sacrificial lamb of the Passover in Exodus 12:3-5, spotless and without blemish, a direct foreshadowing of Christ, whom John called “the Lamb of God, which taketh away the sin of the world” (John 1:29). Then there’s the brass serpent raised by Moses in the desert, recorded in Numbers 21:4-10, where those who looked upon it were healed—a clear parallel to Christ being lifted up on the cross, as He taught in John 3:14, “As Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.” Even Jonah, swallowed by the great fish for three days and nights in Jonah 1:4-17, mirrors the Savior’s time in the tomb, as Jesus explained in Matthew 12:38-41. Pause to let that resonate. What do these symbols teach you about who Jesus is—your Provider, your Sacrifice, your Healer, your Deliverer?\n\nThis truth leads us to a profound realization: Jesus Christ is Jehovah, the God of the Old Testament. President Dallin H. Oaks taught, “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). Think about that for a moment. When Jehovah spoke to Moses at the burning bush in Exodus 3:13-15, declaring, “I AM THAT I AM,” it was Jesus, the same who later told the Jews, “Before Abraham was, I am” (John 8:58). That statement shocked them, and no wonder—it revealed His eternal identity as their God. Reflect on that for a second. How does knowing that Jesus is Jehovah deepen your connection to these ancient stories?\n\nBuilding on that vision, let’s consider how the Lord has ensured we can understand these truths more fully today. Through the Prophet Joseph Smith, many “plain and precious things” that were lost from the Bible have been restored. In 1 Nephi 13:21-29, Nephi saw in vision that parts of the gospel would be taken away from the scriptures, but the Lord promised to bring forth other books to make those truths known again. According to 2 Nephi 3:12, the Bible and the Book of Mormon grow together, confounding false doctrines and bringing us to a knowledge of God’s covenants. Think about some of those restored truths in the Pearl of Great Price—Enoch’s city of Zion in Moses 7:18-19, Abraham’s vision of the premortal council in Abraham 3:22-28, or Melchizedek’s ministry in the Joseph Smith Translation of Genesis 14:25-40. These accounts fill in gaps, helping us see the bigger picture of God’s plan. Why do these restored truths matter to you? How do they help you feel closer to the Lord as you read the Old Testament?\n\nThis brings us to another beautiful theme: the Old Testament is a story of covenants, of God seeking to make us His “peculiar treasure,” as He promised in Exodus 19:5. Covenants are at the heart of our relationship with Him. They show His love and mercy as we strive to keep our promises to Him. As you read stories of Abraham, Isaac, and Jacob, ask yourself: What does God want me to learn about my own covenant relationship with Him? How do I see His hand in my life as I strive to live those sacred promises? Let that truth settle in your heart. Even in the simplest moments—like a baptism, where we covenant to take upon us His name as taught in Mosiah 18:10, 13—or in the sacred ordinances of the temple, we are drawn closer to Him through covenants.\n\nNow, if you’re teaching children or learning alongside them, remember that the Old Testament can come alive for them too. Help them see Jesus in the stories and symbols. Read together from Isaiah 7:14, where the prophet foretold, “Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel,” or Isaiah 9:6, which declares, “For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.” Talk about how these words point to Jesus. Or share Psalm 23, where the Lord is our Shepherd, and ask them what words remind them of the Savior’s care. You can even talk about covenants in simple ways—compare them to promises we make with family or friends, and then discuss the promises we make with God at baptism or in the temple. Sing a song like “When I Am Baptized” from the Children’s Songbook to help them feel the joy of those sacred commitments.\n\nAs we close this introduction to the Old Testament, let’s reflect on the journey ahead. These ancient writings are more than history—they are a lamp to guide us, a light to show us the Savior in every page. They remind us that Jesus Christ is Jehovah, the God who spoke to prophets of old and speaks to us today through restored truths and covenants. They invite us to see His hand in our lives, just as He was in the lives of Abraham, Sarah, and so many others. Take a quiet moment to ponder this: How will you look for Jesus Christ as you study the Old Testament this year? I invite you to set a simple goal—perhaps to notice one symbol or story each week that points to the Savior. Write it down, share it with a family member, or just keep it in your heart as a reminder to seek Him. As you do, you’ll find that these ancient words become a living witness of His love and power in your life. Thank you for joining me today, and I look forward to walking this path through the Old Testament with you.",
  "generated_timestamp": "2025-12-26 20:06:14",
  "source_week_file": "cfm_2026_week_01.json"
}