{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~6.9 minutes",
  "word_count": 1032,
  "character_count": 5984,
  "segment_count": 25,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David. Happy to be here!"
    },
    {
      "speaker": "Sarah",
      "text": "David, I’ve got a question that’s been nagging at me. What if I told you there’s something most people miss in the Old Testament—a hidden thread that ties every story to Jesus Christ, even in the very first chapters? How could that even be possible?"
    },
    {
      "speaker": "David",
      "text": "Oh, Sarah, that’s the perfect place to start. The Old Testament is absolutely saturated with references to Jesus Christ, often in ways we don’t expect. It’s like a treasure map, and once you know what to look for, you see Him everywhere. Let’s dive into this idea of symbols and types that point to the Savior."
    },
    {
      "speaker": "Sarah",
      "text": "I love that image of a treasure map. So, where do we start looking? How do we even begin to see Jesus in stories that seem so ancient and disconnected from the New Testament?"
    },
    {
      "speaker": "David",
      "text": "Great question. One way is to focus on what the scriptures themselves teach us about symbols. In Moses 6:63, the Lord tells Adam, ‘All things have their likeness, and all things are created and made to bear record of me.’ So, from the very beginning, everything—every story, every symbol—was meant to point to Christ."
    },
    {
      "speaker": "Sarah",
      "text": "Wait, everything? That’s a bold statement. Can you give me an example from the Old Testament where we see this clearly?"
    },
    {
      "speaker": "David",
      "text": "Absolutely. Think about the manna in Exodus 16. The Lord provides bread from heaven to sustain the Israelites during their wilderness journey. Now, fast forward to John 6:35, where Jesus declares, ‘I am the bread of life: he that cometh to me shall never hunger.’ Notice the pattern—God’s provision in the desert isn’t just physical sustenance; it’s a shadow of the spiritual nourishment Christ offers."
    },
    {
      "speaker": "Sarah",
      "text": "That’s fascinating! So, from an ancient Israelite’s perspective, manna was just food to survive, but from Christ’s perspective, it’s a symbol of Himself. How does that shift when we think about our modern view?"
    },
    {
      "speaker": "David",
      "text": "Exactly, Sarah. Today, as Latter-day Saints, we can see this through the lens of the sacrament. Just as manna sustained the Israelites, and Christ offers Himself as the bread of life, the sacrament bread reminds us weekly of His Atonement. It’s a thread that runs from Exodus to the Gospels to our chapels today."
    },
    {
      "speaker": "Sarah",
      "text": "I’m starting to see this pattern emerge across time. Let’s trace it further. Are there other symbols like this in the Old Testament that connect across dispensations?"
    },
    {
      "speaker": "David",
      "text": "Oh, there are so many. Another powerful one is the sacrificial lamb from Exodus 12:3-5. The Passover lamb had to be without blemish, a perfect offering. Then, in John 1:29, John the Baptist sees Jesus and says, ‘Behold the Lamb of God, which taketh away the sin of the world.’ It’s a direct line from an ancient ritual to the ultimate sacrifice of Christ."
    },
    {
      "speaker": "Sarah",
      "text": "That gives me chills. It’s like the Israelites were rehearsing Christ’s Atonement without even realizing it. What’s a historical detail around this that might help us feel even closer to that time?"
    },
    {
      "speaker": "David",
      "text": "Here’s something intriguing. In ancient Israelite culture, the Passover wasn’t just a meal; it was a deeply communal act of remembrance. Families gathered, retold the story of deliverance, and marked their doorposts with the lamb’s blood. Archaeologists have found evidence of these practices in ancient settlements, showing how central this ritual was—it’s a time collapse moment when we realize they were preparing for Christ just as we look back to Him."
    },
    {
      "speaker": "Sarah",
      "text": "That’s incredible. It makes the Old Testament feel so much more alive. Going back to our original question—how everything points to Christ—how does this all resolve? What’s the big picture here?"
    },
    {
      "speaker": "David",
      "text": "Here’s where it gets powerful, Sarah. The Old Testament isn’t just a history book; it’s a testimony of Jesus Christ as Jehovah, the God of Israel. President Dallin H. Oaks taught that when we read ‘God’ or ‘Lord’ in the Old Testament, it’s almost always referring to Jehovah, who is Jesus Christ. So, every interaction, every covenant, is with Him—before He even came to earth."
    },
    {
      "speaker": "Sarah",
      "text": "I never saw it that way! So, when God speaks to Moses or Abraham, it’s Jesus Christ as Jehovah. That changes everything about how I read these stories."
    },
    {
      "speaker": "David",
      "text": "It does. And here’s a hidden connection most people miss. In John 8:58, Jesus says, ‘Before Abraham was, I am.’ That phrase ‘I am’ directly echoes Exodus 3:14, where God tells Moses, ‘I AM THAT I AM.’ The Jews understood this claim and were ready to stone Him for it because He was declaring Himself as Jehovah."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a jaw-dropping connection. It’s like a bridge between the Old and New Testaments. How does this tie into the restorations we have through Joseph Smith?"
    },
    {
      "speaker": "David",
      "text": "It’s huge. In 1 Nephi 13:21-29, Nephi sees that many ‘plain and precious things’ would be lost from the Bible. Through Joseph Smith, we get restorations like the Book of Moses and the Book of Abraham, which clarify Christ’s role from the very beginning. For example, in Abraham 3:22-28, we see Christ as the chosen one in the premortal council—something the Old Testament alone doesn’t fully reveal."
    },
    {
      "speaker": "Sarah",
      "text": "That’s remarkable. These restorations make the Old Testament so much richer. How can we apply this understanding of Christ in the Old Testament to our lives right now?"
    },
    {
      "speaker": "David",
      "text": "Here’s the practical side. As we study the Old Testament this year, we can look for Christ in every story and symbol, just as Elder Dale G. Renlund encouraged us to ‘remember and always focus on Jesus Christ.’ It’s about letting these ancient writings draw us closer to Him in our daily walk."
    },
    {
      "speaker": "Sarah",
      "text": "I love that. It’s like an invitation to see the Savior with fresh eyes. David, before we wrap up, what’s one thing you hope listeners will do after hearing this?"
    },
    {
      "speaker": "David",
      "text": "I hope everyone will pick up their scriptures and start looking for Jesus Christ in the Old Testament. Whether it’s in the manna, the lamb, or the words of the prophets, He’s there. Let that search transform how you see these sacred stories."
    },
    {
      "speaker": "Sarah",
      "text": "That’s a beautiful challenge. Thank you, David, for helping us uncover these treasures. I can’t wait to dive deeper into the Old Testament with this new perspective."
    }
  ],
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-01 02:07:21",
  "source_week_file": "cfm_2026_week_01.json"
}