{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "duration_estimate": "~10.1 minutes",
  "word_count": 1514,
  "character_count": 8873,
  "segment_count": 31,
  "script": [
    {
      "speaker": "David",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "And I'm Sarah. Happy to be here!"
    },
    {
      "speaker": "David",
      "text": "Sarah, I’ve got to start with a mystery that’s been nagging at me as we dive into the Old Testament this year. Why would the Jews in Jesus’ time be so enraged by three simple words He spoke—‘Before Abraham was, I am’—that they were ready to stone Him on the spot? What’s hidden in that statement that’s so explosive? And how does it connect to the very foundation of the Old Testament we’re studying?"
    },
    {
      "speaker": "Sarah",
      "text": "Oh, David, that’s a fantastic question to kick things off. Those three words, ‘I am,’ are a direct echo of Jehovah’s self-identification in Exodus 3:14, where God tells Moses, ‘I AM THAT I AM.’ When Jesus says this, He’s claiming to be Jehovah Himself—the God of the Old Testament. And for the Jews, that was blasphemy worthy of death unless it was true, which is why it’s so shocking and central to understanding the Old Testament as a testimony of Christ."
    },
    {
      "speaker": "David",
      "text": "Wait, so you’re saying that when we read about Jehovah in the Old Testament, we’re actually reading about Jesus before His mortal life? That’s a game-changer. How does that shift how we should approach these ancient texts?"
    },
    {
      "speaker": "Sarah",
      "text": "Exactly, David. President Dallin H. Oaks taught that when we see ‘God’ or ‘Lord’ in the scriptures, it’s almost always referring to Jehovah, who is Jesus Christ. So as we study the Old Testament, we’re not just learning about ancient history—we’re witnessing the pre-mortal Christ interacting with His covenant people. It transforms the text into a direct witness of the Savior, which is why we’re encouraged to look for Him in every symbol and story."
    },
    {
      "speaker": "David",
      "text": "That’s fascinating, but let’s zoom out for a moment. If Jesus is Jehovah, how do we see Him from different perspectives in the Old Testament—say, from ancient Israel’s view versus how we understand Him through the lens of the Restoration? I’m curious how those viewpoints converge."
    },
    {
      "speaker": "Sarah",
      "text": "Great question. For ancient Israel, Jehovah was their deliverer and lawgiver—think of the manna in Exodus 16 or the Passover lamb in Exodus 12. They saw Him as the God who sustained and saved them physically. Through the Restoration, though, we see these as types of Christ’s spiritual salvation—He’s the Bread of Life as in John 6:35, and the Lamb of God as in John 1:29. So, the ancient view is practical and immediate, while our modern understanding reveals the eternal plan behind it."
    },
    {
      "speaker": "David",
      "text": "I love how those perspectives layer on top of each other. It’s like the Old Testament is a multi-dimensional map pointing to Christ. But let’s dig into a pattern here. Can you walk us through how this idea of Jesus as Jehovah shows up across different dispensations in the scriptures?"
    },
    {
      "speaker": "Sarah",
      "text": "Absolutely, David. Let’s trace the theme of divine identity and covenant. In the Old Testament, Jehovah reveals Himself to Moses as ‘I AM’ in Exodus 3:14, establishing His eternal nature. Fast forward to Christ’s mortal ministry, He echoes this in John 8:58 with ‘Before Abraham was, I am,’ linking Himself directly to that ancient title."
    },
    {
      "speaker": "David",
      "text": "That’s a powerful connection. What about beyond His mortal life? Does this pattern continue?"
    },
    {
      "speaker": "Sarah",
      "text": "It does. In the Restoration, we see this identity clarified in Doctrine and Covenants 110:3-4, where the Savior appears to Joseph Smith and Oliver Cowdery in the Kirtland Temple and declares, ‘I am the first and the last; I am he who liveth.’ It’s the same eternal assertion of identity. And even earlier, in the Book of Abraham 3:27, we see Christ as the one who steps forward in the pre-mortal council saying, ‘Here am I, send me.’ So this pattern of divine identity spans from premortal councils to modern revelation."
    },
    {
      "speaker": "David",
      "text": "I never noticed how consistent that thread is across time. It’s like a golden cord tying all these dispensations together. But let’s add another layer—how does the historical context of the Old Testament deepen this understanding of Jehovah as Christ?"
    },
    {
      "speaker": "Sarah",
      "text": "Let’s consider the cultural backdrop of ancient Israel. In their world, names carried immense power and identity. When Jehovah reveals His name as ‘I AM’ in Exodus 3, it’s not just a label—it’s a declaration of eternal existence, something no other god in their surrounding cultures claimed. This would have been revolutionary for the Israelites, setting Jehovah apart as the one true God, which we now know is Christ."
    },
    {
      "speaker": "David",
      "text": "That’s a time-collapse moment for me—imagining how radical that must have felt to them. What’s another historical insight that brings this to life?"
    },
    {
      "speaker": "Sarah",
      "text": "Here’s where it gets powerful. Archaeological findings, like ancient inscriptions from the Sinai region, show that the name YHWH—Jehovah—was revered and unique even among neighboring cultures. It wasn’t just another deity’s name; it carried a sense of the eternal and unchangeable, which aligns perfectly with Christ’s role as the unchanging Savior across all time. This historical reverence underscores why Jesus’ claim in John 8 was so provocative—it tapped into centuries of sacred tradition."
    },
    {
      "speaker": "David",
      "text": "That’s remarkable. It really bridges the ancient world to the theological weight of His words. Now, let’s circle back to that opening mystery—why were the Jews so ready to stone Jesus for saying ‘I am’? What’s the deeper resolution here?"
    },
    {
      "speaker": "Sarah",
      "text": "David, the resolution lies in the collision of identity and authority. By saying ‘Before Abraham was, I am’ in John 8:58, Jesus wasn’t just claiming pre-existence—He was asserting that He is Jehovah, the God who spoke to Moses. To the Jews, this was either the ultimate truth or the ultimate blasphemy, because only God could claim that name. The Old Testament sets the stage for this moment, showing us that Christ’s identity as Jehovah was always the cornerstone of His mission."
    },
    {
      "speaker": "David",
      "text": "That’s a satisfying answer—it clicks into place now. But let’s explore some hidden connections. Are there other places in the Old Testament where Christ’s identity as Jehovah is subtly woven in that most people might miss?"
    },
    {
      "speaker": "Sarah",
      "text": "Oh, there are so many. Take the brass serpent in Numbers 21:4-9. On the surface, it’s a story of healing for the Israelites, but Jesus Himself connects it to His crucifixion in John 3:14, saying, ‘As Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.’ It’s a direct type of His Atonement."
    },
    {
      "speaker": "David",
      "text": "Wait, what? That’s incredible. A story I’ve read a hundred times just took on a whole new meaning. What’s another one?"
    },
    {
      "speaker": "Sarah",
      "text": "Notice this in Jonah 1:4-17. Jonah’s three days in the belly of the whale foreshadows Christ’s three days in the tomb, as Jesus points out in Matthew 12:38-41. It’s not just a dramatic tale—it’s a prophetic echo of the Resurrection. These connections are all over the Old Testament if we look for them."
    },
    {
      "speaker": "David",
      "text": "That’s mind-blowing. It’s like the Old Testament is a treasure map with Christ at the center. How about one more hidden gem?"
    },
    {
      "speaker": "Sarah",
      "text": "Here’s a favorite. In Isaiah 53:3-9, we read of the suffering servant, despised and rejected, bearing our griefs. Most ancient readers might have seen this as a metaphor for Israel, but through the Restoration lens, we see it as a clear prophecy of Christ’s Atonement—His suffering for our sins. It’s one of the most poignant witnesses of Jesus as Jehovah in the Old Testament."
    },
    {
      "speaker": "David",
      "text": "I’m seeing the Old Testament in a completely new light now. But let’s bring this into our lives today. How does understanding Jesus as Jehovah in these ancient stories impact how we live our faith in the modern world?"
    },
    {
      "speaker": "Sarah",
      "text": "David, it’s transformative. Knowing that the same Jehovah who delivered the Israelites is our Savior Jesus Christ reminds us that He’s still active in our lives. Just as He provided manna then, He sustains us now through His grace and the ordinances of the gospel. It deepens our trust in His covenant promises, like those we make in the temple, connecting us directly to the everlasting covenant described in Exodus 19:5."
    },
    {
      "speaker": "David",
      "text": "That’s so powerful. It makes the Old Testament not just history, but a living guide. How else can we apply this?"
    },
    {
      "speaker": "Sarah",
      "text": "Think about covenants. The Old Testament is a story of God seeking to make us His ‘peculiar treasure’ through covenant, as in Exodus 19:5. Today, as we keep our baptismal and temple covenants, we’re participating in the same eternal relationship. It’s a reminder that His mercy and love are as real now as they were for Abraham or Moses."
    },
    {
      "speaker": "David",
      "text": "I love that connection—it makes the ancient feel so personal. Before we wrap up, Sarah, what’s one invitation you’d give to our listeners as they start this journey through the Old Testament?"
    },
    {
      "speaker": "Sarah",
      "text": "I’d invite everyone to look for Jesus Christ on every page. Whether it’s in the symbols like the sacrificial lamb or the stories of deliverance, ask yourself, ‘How does this point to the Savior?’ Let the Old Testament be a lamp unto your feet, as Psalm 119:105 says, guiding you closer to Him."
    },
    {
      "speaker": "David",
      "text": "That’s a beautiful challenge. I’m excited to take it up myself. Thanks, Sarah, for these incredible insights. I can’t wait to see what else we uncover together this year."
    }
  ],
  "host": "David",
  "guest": "Sarah",
  "voices": {
    "Sarah": "aoede",
    "David": "enceladus"
  },
  "generated_timestamp": "2026-01-04 19:44:12",
  "source_week_file": "cfm_2026_week_01.json"
}