{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "scholarly",
  "duration_estimate": "~10.5 minutes",
  "word_count": 1570,
  "character_count": 9030,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, the vast expanse of the earth stretching out beneath you, and suddenly, the veil between heaven and earth parts. You’re not just seeing the world—you’re beholding the endless creations of God, worlds without number, and hearing His voice declare who you are in the grand scheme of eternity. This is the breathtaking reality Moses encountered in Moses 1, a vision that didn’t just reveal the heavens but unveiled his own divine identity. And it’s where we begin our journey into the Old Testament for 2026, with Moses 1 and Abraham 3—scriptures that anchor us in the profound truths of who God is, who we are, and why we’re here. So, let’s step into this sacred space together and uncover the eternal answers these chapters hold for you.\n\nLet’s start with Moses, a prophet who, before receiving the Ten Commandments or leading Israel through the Red Sea, had an encounter with the Divine that reframed everything. In Moses 1, we find him on a high mountain, caught up in the glory of God. The Lord speaks to him with words that pierce the soul: “Behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands; but not all, for my works are without end, and also my words, for they never cease” (Moses 1:4). Pause to let that resonate. God calls Moses His son—a personal, intimate declaration of identity and belonging. And then He reveals a glimpse of His creations, a vision so vast that Moses can scarcely comprehend it. But this isn’t just about cosmic wonder; it’s about purpose. God is setting the stage for Moses to understand his place in an eternal plan.\n\nNow, contrast this with what happens next. After this transcendent experience, Satan appears, attempting to unravel everything God has affirmed. In Moses 1:12, he sneers, “Moses, son of man, worship me.” Notice the stark difference. Where God declared Moses a son of divinity, Satan reduces him to mere mortality, a “son of man,” and demands worship. It’s a deliberate counterfeit, a twisting of truth. But Moses doesn’t falter. He responds with clarity: “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?” (Moses 1:13). There’s power in that response. Moses knows who he is because God told him, and that knowledge becomes his shield. Think about this for a moment: how often do we face voices—whether from the world or within—that try to diminish our divine identity? How does remembering that you are a child of God change the way you respond to those lies?\n\nThis truth leads us to a deeper lesson in Moses 1 about resisting Satan’s counterfeits. Moses doesn’t just reject Satan once; he persists through repeated temptations. In verses 18 to 22, we see him call upon God, command Satan to depart in the name of the Only Begotten, and finally overcome through divine strength. It’s a pattern for us. Temptation doesn’t vanish after one spiritual high; it often intensifies. But Moses shows us that clinging to our identity as children of God, coupled with prayer and reliance on Christ, gives us power to stand firm. Reflect on that for a second. When have you felt tempted to doubt your worth or your spiritual experiences? What can you learn from Moses about holding fast to what God has revealed to you?\n\nBuilding on that vision, let’s turn to the purpose behind all of this. After Moses beholds God’s creations, he asks a question that burns in so many hearts: “Tell me, I pray thee, why these things are so, and by what thou madest them?” (Moses 1:30). The Lord’s response is one of the most profound declarations in scripture: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39). Stop and let that truth settle in your heart. God’s entire purpose, the reason for worlds without number, is you—your eternal life, your return to Him. Immortality is to live forever, but eternal life is to live with God in His fullness, and through Jesus Christ, both are made possible. This isn’t a distant doctrine; it’s personal. How does knowing that God’s glory is tied to your progression shape the way you see your daily struggles and choices?\n\nNow, let’s weave in the companion vision from Abraham 3, where we glimpse our existence before this earth was even formed. Abraham sees the premortal realm, a time “before the world was,” when we existed as spirits. In Abraham 3:22-23, the Lord shows him “the intelligences that were organized before the world was; and among all these there were many of the noble and great ones.” And God says to these spirits, “Thou art one of them; thou wast chosen before thou wast born.” Imagine that—before your mortal birth, you were known, chosen, and prepared for a purpose. Then, in verses 24-26, the Lord explains the plan: “We will go down, for there is space there, and we will take of these materials, and we will make an earth whereon these may dwell; and we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” This life is a proving ground, a place to choose, to grow, to become like Him. How does knowing you lived as a spirit before this life, with a divine potential already recognized by God, influence the way you face trials or make decisions today?\n\nNotice how this pattern continues in both Moses and Abraham’s visions. Both point to Jesus Christ as central to the plan. In Moses 1:6, God tells Moses, “Mine Only Begotten is and shall be the Savior, for he is full of grace and truth.” And in Abraham 3:27, when the question arises, “Whom shall I send?” the Savior responds, “Here am I, send me.” Christ was chosen from the beginning to be our Redeemer, to ensure that God’s work and glory could be fulfilled in us. This isn’t just theology; it’s the heartbeat of our hope. When you feel unworthy or lost, remembering that Christ volunteered to save you—before the world was—can anchor you in His love. Take a quiet moment to ponder that. How does Christ’s role in the premortal council deepen your gratitude for Him?\n\nLet’s deepen this understanding by connecting these truths to our daily lives. President Russell M. Nelson has taught that if the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity as a child of God. He also said, “The way you think about who you really are affects almost every decision you will ever make.” Think about that. If your identity as a child of God comes before any other label—before your career, your struggles, or the world’s opinions—how does that shape your choices? Maybe it’s choosing kindness over anger, integrity over convenience, or faith over fear. Consider this: what decisions are you facing right now where remembering your divine worth could guide you?\n\nLet’s also explore how these chapters teach us to distinguish between God’s voice and Satan’s counterfeits, just as Moses did. Satan often offers fake versions of truth—temporary pleasures instead of lasting joy, self-reliance instead of reliance on God. In Moses 1:15, Moses declares, “I can judge between thee and God; for God said unto me: Worship God, for him only shalt thou serve.” That ability to judge, to discern, comes from knowing God’s voice through prayer, scripture, and spiritual experiences. So ask yourself: what counterfeits are tempting you today? How can you turn to the Lord, as Moses did, to see through them?\n\nAs we draw this lesson to a close, let’s reflect on the sweeping vista these scriptures offer. Moses 1 and Abraham 3 aren’t just ancient records; they are revelations of your eternal identity and purpose. You are a child of God, known and loved before the world was, entrusted with a mortal journey to prove your faithfulness and grow into eternal life. God’s work and glory center on you, and through Christ, He has provided the way. Let that truth linger in your mind. How does it change the way you see yourself, your challenges, and your potential?\n\nI invite you to take these insights into your personal study this week. Reread Moses 1:4-6 and Abraham 3:22-26, and write down what these verses teach you about who you are. Ponder how knowing your premortal existence and divine destiny can guide your choices. Share these thoughts with a family member or friend—perhaps over a meal or during a quiet moment—and discuss how you can support each other in remembering your true identity. If possible, spend time in the temple, reflecting on God’s plan for you and seeking His voice to affirm who you are. And finally, pray to recognize and resist Satan’s counterfeits, asking for the strength Moses found to stand firm as a child of God.\n\nNext week, we’ll dive into the Creation account and the Fall, exploring how these foundational events in Genesis tie directly to the eternal truths we’ve uncovered today. Until then, may you feel the reality of being God’s child in every step you take.",
  "generated_timestamp": "2025-12-26 19:47:37",
  "source_week_file": "cfm_2026_week_02.json"
}