{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "scholarly",
  "duration_estimate": "~8.0 minutes",
  "word_count": 1199,
  "character_count": 7316,
  "segment_count": 57,
  "script": [
    {
      "speaker": "Sarah",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "And I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "David, let's start with a question that reveals so much about the Old Testament. When Jesus declared in John 8:58, 'Before Abraham was, I am,' the leaders of the Jews were furious and wanted to stone Him. What made those words so shocking?"
    },
    {
      "speaker": "David",
      "text": "Sarah, that's a perfect way to begin our study. Those words directly connect to Exodus 3:13-15, where Moses asks God His name at the burning bush. God responds, 'I AM THAT I AM,' which is the name Jehovah, or YHWH in Hebrew."
    },
    {
      "speaker": "Sarah",
      "text": "So Jesus was claiming to be Jehovah? That completely reframes how we approach the Old Testament."
    },
    {
      "speaker": "David",
      "text": "Precisely. President Dallin H. Oaks taught that 'the scriptural records of words spoken by “God” or the “Lord” are almost always the words of Jehovah, our risen Lord, Jesus Christ.' This truth transforms the entire book for us."
    },
    {
      "speaker": "Sarah",
      "text": "I'm intrigued by how this shifts our perspective. Suddenly, every interaction with 'the Lord' in the Old Testament is Jesus Christ speaking. What does Exodus 6:3-5 add to this understanding?"
    },
    {
      "speaker": "David",
      "text": "In Exodus 6:3-5, God tells Moses, 'I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them.' This shows progressive revelation of His identity across generations."
    },
    {
      "speaker": "Sarah",
      "text": "That's profound. It makes me wonder how the Old Testament is filled with testimonies of the Savior, even if some feel it's distant or foreign."
    },
    {
      "speaker": "David",
      "text": "Absolutely. One powerful way to see this is through symbols that point directly to Jesus Christ, as the manual highlights. Think of the manna in Exodus 16:4, 11-15, which mirrors John 6:35 where Jesus calls Himself the Bread of Life."
    },
    {
      "speaker": "Sarah",
      "text": "Yes, the Israelites gathered manna daily for sustenance, just as we rely on Christ for spiritual nourishment every day."
    },
    {
      "speaker": "David",
      "text": "Exactly. Then there's the sacrificial lamb in Exodus 12:3-5, without blemish, prefiguring John 1:29, 'Behold the Lamb of God, which taketh away the sin of the world.'"
    },
    {
      "speaker": "Sarah",
      "text": "That connection is striking. What about the brass serpent in Numbers 21:4-10? How does that testify of Him?"
    },
    {
      "speaker": "David",
      "text": "In Numbers 21, those bitten by serpents looked to the brass serpent on the pole to live. Jesus references this in John 3:14, saying, 'And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up.'"
    },
    {
      "speaker": "Sarah",
      "text": "Looking to Him in faith for healing and life—such a clear symbol. And Jonah?"
    },
    {
      "speaker": "David",
      "text": "Jonah 1:4-17 shows Jonah in the great fish for three days, paralleling Jesus' death and resurrection, as in Matthew 12:38-41. These aren't coincidences; they're divine patterns pointing to the Savior."
    },
    {
      "speaker": "Sarah",
      "text": "These examples make the Old Testament feel alive with Christ's presence. But many approach it feeling uncertain or even afraid because of its ancient culture."
    },
    {
      "speaker": "David",
      "text": "That's common, Sarah. The writings come from a world that seems strange, yet we see familiar experiences: family joys and sorrows, faith and doubt, like Abraham, Sarah, Hannah, and Daniel faced."
    },
    {
      "speaker": "Sarah",
      "text": "They covenanted, repented, and held to the promise of a Savior—just as we do. This bridges the gap between ancient and modern."
    },
    {
      "speaker": "David",
      "text": "Precisely. And the Lord told Adam in Moses 6:63, 'All things have their likeness, and all things are created and made to bear record of me.' Everything testifies of Christ."
    },
    {
      "speaker": "Sarah",
      "text": "What strikes me is how plain and precious truths were lost from the Bible, as Nephi saw in 1 Nephi 13:21-29."
    },
    {
      "speaker": "David",
      "text": "Yes, Nephi describes how 'many plain and precious things' were removed, but the Lord restored them through Joseph Smith. Think of the book of Moses, Abraham, and JST passages."
    },
    {
      "speaker": "Sarah",
      "text": "Like Enoch's city of Zion in Moses 7:18-19. That's not in Genesis—how precious is that restoration?"
    },
    {
      "speaker": "David",
      "text": "Incredibly so. It shows a Zion society taken to God's presence, inspiring our own covenant efforts today."
    },
    {
      "speaker": "Sarah",
      "text": "And Abraham's vision of the council in heaven in Abraham 3:22-28—that places us in the premortal grand council."
    },
    {
      "speaker": "David",
      "text": "Right, revealing our roles and the plan of salvation in ways Genesis alone doesn't. Then the ministry of Melchizedek in Joseph Smith Translation, Genesis 14:25-40."
    },
    {
      "speaker": "Sarah",
      "text": "These restorations make the Old Testament complete. According to 2 Nephi 3:12, the Bible and Book of Mormon together confirm each other."
    },
    {
      "speaker": "David",
      "text": "They do. Nephi foresaw 'other books' like these to make known the plain and precious truths."
    },
    {
      "speaker": "Sarah",
      "text": "This ties into covenants, doesn't it? The Old Testament as God's story of making us His 'peculiar treasure' through covenants, per Exodus 19:5."
    },
    {
      "speaker": "David",
      "text": "Beautifully said. Covenants with Abraham, Isaac, Jacob show the everlasting covenant, as President Nelson teaches in 'The Everlasting Covenant.'"
    },
    {
      "speaker": "Sarah",
      "text": "Why are covenants so central? What special love and mercy do they bring?"
    },
    {
      "speaker": "David",
      "text": "They bind us to God, offering mercy as we keep them. Jeremiah 31:31-34 prophesies a new covenant written in our hearts, fulfilled in Christ."
    },
    {
      "speaker": "Sarah",
      "text": "Seeing the Old Testament through covenants and Christ makes it a lamp to our path, like Psalm 119:105."
    },
    {
      "speaker": "David",
      "text": "Yes, 'Thy word is a lamp unto my feet, and a light unto my path.' These ancient words illuminate our lives today."
    },
    {
      "speaker": "Sarah",
      "text": "David, circling back to those symbols, how does recognizing Jesus as Jehovah deepen our view of manna or the lamb?"
    },
    {
      "speaker": "David",
      "text": "It personalizes them. Jehovah who led Israel with manna is the same who offers Himself as Bread of Life, sustaining us eternally."
    },
    {
      "speaker": "Sarah",
      "text": "That realization transforms reading. What about cultural context—how does ancient Israel help us understand these better?"
    },
    {
      "speaker": "David",
      "text": "In their nomadic, sacrificial culture, the Passover lamb wasn't abstract; it was survival and deliverance, mirroring Christ's protective atonement."
    },
    {
      "speaker": "Sarah",
      "text": "The brass serpent in the wilderness—amid rebellion and judgment, looking brought life. So relevant to our repentance."
    },
    {
      "speaker": "David",
      "text": "Jonah's ordeal reflected God's mercy extending to Nineveh, as Christ's resurrection power reaches all who turn to Him."
    },
    {
      "speaker": "Sarah",
      "text": "These patterns span dispensations—from Adam's sacrifices to our temple covenants."
    },
    {
      "speaker": "David",
      "text": "They do, showing divine consistency. Elder Renlund urges us to focus on Jesus Christ as the treasure in 'Jesus Christ Is the Treasure.'"
    },
    {
      "speaker": "Sarah",
      "text": "So as we study, we seek Him in every page. How do restored accounts like Enoch's enhance this?"
    },
    {
      "speaker": "David",
      "text": "Moses 7 shows Enoch's people becoming Zion through covenants, paralleling our latter-day gathering."
    },
    {
      "speaker": "Sarah",
      "text": "Abraham 3 maps the intelligences and plan, connecting Old Testament patriarchs to premortal choices."
    },
    {
      "speaker": "David",
      "text": "Melchizedek's order in JST Genesis 14 reveals priesthood power anciently, vital for our covenants."
    },
    {
      "speaker": "Sarah",
      "text": "This multi-layered view resolves any intimidation—the Old Testament builds our covenant path."
    },
    {
      "speaker": "David",
      "text": "It reveals God's unchanging pattern: reveal covenants, invite faith in Christ, gather His people."
    },
    {
      "speaker": "Sarah",
      "text": "What strikes me is how it applies today. Covenants make us God's peculiar treasure amid modern challenges."
    },
    {
      "speaker": "David",
      "text": "President Nelson emphasizes the special mercy in covenant keeping, strengthening us like ancient saints."
    },
    {
      "speaker": "Sarah",
      "text": "Renewing covenants weekly reminds us of that lamb, that bread, that lifted-up Savior."
    },
    {
      "speaker": "David",
      "text": "And as Jehovah, Christ has been guiding from Eden onward, preparing us for exaltation."
    },
    {
      "speaker": "Sarah",
      "text": "This year, studying with these lenses will uncover endless treasures. Listeners, start by pondering one symbol this week."
    },
    {
      "speaker": "David",
      "text": "Yes, ask how it testifies of Christ and relates to your covenants. You'll find Him speaking as Jehovah."
    },
    {
      "speaker": "Sarah",
      "text": "David, thank you for these insights—they've deepened my anticipation for the Old Testament."
    },
    {
      "speaker": "David",
      "text": "It's been a joy, Sarah. May we all discover His voice anew this year."
    },
    {
      "speaker": "Sarah",
      "text": "Until next time, keep studying and covenant-keeping. This is the Come Follow Me Podcast."
    }
  ],
  "host": "Sarah",
  "guest": "David",
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-17 17:23:33",
  "source_week_file": "cfm_2026_week_01.json"
}