{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "study_level": "essential",
  "duration_estimate": "~6.2 minutes",
  "word_count": 933,
  "character_count": 5536,
  "segment_count": 23,
  "script": [
    {
      "speaker": "David",
      "text": "Welcome to the Come Follow Me Podcast by Gospel Study App. I'm David."
    },
    {
      "speaker": "Sarah",
      "text": "And I'm Sarah."
    },
    {
      "speaker": "David",
      "text": "Sarah, as we dive into the Old Testament this year, one thing that strikes me right away is how it can feel both exciting and intimidating. I've been pondering this idea from the Come, Follow Me introduction: the Old Testament testifies of Jesus Christ through all these symbols. What draws you in most as we begin?"
    },
    {
      "speaker": "Sarah",
      "text": "That's a great way to frame it, David. I love how it points us to look for the Savior in symbols like manna, the sacrificial lamb, the brass serpent, and Jonah. What I find remarkable is that the Lord taught Adam, 'All things have their likeness, and all things are created and made to bear record of me' from Moses 6:63. It transforms how we read these ancient stories."
    },
    {
      "speaker": "David",
      "text": "That's profound. Let's start with manna then. In Exodus 16:4, 11–15, the Lord provides it daily in the wilderness, and Jesus calls himself the Bread of Life in John 6:35. Why do you think that connection matters so much?"
    },
    {
      "speaker": "Sarah",
      "text": "Notice how the Israelites gathered manna each morning, just enough for the day, and it came with the dew. From their perspective, it was literal sustenance during a time of uncertainty and wandering. But viewing it through the lens of the New Testament, it mirrors Jesus as our daily spiritual bread, sustaining us toward the promised land of exaltation."
    },
    {
      "speaker": "David",
      "text": "I hadn't thought of it quite like that—the daily dependence. It makes the wilderness feel so relatable to our own spiritual journeys. What about the sacrificial lamb in Exodus 12:3–5, linked to John 1:29 where John calls Jesus the Lamb of God?"
    },
    {
      "speaker": "Sarah",
      "text": "Yes, the Passover lamb had to be without blemish, its blood protecting the Israelites from death. That's significant because it points directly to Christ's perfect sacrifice, shielding us from eternal death. Here's what I think is meaningful: these symbols weren't just rituals; they were God's way of teaching His people about the Savior who would come."
    },
    {
      "speaker": "David",
      "text": "That's a powerful realization. I'm intrigued by how these look different from the ancient viewpoint versus knowing Jesus fulfilled them. Take the brass serpent in Numbers 21:4–9—looking at it healed the Israelites, just as Jesus describes in John 3:14."
    },
    {
      "speaker": "Sarah",
      "text": "Exactly. The people were bitten by fiery serpents and dying, but Moses lifted up the serpent on a pole, and simply looking brought healing. From Moses' view, it was an act of faith and obedience. But Jesus reveals it as a symbol of his own lifting up on the cross for our healing through faith in him."
    },
    {
      "speaker": "David",
      "text": "This pattern across these stories is fascinating—simple acts of faith pointing to Christ. And Jonah, swallowed by the great fish in Jonah 1:4–17, prefigures Jesus' time in the tomb, as in Matthew 12:38–41. How does recognizing Jesus as Jehovah tie all this together?"
    },
    {
      "speaker": "Sarah",
      "text": "President Dallin H. Oaks taught that the scriptural records of words spoken by 'God' or the 'Lord' are almost always the words of Jehovah, our risen Lord, Jesus Christ. That's why when Jesus said, 'Before Abraham was, I am' in John 8:58–59, it shocked the Jews. They knew from Exodus 3:13–15 that Jehovah revealed his name as 'I AM' to Moses."
    },
    {
      "speaker": "David",
      "text": "Whoa, that deepens my understanding so much. From the Jews' perspective, claiming that name was claiming divinity. But it shows Jesus was Jehovah all along, speaking to the prophets. What many don't realize is how this ancient culture, though foreign, records these profound truths."
    },
    {
      "speaker": "Sarah",
      "text": "Right, the Old Testament comes from one of the oldest collections of writings, with experiences that feel familiar—like faith, repentance, and covenants. Yet, through Joseph Smith, the Lord restored plain and precious things taken away, as in 1 Nephi 13:21–29. Think of Enoch's city of Zion in Moses 7:18–19 or Abraham's vision of the council in heaven in Abraham 3:22–28."
    },
    {
      "speaker": "David",
      "text": "Those restorations make it come alive. I love how the Book of Abraham came from ancient Egyptian papyri Joseph Smith examined. It connects back to the Old Testament foundations. How does this pattern of symbols and Jehovah lead us to covenants?"
    },
    {
      "speaker": "Sarah",
      "text": "The Old Testament is the story of God seeking to make us His 'peculiar treasure' by covenant, as in Exodus 19:5. Prophets like Abraham, Isaac, and Jacob received the everlasting covenant. President Russell M. Nelson's message 'The Everlasting Covenant' highlights this special love and mercy we receive as we keep them."
    },
    {
      "speaker": "David",
      "text": "That's exactly right. Seeing these covenants woven through the symbols—protection by blood, healing by looking, daily bread—it all reflects our relationship with God today. What strikes me is Jeremiah 31:31–34, promising a new covenant written on our hearts."
    },
    {
      "speaker": "Sarah",
      "text": "Yes, it builds prophetic continuity. These ancient patterns apply directly now: just as the Israelites relied on manna, we partake of the sacrament weekly as bread and water emblems of Christ. Covenants anchor us amid modern wildernesses."
    },
    {
      "speaker": "David",
      "text": "This really deepens my anticipation for the year. One more connection: Psalm 119:105 says, 'Thy word is a lamp unto my feet, and a light unto my path.' The Old Testament lights our path to Christ."
    },
    {
      "speaker": "Sarah",
      "text": "Beautifully said. People like Abraham and Hannah faced family joys and sorrows, yet held to covenants and the promise of a Savior. Their lives mirror ours in that pursuit."
    },
    {
      "speaker": "David",
      "text": "Sarah, this conversation has me eager to study with new eyes. Listeners, as you begin the Old Testament, watch for these symbols of Jesus Christ and ponder your own covenant path with Him."
    },
    {
      "speaker": "Sarah",
      "text": "Absolutely. Focus on Jesus Christ, as Elder Dale G. Renlund encouraged, and let these truths nourish your faith this year."
    },
    {
      "speaker": "David",
      "text": "Thanks, Sarah. Until next time, keep studying."
    }
  ],
  "host": "David",
  "guest": "Sarah",
  "voices": {
    "Sarah": "aoede",
    "David": "alnilam"
  },
  "generated_timestamp": "2026-01-17 17:22:41",
  "source_week_file": "cfm_2026_week_01.json"
}