{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "study_level": "scholarly",
  "duration_estimate": "~11.8 minutes",
  "word_count": 1777,
  "character_count": 9973,
  "script": "Welcome to the Come Follow Me Podcast by Gospel Study App. Imagine standing on a high mountain, the world stretching endlessly before you, as a divine voice pierces the silence, declaring, “Thou art my son.” That’s the breathtaking moment Moses experienced in Moses 1, a moment that reshapes everything we understand about who we are and why we’re here. Today, as we dive into Moses 1 and Abraham 3, we’re not just reading ancient records; we’re uncovering the very blueprint of our identity, our purpose, and God’s eternal plan for us. These chapters, revealed through the Prophet Joseph Smith, pull back the veil on questions as old as time: Who is God? Who are we? And what is our place in His vast creation? Let’s journey together into these sacred texts and discover truths that can anchor us in a world of confusion.\n\nLet’s start with Moses 1, where we find Moses caught up in a vision of staggering power. The Lord speaks directly to him, saying in verse 4, “Behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands.” Pause to let that resonate. “Thou art my son.” Before anything else, before the creation of the earth or the unfolding of history, God affirms Moses’s divine identity. And just two verses later, in Moses 1:6, the Lord adds, “I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten.” Here, God not only calls Moses His son but ties him to Jesus Christ, the Only Begotten, hinting at a profound connection between our divine parentage and our potential. Have you ever considered what it means to be made in the similitude of Christ? What work might God have for you, personally, as His child?\n\nThis truth of our identity as children of God is the foundation of everything. It’s no accident that Satan immediately attacks this very point. In Moses 1:12, after Moses has seen the glory of God, Satan appears and sneers, “Moses, son of man, worship me.” Notice the stark contrast. Where God lifts Moses with the title “my son,” Satan degrades him as merely a “son of man,” stripping away his divine heritage. Isn’t that a tactic we still see today? The adversary wants us to forget who we are, to define ourselves by temporary labels or fleeting failures. But Moses doesn’t falter. In verse 13, he responds, “Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?” Moses clings to the truth of his identity, and it becomes his shield. Reflect on that for a second. How does knowing you are a child of God change the way you face temptation or doubt?\n\nBuilding on that vision, let’s see how Moses’s experience teaches us to resist Satan. After this powerful encounter with God, you might think Moses would be untouchable, immune to temptation. Yet Satan persists, offering counterfeits of God’s truth and power. In Moses 1:16, Satan demands worship, even raging against Moses. But Moses stands firm, saying in verse 18, “I will not cease to call upon God, I have other things to inquire of him.” What strength there is in turning to God in the face of opposition! Finally, in verses 20-21, Moses commands Satan to depart in the name of the Only Begotten, and only then, with the Lord’s help in verse 26, does Satan fully flee. What do we learn here? Spiritual experiences don’t exempt us from temptation, but they arm us with the knowledge and power to overcome it. Think about a time when you’ve felt tempted to doubt a spiritual truth or experience. What can Moses teach you about holding fast to what you know?\n\nThis pattern of resisting Satan ties directly to our divine identity, a theme that echoes through both Moses 1 and Abraham 3. Let’s turn to Abraham’s vision now, where we glimpse our existence before this mortal life. In Abraham 3:22-23, the Lord shows Abraham the spirits that were with Him before the world was, saying, “These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born.” Take a quiet moment to let that truth settle in. You and I were there, among those spirits, known and loved by God before the foundation of the world. This isn’t just history; it’s a revelation of your eternal worth. How does knowing you were chosen before birth shape the way you see your challenges or your purpose today?\n\nAbraham’s vision also unveils the grand design of God’s plan. In verses 24-25, the Lord explains, “We will make an earth whereon these may dwell; and we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them.” This earth life is a proving ground, a place to demonstrate our willingness to follow God. And at the center of this plan stands Jesus Christ, chosen as our Redeemer. In verse 27, when the Lord asks, “Whom shall I send?” one answers, “Here am I, send me.” We know this is the Savior, foreordained to be the Lamb slain from the foundation of the world. Isn’t it humbling to realize that every detail of our journey—our premortal life, our earthly test, and our eternal destiny—was planned with such care, anchored in Christ’s atoning sacrifice?\n\nThis truth leads us back to Moses 1, where the Lord reveals the purpose behind all creation. After Moses beholds the vastness of God’s works, he asks in verse 30, “Tell me, I pray thee, why these things are so, and by what thou madest them?” The Lord’s answer in verse 39 is one of the most profound declarations in scripture: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” Let that sink in. The God of the universe, who commands galaxies and numbers the sands of the sea, declares that His ultimate purpose is you—your immortality through the Resurrection and your eternal life through exaltation. Immortality is the gift of living forever, given to all through Christ’s victory over death. But eternal life, to live with God and become like Him, requires our agency, our choices, and our alignment with His will. How does this focus of God’s work and glory change the way you see your daily struggles or aspirations?\n\nNotice how this pattern continues in both accounts. Whether it’s Moses learning of his divine sonship or Abraham seeing the premortal council, the message is clear: God’s plan is personal. He knows you, as He knew Moses and Abraham. He has a work for you, as He declared to Moses in Moses 1:6. And He has provided a Savior, as revealed in Abraham 3:27, to ensure that nothing can ultimately thwart His purpose for you. These chapters aren’t just about ancient prophets; they’re a mirror reflecting your own eternal story. Have you ever paused to ask, as Moses did, “Tell me concerning this earth, and the inhabitants thereof, and also the heavens”? What might the Lord reveal to you if you seek Him with that same earnestness?\n\nLet’s deepen our understanding by connecting these truths to other scriptures. In Matthew 4:1-11, we see the Savior Himself resisting Satan’s temptations in the wilderness, much like Moses did. When Satan offers worldly power and glory, Jesus rebukes him with the word of God, saying, “Get thee hence, Satan: for it is written, Thou shalt worship the Lord thy God, and him only shalt thou serve.” Like Moses, the Savior clings to His identity and mission, refusing Satan’s counterfeits. What can you learn from both Moses and Jesus about recognizing and rejecting the adversary’s deceptions in your own life? Perhaps it’s the counterfeit of seeking validation from the world instead of God, or the temptation to prioritize ease over obedience. How can turning to the Lord, as Moses did in Moses 1:18, help you discern the true from the false?\n\nAs we reflect on these sacred accounts, consider how they apply to your daily walk as a disciple. President Russell M. Nelson has taught that the way you think about who you really are affects almost every decision you make. If you see yourself first as a child of God, as Moses learned in Moses 1:4, how does that shape your choices? Does it influence how you treat others, how you face adversity, or how you prioritize your time? The truths in Abraham 3:22-28 remind us that we are eternal beings, chosen before this world was. That perspective can lift us above the temporary distractions of mortality and focus us on the proving ground of earth life, where we are tested to see if we will do all things the Lord commands.\n\nSo, as we close this journey through Moses 1 and Abraham 3, let’s carry these revelations into our hearts and homes. Reflect on the Lord’s declaration in Moses 1:39, that His work and glory are to bring about your eternal life. Let that truth anchor you when the world tries to redefine who you are. Ponder the reality of your premortal existence, as shown in Abraham 3, and ask yourself: How can I live more fully as one chosen by God? I invite you to take time this week to study Moses 1:12-26 and consider how you can resist Satan’s counterfeits by clinging to your divine identity. Perhaps write down a list of choices you make because you know you are a child of God, and see how that shapes your decisions. Discuss these truths with your family during a casual moment—maybe over dinner or while doing chores—and share how knowing you lived as spirits before this life inspires you to follow God’s plan.\n\nI also encourage you to seek a quiet moment in prayer or at the temple, asking the Lord to reveal more of your personal work in His kingdom, just as He did for Moses. And as you sing or listen to a hymn like “I Am a Child of God,” let the words remind you of the eternal truth spoken to Moses on that holy mountain. May these scriptures guide you to see yourself as God sees you—a beloved child with a divine destiny, part of His glorious work to bring about immortality and eternal life. Let’s carry that vision with us as we continue to seek Him.",
  "generated_timestamp": "2025-12-26 20:10:07",
  "source_week_file": "cfm_2026_week_02.json"
}