{
  "week_number": 45,
  "date_range": "November 2–8",
  "title": "Week 45: November 2–8 - Ezekiel 1–3; 33–34; 36–37; 47",
  "bundle_title": "Week 45: November 2–8: \"Week 45: November 2–8 - Ezekiel 1–3; 33–34; 36–37; 47\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/45?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/45?lang=eng",
    "title": "Ezekiel 1–3;33–34;36–37;47",
    "scripture_references": "Ezekiel 1–3; 33–34; 36–37; 47",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“November 2–8. ‘A New Spirit Will I Put within You’: Ezekiel 1–3; 33–34; 36–37; 47,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“November 2–8. ‘A New Spirit Will I Put within You,’”Come, Follow Me: Old Testament 2026\n\nEzekiel was a prophet in exile. Along with other Israelites, he had been captured and sent to Babylon. In Jerusalem, Ezekiel would have been a priest serving in the temple. In Babylon, he was among “them of the captivity,” and he “sat where they sat” (Ezekiel 3:15), hundreds of miles from the beloved house of God and with little hope of returning. Then one day Ezekiel had a vision. He saw “the glory of the Lord” (Ezekiel 1:28)—not back in the temple at Jerusalem but there in Babylon among the exiles. The wickedness in Jerusalem, he learned, had become so severe that God’s presence was no longer there (seeEzekiel 8–11;33:21).\n\nAnd yet there’s something hopeful about Ezekiel’s message. Despite how far the covenant people had fallen, God had not totally abandoned them. If they would “hear the word of the Lord” (Ezekiel 37:4), what was once dead could be revived. Their “stony heart” could be replaced with “a new heart” (Ezekiel 36:26). And in the future, the Lord would establish a new temple and a new Jerusalem, “and the name of the city from that day shall be, The Lord is there” (Ezekiel 48:35).\n\nFor an overview of the book of Ezekiel, see “Ezekiel” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "The Lord invites me to feed His sheep.",
        "content": "InEzekiel 3and34, the Lord refers to leaders of His people as watchmen and shepherds. As you read these chapters, consider what these titles suggest about what it means to be a leader.\n\nWho are the “sheep” the Lord wants you to feed? What do you find inEzekiel 34that could help someone preparing to serve a mission, raising children, or fulfilling a ministering assignment? How can you follow the Savior’s example as our shepherd? (seeverses 11–31).\n\nYou might also ponder the symbolism you find in this chapter. What might the “good pasture” and “good fold” represent inverse 14? What’s the difference between a sheep who is “lost” and one who is “driven away”? (verse 16). What other symbols do you find?\n\nSee alsoJohn 21:15–17; Gerrit W. Gong, “Ministering,”Liahona, May 2023, 16–19.\n\nEzekiel 33:10–19"
      },
      {
        "title": "The Lord wants to forgive.",
        "content": "“If our … sins be upon us,” the captive Israelites wondered, “how should we then live?” (Ezekiel 33:10). In response, the Lord taught them about repentance and forgiveness. These questions might help you ponder what He taught:\n\nWhat do you think it means to “trust to [your] own righteousness”? (seeEzekiel 33:12–13).\n\nWhat would you say to someone who feels that the people described inEzekiel 33:12–19are not being treated fairly? (see alsoMatthew 21:28–31;Luke 18:9–14).\n\nWhat do you find in these verses that helps you understand what it means to repent? What additional insights do you find inEzekiel 36:26–27andAlma 7:14–16?\n\nEzekiel 37"
      },
      {
        "title": "The Lord is gathering His people and giving them new life.",
        "content": "The gathering of Israel is portrayed inEzekiel 37through two symbols. As you read about the first one—dead bones being restored to life (seeverses 1–14)—ponder what it suggests to you about gathering Israel on both sides of the veil (see alsoEzekiel 36:24–30). Consider questions like these:\n\nWhat is the Lord trying to accomplish through the gathering of Israel?\n\nHow is He accomplishing it?\n\nYou could ask yourself these same questions as you read about the second symbol, inverses 15–28. This symbol involves two sticks, which many scholars interpret as wooden writing boards joined by a hinge. The stick of Judah can represent the Bible (since much of the Bible was written by Judah’s descendants), and the stick of Joseph can represent the Book of Mormon (since Lehi’s family were descendants of Joseph of Egypt). With that in mind, what do these verses teach you about the role of the scriptures in the gathering of Israel?\n\nThink about how the Bible and Book of Mormon have worked together in your life—in particular, to help you come to Christ. What passages have been especially meaningful to you?\n\nSee also2 Nephi 3:11–13;29:14; “Israel, Israel, God Is Calling,”Hymns, no. 7; Topics and Questions, “Bible,” “Book of Mormon,” Gospel Library; “The Book of Mormon Gathers Scattered Israel” (video), Gospel Library.\n\nThe Book of Mormon Gathers Scattered Israel\n\nIn a vision, Ezekiel saw a river flow from the temple and heal the Dead Sea.\n\nEzekiel 47:1–12"
      },
      {
        "title": "I can find spiritual healing in the house of the Lord.",
        "content": "As you readEzekiel 47:1–12, it might help to know that the Dead Sea is so salty that fish and plants can’t live in it. What impresses you about the waters described inverses 1–12? (see alsoRevelation 22:1). What might these waters symbolize? What could the trees described inverse 12represent?\n\nWhat does Elder Dale G. Renlund’s message “Family History and Temple Work: Sealing and Healing” add to your understanding? (seeEnsignorLiahona, May 2018, 47–48). Ponder how you have found spiritual life and healing because of the temple."
      }
    ],
    "teaching_children": [
      {
        "title": "Prophets are like watchmen who warn us of danger.",
        "content": "Young children might enjoy doing actions that go withEzekiel 3:17. For example, they could point to their eyes, ears, and mouth when you read the words “watchman,” “hear,” and “mouth.” They might also like going on a hike—outdoors or just around the room. As they walk, warn them about things on the trail, like rivers to jump over, branches to duck under, or animals to avoid (real or pretend). This could lead to a conversation about how the Lord’s prophet warns us of dangers we cannot see.\n\nHere’s another way to illustrateEzekiel 3:17;33:1–5. One of your children could pretend to be a “watchman” by looking out a window and telling everyone else what is happening outside. You could also watch the video “Watchman on the Tower” (ChurchofJesusChrist.org). How is our living prophet like a watchman for us?\n\nWatchman on the Tower\n\nThe Prophet Ezekiel, by Lyle Beddes\n\nEzekiel 37:15–23"
      },
      {
        "title": "The Bible and the Book of Mormon help “gather” us to Jesus Christ.",
        "content": "After readingEzekiel 37:15–23together, you and your children could find two sticks and write on oneFor Judah (Bible)and on the otherFor Joseph (Book of Mormon). You could then share stories or scriptures from the Bible and Book of Mormon that help you feel closer to the Savior and become “[His] people” (verse 23). Why is it good to have both of these two books of scripture?\n\nDon’t try to cover everything.You may not be able to explore every truth in Ezekiel with your children. Prayerfully consider what they need to understand, and seek spiritual guidance to determine what to focus on. (SeeTeaching in the Savior’s Way,17.)\n\nEzekiel 47:1–12"
      },
      {
        "title": "Our hearts and families can find healing in the house of the Lord.",
        "content": "Ezekiel 47describes Ezekiel’s vision of water flowing from the temple and healing the Dead Sea—a sea so salty that fish and plants cannot live in it. Maybe your children could each draw one or two objects from the vision, like a temple, a river, a desert, the Dead Sea, a multitude of fish, or a fruitful tree. Then, as you readverses 1–12together, they could share their drawing when that object is mentioned. What blessings came from the river in this vision? Help the children see how these blessings are like the blessings the Savior offers those who keep temple covenants. The video “And the River Will Grow” (Gospel Library) can help.\n\nAnd the River Will Grow\n\nYou could also sing together a song that describes temple blessings, such as “Families Can Be Together Forever” (Children’s Songbook, 188). What does this song teach about how the Lord blesses us in His holy house?\n\nFor more, see this month’s issue of theFriendmagazine.\n\n“Behold, waters issued out from under the threshold of the house. … And every thing shall live whither the river cometh” (Ezekiel 47:1, 9). Image licensed bygoodsalt.com"
      }
    ],
    "study_helps": [],
    "raw_text": "November 2–8. “A New Spirit Will I Put within You”: Ezekiel 1–3; 33–34; 36–37; 47\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nOctober 26–November 1\nJeremiah 31–33; 36–38; Lamentations 1; 3\nNovember 2–8\nEzekiel 1–3; 33–34; 36–37; 47\nNovember 9–15\nDaniel 1–7\nNovember 16–22\nHosea 1–6; 10–14; Joel\nNovember 23–29\nAmos; Obadiah; Jonah\nDecember\nAppendixes\nNovember 2–8. “A New Spirit Will I Put within You”: Ezekiel 1–3; 33–34; 36–37; 47\n“November 2–8. ‘A New Spirit Will I Put within You’: Ezekiel 1–3; 33–34; 36–37; 47,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“November 2–8. ‘A New Spirit Will I Put within You,’”\nCome, Follow Me: Old Testament 2026\nNovember 2–8: “A New Spirit Will I Put within You”\nEzekiel 1–3\n;\n33–34\n;\n36–37\n;\n47\nEzekiel was a prophet in exile. Along with other Israelites, he had been captured and sent to Babylon. In Jerusalem, Ezekiel would have been a priest serving in the temple. In Babylon, he was among “them of the captivity,” and he “sat where they sat” (\nEzekiel 3:15\n), hundreds of miles from the beloved house of God and with little hope of returning. Then one day Ezekiel had a vision. He saw “the glory of the Lord” (\nEzekiel 1:28\n)—not back in the temple at Jerusalem but there in Babylon among the exiles. The wickedness in Jerusalem, he learned, had become so severe that God’s presence was no longer there (see\nEzekiel 8–11\n;\n33:21\n).\nAnd yet there’s something hopeful about Ezekiel’s message. Despite how far the covenant people had fallen, God had not totally abandoned them. If they would “hear the word of the Lord” (\nEzekiel 37:4\n), what was once dead could be revived. Their “stony heart” could be replaced with “a new heart” (\nEzekiel 36:26\n). And in the future, the Lord would establish a new temple and a new Jerusalem, “and the name of the city from that day shall be, The Lord is there” (\nEzekiel 48:35\n).\nFor an overview of the book of Ezekiel, see “\nEzekiel\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nEzekiel 3\n;\n34\nThe Lord invites me to feed His sheep.\nIn\nEzekiel 3\nand\n34\n, the Lord refers to leaders of His people as watchmen and shepherds. As you read these chapters, consider what these titles suggest about what it means to be a leader.\nWho are the “sheep” the Lord wants you to feed? What do you find in\nEzekiel 34\nthat could help someone preparing to serve a mission, raising children, or fulfilling a ministering assignment? How can you follow the Savior’s example as our shepherd? (see\nverses 11–31\n).\nYou might also ponder the symbolism you find in this chapter. What might the “good pasture” and “good fold” represent in\nverse 14\n? What’s the difference between a sheep who is “lost” and one who is “driven away”? (\nverse 16\n). What other symbols do you find?\nSee also\nJohn 21:15–17\n; Gerrit W. Gong, “\nMinistering\n,”\nLiahona\n, May 2023, 16–19.\nEzekiel 33:10–19\nThe Lord wants to forgive.\n“If our … sins be upon us,” the captive Israelites wondered, “how should we then live?” (\nEzekiel 33:10\n). In response, the Lord taught them about repentance and forgiveness. These questions might help you ponder what He taught:\nWhat do you think it means to “trust to [your] own righteousness”? (see\nEzekiel 33:12–13\n).\nWhat would you say to someone who feels that the people described in\nEzekiel 33:12–19\nare not being treated fairly? (see also\nMatthew 21:28–31\n;\nLuke 18:9–14\n).\nWhat do you find in these verses that helps you understand what it means to repent? What additional insights do you find in\nEzekiel 36:26–27\nand\nAlma 7:14–16\n?\nEzekiel 37\nThe Lord is gathering His people and giving them new life.\nThe gathering of Israel is portrayed in\nEzekiel 37\nthrough two symbols. As you read about the first one—dead bones being restored to life (see\nverses 1–14\n)—ponder what it suggests to you about gathering Israel on both sides of the veil (see also\nEzekiel 36:24–30\n). Consider questions like these:\nWhat is the Lord trying to accomplish through the gathering of Israel?\nHow is He accomplishing it?\nYou could ask yourself these same questions as you read about the second symbol, in\nverses 15–28\n. This symbol involves two sticks, which many scholars interpret as wooden writing boards joined by a hinge. The stick of Judah can represent the Bible (since much of the Bible was written by Judah’s descendants), and the stick of Joseph can represent the Book of Mormon (since Lehi’s family were descendants of Joseph of Egypt). With that in mind, what do these verses teach you about the role of the scriptures in the gathering of Israel?\nThink about how the Bible and Book of Mormon have worked together in your life—in particular, to help you come to Christ. What passages have been especially meaningful to you?\nSee also\n2 Nephi 3:11–13\n;\n29:14\n; “\nIsrael, Israel, God Is Calling\n,”\nHymns\n, no. 7; Topics and Questions, “\nBible\n,” “\nBook of Mormon\n,” Gospel Library; “The Book of Mormon Gathers Scattered Israel” (video), Gospel Library.\n1:31\nThe Book of Mormon Gathers Scattered Israel\nIn a vision, Ezekiel saw a river flow from the temple and heal the Dead Sea.\nEzekiel 47:1–12\nI can find spiritual healing in the house of the Lord.\nAs you read\nEzekiel 47:1–12\n, it might help to know that the Dead Sea is so salty that fish and plants can’t live in it. What impresses you about the waters described in\nverses 1–12\n? (see also\nRevelation 22:1\n). What might these waters symbolize? What could the trees described in\nverse 12\nrepresent?\nWhat does Elder Dale G. Renlund’s message “\nFamily History and Temple Work: Sealing and Healing\n” add to your understanding? (see\nEnsign\nor\nLiahona\n, May 2018, 47–48). Ponder how you have found spiritual life and healing because of the temple.\nIdeas for Teaching Children\nEzekiel 3:17\n;\n33:1–5\nProphets are like watchmen who warn us of danger.\nYoung children might enjoy doing actions that go with\nEzekiel 3:17\n. For example, they could point to their eyes, ears, and mouth when you read the words “watchman,” “hear,” and “mouth.” They might also like going on a hike—outdoors or just around the room. As they walk, warn them about things on the trail, like rivers to jump over, branches to duck under, or animals to avoid (real or pretend). This could lead to a conversation about how the Lord’s prophet warns us of dangers we cannot see.\nHere’s another way to illustrate\nEzekiel 3:17\n;\n33:1–5\n. One of your children could pretend to be a “watchman” by looking out a window and telling everyone else what is happening outside. You could also watch the video “Watchman on the Tower” (\nChurchofJesusChrist.org\n). How is our living prophet like a watchman for us?\n4:17\nWatchman on the Tower\nThe Prophet Ezekiel\n, by Lyle Beddes\nEzekiel 37:15–23\nThe Bible and the Book of Mormon help “gather” us to Jesus Christ.\nAfter reading\nEzekiel 37:15–23\ntogether, you and your children could find two sticks and write on one\nFor Judah (Bible)\nand on the other\nFor Joseph (Book of Mormon)\n. You could then share stories or scriptures from the Bible and Book of Mormon that help you feel closer to the Savior and become “[His] people” (\nverse 23\n). Why is it good to have both of these two books of scripture?\nDon’t try to cover everything.\nYou may not be able to explore every truth in Ezekiel with your children. Prayerfully consider what they need to understand, and seek spiritual guidance to determine what to focus on. (See\nTeaching in the Savior’s Way\n,\n17\n.)\nEzekiel 47:1–12\nOur hearts and families can find healing in the house of the Lord.\nEzekiel 47\ndescribes Ezekiel’s vision of water flowing from the temple and healing the Dead Sea—a sea so salty that fish and plants cannot live in it. Maybe your children could each draw one or two objects from the vision, like a temple, a river, a desert, the Dead Sea, a multitude of fish, or a fruitful tree. Then, as you read\nverses 1–12\ntogether, they could share their drawing when that object is mentioned. What blessings came from the river in this vision? Help the children see how these blessings are like the blessings the Savior offers those who keep temple covenants. The video “And the River Will Grow” (Gospel Library) can help.\n3:43\nAnd the River Will Grow\nYou could also sing together a song that describes temple blessings, such as “\nFamilies Can Be Together Forever\n” (\nChildren’s Songbook\n, 188). What does this song teach about how the Lord blesses us in His holy house?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n“Behold, waters issued out from under the threshold of the house. … And every thing shall live whither the river cometh” (\nEzekiel 47:1, 9\n). Image licensed by\ngoodsalt.com\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Ezekiel 1",
      "title": "The Book of the ProphetEzekiel",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezek/1?lang=eng",
      "summary": "Ezekiel sees in vision four living creatures, four wheels, and the glory of God on His throne.",
      "verses": [
        "1Now it came to pass in the thirtieth year, in the fourthmonth,in the fifthdayof the month, as Iwasamong thecaptivesby the river ofChebar,thatthe heavens wereopened, and I sawvisionsof God.",
        "2In the fifthdayof the month, whichwasthefifthyear of kingJehoiachinâscaptivity,",
        "3The word of theLordcame expressly unto Ezekiel the priest, the son of Buzi, in the land of the Chaldeans by the river Chebar; and thehandof theLordwas there upon him.",
        "4Â¶And I looked, and, behold, awhirlwindcame out of the north, a great cloud, and afire infolding itself, and a brightnesswasabout it, and out of the midst thereof as the colour of amber, out of the midst of the fire.",
        "5Also out of the midst thereofcamethe likeness of four livingcreatures. And thiswastheir appearance; they had the likeness of a man.",
        "6And every one had four faces, and every one had four wings.",
        "7And their feetwerestraight feet; and the sole of their feetwaslike the sole of a calfâs foot: and they sparkled like the colour of burnishedbrass.",
        "8Andthey hadthe hands of a man under their wings on their four sides; and they four had their faces and their wings.",
        "9Their wingswerejoined one to another; they turned not when they went; they went every onestraightforward.",
        "10As for the likeness of their faces, they four had the face of a man, and the face of a lion, on the right side: and they four had the face of an ox on the left side; they four also had the face of an eagle.",
        "11Thusweretheir faces: and theirwingswerestretched upward; twowingsof every onewerejoined one to another, and two covered their bodies.",
        "12And they went every one straight forward: whither the spirit was to go, they went;andthey turned not when they went.",
        "13As for the likeness of the living creatures, their appearancewaslike burning coals of fire,andlike the appearance oflamps: it went up and down among the living creatures; and the fire was bright, and out of the fire went forth lightning.",
        "14And the living creatures ran and returned as the appearance of a flash of lightning.",
        "15Â¶Now as I beheld the living creatures, behold onewheelupon the earth by the living creatures, with his four faces.",
        "16The appearance of thewheelsand their workwaslike unto the colour of a beryl: and they fourhad one likeness: and their appearance and their workwasas it were a wheel in the middle of a wheel.",
        "17When theywent, they went upon their four sides:andthey turned not when they went.",
        "18As for their rings, they were so high that they were dreadful; and their ringswerefull of eyes round about them four.",
        "19And when the living creatures went, the wheels went by them: and when the living creatures were lifted up from the earth, the wheels were lifted up.",
        "20Whithersoever thespiritwas to go, they went, thitherwas theirspirit to go; and the wheels were lifted up over against them: for the spirit of the living creaturewasin the wheels.",
        "21When those went,thesewent; and when those stood,thesestood; and when those were lifted up from the earth, the wheels were lifted up over against them: for the spirit of the living creaturewasin the wheels.",
        "22And the likeness of thefirmament uponthe heads of thelivingcreaturewasas thecolourof the terriblecrystal, stretched forth over their heads above.",
        "23And under the firmamentweretheir wings straight, the one toward the other: every one had two, which covered on this side, and every one had two, which covered on that side, their bodies.",
        "24And when they went, I heard the noise of their wings, like the noise of great waters, as thevoiceof the Almighty, the voice of speech, as the noise of an host: when they stood, they let down their wings.",
        "25And there was a voice from the firmament thatwasover their heads, when they stood,andhad let down their wings.",
        "26Â¶And above the firmament thatwasover their headswasthe likeness of a throne, as the appearance of a sapphire stone: and upon the likeness of thethronewasthe likeness as theappearanceof a man above upon it.",
        "27And I saw as the colour of amber, as the appearance offireround about within it, from the appearance of his loins even upward, and from the appearance of his loins even downward, I saw as it were the appearance of fire, and it had brightness round about.",
        "28As the appearance of thebowthat is in the cloud in the day of rain, sowasthe appearance of the brightness round about. Thiswastheappearanceof the likeness of thegloryof theLord. And when I sawit,Ifellupon my face, and I heard a voice of one that spake."
      ],
      "full_text": "1Now it came to pass in the thirtieth year, in the fourthmonth,in the fifthdayof the month, as Iwasamong thecaptivesby the river ofChebar,thatthe heavens wereopened, and I sawvisionsof God. 2In the fifthdayof the month, whichwasthefifthyear of kingJehoiachinâscaptivity, 3The word of theLordcame expressly unto Ezekiel the priest, the son of Buzi, in the land of the Chaldeans by the river Chebar; and thehandof theLordwas there upon him. 4Â¶And I looked, and, behold, awhirlwindcame out of the north, a great cloud, and afire infolding itself, and a brightnesswasabout it, and out of the midst thereof as the colour of amber, out of the midst of the fire. 5Also out of the midst thereofcamethe likeness of four livingcreatures. And thiswastheir appearance; they had the likeness of a man. 6And every one had four faces, and every one had four wings. 7And their feetwerestraight feet; and the sole of their feetwaslike the sole of a calfâs foot: and they sparkled like the colour of burnishedbrass. 8Andthey hadthe hands of a man under their wings on their four sides; and they four had their faces and their wings. 9Their wingswerejoined one to another; they turned not when they went; they went every onestraightforward. 10As for the likeness of their faces, they four had the face of a man, and the face of a lion, on the right side: and they four had the face of an ox on the left side; they four also had the face of an eagle. 11Thusweretheir faces: and theirwingswerestretched upward; twowingsof every onewerejoined one to another, and two covered their bodies. 12And they went every one straight forward: whither the spirit was to go, they went;andthey turned not when they went. 13As for the likeness of the living creatures, their appearancewaslike burning coals of fire,andlike the appearance oflamps: it went up and down among the living creatures; and the fire was bright, and out of the fire went forth lightning. 14And the living creatures ran and returned as the appearance of a flash of lightning. 15Â¶Now as I beheld the living creatures, behold onewheelupon the earth by the living creatures, with his four faces. 16The appearance of thewheelsand their workwaslike unto the colour of a beryl: and they fourhad one likeness: and their appearance and their workwasas it were a wheel in the middle of a wheel. 17When theywent, they went upon their four sides:andthey turned not when they went. 18As for their rings, they were so high that they were dreadful; and their ringswerefull of eyes round about them four. 19And when the living creatures went, the wheels went by them: and when the living creatures were lifted up from the earth, the wheels were lifted up. 20Whithersoever thespiritwas to go, they went, thitherwas theirspirit to go; and the wheels were lifted up over against them: for the spirit of the living creaturewasin the wheels. 21When those went,thesewent; and when those stood,thesestood; and when those were lifted up from the earth, the wheels were lifted up over against them: for the spirit of the living creaturewasin the wheels. 22And the likeness of thefirmament uponthe heads of thelivingcreaturewasas thecolourof the terriblecrystal, stretched forth over their heads above. 23And under the firmamentweretheir wings straight, the one toward the other: every one had two, which covered on this side, and every one had two, which covered on that side, their bodies. 24And when they went, I heard the noise of their wings, like the noise of great waters, as thevoiceof the Almighty, the voice of speech, as the noise of an host: when they stood, they let down their wings. 25And there was a voice from the firmament thatwasover their heads, when they stood,andhad let down their wings. 26Â¶And above the firmament thatwasover their headswasthe likeness of a throne, as the appearance of a sapphire stone: and upon the likeness of thethronewasthe likeness as theappearanceof a man above upon it. 27And I saw as the colour of amber, as the appearance offireround about within it, from the appearance of his loins even upward, and from the appearance of his loins even downward, I saw as it were the appearance of fire, and it had brightness round about. 28As the appearance of thebowthat is in the cloud in the day of rain, sowasthe appearance of the brightness round about. Thiswastheappearanceof the likeness of thegloryof theLord. And when I sawit,Ifellupon my face, and I heard a voice of one that spake."
    },
    {
      "reference": "Ezekiel 2",
      "title": "Ezekiel 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezek/2?lang=eng",
      "summary": "Ezekiel is called to take the word of the Lord to IsraelâHe sees a book in which lamentations and mourning are written.",
      "verses": [
        "1And he said unto me,Son of man, stand upon thy feet, and I will speak unto thee.",
        "2And thespiritentered into me when he spake unto me, and set me upon my feet, that I heard him that spake unto me.",
        "3And he said unto me, Son of man, Isendthee to the children of Israel,to arebelliousnation that hath rebelled against me: they and their fathers have transgressed against me,evenunto this very day.",
        "4Forthey areimpudent children andstiffhearted. I dosendthee unto them; and thou shalt say unto them, Thus saith the LordGod.",
        "5And they, whether they will hear, or whether they will forbear, (for theyarearebellioushouse,)yetshall know that there hath been a prophet among them.",
        "6Â¶And thou, son of man,benotafraidof them, neither be afraid of their words, though briers and thornsbewith thee, and thou dostdwellamong scorpions: be not afraid of their words, nor be dismayed at their looks, though theybea rebellious house.",
        "7And thou shaltspeakmy words unto them, whether they will hear, or whether they will forbear: for theyaremost rebellious.",
        "8But thou, son of man, hear what I say unto thee; Be not thou rebellious like that rebellious house: open thy mouth, andeatthat I give thee.",
        "9Â¶And when I looked, behold, an handwassent unto me; and, lo, arollof abookwastherein;",
        "10And he spread it before me; and itwaswrittenwithin and without: andthere waswritten therein lamentations, and mourning, and woe."
      ],
      "full_text": "1And he said unto me,Son of man, stand upon thy feet, and I will speak unto thee. 2And thespiritentered into me when he spake unto me, and set me upon my feet, that I heard him that spake unto me. 3And he said unto me, Son of man, Isendthee to the children of Israel,to arebelliousnation that hath rebelled against me: they and their fathers have transgressed against me,evenunto this very day. 4Forthey areimpudent children andstiffhearted. I dosendthee unto them; and thou shalt say unto them, Thus saith the LordGod. 5And they, whether they will hear, or whether they will forbear, (for theyarearebellioushouse,)yetshall know that there hath been a prophet among them. 6Â¶And thou, son of man,benotafraidof them, neither be afraid of their words, though briers and thornsbewith thee, and thou dostdwellamong scorpions: be not afraid of their words, nor be dismayed at their looks, though theybea rebellious house. 7And thou shaltspeakmy words unto them, whether they will hear, or whether they will forbear: for theyaremost rebellious. 8But thou, son of man, hear what I say unto thee; Be not thou rebellious like that rebellious house: open thy mouth, andeatthat I give thee. 9Â¶And when I looked, behold, an handwassent unto me; and, lo, arollof abookwastherein; 10And he spread it before me; and itwaswrittenwithin and without: andthere waswritten therein lamentations, and mourning, and woe."
    },
    {
      "reference": "Ezekiel 3",
      "title": "Ezekiel 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezek/3?lang=eng",
      "summary": "Ezekiel is made a watchman unto the house of IsraelâThe blood of Israel is required at his hand unless he raises the warning voice.",
      "verses": [
        "1Moreover he said unto me, Son of man, eat that thou findest; eat thisroll, and go speak unto the house of Israel.",
        "2So I opened my mouth, and he caused me to eat that roll.",
        "3And he said unto me, Son of man, cause thy belly to eat, and fill thy bowels with this roll that I give thee. Then did Ieatit;and it was in my mouth as honey for sweetness.",
        "4Â¶And he said unto me, Son of man, go, get thee unto the house of Israel, and speak with my words unto them.",
        "5For thouartnot sent to a people of a strange speech and of an hard language,butto the house of Israel;",
        "6Not to many people of a strange speech and of an hard language, whose words thou canst not understand. Surely, had I sent thee to them, they would havehearkenedunto thee.",
        "7But the house of Israel will not hearken unto thee; for they will not hearken unto me: for all the house of Israelareimpudent andhardhearted.",
        "8Behold, I have made thy face strong against their faces, and thy forehead strong against their foreheads.",
        "9As anadamantharder than flint have I made thy forehead: fear them not, neither be dismayed at their looks, though theybea rebellious house.",
        "10Moreover he said unto me, Son of man, all my words that I shall speak unto thee receive in thine heart, and hear with thine ears.",
        "11And go, get thee to them of the captivity, unto the children of thy people, and speak unto them, and tell them, Thus saiththe LordGod; whether they will hear, or whether they will forbear.",
        "12Then thespirittook me up, and I heard behind me a voice of a great rushing,saying,Blessedbethe glory of theLordfrom his place.",
        "13I heardalso thenoiseof the wings of the living creatures that touched one another, and the noise of the wheels over against them, and a noise of a great rushing.",
        "14So the spirit lifted me up, and took me away, and I went in bitterness, in the heat of my spirit; but the hand of theLordwas strong upon me.",
        "15Â¶Then I came to them of the captivity at Tel-abib, that dwelt by the river of Chebar, and I sat where they sat, and remained there astonished among them seven days.",
        "16And it came to pass at the end of seven days, that the word of theLordcame unto me, saying,",
        "17Son of man, I have made thee awatchmanunto the house of Israel: therefore hear the word at my mouth, and give themwarningfrom me.",
        "18When I say unto the wicked, Thou shalt surelydie; and thou givest him notwarning, nor speakest to warn the wicked from his wicked way, to save his life; the same wickedmanshalldiein hisiniquity; but his blood will Irequireat thine hand.",
        "19Yet if thouwarnthe wicked, and he turn not from his wickedness, nor from his wicked way, he shall die in his iniquity; but thou hast delivered thy soul.",
        "20Again, When arighteousmandothturnfrom hisrighteousness, and commit iniquity, and I lay astumblingblockbefore him, he shall die: because thou hast not given him warning, he shall die in his sin, and his righteousness which he hath done shall not be remembered; but his blood will I require at thine hand.",
        "21Nevertheless if thou warn the righteousman,that the righteous sin not, and he doth not sin, he shall surely live, because he iswarned; also thou hast delivered thy soul.",
        "22Â¶And the hand of theLordwas there upon me; and he said unto me, Arise, go forth into theplain, and I will there talk with thee.",
        "23Then I arose, and went forth into the plain: and, behold, the glory of theLordstood there, as the glory which I saw by the river of Chebar: and Ifellon my face.",
        "24Then the spirit entered into me, and set me upon my feet, and spake with me, and said unto me, Go, shut thyself within thine house.",
        "25But thou, O son of man, behold, they shall put bands upon thee, and shall bind thee with them, and thou shalt not go out among them:",
        "26And I will make thy tongue cleave to the roof of thy mouth, that thou shalt bedumb, and shalt not be to them a reprover: for theyarea rebellious house.",
        "27But when I speak with thee, I will open thymouth, and thou shalt say unto them, Thussaiththe LordGod; He that heareth, let him hear; and he that forbeareth, let him forbear: for theyarea rebellious house."
      ],
      "full_text": "1Moreover he said unto me, Son of man, eat that thou findest; eat thisroll, and go speak unto the house of Israel. 2So I opened my mouth, and he caused me to eat that roll. 3And he said unto me, Son of man, cause thy belly to eat, and fill thy bowels with this roll that I give thee. Then did Ieatit;and it was in my mouth as honey for sweetness. 4Â¶And he said unto me, Son of man, go, get thee unto the house of Israel, and speak with my words unto them. 5For thouartnot sent to a people of a strange speech and of an hard language,butto the house of Israel; 6Not to many people of a strange speech and of an hard language, whose words thou canst not understand. Surely, had I sent thee to them, they would havehearkenedunto thee. 7But the house of Israel will not hearken unto thee; for they will not hearken unto me: for all the house of Israelareimpudent andhardhearted. 8Behold, I have made thy face strong against their faces, and thy forehead strong against their foreheads. 9As anadamantharder than flint have I made thy forehead: fear them not, neither be dismayed at their looks, though theybea rebellious house. 10Moreover he said unto me, Son of man, all my words that I shall speak unto thee receive in thine heart, and hear with thine ears. 11And go, get thee to them of the captivity, unto the children of thy people, and speak unto them, and tell them, Thus saiththe LordGod; whether they will hear, or whether they will forbear. 12Then thespirittook me up, and I heard behind me a voice of a great rushing,saying,Blessedbethe glory of theLordfrom his place. 13I heardalso thenoiseof the wings of the living creatures that touched one another, and the noise of the wheels over against them, and a noise of a great rushing. 14So the spirit lifted me up, and took me away, and I went in bitterness, in the heat of my spirit; but the hand of theLordwas strong upon me. 15Â¶Then I came to them of the captivity at Tel-abib, that dwelt by the river of Chebar, and I sat where they sat, and remained there astonished among them seven days. 16And it came to pass at the end of seven days, that the word of theLordcame unto me, saying, 17Son of man, I have made thee awatchmanunto the house of Israel: therefore hear the word at my mouth, and give themwarningfrom me. 18When I say unto the wicked, Thou shalt surelydie; and thou givest him notwarning, nor speakest to warn the wicked from his wicked way, to save his life; the same wickedmanshalldiein hisiniquity; but his blood will Irequireat thine hand. 19Yet if thouwarnthe wicked, and he turn not from his wickedness, nor from his wicked way, he shall die in his iniquity; but thou hast delivered thy soul. 20Again, When arighteousmandothturnfrom hisrighteousness, and commit iniquity, and I lay astumblingblockbefore him, he shall die: because thou hast not given him warning, he shall die in his sin, and his righteousness which he hath done shall not be remembered; but his blood will I require at thine hand. 21Nevertheless if thou warn the righteousman,that the righteous sin not, and he doth not sin, he shall surely live, because he iswarned; also thou hast delivered thy soul. 22Â¶And the hand of theLordwas there upon me; and he said unto me, Arise, go forth into theplain, and I will there talk with thee. 23Then I arose, and went forth into the plain: and, behold, the glory of theLordstood there, as the glory which I saw by the river of Chebar: and Ifellon my face. 24Then the spirit entered into me, and set me upon my feet, and spake with me, and said unto me, Go, shut thyself within thine house. 25But thou, O son of man, behold, they shall put bands upon thee, and shall bind thee with them, and thou shalt not go out among them: 26And I will make thy tongue cleave to the roof of thy mouth, that thou shalt bedumb, and shalt not be to them a reprover: for theyarea rebellious house. 27But when I speak with thee, I will open thymouth, and thou shalt say unto them, Thussaiththe LordGod; He that heareth, let him hear; and he that forbeareth, let him forbear: for theyarea rebellious house."
    },
    {
      "reference": "Ezekiel 33",
      "title": "Ezekiel 33",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezek/33?lang=eng",
      "summary": "Watchmen who raise the warning voice save their own soulsâRepentant sinners are savedâThe righteous who turn to sin are damnedâThe people of Judah in Jerusalem are destroyed because of their sins.",
      "verses": [
        "1Again the word of theLordcame unto me, saying,",
        "2Son of man, speak to the children of thy people, and say unto them, When I bring the sword upon a land, if the people of the land take a man of their coasts, and set him for theirwatchman:",
        "3If when he seeth the sword come upon the land, he blow the trumpet, andwarnthe people;",
        "4Then whosoever heareth the sound of the trumpet, and taketh not warning; if the sword come, and take him away, hisbloodshall be upon hisownhead.",
        "5He heard the sound of the trumpet, and took not warning; his blood shall be upon him. But he that taketh warning shall deliver his soul.",
        "6But if the watchman see the sword come, and blow not the trumpet, and the people be notwarned; if the sword come, and takeanyperson from among them, he is taken away in his iniquity; but his blood will Irequireat the watchmanâs hand.",
        "7Â¶So thou, O son of man, I have set thee awatchmanunto the house of Israel; therefore thou shalt hear the word at my mouth, and warn them from me.",
        "8When I say unto the wicked, O wickedman,thou shalt surely die; if thou dost not speak to warn the wicked from his way, that wickedmanshall die in his iniquity; but his blood will I require at thine hand.",
        "9Nevertheless, if thouwarnthe wicked of his way to turn from it; if he do not turn from his way, he shall die in hisiniquity; but thou hast delivered thy soul.",
        "10Therefore, O thou son of man, speak unto the house of Israel; Thus ye speak, saying, If our transgressions and our sinsbeupon us, and we pine away in them, how should we then live?",
        "11Say unto them,AsI live, saith the LordGod, I have nopleasurein thedeathof the wicked; but that the wicked turn from his way and live: turn ye, turn ye from your evil ways; for why will yedie, O house of Israel?",
        "12Therefore, thou son of man, say unto the children of thy people, The righteousness of the righteous shall not deliver him in the day of histransgression: as for the wickedness of the wicked, he shall not fall thereby in the day that he turneth from his wickedness; neither shall the righteous be able to live for hisrighteousnessin the day that he sinneth.",
        "13When I shall say to the righteous,thathe shall surely live; if hetrustto his own righteousness, and commitiniquity, all his righteousnesses shall not be remembered; but for his iniquity that he hath committed, he shall die for it.",
        "14Again, when I say unto the wicked, Thou shalt surelydie; if heturnfrom his sin, and do that which is lawful and right;",
        "15Ifthe wickedrestorethepledge, give again that he had robbed, walk in thestatutesof life, without committing iniquity; he shall surely live, he shall not die.",
        "16None of hissinsthat he hath committed shall be mentioned unto him: he hath done that which is lawful and right; he shall surely live.",
        "17Â¶Yet the children of thy people say, Thewayof the Lord is notequal: but as for them, their way is notequal.",
        "18When the righteousturnethfrom hisrighteousness, and committeth iniquity, he shall even die thereby.",
        "19But if the wicked turn from his wickedness, and do that which is lawful and right, he shall live thereby.",
        "20Â¶Yet ye say, The way of the Lord is not equal. O ye house of Israel, I willjudgeyou every one after his ways.",
        "21Â¶And it came to pass in thetwelfthyear of our captivity, in the tenthmonth,in the fifthdayof the month,thatone that hadescapedout of Jerusalem came unto me, saying, Thecityis smitten.",
        "22Now thehandof theLordwas upon me in the evening, afore he that was escaped came; and had opened my mouth, until he came to me in the morning; and my mouth was opened, and I was no moredumb.",
        "23Then the word of theLordcame unto me, saying,",
        "24Son of man, they that inhabit thosewastesof the land of Israel speak, saying, Abraham was one, and he inherited the land: but wearemany; the land is given us for inheritance.",
        "25Wherefore say unto them, Thus saith the LordGod; Ye eat with theblood, and lift up your eyes toward your idols, and shed blood: and shall ye possess the land?",
        "26Yestand upon your sword, ye work abomination, and ye defile every one his neighbourâs wife: and shall ye possess the land?",
        "27Say thou thus unto them, Thus saith the LordGod;AsI live, surely they thatarein the wastes shall fall by thesword, and him thatisin the open field will I give to the beasts to be devoured, and they thatbein the forts and in the caves shall die of the pestilence.",
        "28For I will lay the land most desolate, and the pomp of her strength shall cease; and the mountains of Israel shall be desolate, that none shall pass through.",
        "29Then shall they know that IamtheLord, when I have laid the land most desolate because of all their abominations which they have committed.",
        "30Â¶Also, thou son of man, the children of thy people still are talking against thee by the walls and in the doors of the houses, and speak one to another, every one to his brother, saying, Come, I pray you, and hear what is the word that cometh forth from theLord.",
        "31And they come unto thee as the people cometh, and they sit before theeasmy people, and theyhearthy words, but they will not do them: for with theirmouththey shew much love,buttheir heart goeth after theircovetousness.",
        "32And, lo, thouartunto them as a very lovely song of one that hath a pleasant voice, and can play well on an instrument: for they hear thy words, but they do them not.",
        "33Andwhenthis cometh to pass, (lo, it will come,) then shall they know that a prophet hath been among them."
      ],
      "full_text": "1Again the word of theLordcame unto me, saying, 2Son of man, speak to the children of thy people, and say unto them, When I bring the sword upon a land, if the people of the land take a man of their coasts, and set him for theirwatchman: 3If when he seeth the sword come upon the land, he blow the trumpet, andwarnthe people; 4Then whosoever heareth the sound of the trumpet, and taketh not warning; if the sword come, and take him away, hisbloodshall be upon hisownhead. 5He heard the sound of the trumpet, and took not warning; his blood shall be upon him. But he that taketh warning shall deliver his soul. 6But if the watchman see the sword come, and blow not the trumpet, and the people be notwarned; if the sword come, and takeanyperson from among them, he is taken away in his iniquity; but his blood will Irequireat the watchmanâs hand. 7Â¶So thou, O son of man, I have set thee awatchmanunto the house of Israel; therefore thou shalt hear the word at my mouth, and warn them from me. 8When I say unto the wicked, O wickedman,thou shalt surely die; if thou dost not speak to warn the wicked from his way, that wickedmanshall die in his iniquity; but his blood will I require at thine hand. 9Nevertheless, if thouwarnthe wicked of his way to turn from it; if he do not turn from his way, he shall die in hisiniquity; but thou hast delivered thy soul. 10Therefore, O thou son of man, speak unto the house of Israel; Thus ye speak, saying, If our transgressions and our sinsbeupon us, and we pine away in them, how should we then live? 11Say unto them,AsI live, saith the LordGod, I have nopleasurein thedeathof the wicked; but that the wicked turn from his way and live: turn ye, turn ye from your evil ways; for why will yedie, O house of Israel? 12Therefore, thou son of man, say unto the children of thy people, The righteousness of the righteous shall not deliver him in the day of histransgression: as for the wickedness of the wicked, he shall not fall thereby in the day that he turneth from his wickedness; neither shall the righteous be able to live for hisrighteousnessin the day that he sinneth. 13When I shall say to the righteous,thathe shall surely live; if hetrustto his own righteousness, and commitiniquity, all his righteousnesses shall not be remembered; but for his iniquity that he hath committed, he shall die for it. 14Again, when I say unto the wicked, Thou shalt surelydie; if heturnfrom his sin, and do that which is lawful and right; 15Ifthe wickedrestorethepledge, give again that he had robbed, walk in thestatutesof life, without committing iniquity; he shall surely live, he shall not die. 16None of hissinsthat he hath committed shall be mentioned unto him: he hath done that which is lawful and right; he shall surely live. 17Â¶Yet the children of thy people say, Thewayof the Lord is notequal: but as for them, their way is notequal. 18When the righteousturnethfrom hisrighteousness, and committeth iniquity, he shall even die thereby. 19But if the wicked turn from his wickedness, and do that which is lawful and right, he shall live thereby. 20Â¶Yet ye say, The way of the Lord is not equal. O ye house of Israel, I willjudgeyou every one after his ways. 21Â¶And it came to pass in thetwelfthyear of our captivity, in the tenthmonth,in the fifthdayof the month,thatone that hadescapedout of Jerusalem came unto me, saying, Thecityis smitten. 22Now thehandof theLordwas upon me in the evening, afore he that was escaped came; and had opened my mouth, until he came to me in the morning; and my mouth was opened, and I was no moredumb. 23Then the word of theLordcame unto me, saying, 24Son of man, they that inhabit thosewastesof the land of Israel speak, saying, Abraham was one, and he inherited the land: but wearemany; the land is given us for inheritance. 25Wherefore say unto them, Thus saith the LordGod; Ye eat with theblood, and lift up your eyes toward your idols, and shed blood: and shall ye possess the land? 26Yestand upon your sword, ye work abomination, and ye defile every one his neighbourâs wife: and shall ye possess the land? 27Say thou thus unto them, Thus saith the LordGod;AsI live, surely they thatarein the wastes shall fall by thesword, and him thatisin the open field will I give to the beasts to be devoured, and they thatbein the forts and in the caves shall die of the pestilence. 28For I will lay the land most desolate, and the pomp of her strength shall cease; and the mountains of Israel shall be desolate, that none shall pass through. 29Then shall they know that IamtheLord, when I have laid the land most desolate because of all their abominations which they have committed. 30Â¶Also, thou son of man, the children of thy people still are talking against thee by the walls and in the doors of the houses, and speak one to another, every one to his brother, saying, Come, I pray you, and hear what is the word that cometh forth from theLord. 31And they come unto thee as the people cometh, and they sit before theeasmy people, and theyhearthy words, but they will not do them: for with theirmouththey shew much love,buttheir heart goeth after theircovetousness. 32And, lo, thouartunto them as a very lovely song of one that hath a pleasant voice, and can play well on an instrument: for they hear thy words, but they do them not. 33Andwhenthis cometh to pass, (lo, it will come,) then shall they know that a prophet hath been among them."
    },
    {
      "reference": "Ezekiel 34",
      "title": "Ezekiel 34",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezek/34?lang=eng",
      "summary": "The Lord reproves those shepherds who do not feed the flockâIn the last days, the Lord will gather the lost sheep of IsraelâThe Messiah will be their ShepherdâThe Lord will make His gospel covenant with them.",
      "verses": [
        "1And the word of theLordcame unto me, saying,",
        "2Son of man, prophesy against the shepherds of Israel, prophesy, and say unto them, Thus saith the LordGodunto the shepherds; Woebeto theshepherdsof Israel that do feed themselves! should not the shepherdsfeedthe flocks?",
        "3Ye eat thefat, and ye clothe you with the wool, ye kill them that are fed:butye feed not the flock.",
        "4The diseased have ye not strengthened, neither have ye healed that which wassick, neither have ye bound upthat which wasbroken, neither have ye brought again that which was driven away, neither have ye sought that which was lost; but with force and withcrueltyhave ye ruled them.",
        "5And they were scattered, becausethere isno shepherd: and they became meat to all the beasts of the field, when they were scattered.",
        "6Mysheepwandered through all the mountains, and upon every high hill: yea, my flock was scatteredupon all the face of the earth, and none did search or seekafter them.",
        "7Â¶Therefore, ye shepherds, hear the word of theLord;",
        "8AsI live, saith the LordGod, surely because my flock became a prey, and my flock became meat to every beast of the field, becausethere wasno shepherd, neither did my shepherds search for my flock, but theshepherdsfedthemselves, and fed not my flock;",
        "9Therefore, O ye shepherds, hear the word of theLord;",
        "10Thus saith the LordGod; Behold, Iamagainst the shepherds; and I willrequiremy flock at their hand, and cause them toceasefrom feeding the flock; neither shall the shepherds feed themselves any more; for I will deliver my flock from their mouth, that they may not be meat for them.",
        "11Â¶For thus saith the LordGod; Behold, I,evenI, will bothsearchmy sheep, and seek them out.",
        "12As ashepherdseeketh out his flock in the day that he is among his sheepthat arescattered; so will Iseekout mysheep, and will deliver them out of all places where they have beenscatteredin thecloudyanddarkday.",
        "13And I willbringthem out from the people, andgatherthem from the countries, and will bring them to their ownland, and feed them upon the mountains of Israel by the rivers, and in all the inhabited places of the country.",
        "14I will feed them in a good pasture, and upon the high mountains of Israel shall their fold be: there shall theyliein a good fold, andina fat pasture shall they feed upon the mountains of Israel.",
        "15I will feed my flock, and I will cause them to lie down, saith the LordGod.",
        "16I will seek that which waslost, and bring again that which was driven away, and will bind upthat which wasbroken, and will strengthen that which wassick: but I will destroy thefatand the strong; I will feed them withjudgment.",
        "17Andas foryou, O myflock, thus saith the LordGod; Behold, Ijudgebetween cattle and cattle, between the rams and the he goats.",
        "18Seemeth ita small thing unto you to have eaten up the good pasture, but ye must tread down with your feet the residue of your pastures? and to have drunk of the deep waters, but ye mustfoulthe residue with your feet?",
        "19Andas formy flock, they eat that which ye havetroddenwith your feet; and they drink that which ye have fouled with your feet.",
        "20Â¶Therefore thus saith the LordGodunto them; Behold, I,evenI, will judge between the fat cattle and between the lean cattle.",
        "21Because ye have thrust with side and with shoulder, and pushed all the diseased with your horns, till ye have scattered them abroad;",
        "22Therefore will I save myflock, and they shall no more be a prey; and I will judge between cattle and cattle.",
        "23And I will set uponeshepherdover them, and he shall feed them,evenmy servantDavid; he shallfeed them, and he shall be their shepherd.",
        "24And ItheLordwill be theirGod, and my servantDavidaprinceamong them; I theLordhave spokenit.",
        "25And I will make with them acovenantof peace, and will cause the evil beasts to cease out of the land: and they shall dwellsafelyin the wilderness, and sleep in the woods.",
        "26And I will make them and the places round about my hill a blessing; and I will cause theshowerto come down in his season; there shall be showers ofblessing.",
        "27And the tree of the field shall yield her fruit, and theearthshall yield her increase, and they shall besafein their land, and shall know that IamtheLord, when I have broken the bands of theiryoke, and delivered them out of the hand of those thatserved themselves of them.",
        "28And they shall no more be a prey to the heathen, neither shall the beast of the land devour them; but they shall dwellsafely, and none shall makethemafraid.",
        "29And I will raise up for them aplantof renown, and they shall be no more consumed with hunger in the land, neither bear theshameof the heathen any more.",
        "30Thus shall they know that I theLordtheir Godamwith them, andthatthey,eventhe house of Israel,aremy people, saith the LordGod.",
        "31And ye myflock, the flock of my pasture,aremen,andIamyour God, saith the LordGod."
      ],
      "full_text": "1And the word of theLordcame unto me, saying, 2Son of man, prophesy against the shepherds of Israel, prophesy, and say unto them, Thus saith the LordGodunto the shepherds; Woebeto theshepherdsof Israel that do feed themselves! should not the shepherdsfeedthe flocks? 3Ye eat thefat, and ye clothe you with the wool, ye kill them that are fed:butye feed not the flock. 4The diseased have ye not strengthened, neither have ye healed that which wassick, neither have ye bound upthat which wasbroken, neither have ye brought again that which was driven away, neither have ye sought that which was lost; but with force and withcrueltyhave ye ruled them. 5And they were scattered, becausethere isno shepherd: and they became meat to all the beasts of the field, when they were scattered. 6Mysheepwandered through all the mountains, and upon every high hill: yea, my flock was scatteredupon all the face of the earth, and none did search or seekafter them. 7Â¶Therefore, ye shepherds, hear the word of theLord; 8AsI live, saith the LordGod, surely because my flock became a prey, and my flock became meat to every beast of the field, becausethere wasno shepherd, neither did my shepherds search for my flock, but theshepherdsfedthemselves, and fed not my flock; 9Therefore, O ye shepherds, hear the word of theLord; 10Thus saith the LordGod; Behold, Iamagainst the shepherds; and I willrequiremy flock at their hand, and cause them toceasefrom feeding the flock; neither shall the shepherds feed themselves any more; for I will deliver my flock from their mouth, that they may not be meat for them. 11Â¶For thus saith the LordGod; Behold, I,evenI, will bothsearchmy sheep, and seek them out. 12As ashepherdseeketh out his flock in the day that he is among his sheepthat arescattered; so will Iseekout mysheep, and will deliver them out of all places where they have beenscatteredin thecloudyanddarkday. 13And I willbringthem out from the people, andgatherthem from the countries, and will bring them to their ownland, and feed them upon the mountains of Israel by the rivers, and in all the inhabited places of the country. 14I will feed them in a good pasture, and upon the high mountains of Israel shall their fold be: there shall theyliein a good fold, andina fat pasture shall they feed upon the mountains of Israel. 15I will feed my flock, and I will cause them to lie down, saith the LordGod. 16I will seek that which waslost, and bring again that which was driven away, and will bind upthat which wasbroken, and will strengthen that which wassick: but I will destroy thefatand the strong; I will feed them withjudgment. 17Andas foryou, O myflock, thus saith the LordGod; Behold, Ijudgebetween cattle and cattle, between the rams and the he goats. 18Seemeth ita small thing unto you to have eaten up the good pasture, but ye must tread down with your feet the residue of your pastures? and to have drunk of the deep waters, but ye mustfoulthe residue with your feet? 19Andas formy flock, they eat that which ye havetroddenwith your feet; and they drink that which ye have fouled with your feet. 20Â¶Therefore thus saith the LordGodunto them; Behold, I,evenI, will judge between the fat cattle and between the lean cattle. 21Because ye have thrust with side and with shoulder, and pushed all the diseased with your horns, till ye have scattered them abroad; 22Therefore will I save myflock, and they shall no more be a prey; and I will judge between cattle and cattle. 23And I will set uponeshepherdover them, and he shall feed them,evenmy servantDavid; he shallfeed them, and he shall be their shepherd. 24And ItheLordwill be theirGod, and my servantDavidaprinceamong them; I theLordhave spokenit. 25And I will make with them acovenantof peace, and will cause the evil beasts to cease out of the land: and they shall dwellsafelyin the wilderness, and sleep in the woods. 26And I will make them and the places round about my hill a blessing; and I will cause theshowerto come down in his season; there shall be showers ofblessing. 27And the tree of the field shall yield her fruit, and theearthshall yield her increase, and they shall besafein their land, and shall know that IamtheLord, when I have broken the bands of theiryoke, and delivered them out of the hand of those thatserved themselves of them. 28And they shall no more be a prey to the heathen, neither shall the beast of the land devour them; but they shall dwellsafely, and none shall makethemafraid. 29And I will raise up for them aplantof renown, and they shall be no more consumed with hunger in the land, neither bear theshameof the heathen any more. 30Thus shall they know that I theLordtheir Godamwith them, andthatthey,eventhe house of Israel,aremy people, saith the LordGod. 31And ye myflock, the flock of my pasture,aremen,andIamyour God, saith the LordGod."
    },
    {
      "reference": "Ezekiel 36",
      "title": "Ezekiel 36",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezek/36?lang=eng",
      "summary": "In the last days, all the house of Israel will be gathered to their own landsâThe Lord will give them a new heart and a new spiritâThey will have His gospel law.",
      "verses": [
        "1Also, thou son of man, prophesy unto themountainsof Israel, and say, Ye mountains of Israel, hear the word of theLord:",
        "2Thus saith the LordGod; Because theenemyhath said against you, Aha, even the ancient high places are ours inpossession:",
        "3Therefore prophesy and say, Thus saith the LordGod; Because they have madeyoudesolate, and swallowed you up on every side, that ye might be a possession unto the residue of the heathen, and ye are taken up in the lips of talkers, andarean infamy of the people:",
        "4Therefore, ye mountains of Israel, hear the word of the LordGod; Thus saith the LordGodto the mountains, and to the hills, to therivers, and to the valleys, to the desolatewastes, and to the cities that are forsaken, which became a prey andderisionto the residue of the heathen thatareround about;",
        "5Therefore thus saith the LordGod; Surely in the fire of myjealousyhave I spoken against the residue of the heathen, and against allIdumea, which have appointed my land into their possession with the joy of alltheirheart, with despiteful minds, to cast it out for a prey.",
        "6Prophesy therefore concerning the land of Israel, and say unto the mountains, and to the hills, to the rivers, and to the valleys, Thus saith the LordGod; Behold, I have spoken in my jealousy and in my fury, because ye have borne theshameof the heathen:",
        "7Therefore thus saith the LordGod; I have lifted up mine hand, Surely the heathen thatareabout you, they shall bear their shame.",
        "8Â¶But ye, O mountains of Israel, ye shall shoot forth yourbranches, and yield your fruit to my people of Israel; for they areathand to come.",
        "9For, behold, Iamfor you, and I willturnunto you, and ye shall be tilled and sown:",
        "10And I will multiply men upon you, all the house of Israel,evenall of it: and the cities shall beinhabited, and thewastesshall bebuilded:",
        "11And I will multiply upon you man and beast; and they shall increase and bring fruit: and I willsettle you after your oldestates, and will do betterunto youthan at your beginnings: and ye shall know that IamtheLord.",
        "12Yea, I will cause men to walk upon you,evenmy people Israel; and they shallpossessthee, and thou shalt be their inheritance, and thou shalt no more henceforth bereave themof men.",
        "13Thus saith the LordGod; Because they say unto you, Thoulanddevourest up men, and hastbereavedthy nations;",
        "14Therefore thou shalt devour men no more, neither bereave thy nations any more, saith the LordGod.",
        "15Neither will I causemento hear in thee the shame of the heathen any more, neither shalt thou bear the reproach of the people any more, neither shalt thou cause thy nations to fall any more, saith the LordGod.",
        "16Â¶Moreover the word of theLordcame unto me, saying,",
        "17Son of man, when the house of Israel dwelt in their own land, theydefiledit by their own way and by their doings: their way was before me as theuncleannessof a removed woman.",
        "18Wherefore I poured my fury upon them for the blood that they hadshedupon the land, and for theiridolswherewiththey hadpollutedit:",
        "19And Iscatteredthem among theheathen, and they weredispersedthrough the countries: according to their way andaccordingto their doings I judged them.",
        "20And when they entered unto the heathen, whither they went, theyprofanedmy holy name, when they said to them, Thesearethe people of theLord, and are gone forthout of his land.",
        "21Â¶But I hadpityfor mine holyname, which the house of Israel had profaned among the heathen, whither they went.",
        "22Therefore say unto the house of Israel, Thus saith the LordGod; I do notthisfor yoursakes, O house of Israel, but for mine holynameâssake, which ye have profaned among the heathen, whither ye went.",
        "23And I will sanctify my great name, which was profaned among theheathen, which ye have profaned in the midst of them; and the heathen shall know that IamtheLord, saith the LordGod, when I shall besanctifiedin you before their eyes.",
        "24For I will take you from among the heathen, andgatheryou out of all countries, and will bring you into your ownland.",
        "25Â¶Then will Isprinkleclean water upon you, and ye shall be clean: from all yourfilthiness, and from all youridols, will I cleanse you.",
        "26Anewheartalso will Igiveyou, and a newspiritwill I put within you: and I will take away the stonyheartout of your flesh, and I will give you an heart of flesh.",
        "27And I will put myspiritwithin you, and cause you to walk in my statutes, and ye shall keep my judgments, and dothem.",
        "28And ye shall dwell in thelandthat I gave to your fathers; and ye shall be my people, and I will be your God.",
        "29I will also save you from all your uncleannesses: and I willcall for the corn, and will increase it, and lay no famine upon you.",
        "30And I will multiply the fruit of the tree, and the increase of the field, that ye shall receive no more reproach of famine among the heathen.",
        "31Then shall yerememberyour own evil ways, and your doings thatwerenot good, and shall lothe yourselves in your own sight for youriniquitiesand for your abominations.",
        "32Not for your sakes do Ithis,saith the LordGod, be it known unto you: be ashamed and confounded for your own ways, O house of Israel.",
        "33Thus saith the LordGod; In the day that I shall have cleansed you from all your iniquities I will also causeyouto dwell in the cities, and the wastes shall be builded.",
        "34And thedesolateland shall betilled, whereas it lay desolate in the sight of all that passed by.",
        "35And they shall say, This land that was desolate is become like thegardenof Eden; and the waste and desolate and ruined citiesare becomefenced,andare inhabited.",
        "36Then the heathen that are left round about you shall know that I theLordbuildthe ruinedplaces, andplant that that was desolate: I theLordhave spokenit,and I willdoit.",
        "37Thus saith the LordGod; I will yetforthis beinquiredof by the house of Israel, to doitfor them; I will increase them with men like a flock.",
        "38As theholy flock, as the flock of Jerusalem in her solemn feasts; so shall the waste cities be filled with flocks of men: and they shall know that IamtheLord."
      ],
      "full_text": "1Also, thou son of man, prophesy unto themountainsof Israel, and say, Ye mountains of Israel, hear the word of theLord: 2Thus saith the LordGod; Because theenemyhath said against you, Aha, even the ancient high places are ours inpossession: 3Therefore prophesy and say, Thus saith the LordGod; Because they have madeyoudesolate, and swallowed you up on every side, that ye might be a possession unto the residue of the heathen, and ye are taken up in the lips of talkers, andarean infamy of the people: 4Therefore, ye mountains of Israel, hear the word of the LordGod; Thus saith the LordGodto the mountains, and to the hills, to therivers, and to the valleys, to the desolatewastes, and to the cities that are forsaken, which became a prey andderisionto the residue of the heathen thatareround about; 5Therefore thus saith the LordGod; Surely in the fire of myjealousyhave I spoken against the residue of the heathen, and against allIdumea, which have appointed my land into their possession with the joy of alltheirheart, with despiteful minds, to cast it out for a prey. 6Prophesy therefore concerning the land of Israel, and say unto the mountains, and to the hills, to the rivers, and to the valleys, Thus saith the LordGod; Behold, I have spoken in my jealousy and in my fury, because ye have borne theshameof the heathen: 7Therefore thus saith the LordGod; I have lifted up mine hand, Surely the heathen thatareabout you, they shall bear their shame. 8Â¶But ye, O mountains of Israel, ye shall shoot forth yourbranches, and yield your fruit to my people of Israel; for they areathand to come. 9For, behold, Iamfor you, and I willturnunto you, and ye shall be tilled and sown: 10And I will multiply men upon you, all the house of Israel,evenall of it: and the cities shall beinhabited, and thewastesshall bebuilded: 11And I will multiply upon you man and beast; and they shall increase and bring fruit: and I willsettle you after your oldestates, and will do betterunto youthan at your beginnings: and ye shall know that IamtheLord. 12Yea, I will cause men to walk upon you,evenmy people Israel; and they shallpossessthee, and thou shalt be their inheritance, and thou shalt no more henceforth bereave themof men. 13Thus saith the LordGod; Because they say unto you, Thoulanddevourest up men, and hastbereavedthy nations; 14Therefore thou shalt devour men no more, neither bereave thy nations any more, saith the LordGod. 15Neither will I causemento hear in thee the shame of the heathen any more, neither shalt thou bear the reproach of the people any more, neither shalt thou cause thy nations to fall any more, saith the LordGod. 16Â¶Moreover the word of theLordcame unto me, saying, 17Son of man, when the house of Israel dwelt in their own land, theydefiledit by their own way and by their doings: their way was before me as theuncleannessof a removed woman. 18Wherefore I poured my fury upon them for the blood that they hadshedupon the land, and for theiridolswherewiththey hadpollutedit: 19And Iscatteredthem among theheathen, and they weredispersedthrough the countries: according to their way andaccordingto their doings I judged them. 20And when they entered unto the heathen, whither they went, theyprofanedmy holy name, when they said to them, Thesearethe people of theLord, and are gone forthout of his land. 21Â¶But I hadpityfor mine holyname, which the house of Israel had profaned among the heathen, whither they went. 22Therefore say unto the house of Israel, Thus saith the LordGod; I do notthisfor yoursakes, O house of Israel, but for mine holynameâssake, which ye have profaned among the heathen, whither ye went. 23And I will sanctify my great name, which was profaned among theheathen, which ye have profaned in the midst of them; and the heathen shall know that IamtheLord, saith the LordGod, when I shall besanctifiedin you before their eyes. 24For I will take you from among the heathen, andgatheryou out of all countries, and will bring you into your ownland. 25Â¶Then will Isprinkleclean water upon you, and ye shall be clean: from all yourfilthiness, and from all youridols, will I cleanse you. 26Anewheartalso will Igiveyou, and a newspiritwill I put within you: and I will take away the stonyheartout of your flesh, and I will give you an heart of flesh. 27And I will put myspiritwithin you, and cause you to walk in my statutes, and ye shall keep my judgments, and dothem. 28And ye shall dwell in thelandthat I gave to your fathers; and ye shall be my people, and I will be your God. 29I will also save you from all your uncleannesses: and I willcall for the corn, and will increase it, and lay no famine upon you. 30And I will multiply the fruit of the tree, and the increase of the field, that ye shall receive no more reproach of famine among the heathen. 31Then shall yerememberyour own evil ways, and your doings thatwerenot good, and shall lothe yourselves in your own sight for youriniquitiesand for your abominations. 32Not for your sakes do Ithis,saith the LordGod, be it known unto you: be ashamed and confounded for your own ways, O house of Israel. 33Thus saith the LordGod; In the day that I shall have cleansed you from all your iniquities I will also causeyouto dwell in the cities, and the wastes shall be builded. 34And thedesolateland shall betilled, whereas it lay desolate in the sight of all that passed by. 35And they shall say, This land that was desolate is become like thegardenof Eden; and the waste and desolate and ruined citiesare becomefenced,andare inhabited. 36Then the heathen that are left round about you shall know that I theLordbuildthe ruinedplaces, andplant that that was desolate: I theLordhave spokenit,and I willdoit. 37Thus saith the LordGod; I will yetforthis beinquiredof by the house of Israel, to doitfor them; I will increase them with men like a flock. 38As theholy flock, as the flock of Jerusalem in her solemn feasts; so shall the waste cities be filled with flocks of men: and they shall know that IamtheLord."
    },
    {
      "reference": "Ezekiel 37",
      "title": "Ezekiel 37",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezek/37?lang=eng",
      "summary": "Ezekiel is shown the valley of dry bonesâIsrael will inherit the land in the ResurrectionâThe stick of Judah (the Bible) and the stick of Joseph (the Book of Mormon) will become one in the Lordâs handâThe children of Israel will be gathered and cleansedâDavid (the Messiah) will reign over themâThey will receive the everlasting gospel covenant.",
      "verses": [
        "1Thehandof theLordwas upon me, andcarriedme out in thespiritof theLord, and set me down in the midst of the valley whichwasfull of bones,",
        "2And caused me to pass by them round about: and, behold,there werevery many in the open valley; and, lo,they werevery dry.",
        "3And he said unto me, Son of man, can these boneslive? And I answered, O LordGod, thou knowest.",
        "4Again he said unto me, Prophesy upon these bones, and say unto them, O ye dry bones, hear the word of theLord.",
        "5Thus saith the LordGodunto these bones; Behold, I will causebreathto enter into you, and ye shall live:",
        "6And I will lay sinews upon you, and will bring up flesh upon you, and cover you with skin, and put breath in you, and ye shall live; and ye shall know that IamtheLord.",
        "7So I prophesied as I was commanded: and as I prophesied, there was a noise, and behold a shaking, and the bones came together,boneto his bone.",
        "8And when I beheld, lo, the sinews and the flesh came up upon them, and the skin covered them above: butthere wasno breath in them.",
        "9Then said he unto me, Prophesy unto thewind, prophesy, son of man, and say to the wind, Thus saiththe LordGod; Come from the fourwinds, O breath, and breathe upon these slain, that they may live.",
        "10So I prophesied as he commanded me, and thebreathcame into them, and they lived, and stood up upon their feet, an exceeding great army.",
        "11Â¶Then he said unto me, Son of man, these bones are the whole house of Israel: behold, they say, Our bones are dried, and our hope islost: we are cut off for our parts.",
        "12Therefore prophesy and say unto them, Thus saith the LordGod; Behold, O my people, I will open yourgraves, and cause you tocomeup out of your graves, andbringyou into theland of Israel.",
        "13And ye shall know that IamtheLord, when I have opened your graves, O my people, and brought you up out of your graves,",
        "14And shall put myspiritin you, and ye shall live, and I shall place you in your own land: then shall ye know that I theLordhave spokenit,and performedit,saith theLord.",
        "15Â¶The word of theLordcame again unto me, saying,",
        "16Moreover, thou son of man, take thee onestick, andwriteupon it, ForJudah, and for the children of Israel his companions: then take another stick, andwriteupon it, ForJoseph, thestickof Ephraim, andforall the house of Israel his companions:",
        "17And join them one to another into one stick; and they shall becomeonein thine hand.",
        "18Â¶And when the children of thy people shall speak unto thee, saying, Wilt thou not shew uswhatthoumeanestby these?",
        "19Say unto them, Thus saith the LordGod; Behold, I will take the stick ofJoseph, whichisin the hand of Ephraim, and the tribes of Israel his fellows, and will put them with him,evenwith the stick of Judah, and make them one stick, and they shall be one in mine hand.",
        "20Â¶And the sticks whereon thou writest shall be in thine hand before their eyes.",
        "21And say unto them, Thus saith the LordGod; Behold, I will take the children of Israel from among theheathen, whither they be gone, and willgatherthem on every side, and bring them into their own land:",
        "22And I will make themonenationin the land upon the mountains of Israel; andoneking shall be king to them all: and they shall be no moretwonations, neither shall they be divided into two kingdoms any more at all:",
        "23Neither shall they defile themselves any more with theiridols, nor with their detestable things, nor with any of their transgressions: but I willsavethem out of all their dwellingplaces, wherein they have sinned, and willcleansethem: so shall they be my people, and I will be their God.",
        "24AndDavidmy servantshall beking over them; and they all shall have oneshepherd: they shall also walk in my judgments, and observe my statutes, and do them.",
        "25And they shall dwell in thelandthat I have given unto Jacob my servant, wherein your fathers have dwelt; and they shall dwell therein,eventhey, and their children, and their childrenâs children forever: and my servant Davidshall betheirprincefor ever.",
        "26Moreover I will make acovenantof peace with them; it shall be aneverlastingcovenantwith them: and I will place them, and multiply them, and will set mysanctuaryin the midst of them for evermore.",
        "27Mytabernaclealso shall be with them: yea, I will be theirGod, and they shall be my people.",
        "28And theheathenshallknowthat I theLorddosanctifyIsrael, when my sanctuary shall be in the midst of them for evermore."
      ],
      "full_text": "1Thehandof theLordwas upon me, andcarriedme out in thespiritof theLord, and set me down in the midst of the valley whichwasfull of bones, 2And caused me to pass by them round about: and, behold,there werevery many in the open valley; and, lo,they werevery dry. 3And he said unto me, Son of man, can these boneslive? And I answered, O LordGod, thou knowest. 4Again he said unto me, Prophesy upon these bones, and say unto them, O ye dry bones, hear the word of theLord. 5Thus saith the LordGodunto these bones; Behold, I will causebreathto enter into you, and ye shall live: 6And I will lay sinews upon you, and will bring up flesh upon you, and cover you with skin, and put breath in you, and ye shall live; and ye shall know that IamtheLord. 7So I prophesied as I was commanded: and as I prophesied, there was a noise, and behold a shaking, and the bones came together,boneto his bone. 8And when I beheld, lo, the sinews and the flesh came up upon them, and the skin covered them above: butthere wasno breath in them. 9Then said he unto me, Prophesy unto thewind, prophesy, son of man, and say to the wind, Thus saiththe LordGod; Come from the fourwinds, O breath, and breathe upon these slain, that they may live. 10So I prophesied as he commanded me, and thebreathcame into them, and they lived, and stood up upon their feet, an exceeding great army. 11Â¶Then he said unto me, Son of man, these bones are the whole house of Israel: behold, they say, Our bones are dried, and our hope islost: we are cut off for our parts. 12Therefore prophesy and say unto them, Thus saith the LordGod; Behold, O my people, I will open yourgraves, and cause you tocomeup out of your graves, andbringyou into theland of Israel. 13And ye shall know that IamtheLord, when I have opened your graves, O my people, and brought you up out of your graves, 14And shall put myspiritin you, and ye shall live, and I shall place you in your own land: then shall ye know that I theLordhave spokenit,and performedit,saith theLord. 15Â¶The word of theLordcame again unto me, saying, 16Moreover, thou son of man, take thee onestick, andwriteupon it, ForJudah, and for the children of Israel his companions: then take another stick, andwriteupon it, ForJoseph, thestickof Ephraim, andforall the house of Israel his companions: 17And join them one to another into one stick; and they shall becomeonein thine hand. 18Â¶And when the children of thy people shall speak unto thee, saying, Wilt thou not shew uswhatthoumeanestby these? 19Say unto them, Thus saith the LordGod; Behold, I will take the stick ofJoseph, whichisin the hand of Ephraim, and the tribes of Israel his fellows, and will put them with him,evenwith the stick of Judah, and make them one stick, and they shall be one in mine hand. 20Â¶And the sticks whereon thou writest shall be in thine hand before their eyes. 21And say unto them, Thus saith the LordGod; Behold, I will take the children of Israel from among theheathen, whither they be gone, and willgatherthem on every side, and bring them into their own land: 22And I will make themonenationin the land upon the mountains of Israel; andoneking shall be king to them all: and they shall be no moretwonations, neither shall they be divided into two kingdoms any more at all: 23Neither shall they defile themselves any more with theiridols, nor with their detestable things, nor with any of their transgressions: but I willsavethem out of all their dwellingplaces, wherein they have sinned, and willcleansethem: so shall they be my people, and I will be their God. 24AndDavidmy servantshall beking over them; and they all shall have oneshepherd: they shall also walk in my judgments, and observe my statutes, and do them. 25And they shall dwell in thelandthat I have given unto Jacob my servant, wherein your fathers have dwelt; and they shall dwell therein,eventhey, and their children, and their childrenâs children forever: and my servant Davidshall betheirprincefor ever. 26Moreover I will make acovenantof peace with them; it shall be aneverlastingcovenantwith them: and I will place them, and multiply them, and will set mysanctuaryin the midst of them for evermore. 27Mytabernaclealso shall be with them: yea, I will be theirGod, and they shall be my people. 28And theheathenshallknowthat I theLorddosanctifyIsrael, when my sanctuary shall be in the midst of them for evermore."
    },
    {
      "reference": "Ezekiel 47",
      "title": "Ezekiel 47",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezek/47?lang=eng",
      "summary": "Waters issue from the house of the Lord and heal the Dead SeaâThe Lord shows the borders of the land.",
      "verses": [
        "1Afterward he brought me again unto thedoorof the house; and, behold,watersissued out from under the threshold of the house eastward: for the forefront of the housestood towardthe east, and the waters came down from under from the right side of thehouse, at the southsideof the altar.",
        "2Then brought he me out of the way of the gate northward, and led me about the way without unto the uttergateby the way that looketh eastward; and, behold, there ran out waters on the right side.",
        "3And when the man that had thelinein his hand went forth eastward, he measured a thousand cubits, and he brought me through the waters; the waterswereto the ankles.",
        "4Again he measured a thousand, and brought me through the waters; the waterswereto the knees. Again he measured a thousand, and brought me through; the waterswereto the loins.",
        "5Afterward he measured a thousand;and it wasa river that I could not pass over: for the waters were risen, waters to swim in, a river that could not be passed over.",
        "6Â¶And he said unto me, Son of man, hast thou seenthis?Then he brought me, and caused me to return to the brink of the river.",
        "7Now when I had returned, behold, at the bank of the riverwerevery many trees on the one side and on the other.",
        "8Then said he unto me, These waters issue out toward the east country, and go down into the desert, and go into thesea:which beingbrought forth into the sea, thewatersshall be healed.",
        "9And it shall come to pass,thatevery thing that liveth, which moveth, whithersoever the rivers shall come, shall live: and there shall be a very great multitude of fish, because these waters shall come thither: for they shall be healed; and every thing shall live whither the river cometh.",
        "10And it shall come to pass,thatthe fishers shall standupon itfrom En-gedi even unto En-eglaim; theyshall be aplaceto spread forth nets; their fish shall be according to their kinds, as the fish of the great sea, exceeding many.",
        "11But the miry places thereof and the marshes thereof shall not be healed; they shall be given to salt.",
        "12And by the river upon the bank thereof, on this side and on that side, shall grow all trees for meat, whose leaf shall not fade, neither shall the fruit thereof be consumed: it shall bring forth new fruit according to his months, because their waters they issued out of the sanctuary: and the fruit thereof shall be for meat, and theleafthereof formedicine.",
        "13Â¶Thus saith the LordGod; Thisshall bethe border, whereby ye shall inherit the land according to the twelvetribesof Israel:Josephshall have twoportions.",
        "14And ye shall inherit it, one as well as another:concerningthe which Ilifted up mine handto give it unto your fathers: and this land shall fall unto you forinheritance.",
        "15And thisshall bethe border of the land toward the north side, from the great sea, the way of Hethlon, as men go to Zedad;",
        "16Hamath, Berothah, Sibraim, whichisbetween the border of Damascus and the border of Hamath; Hazar-hatticon, whichisby thecoastof Hauran.",
        "17And the border from the sea shall be Hazar-enan, the border of Damascus, and the north northward, and the border of Hamath. Andthis isthe north side.",
        "18And the east side ye shall measure from Hauran, and from Damascus, and from Gilead, and from the land of IsraelbyJordan, from the border unto theeastsea. Andthis isthe east side.",
        "19And the south side southward, from Tamarevento the waters ofstrifeinKadesh, the river to the great sea. Andthis isthe south side southward.",
        "20The west side alsoshall bethe great sea from the border, till a man come over against Hamath. Thisisthe west side.",
        "21So shall ye divide this land unto you according to the tribes of Israel.",
        "22Â¶And it shall come to pass,thatye shalldivideit by lot for an inheritance unto you, and to the strangers that sojourn among you, which shall beget children among you: and they shall be unto you asbornin the country among the children of Israel; they shall have inheritance with you among the tribes of Israel.",
        "23And it shall come to pass,thatin what tribe the stranger sojourneth, there shall ye givehimhis inheritance, saith the LordGod."
      ],
      "full_text": "1Afterward he brought me again unto thedoorof the house; and, behold,watersissued out from under the threshold of the house eastward: for the forefront of the housestood towardthe east, and the waters came down from under from the right side of thehouse, at the southsideof the altar. 2Then brought he me out of the way of the gate northward, and led me about the way without unto the uttergateby the way that looketh eastward; and, behold, there ran out waters on the right side. 3And when the man that had thelinein his hand went forth eastward, he measured a thousand cubits, and he brought me through the waters; the waterswereto the ankles. 4Again he measured a thousand, and brought me through the waters; the waterswereto the knees. Again he measured a thousand, and brought me through; the waterswereto the loins. 5Afterward he measured a thousand;and it wasa river that I could not pass over: for the waters were risen, waters to swim in, a river that could not be passed over. 6Â¶And he said unto me, Son of man, hast thou seenthis?Then he brought me, and caused me to return to the brink of the river. 7Now when I had returned, behold, at the bank of the riverwerevery many trees on the one side and on the other. 8Then said he unto me, These waters issue out toward the east country, and go down into the desert, and go into thesea:which beingbrought forth into the sea, thewatersshall be healed. 9And it shall come to pass,thatevery thing that liveth, which moveth, whithersoever the rivers shall come, shall live: and there shall be a very great multitude of fish, because these waters shall come thither: for they shall be healed; and every thing shall live whither the river cometh. 10And it shall come to pass,thatthe fishers shall standupon itfrom En-gedi even unto En-eglaim; theyshall be aplaceto spread forth nets; their fish shall be according to their kinds, as the fish of the great sea, exceeding many. 11But the miry places thereof and the marshes thereof shall not be healed; they shall be given to salt. 12And by the river upon the bank thereof, on this side and on that side, shall grow all trees for meat, whose leaf shall not fade, neither shall the fruit thereof be consumed: it shall bring forth new fruit according to his months, because their waters they issued out of the sanctuary: and the fruit thereof shall be for meat, and theleafthereof formedicine. 13Â¶Thus saith the LordGod; Thisshall bethe border, whereby ye shall inherit the land according to the twelvetribesof Israel:Josephshall have twoportions. 14And ye shall inherit it, one as well as another:concerningthe which Ilifted up mine handto give it unto your fathers: and this land shall fall unto you forinheritance. 15And thisshall bethe border of the land toward the north side, from the great sea, the way of Hethlon, as men go to Zedad; 16Hamath, Berothah, Sibraim, whichisbetween the border of Damascus and the border of Hamath; Hazar-hatticon, whichisby thecoastof Hauran. 17And the border from the sea shall be Hazar-enan, the border of Damascus, and the north northward, and the border of Hamath. Andthis isthe north side. 18And the east side ye shall measure from Hauran, and from Damascus, and from Gilead, and from the land of IsraelbyJordan, from the border unto theeastsea. Andthis isthe east side. 19And the south side southward, from Tamarevento the waters ofstrifeinKadesh, the river to the great sea. Andthis isthe south side southward. 20The west side alsoshall bethe great sea from the border, till a man come over against Hamath. Thisisthe west side. 21So shall ye divide this land unto you according to the tribes of Israel. 22Â¶And it shall come to pass,thatye shalldivideit by lot for an inheritance unto you, and to the strangers that sojourn among you, which shall beget children among you: and they shall be unto you asbornin the country among the children of Israel; they shall have inheritance with you among the tribes of Israel. 23And it shall come to pass,thatin what tribe the stranger sojourneth, there shall ye givehimhis inheritance, saith the LordGod."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:32:55",
  "metadata": {
    "week_number": 45,
    "title": "Week 45: November 2–8 - Ezekiel 1–3; 33–34; 36–37; 47",
    "date_range": "November 2–8",
    "scraped_at": "2025-12-21T22:33:03.861164",
    "scraper_version": "2.0.0"
  }
}