{
  "week_number": 19,
  "date_range": "May 4–10",
  "title": "Week 19: May 4–10 - Numbers 11–14; 20–24; 27",
  "bundle_title": "Week 19: May 4–10: \"Week 19: May 4–10 - Numbers 11–14; 20–24; 27\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/19?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/19?lang=eng",
    "title": "Numbers 11–14;20–24;27",
    "scripture_references": "Numbers 11–14; 20–24; 27",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“May 4–10. ‘Rebel Not Ye against the Lord, Neither Fear: Numbers 11–14; 20–24; 27,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“May 4–10. ‘Rebel Not Ye against the Lord, Neither Fear,’”Come, Follow Me: Old Testament 2026\n\nMay 4–10: “Rebel Not Ye against the Lord, Neither Fear”\n\nEven on foot, it wouldn’t take 40 years to travel from the wilderness of Sinai to the promised land in Canaan. But that’s how long the children of Israel needed—not to cover the geographical distance but to cover the spiritual distance: the distance between who they were and who they could become as God’s covenant people.\n\nThe book of Numbers describes some of what happened during those 40 years, including lessons the children of Israel needed to learn before entering the promised land. They learned about being faithful to the Lord’s servants (seeNumbers 12). They learned about trusting the Lord’s power, even when the future seems hopeless (seeNumbers 13–14). And they learned that being faithless brings spiritual harm, but they could repent and look to the Savior for healing (seeNumbers 21:4–9).\n\nWe’re all like the Israelites in some ways. We know what it’s like to be in a spiritual wilderness, and the lessons they learned can help us prepare to enter our promised land: eternal life with our Heavenly Father.\n\nFor an overview of the book of Numbers, see “Numbers” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "Revelation is available to everyone, but God guides His Church through His prophet.",
        "content": "InNumbers 11:11–17, 24–29, notice the problem Moses faced and the solution God proposed. What do you think Moses meant when he said he wished “that all the Lord’s people were prophets”? (verse 29). As you ponder this question, look for possible answers in President Russell M. Nelson’s message “Revelation for the Church, Revelation for Our Lives” (EnsignorLiahona, May 2018, 93–96).\n\nSaying we can all receive revelation, however, doesn’t mean we all can lead God’s people the way Moses did. The event inNumbers 12makes this clear. What cautions do you find in this chapter? What do you feel the Lord wants you to understand about personal revelation and following His prophet?\n\nSee also1 Nephi 10:17;Doctrine and Covenants 28:1–7; Dallin H. Oaks, “Two Lines of Communication,”EnsignorLiahona, Nov. 2010, 83–86.\n\nFocus on what’s most important.Some people get overwhelmed with the weekly reading suggestions inCome, Follow Me. As you review the outlines, follow the Spirit. Consider your own needs and the needs of the people you may be teaching. Understanding and fully applyingoneprinciple in a week could be more helpful than reading several chapters only superficially.\n\nNumbers 12:3"
      },
      {
        "title": "“Moses was very meek.”",
        "content": "Some people are surprised to learn that Moses, the mighty leader who stood before Pharaoh and performed stunning miracles with the Lord’s power, was also “very meek” (Numbers 12:3). What does it mean to be meek? Consider studying Elder David A. Bednar’s explanation in “Meek and Lowly of Heart” (EnsignorLiahona, May 2018, 30–33) or “Meek, Meekness” in Guide to the Scriptures (Gospel Library).\n\nWhat do you learn from Moses’s examples of meekness inExodus 18:13–25;Numbers 11:26–29;Numbers 12;Hebrews 11:24–27; andMoses 1:10–11? You might also ponder how the Savior showed meekness (seeMatthew 11:29;27:11–14;Luke 22:41–42;John 13:4–5). What do these examples teach you?\n\nNumbers 13–14"
      },
      {
        "title": "With faith in the Lord, I can have hope for the future.",
        "content": "As you readNumbers 13–14, try to put yourself in the place of the Israelites. Why do you think they wanted to “return into Egypt”? (Numbers 14:3). How would you describe the other “spirit” Caleb had? (Numbers 14:24). What impresses you about the faith of Caleb and Joshua, and how might you apply their examples to situations you face?\n\nTen of the Israelite spies were afraid; Joshua and Caleb had faith.Joshua and Caleb: Obedient Spies, by Douglas Klauba. © Lifeway Collection/licensed fromgoodsalt.com\n\nNumbers 21:4–9"
      },
      {
        "title": "If I look to Jesus Christ in faith, He can heal me spiritually.",
        "content": "Book of Mormon prophets knew the story found inNumbers 21:4–9and understood its spiritual significance. Read their teachings about this story in1 Nephi 17:40–41;Alma 33:18–22; andHelaman 8:13–15. Here are some questions to ponder as you do:\n\nWhat could the brass serpent represent?\n\nWhat might the snakebites represent?\n\nThe Israelites had to “[behold] the serpent of brass” (Numbers 21:9) to be healed. Why do you think some people refused to look? Does something similar ever happen to you?\n\nWhat do you feel inspired to do to more fully “look upon the Son of God with faith” and be healed? (Helaman 8:15). You may find some ideas in President D. Todd Christofferson’s message “Look to God and Live” (Liahona, Nov. 2025, 86–90)\n\nReading these passages might remind you of other times in the scriptures when people needed to keep their focus on Christ. For example, compare the message ofNumbers 21:4–9withMatthew 14:25–31and1 Nephi 8:24–28(see also the pictures at the end of this week’s outline). What tends to draw us away from Christ? How does He bless people who stay focused on Him?\n\nSee also “Jesus, the Very Thought of Thee” (Hymns, no. 141).\n\nNumbers 22–24"
      },
      {
        "title": "I can follow God’s will, even if others try to persuade me not to.",
        "content": "When Balak, the king of Moab, learned that the Israelites were approaching, he called for Balaam, a man known for pronouncing blessings and curses. Balak wanted him to curse the Israelites. Notice how Balak tried to persuade Balaam (seeNumbers 22:5–7, 15–17), and think about temptations you might face to go against God’s will. What impresses you about Balaam’s responses inNumbers 22:18, 38;23:8, 12, 26;24:13? Sadly, Balaam eventually gave in to pressure and betrayed Israel (seeNumbers 31:16;Jude 1:11). Ponder how you can remain faithful to the Lord despite pressure from others."
      }
    ],
    "teaching_children": [
      {
        "title": "I can be thankful for what God has given me.",
        "content": "Ask your children if they remember some of the miracles the Lord performed to help the Israelites (see “The Plagues of Egypt” and “The Passover” inOld Testament Stories, 67–74). Then you could summarize for themNumbers 11:4–10, emphasizing that the Israelites had forgotten their blessings and were complaining. What blessings do we sometimes forget?\n\nAs you sing or listen to a song about gratitude, such as “Count Your Blessings” (Hymns, no. 241), your children could draw pictures of blessings the Lord has given them.\n\nNumbers 12"
      },
      {
        "title": "The Lord wants me to follow His prophet.",
        "content": "To introduceNumbers 12, you could tell your children that the Lord was unhappy with Aaron and Miriam, Moses’s brother and sister. Invite them to readNumbers 12:1–8to find out why. Consider using theGospel Art Bookto help your children find examples of people in the scriptures who respected the Lord’s prophet and were blessed. How are we blessed when we follow the Lord’s prophet?\n\nNumbers 21:6–9"
      },
      {
        "title": "I can look to Jesus Christ.",
        "content": "You could use “Moses and the Brass Serpent” inOld Testament Stories, 83–84, to help your children learn what happened inNumbers 21:6–9. How is the brass serpent like Jesus Christ? (seeJohn 3:14–15). Your children might enjoy making a serpent out of paper and writing on it some simple things they can do to “look upon the Son of God with faith” (Helaman 8:15).\n\nMoses and the Brass Serpent\n\nOlder children could choose one of the following scriptures and share what it adds to their understanding of the story:1 Nephi 17:41;Alma 33:18–20;Helaman 8:13–15;Doctrine and Covenants 6:36.\n\nBronze Serpent, by Brent Evans\n\nNumbers 22–24"
      },
      {
        "title": "I can follow God’s will, even if others try to persuade me not to.",
        "content": "SummarizeNumbers 22:1–18for your children, emphasizing how Balaam refused to curse God’s people, even though Balak, the king of Moab, offered him honor and riches. Then you could help your children search the following verses for phrases that they feel show that Balaam wanted to follow God:Numbers 22:18;23:26;24:13. Perhaps your children could pick one phrase they like and write it on a card to help them remember to obey the Lord.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nTop left:The Crucifixion of Christ. Top right:Moses and the Brass Serpent, by Judith Mehr. Bottom left:Finisher of Faith, by Kelsy and Jesse Lightweave. Bottom right:Lehi’s Dream, by Jerry Thompson"
      }
    ],
    "study_helps": [],
    "raw_text": "May 4–10. “Rebel Not Ye against the Lord, Neither Fear”: Numbers 11–14; 20–24; 27\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nThoughts to Keep in Mind\nThe Tabernacle and Sacrifice\nApril 27–May 3\nExodus 35–40; Leviticus 1; 4; 16; 19\nMay 4–10\nNumbers 11–14; 20–24; 27\nMay 11–17\nDeuteronomy 6–8; 15; 18; 29–30; 34\nThoughts to Keep in Mind\nThe Historical Books in the Old Testament\nMay 18–24\nJoshua 1–8; 23–24\nMay 25–31\nJudges 2–4; 6–8; 13–16\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nMay 4–10. “Rebel Not Ye against the Lord, Neither Fear”: Numbers 11–14; 20–24; 27\n“May 4–10. ‘Rebel Not Ye against the Lord, Neither Fear: Numbers 11–14; 20–24; 27,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“May 4–10. ‘Rebel Not Ye against the Lord, Neither Fear,’”\nCome, Follow Me: Old Testament 2026\nDesert near the Sinai Peninsula\nMay 4–10: “Rebel Not Ye against the Lord, Neither Fear”\nNumbers 11–14\n;\n20–24\n;\n27\nEven on foot, it wouldn’t take 40 years to travel from the wilderness of Sinai to the promised land in Canaan. But that’s how long the children of Israel needed—not to cover the geographical distance but to cover the spiritual distance: the distance between who they were and who they could become as God’s covenant people.\nThe book of Numbers describes some of what happened during those 40 years, including lessons the children of Israel needed to learn before entering the promised land. They learned about being faithful to the Lord’s servants (see\nNumbers 12\n). They learned about trusting the Lord’s power, even when the future seems hopeless (see\nNumbers 13–14\n). And they learned that being faithless brings spiritual harm, but they could repent and look to the Savior for healing (see\nNumbers 21:4–9\n).\nWe’re all like the Israelites in some ways. We know what it’s like to be in a spiritual wilderness, and the lessons they learned can help us prepare to enter our promised land: eternal life with our Heavenly Father.\nFor an overview of the book of Numbers, see “\nNumbers\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nNumbers 11:11–17, 24–29\n;\n12\nRevelation is available to everyone, but God guides His Church through His prophet.\nIn\nNumbers 11:11–17, 24–29\n, notice the problem Moses faced and the solution God proposed. What do you think Moses meant when he said he wished “that all the Lord’s people were prophets”? (\nverse 29\n). As you ponder this question, look for possible answers in President Russell M. Nelson’s message “\nRevelation for the Church, Revelation for Our Lives\n” (\nEnsign\nor\nLiahona\n, May 2018, 93–96).\nSaying we can all receive revelation, however, doesn’t mean we all can lead God’s people the way Moses did. The event in\nNumbers 12\nmakes this clear. What cautions do you find in this chapter? What do you feel the Lord wants you to understand about personal revelation and following His prophet?\nSee also\n1 Nephi 10:17\n;\nDoctrine and Covenants 28:1–7\n; Dallin H. Oaks, “\nTwo Lines of Communication\n,”\nEnsign\nor\nLiahona\n, Nov. 2010, 83–86.\nFocus on what’s most important.\nSome people get overwhelmed with the weekly reading suggestions in\nCome, Follow Me\n. As you review the outlines, follow the Spirit. Consider your own needs and the needs of the people you may be teaching. Understanding and fully applying\none\nprinciple in a week could be more helpful than reading several chapters only superficially.\nNumbers 12:3\n“Moses was very meek.”\nSome people are surprised to learn that Moses, the mighty leader who stood before Pharaoh and performed stunning miracles with the Lord’s power, was also “very meek” (\nNumbers 12:3\n). What does it mean to be meek? Consider studying Elder David A. Bednar’s explanation in “\nMeek and Lowly of Heart\n” (\nEnsign\nor\nLiahona\n, May 2018, 30–33) or “\nMeek, Meekness\n” in Guide to the Scriptures (Gospel Library).\nWhat do you learn from Moses’s examples of meekness in\nExodus 18:13–25\n;\nNumbers 11:26–29\n;\nNumbers 12\n;\nHebrews 11:24–27\n; and\nMoses 1:10–11\n? You might also ponder how the Savior showed meekness (see\nMatthew 11:29\n;\n27:11–14\n;\nLuke 22:41–42\n;\nJohn 13:4–5\n). What do these examples teach you?\nNumbers 13–14\nWith faith in the Lord, I can have hope for the future.\nAs you read\nNumbers 13–14\n, try to put yourself in the place of the Israelites. Why do you think they wanted to “return into Egypt”? (\nNumbers 14:3\n). How would you describe the other “spirit” Caleb had? (\nNumbers 14:24\n). What impresses you about the faith of Caleb and Joshua, and how might you apply their examples to situations you face?\nTen of the Israelite spies were afraid; Joshua and Caleb had faith.\nJoshua and Caleb: Obedient Spies\n, by Douglas Klauba. © Lifeway Collection/licensed from\ngoodsalt.com\nNumbers 21:4–9\nIf I look to Jesus Christ in faith, He can heal me spiritually.\nBook of Mormon prophets knew the story found in\nNumbers 21:4–9\nand understood its spiritual significance. Read their teachings about this story in\n1 Nephi 17:40–41\n;\nAlma 33:18–22\n; and\nHelaman 8:13–15\n. Here are some questions to ponder as you do:\nWhat could the brass serpent represent?\nWhat might the snakebites represent?\nThe Israelites had to “[behold] the serpent of brass” (\nNumbers 21:9\n) to be healed. Why do you think some people refused to look? Does something similar ever happen to you?\nWhat do you feel inspired to do to more fully “look upon the Son of God with faith” and be healed? (\nHelaman 8:15\n). You may find some ideas in President D. Todd Christofferson’s message “\nLook to God and Live\n” (\nLiahona\n, Nov. 2025, 86–90)\nReading these passages might remind you of other times in the scriptures when people needed to keep their focus on Christ. For example, compare the message of\nNumbers 21:4–9\nwith\nMatthew 14:25–31\nand\n1 Nephi 8:24–28\n(see also the pictures at the end of this week’s outline). What tends to draw us away from Christ? How does He bless people who stay focused on Him?\nSee also “\nJesus, the Very Thought of Thee\n” (\nHymns\n, no. 141).\nNumbers 22–24\nI can follow God’s will, even if others try to persuade me not to.\nWhen Balak, the king of Moab, learned that the Israelites were approaching, he called for Balaam, a man known for pronouncing blessings and curses. Balak wanted him to curse the Israelites. Notice how Balak tried to persuade Balaam (see\nNumbers 22:5–7, 15–17\n), and think about temptations you might face to go against God’s will. What impresses you about Balaam’s responses in\nNumbers 22:18, 38\n;\n23:8, 12, 26\n;\n24:13\n? Sadly, Balaam eventually gave in to pressure and betrayed Israel (see\nNumbers 31:16\n;\nJude 1:11\n). Ponder how you can remain faithful to the Lord despite pressure from others.\nStudy Helps\nWhat was significant about Oshea being called Joshua?\nWho was Balaam?\nClick to see more.\nIdeas for Teaching Children\nNumbers 11:4–10\nI can be thankful for what God has given me.\nAsk your children if they remember some of the miracles the Lord performed to help the Israelites (see “\nThe Plagues of Egypt\n” and “\nThe Passover\n” in\nOld Testament Stories\n, 67–74). Then you could summarize for them\nNumbers 11:4–10\n, emphasizing that the Israelites had forgotten their blessings and were complaining. What blessings do we sometimes forget?\nAs you sing or listen to a song about gratitude, such as “\nCount Your Blessings\n” (\nHymns\n, no. 241), your children could draw pictures of blessings the Lord has given them.\nNumbers 12\nThe Lord wants me to follow His prophet.\nTo introduce\nNumbers 12\n, you could tell your children that the Lord was unhappy with Aaron and Miriam, Moses’s brother and sister. Invite them to read\nNumbers 12:1–8\nto find out why. Consider using the\nGospel Art Book\nto help your children find examples of people in the scriptures who respected the Lord’s prophet and were blessed. How are we blessed when we follow the Lord’s prophet?\nNumbers 21:6–9\nI can look to Jesus Christ.\nYou could use “\nMoses and the Brass Serpent\n” in\nOld Testament Stories\n, 83–84, to help your children learn what happened in\nNumbers 21:6–9\n. How is the brass serpent like Jesus Christ? (see\nJohn 3:14–15\n). Your children might enjoy making a serpent out of paper and writing on it some simple things they can do to “look upon the Son of God with faith” (\nHelaman 8:15\n).\n1:2\nMoses and the Brass Serpent\nOlder children could choose one of the following scriptures and share what it adds to their understanding of the story:\n1 Nephi 17:41\n;\nAlma 33:18–20\n;\nHelaman 8:13–15\n;\nDoctrine and Covenants 6:36\n.\nBronze Serpent\n, by Brent Evans\nNumbers 22–24\nI can follow God’s will, even if others try to persuade me not to.\nSummarize\nNumbers 22:1–18\nfor your children, emphasizing how Balaam refused to curse God’s people, even though Balak, the king of Moab, offered him honor and riches. Then you could help your children search the following verses for phrases that they feel show that Balaam wanted to follow God:\nNumbers 22:18\n;\n23:26\n;\n24:13\n. Perhaps your children could pick one phrase they like and write it on a card to help them remember to obey the Lord.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nTop left:\nThe Crucifixion of Christ\n. Top right:\nMoses and the Brass Serpent\n, by Judith Mehr. Bottom left:\nFinisher of Faith\n, by Kelsy and Jesse Lightweave. Bottom right:\nLehi’s Dream\n, by Jerry Thompson\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Numbers 11",
      "title": "Numbers 11",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/11?lang=eng",
      "summary": "Fire from the Lord consumes the rebels in IsraelâIsrael murmurs and lusts for meat instead of mannaâMoses complains that he cannot bear the burden aloneâHe is commanded to choose seventy elders to assist himâThe Lord promises meat until it becomes loathsome to the IsraelitesâThe seventy elders are chosen, they prophesy, the Lord comes down, and Eldad and Medad prophesy in the campâIsrael is provided with quailâThe people lust, a great plague follows, and many die.",
      "verses": [
        "1Andwhenthe peoplecomplained, it displeased theLord: and theLordheardit;and his anger was kindled; and thefireof theLordburnt among them, and consumedthem that werein the uttermost parts of the camp.",
        "2And the people cried unto Moses; and when Moses prayed unto theLord, the fire was quenched.",
        "3And he called the name of the place Taberah: because the fire of theLordburnt among them.",
        "4Â¶And the mixed multitude thatwasamong them fell alusting: and the children of Israel also wept again, and said, Who shall give us flesh to eat?",
        "5We remember the fish, which we did eat in Egypt freely; the cucumbers, and the melons, and the leeks, and the onions, and the garlick:",
        "6But now our soulisdried away:there isnothing at all, beside this manna,beforeour eyes.",
        "7And themannawasascorianderseed, and the colour thereof as the colour of bdellium.",
        "8Andthe people went about, and gatheredit,and grounditin mills, or beatitin a mortar, and bakeditin pans, and made cakes of it: and the taste of it was as the taste of fresh oil.",
        "9And when the dew fell upon the camp in the night, the manna fellupon it.",
        "10Â¶Then Moses heard the people weep throughout their families, every man in the door of his tent: and the anger of theLordwas kindled greatly; Moses also was displeased.",
        "11And Moses said unto theLord, Wherefore hast thou afflicted thy servant? and wherefore have I not found favour in thy sight, that thou layest the burden of all this people upon me?",
        "12Have I conceived all this people? have I begotten them, that thou shouldest say unto me, Carry them in thy bosom, as a nursing father beareth the sucking child, unto the land which thou swarest unto their fathers?",
        "13Whence should I have flesh to give unto all this people? for they weep unto me, saying, Give us flesh, that we may eat.",
        "14I am not able to bear all this people alone, becauseit istooheavyfor me.",
        "15And if thou deal thus with me, kill me, I pray thee,out of hand, if I have found favour in thy sight; and let me not see my wretchedness.",
        "16Â¶And theLordsaid unto Moses, Gather unto meseventymen of the elders of Israel, whom thou knowest to be the elders of the people, andofficersover them; and bring them unto thetabernacle of the congregation, that they may stand there with thee.",
        "17And I will come down and talk with thee there: and I will take of the spirit whichisupon thee, and will putitupon them; and they shallbearthe burden of the people with thee, that thou bearitnot thyself alone.",
        "18And say thou unto the people, Sanctify yourselves against to morrow, and ye shall eat flesh: for ye have wept in the ears of theLord, saying, Who shall give us flesh to eat? forit waswell with us in Egypt: therefore theLordwill give you flesh, and ye shall eat.",
        "19Ye shall not eat one day, nor two days, nor five days, neither ten days, nor twenty days;",
        "20Buteven a whole month, until it come out at your nostrils, and it be loathsome unto you: because that ye have despised theLordwhichisamong you, and have wept before him, saying, Why came we forth out of Egypt?",
        "21And Moses said, The people, among whom Iam, aresix hundred thousand footmen; and thou hast said, I will give them flesh, that they may eat a whole month.",
        "22Shall the flocks and the herds be slain for them, to suffice them? or shall all the fish of the sea be gathered together for them, to suffice them?",
        "23And theLordsaid unto Moses, Is theLordâs hand waxed short? thou shalt see now whether my word shall come to pass unto thee or not.",
        "24Â¶And Moses went out, and told the people the words of theLord, and gathered theseventymen of the elders of the people, and set them round about the tabernacle.",
        "25And theLordcame down in acloud, and spake unto him, and took of the spirit thatwasupon him, and gaveitunto the seventyelders: and it came to pass,that,when the spirit rested upon them, theyprophesied, and did not cease.",
        "26But there remained twoof themen in the camp, the name of the onewasEldad, and the name of the other Medad: and the spiritrested upon them; and theywereof them that were written, but went not out unto the tabernacle: and they prophesied in the camp.",
        "27And there ran a young man, and told Moses, and said, Eldad and Medad do prophesy in the camp.",
        "28AndJoshuathe son ofNun, the servant of Moses,oneof his young men, answered and said, My lord Moses, forbid them.",
        "29And Moses said unto him, Enviest thou for my sake? would God that all theLordâs people wereprophets,andthat theLordwould put his spirit upon them!",
        "30And Moses gat him into the camp, he and the elders of Israel.",
        "31Â¶And there went forth a wind from theLord, and broughtquailsfrom the sea, and letthemfall by the camp, as it were a dayâs journey on this side, and as it were a dayâs journey on the other side, round about the camp, and as it were two cubitshighupon the face of the earth.",
        "32And the people stood up all that day, and allthatnight, and all the next day, and they gathered the quails: he that gathered least gathered ten homers: and they spreadthemall abroad for themselves round about the camp.",
        "33And while the fleshwasyet between their teeth, ere it was chewed, the wrath of theLordwas kindled against the people, and theLordsmote the people with a very greatplague.",
        "34And he called the name of that placeKibroth-hattaavah: because there they buried the people thatlusted.",
        "35Andthe people journeyed from Kibroth-hattaavah unto Hazeroth; and abode at Hazeroth."
      ],
      "full_text": "1Andwhenthe peoplecomplained, it displeased theLord: and theLordheardit;and his anger was kindled; and thefireof theLordburnt among them, and consumedthem that werein the uttermost parts of the camp. 2And the people cried unto Moses; and when Moses prayed unto theLord, the fire was quenched. 3And he called the name of the place Taberah: because the fire of theLordburnt among them. 4Â¶And the mixed multitude thatwasamong them fell alusting: and the children of Israel also wept again, and said, Who shall give us flesh to eat? 5We remember the fish, which we did eat in Egypt freely; the cucumbers, and the melons, and the leeks, and the onions, and the garlick: 6But now our soulisdried away:there isnothing at all, beside this manna,beforeour eyes. 7And themannawasascorianderseed, and the colour thereof as the colour of bdellium. 8Andthe people went about, and gatheredit,and grounditin mills, or beatitin a mortar, and bakeditin pans, and made cakes of it: and the taste of it was as the taste of fresh oil. 9And when the dew fell upon the camp in the night, the manna fellupon it. 10Â¶Then Moses heard the people weep throughout their families, every man in the door of his tent: and the anger of theLordwas kindled greatly; Moses also was displeased. 11And Moses said unto theLord, Wherefore hast thou afflicted thy servant? and wherefore have I not found favour in thy sight, that thou layest the burden of all this people upon me? 12Have I conceived all this people? have I begotten them, that thou shouldest say unto me, Carry them in thy bosom, as a nursing father beareth the sucking child, unto the land which thou swarest unto their fathers? 13Whence should I have flesh to give unto all this people? for they weep unto me, saying, Give us flesh, that we may eat. 14I am not able to bear all this people alone, becauseit istooheavyfor me. 15And if thou deal thus with me, kill me, I pray thee,out of hand, if I have found favour in thy sight; and let me not see my wretchedness. 16Â¶And theLordsaid unto Moses, Gather unto meseventymen of the elders of Israel, whom thou knowest to be the elders of the people, andofficersover them; and bring them unto thetabernacle of the congregation, that they may stand there with thee. 17And I will come down and talk with thee there: and I will take of the spirit whichisupon thee, and will putitupon them; and they shallbearthe burden of the people with thee, that thou bearitnot thyself alone. 18And say thou unto the people, Sanctify yourselves against to morrow, and ye shall eat flesh: for ye have wept in the ears of theLord, saying, Who shall give us flesh to eat? forit waswell with us in Egypt: therefore theLordwill give you flesh, and ye shall eat. 19Ye shall not eat one day, nor two days, nor five days, neither ten days, nor twenty days; 20Buteven a whole month, until it come out at your nostrils, and it be loathsome unto you: because that ye have despised theLordwhichisamong you, and have wept before him, saying, Why came we forth out of Egypt? 21And Moses said, The people, among whom Iam, aresix hundred thousand footmen; and thou hast said, I will give them flesh, that they may eat a whole month. 22Shall the flocks and the herds be slain for them, to suffice them? or shall all the fish of the sea be gathered together for them, to suffice them? 23And theLordsaid unto Moses, Is theLordâs hand waxed short? thou shalt see now whether my word shall come to pass unto thee or not. 24Â¶And Moses went out, and told the people the words of theLord, and gathered theseventymen of the elders of the people, and set them round about the tabernacle. 25And theLordcame down in acloud, and spake unto him, and took of the spirit thatwasupon him, and gaveitunto the seventyelders: and it came to pass,that,when the spirit rested upon them, theyprophesied, and did not cease. 26But there remained twoof themen in the camp, the name of the onewasEldad, and the name of the other Medad: and the spiritrested upon them; and theywereof them that were written, but went not out unto the tabernacle: and they prophesied in the camp. 27And there ran a young man, and told Moses, and said, Eldad and Medad do prophesy in the camp. 28AndJoshuathe son ofNun, the servant of Moses,oneof his young men, answered and said, My lord Moses, forbid them. 29And Moses said unto him, Enviest thou for my sake? would God that all theLordâs people wereprophets,andthat theLordwould put his spirit upon them! 30And Moses gat him into the camp, he and the elders of Israel. 31Â¶And there went forth a wind from theLord, and broughtquailsfrom the sea, and letthemfall by the camp, as it were a dayâs journey on this side, and as it were a dayâs journey on the other side, round about the camp, and as it were two cubitshighupon the face of the earth. 32And the people stood up all that day, and allthatnight, and all the next day, and they gathered the quails: he that gathered least gathered ten homers: and they spreadthemall abroad for themselves round about the camp. 33And while the fleshwasyet between their teeth, ere it was chewed, the wrath of theLordwas kindled against the people, and theLordsmote the people with a very greatplague. 34And he called the name of that placeKibroth-hattaavah: because there they buried the people thatlusted. 35Andthe people journeyed from Kibroth-hattaavah unto Hazeroth; and abode at Hazeroth."
    },
    {
      "reference": "Numbers 12",
      "title": "Numbers 12",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/12?lang=eng",
      "summary": "Aaron and Miriam complain against Moses, the most meek of all menâThe Lord promises to speak to Moses mouth to mouth and to reveal to him the similitude of the LordâMiriam becomes leprous for a week.",
      "verses": [
        "1And Miriam and Aaron spake against Moses because of theEthiopianwoman whom he had married: for he had married an Ethiopian woman.",
        "2And they said, Hath theLordindeed spoken only by Moses? hath he not spoken also by us? And theLordheardit.",
        "3(Now the man Moseswasverymeek, above all the men whichwereupon the face of the earth.)",
        "4And theLordspake suddenly unto Moses, and unto Aaron, and unto Miriam, Come out ye three unto the tabernacle of the congregation. And they three came out.",
        "5And theLordcame down in thepillarof the cloud, and stoodinthe door of the tabernacle, and called Aaron and Miriam: and they both came forth.",
        "6And he said, Hear now my words: If there be aprophetamong you,ItheLordwill make myself known unto him in avision,andwill speak unto him in adream.",
        "7My servant Mosesisnot so, whoisfaithful in all mine house.",
        "8With him will Ispeakmouthto mouth, even apparently, and not in dark speeches; and the similitude of theLordshall hebehold: wherefore then were ye not afraid to speak against my servant Moses?",
        "9And the anger of theLordwas kindled against them; and he departed.",
        "10And the cloud departed fromoff the tabernacle; and, behold, Miriambecameleprous,whiteas snow: and Aaron looked upon Miriam, and, behold,she wasleprous.",
        "11And Aaron said unto Moses, Alas, my lord, I beseech thee, lay not the sin upon us, wherein we have done foolishly, and wherein we have sinned.",
        "12Let her not be as one dead, of whom the flesh is half consumed when he cometh out of his motherâs womb.",
        "13And Moses cried unto theLord, saying,Healher now, O God, I beseech thee.",
        "14Â¶And theLordsaid unto Moses, If her father had but spit in her face, should she not be ashamed seven days? let her be shut out from the camp seven days, and after that let her be received inagain.",
        "15And Miriam was shut out from the camp seven days: and the people journeyed not till Miriam was brought inagain.",
        "16And afterward the people removed from Hazeroth, and pitched in the wilderness of Paran."
      ],
      "full_text": "1And Miriam and Aaron spake against Moses because of theEthiopianwoman whom he had married: for he had married an Ethiopian woman. 2And they said, Hath theLordindeed spoken only by Moses? hath he not spoken also by us? And theLordheardit. 3(Now the man Moseswasverymeek, above all the men whichwereupon the face of the earth.) 4And theLordspake suddenly unto Moses, and unto Aaron, and unto Miriam, Come out ye three unto the tabernacle of the congregation. And they three came out. 5And theLordcame down in thepillarof the cloud, and stoodinthe door of the tabernacle, and called Aaron and Miriam: and they both came forth. 6And he said, Hear now my words: If there be aprophetamong you,ItheLordwill make myself known unto him in avision,andwill speak unto him in adream. 7My servant Mosesisnot so, whoisfaithful in all mine house. 8With him will Ispeakmouthto mouth, even apparently, and not in dark speeches; and the similitude of theLordshall hebehold: wherefore then were ye not afraid to speak against my servant Moses? 9And the anger of theLordwas kindled against them; and he departed. 10And the cloud departed fromoff the tabernacle; and, behold, Miriambecameleprous,whiteas snow: and Aaron looked upon Miriam, and, behold,she wasleprous. 11And Aaron said unto Moses, Alas, my lord, I beseech thee, lay not the sin upon us, wherein we have done foolishly, and wherein we have sinned. 12Let her not be as one dead, of whom the flesh is half consumed when he cometh out of his motherâs womb. 13And Moses cried unto theLord, saying,Healher now, O God, I beseech thee. 14Â¶And theLordsaid unto Moses, If her father had but spit in her face, should she not be ashamed seven days? let her be shut out from the camp seven days, and after that let her be received inagain. 15And Miriam was shut out from the camp seven days: and the people journeyed not till Miriam was brought inagain. 16And afterward the people removed from Hazeroth, and pitched in the wilderness of Paran."
    },
    {
      "reference": "Numbers 13",
      "title": "Numbers 13",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/13?lang=eng",
      "summary": "Moses sends twelve spies to search the land of CanaanâTen of them bring an evil report, telling only of the strength of the inhabitants.",
      "verses": [
        "1And theLordspake unto Moses, saying,",
        "2Sendthou men, that they maysearchthe land of Canaan, which I give unto the children of Israel: of every tribe of their fathers shall ye send a man, every one a ruler among them.",
        "3And Moses by the commandment of theLordsent them from the wilderness of Paran: all those menwereheads of the children of Israel.",
        "4And theseweretheir names: of the tribe of Reuben, Shammua the son of Zaccur.",
        "5Of the tribe of Simeon, Shaphat the son of Hori.",
        "6Of the tribe of Judah,Calebthe son of Jephunneh.",
        "7Of the tribe of Issachar, Igal the son of Joseph.",
        "8Of the tribe of Ephraim, Oshea the son of Nun.",
        "9Of the tribe of Benjamin, Palti the son of Raphu.",
        "10Of the tribe of Zebulun, Gaddiel the son of Sodi.",
        "11Of the tribe of Joseph,namely,of the tribe of Manasseh, Gaddi the son of Susi.",
        "12Of the tribe of Dan, Ammiel the son of Gemalli.",
        "13Of the tribe of Asher, Sethur the son of Michael.",
        "14Of the tribe of Naphtali, Nahbi the son of Vophsi.",
        "15Of the tribe of Gad, Geuel the son of Machi.",
        "16Thesearethe names of the men which Moses sent to spy out theland. And Moses calledOsheathe son ofNunJehoshua.",
        "17Â¶And Moses sent them to spy out the land of Canaan, and said unto them, Get you upthiswaysouthward, and go up into the mountain:",
        "18And see the land, what itis;and the people that dwelleth therein, whether theybestrong or weak, few or many;",
        "19And what the landisthat they dwell in, whether itbegood or bad; and what citiesthey bethat they dwell in, whether in tents, or in strong holds;",
        "20And what the landis,whether itbefat or lean, whether there be wood therein, or not. And be ye of good courage, and bring of the fruit of the land. Now the timewasthe time of the firstripe grapes.",
        "21Â¶So they went up, and searched the land from the wilderness of Zin unto Rehob,as men come toHamath.",
        "22And theyascended by thesouth, and came untoHebron; where Ahiman, Sheshai, and Talmai, the children of Anak,were.(Now Hebron was built seven years beforeZoanin Egypt.)",
        "23And they came unto thebrookof Eshcol, and cut down from thence a branch with one cluster of grapes, and they bare it between two upon a staff; andthey broughtof the pomegranates, and of the figs.",
        "24The place was called the brook Eshcol, because of the cluster of grapes which the children of Israel cut down from thence.",
        "25And they returned from searching of the land after forty days.",
        "26Â¶And they went and came to Moses, and to Aaron, and to all the congregation of the children of Israel, unto the wilderness of Paran, to Kadesh; and brought back word unto them, and unto all the congregation, and shewed them the fruit of the land.",
        "27And they told him, and said, We came unto the land whither thou sentest us, and surely itflowethwith milk and honey; and thisisthe fruit of it.",
        "28Nevertheless the peoplebestrong that dwell in the land, and the citiesarewalled,andvery great: and moreover we saw the children of Anak there.",
        "29TheAmalekitesdwell in the land of thesouth: and the Hittites, and the Jebusites, and the Amorites, dwell in the mountains: and the Canaanites dwell by the sea, and by the coast of Jordan.",
        "30AndCalebstilled the people before Moses, and said, Let us go up at once, and possess it; for we are well able to overcome it.",
        "31But thementhat went up with him said, We be not able to go up against the people; for theyarestronger than we.",
        "32And they brought up an evil report of the land which they had searched unto the children of Israel, saying, The land, through which we have gone to search it,isa land that eateth up the inhabitants thereof; and all the people that we saw in itaremen of a great stature.",
        "33And there we saw thegiants, the sons of Anak,which comeof thegiants: and we were in our own sight as grasshoppers, and so we were in their sight."
      ],
      "full_text": "1And theLordspake unto Moses, saying, 2Sendthou men, that they maysearchthe land of Canaan, which I give unto the children of Israel: of every tribe of their fathers shall ye send a man, every one a ruler among them. 3And Moses by the commandment of theLordsent them from the wilderness of Paran: all those menwereheads of the children of Israel. 4And theseweretheir names: of the tribe of Reuben, Shammua the son of Zaccur. 5Of the tribe of Simeon, Shaphat the son of Hori. 6Of the tribe of Judah,Calebthe son of Jephunneh. 7Of the tribe of Issachar, Igal the son of Joseph. 8Of the tribe of Ephraim, Oshea the son of Nun. 9Of the tribe of Benjamin, Palti the son of Raphu. 10Of the tribe of Zebulun, Gaddiel the son of Sodi. 11Of the tribe of Joseph,namely,of the tribe of Manasseh, Gaddi the son of Susi. 12Of the tribe of Dan, Ammiel the son of Gemalli. 13Of the tribe of Asher, Sethur the son of Michael. 14Of the tribe of Naphtali, Nahbi the son of Vophsi. 15Of the tribe of Gad, Geuel the son of Machi. 16Thesearethe names of the men which Moses sent to spy out theland. And Moses calledOsheathe son ofNunJehoshua. 17Â¶And Moses sent them to spy out the land of Canaan, and said unto them, Get you upthiswaysouthward, and go up into the mountain: 18And see the land, what itis;and the people that dwelleth therein, whether theybestrong or weak, few or many; 19And what the landisthat they dwell in, whether itbegood or bad; and what citiesthey bethat they dwell in, whether in tents, or in strong holds; 20And what the landis,whether itbefat or lean, whether there be wood therein, or not. And be ye of good courage, and bring of the fruit of the land. Now the timewasthe time of the firstripe grapes. 21Â¶So they went up, and searched the land from the wilderness of Zin unto Rehob,as men come toHamath. 22And theyascended by thesouth, and came untoHebron; where Ahiman, Sheshai, and Talmai, the children of Anak,were.(Now Hebron was built seven years beforeZoanin Egypt.) 23And they came unto thebrookof Eshcol, and cut down from thence a branch with one cluster of grapes, and they bare it between two upon a staff; andthey broughtof the pomegranates, and of the figs. 24The place was called the brook Eshcol, because of the cluster of grapes which the children of Israel cut down from thence. 25And they returned from searching of the land after forty days. 26Â¶And they went and came to Moses, and to Aaron, and to all the congregation of the children of Israel, unto the wilderness of Paran, to Kadesh; and brought back word unto them, and unto all the congregation, and shewed them the fruit of the land. 27And they told him, and said, We came unto the land whither thou sentest us, and surely itflowethwith milk and honey; and thisisthe fruit of it. 28Nevertheless the peoplebestrong that dwell in the land, and the citiesarewalled,andvery great: and moreover we saw the children of Anak there. 29TheAmalekitesdwell in the land of thesouth: and the Hittites, and the Jebusites, and the Amorites, dwell in the mountains: and the Canaanites dwell by the sea, and by the coast of Jordan. 30AndCalebstilled the people before Moses, and said, Let us go up at once, and possess it; for we are well able to overcome it. 31But thementhat went up with him said, We be not able to go up against the people; for theyarestronger than we. 32And they brought up an evil report of the land which they had searched unto the children of Israel, saying, The land, through which we have gone to search it,isa land that eateth up the inhabitants thereof; and all the people that we saw in itaremen of a great stature. 33And there we saw thegiants, the sons of Anak,which comeof thegiants: and we were in our own sight as grasshoppers, and so we were in their sight."
    },
    {
      "reference": "Numbers 14",
      "title": "Numbers 14",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/14?lang=eng",
      "summary": "Israel murmurs and speaks of returning to EgyptâJoshua and Caleb give a good report of CanaanâMoses mediates between Israel and the LordâThe adults of Israel will not enter the promised landâThe Lord slays the false spies by a plagueâSome rebels try to go alone and are slain by the Amalekites and Canaanites.",
      "verses": [
        "1And all the congregation lifted up their voice, and cried; and the people wept that night.",
        "2And all the children of Israelmurmuredagainst Moses and against Aaron: and the whole congregation said unto them, Would God that we had died in the land of Egypt! or would God we had died in this wilderness!",
        "3And wherefore hath theLordbrought us unto this land, to fall by the sword, that our wives and our children should be a prey? were it not better for us to return into Egypt?",
        "4And they said one to another, Let us make a captain, and let usreturninto Egypt.",
        "5Then Moses and Aaron fell on their faces before all the assembly of the congregation of the children of Israel.",
        "6Â¶AndJoshuathe son of Nun,and Caleb the son of Jephunneh,which wereof them that searched the land, rent their clothes:",
        "7And they spake unto all the company of the children of Israel, saying, The land, which we passed through to search it,isan exceeding good land.",
        "8If theLorddelight in us, then he will bring us into this land, and give it us; a land which floweth with milk and honey.",
        "9Onlyrebelnot ye against theLord, neither fear ye the people of the land; for theyarebread for us: their defence is departed from them, and theLordiswith us:fearthem not.",
        "10But all the congregation bade stone them with stones. And thegloryof theLordappeared in the tabernacle of the congregation before all the children of Israel.",
        "11Â¶And theLordsaid unto Moses, How long will this peopleprovokeme? and how long will it be ere theybelieveme, for all the signs which I have shewed among them?",
        "12I will smite them with the pestilence, and disinherit them, and will make of thee a greaternationand mightier than they.",
        "13Â¶And Moses said unto theLord, Then theEgyptiansshall hearit,(for thou broughtest up this people in thy might from among them;)",
        "14And they will tellitto the inhabitants of this land:forthey have heard that thouLordartamongthis people, that thouLordart seen face to face, andthatthycloudstandeth over them, andthatthougoestbefore them, by day time in apillarof acloud, and in a pillar of fire by night.",
        "15Â¶Nowifthou shalt killallthis people as one man, then the nations which have heard the fame of thee will speak, saying,",
        "16Because theLordwas not able to bring this people into the land which he sware unto them, therefore he hath slain them in the wilderness.",
        "17And now, I beseech thee, let the power of my Lord be great, according as thou hast spoken, saying,",
        "18TheLordislongsuffering, and of great mercy,forgivinginiquity and transgression, and by no means clearingthe guilty,visiting the iniquity of the fathers upon the children unto the third and fourthgeneration.",
        "19Pardon, I beseech thee, the iniquity of this people according unto the greatness of thy mercy, and as thou hast forgiven this people, from Egypt even until now.",
        "20And theLordsaid,Ihave pardoned according to thy word:",
        "21ButastrulyasI live, all the earth shall befilledwith the glory of theLord.",
        "22Because all those men which have seen my glory, and mymiracles, which I did in Egypt and in the wilderness, and havetemptedme now these ten times, and have not hearkened to my voice;",
        "23Surely they shall notseethelandwhich I sware unto their fathers, neither shall any of them thatprovokedme see it:",
        "24But my servantCaleb, because he had another spirit with him, and hathfollowedme fully, him will Ibringinto the land whereinto he went; and his seed shall possess it.",
        "25(Now theAmalekitesand the Canaanites dwelt in the valley.) To morrow turn you, and get you intothe wilderness by the way of the Red sea.",
        "26Â¶And theLordspake unto Moses and unto Aaron, saying,",
        "27How longshall I bear withthis evil congregation, whichmurmuragainst me? I have heard the murmurings of the children of Israel, which they murmur against me.",
        "28Say unto them,As truly asI live, saith theLord, as ye have spoken in mine ears, so will I do to you:",
        "29Yourcarcasesshall fall in thiswilderness; and all that were numbered of you, according to your whole number, from twenty years old and upward, which have murmured against me,",
        "30Doubtless ye shall not come into the land,concerningwhich I sware to make you dwell therein, save Caleb the son of Jephunneh, and Joshua the son of Nun.",
        "31But your little ones, which ye said should be a prey, them will I bring in, and they shall know the land which ye have despised.",
        "32Butas foryou, your carcases, they shall fall in this wilderness.",
        "33And your children shall wander in the wildernessfortyyears, andbear your whoredoms, until your carcases be wasted in the wilderness.",
        "34After the number of the days in which ye searched the land,evenforty days, each day for a year, shall ye bear your iniquities,evenforty years, and ye shallknowmy breach of promise.",
        "35I theLordhave said, I will surely do it unto all this evil congregation, that are gathered together against me: in this wilderness they shall be consumed, and there they shalldie.",
        "36And the men, which Moses sent to search the land, who returned, and made all the congregation to murmur against him, by bringing up a slander upon the land,",
        "37Even those men that did bring up the evil report upon the land,diedby theplaguebefore theLord.",
        "38But Joshua the son of Nun, and Caleb the son of Jephunneh,which wereof the men that went to search the land, livedstill.",
        "39And Moses told these sayings unto all the children of Israel: and the peoplemournedgreatly.",
        "40Â¶And they rose up early in the morning, and gat them up into the top of the mountain, saying, Lo, webe here,and will go up unto the place which theLordhath promised: for we havesinned.",
        "41And Moses said, Wherefore now do ye transgress the commandment of theLord? but it shall not prosper.",
        "42Go not up, for theLordisnot among you; that ye be not smitten before your enemies.",
        "43For theAmalekitesand the Canaanitesarethere before you, and ye shall fall by the sword: because ye are turned away from theLord, therefore theLordwill not be with you.",
        "44But theypresumedto go up unto the hill top: nevertheless the ark of the covenant of theLord, and Moses, departed not out of the camp.",
        "45Then the Amalekites came down, and the Canaanites which dwelt in that hill, and smote them, and discomfited them,evenunto Hormah."
      ],
      "full_text": "1And all the congregation lifted up their voice, and cried; and the people wept that night. 2And all the children of Israelmurmuredagainst Moses and against Aaron: and the whole congregation said unto them, Would God that we had died in the land of Egypt! or would God we had died in this wilderness! 3And wherefore hath theLordbrought us unto this land, to fall by the sword, that our wives and our children should be a prey? were it not better for us to return into Egypt? 4And they said one to another, Let us make a captain, and let usreturninto Egypt. 5Then Moses and Aaron fell on their faces before all the assembly of the congregation of the children of Israel. 6Â¶AndJoshuathe son of Nun,and Caleb the son of Jephunneh,which wereof them that searched the land, rent their clothes: 7And they spake unto all the company of the children of Israel, saying, The land, which we passed through to search it,isan exceeding good land. 8If theLorddelight in us, then he will bring us into this land, and give it us; a land which floweth with milk and honey. 9Onlyrebelnot ye against theLord, neither fear ye the people of the land; for theyarebread for us: their defence is departed from them, and theLordiswith us:fearthem not. 10But all the congregation bade stone them with stones. And thegloryof theLordappeared in the tabernacle of the congregation before all the children of Israel. 11Â¶And theLordsaid unto Moses, How long will this peopleprovokeme? and how long will it be ere theybelieveme, for all the signs which I have shewed among them? 12I will smite them with the pestilence, and disinherit them, and will make of thee a greaternationand mightier than they. 13Â¶And Moses said unto theLord, Then theEgyptiansshall hearit,(for thou broughtest up this people in thy might from among them;) 14And they will tellitto the inhabitants of this land:forthey have heard that thouLordartamongthis people, that thouLordart seen face to face, andthatthycloudstandeth over them, andthatthougoestbefore them, by day time in apillarof acloud, and in a pillar of fire by night. 15Â¶Nowifthou shalt killallthis people as one man, then the nations which have heard the fame of thee will speak, saying, 16Because theLordwas not able to bring this people into the land which he sware unto them, therefore he hath slain them in the wilderness. 17And now, I beseech thee, let the power of my Lord be great, according as thou hast spoken, saying, 18TheLordislongsuffering, and of great mercy,forgivinginiquity and transgression, and by no means clearingthe guilty,visiting the iniquity of the fathers upon the children unto the third and fourthgeneration. 19Pardon, I beseech thee, the iniquity of this people according unto the greatness of thy mercy, and as thou hast forgiven this people, from Egypt even until now. 20And theLordsaid,Ihave pardoned according to thy word: 21ButastrulyasI live, all the earth shall befilledwith the glory of theLord. 22Because all those men which have seen my glory, and mymiracles, which I did in Egypt and in the wilderness, and havetemptedme now these ten times, and have not hearkened to my voice; 23Surely they shall notseethelandwhich I sware unto their fathers, neither shall any of them thatprovokedme see it: 24But my servantCaleb, because he had another spirit with him, and hathfollowedme fully, him will Ibringinto the land whereinto he went; and his seed shall possess it. 25(Now theAmalekitesand the Canaanites dwelt in the valley.) To morrow turn you, and get you intothe wilderness by the way of the Red sea. 26Â¶And theLordspake unto Moses and unto Aaron, saying, 27How longshall I bear withthis evil congregation, whichmurmuragainst me? I have heard the murmurings of the children of Israel, which they murmur against me. 28Say unto them,As truly asI live, saith theLord, as ye have spoken in mine ears, so will I do to you: 29Yourcarcasesshall fall in thiswilderness; and all that were numbered of you, according to your whole number, from twenty years old and upward, which have murmured against me, 30Doubtless ye shall not come into the land,concerningwhich I sware to make you dwell therein, save Caleb the son of Jephunneh, and Joshua the son of Nun. 31But your little ones, which ye said should be a prey, them will I bring in, and they shall know the land which ye have despised. 32Butas foryou, your carcases, they shall fall in this wilderness. 33And your children shall wander in the wildernessfortyyears, andbear your whoredoms, until your carcases be wasted in the wilderness. 34After the number of the days in which ye searched the land,evenforty days, each day for a year, shall ye bear your iniquities,evenforty years, and ye shallknowmy breach of promise. 35I theLordhave said, I will surely do it unto all this evil congregation, that are gathered together against me: in this wilderness they shall be consumed, and there they shalldie. 36And the men, which Moses sent to search the land, who returned, and made all the congregation to murmur against him, by bringing up a slander upon the land, 37Even those men that did bring up the evil report upon the land,diedby theplaguebefore theLord. 38But Joshua the son of Nun, and Caleb the son of Jephunneh,which wereof the men that went to search the land, livedstill. 39And Moses told these sayings unto all the children of Israel: and the peoplemournedgreatly. 40Â¶And they rose up early in the morning, and gat them up into the top of the mountain, saying, Lo, webe here,and will go up unto the place which theLordhath promised: for we havesinned. 41And Moses said, Wherefore now do ye transgress the commandment of theLord? but it shall not prosper. 42Go not up, for theLordisnot among you; that ye be not smitten before your enemies. 43For theAmalekitesand the Canaanitesarethere before you, and ye shall fall by the sword: because ye are turned away from theLord, therefore theLordwill not be with you. 44But theypresumedto go up unto the hill top: nevertheless the ark of the covenant of theLord, and Moses, departed not out of the camp. 45Then the Amalekites came down, and the Canaanites which dwelt in that hill, and smote them, and discomfited them,evenunto Hormah."
    },
    {
      "reference": "Numbers 20",
      "title": "Numbers 20",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/20?lang=eng",
      "summary": "Miriam diesâMoses smites a rock at Meribah and brings forth waterâThe king of Edom refuses to let Israel pass peacefully through his landâAaron dies, and Eleazar becomes the high priest.",
      "verses": [
        "1Then came the children of Israel,eventhe whole congregation, into the desert of Zin in the first month: and the people abode inKadesh; and Miriam died there, and was buried there.",
        "2And there was no water for the congregation: and they gathered themselves together against Moses and against Aaron.",
        "3And the peoplechodewith Moses, and spake, saying, Would God that we had died when our brethren died before theLord!",
        "4And why have ye brought up the congregation of theLordinto this wilderness, that we and our cattle should die there?",
        "5And wherefore have ye made us to come up out of Egypt, to bring us in unto this evil place? itisno place of seed, or of figs, or of vines, or of pomegranates; neitheristhere any water to drink.",
        "6And Moses and Aaron went from the presence of the assembly unto the door of thetabernacle of the congregation, and they fell upon their faces: and the glory of theLordappeared unto them.",
        "7Â¶And theLordspake unto Moses, saying,",
        "8Take therod, and gather thou the assembly together, thou, and Aaron thy brother, andspeakye unto the rock before their eyes; and it shall give forth his water, and thou shalt bring forth to them water out of the rock: so thou shalt give the congregation and their beasts drink.",
        "9And Moses took the rod from before theLord, as he commanded him.",
        "10And Moses and Aaron gathered the congregation together before the rock, and he said unto them,Hearnow, ye rebels; mustwefetch you water out of this rock?",
        "11And Moses lifted up his hand, and with his rod hesmotetherocktwice: and thewatercame out abundantly, and the congregation drank, and their beastsalso.",
        "12Â¶And theLordspake unto Moses and Aaron, Because yebelieved me not, tosanctifyme in the eyes of the children of Israel, therefore ye shall notbringthis congregation into thelandwhich I have given them.",
        "13Thisisthe water ofMeribah; because the children of Israelstrovewith theLord, and he was sanctified in them.",
        "14Â¶And Mosessentmessengers from Kadesh unto the king of Edom, Thus saith thy brother Israel, Thou knowest all the travail that hath befallen us:",
        "15How our fathers went down into Egypt, and we have dwelt in Egypt a long time; and the Egyptians vexed us, and our fathers:",
        "16And when we cried unto theLord, he heard our voice, and sent anangel, and hath brought us forth out of Egypt: and, behold, wearein Kadesh, a city in the uttermost of thy border:",
        "17Let us pass, I pray thee, through thy country: we will not pass through the fields, or through the vineyards, neither will we drinkofthe water of the wells: we will go by the kingâshighway, we will not turn to the right hand nor to the left, until we have passed thy borders.",
        "18And Edom said unto him, Thou shalt not passby me, lest I come out against thee with the sword.",
        "19And the children of Israel said unto him, We will go by the high way: and if I and my cattle drink of thy water, then I willpayfor it: I will only, withoutdoingany thingelse,go through on my feet.",
        "20And he said, Thou shalt not go through. And Edom came out against him with much people, and with a strong hand.",
        "21Thus Edom refused to give Israel passage through his border: wherefore Israel turned away from him.",
        "22Â¶And the children of Israel,eventhe whole congregation, journeyed from Kadesh, and came unto mount Hor.",
        "23And theLordspake unto Moses and Aaron in mount Hor, by thecoastof the land of Edom, saying,",
        "24Aaron shall be gathered unto his people: for he shall not enter into the land which I have given unto the children of Israel, because yerebelledagainst my word at the water of Meribah.",
        "25Take Aaron and Eleazar his son, and bring them up unto mount Hor:",
        "26And strip Aaron of his garments, and put them upon Eleazar his son: and Aaron shall be gatheredunto his people,and shall die there.",
        "27And Moses did as theLordcommanded: and they went up into mount Hor in the sight of all the congregation.",
        "28And Moses stripped Aaron of his garments, and put them upon Eleazar his son; andAarondied there in the top of the mount: and Moses and Eleazar came down from the mount.",
        "29And when all the congregation saw that Aaron was dead, they mourned for Aaron thirty days,evenall the house of Israel."
      ],
      "full_text": "1Then came the children of Israel,eventhe whole congregation, into the desert of Zin in the first month: and the people abode inKadesh; and Miriam died there, and was buried there. 2And there was no water for the congregation: and they gathered themselves together against Moses and against Aaron. 3And the peoplechodewith Moses, and spake, saying, Would God that we had died when our brethren died before theLord! 4And why have ye brought up the congregation of theLordinto this wilderness, that we and our cattle should die there? 5And wherefore have ye made us to come up out of Egypt, to bring us in unto this evil place? itisno place of seed, or of figs, or of vines, or of pomegranates; neitheristhere any water to drink. 6And Moses and Aaron went from the presence of the assembly unto the door of thetabernacle of the congregation, and they fell upon their faces: and the glory of theLordappeared unto them. 7Â¶And theLordspake unto Moses, saying, 8Take therod, and gather thou the assembly together, thou, and Aaron thy brother, andspeakye unto the rock before their eyes; and it shall give forth his water, and thou shalt bring forth to them water out of the rock: so thou shalt give the congregation and their beasts drink. 9And Moses took the rod from before theLord, as he commanded him. 10And Moses and Aaron gathered the congregation together before the rock, and he said unto them,Hearnow, ye rebels; mustwefetch you water out of this rock? 11And Moses lifted up his hand, and with his rod hesmotetherocktwice: and thewatercame out abundantly, and the congregation drank, and their beastsalso. 12Â¶And theLordspake unto Moses and Aaron, Because yebelieved me not, tosanctifyme in the eyes of the children of Israel, therefore ye shall notbringthis congregation into thelandwhich I have given them. 13Thisisthe water ofMeribah; because the children of Israelstrovewith theLord, and he was sanctified in them. 14Â¶And Mosessentmessengers from Kadesh unto the king of Edom, Thus saith thy brother Israel, Thou knowest all the travail that hath befallen us: 15How our fathers went down into Egypt, and we have dwelt in Egypt a long time; and the Egyptians vexed us, and our fathers: 16And when we cried unto theLord, he heard our voice, and sent anangel, and hath brought us forth out of Egypt: and, behold, wearein Kadesh, a city in the uttermost of thy border: 17Let us pass, I pray thee, through thy country: we will not pass through the fields, or through the vineyards, neither will we drinkofthe water of the wells: we will go by the kingâshighway, we will not turn to the right hand nor to the left, until we have passed thy borders. 18And Edom said unto him, Thou shalt not passby me, lest I come out against thee with the sword. 19And the children of Israel said unto him, We will go by the high way: and if I and my cattle drink of thy water, then I willpayfor it: I will only, withoutdoingany thingelse,go through on my feet. 20And he said, Thou shalt not go through. And Edom came out against him with much people, and with a strong hand. 21Thus Edom refused to give Israel passage through his border: wherefore Israel turned away from him. 22Â¶And the children of Israel,eventhe whole congregation, journeyed from Kadesh, and came unto mount Hor. 23And theLordspake unto Moses and Aaron in mount Hor, by thecoastof the land of Edom, saying, 24Aaron shall be gathered unto his people: for he shall not enter into the land which I have given unto the children of Israel, because yerebelledagainst my word at the water of Meribah. 25Take Aaron and Eleazar his son, and bring them up unto mount Hor: 26And strip Aaron of his garments, and put them upon Eleazar his son: and Aaron shall be gatheredunto his people,and shall die there. 27And Moses did as theLordcommanded: and they went up into mount Hor in the sight of all the congregation. 28And Moses stripped Aaron of his garments, and put them upon Eleazar his son; andAarondied there in the top of the mount: and Moses and Eleazar came down from the mount. 29And when all the congregation saw that Aaron was dead, they mourned for Aaron thirty days,evenall the house of Israel."
    },
    {
      "reference": "Numbers 21",
      "title": "Numbers 21",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/21?lang=eng",
      "summary": "The children of Israel destroy those Canaanites who fight against themâThe Israelites are plagued with fiery serpentsâMoses lifts up a serpent of brass to save those who look thereonâIsrael defeats the Amorites, destroys the people of Bashan, and occupies their lands.",
      "verses": [
        "1AndwhenkingAradthe Canaanite, which dwelt in thesouth, heard tell that Israel came by the way ofthe spies; then he fought against Israel, and tooksomeof them prisoners.",
        "2And Israel vowed avowunto theLord, and said, If thou wilt indeed deliver this people into my hand, then I will utterly destroy their cities.",
        "3And theLordhearkened to the voice of Israel, and delivered up the Canaanites; and they utterlydestroyedthem and their cities: and he called the name of the placeHormah.",
        "4Â¶And they journeyed from mountHorby the way of theRed sea, tocompassthe land of Edom: and the soul of the people was much discouraged because of the way.",
        "5And the peoplespakeagainst God, and against Moses, Wherefore have ye brought us up out of Egypt to die in the wilderness? forthere isno bread, neitheris there anywater; and our soul loatheth this light bread.",
        "6And theLordsentfieryserpentsamong the people, and they bit the people; and much people of Israel died.",
        "7Â¶Therefore the people came to Moses, and said, We havesinned, for we have spoken against theLord, and against thee; pray unto theLord, that he take away the serpents from us. And Mosesprayedfor the people.",
        "8And theLordsaid unto Moses,Makethee a fiery serpent, and set it upon a pole: and it shall come to pass, that every one that is bitten, when he looketh upon it, shalllive.",
        "9And Moses made aserpentof brass, and put it upon a pole, and it came to pass, that if a serpent had bitten any man, when he beheld the serpent of brass, he lived.",
        "10Â¶And the children of Israel set forward, andpitchedin Oboth.",
        "11And they journeyed from Oboth, and pitched at Ije-abarim, in the wilderness whichisbeforeMoab, toward the sunrising.",
        "12Â¶From thence they removed, and pitched in the valley of Zared.",
        "13From thence they removed, and pitched on the other side of Arnon, whichisin the wilderness thatcomethout of the coasts of the Amorites: forArnonisthe border of Moab, between Moab and the Amorites.",
        "14Wherefore it is said in thebookof the wars of theLord, What he did in the Red sea, and in the brooks of Arnon,",
        "15And at thestream of the brooksthat goeth down to the dwelling of Ar, and lieth upon the border of Moab.",
        "16And from thencethey wenttoBeer: thatisthe well whereof theLordspake unto Moses, Gather the people together, and I will give them water.",
        "17Â¶Then Israel sang this song, Spring up, O well; sing ye unto it:",
        "18The princes digged the well, the nobles of the people digged it, bythe direction ofthe lawgiver, with their staves. And from the wildernessthey wentto Mattanah:",
        "19And from Mattanah to Nahaliel: and from Nahaliel to Bamoth:",
        "20And from Bamothinthe valley, thatisin the country of Moab, to the top of Pisgah, whichlooketh toward Jeshimon.",
        "21Â¶And Israel sent messengers untoSihonking of theAmorites, saying,",
        "22Let me pass through thy land: we will not turn into the fields, or into the vineyards; we will not drinkofthe waters of the well:butwe will go along by the kingâshighway, until we be past thy borders.",
        "23AndSihonwould not suffer Israel to pass through hisborder: but Sihon gathered all his people together, and went out against Israel into the wilderness: and he came to Jahaz, and fought against Israel.",
        "24And Israelsmotehim with the edge of the sword, and possessed his land fromArnonunto Jabbok, even unto the children of Ammon: for the border of the children of Ammonwasstrong.",
        "25And Israel took all thesecities: and Israel dwelt in all the cities of the Amorites, in Heshbon, and in all the villages thereof.",
        "26For Heshbonwasthe city of Sihon the king of the Amorites, who had fought against the former king of Moab, and taken all his land out of his hand, even unto Arnon.",
        "27Wherefore they that speak in proverbs say, Come into Heshbon, let the city of Sihon be built andprepared:",
        "28For there is a fire gone out ofHeshbon, a flame from the city of Sihon: it hath consumed Ar of Moab,andthe lords of the high places of Arnon.",
        "29Woe to thee, Moab! thou art undone, O people ofChemosh: he hath given his sons that escaped, and his daughters, into captivity unto Sihon king of the Amorites.",
        "30We have shot at them; Heshbon is perished even unto Dibon, and we have laid them waste even unto Nophah, whichreachethunto Medeba.",
        "31Â¶Thus Israel dwelt in the land of the Amorites.",
        "32And Moses sent to spy outJaazer, and they took the villages thereof, and drove out the Amorites thatwerethere.",
        "33Â¶And they turned and went up by the way of Bashan: andOgthe king of Bashan went out against them, he, and all his people, to the battle at Edrei.",
        "34And theLordsaid unto Moses, Fear him not: for I have delivered him into thy hand, and all his people, and his land; and thou shalt do to him as thou didst unto Sihon king of theAmorites, which dwelt at Heshbon.",
        "35So theysmotehim, and his sons, and all his people, until there was none left him alive: and they possessed his land."
      ],
      "full_text": "1AndwhenkingAradthe Canaanite, which dwelt in thesouth, heard tell that Israel came by the way ofthe spies; then he fought against Israel, and tooksomeof them prisoners. 2And Israel vowed avowunto theLord, and said, If thou wilt indeed deliver this people into my hand, then I will utterly destroy their cities. 3And theLordhearkened to the voice of Israel, and delivered up the Canaanites; and they utterlydestroyedthem and their cities: and he called the name of the placeHormah. 4Â¶And they journeyed from mountHorby the way of theRed sea, tocompassthe land of Edom: and the soul of the people was much discouraged because of the way. 5And the peoplespakeagainst God, and against Moses, Wherefore have ye brought us up out of Egypt to die in the wilderness? forthere isno bread, neitheris there anywater; and our soul loatheth this light bread. 6And theLordsentfieryserpentsamong the people, and they bit the people; and much people of Israel died. 7Â¶Therefore the people came to Moses, and said, We havesinned, for we have spoken against theLord, and against thee; pray unto theLord, that he take away the serpents from us. And Mosesprayedfor the people. 8And theLordsaid unto Moses,Makethee a fiery serpent, and set it upon a pole: and it shall come to pass, that every one that is bitten, when he looketh upon it, shalllive. 9And Moses made aserpentof brass, and put it upon a pole, and it came to pass, that if a serpent had bitten any man, when he beheld the serpent of brass, he lived. 10Â¶And the children of Israel set forward, andpitchedin Oboth. 11And they journeyed from Oboth, and pitched at Ije-abarim, in the wilderness whichisbeforeMoab, toward the sunrising. 12Â¶From thence they removed, and pitched in the valley of Zared. 13From thence they removed, and pitched on the other side of Arnon, whichisin the wilderness thatcomethout of the coasts of the Amorites: forArnonisthe border of Moab, between Moab and the Amorites. 14Wherefore it is said in thebookof the wars of theLord, What he did in the Red sea, and in the brooks of Arnon, 15And at thestream of the brooksthat goeth down to the dwelling of Ar, and lieth upon the border of Moab. 16And from thencethey wenttoBeer: thatisthe well whereof theLordspake unto Moses, Gather the people together, and I will give them water. 17Â¶Then Israel sang this song, Spring up, O well; sing ye unto it: 18The princes digged the well, the nobles of the people digged it, bythe direction ofthe lawgiver, with their staves. And from the wildernessthey wentto Mattanah: 19And from Mattanah to Nahaliel: and from Nahaliel to Bamoth: 20And from Bamothinthe valley, thatisin the country of Moab, to the top of Pisgah, whichlooketh toward Jeshimon. 21Â¶And Israel sent messengers untoSihonking of theAmorites, saying, 22Let me pass through thy land: we will not turn into the fields, or into the vineyards; we will not drinkofthe waters of the well:butwe will go along by the kingâshighway, until we be past thy borders. 23AndSihonwould not suffer Israel to pass through hisborder: but Sihon gathered all his people together, and went out against Israel into the wilderness: and he came to Jahaz, and fought against Israel. 24And Israelsmotehim with the edge of the sword, and possessed his land fromArnonunto Jabbok, even unto the children of Ammon: for the border of the children of Ammonwasstrong. 25And Israel took all thesecities: and Israel dwelt in all the cities of the Amorites, in Heshbon, and in all the villages thereof. 26For Heshbonwasthe city of Sihon the king of the Amorites, who had fought against the former king of Moab, and taken all his land out of his hand, even unto Arnon. 27Wherefore they that speak in proverbs say, Come into Heshbon, let the city of Sihon be built andprepared: 28For there is a fire gone out ofHeshbon, a flame from the city of Sihon: it hath consumed Ar of Moab,andthe lords of the high places of Arnon. 29Woe to thee, Moab! thou art undone, O people ofChemosh: he hath given his sons that escaped, and his daughters, into captivity unto Sihon king of the Amorites. 30We have shot at them; Heshbon is perished even unto Dibon, and we have laid them waste even unto Nophah, whichreachethunto Medeba. 31Â¶Thus Israel dwelt in the land of the Amorites. 32And Moses sent to spy outJaazer, and they took the villages thereof, and drove out the Amorites thatwerethere. 33Â¶And they turned and went up by the way of Bashan: andOgthe king of Bashan went out against them, he, and all his people, to the battle at Edrei. 34And theLordsaid unto Moses, Fear him not: for I have delivered him into thy hand, and all his people, and his land; and thou shalt do to him as thou didst unto Sihon king of theAmorites, which dwelt at Heshbon. 35So theysmotehim, and his sons, and all his people, until there was none left him alive: and they possessed his land."
    },
    {
      "reference": "Numbers 22",
      "title": "Numbers 22",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/22?lang=eng",
      "summary": "Balak offers money, cattle, and great honors to Balaam to curse IsraelâThe Lord forbids Balaam to do soâAn angel opposes Balaam on the way.",
      "verses": [
        "1And the children of Israel set forward, andpitchedin the plains of Moabonthis side JordanbyJericho.",
        "2Â¶AndBalakthe son of Zippor saw all that Israel had done to the Amorites.",
        "3And Moab was sore afraid of the people, because theyweremany: and Moab was distressed because of the children of Israel.",
        "4And Moab said unto the elders of Midian, Now shall this company lick up allthat areround about us, as the ox licketh up the grass of the field. And Balak the son of Zipporwasking of the Moabites at that time.",
        "5He sent messengers therefore untoBalaamthe son of Beor to Pethor, whichisby the river of the land of the children of his people, to call him, saying, Behold, there is a people come out from Egypt: behold, they cover the face of the earth, and they abide over against me:",
        "6Come now therefore, I pray thee, curse me this people; for theyaretoo mighty for me: peradventure I shall prevail,thatwe may smite them, andthatI may drive them out of the land: for Iwotthat he whom thou blessestisblessed, and he whom thou cursest is cursed.",
        "7And the elders of Moab and the elders of Midian departed with therewardsofdivinationin their hand; and they came unto Balaam, and spake unto him the words of Balak.",
        "8And he said unto them, Lodge here this night, and I will bring you word again, as theLordshall speak unto me: and theprincesof Moab abode with Balaam.",
        "9And God came unto Balaam, and said, What menarethese with thee?",
        "10And Balaam said unto God, Balak the son of Zippor, king of Moab, hath sent unto me,saying,",
        "11Behold,there isa people come out of Egypt, which covereth the face of the earth: come now, curse me them; peradventure I shall be able to overcome them, and drive them out.",
        "12And God said unto Balaam, Thou shalt not go with them; thou shalt not curse the people: for theyareblessed.",
        "13And Balaam rose up in the morning, and said unto the princes of Balak, Get you into your land: for theLordrefuseth to give me leave to go with you.",
        "14And the princes of Moab rose up, and they went unto Balak, and said, Balaam refuseth to come with us.",
        "15Â¶And Balak sent yet again princes, more, and more honourable than they.",
        "16And they came to Balaam, and said to him, Thus saith Balak the son of Zippor, Let nothing, I pray thee, hinder thee from coming unto me:",
        "17For I will promote thee unto very great honour, and I will do whatsoever thou sayest unto me: come therefore, I pray thee, curse me this people.",
        "18And Balaam answered and said unto the servants of Balak, If Balak would give me his house full of silver and gold, I cannot go beyond the word of theLordmy God, to do less or more.",
        "19Now therefore, I pray you, tarry ye also here this night, that I may know what theLordwill say unto me more.",
        "20And God came unto Balaam at night, and said unto him, If the men come to call thee, rise up,andgo with them; but yet the word which I shall say unto thee, that shalt thou do.",
        "21And Balaam rose up in the morning, and saddled his ass, and went with the princes of Moab.",
        "22Â¶And Godâs anger was kindled because he went: and the angel of theLordstood in the way for an adversary against him. Now he was riding upon his ass, and his two servantswerewith him.",
        "23And the asssawthe angel oftheLordstanding in the way, and his sword drawn in his hand: and the ass turned aside out of the way, and went into the field: and Balaam smote the ass, to turn her into the way.",
        "24But the angel of theLordstood in a path of the vineyards, a wallbeingon this side, and a wall on that side.",
        "25And when the ass saw the angel of theLord, she thrust herself unto the wall, and crushed Balaamâs foot against the wall: and he smote her again.",
        "26And the angel of theLordwent further, and stood in a narrow place, wherewasno way to turn either to the right hand or to the left.",
        "27And when the ass saw the angel of theLord, she fell down under Balaam: and Balaamâs anger was kindled, and he smote the ass with a staff.",
        "28And theLordopened the mouth of the ass, and she said unto Balaam, What have I done unto thee, that thou hast smitten me these three times?",
        "29And Balaam said unto the ass, Because thou hast mocked me: I would there were a sword in mine hand, for now would Ikillthee.",
        "30And theasssaid unto Balaam,Amnot I thine ass, upon which thou hast ridden ever sinceI wasthine unto this day? was I everwontto do so unto thee? And he said, Nay.",
        "31Then theLordopened the eyes of Balaam, and he saw the angel of theLordstanding in the way, and his sword drawn in his hand: and he bowed down his head, and fell flat on his face.",
        "32And the angel of theLordsaid unto him, Wherefore hast thou smitten thine ass these three times? behold, I went out to withstand thee, becausethyway isperversebefore me:",
        "33And the ass saw me, and turned from me these three times: unless she had turned from me, surely now also I had slain thee, and saved her alive.",
        "34And Balaam said unto the angel of theLord, I have sinned; for I knew not that thou stoodest in the way against me: now therefore, if it displease thee, I will get me back again.",
        "35And the angel of theLordsaid unto Balaam, Go with the men: but only the word that I shall speak unto thee, that thou shalt speak. So Balaam went with the princes of Balak.",
        "36Â¶And when Balak heard that Balaam was come, he went out to meet him unto a city of Moab, whichisin the border of Arnon, whichisin the utmostcoast.",
        "37And Balak said unto Balaam, Did I not earnestly send unto thee to call thee? wherefore camest thou not unto me? am I not able indeed to promote thee to honour?",
        "38And Balaam said unto Balak, Lo, I am come unto thee: have I now any power at all to say any thing? the word that God putteth in my mouth, that shall I speak.",
        "39And Balaam went with Balak, and they came unto Kirjath-huzoth.",
        "40And Balak offered oxen and sheep, and sent to Balaam, and to the princes thatwerewith him.",
        "41And it came to pass on the morrow, that Balak took Balaam, and brought him up into the high places of Baal, that thence he might see the utmostpartof the people."
      ],
      "full_text": "1And the children of Israel set forward, andpitchedin the plains of Moabonthis side JordanbyJericho. 2Â¶AndBalakthe son of Zippor saw all that Israel had done to the Amorites. 3And Moab was sore afraid of the people, because theyweremany: and Moab was distressed because of the children of Israel. 4And Moab said unto the elders of Midian, Now shall this company lick up allthat areround about us, as the ox licketh up the grass of the field. And Balak the son of Zipporwasking of the Moabites at that time. 5He sent messengers therefore untoBalaamthe son of Beor to Pethor, whichisby the river of the land of the children of his people, to call him, saying, Behold, there is a people come out from Egypt: behold, they cover the face of the earth, and they abide over against me: 6Come now therefore, I pray thee, curse me this people; for theyaretoo mighty for me: peradventure I shall prevail,thatwe may smite them, andthatI may drive them out of the land: for Iwotthat he whom thou blessestisblessed, and he whom thou cursest is cursed. 7And the elders of Moab and the elders of Midian departed with therewardsofdivinationin their hand; and they came unto Balaam, and spake unto him the words of Balak. 8And he said unto them, Lodge here this night, and I will bring you word again, as theLordshall speak unto me: and theprincesof Moab abode with Balaam. 9And God came unto Balaam, and said, What menarethese with thee? 10And Balaam said unto God, Balak the son of Zippor, king of Moab, hath sent unto me,saying, 11Behold,there isa people come out of Egypt, which covereth the face of the earth: come now, curse me them; peradventure I shall be able to overcome them, and drive them out. 12And God said unto Balaam, Thou shalt not go with them; thou shalt not curse the people: for theyareblessed. 13And Balaam rose up in the morning, and said unto the princes of Balak, Get you into your land: for theLordrefuseth to give me leave to go with you. 14And the princes of Moab rose up, and they went unto Balak, and said, Balaam refuseth to come with us. 15Â¶And Balak sent yet again princes, more, and more honourable than they. 16And they came to Balaam, and said to him, Thus saith Balak the son of Zippor, Let nothing, I pray thee, hinder thee from coming unto me: 17For I will promote thee unto very great honour, and I will do whatsoever thou sayest unto me: come therefore, I pray thee, curse me this people. 18And Balaam answered and said unto the servants of Balak, If Balak would give me his house full of silver and gold, I cannot go beyond the word of theLordmy God, to do less or more. 19Now therefore, I pray you, tarry ye also here this night, that I may know what theLordwill say unto me more. 20And God came unto Balaam at night, and said unto him, If the men come to call thee, rise up,andgo with them; but yet the word which I shall say unto thee, that shalt thou do. 21And Balaam rose up in the morning, and saddled his ass, and went with the princes of Moab. 22Â¶And Godâs anger was kindled because he went: and the angel of theLordstood in the way for an adversary against him. Now he was riding upon his ass, and his two servantswerewith him. 23And the asssawthe angel oftheLordstanding in the way, and his sword drawn in his hand: and the ass turned aside out of the way, and went into the field: and Balaam smote the ass, to turn her into the way. 24But the angel of theLordstood in a path of the vineyards, a wallbeingon this side, and a wall on that side. 25And when the ass saw the angel of theLord, she thrust herself unto the wall, and crushed Balaamâs foot against the wall: and he smote her again. 26And the angel of theLordwent further, and stood in a narrow place, wherewasno way to turn either to the right hand or to the left. 27And when the ass saw the angel of theLord, she fell down under Balaam: and Balaamâs anger was kindled, and he smote the ass with a staff. 28And theLordopened the mouth of the ass, and she said unto Balaam, What have I done unto thee, that thou hast smitten me these three times? 29And Balaam said unto the ass, Because thou hast mocked me: I would there were a sword in mine hand, for now would Ikillthee. 30And theasssaid unto Balaam,Amnot I thine ass, upon which thou hast ridden ever sinceI wasthine unto this day? was I everwontto do so unto thee? And he said, Nay. 31Then theLordopened the eyes of Balaam, and he saw the angel of theLordstanding in the way, and his sword drawn in his hand: and he bowed down his head, and fell flat on his face. 32And the angel of theLordsaid unto him, Wherefore hast thou smitten thine ass these three times? behold, I went out to withstand thee, becausethyway isperversebefore me: 33And the ass saw me, and turned from me these three times: unless she had turned from me, surely now also I had slain thee, and saved her alive. 34And Balaam said unto the angel of theLord, I have sinned; for I knew not that thou stoodest in the way against me: now therefore, if it displease thee, I will get me back again. 35And the angel of theLordsaid unto Balaam, Go with the men: but only the word that I shall speak unto thee, that thou shalt speak. So Balaam went with the princes of Balak. 36Â¶And when Balak heard that Balaam was come, he went out to meet him unto a city of Moab, whichisin the border of Arnon, whichisin the utmostcoast. 37And Balak said unto Balaam, Did I not earnestly send unto thee to call thee? wherefore camest thou not unto me? am I not able indeed to promote thee to honour? 38And Balaam said unto Balak, Lo, I am come unto thee: have I now any power at all to say any thing? the word that God putteth in my mouth, that shall I speak. 39And Balaam went with Balak, and they came unto Kirjath-huzoth. 40And Balak offered oxen and sheep, and sent to Balaam, and to the princes thatwerewith him. 41And it came to pass on the morrow, that Balak took Balaam, and brought him up into the high places of Baal, that thence he might see the utmostpartof the people."
    },
    {
      "reference": "Numbers 23",
      "title": "Numbers 23",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/23?lang=eng",
      "summary": "The Lord commands Balaam to bless IsraelâHe does so, saying, Who can count the dust of Jacob? and, What hath God wrought!",
      "verses": [
        "1And Balaam said unto Balak, Build me here seven altars, and prepare me heresevenoxen and seven rams.",
        "2And Balak did as Balaam had spoken; and Balak and Balaam offered oneveryaltar a bullock and a ram.",
        "3And Balaam said unto Balak,Stand by thy burnt offering, and I will go: peradventure theLordwill come to meet me: and whatsoever he sheweth me I will tell thee. And he went toan high place.",
        "4And God met Balaam: and he said unto him, I have prepared seven altars, and I have offered uponeveryaltar a bullock and a ram.",
        "5And theLordput a word in Balaamâs mouth, and said, Return unto Balak, and thus thou shalt speak.",
        "6And he returned unto him, and, lo, he stood by his burnt sacrifice, he, and all the princes of Moab.",
        "7And he took up his parable, and said, Balak the king of Moab hath brought me from Aram, out of the mountains of the east,saying,Come, curse me Jacob, and come,defyIsrael.",
        "8How shall I curse, whom God hath not cursed? or how shall I defy,whomtheLordhath not defied?",
        "9For from the top of the rocks I see him, and from the hills I behold him: lo, the people shall dwell alone, and shall not be reckoned among the nations.",
        "10Who can count the dust of Jacob, and the number of the fourthpartof Israel? Let me die thedeathof the righteous, and let my last end be like his!",
        "11And Balak said untoBalaam, What hast thou done unto me? I took thee tocursemine enemies, and, behold, thou hast blessedthemaltogether.",
        "12And he answered and said, Must I not take heed to speak that which theLordhath put in my mouth?",
        "13And Balak said unto him, Come, I pray thee, with me unto another place, from whence thou mayest see them: thou shalt see but the utmost part of them, and shalt not see them all: and curse me them from thence.",
        "14Â¶And he brought him intothefield of Zophim, tothe topof Pisgah, and built seven altars, and offered a bullock and a ram oneveryaltar.",
        "15And he said unto Balak, Stand here by thy burnt offering, while I meettheLordyonder.",
        "16And theLordmet Balaam, and put a word in his mouth, and said, Go again unto Balak, and say thus.",
        "17And when he came to him, behold, he stood by his burnt offering, and the princes of Moab with him. And Balak said unto him, What hath theLordspoken?",
        "18And he took up his parable, and said, Rise up, Balak, and hear; hearken unto me, thou son of Zippor:",
        "19Godisnot a man, that he shouldlie; neither the son of man, that he shouldrepent: hath he said, and shall he not doit?or hath hespoken, and shall he not make it good?",
        "20Behold, I have receivedcommandmentto bless: and he hath blessed; and I cannot reverse it.",
        "21He hath not beheld iniquity in Jacob, neither hath he seen perverseness in Israel: theLordhis Godiswith him, and the shout of a kingisamong them.",
        "22God brought them out of Egypt; he hath as it were the strength ofan unicorn.",
        "23Surelythere isno enchantment against Jacob, neitheris thereany divination against Israel: according to this time it shall be said of Jacob and of Israel, What hath God wrought!",
        "24Behold, the people shall rise up as a great lion, and lift up himself as a young lion: he shall not lie down until he eatofthe prey, and drink the blood of the slain.",
        "25Â¶And Balak said unto Balaam, Neither curse them at all, nor bless them at all.",
        "26But Balaam answered and said unto Balak, Told not I thee, saying, All that theLordspeaketh, that I must do?",
        "27Â¶And Balak said unto Balaam, Come, I pray thee, I will bring thee unto another place; peradventure it will please God that thou mayest curse me them from thence.",
        "28And Balak brought Balaam unto the top of Peor, thatlooketh toward Jeshimon.",
        "29And Balaam said unto Balak, Build me here seven altars, and prepare me here seven bullocks and seven rams.",
        "30And Balak did as Balaam had said, and offered a bullock and a ram oneveryaltar."
      ],
      "full_text": "1And Balaam said unto Balak, Build me here seven altars, and prepare me heresevenoxen and seven rams. 2And Balak did as Balaam had spoken; and Balak and Balaam offered oneveryaltar a bullock and a ram. 3And Balaam said unto Balak,Stand by thy burnt offering, and I will go: peradventure theLordwill come to meet me: and whatsoever he sheweth me I will tell thee. And he went toan high place. 4And God met Balaam: and he said unto him, I have prepared seven altars, and I have offered uponeveryaltar a bullock and a ram. 5And theLordput a word in Balaamâs mouth, and said, Return unto Balak, and thus thou shalt speak. 6And he returned unto him, and, lo, he stood by his burnt sacrifice, he, and all the princes of Moab. 7And he took up his parable, and said, Balak the king of Moab hath brought me from Aram, out of the mountains of the east,saying,Come, curse me Jacob, and come,defyIsrael. 8How shall I curse, whom God hath not cursed? or how shall I defy,whomtheLordhath not defied? 9For from the top of the rocks I see him, and from the hills I behold him: lo, the people shall dwell alone, and shall not be reckoned among the nations. 10Who can count the dust of Jacob, and the number of the fourthpartof Israel? Let me die thedeathof the righteous, and let my last end be like his! 11And Balak said untoBalaam, What hast thou done unto me? I took thee tocursemine enemies, and, behold, thou hast blessedthemaltogether. 12And he answered and said, Must I not take heed to speak that which theLordhath put in my mouth? 13And Balak said unto him, Come, I pray thee, with me unto another place, from whence thou mayest see them: thou shalt see but the utmost part of them, and shalt not see them all: and curse me them from thence. 14Â¶And he brought him intothefield of Zophim, tothe topof Pisgah, and built seven altars, and offered a bullock and a ram oneveryaltar. 15And he said unto Balak, Stand here by thy burnt offering, while I meettheLordyonder. 16And theLordmet Balaam, and put a word in his mouth, and said, Go again unto Balak, and say thus. 17And when he came to him, behold, he stood by his burnt offering, and the princes of Moab with him. And Balak said unto him, What hath theLordspoken? 18And he took up his parable, and said, Rise up, Balak, and hear; hearken unto me, thou son of Zippor: 19Godisnot a man, that he shouldlie; neither the son of man, that he shouldrepent: hath he said, and shall he not doit?or hath hespoken, and shall he not make it good? 20Behold, I have receivedcommandmentto bless: and he hath blessed; and I cannot reverse it. 21He hath not beheld iniquity in Jacob, neither hath he seen perverseness in Israel: theLordhis Godiswith him, and the shout of a kingisamong them. 22God brought them out of Egypt; he hath as it were the strength ofan unicorn. 23Surelythere isno enchantment against Jacob, neitheris thereany divination against Israel: according to this time it shall be said of Jacob and of Israel, What hath God wrought! 24Behold, the people shall rise up as a great lion, and lift up himself as a young lion: he shall not lie down until he eatofthe prey, and drink the blood of the slain. 25Â¶And Balak said unto Balaam, Neither curse them at all, nor bless them at all. 26But Balaam answered and said unto Balak, Told not I thee, saying, All that theLordspeaketh, that I must do? 27Â¶And Balak said unto Balaam, Come, I pray thee, I will bring thee unto another place; peradventure it will please God that thou mayest curse me them from thence. 28And Balak brought Balaam unto the top of Peor, thatlooketh toward Jeshimon. 29And Balaam said unto Balak, Build me here seven altars, and prepare me here seven bullocks and seven rams. 30And Balak did as Balaam had said, and offered a bullock and a ram oneveryaltar."
    },
    {
      "reference": "Numbers 24",
      "title": "Numbers 24",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/24?lang=eng",
      "summary": "Balaam sees in vision and prophesies of the destiny of IsraelâHe prophesies of the Messiah: There will come a Star out of Jacob, and a Sceptre will rise out of Israel.",
      "verses": [
        "1And when Balaam saw that itpleasedtheLordto bless Israel, he went not, as at other times, to seek for enchantments, but he set his face toward the wilderness.",
        "2And Balaam lifted up his eyes, and he saw Israel abidingin his tentsaccording to theirtribes; and the spirit of God came upon him.",
        "3And he took up hisparable, and said, Balaam the son of Beor hath said, and the man whose eyes are open hath said:",
        "4He hath said, which heard the words of God, which saw thevisionof the Almighty, fallinginto a trance,but having his eyes open:",
        "5How goodly are thy tents, O Jacob,andthytabernacles, O Israel!",
        "6As the valleys are they spread forth, as gardens by the riverâs side, as thetreesof lign aloes which theLordhath planted,andas cedar trees beside the waters.",
        "7Heshall pour the water out of his buckets, and his seedshall bein many waters, and his king shall be higher thanAgag, and his kingdom shall be exalted.",
        "8God brought him forth out of Egypt; he hath as it were the strength of an unicorn: he shall eat up the nations his enemies, and shallbreaktheir bones, andpiercethemthrough with his arrows.",
        "9He couched, he lay down as alion, and as a great lion: who shall stir him up? Blessedishe that blesseth thee, and cursedishe that curseth thee.",
        "10Â¶And Balakâs anger was kindled against Balaam, and he smote his hands together: and Balak said unto Balaam, I called thee to curse mine enemies, and, behold, thou hast altogether blessedthemthese three times.",
        "11Therefore now flee thou to thy place: I thought to promote thee unto great honour; but, lo, theLordhath kept thee back from honour.",
        "12And Balaam said unto Balak, Spake I not also to thy messengers which thou sentest unto me, saying,",
        "13If Balak would give me his house full of silver and gold, I cannot go beyond the commandment of theLord, to doeithergood or bad of mine ownmind;butwhat theLordsaith, that will Ispeak?",
        "14And now, behold, I go unto my people: cometherefore, andI willadvertisethee what this people shall do to thy people in the latter days.",
        "15Â¶And he took up his parable, and said, Balaam the son of Beor hath said, and the man whose eyes are open hath said:",
        "16He hath said, which heard thewords of God, and knew the knowledge of the most High,whichsaw the vision of the Almighty, fallinginto a trance,but having his eyes open:",
        "17I shall see him, butnot now: I shall behold him, but not nigh: there shall come aStarout of Jacob, and a Sceptre shall rise out of Israel, and shall smite the corners ofMoab, and destroy all the children of Sheth.",
        "18AndEdomshall be a possession, Seir also shall be a possession for his enemies; and Israel shall do valiantly.",
        "19Out of Jacob shall come he that shall have dominion, and shall destroy him that remaineth of the city.",
        "20Â¶And when he looked on Amalek, he took up his parable, and said,Amalekwasthe first of the nations; but his latter endshall bethat he perish for ever.",
        "21And he looked on the Kenites, and took up his parable, and said, Strong is thy dwellingplace, and thou puttest thy nest in a rock.",
        "22Nevertheless the Kenite shall be wasted, until Asshur shall carry thee away captive.",
        "23And he took up his parable, and said, Alas, who shall live when God doeth this!",
        "24And shipsshall comefrom the coast ofChittim, and shall afflict Asshur, and shall afflict Eber, and he also shall perish for ever.",
        "25And Balaam rose up, and went and returned to his place: and Balak also went his way."
      ],
      "full_text": "1And when Balaam saw that itpleasedtheLordto bless Israel, he went not, as at other times, to seek for enchantments, but he set his face toward the wilderness. 2And Balaam lifted up his eyes, and he saw Israel abidingin his tentsaccording to theirtribes; and the spirit of God came upon him. 3And he took up hisparable, and said, Balaam the son of Beor hath said, and the man whose eyes are open hath said: 4He hath said, which heard the words of God, which saw thevisionof the Almighty, fallinginto a trance,but having his eyes open: 5How goodly are thy tents, O Jacob,andthytabernacles, O Israel! 6As the valleys are they spread forth, as gardens by the riverâs side, as thetreesof lign aloes which theLordhath planted,andas cedar trees beside the waters. 7Heshall pour the water out of his buckets, and his seedshall bein many waters, and his king shall be higher thanAgag, and his kingdom shall be exalted. 8God brought him forth out of Egypt; he hath as it were the strength of an unicorn: he shall eat up the nations his enemies, and shallbreaktheir bones, andpiercethemthrough with his arrows. 9He couched, he lay down as alion, and as a great lion: who shall stir him up? Blessedishe that blesseth thee, and cursedishe that curseth thee. 10Â¶And Balakâs anger was kindled against Balaam, and he smote his hands together: and Balak said unto Balaam, I called thee to curse mine enemies, and, behold, thou hast altogether blessedthemthese three times. 11Therefore now flee thou to thy place: I thought to promote thee unto great honour; but, lo, theLordhath kept thee back from honour. 12And Balaam said unto Balak, Spake I not also to thy messengers which thou sentest unto me, saying, 13If Balak would give me his house full of silver and gold, I cannot go beyond the commandment of theLord, to doeithergood or bad of mine ownmind;butwhat theLordsaith, that will Ispeak? 14And now, behold, I go unto my people: cometherefore, andI willadvertisethee what this people shall do to thy people in the latter days. 15Â¶And he took up his parable, and said, Balaam the son of Beor hath said, and the man whose eyes are open hath said: 16He hath said, which heard thewords of God, and knew the knowledge of the most High,whichsaw the vision of the Almighty, fallinginto a trance,but having his eyes open: 17I shall see him, butnot now: I shall behold him, but not nigh: there shall come aStarout of Jacob, and a Sceptre shall rise out of Israel, and shall smite the corners ofMoab, and destroy all the children of Sheth. 18AndEdomshall be a possession, Seir also shall be a possession for his enemies; and Israel shall do valiantly. 19Out of Jacob shall come he that shall have dominion, and shall destroy him that remaineth of the city. 20Â¶And when he looked on Amalek, he took up his parable, and said,Amalekwasthe first of the nations; but his latter endshall bethat he perish for ever. 21And he looked on the Kenites, and took up his parable, and said, Strong is thy dwellingplace, and thou puttest thy nest in a rock. 22Nevertheless the Kenite shall be wasted, until Asshur shall carry thee away captive. 23And he took up his parable, and said, Alas, who shall live when God doeth this! 24And shipsshall comefrom the coast ofChittim, and shall afflict Asshur, and shall afflict Eber, and he also shall perish for ever. 25And Balaam rose up, and went and returned to his place: and Balak also went his way."
    },
    {
      "reference": "Numbers 27",
      "title": "Numbers 27",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/num/27?lang=eng",
      "summary": "The law of inheritances to sons, daughters, and kinsmen is explainedâMoses will see but not enter the promised landâJoshua is called and set apart to lead Israel.",
      "verses": [
        "1Then came the daughters of Zelophehad, the son of Hepher, the son of Gilead, the son of Machir, the son of Manasseh, of the families of Manasseh the son of Joseph: and thesearethe names of his daughters; Mahlah, Noah, and Hoglah, and Milcah, and Tirzah.",
        "2And they stood before Moses, and before Eleazar the priest, and before theprincesand all the congregation,bythe door of thetabernacle of the congregation, saying,",
        "3Our father died in the wilderness, and he was not in the company of them that gathered themselves together against theLordin the company of Korah; but died in his own sin, and had no sons.",
        "4Why should the name of our father be done away from among his family, because he hath no son? Give unto usthereforea possession among the brethren of our father.",
        "5And Moses brought their cause before theLord.",
        "6Â¶And theLordspake unto Moses, saying,",
        "7The daughters of Zelophehad speak right: thou shalt surely give them a possession of aninheritanceamong their fatherâs brethren; and thou shalt cause the inheritance of their father to pass unto them.",
        "8And thou shalt speak unto the children of Israel, saying, If a man die, and have no son, then ye shall cause his inheritance to pass unto his daughter.",
        "9And if he have no daughter, then ye shall give his inheritance unto his brethren.",
        "10And if he have no brethren, then ye shall give his inheritance unto his fatherâs brethren.",
        "11And if his father have no brethren, then ye shall give his inheritance unto his kinsman that is next to him of his family, and he shall possess it: and it shall be unto the children of Israel astatute of judgment, as theLordcommanded Moses.",
        "12Â¶And theLordsaid unto Moses, Get thee up into this mountAbarim, and see thelandwhich I have given unto the children of Israel.",
        "13And when thou hast seen it, thou also shalt be gathered unto thy people, as Aaron thy brother was gathered.",
        "14For ye rebelled against my commandment in the desert of Zin, in thestrifeof the congregation, to sanctify me at the water before their eyes: thatisthe water ofMeribahinKadeshin the wilderness of Zin.",
        "15Â¶And Moses spake unto theLord, saying,",
        "16Let theLord, theGodof thespiritsof all flesh,seta man over the congregation,",
        "17Which may go out before them, and which may go in before them, and which may lead them out, and which may bring them in; that thecongregationof theLordbe not assheepwhich have noshepherd.",
        "18Â¶And theLordsaid unto Moses, Take theeJoshuathe son ofNun, a man in whomisthespirit, andlaythine hand upon him;",
        "19Andsethim before Eleazar the priest, and before all the congregation; and give him a charge in their sight.",
        "20And thou shaltputsomeof thinehonourupon him, that all the congregation of the children of Israel may be obedient.",
        "21And he shall stand before Eleazar thepriest, who shall askcounselfor himafterthe judgment ofUrimbefore theLord: at his word shall they go out, and at his word they shall come in,bothhe, and all the children of Israel with him, even all the congregation.",
        "22And Moses did as theLordcommanded him: and he took Joshua, and set him before Eleazar the priest, and before all the congregation:",
        "23And helaidhishandsupon him, and gave him acharge, as theLordcommanded by the hand of Moses."
      ],
      "full_text": "1Then came the daughters of Zelophehad, the son of Hepher, the son of Gilead, the son of Machir, the son of Manasseh, of the families of Manasseh the son of Joseph: and thesearethe names of his daughters; Mahlah, Noah, and Hoglah, and Milcah, and Tirzah. 2And they stood before Moses, and before Eleazar the priest, and before theprincesand all the congregation,bythe door of thetabernacle of the congregation, saying, 3Our father died in the wilderness, and he was not in the company of them that gathered themselves together against theLordin the company of Korah; but died in his own sin, and had no sons. 4Why should the name of our father be done away from among his family, because he hath no son? Give unto usthereforea possession among the brethren of our father. 5And Moses brought their cause before theLord. 6Â¶And theLordspake unto Moses, saying, 7The daughters of Zelophehad speak right: thou shalt surely give them a possession of aninheritanceamong their fatherâs brethren; and thou shalt cause the inheritance of their father to pass unto them. 8And thou shalt speak unto the children of Israel, saying, If a man die, and have no son, then ye shall cause his inheritance to pass unto his daughter. 9And if he have no daughter, then ye shall give his inheritance unto his brethren. 10And if he have no brethren, then ye shall give his inheritance unto his fatherâs brethren. 11And if his father have no brethren, then ye shall give his inheritance unto his kinsman that is next to him of his family, and he shall possess it: and it shall be unto the children of Israel astatute of judgment, as theLordcommanded Moses. 12Â¶And theLordsaid unto Moses, Get thee up into this mountAbarim, and see thelandwhich I have given unto the children of Israel. 13And when thou hast seen it, thou also shalt be gathered unto thy people, as Aaron thy brother was gathered. 14For ye rebelled against my commandment in the desert of Zin, in thestrifeof the congregation, to sanctify me at the water before their eyes: thatisthe water ofMeribahinKadeshin the wilderness of Zin. 15Â¶And Moses spake unto theLord, saying, 16Let theLord, theGodof thespiritsof all flesh,seta man over the congregation, 17Which may go out before them, and which may go in before them, and which may lead them out, and which may bring them in; that thecongregationof theLordbe not assheepwhich have noshepherd. 18Â¶And theLordsaid unto Moses, Take theeJoshuathe son ofNun, a man in whomisthespirit, andlaythine hand upon him; 19Andsethim before Eleazar the priest, and before all the congregation; and give him a charge in their sight. 20And thou shaltputsomeof thinehonourupon him, that all the congregation of the children of Israel may be obedient. 21And he shall stand before Eleazar thepriest, who shall askcounselfor himafterthe judgment ofUrimbefore theLord: at his word shall they go out, and at his word they shall come in,bothhe, and all the children of Israel with him, even all the congregation. 22And Moses did as theLordcommanded him: and he took Joshua, and set him before Eleazar the priest, and before all the congregation: 23And helaidhishandsupon him, and gave him acharge, as theLordcommanded by the hand of Moses."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:28:23",
  "metadata": {
    "week_number": 19,
    "title": "Week 19: May 4–10 - Numbers 11–14; 20–24; 27",
    "date_range": "May 4–10",
    "scraped_at": "2025-12-21T22:28:33.130536",
    "scraper_version": "2.0.0"
  }
}