{
  "week_number": 38,
  "date_range": "September 14–20",
  "title": "Week 38: September 14–20 - Isaiah 1–12",
  "bundle_title": "Week 38: September 14–20: \"Week 38: September 14–20 - Isaiah 1–12\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/38?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/38?lang=eng",
    "title": "Isaiah 1–12",
    "scripture_references": "Isaiah 1–12",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\nProverbs 1–4; 15–16; 22; 31; Ecclesiastes 1–3; 11–12\n\n“September 14–20. ‘God Is My Salvation’: Isaiah 1–12,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“September 14–20. ‘God Is My Salvation,’”Come, Follow Me: Old Testament 2026\n\nThe Prophet Isaiah Foretells Christ’s Birth, by Harry Anderson\n\nEven if this is your first time reading the book of Isaiah, you might find passages that sound familiar. That’s because, of all the Old Testament prophets, Isaiah is the one most often quoted in other books of scripture, including by the Savior Himself. Isaiah’s words also appear often in hymns and other sacred music.\n\nWhy is Isaiah quoted so often? Surely one reason is that Isaiah had a gift for expressing the word of God in vivid, memorable language. But it’s more than that. Isaiah has inspired prophets for generations because the truths he taught transcended his own generation (between 740 and 701 BC). He wrote of God’s great work of redemption, which is much bigger than one nation or one time period. From Isaiah, Nephi learned that he and his people, though separated from the rest of Israel, were still part of God’s covenant people. In Isaiah, New Testament writers found prophecies about the Messiah that were fulfilled right before their eyes. And in Isaiah, Joseph Smith found inspiration for the latter-day work of gathering Israel and building Zion. When you read Isaiah, what will you find?\n\nFor more about Isaiah and his writings, see “Isaiah” in the Bible Dictionary. For information about the time when Isaiah lived, see2 Kings 15–20and2 Chronicles 26–32.",
    "learning_at_home_church": [
      {
        "title": "The words of Isaiah will all be fulfilled.",
        "content": "The Savior taught that “all things that [Isaiah] spake have been and shall be, even according to the words which he spake” (3 Nephi 23:3). As you study the book of Isaiah, consider making a chart of prophecies with headings like these:Isaiah’s day,The Savior’s mortal ministry, andThe latter days. Note that many of Isaiah’s prophecies are fulfilled in more than one way (see Bible Dictionary, “Isaiah”).\n\nPresident Dallin H. Oaks taught: “The book of Isaiah contains numerous prophecies that seem to have multiple fulfillments. One seems to involve the people of Isaiah’s day or the circumstances of the next generation. Another meaning, often symbolic, seems to refer to events in the meridian of time, when Jerusalem was destroyed and her people scattered after the crucifixion of the Son of God. Still another meaning or fulfillment of the same prophecy seems to relate to the events attending the Second Coming of the Savior. The fact that many of these prophecies can have multiple meanings underscores the importance of our seeking revelation from the Holy Ghost to help us interpret them” (“Scripture Reading and Revelation,”Ensign, Jan. 1995, 8).\n\nUnderstanding Isaiah.The Savior said, “Search these things diligently; for great are the words of Isaiah” (3 Nephi 23:1; see alsoverses 2–3). Yet to many, Isaiah can be difficult to understand. The following ideas might help:\n\nPonder the symbols and metaphors Isaiah used.\n\nAsk yourself, “What am I learning about Jesus Christ?” (see1 Nephi 19:23).\n\nLook for topics that feel relevant to our time.\n\nUse study helps, such as a dictionary, the footnotes, chapter headings, and theGuide to the Scriptures.\n\nIsaiah 1;3–5"
      },
      {
        "title": "Prophets warn about sin and promise hope through repentance.",
        "content": "Like prophets in all times, Isaiah continually warned the people about their spiritual condition. As you readIsaiah 1;3;5, look for phrases that describe how the people were doing spiritually (see, for example,Isaiah 1:2–4, 21–23;3:9, 16–17;5:11–12, 20–23). What similar problems do you see in our time? You might also look for verses that warn about the consequences of the Israelites’ spiritual condition (such asIsaiah 1:7;3:17–26;5:5–7, 13–15).\n\nIn addition to warnings, Isaiah gave messages of hope for redemption through the Savior (see, for example,Isaiah 1:16–19, 25–27;3:10;4). What do you learn about the Lord from these messages? How is the Lord’s message in these verses different from what Satan wants us to believe?\n\nLike Isaiah, prophets today warn us about sin and its consequences, and they provide messages of hope through Jesus Christ. What examples can you think of? You might want to review a message from a past general conference, looking for such warnings and promises.\n\nIsaiah 2;4;11–12"
      },
      {
        "title": "God will do a great work in the latter days.",
        "content": "Many of Isaiah’s prophecies have specific meaning for our day. To find them, look for future-tense verbs (such as “shall be” or “shall go”). For example, look for these verbs as you readIsaiah 2;4;11–12. You might even try replacing them with present-tense verbs (likeisoris going). Which prophecies are especially inspiring to you? What do you learn from these prophecies about Zion, building temples, and gathering Israel?\n\nIsaiah 2:2–3is especially relevant for Latter-day Saints. How are these prophecies being fulfilled? What do you learn about the Lord’s “ways” and “paths” in His house? (verse 3).\n\nSee alsoIsaiah 5:26; “High on the Mountain Top,”Hymns, no. 5.\n\nIsaiah 6"
      },
      {
        "title": "Prophets are called by God.",
        "content": "InIsaiah 6, Isaiah recounted his call to be a prophet. As you read this chapter, what impresses you about Isaiah’s experience? How does this chapter influence the way you think about the Lord, His prophets, and the work they are called to do?\n\n“For unto us a child is born, unto us a son is given” (Isaiah 9:6).\n\nIsaiah 7–9"
      },
      {
        "title": "God promised to send Jesus Christ to be my Savior.",
        "content": "During Isaiah’s ministry, Israel formed an alliance with Syria to defend itself against Assyria. Israel and Syria wanted to force Ahaz, the king of Judah, to join them. But Isaiah prophesied that the alliance would fail and counseled Ahaz to trust in the Lord (Isaiah 7:7–9;8:12–13).\n\nWhile Isaiah counseled Ahaz, he made several well-known prophecies, such as those found inIsaiah 7:14;8:13–14;9:2, 6–7. Whatever these prophecies meant to Ahaz, they clearly apply to Jesus Christ (see alsoMatthew 1:21–23;4:16;21:44;Luke 1:31–33). Why is “Immanuel” a good title for the Savior? (seeMatthew 1:23). How has He been a “Counsellor” or “Prince of Peace” to you? (Isaiah 9:7). What else do you learn about the Savior from these verses?\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "Because of Jesus Christ, I can repent and be clean.",
        "content": "InIsaiah 1:2–4, you and your children could find reasons that the Lord was not happy with the people. Note the comparison with animals inverse 3—who is our “master”? How do we show that we know Him?\n\nTo visualizeIsaiah 1:16–18, you and your children could look at something bright red and something pure white. Or maybe you could work together to wash something. How do we become unclean spiritually? How does Jesus help us become clean? What do we learn about the Savior from these verses? Share with your children how you feel about Him and what He has done for you.\n\nIsaiah 2:2–4"
      },
      {
        "title": "In the temple, I learn about Jesus Christ.",
        "content": "Isaiah foresaw a time when “the mountain of the Lord’s house” would attract people from “all nations” (Isaiah 2:2). How can you help your children feel excited about going to the Lord’s house? You could invite them to draw a picture of their home. Then read togetherIsaiah 2:2, and invite them to draw a picture of “the Lord’s house,” which is a temple. ReadIsaiah 2:3together. Invite them to add to their pictures many people coming to the temple, including their families.\n\nYou could also readIsaiah 2:2–3together and identify something that inspires you and your children to go to the temple. Then, after readingIsaiah 2:4together, you could discuss how the temple brings them peace. Consider singing a song about the temple, such as “I Love to See the Temple” (Children’s Songbook, 95). Help your children find words in the song that teach what the temple is and what we do there.\n\nSalt Lake Temple\n\nIsaiah 7:14;9:6–7"
      },
      {
        "title": "Jesus Christ came to earth to be my Savior.",
        "content": "To introduce Isaiah’s prophecies of Christ, you and your children could talk about titles of people, like president, bishop, or teacher. What do these titles tell us about these people? Help your children find titles of Jesus Christ inIsaiah 7:14and9:6–7(see also this week’s activity page). What do each of these titles teach about Him? What else do we learn about Jesus Christ from these verses?\n\nYou could also share with your children “Isaiah the Prophet” (inOld Testament Stories, 150–51). Pause periodically to ask what Isaiah knew about Jesus Christ many years before He was born. You can then useMatthew 1:21–23;Luke 1:31–33to talk about how Isaiah’s prophecies inIsaiah 7:14;9:6–7were fulfilled.\n\nIsaiah the Prophet\n\nFor more, see this month’s issue of theFriendmagazine.\n\nIsaiah taught that the temple would be “a place of refuge” and “a covert from storm and from rain” (Isaiah 4:6). Idaho Falls Idaho Temple"
      }
    ],
    "study_helps": [],
    "raw_text": "September 14–20. “God Is My Salvation”: Isaiah 1–12\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nAugust 31–September 6\nPsalms 102–3; 110; 116–19; 127–28; 135–39; 146–50\nSeptember 7–13\nProverbs 1–4; 15–16; 22; 31; Ecclesiastes 1–3; 11–12\nThoughts to Keep in Mind\nProphets and Prophecy\nSeptember 14–20\nIsaiah 1–12\nSeptember 21–27\nIsaiah 13–14; 22; 24–30; 35\nOctober\nNovember\nDecember\nAppendixes\nSeptember 14–20. “God Is My Salvation”: Isaiah 1–12\n“September 14–20. ‘God Is My Salvation’: Isaiah 1–12,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“September 14–20. ‘God Is My Salvation,’”\nCome, Follow Me: Old Testament 2026\nThe Prophet Isaiah Foretells Christ’s Birth\n, by Harry Anderson\nSeptember 14–20: “God Is My Salvation”\nIsaiah 1–12\nEven if this is your first time reading the book of Isaiah, you might find passages that sound familiar. That’s because, of all the Old Testament prophets, Isaiah is the one most often quoted in other books of scripture, including by the Savior Himself. Isaiah’s words also appear often in hymns and other sacred music.\nWhy is Isaiah quoted so often? Surely one reason is that Isaiah had a gift for expressing the word of God in vivid, memorable language. But it’s more than that. Isaiah has inspired prophets for generations because the truths he taught transcended his own generation (between 740 and 701 BC). He wrote of God’s great work of redemption, which is much bigger than one nation or one time period. From Isaiah, Nephi learned that he and his people, though separated from the rest of Israel, were still part of God’s covenant people. In Isaiah, New Testament writers found prophecies about the Messiah that were fulfilled right before their eyes. And in Isaiah, Joseph Smith found inspiration for the latter-day work of gathering Israel and building Zion. When you read Isaiah, what will you find?\nFor more about Isaiah and his writings, see “\nIsaiah\n” in the Bible Dictionary. For information about the time when Isaiah lived, see\n2 Kings 15–20\nand\n2 Chronicles 26–32\n.\nIdeas for Learning at Home and at Church\nIsaiah 1–12\nThe words of Isaiah will all be fulfilled.\nThe Savior taught that “all things that [Isaiah] spake have been and shall be, even according to the words which he spake” (\n3 Nephi 23:3\n). As you study the book of Isaiah, consider making a chart of prophecies with headings like these:\nIsaiah’s day\n,\nThe Savior’s mortal ministry\n, and\nThe latter days\n. Note that many of Isaiah’s prophecies are fulfilled in more than one way (see Bible Dictionary, “\nIsaiah\n”).\nPresident Dallin H. Oaks taught: “The book of Isaiah contains numerous prophecies that seem to have multiple fulfillments. One seems to involve the people of Isaiah’s day or the circumstances of the next generation. Another meaning, often symbolic, seems to refer to events in the meridian of time, when Jerusalem was destroyed and her people scattered after the crucifixion of the Son of God. Still another meaning or fulfillment of the same prophecy seems to relate to the events attending the Second Coming of the Savior. The fact that many of these prophecies can have multiple meanings underscores the importance of our seeking revelation from the Holy Ghost to help us interpret them” (“\nScripture Reading and Revelation\n,”\nEnsign\n, Jan. 1995, 8).\nUnderstanding Isaiah.\nThe Savior said, “Search these things diligently; for great are the words of Isaiah” (\n3 Nephi 23:1\n; see also\nverses 2–3\n). Yet to many, Isaiah can be difficult to understand. The following ideas might help:\nPonder the symbols and metaphors Isaiah used.\nAsk yourself, “What am I learning about Jesus Christ?” (see\n1 Nephi 19:23\n).\nLook for topics that feel relevant to our time.\nUse study helps, such as a dictionary, the footnotes, chapter headings, and the\nGuide to the Scriptures\n.\nIsaiah 1\n;\n3–5\nProphets warn about sin and promise hope through repentance.\nLike prophets in all times, Isaiah continually warned the people about their spiritual condition. As you read\nIsaiah 1\n;\n3\n;\n5\n, look for phrases that describe how the people were doing spiritually (see, for example,\nIsaiah 1:2–4, 21–23\n;\n3:9, 16–17\n;\n5:11–12, 20–23\n). What similar problems do you see in our time? You might also look for verses that warn about the consequences of the Israelites’ spiritual condition (such as\nIsaiah 1:7\n;\n3:17–26\n;\n5:5–7, 13–15\n).\nIn addition to warnings, Isaiah gave messages of hope for redemption through the Savior (see, for example,\nIsaiah 1:16–19, 25–27\n;\n3:10\n;\n4\n). What do you learn about the Lord from these messages? How is the Lord’s message in these verses different from what Satan wants us to believe?\nLike Isaiah, prophets today warn us about sin and its consequences, and they provide messages of hope through Jesus Christ. What examples can you think of? You might want to review a message from a past general conference, looking for such warnings and promises.\nIsaiah 2\n;\n4\n;\n11–12\nGod will do a great work in the latter days.\nMany of Isaiah’s prophecies have specific meaning for our day. To find them, look for future-tense verbs (such as “shall be” or “shall go”). For example, look for these verbs as you read\nIsaiah 2\n;\n4\n;\n11–12\n. You might even try replacing them with present-tense verbs (like\nis\nor\nis going\n). Which prophecies are especially inspiring to you? What do you learn from these prophecies about Zion, building temples, and gathering Israel?\nIsaiah 2:2–3\nis especially relevant for Latter-day Saints. How are these prophecies being fulfilled? What do you learn about the Lord’s “ways” and “paths” in His house? (\nverse 3\n).\nSee also\nIsaiah 5:26\n; “\nHigh on the Mountain Top\n,”\nHymns\n, no. 5.\nIsaiah 6\nProphets are called by God.\nIn\nIsaiah 6\n, Isaiah recounted his call to be a prophet. As you read this chapter, what impresses you about Isaiah’s experience? How does this chapter influence the way you think about the Lord, His prophets, and the work they are called to do?\n“For unto us a child is born, unto us a son is given” (\nIsaiah 9:6\n).\nIsaiah 7–9\nGod promised to send Jesus Christ to be my Savior.\nDuring Isaiah’s ministry, Israel formed an alliance with Syria to defend itself against Assyria. Israel and Syria wanted to force Ahaz, the king of Judah, to join them. But Isaiah prophesied that the alliance would fail and counseled Ahaz to trust in the Lord (\nIsaiah 7:7–9\n;\n8:12–13\n).\nWhile Isaiah counseled Ahaz, he made several well-known prophecies, such as those found in\nIsaiah 7:14\n;\n8:13–14\n;\n9:2, 6–7\n. Whatever these prophecies meant to Ahaz, they clearly apply to Jesus Christ (see also\nMatthew 1:21–23\n;\n4:16\n;\n21:44\n;\nLuke 1:31–33\n). Why is “Immanuel” a good title for the Savior? (see\nMatthew 1:23\n). How has He been a “Counsellor” or “Prince of Peace” to you? (\nIsaiah 9:7\n). What else do you learn about the Savior from these verses?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 1:2–4, 16–19\nBecause of Jesus Christ, I can repent and be clean.\nIn\nIsaiah 1:2–4\n, you and your children could find reasons that the Lord was not happy with the people. Note the comparison with animals in\nverse 3\n—who is our “master”? How do we show that we know Him?\nTo visualize\nIsaiah 1:16–18\n, you and your children could look at something bright red and something pure white. Or maybe you could work together to wash something. How do we become unclean spiritually? How does Jesus help us become clean? What do we learn about the Savior from these verses? Share with your children how you feel about Him and what He has done for you.\nIsaiah 2:2–4\nIn the temple, I learn about Jesus Christ.\nIsaiah foresaw a time when “the mountain of the Lord’s house” would attract people from “all nations” (\nIsaiah 2:2\n). How can you help your children feel excited about going to the Lord’s house? You could invite them to draw a picture of their home. Then read together\nIsaiah 2:2\n, and invite them to draw a picture of “the Lord’s house,” which is a temple. Read\nIsaiah 2:3\ntogether. Invite them to add to their pictures many people coming to the temple, including their families.\nYou could also read\nIsaiah 2:2–3\ntogether and identify something that inspires you and your children to go to the temple. Then, after reading\nIsaiah 2:4\ntogether, you could discuss how the temple brings them peace. Consider singing a song about the temple, such as “\nI Love to See the Temple\n” (\nChildren’s Songbook\n, 95). Help your children find words in the song that teach what the temple is and what we do there.\nSalt Lake Temple\nIsaiah 7:14\n;\n9:6–7\nJesus Christ came to earth to be my Savior.\nTo introduce Isaiah’s prophecies of Christ, you and your children could talk about titles of people, like president, bishop, or teacher. What do these titles tell us about these people? Help your children find titles of Jesus Christ in\nIsaiah 7:14\nand\n9:6–7\n(see also this week’s activity page). What do each of these titles teach about Him? What else do we learn about Jesus Christ from these verses?\nYou could also share with your children “\nIsaiah the Prophet\n” (in\nOld Testament Stories\n, 150–51). Pause periodically to ask what Isaiah knew about Jesus Christ many years before He was born. You can then use\nMatthew 1:21–23\n;\nLuke 1:31–33\nto talk about how Isaiah’s prophecies in\nIsaiah 7:14\n;\n9:6–7\nwere fulfilled.\n1:18\nIsaiah the Prophet\nFor more, see this month’s issue of the\nFriend\nmagazine.\nIsaiah taught that the temple would be “a place of refuge” and “a covert from storm and from rain” (\nIsaiah 4:6\n). Idaho Falls Idaho Temple\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Isaiah 1",
      "title": "The Book of the ProphetIsaiah",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/1?lang=eng",
      "summary": "The people of Israel are apostate, rebellious, and corrupt; only a few remain faithfulâThe peopleâs sacrifices and feasts are rejectedâThey are called upon to repent and work righteousnessâZion will be redeemed in the day of restoration.",
      "verses": [
        "1ThevisionofIsaiahthe son of Amoz, which he saw concerningJudahand Jerusalem in the days ofUzziah,Jotham,Ahaz,andHezekiah, kings of Judah.",
        "2Hear, O heavens, and give ear, O earth: for theLordhath spoken, I have nourished and brought up children, and they haverebelledagainst me.",
        "3The ox knoweth his owner, and the ass his masterâscrib:butIsrael doth notknow, my people doth not consider.",
        "4Ahsinfulnation, a people laden with iniquity, a seed of evildoers,childrenthat arecorrupters: they have forsaken theLord, they have provoked the Holy One of Israel untoanger, they are gone away backward.",
        "5Â¶Why should ye bestrickenany more? ye willrevoltmore and more: the whole head is sick, and the whole heartfaint.",
        "6From the sole of the foot even unto the headthere isno soundness in it;butwounds, and bruises, and putrifying sores: they have not beenclosed, neither bound up, neithermollifiedwith ointment.",
        "7Yourcountryisdesolate, your citiesareburned with fire: your land,strangersdevour it in your presence, andit isdesolate, as overthrown by strangers.",
        "8And the daughter of Zion is left as a cottage in avineyard, asalodge in a garden of cucumbers, as a besieged city.",
        "9Except theLordof hosts had left unto us a very smallremnant, we should have been as Sodom,andwe should have been like unto Gomorrah.",
        "10Â¶Hear the word of theLord, ye rulers ofSodom; give ear unto the law of our God, ye people of Gomorrah.",
        "11To what purposeisthe multitude of yoursacrificesunto me? saith theLord: I am full of the burnt offerings of rams, and the fat of fed beasts; and Idelightnot in the blood of bullocks, or of lambs, or of he goats.",
        "12When ye come to appear before me, who hath required this at your hand, to tread my courts?",
        "13Bring no morevainoblations; incense is an abomination unto me; the new moons andsabbaths, the calling ofassemblies, I cannotaway with;it isiniquity, even thesolemn meeting.",
        "14Your newmoonsand your appointedfeastsmy soul hateth: they are a trouble unto me; I amwearyto bearthem.",
        "15And when ye spread forth your hands, I will hide mine eyes from you: yea, when ye make manyprayers, I will not hear: your hands are full ofblood.",
        "16Â¶Washyou, make youclean; put away theevilof your doings from before mine eyes;ceaseto do evil;",
        "17Learnto dowell; seekjudgment,relievethe oppressed,judge the fatherless, plead for thewidow.",
        "18Come now, and let usreasontogether, saith theLord: though yoursinsbe as scarlet, they shall be aswhiteas snow; though they be red like crimson, they shall be as wool.",
        "19If ye bewillingandobedient, ye shall eat thegoodof the land:",
        "20But if ye refuse andrebel, ye shall bedevouredwith the sword: for the mouth of theLordhath spokenit.",
        "21Â¶How is the faithful city become anharlot! it was full ofjudgment; righteousness lodged in it; but now murderers.",
        "22Thy silver is becomedross, thy wine mixed with water:",
        "23Thyprincesarerebellious, andcompanions of thieves: every one lovethgifts, and followeth after rewards: theyjudge notthe fatherless, neither doth the cause of the widow come unto them.",
        "24Therefore saith the Lord, theLordof hosts, the mighty One of Israel, Ah, I will ease me of mineadversaries, and avenge me of mine enemies:",
        "25Â¶And I willturn my hand uponthee, and purelypurgeaway thy dross, and take away all thy tin:",
        "26And I willrestorethy judges as at the first, and thycounsellorsas at the beginning: afterward thou shalt be called, Thecity of righteousness, the faithful city.",
        "27Zionshall be redeemed withjudgment, and herconvertswith righteousness.",
        "28Â¶And the destruction of the transgressors and of the sinnersshall betogether, and they that forsake theLordshall be consumed.",
        "29For they shall be ashamed of theoakswhich ye have desired, and ye shall be confounded for the gardens that ye have chosen.",
        "30For ye shall be as an oak whose leaf fadeth, and as a garden that hath no water.",
        "31And the strong shall beas tow, and the maker of it as a spark, and they shall bothburntogether, and none shall quenchthem."
      ],
      "full_text": "1ThevisionofIsaiahthe son of Amoz, which he saw concerningJudahand Jerusalem in the days ofUzziah,Jotham,Ahaz,andHezekiah, kings of Judah. 2Hear, O heavens, and give ear, O earth: for theLordhath spoken, I have nourished and brought up children, and they haverebelledagainst me. 3The ox knoweth his owner, and the ass his masterâscrib:butIsrael doth notknow, my people doth not consider. 4Ahsinfulnation, a people laden with iniquity, a seed of evildoers,childrenthat arecorrupters: they have forsaken theLord, they have provoked the Holy One of Israel untoanger, they are gone away backward. 5Â¶Why should ye bestrickenany more? ye willrevoltmore and more: the whole head is sick, and the whole heartfaint. 6From the sole of the foot even unto the headthere isno soundness in it;butwounds, and bruises, and putrifying sores: they have not beenclosed, neither bound up, neithermollifiedwith ointment. 7Yourcountryisdesolate, your citiesareburned with fire: your land,strangersdevour it in your presence, andit isdesolate, as overthrown by strangers. 8And the daughter of Zion is left as a cottage in avineyard, asalodge in a garden of cucumbers, as a besieged city. 9Except theLordof hosts had left unto us a very smallremnant, we should have been as Sodom,andwe should have been like unto Gomorrah. 10Â¶Hear the word of theLord, ye rulers ofSodom; give ear unto the law of our God, ye people of Gomorrah. 11To what purposeisthe multitude of yoursacrificesunto me? saith theLord: I am full of the burnt offerings of rams, and the fat of fed beasts; and Idelightnot in the blood of bullocks, or of lambs, or of he goats. 12When ye come to appear before me, who hath required this at your hand, to tread my courts? 13Bring no morevainoblations; incense is an abomination unto me; the new moons andsabbaths, the calling ofassemblies, I cannotaway with;it isiniquity, even thesolemn meeting. 14Your newmoonsand your appointedfeastsmy soul hateth: they are a trouble unto me; I amwearyto bearthem. 15And when ye spread forth your hands, I will hide mine eyes from you: yea, when ye make manyprayers, I will not hear: your hands are full ofblood. 16Â¶Washyou, make youclean; put away theevilof your doings from before mine eyes;ceaseto do evil; 17Learnto dowell; seekjudgment,relievethe oppressed,judge the fatherless, plead for thewidow. 18Come now, and let usreasontogether, saith theLord: though yoursinsbe as scarlet, they shall be aswhiteas snow; though they be red like crimson, they shall be as wool. 19If ye bewillingandobedient, ye shall eat thegoodof the land: 20But if ye refuse andrebel, ye shall bedevouredwith the sword: for the mouth of theLordhath spokenit. 21Â¶How is the faithful city become anharlot! it was full ofjudgment; righteousness lodged in it; but now murderers. 22Thy silver is becomedross, thy wine mixed with water: 23Thyprincesarerebellious, andcompanions of thieves: every one lovethgifts, and followeth after rewards: theyjudge notthe fatherless, neither doth the cause of the widow come unto them. 24Therefore saith the Lord, theLordof hosts, the mighty One of Israel, Ah, I will ease me of mineadversaries, and avenge me of mine enemies: 25Â¶And I willturn my hand uponthee, and purelypurgeaway thy dross, and take away all thy tin: 26And I willrestorethy judges as at the first, and thycounsellorsas at the beginning: afterward thou shalt be called, Thecity of righteousness, the faithful city. 27Zionshall be redeemed withjudgment, and herconvertswith righteousness. 28Â¶And the destruction of the transgressors and of the sinnersshall betogether, and they that forsake theLordshall be consumed. 29For they shall be ashamed of theoakswhich ye have desired, and ye shall be confounded for the gardens that ye have chosen. 30For ye shall be as an oak whose leaf fadeth, and as a garden that hath no water. 31And the strong shall beas tow, and the maker of it as a spark, and they shall bothburntogether, and none shall quenchthem."
    },
    {
      "reference": "Isaiah 2",
      "title": "Isaiah 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/2?lang=eng",
      "summary": "Isaiah sees the latter-day temple, gathering of Israel, and millennial judgment and peaceâThe proud and wicked will be brought low at the Second ComingâCompare2Â Nephi 12.",
      "verses": [
        "1The word thatIsaiahthe son of Amozsawconcerning Judah and Jerusalem.",
        "2And it shall come to pass in thelast days,thatthemountainof theLordâshouseshall beestablishedin the top of the mountains, and shall be exalted above the hills; and allnationsshall flow unto it.",
        "3And many people shall go and say, Come ye, and let usgoup to themountainof theLord, to thehouseof the God of Jacob; and he willteachus of his ways, and we will walk in his paths: for out ofZionshall go forth thelaw, and the word of theLordfrom Jerusalem.",
        "4And he shalljudgeamong the nations, and shall rebuke many people: and they shall beat their swords into plowshares, and their spears into pruninghooks: nation shall not lift up sword against nation, neither shall they learnwarany more.",
        "5O house of Jacob, come ye, and let uswalkin thelightof theLord.",
        "6Â¶Therefore thou hast forsakenthy people the house of Jacob, because theybereplenished from the east, andaresoothsayerslike the Philistines, and theyplease themselves inthe children of strangers.",
        "7Their land also is full of silver and gold, neitheris there anyend of their treasures; their land is also full of horses, neitheris there anyend of their chariots:",
        "8Their land also is full ofidols; theyworshipthe work of their own hands, that which their own fingers have made:",
        "9And themean manbowethdown, and the great man humbleth himself: therefore forgive them not.",
        "10Â¶Enter into the rock, and hide thee in the dust, for fear of theLord, and for the glory of his majesty.",
        "11The lofty looks of man shall be humbled, and the haughtiness of men shall be bowed down, and theLordalone shall beexaltedin thatday.",
        "12For thedayof theLordof hostsshall beupon everyone that isproudand lofty, and upon everyone that islifted up; and he shall be broughtlow:",
        "13And upon all thecedarsof Lebanon,that arehigh and lifted up, and upon all the oaks of Bashan,",
        "14And upon all the high mountains, and upon all the hillsthat arelifted up,",
        "15And upon every high tower, and upon every fenced wall,",
        "16Andupon all the ships of Tarshish, and upon all pleasant pictures.",
        "17And the loftiness of man shall be bowed down, and thehaughtinessof men shall be made low: and theLordalone shall be exalted in that day.",
        "18And theidolshe shall utterly abolish.",
        "19And they shall go into theholesof the rocks, and into the caves of the earth, forfearof theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth.",
        "20In that day a man shallcasthis idols of silver, and his idols of gold, which they madeeach onefor himself to worship, to the moles and to the bats;",
        "21To go into the clefts of the rocks, and into the tops of the ragged rocks, for fear of theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth.",
        "22Ceaseye from man, whose breathisin his nostrils: forwhereinis he to be accounted of?"
      ],
      "full_text": "1The word thatIsaiahthe son of Amozsawconcerning Judah and Jerusalem. 2And it shall come to pass in thelast days,thatthemountainof theLordâshouseshall beestablishedin the top of the mountains, and shall be exalted above the hills; and allnationsshall flow unto it. 3And many people shall go and say, Come ye, and let usgoup to themountainof theLord, to thehouseof the God of Jacob; and he willteachus of his ways, and we will walk in his paths: for out ofZionshall go forth thelaw, and the word of theLordfrom Jerusalem. 4And he shalljudgeamong the nations, and shall rebuke many people: and they shall beat their swords into plowshares, and their spears into pruninghooks: nation shall not lift up sword against nation, neither shall they learnwarany more. 5O house of Jacob, come ye, and let uswalkin thelightof theLord. 6Â¶Therefore thou hast forsakenthy people the house of Jacob, because theybereplenished from the east, andaresoothsayerslike the Philistines, and theyplease themselves inthe children of strangers. 7Their land also is full of silver and gold, neitheris there anyend of their treasures; their land is also full of horses, neitheris there anyend of their chariots: 8Their land also is full ofidols; theyworshipthe work of their own hands, that which their own fingers have made: 9And themean manbowethdown, and the great man humbleth himself: therefore forgive them not. 10Â¶Enter into the rock, and hide thee in the dust, for fear of theLord, and for the glory of his majesty. 11The lofty looks of man shall be humbled, and the haughtiness of men shall be bowed down, and theLordalone shall beexaltedin thatday. 12For thedayof theLordof hostsshall beupon everyone that isproudand lofty, and upon everyone that islifted up; and he shall be broughtlow: 13And upon all thecedarsof Lebanon,that arehigh and lifted up, and upon all the oaks of Bashan, 14And upon all the high mountains, and upon all the hillsthat arelifted up, 15And upon every high tower, and upon every fenced wall, 16Andupon all the ships of Tarshish, and upon all pleasant pictures. 17And the loftiness of man shall be bowed down, and thehaughtinessof men shall be made low: and theLordalone shall be exalted in that day. 18And theidolshe shall utterly abolish. 19And they shall go into theholesof the rocks, and into the caves of the earth, forfearof theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth. 20In that day a man shallcasthis idols of silver, and his idols of gold, which they madeeach onefor himself to worship, to the moles and to the bats; 21To go into the clefts of the rocks, and into the tops of the ragged rocks, for fear of theLord, and for the glory of his majesty, when he ariseth to shake terribly the earth. 22Ceaseye from man, whose breathisin his nostrils: forwhereinis he to be accounted of?"
    },
    {
      "reference": "Isaiah 3",
      "title": "Isaiah 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/3?lang=eng",
      "summary": "Judah and Jerusalem will be punished for their disobedienceâThe Lord pleads for and judges His peopleâThe daughters of Zion are cursed and tormented for their worldlinessâCompare2Â Nephi 13.",
      "verses": [
        "1For, behold, the Lord, theLordof hosts, doth take away fromJerusalemand from Judah the stay and the staff, the whole stay ofbread, and the whole stay of water,",
        "2The mighty man, and the man ofwar, the judge, and the prophet, and the prudent, and theancient,",
        "3The captain of fifty, and the honourable man, and the counsellor, andthe cunning artificer, and theeloquent orator.",
        "4And I will givechildrento betheir princes, and babes shall rule over them.",
        "5And the people shall be oppressed, every one by another, and every one by his neighbour: the child shall behave himself proudly against theancient, and the base against the honourable.",
        "6When a man shall take hold of his brother of the house of his father,saying,Thou hast clothing, be thou our ruler, andletthisruinbeunder thy hand:",
        "7In that day shall he swear, saying, I will not bean healer; for in my houseisneither bread nor clothing: make me not a ruler of the people.",
        "8ForJerusalemis ruined, and Judah isfallen: because their tongue and their doingsareagainst theLord, to provoke the eyes of his glory.",
        "9Â¶The shew of their countenance doth witness against them; and they declare theirsinasSodom, they hideitnot. Woe unto their soul! for they have rewarded evil unto themselves.",
        "10Say ye to therighteous, thatit shall bewellwith him:for they shalleatthe fruit of their doings.",
        "11Woe unto thewicked!it shall beillwith him:forthereward of his hands shall be given him.",
        "12Â¶As formy people, childrenaretheir oppressors, andwomenrule over them. O my people, they whichleadthee causetheeto err, and destroy the way of thy paths.",
        "13TheLordstandeth up toplead, and standeth to judge the people.",
        "14TheLordwill enter intojudgmentwith theancientsof his people, and theprincesthereof: for ye haveeaten upthe vineyard; thespoilof thepoorisin your houses.",
        "15What mean yethatyebeatmy people to pieces, and grind the faces of the poor? saith the LordGodof hosts.",
        "16Â¶Moreover theLordsaith, Because thedaughtersof Zion arehaughty, andwalkwith stretched forth necks andwantoneyes, walking andmincingasthey go, and making a tinkling with their feet:",
        "17Therefore the Lord will smite with a scab the crown of the head of the daughters of Zion, and theLordwilldiscover their secret parts.",
        "18In that day the Lord will take away the bravery oftheirtinkling ornamentsabout their feet,andtheircauls, andtheirroundtires like the moon,",
        "19The chains, and the bracelets, and themufflers,",
        "20The bonnets, and the ornaments of the legs, and the headbands, and the tablets, and the earrings,",
        "21The rings, and nose jewels,",
        "22Thechangeable suitsofapparel, and the mantles, and the wimples, and the crisping pins,",
        "23Theglasses, and the fine linen, and the hoods, and the veils.",
        "24And it shall come to pass,thatinstead of sweet smell there shall be stink; and instead of a girdlea rent; and instead of well set hairbaldness; and instead ofa stomachera girding of sackcloth;andburninginstead ofbeauty.",
        "25Thymenshall fall by the sword, and thy mighty in the war.",
        "26And hergatesshalllamentandmourn; and shebeingdesolateshall sit upon theground."
      ],
      "full_text": "1For, behold, the Lord, theLordof hosts, doth take away fromJerusalemand from Judah the stay and the staff, the whole stay ofbread, and the whole stay of water, 2The mighty man, and the man ofwar, the judge, and the prophet, and the prudent, and theancient, 3The captain of fifty, and the honourable man, and the counsellor, andthe cunning artificer, and theeloquent orator. 4And I will givechildrento betheir princes, and babes shall rule over them. 5And the people shall be oppressed, every one by another, and every one by his neighbour: the child shall behave himself proudly against theancient, and the base against the honourable. 6When a man shall take hold of his brother of the house of his father,saying,Thou hast clothing, be thou our ruler, andletthisruinbeunder thy hand: 7In that day shall he swear, saying, I will not bean healer; for in my houseisneither bread nor clothing: make me not a ruler of the people. 8ForJerusalemis ruined, and Judah isfallen: because their tongue and their doingsareagainst theLord, to provoke the eyes of his glory. 9Â¶The shew of their countenance doth witness against them; and they declare theirsinasSodom, they hideitnot. Woe unto their soul! for they have rewarded evil unto themselves. 10Say ye to therighteous, thatit shall bewellwith him:for they shalleatthe fruit of their doings. 11Woe unto thewicked!it shall beillwith him:forthereward of his hands shall be given him. 12Â¶As formy people, childrenaretheir oppressors, andwomenrule over them. O my people, they whichleadthee causetheeto err, and destroy the way of thy paths. 13TheLordstandeth up toplead, and standeth to judge the people. 14TheLordwill enter intojudgmentwith theancientsof his people, and theprincesthereof: for ye haveeaten upthe vineyard; thespoilof thepoorisin your houses. 15What mean yethatyebeatmy people to pieces, and grind the faces of the poor? saith the LordGodof hosts. 16Â¶Moreover theLordsaith, Because thedaughtersof Zion arehaughty, andwalkwith stretched forth necks andwantoneyes, walking andmincingasthey go, and making a tinkling with their feet: 17Therefore the Lord will smite with a scab the crown of the head of the daughters of Zion, and theLordwilldiscover their secret parts. 18In that day the Lord will take away the bravery oftheirtinkling ornamentsabout their feet,andtheircauls, andtheirroundtires like the moon, 19The chains, and the bracelets, and themufflers, 20The bonnets, and the ornaments of the legs, and the headbands, and the tablets, and the earrings, 21The rings, and nose jewels, 22Thechangeable suitsofapparel, and the mantles, and the wimples, and the crisping pins, 23Theglasses, and the fine linen, and the hoods, and the veils. 24And it shall come to pass,thatinstead of sweet smell there shall be stink; and instead of a girdlea rent; and instead of well set hairbaldness; and instead ofa stomachera girding of sackcloth;andburninginstead ofbeauty. 25Thymenshall fall by the sword, and thy mighty in the war. 26And hergatesshalllamentandmourn; and shebeingdesolateshall sit upon theground."
    },
    {
      "reference": "Isaiah 4",
      "title": "Isaiah 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/4?lang=eng",
      "summary": "Zion and her daughters will be redeemed and cleansed in the millennial dayâCompare2Â Nephi 14.",
      "verses": [
        "1And in that daysevenwomen shall take hold of oneman, saying, We will eat our own bread, and wear our own apparel: only let us be called by thyname, to take away ourreproach.",
        "2In that day shall thebranchof theLordbebeautifuland glorious, and thefruitof the earthshall beexcellent and comely for them that areescapedof Israel.",
        "3And it shall come to pass,that he that isleftinZion, andhe thatremaineth inJerusalem, shall be called holy,evenevery one that iswritten among the livingin Jerusalem:",
        "4Whenthe Lord shall havewashedaway the filth of the daughters of Zion, and shall havepurgedthe blood of Jerusalem from the midst thereof by the spirit of judgment, and by the spirit ofburning.",
        "5And theLordwill create upon every dwelling place of mountZion, and upon her assemblies, acloudand smoke by day, and the shining of a flamingfireby night: for upon all the gloryshall bea defence.",
        "6And there shall be a tabernacle for a shadow in the daytime from the heat, and for a place ofrefuge, and for a covert from storm and from rain."
      ],
      "full_text": "1And in that daysevenwomen shall take hold of oneman, saying, We will eat our own bread, and wear our own apparel: only let us be called by thyname, to take away ourreproach. 2In that day shall thebranchof theLordbebeautifuland glorious, and thefruitof the earthshall beexcellent and comely for them that areescapedof Israel. 3And it shall come to pass,that he that isleftinZion, andhe thatremaineth inJerusalem, shall be called holy,evenevery one that iswritten among the livingin Jerusalem: 4Whenthe Lord shall havewashedaway the filth of the daughters of Zion, and shall havepurgedthe blood of Jerusalem from the midst thereof by the spirit of judgment, and by the spirit ofburning. 5And theLordwill create upon every dwelling place of mountZion, and upon her assemblies, acloudand smoke by day, and the shining of a flamingfireby night: for upon all the gloryshall bea defence. 6And there shall be a tabernacle for a shadow in the daytime from the heat, and for a place ofrefuge, and for a covert from storm and from rain."
    },
    {
      "reference": "Isaiah 5",
      "title": "Isaiah 5",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/5?lang=eng",
      "summary": "The Lordâs vineyard (Israel) will become desolate, and His people will be scatteredâWoes will come upon them in their apostate and scattered stateâThe Lord will lift an ensign and gather IsraelâCompare2Â Nephi 15.",
      "verses": [
        "1Nowwill Isingto my wellbeloved a song of my beloved touching hisvineyard. My wellbeloved hath a vineyardina very fruitful hill:",
        "2And he fenced it, and gathered out the stones thereof, and planted it with the choicest vine, and built a tower in the midst of it, and also made a winepress therein: and he looked that it should bring forth grapes, and it brought forth wild grapes.",
        "3And now, O inhabitants of Jerusalem, and men of Judah, judge, I pray you, betwixt me and my vineyard.",
        "4What could have been done more to my vineyard, that I have not done in it? wherefore, when I looked that it should bring forth grapes, brought it forthwild grapes?",
        "5And now go to; I will tell you what I will do to myvineyard: I willtake awaythe hedge thereof, and it shall be eaten up;andbreak down thewallthereof, and it shall be trodden down:",
        "6And I will lay it waste: it shall not be pruned, nor digged; but there shall come up briers and thorns: I will also command the clouds that they rain no rain upon it.",
        "7For thevineyardof theLordof hostsisthe house of Israel, and the men of Judah his pleasant plant: and he looked forjudgment, but behold oppression; for righteousness, but beholda cry.",
        "8Â¶Woe unto them thatjoinhouse to house,thatlay field to field, tillthere beno place, that they maybe placed alonein the midst of the earth!",
        "9In mine earssaidtheLordof hosts, Of a truth many houses shall be desolate,evengreat and fair, without inhabitant.",
        "10Yea, ten acres of vineyard shall yield onebath, and the seed of an homer shall yield an ephah.",
        "11Â¶Woe unto them that rise up early in the morning,thatthey may follow strong drink; that continue until night,tillwineinflame them!",
        "12And the harp, and theviol, thetabret, and pipe, and wine, are in their feasts: but theyregardnot theworkof theLord, neither consider the operation of his hands.",
        "13Â¶Therefore my people are gone intocaptivity, becausethey havenoknowledge: and their honourable menarefamished, and their multitude dried up with thirst.",
        "14Therefore hell hath enlarged herself, and opened her mouth without measure: and their glory, and their multitude, and theirpomp, and he that rejoiceth, shall descend into it.",
        "15And the mean man shall be brought down, and the mighty man shall be humbled, and the eyes of theloftyshall be humbled:",
        "16But theLordof hosts shall be exalted injudgment, and God that isholyshall be sanctified in righteousness.",
        "17Then shall the lambs feed after their manner, and the waste places of the fat ones shall strangers eat.",
        "18Woe unto them thatdrawiniquity with cords ofvanity, and sinasit were with a cart rope:",
        "19That say,Lethim makespeed,andhastenhis work, that we mayseeit:and let the counsel of the Holy One of Israel draw nigh and come, that we may knowit!",
        "20Â¶Woe unto them that callevilgood, and good evil; that putdarknessforlight, and light for darkness; that put bitter for sweet, and sweet for bitter!",
        "21Woe untothem that arewisein their owneyes, andprudentin their own sight!",
        "22Woe untothem that aremighty todrinkwine, and men of strength to mingle strong drink:",
        "23Whichjustifythewickedfor reward, andtakeaway the righteousness of the righteous from him!",
        "24Therefore as the fire devoureth thestubble, and the flame consumeth the chaff,sotheirrootshall be as rottenness, and their blossom shall go up as dust: because they have cast away the law of theLordof hosts, and despised the word of the Holy One of Israel.",
        "25Therefore is theangerof theLordkindled against his people, and he hathstretchedforth his hand against them, and hath smitten them: and the hills did tremble, and their carcasesweretorn in the midst of the streets. For all this his anger is not turned away, but his handisstretched out still.",
        "26Â¶And he will lift up anensignto the nations from far, and willhissunto them from theendof the earth: and, behold, they shallcomewith speed swiftly:",
        "27None shall be weary nor stumble among them; none shall slumber nor sleep; neither shall the girdle of their loins be loosed, nor the latchet of their shoes be broken:",
        "28Whose arrowsaresharp, and all their bows bent, their horsesâ hoofs shall be counted like flint, and their wheels like a whirlwind:",
        "29Their roaringshall belike a lion, they shall roar like younglions: yea, they shall roar, and lay hold of theprey, and shall carryitaway safe, and none shall deliverit.",
        "30And in that day they shall roar against them like the roaring of the sea: and ifonelook unto the land, behold darknessandsorrow, and thelightisdarkenedin the heavens thereof."
      ],
      "full_text": "1Nowwill Isingto my wellbeloved a song of my beloved touching hisvineyard. My wellbeloved hath a vineyardina very fruitful hill: 2And he fenced it, and gathered out the stones thereof, and planted it with the choicest vine, and built a tower in the midst of it, and also made a winepress therein: and he looked that it should bring forth grapes, and it brought forth wild grapes. 3And now, O inhabitants of Jerusalem, and men of Judah, judge, I pray you, betwixt me and my vineyard. 4What could have been done more to my vineyard, that I have not done in it? wherefore, when I looked that it should bring forth grapes, brought it forthwild grapes? 5And now go to; I will tell you what I will do to myvineyard: I willtake awaythe hedge thereof, and it shall be eaten up;andbreak down thewallthereof, and it shall be trodden down: 6And I will lay it waste: it shall not be pruned, nor digged; but there shall come up briers and thorns: I will also command the clouds that they rain no rain upon it. 7For thevineyardof theLordof hostsisthe house of Israel, and the men of Judah his pleasant plant: and he looked forjudgment, but behold oppression; for righteousness, but beholda cry. 8Â¶Woe unto them thatjoinhouse to house,thatlay field to field, tillthere beno place, that they maybe placed alonein the midst of the earth! 9In mine earssaidtheLordof hosts, Of a truth many houses shall be desolate,evengreat and fair, without inhabitant. 10Yea, ten acres of vineyard shall yield onebath, and the seed of an homer shall yield an ephah. 11Â¶Woe unto them that rise up early in the morning,thatthey may follow strong drink; that continue until night,tillwineinflame them! 12And the harp, and theviol, thetabret, and pipe, and wine, are in their feasts: but theyregardnot theworkof theLord, neither consider the operation of his hands. 13Â¶Therefore my people are gone intocaptivity, becausethey havenoknowledge: and their honourable menarefamished, and their multitude dried up with thirst. 14Therefore hell hath enlarged herself, and opened her mouth without measure: and their glory, and their multitude, and theirpomp, and he that rejoiceth, shall descend into it. 15And the mean man shall be brought down, and the mighty man shall be humbled, and the eyes of theloftyshall be humbled: 16But theLordof hosts shall be exalted injudgment, and God that isholyshall be sanctified in righteousness. 17Then shall the lambs feed after their manner, and the waste places of the fat ones shall strangers eat. 18Woe unto them thatdrawiniquity with cords ofvanity, and sinasit were with a cart rope: 19That say,Lethim makespeed,andhastenhis work, that we mayseeit:and let the counsel of the Holy One of Israel draw nigh and come, that we may knowit! 20Â¶Woe unto them that callevilgood, and good evil; that putdarknessforlight, and light for darkness; that put bitter for sweet, and sweet for bitter! 21Woe untothem that arewisein their owneyes, andprudentin their own sight! 22Woe untothem that aremighty todrinkwine, and men of strength to mingle strong drink: 23Whichjustifythewickedfor reward, andtakeaway the righteousness of the righteous from him! 24Therefore as the fire devoureth thestubble, and the flame consumeth the chaff,sotheirrootshall be as rottenness, and their blossom shall go up as dust: because they have cast away the law of theLordof hosts, and despised the word of the Holy One of Israel. 25Therefore is theangerof theLordkindled against his people, and he hathstretchedforth his hand against them, and hath smitten them: and the hills did tremble, and their carcasesweretorn in the midst of the streets. For all this his anger is not turned away, but his handisstretched out still. 26Â¶And he will lift up anensignto the nations from far, and willhissunto them from theendof the earth: and, behold, they shallcomewith speed swiftly: 27None shall be weary nor stumble among them; none shall slumber nor sleep; neither shall the girdle of their loins be loosed, nor the latchet of their shoes be broken: 28Whose arrowsaresharp, and all their bows bent, their horsesâ hoofs shall be counted like flint, and their wheels like a whirlwind: 29Their roaringshall belike a lion, they shall roar like younglions: yea, they shall roar, and lay hold of theprey, and shall carryitaway safe, and none shall deliverit. 30And in that day they shall roar against them like the roaring of the sea: and ifonelook unto the land, behold darknessandsorrow, and thelightisdarkenedin the heavens thereof."
    },
    {
      "reference": "Isaiah 6",
      "title": "Isaiah 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/6?lang=eng",
      "summary": "Isaiah sees the LordâHis sins are forgivenâHe is called to prophesyâHe prophesies of the Jewsâ rejection of Christâs teachingsâA remnant will returnâCompare2Â Nephi 16.",
      "verses": [
        "1Inthe year that king Uzziah died Isawalso theLordsitting upon athrone, high and lifted up, andhis trainfilled the temple.",
        "2Above it stood theseraphims:each one had six wings; with twain he covered his face, and with twain he covered his feet, and with twain he did fly.",
        "3And one cried unto another, and said, Holy, holy, holy,istheLordof hosts: the whole earthisfull of hisglory.",
        "4And thepostsof the door moved at the voice of him that cried, and the house was filled withsmoke.",
        "5Â¶Then said I, Woeisme! for I amundone; because Iama man ofuncleanlips, and I dwell in the midst of a people of unclean lips: for mine eyes haveseentheKing, theLordof hosts.",
        "6Then flew one of the seraphims unto me, having a livecoalin his hand,whichhe had taken with the tongs from off the altar:",
        "7And he laiditupon mymouth, and said, Lo, this hath touched thy lips; and thine iniquity istakenaway, and thy sin purged.",
        "8Also I heard the voice of the Lord, saying, Whom shall Isend, and who will go for us? Then said I, HereamI;sendme.",
        "9Â¶And he said, Go, and tell this people,Hearye indeed, butunderstandnot; and see ye indeed, butperceivenot.",
        "10Make theheartof this people fat, and make their ears heavy, andshuttheir eyes; lest they see with their eyes, and hear with their ears, and understand with their heart, and convert, and be healed.",
        "11Then said I, Lord,howlong? And he answered, Until the cities be wasted without inhabitant, and the houses without man, and the land be utterly desolate,",
        "12And theLordhave removed men far away, andthere bea great forsaking in the midst of the land.",
        "13Â¶But yet in itshall bea tenth, anditshall return, and shall be eaten: as a teil tree, and as an oak, whose substanceisin them, when they casttheir leaves: sothe holy seedshall bethesubstancethereof."
      ],
      "full_text": "1Inthe year that king Uzziah died Isawalso theLordsitting upon athrone, high and lifted up, andhis trainfilled the temple. 2Above it stood theseraphims:each one had six wings; with twain he covered his face, and with twain he covered his feet, and with twain he did fly. 3And one cried unto another, and said, Holy, holy, holy,istheLordof hosts: the whole earthisfull of hisglory. 4And thepostsof the door moved at the voice of him that cried, and the house was filled withsmoke. 5Â¶Then said I, Woeisme! for I amundone; because Iama man ofuncleanlips, and I dwell in the midst of a people of unclean lips: for mine eyes haveseentheKing, theLordof hosts. 6Then flew one of the seraphims unto me, having a livecoalin his hand,whichhe had taken with the tongs from off the altar: 7And he laiditupon mymouth, and said, Lo, this hath touched thy lips; and thine iniquity istakenaway, and thy sin purged. 8Also I heard the voice of the Lord, saying, Whom shall Isend, and who will go for us? Then said I, HereamI;sendme. 9Â¶And he said, Go, and tell this people,Hearye indeed, butunderstandnot; and see ye indeed, butperceivenot. 10Make theheartof this people fat, and make their ears heavy, andshuttheir eyes; lest they see with their eyes, and hear with their ears, and understand with their heart, and convert, and be healed. 11Then said I, Lord,howlong? And he answered, Until the cities be wasted without inhabitant, and the houses without man, and the land be utterly desolate, 12And theLordhave removed men far away, andthere bea great forsaking in the midst of the land. 13Â¶But yet in itshall bea tenth, anditshall return, and shall be eaten: as a teil tree, and as an oak, whose substanceisin them, when they casttheir leaves: sothe holy seedshall bethesubstancethereof."
    },
    {
      "reference": "Isaiah 7",
      "title": "Isaiah 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/7?lang=eng",
      "summary": "Ephraim and Syria wage war against JudahâChrist will be born of a virginâCompare2Â Nephi 17.",
      "verses": [
        "1Andit came to pass in the days of Ahaz the son of Jotham, the son of Uzziah, king of Judah,thatRezinthekingof Syria, andPekahthe son of Remaliah, king of Israel, went up toward Jerusalem to war against it, but could not prevail against it.",
        "2And it was told the house of David, saying, Syria is confederate withEphraim. And his heart was moved, and the heart of his people, as the trees of the wood are moved with the wind.",
        "3Then said theLordunto Isaiah, Go forth now to meet Ahaz, thou,andShear-jashubthy son, at the end of theconduitof the upper poolinthe highway of the fullerâs field;",
        "4And say unto him,Take heed, and be quiet; fear not, neither be fainthearted for the two tails of these smoking firebrands, for the fierce anger of Rezin with Syria, and of the son of Remaliah.",
        "5Because Syria, Ephraim, and the son of Remaliah, have taken evil counsel against thee, saying,",
        "6Let us go up against Judah, and vex it, and let usmake a breachtherein for us, and set a king in the midst of it,eventhe son of Tabeal:",
        "7Thus saith the LordGod, It shall not stand, neither shall it come to pass.",
        "8For the head of SyriaisDamascus, and the head of DamascusisRezin; and within threescore and five years shallEphraimbe broken, that it be not a people.",
        "9And the head of EphraimisSamaria, and the head of SamariaisRemaliahâs son.Ifye will not believe, surely ye shall not be established.",
        "10Â¶Moreover theLordspake again unto Ahaz, saying,",
        "11Ask thee a sign of theLordthy God; ask it either in the depth, or in the height above.",
        "12But Ahaz said, I will not ask, neither will ItempttheLord.",
        "13And he said, Hear ye now, O house of David;Is ita small thing for you to weary men, but will ye weary my God also?",
        "14Therefore the Lord himself shall give you asign;Behold, avirginshall conceive, and bear ason, and shall call his nameImmanuel.",
        "15Butter and honeyshall he eat, that he may know to refuse the evil, and choose the good.",
        "16Forbeforethe child shall know to refuse theevil, and choose the good, the land that thou abhorrest shall be forsaken of both her kings.",
        "17Â¶TheLordshall bring upon thee, and upon thy people, and upon thy fatherâs house, days that have not come, from the day thatEphraimdeparted fromJudah;eventhe king of Assyria.",
        "18And it shall come to pass in that day,thattheLordshallhissfor the flythatisin the uttermost part of the rivers of Egypt, and for the bee thatisin the land of Assyria.",
        "19And they shall come, and shall rest all of them in the desolate valleys, and in the holes of the rocks, and upon all thorns, and upon all bushes.",
        "20In the same day shall the Lordshavewith a razor that is hired,namely,by them beyond the river, by the king of Assyria, the head, and the hair of the feet: and it shall also consume the beard.",
        "21And it shall come to pass in that day,thataman shall nourish a young cow, and two sheep;",
        "22And it shall come to pass, for the abundance of milkthattheyshall give he shall eat butter: forbutter and honeyshall every one eat that is left in the land.",
        "23And it shall come to pass in that day,thatevery place shall be, where there were a thousand vines at a thousandsilverlings, it shallevenbe for briers and thorns.",
        "24With arrows and with bows shallmencome thither; because all the land shall become briers and thorns.",
        "25Andonall hills that shall bedigged with the mattock, there shall not come thither the fear of briers and thorns: but it shall be for the sending forth of oxen, and for the treading oflesser cattle."
      ],
      "full_text": "1Andit came to pass in the days of Ahaz the son of Jotham, the son of Uzziah, king of Judah,thatRezinthekingof Syria, andPekahthe son of Remaliah, king of Israel, went up toward Jerusalem to war against it, but could not prevail against it. 2And it was told the house of David, saying, Syria is confederate withEphraim. And his heart was moved, and the heart of his people, as the trees of the wood are moved with the wind. 3Then said theLordunto Isaiah, Go forth now to meet Ahaz, thou,andShear-jashubthy son, at the end of theconduitof the upper poolinthe highway of the fullerâs field; 4And say unto him,Take heed, and be quiet; fear not, neither be fainthearted for the two tails of these smoking firebrands, for the fierce anger of Rezin with Syria, and of the son of Remaliah. 5Because Syria, Ephraim, and the son of Remaliah, have taken evil counsel against thee, saying, 6Let us go up against Judah, and vex it, and let usmake a breachtherein for us, and set a king in the midst of it,eventhe son of Tabeal: 7Thus saith the LordGod, It shall not stand, neither shall it come to pass. 8For the head of SyriaisDamascus, and the head of DamascusisRezin; and within threescore and five years shallEphraimbe broken, that it be not a people. 9And the head of EphraimisSamaria, and the head of SamariaisRemaliahâs son.Ifye will not believe, surely ye shall not be established. 10Â¶Moreover theLordspake again unto Ahaz, saying, 11Ask thee a sign of theLordthy God; ask it either in the depth, or in the height above. 12But Ahaz said, I will not ask, neither will ItempttheLord. 13And he said, Hear ye now, O house of David;Is ita small thing for you to weary men, but will ye weary my God also? 14Therefore the Lord himself shall give you asign;Behold, avirginshall conceive, and bear ason, and shall call his nameImmanuel. 15Butter and honeyshall he eat, that he may know to refuse the evil, and choose the good. 16Forbeforethe child shall know to refuse theevil, and choose the good, the land that thou abhorrest shall be forsaken of both her kings. 17Â¶TheLordshall bring upon thee, and upon thy people, and upon thy fatherâs house, days that have not come, from the day thatEphraimdeparted fromJudah;eventhe king of Assyria. 18And it shall come to pass in that day,thattheLordshallhissfor the flythatisin the uttermost part of the rivers of Egypt, and for the bee thatisin the land of Assyria. 19And they shall come, and shall rest all of them in the desolate valleys, and in the holes of the rocks, and upon all thorns, and upon all bushes. 20In the same day shall the Lordshavewith a razor that is hired,namely,by them beyond the river, by the king of Assyria, the head, and the hair of the feet: and it shall also consume the beard. 21And it shall come to pass in that day,thataman shall nourish a young cow, and two sheep; 22And it shall come to pass, for the abundance of milkthattheyshall give he shall eat butter: forbutter and honeyshall every one eat that is left in the land. 23And it shall come to pass in that day,thatevery place shall be, where there were a thousand vines at a thousandsilverlings, it shallevenbe for briers and thorns. 24With arrows and with bows shallmencome thither; because all the land shall become briers and thorns. 25Andonall hills that shall bedigged with the mattock, there shall not come thither the fear of briers and thorns: but it shall be for the sending forth of oxen, and for the treading oflesser cattle."
    },
    {
      "reference": "Isaiah 8",
      "title": "Isaiah 8",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/8?lang=eng",
      "summary": "Christ will be as a stone of stumbling and a rock of offenseâSeek the Lord, not muttering wizardsâTurn to the law and to the testimony for guidanceâCompare2Â Nephi 18.",
      "verses": [
        "1Moreover theLordsaid unto me, Take thee a greatroll, andwritein it witha manâs penconcerningMaher-shalal-hash-baz.",
        "2And I took unto me faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah.",
        "3And I went untothe prophetess; and she conceived, and bare a son. Then said theLordto me, Call his nameMaher-shalal-hash-baz.",
        "4Forbeforethe child shallhaveknowledge to cry, My father, and my mother, the riches of Damascus and the spoil ofSamariashall betakenaway before the king of Assyria.",
        "5Â¶TheLordspake also unto me again, saying,",
        "6Forasmuch as this people refuseth the waters ofShiloahthat go softly, and rejoice inRezinand Remaliahâs son;",
        "7Now therefore, behold, the Lord bringeth up uponthemthewatersof the river, strong and many,eventhe king ofAssyria, and all his glory: and he shall come up over all his channels, and go over all his banks:",
        "8And he shallpass through Judah; he shall overflow and go over, he shall reachevento theneck; and the stretching out of his wings shall fill the breadth of thy land, OImmanuel.",
        "9Â¶Associate yourselves, O ye people, and ye shall be broken in pieces; and give ear, all ye of far countries: gird yourselves, and ye shall be broken in pieces; gird yourselves, and ye shall be broken in pieces.",
        "10Takecounseltogether, and it shall come to nought; speak the word, and it shall not stand: forGodiswith us.",
        "11Â¶For theLordspake thus to mewith a strong hand, and instructed me that I should not walk in the way of this people, saying,",
        "12Say ye not, Aconfederacy, to allthem towhom this people shall say, A confederacy; neither fear ye their fear, nor be afraid.",
        "13Sanctify theLordof hostshimself; andlethimbeyour fear, andlethimbeyour dread.",
        "14And he shall be for asanctuary; but for astoneofstumblingand for arockofoffenceto both the houses of Israel, for a gin and for asnareto the inhabitants of Jerusalem.",
        "15And many among them shall stumble, and fall, and be broken, and be snared, and be taken.",
        "16Bindup the testimony,sealthelawamong my disciples.",
        "17And I will wait upon theLord, thathidethhisfacefrom the house of Jacob, and I will look for him.",
        "18Behold, I and the children whom theLordhath given meareforsignsand for wonders in Israel from theLordof hosts, which dwelleth in mount Zion.",
        "19Â¶And when they shall say unto you, Seek unto them that havefamiliar spirits, and untowizardsthat peep, and that mutter: should not a people seek unto their God?forthe living to the dead?",
        "20To thelawand to the testimony: iftheyspeak not according to this word,it isbecausethere isnolightin them.",
        "21Andtheyshall pass through it, hardly bestead and hungry: and it shall come to pass, that when they shall be hungry, they shall fret themselves, andcursetheir king and their God, and look upward.",
        "22And they shall look unto the earth; and behold trouble anddarkness,dimness of anguish; andthey shall bedriven to darkness."
      ],
      "full_text": "1Moreover theLordsaid unto me, Take thee a greatroll, andwritein it witha manâs penconcerningMaher-shalal-hash-baz. 2And I took unto me faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah. 3And I went untothe prophetess; and she conceived, and bare a son. Then said theLordto me, Call his nameMaher-shalal-hash-baz. 4Forbeforethe child shallhaveknowledge to cry, My father, and my mother, the riches of Damascus and the spoil ofSamariashall betakenaway before the king of Assyria. 5Â¶TheLordspake also unto me again, saying, 6Forasmuch as this people refuseth the waters ofShiloahthat go softly, and rejoice inRezinand Remaliahâs son; 7Now therefore, behold, the Lord bringeth up uponthemthewatersof the river, strong and many,eventhe king ofAssyria, and all his glory: and he shall come up over all his channels, and go over all his banks: 8And he shallpass through Judah; he shall overflow and go over, he shall reachevento theneck; and the stretching out of his wings shall fill the breadth of thy land, OImmanuel. 9Â¶Associate yourselves, O ye people, and ye shall be broken in pieces; and give ear, all ye of far countries: gird yourselves, and ye shall be broken in pieces; gird yourselves, and ye shall be broken in pieces. 10Takecounseltogether, and it shall come to nought; speak the word, and it shall not stand: forGodiswith us. 11Â¶For theLordspake thus to mewith a strong hand, and instructed me that I should not walk in the way of this people, saying, 12Say ye not, Aconfederacy, to allthem towhom this people shall say, A confederacy; neither fear ye their fear, nor be afraid. 13Sanctify theLordof hostshimself; andlethimbeyour fear, andlethimbeyour dread. 14And he shall be for asanctuary; but for astoneofstumblingand for arockofoffenceto both the houses of Israel, for a gin and for asnareto the inhabitants of Jerusalem. 15And many among them shall stumble, and fall, and be broken, and be snared, and be taken. 16Bindup the testimony,sealthelawamong my disciples. 17And I will wait upon theLord, thathidethhisfacefrom the house of Jacob, and I will look for him. 18Behold, I and the children whom theLordhath given meareforsignsand for wonders in Israel from theLordof hosts, which dwelleth in mount Zion. 19Â¶And when they shall say unto you, Seek unto them that havefamiliar spirits, and untowizardsthat peep, and that mutter: should not a people seek unto their God?forthe living to the dead? 20To thelawand to the testimony: iftheyspeak not according to this word,it isbecausethere isnolightin them. 21Andtheyshall pass through it, hardly bestead and hungry: and it shall come to pass, that when they shall be hungry, they shall fret themselves, andcursetheir king and their God, and look upward. 22And they shall look unto the earth; and behold trouble anddarkness,dimness of anguish; andthey shall bedriven to darkness."
    },
    {
      "reference": "Isaiah 9",
      "title": "Isaiah 9",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/9?lang=eng",
      "summary": "Isaiah speaks about the MessiahâThe people in darkness will see a great LightâUnto us a Child is bornâHe will be the Prince of Peace and reign on Davidâs throneâCompare2Â Nephi 19.",
      "verses": [
        "1Neverthelessthe dimnessshallnotbesuch aswasin her vexation,whenat the first he lightly afflicted the land ofZebulunand the land of Naphtali, and afterward did more grievously afflicther bythe way of the sea, beyond Jordan, in Galilee of the nations.",
        "2The people that walked indarknesshave seen a greatlight: they that dwell in the land of the shadow of death, upon them hath the light shined.",
        "3Thou hastmultipliedthenation,andnot increased the joy: they joy before thee according to the joy in harvest,andasmenrejoicewhen they divide the spoil.",
        "4For thou hast broken theyokeof hisburden, and the staff of hisshoulder, therodof his oppressor, asinthe day ofMidian.",
        "5Forevery battle of the warrioriswith confused noise, and garments rolled in blood; butthisshall be withburningandfuel of fire.",
        "6For unto us achildisborn, unto us asonis given: and thegovernmentshall be upon his shoulder: and his name shall be called Wonderful,Counsellor, ThemightyGod, TheeverlastingFather, The Prince ofPeace.",
        "7Of the increase ofhisgovernmentand peacethere shall benoend, upon the throne ofDavid, and upon his kingdom, to order it, and to establish it with judgment and withjusticefrom henceforth even for ever. Thezealof theLordof hosts will perform this.",
        "8Â¶The Lord sent a word into Jacob, and it hath lighted uponIsrael.",
        "9And all the people shall know,evenEphraim and the inhabitant of Samaria, that say in theprideand stoutness of heart,",
        "10The bricks are fallen down, but we will build with hewn stones: the sycomores are cut down, but we will changethem intocedars.",
        "11Therefore theLordshall set up the adversaries ofRezinagainst him, and join his enemies together;",
        "12The Syriansbefore, and the Philistinesbehind; and they shall devour Israel with open mouth. For all this hisangeris not turned away, buthishandisstretchedout still.",
        "13Â¶For the peopleturneth notunto him that smiteth them, neither do theyseektheLordof hosts.",
        "14Therefore theLordwill cut off from Israel head and tail, branch and rush, in one day.",
        "15Theancient and honourable, heisthe head; and theprophetthat teacheth lies, heisthe tail.",
        "16For theleadersof this people causethemto err; andthey that areled of themaredestroyed.",
        "17Therefore the Lord shall have no joy in their young men, neither shall have mercy on their fatherless and widows: for every oneisanhypocriteand an evildoer, and every mouthspeakethfolly. For all this his anger is not turned away, but his handisstretched out still.",
        "18Â¶For wickedness burneth as the fire: it shall devour the briers andthorns, and shall kindle in thethicketsof the forest, and they shall mount uplikethe lifting up of smoke.",
        "19Through the wrath of theLordof hosts is the land darkened, andthe people shall be as the fuel of the fire: no man shallsparehisbrother.",
        "20And he shall snatch on the right hand, and be hungry; and he shall eat on the left hand, and they shall not be satisfied: they shalleatevery man thefleshof his own arm:",
        "21Manasseh, Ephraim; and Ephraim, Manasseh:andthey togethershall beagainst Judah. For all this his anger is not turned away, but his handisstretched out still."
      ],
      "full_text": "1Neverthelessthe dimnessshallnotbesuch aswasin her vexation,whenat the first he lightly afflicted the land ofZebulunand the land of Naphtali, and afterward did more grievously afflicther bythe way of the sea, beyond Jordan, in Galilee of the nations. 2The people that walked indarknesshave seen a greatlight: they that dwell in the land of the shadow of death, upon them hath the light shined. 3Thou hastmultipliedthenation,andnot increased the joy: they joy before thee according to the joy in harvest,andasmenrejoicewhen they divide the spoil. 4For thou hast broken theyokeof hisburden, and the staff of hisshoulder, therodof his oppressor, asinthe day ofMidian. 5Forevery battle of the warrioriswith confused noise, and garments rolled in blood; butthisshall be withburningandfuel of fire. 6For unto us achildisborn, unto us asonis given: and thegovernmentshall be upon his shoulder: and his name shall be called Wonderful,Counsellor, ThemightyGod, TheeverlastingFather, The Prince ofPeace. 7Of the increase ofhisgovernmentand peacethere shall benoend, upon the throne ofDavid, and upon his kingdom, to order it, and to establish it with judgment and withjusticefrom henceforth even for ever. Thezealof theLordof hosts will perform this. 8Â¶The Lord sent a word into Jacob, and it hath lighted uponIsrael. 9And all the people shall know,evenEphraim and the inhabitant of Samaria, that say in theprideand stoutness of heart, 10The bricks are fallen down, but we will build with hewn stones: the sycomores are cut down, but we will changethem intocedars. 11Therefore theLordshall set up the adversaries ofRezinagainst him, and join his enemies together; 12The Syriansbefore, and the Philistinesbehind; and they shall devour Israel with open mouth. For all this hisangeris not turned away, buthishandisstretchedout still. 13Â¶For the peopleturneth notunto him that smiteth them, neither do theyseektheLordof hosts. 14Therefore theLordwill cut off from Israel head and tail, branch and rush, in one day. 15Theancient and honourable, heisthe head; and theprophetthat teacheth lies, heisthe tail. 16For theleadersof this people causethemto err; andthey that areled of themaredestroyed. 17Therefore the Lord shall have no joy in their young men, neither shall have mercy on their fatherless and widows: for every oneisanhypocriteand an evildoer, and every mouthspeakethfolly. For all this his anger is not turned away, but his handisstretched out still. 18Â¶For wickedness burneth as the fire: it shall devour the briers andthorns, and shall kindle in thethicketsof the forest, and they shall mount uplikethe lifting up of smoke. 19Through the wrath of theLordof hosts is the land darkened, andthe people shall be as the fuel of the fire: no man shallsparehisbrother. 20And he shall snatch on the right hand, and be hungry; and he shall eat on the left hand, and they shall not be satisfied: they shalleatevery man thefleshof his own arm: 21Manasseh, Ephraim; and Ephraim, Manasseh:andthey togethershall beagainst Judah. For all this his anger is not turned away, but his handisstretched out still."
    },
    {
      "reference": "Isaiah 10",
      "title": "Isaiah 10",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/10?lang=eng",
      "summary": "The destruction of Assyria is a type of the destruction of the wicked at the Second ComingâFew people will be left after the Lord comes againâThe remnant of Jacob will return in that dayâCompare2Â Nephi 20.",
      "verses": [
        "1Woeunto them that decreeunrighteousdecrees, and that write grievousnesswhichthey have prescribed;",
        "2To turn aside the needy fromjudgment, and to take away the right from thepoorof my people, that widows may be their prey, andthatthey may rob the fatherless!",
        "3And what will ye do in the day ofvisitation, and in the desolationwhichshall come from far? to whom will ye flee for help? and where will ye leave your glory?",
        "4Without me they shall bow down under the prisoners, and they shall fall under the slain. For all this his anger is not turned away, but his handisstretched out still.",
        "5Â¶OAssyrian, the rod of mine anger, and the staff in their hand is mine indignation.",
        "6I will send him against anhypocriticalnation, and against the people of my wrath will I give him a charge, to take the spoil, and to take the prey, and to tread them down like the mire of the streets.",
        "7Howbeit he meaneth not so, neitherdothhis heart think so; butit isin his heart to destroy and cut off nations not a few.",
        "8For he saith,Arenot my princes altogether kings?",
        "9Isnot Calno as Carchemish?isnot Hamath as Arpad?isnot Samaria as Damascus?",
        "10As my hand hath found the kingdoms of the idols, and whose graven images did excel them of Jerusalem and of Samaria;",
        "11Shall I not, as I have done unto Samaria and her idols, so do to Jerusalem and her idols?",
        "12Wherefore it shall come to pass,thatwhen the Lord hath performed his whole work upon mount Zion and on Jerusalem, I willpunishthe fruitof the stout heart of the king ofAssyria, and the glory of his high looks.",
        "13For he saith, By thestrengthof my hand I have doneit,and by my wisdom; for I am prudent: and I have removed the bounds of the people, and have robbed their treasures, and I have put down the inhabitants like a valiantman:",
        "14And my hand hath found as a nest the riches of the people: and as one gathereth eggsthat areleft, have I gathered all the earth; and there was none that moved the wing, or opened the mouth, or peeped.",
        "15Shallthe axeboastitself against him that heweth therewith?orshall the saw magnify itself against him thatshakethit? as if the rod should shakeitselfagainst themthat lift it up,oras if the staff should lift upitself, as if it wereno wood.",
        "16Therefore shall the Lord, the Lord of hosts, send among hisfatones leanness; and underhisglory he shall kindle a burning like the burning of a fire.",
        "17And the light of Israel shall be for a fire, and his Holy One for a flame: and it shall burn and devour histhornsand his briers in one day;",
        "18And shall consume the glory of his forest, and of his fruitful field, bothsoul and body: and they shall be as when a standardbearer fainteth.",
        "19And the rest of the trees of his forest shall be few, that a child may write them.",
        "20Â¶And it shall come to pass inthat day,thatthe remnant of Israel, and such as areescapedof the house of Jacob, shall no more againstay uponhim that smote them; but shall stay upon theLord, the Holy One of Israel, in truth.",
        "21Theremnantshallreturn,eventhe remnant of Jacob, unto the mighty God.",
        "22For though thy people Israel be as thesandof the sea,yeta remnant of them shallreturn:theconsumptiondecreedshall overflow with righteousness.",
        "23For the LordGodof hosts shallmake a consumption, even determined, in the midst of all the land.",
        "24Â¶Therefore thus saith the LordGodof hosts, O my people that dwellest in Zion, be not afraid of the Assyrian: he shallsmitethee with a rod, and shall lift up his staff against thee, after the manner ofEgypt.",
        "25For yet a very littlewhile, and theindignationshall cease, and mine anger in their destruction.",
        "26And theLordof hosts shall stir up a scourge for him according to the slaughter ofMidianat the rock ofOreb: andashisrodwasupon the sea, so shall he lift it up after the manner ofEgypt.",
        "27And it shall come to pass in that day,thathisburdenshall be taken away from off thy shoulder, and his yoke from off thy neck, and theyokeshall be destroyed because of theanointing.",
        "28Heis come to Aiath, he is passed to Migron; at Michmash he hath laid up his carriages:",
        "29They are gone over the passage: they have taken up their lodging at Geba; Ramah is afraid; Gibeah of Saul is fled.",
        "30Lift up thy voice, O daughter of Gallim: cause it to be heard unto Laish, O poor Anathoth.",
        "31Madmenah is removed; the inhabitants of Gebim gather themselves to flee.",
        "32As yet shall he remain at Nob that day: he shall shake his handagainstthe mount of the daughter of Zion, the hill of Jerusalem.",
        "33Behold, the Lord, theLordof hosts, shall lop the bough withterror: and the high ones of statureshall behewn down, and thehaughtyshall be humbled.",
        "34And he shall cut down thethicketsof the forest with iron, and Lebanon shall fallbya mighty one."
      ],
      "full_text": "1Woeunto them that decreeunrighteousdecrees, and that write grievousnesswhichthey have prescribed; 2To turn aside the needy fromjudgment, and to take away the right from thepoorof my people, that widows may be their prey, andthatthey may rob the fatherless! 3And what will ye do in the day ofvisitation, and in the desolationwhichshall come from far? to whom will ye flee for help? and where will ye leave your glory? 4Without me they shall bow down under the prisoners, and they shall fall under the slain. For all this his anger is not turned away, but his handisstretched out still. 5Â¶OAssyrian, the rod of mine anger, and the staff in their hand is mine indignation. 6I will send him against anhypocriticalnation, and against the people of my wrath will I give him a charge, to take the spoil, and to take the prey, and to tread them down like the mire of the streets. 7Howbeit he meaneth not so, neitherdothhis heart think so; butit isin his heart to destroy and cut off nations not a few. 8For he saith,Arenot my princes altogether kings? 9Isnot Calno as Carchemish?isnot Hamath as Arpad?isnot Samaria as Damascus? 10As my hand hath found the kingdoms of the idols, and whose graven images did excel them of Jerusalem and of Samaria; 11Shall I not, as I have done unto Samaria and her idols, so do to Jerusalem and her idols? 12Wherefore it shall come to pass,thatwhen the Lord hath performed his whole work upon mount Zion and on Jerusalem, I willpunishthe fruitof the stout heart of the king ofAssyria, and the glory of his high looks. 13For he saith, By thestrengthof my hand I have doneit,and by my wisdom; for I am prudent: and I have removed the bounds of the people, and have robbed their treasures, and I have put down the inhabitants like a valiantman: 14And my hand hath found as a nest the riches of the people: and as one gathereth eggsthat areleft, have I gathered all the earth; and there was none that moved the wing, or opened the mouth, or peeped. 15Shallthe axeboastitself against him that heweth therewith?orshall the saw magnify itself against him thatshakethit? as if the rod should shakeitselfagainst themthat lift it up,oras if the staff should lift upitself, as if it wereno wood. 16Therefore shall the Lord, the Lord of hosts, send among hisfatones leanness; and underhisglory he shall kindle a burning like the burning of a fire. 17And the light of Israel shall be for a fire, and his Holy One for a flame: and it shall burn and devour histhornsand his briers in one day; 18And shall consume the glory of his forest, and of his fruitful field, bothsoul and body: and they shall be as when a standardbearer fainteth. 19And the rest of the trees of his forest shall be few, that a child may write them. 20Â¶And it shall come to pass inthat day,thatthe remnant of Israel, and such as areescapedof the house of Jacob, shall no more againstay uponhim that smote them; but shall stay upon theLord, the Holy One of Israel, in truth. 21Theremnantshallreturn,eventhe remnant of Jacob, unto the mighty God. 22For though thy people Israel be as thesandof the sea,yeta remnant of them shallreturn:theconsumptiondecreedshall overflow with righteousness. 23For the LordGodof hosts shallmake a consumption, even determined, in the midst of all the land. 24Â¶Therefore thus saith the LordGodof hosts, O my people that dwellest in Zion, be not afraid of the Assyrian: he shallsmitethee with a rod, and shall lift up his staff against thee, after the manner ofEgypt. 25For yet a very littlewhile, and theindignationshall cease, and mine anger in their destruction. 26And theLordof hosts shall stir up a scourge for him according to the slaughter ofMidianat the rock ofOreb: andashisrodwasupon the sea, so shall he lift it up after the manner ofEgypt. 27And it shall come to pass in that day,thathisburdenshall be taken away from off thy shoulder, and his yoke from off thy neck, and theyokeshall be destroyed because of theanointing. 28Heis come to Aiath, he is passed to Migron; at Michmash he hath laid up his carriages: 29They are gone over the passage: they have taken up their lodging at Geba; Ramah is afraid; Gibeah of Saul is fled. 30Lift up thy voice, O daughter of Gallim: cause it to be heard unto Laish, O poor Anathoth. 31Madmenah is removed; the inhabitants of Gebim gather themselves to flee. 32As yet shall he remain at Nob that day: he shall shake his handagainstthe mount of the daughter of Zion, the hill of Jerusalem. 33Behold, the Lord, theLordof hosts, shall lop the bough withterror: and the high ones of statureshall behewn down, and thehaughtyshall be humbled. 34And he shall cut down thethicketsof the forest with iron, and Lebanon shall fallbya mighty one."
    },
    {
      "reference": "Isaiah 11",
      "title": "Isaiah 11",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/11?lang=eng",
      "summary": "The stem of Jesse (Christ) will judge in righteousnessâThe knowledge about God will cover the earth in the MillenniumâThe Lord will raise an ensign and gather IsraelâCompare2Â Nephi 21.",
      "verses": [
        "1Andthere shall come forth arodout of thestemofJesse, and aBranchshall grow out of his roots:",
        "2And thespiritof theLordshall rest upon him, the spirit ofwisdomandunderstanding, the spirit ofcounseland might, the spirit of knowledge and of the fear of theLord;",
        "3And shall make him of quick understanding in the fear of theLord: and he shall notjudgeafterthe sight of his eyes, neither reprove after the hearing of his ears:",
        "4But with righteousness shallhejudgethe poor, andreprove with equityfor themeekof the earth: and he shallsmitethe earth with the rod of his mouth, and with thebreathof his lips shall heslaythe wicked.",
        "5And righteousness shall be thegirdleof his loins, and faithfulness the girdle of hisreins.",
        "6Thewolfalso shall dwell with the lamb, and the leopard shall lie down with the kid; and the calf and the young lion and the fatling together; and a little child shall lead them.",
        "7And the cow and the bear shall feed; their young ones shall lie down together: and the lion shall eat straw like the ox.",
        "8And the sucking child shall play on the hole ofthe asp, and the weaned child shall put his hand on thecockatriceâden.",
        "9They shall nothurtnordestroyin all my holymountain: for theearthshall be full of theknowledgeof theLord, as the waters cover the sea.",
        "10Â¶And inthat daythere shall be aroot of Jesse, which shall stand for anensignof the people;to itshall theGentilesseek: and hisrestshall be glorious.",
        "11And it shall come to pass in that day,thatthe Lord shall set his hand again thesecondtime torecovertheremnantof his people, which shall be left, from Assyria, and from Egypt, and from Pathros, and from Cush, and from Elam, and from Shinar, and from Hamath, and from theislandsof the sea.",
        "12And he shall set up anensignfor the nations, and shall assemble the outcasts of Israel, and gather together the dispersed of Judah from the four corners of the earth.",
        "13The envy also of Ephraim shall depart, and the adversaries of Judah shall be cut off: Ephraim shall notenvyJudah, and Judah shall not vex Ephraim.",
        "14But they shallflyupon theshouldersof the Philistines toward the west;they shall spoilthem of the east together: they shall lay their hand upon Edom and Moab; and the children of Ammon shall obey them.",
        "15And theLordshall utterlydestroythe tongue of theEgyptiansea; and with his mighty wind shall he shake his hand over the river, and shall smite it in the seven streams, and makemengo over dryshod.",
        "16And there shall beanhighwayfor the remnant of his people, which shall be left, from Assyria; like as it was to Israel in the day that he came up out of the land of Egypt."
      ],
      "full_text": "1Andthere shall come forth arodout of thestemofJesse, and aBranchshall grow out of his roots: 2And thespiritof theLordshall rest upon him, the spirit ofwisdomandunderstanding, the spirit ofcounseland might, the spirit of knowledge and of the fear of theLord; 3And shall make him of quick understanding in the fear of theLord: and he shall notjudgeafterthe sight of his eyes, neither reprove after the hearing of his ears: 4But with righteousness shallhejudgethe poor, andreprove with equityfor themeekof the earth: and he shallsmitethe earth with the rod of his mouth, and with thebreathof his lips shall heslaythe wicked. 5And righteousness shall be thegirdleof his loins, and faithfulness the girdle of hisreins. 6Thewolfalso shall dwell with the lamb, and the leopard shall lie down with the kid; and the calf and the young lion and the fatling together; and a little child shall lead them. 7And the cow and the bear shall feed; their young ones shall lie down together: and the lion shall eat straw like the ox. 8And the sucking child shall play on the hole ofthe asp, and the weaned child shall put his hand on thecockatriceâden. 9They shall nothurtnordestroyin all my holymountain: for theearthshall be full of theknowledgeof theLord, as the waters cover the sea. 10Â¶And inthat daythere shall be aroot of Jesse, which shall stand for anensignof the people;to itshall theGentilesseek: and hisrestshall be glorious. 11And it shall come to pass in that day,thatthe Lord shall set his hand again thesecondtime torecovertheremnantof his people, which shall be left, from Assyria, and from Egypt, and from Pathros, and from Cush, and from Elam, and from Shinar, and from Hamath, and from theislandsof the sea. 12And he shall set up anensignfor the nations, and shall assemble the outcasts of Israel, and gather together the dispersed of Judah from the four corners of the earth. 13The envy also of Ephraim shall depart, and the adversaries of Judah shall be cut off: Ephraim shall notenvyJudah, and Judah shall not vex Ephraim. 14But they shallflyupon theshouldersof the Philistines toward the west;they shall spoilthem of the east together: they shall lay their hand upon Edom and Moab; and the children of Ammon shall obey them. 15And theLordshall utterlydestroythe tongue of theEgyptiansea; and with his mighty wind shall he shake his hand over the river, and shall smite it in the seven streams, and makemengo over dryshod. 16And there shall beanhighwayfor the remnant of his people, which shall be left, from Assyria; like as it was to Israel in the day that he came up out of the land of Egypt."
    },
    {
      "reference": "Isaiah 12",
      "title": "Isaiah 12",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/12?lang=eng",
      "summary": "In the millennial day, all men will praise the LordâHe will dwell among themâCompare2Â Nephi 22.",
      "verses": [
        "1Andin that daythou shalt say,OLord, I will praise thee: though thou wast angry with me, thine anger is turned away, and thou comfortedst me.",
        "2Behold, Godismy salvation; I will trust, and not be afraid: for theLordJehovahismystrengthandmysong; he also is become mysalvation.",
        "3Therefore withjoyshall ye draw water out of the wells of salvation.",
        "4And in that day shall ye say,PraisetheLord,call uponhis name, declare his doings among the people, make mention that his name is exalted.",
        "5Singunto theLord; for he hath done excellent things: thisisknown in all the earth.",
        "6Cry out and shout, thouinhabitantof Zion: for greatisthe Holy One of Israel in themidstof thee."
      ],
      "full_text": "1Andin that daythou shalt say,OLord, I will praise thee: though thou wast angry with me, thine anger is turned away, and thou comfortedst me. 2Behold, Godismy salvation; I will trust, and not be afraid: for theLordJehovahismystrengthandmysong; he also is become mysalvation. 3Therefore withjoyshall ye draw water out of the wells of salvation. 4And in that day shall ye say,PraisetheLord,call uponhis name, declare his doings among the people, make mention that his name is exalted. 5Singunto theLord; for he hath done excellent things: thisisknown in all the earth. 6Cry out and shout, thouinhabitantof Zion: for greatisthe Holy One of Israel in themidstof thee."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:31:45",
  "metadata": {
    "week_number": 38,
    "title": "Week 38: September 14–20 - Isaiah 1–12",
    "date_range": "September 14–20",
    "scraped_at": "2025-12-21T22:31:57.194155",
    "scraper_version": "2.0.0"
  }
}