{
  "week_number": 31,
  "date_range": "July 27–August 2",
  "title": "Week 31: July 27–August 2 - Ezra 1; 3–7; Nehemiah 2; 4–6; 8",
  "bundle_title": "Week 31: July 27–August 2: \"Week 31: July 27–August 2 - Ezra 1; 3–7; Nehemiah 2; 4–6; 8\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/31?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/31?lang=eng",
    "title": "Ezra 1;3–7;Nehemiah 2;4–6;8",
    "scripture_references": "Ezra 1; 3–7; Nehemiah 2; 4–6; 8",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“July 27–August 2. ‘I Am Doing a Great Work’: Ezra 1; 3–7; Nehemiah 2; 4–6; 8,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“July 27–August 2. ‘I Am Doing a Great Work,’”Come, Follow Me: Old Testament 2026\n\nThe Jewish people had been captives in Babylonia for about 70 years. They had lost Jerusalem and the temple, and many had forgotten their commitment to God’s law. But God had not forgotten them. In fact, He had declared through His prophet, “I will visit you, and perform my good word toward you, in causing you to return” (Jeremiah 29:10). True to this prophecy, the Lord made a way for His people to return—both to Jerusalem and, more importantly, to their covenants. And He raised up servants who accomplished “a great work” (Nehemiah 6:3): A governor named Zerubbabel oversaw the rebuilding of the house of the Lord. Ezra, a priest and scribe, helped the people turn their hearts back to the Lord’s law. And Nehemiah led the rebuilding of the protective walls around Jerusalem. They met opposition, but they also got help from unexpected sources. Their experiences can inform and inspire ours because we too are doing a great work. And like theirs, our work has much to do with the house of the Lord, the law of the Lord, and the spiritual protection we find in Him.\n\nFor an overview of the books of Ezra and Nehemiah, see “Ezra” and “Nehemiah” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "The Lord inspires people to accomplish His purposes.",
        "content": "After Persia conquered Babylonia, the Lord inspired the Persian king, Cyrus, to send a group of Jews to Jerusalem to rebuild the temple. As you readEzra 1, note what Cyrus did to support the Jews in this important work. How do you see the Lord working through men and women around you, including people who are not members of His Church? What does this suggest to you about the Lord and His work?\n\nSee alsoIsaiah 44:24–28.\n\nEzra 3:8–13;6:16–22"
      },
      {
        "title": "The house of the Lord is a place of joy.",
        "content": "When the Babylonians invaded Jerusalem, they plundered the temple and burned it to the ground (see2 Kings 25:1–10;2 Chronicles 36:17–19). How do you think you might have felt if you had been one of the Jews who witnessed this? (seePsalm 137). Notice how the Jews felt, decades later, when they were allowed to return and rebuild the temple (seeEzra 3:8–13;6:16–22). That might prompt you to ponder your own feelings about the Lord and His house. Why is the building of a temple a reason to celebrate?\n\nThe temple of Zerubbabel; illustration by Sam Lawlor\n\nEzra 4–7;Nehemiah 2;4;6"
      },
      {
        "title": "God has an important work for me to do.",
        "content": "The Lord’s work rarely goes unopposed. This was true of the efforts led by Zerubbabel and Nehemiah. Here’s a simple approach that can help you learn from these stories and consider how you can do the Lord’s work despite opposition:\n\nGod’s work for Zerubbabel (Ezra 4:3):\n\nGod’s work for Nehemiah (Nehemiah 2:17–18):\n\nGod’s work for me:\n\nOpposition Zerubbabel faced (Ezra 4:4–24):\n\nOpposition Nehemiah faced (Nehemiah 2:19;4:1–3, 7–8;6:1–13):\n\nOpposition I face:\n\nHow Zerubbabel responded (Ezra 5:1–2):\n\nHow Nehemiah responded (Nehemiah 2:20;4:6, 9;6:3–15):\n\nHow I can respond:\n\nFor help comparing Nehemiah’s experience to your life, you might study President Dieter F. Uchtdorf’s message “We Are Doing a Great Work and Cannot Come Down” (EnsignorLiahona, May 2009, 59–62), especiallythe last two sections. As you think about the work God has given you, you might study the “Young Women Theme” or the “Aaronic Priesthood Quorum Theme” (Gospel Library). Or you could look in a hymn like “As Sisters in Zion” (Hymns, no. 309) or “Ye Elders of Israel” (Hymns, no. 319).\n\nWhat do you think it means to have “a mind to work” in the service of the Savior? (Nehemiah 4:6). What might it mean to have “the good hand of … God upon [you]” as you do His work? (Nehemiah 2:8; see alsoNehemiah 2:18;Ezra 7:6, 9, 27–28). How have you seen His hand in your efforts to serve Him?\n\nNehemiah 8"
      },
      {
        "title": "I am blessed when I study the scriptures.",
        "content": "For generations in captivity, the Jews had limited access to “the book of the law of Moses” (Nehemiah 8:1). InNehemiah 8, Ezra read the law to the people. What do you find in this chapter that shows how Ezra and his people felt about God and His word? (see especiallyverses 1–12). What in your life shows how you feel about God and His word?\n\nSee alsoTeachings of Presidents of the Church: Ezra Taft Benson(2014),115–24.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "The house of the Lord is a place of joy.",
        "content": "To teach your children about the joy the Jews felt when their temple was rebuilt, you could show them a picture like the one below. Talk about why these people might be happy to be at the house of the Lord. You could also tell your children why the temple is a place of joy for you. How has the temple helped you feel closer to Heavenly Father and the Savior?\n\nAs you readEzra 3:10–13with your children, help them find words that show how the Jews felt when the temple was being rebuilt. When you get to the end ofverse 13, maybe you could shout for joy together. Help your children think of reasons to be joyful that the Lord has given us temples. How can we show that joy?\n\nConsider singing a song about the temple with your children, such as the second verse of “Welcome Home” (Gospel Library). After each line, you could pause to ask a child to share something he or she loves about the temple. You might also look atpictures of templeswhile you sing.\n\nNehemiah 2:17–20;6:1–9"
      },
      {
        "title": "The Lord will help me do His “great work.”",
        "content": "Share with your children the story of Nehemiah (seeNehemiah 2:17–20;6:1–9; or “Nehemiah” inOld Testament Stories, 173–74). As you readNehemiah 2:20, you and your children could “arise” and pretend to help build the walls of Jerusalem. Or your children might enjoy building a wall with blocks or other objects. As they do, you could help them think of important things Heavenly Father wants us to do.\n\nNehemiah\n\nAs you readNehemiah 6:9, invite your children to raise their hands when they hear you say “strengthen my hands.” Tell the children about a time when you felt God strengthen your hands to do His work.\n\nNehemiah 8:1–12"
      },
      {
        "title": "The scriptures are a blessing.",
        "content": "Read aloud some phrases fromNehemiah 8:2–3, 5–6, 8–9, 12that describe what the people did when they heard Ezra read the scriptures. As you read, your children could act out these phrases. Then you could share with each other how you feel when you read or hear the scriptures.\n\nAs you read togetherNehemiah 8:8, you could ask your children what helps them understand the scriptures. Show them how to use scripture study aids like theGuide to the ScripturesandTopics and Questions(Gospel Library). Invite your children to share something they have learned about the Savior from the scriptures.\n\nLook for eternal truth in the scriptures.“The scriptures … are filled with gospel truths, but sometimes it takes conscious effort to find them. As you are learning together from the scriptures, stop and ask those you teach what gospel truths they notice. Help them see how these truths relate to Heavenly Father’s plan of salvation. Sometimes eternal truths are stated in the scriptures, and sometimes they are illustrated in the stories and lives of the people we read about. It can also be helpful to explore together the historical background of the verses you are reading, as well as the meaning of the verses and how they apply to us today” (Teaching in the Savior’s Way,22).\n\nFor more, see this month’s issue of theFriendmagazine.\n\nEzra at the Water Gate, © Providence Collection/licensed from goodsalt.com"
      }
    ],
    "study_helps": [],
    "raw_text": "July 27–August 2. “I Am Doing a Great Work”: Ezra 1; 3–7; Nehemiah 2; 4–6; 8\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nJuly 27–August 2\nEzra 1; 3–7; Nehemiah 2; 4–6; 8\nAugust 3–9\nEsther\nThoughts to Keep in Mind\nReading Poetry in the Old Testament\nAugust 10–16\nJob 1–3; 12–14; 19; 21–24; 38–40; 42\nAugust 17–23\nPsalms 1–2; 8; 19–33; 40; 46\nAugust 24–30\nPsalms 49–51; 61–66; 69–72; 77–78; 85–86\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nJuly 27–August 2. “I Am Doing a Great Work”: Ezra 1; 3–7; Nehemiah 2; 4–6; 8\n“July 27–August 2. ‘I Am Doing a Great Work’: Ezra 1; 3–7; Nehemiah 2; 4–6; 8,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“July 27–August 2. ‘I Am Doing a Great Work,’”\nCome, Follow Me: Old Testament 2026\nI Have a Great Work to Do\n, by Tyson Snow\nJuly 27–August 2: “I Am Doing a Great Work”\nEzra 1\n;\n3–7\n;\nNehemiah 2\n;\n4–6\n;\n8\nThe Jewish people had been captives in Babylonia for about 70 years. They had lost Jerusalem and the temple, and many had forgotten their commitment to God’s law. But God had not forgotten them. In fact, He had declared through His prophet, “I will visit you, and perform my good word toward you, in causing you to return” (\nJeremiah 29:10\n). True to this prophecy, the Lord made a way for His people to return—both to Jerusalem and, more importantly, to their covenants. And He raised up servants who accomplished “a great work” (\nNehemiah 6:3\n): A governor named Zerubbabel oversaw the rebuilding of the house of the Lord. Ezra, a priest and scribe, helped the people turn their hearts back to the Lord’s law. And Nehemiah led the rebuilding of the protective walls around Jerusalem. They met opposition, but they also got help from unexpected sources. Their experiences can inform and inspire ours because we too are doing a great work. And like theirs, our work has much to do with the house of the Lord, the law of the Lord, and the spiritual protection we find in Him.\nFor an overview of the books of Ezra and Nehemiah, see “\nEzra\n” and “\nNehemiah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nEzra 1\nThe Lord inspires people to accomplish His purposes.\nAfter Persia conquered Babylonia, the Lord inspired the Persian king, Cyrus, to send a group of Jews to Jerusalem to rebuild the temple. As you read\nEzra 1\n, note what Cyrus did to support the Jews in this important work. How do you see the Lord working through men and women around you, including people who are not members of His Church? What does this suggest to you about the Lord and His work?\nSee also\nIsaiah 44:24–28\n.\nEzra 3:8–13\n;\n6:16–22\nThe house of the Lord is a place of joy.\nWhen the Babylonians invaded Jerusalem, they plundered the temple and burned it to the ground (see\n2 Kings 25:1–10\n;\n2 Chronicles 36:17–19\n). How do you think you might have felt if you had been one of the Jews who witnessed this? (see\nPsalm 137\n). Notice how the Jews felt, decades later, when they were allowed to return and rebuild the temple (see\nEzra 3:8–13\n;\n6:16–22\n). That might prompt you to ponder your own feelings about the Lord and His house. Why is the building of a temple a reason to celebrate?\nThe temple of Zerubbabel; illustration by Sam Lawlor\nEzra 4–7\n;\nNehemiah 2\n;\n4\n;\n6\nGod has an important work for me to do.\nThe Lord’s work rarely goes unopposed. This was true of the efforts led by Zerubbabel and Nehemiah. Here’s a simple approach that can help you learn from these stories and consider how you can do the Lord’s work despite opposition:\nGod’s work for Zerubbabel (\nEzra 4:3\n):\nCreate a Note\nGod’s work for Nehemiah (\nNehemiah 2:17–18\n):\nCreate a Note\nGod’s work for me:\nCreate a Note\nOpposition Zerubbabel faced (\nEzra 4:4–24\n):\nCreate a Note\nOpposition Nehemiah faced (\nNehemiah 2:19\n;\n4:1–3, 7–8\n;\n6:1–13\n):\nCreate a Note\nOpposition I face:\nCreate a Note\nHow Zerubbabel responded (\nEzra 5:1–2\n):\nCreate a Note\nHow Nehemiah responded (\nNehemiah 2:20\n;\n4:6, 9\n;\n6:3–15\n):\nCreate a Note\nHow I can respond:\nCreate a Note\nFor help comparing Nehemiah’s experience to your life, you might study President Dieter F. Uchtdorf’s message “\nWe Are Doing a Great Work and Cannot Come Down\n” (\nEnsign\nor\nLiahona\n, May 2009, 59–62), especially\nthe last two sections\n. As you think about the work God has given you, you might study the “\nYoung Women Theme\n” or the “\nAaronic Priesthood Quorum Theme\n” (Gospel Library). Or you could look in a hymn like “\nAs Sisters in Zion\n” (\nHymns\n, no. 309) or “\nYe Elders of Israel\n” (\nHymns\n, no. 319).\nWhat do you think it means to have “a mind to work” in the service of the Savior? (\nNehemiah 4:6\n). What might it mean to have “the good hand of … God upon [you]” as you do His work? (\nNehemiah 2:8\n; see also\nNehemiah 2:18\n;\nEzra 7:6, 9, 27–28\n). How have you seen His hand in your efforts to serve Him?\nNehemiah 8\nI am blessed when I study the scriptures.\nFor generations in captivity, the Jews had limited access to “the book of the law of Moses” (\nNehemiah 8:1\n). In\nNehemiah 8\n, Ezra read the law to the people. What do you find in this chapter that shows how Ezra and his people felt about God and His word? (see especially\nverses 1–12\n). What in your life shows how you feel about God and His word?\nSee also\nTeachings of Presidents of the Church: Ezra Taft Benson\n(2014),\n115–24\n.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nEzra 3:8–13\n;\n6:16–22\nThe house of the Lord is a place of joy.\nTo teach your children about the joy the Jews felt when their temple was rebuilt, you could show them a picture like the one below. Talk about why these people might be happy to be at the house of the Lord. You could also tell your children why the temple is a place of joy for you. How has the temple helped you feel closer to Heavenly Father and the Savior?\nAs you read\nEzra 3:10–13\nwith your children, help them find words that show how the Jews felt when the temple was being rebuilt. When you get to the end of\nverse 13\n, maybe you could shout for joy together. Help your children think of reasons to be joyful that the Lord has given us temples. How can we show that joy?\nConsider singing a song about the temple with your children, such as the second verse of “Welcome Home” (Gospel Library). After each line, you could pause to ask a child to share something he or she loves about the temple. You might also look at\npictures of temples\nwhile you sing.\nNehemiah 2:17–20\n;\n6:1–9\nThe Lord will help me do His “great work.”\nShare with your children the story of Nehemiah (see\nNehemiah 2:17–20\n;\n6:1–9\n; or “\nNehemiah\n” in\nOld Testament Stories\n, 173–74). As you read\nNehemiah 2:20\n, you and your children could “arise” and pretend to help build the walls of Jerusalem. Or your children might enjoy building a wall with blocks or other objects. As they do, you could help them think of important things Heavenly Father wants us to do.\n1:38\nNehemiah\nAs you read\nNehemiah 6:9\n, invite your children to raise their hands when they hear you say “strengthen my hands.” Tell the children about a time when you felt God strengthen your hands to do His work.\nNehemiah 8:1–12\nThe scriptures are a blessing.\nRead aloud some phrases from\nNehemiah 8:2–3, 5–6, 8–9, 12\nthat describe what the people did when they heard Ezra read the scriptures. As you read, your children could act out these phrases. Then you could share with each other how you feel when you read or hear the scriptures.\nAs you read together\nNehemiah 8:8\n, you could ask your children what helps them understand the scriptures. Show them how to use scripture study aids like the\nGuide to the Scriptures\nand\nTopics and Questions\n(Gospel Library). Invite your children to share something they have learned about the Savior from the scriptures.\nLook for eternal truth in the scriptures.\n“The scriptures … are filled with gospel truths, but sometimes it takes conscious effort to find them. As you are learning together from the scriptures, stop and ask those you teach what gospel truths they notice. Help them see how these truths relate to Heavenly Father’s plan of salvation. Sometimes eternal truths are stated in the scriptures, and sometimes they are illustrated in the stories and lives of the people we read about. It can also be helpful to explore together the historical background of the verses you are reading, as well as the meaning of the verses and how they apply to us today” (\nTeaching in the Savior’s Way\n,\n22\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\nEzra at the Water Gate\n, © Providence Collection/licensed from goodsalt.com\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Ezra 1",
      "title": "Ezra",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezra/1?lang=eng",
      "summary": "King Cyrus of Persia lets the Jews go back to Jerusalem to build the templeâCyrus returns the vessels of the house of the Lord taken by Nebuchadnezzar.",
      "verses": [
        "1Now in the first year of Cyrus king of Persia, that the word of theLordby the mouth ofJeremiahmight be fulfilled, theLordstirred up the spirit ofCyrusking of Persia, that he made a proclamation throughout all his kingdom, andput italso in writing, saying,",
        "2Thus saithCyrusking of Persia, TheLordGod of heaven hath given me all the kingdoms of the earth; and he hath charged me to build him anhouseat Jerusalem, whichisin Judah.",
        "3Whois thereamong you of all his people? his God be with him, and let him go up to Jerusalem, whichisin Judah, and build the house of theLordGod of Israel, (heisthe God,) whichisin Jerusalem.",
        "4And whosoever remaineth in any place where he sojourneth, let the men of his place help him with silver, and with gold, and with goods, and with beasts, beside the freewill offering for the house of God thatisin Jerusalem.",
        "5Â¶Then rose up the chief of the fathers of Judah and Benjamin, and the priests, and the Levites, with allthemwhose spirit God had raised, to go up to build the house of theLordwhichisin Jerusalem.",
        "6And all they thatwereabout themstrengthened their handswith vessels of silver, with gold, with goods, and with beasts, and with precious things, beside allthatwas willingly offered.",
        "7Â¶Also Cyrus the king brought forth the vessels of the house of theLord, which Nebuchadnezzar hadbrought forthout of Jerusalem, and had put them in the house of his gods;",
        "8Even those did Cyrus king of Persia bring forth by the hand of Mithredath the treasurer, and numbered them unto Sheshbazzar, the prince of Judah.",
        "9And thisisthe number of them:thirtychargersof gold, a thousand chargers of silver, nine and twenty knives,",
        "10Thirty basins of gold, silver basins of a secondsortfour hundred and ten,andother vessels a thousand.",
        "11All the vessels of gold and of silverwerefive thousand and four hundred. Allthesedid Sheshbazzar bring up withthem ofthecaptivitythat were brought up from Babylon unto Jerusalem."
      ],
      "full_text": "1Now in the first year of Cyrus king of Persia, that the word of theLordby the mouth ofJeremiahmight be fulfilled, theLordstirred up the spirit ofCyrusking of Persia, that he made a proclamation throughout all his kingdom, andput italso in writing, saying, 2Thus saithCyrusking of Persia, TheLordGod of heaven hath given me all the kingdoms of the earth; and he hath charged me to build him anhouseat Jerusalem, whichisin Judah. 3Whois thereamong you of all his people? his God be with him, and let him go up to Jerusalem, whichisin Judah, and build the house of theLordGod of Israel, (heisthe God,) whichisin Jerusalem. 4And whosoever remaineth in any place where he sojourneth, let the men of his place help him with silver, and with gold, and with goods, and with beasts, beside the freewill offering for the house of God thatisin Jerusalem. 5Â¶Then rose up the chief of the fathers of Judah and Benjamin, and the priests, and the Levites, with allthemwhose spirit God had raised, to go up to build the house of theLordwhichisin Jerusalem. 6And all they thatwereabout themstrengthened their handswith vessels of silver, with gold, with goods, and with beasts, and with precious things, beside allthatwas willingly offered. 7Â¶Also Cyrus the king brought forth the vessels of the house of theLord, which Nebuchadnezzar hadbrought forthout of Jerusalem, and had put them in the house of his gods; 8Even those did Cyrus king of Persia bring forth by the hand of Mithredath the treasurer, and numbered them unto Sheshbazzar, the prince of Judah. 9And thisisthe number of them:thirtychargersof gold, a thousand chargers of silver, nine and twenty knives, 10Thirty basins of gold, silver basins of a secondsortfour hundred and ten,andother vessels a thousand. 11All the vessels of gold and of silverwerefive thousand and four hundred. Allthesedid Sheshbazzar bring up withthem ofthecaptivitythat were brought up from Babylon unto Jerusalem."
    },
    {
      "reference": "Ezra 3",
      "title": "Ezra 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezra/3?lang=eng",
      "summary": "The altar is rebuiltâRegular sacrifices are reinstitutedâThe foundations of the temple are laid amid great rejoicing.",
      "verses": [
        "1And when the seventh month was come, and the children of Israelwerein the cities, the people gathered themselves together as one man to Jerusalem.",
        "2Then stood up Jeshua the son of Jozadak, and his brethren the priests, and Zerubbabel the son of Shealtiel, and his brethren, and builded the altar of the God of Israel, to offer burntofferingsthereon, asit iswritten in the law of Moses themanof God.",
        "3And they set the altar upon his bases; for fearwasupon them because of the people of those countries: and they offered burnt offerings thereon unto theLord,evenburnt offerings morning and evening.",
        "4They kept also thefeast of tabernacles, asit iswritten, andofferedthe daily burnt offerings by number, according to the custom, as the duty of every day required;",
        "5And afterwardofferedthe continual burnt offering, both of the new moons, and of all the setfeastsof theLordthat were consecrated, and of every one thatwillinglyoffered a freewill offering unto theLord.",
        "6From the first day of the seventh month began they to offer burnt offerings unto theLord. But the foundation of the temple of theLordwas notyetlaid.",
        "7They gave money also unto the masons, and to the carpenters; and meat, and drink, and oil, unto them of Zidon, and to them of Tyre, to bringcedartrees from Lebanon to the sea of Joppa, according to the grant that they had ofCyrusking of Persia.",
        "8Â¶Now in the second year of their coming unto the house of God at Jerusalem, in the second month, began Zerubbabel the son of Shealtiel, and Jeshua the son of Jozadak, and the remnant of their brethren the priests and the Levites, and all they that were come out of the captivity unto Jerusalem; and appointed the Levites, from twenty years old and upward, to set forward the work of the house of theLord.",
        "9Then stood Jeshuawithhis sons and his brethren, Kadmiel and his sons, the sons of Judah, together, to set forward the workmen in thehouse of God: the sons of Henadad,withtheir sons and their brethren the Levites.",
        "10And when the builders laid the foundation of the temple of theLord, they set the priests in their apparel with trumpets, and the Levites the sons of Asaph with cymbals, to praise theLord, after the ordinance of David king of Israel.",
        "11And they sang together by course in praising and givingthanksunto theLord; becausehe isgood, for his mercyendurethfor ever toward Israel. And all the people shouted with a great shout, when theypraisedtheLord, because the foundation of the house of theLordwas laid.",
        "12But many of the priests and Levites and chief of the fathers,who wereancientmen, that had seen the first house, when the foundation of this house was laid before their eyes,weptwith a loud voice; and many shouted aloud for joy:",
        "13So that the people could not discern the noise of the shout of joy from the noise of the weeping of the people: for the people shouted with a loud shout, and the noise was heard afar off."
      ],
      "full_text": "1And when the seventh month was come, and the children of Israelwerein the cities, the people gathered themselves together as one man to Jerusalem. 2Then stood up Jeshua the son of Jozadak, and his brethren the priests, and Zerubbabel the son of Shealtiel, and his brethren, and builded the altar of the God of Israel, to offer burntofferingsthereon, asit iswritten in the law of Moses themanof God. 3And they set the altar upon his bases; for fearwasupon them because of the people of those countries: and they offered burnt offerings thereon unto theLord,evenburnt offerings morning and evening. 4They kept also thefeast of tabernacles, asit iswritten, andofferedthe daily burnt offerings by number, according to the custom, as the duty of every day required; 5And afterwardofferedthe continual burnt offering, both of the new moons, and of all the setfeastsof theLordthat were consecrated, and of every one thatwillinglyoffered a freewill offering unto theLord. 6From the first day of the seventh month began they to offer burnt offerings unto theLord. But the foundation of the temple of theLordwas notyetlaid. 7They gave money also unto the masons, and to the carpenters; and meat, and drink, and oil, unto them of Zidon, and to them of Tyre, to bringcedartrees from Lebanon to the sea of Joppa, according to the grant that they had ofCyrusking of Persia. 8Â¶Now in the second year of their coming unto the house of God at Jerusalem, in the second month, began Zerubbabel the son of Shealtiel, and Jeshua the son of Jozadak, and the remnant of their brethren the priests and the Levites, and all they that were come out of the captivity unto Jerusalem; and appointed the Levites, from twenty years old and upward, to set forward the work of the house of theLord. 9Then stood Jeshuawithhis sons and his brethren, Kadmiel and his sons, the sons of Judah, together, to set forward the workmen in thehouse of God: the sons of Henadad,withtheir sons and their brethren the Levites. 10And when the builders laid the foundation of the temple of theLord, they set the priests in their apparel with trumpets, and the Levites the sons of Asaph with cymbals, to praise theLord, after the ordinance of David king of Israel. 11And they sang together by course in praising and givingthanksunto theLord; becausehe isgood, for his mercyendurethfor ever toward Israel. And all the people shouted with a great shout, when theypraisedtheLord, because the foundation of the house of theLordwas laid. 12But many of the priests and Levites and chief of the fathers,who wereancientmen, that had seen the first house, when the foundation of this house was laid before their eyes,weptwith a loud voice; and many shouted aloud for joy: 13So that the people could not discern the noise of the shout of joy from the noise of the weeping of the people: for the people shouted with a loud shout, and the noise was heard afar off."
    },
    {
      "reference": "Ezra 4",
      "title": "Ezra 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezra/4?lang=eng",
      "summary": "The Samaritans offer help, then hinder the workâThe building of the temple and of the walls of Jerusalem ceases.",
      "verses": [
        "1Now when theadversariesof Judah and Benjamin heard that the children of the captivity builded the temple unto theLordGod of Israel;",
        "2Then they came to Zerubbabel, and to the chief of the fathers, and said unto them, Let us build with you: for we seek your God, as yedo;and we do sacrifice unto him since the days of Esar-haddon king of Assur, whichbroughtus up hither.",
        "3But Zerubbabel, and Jeshua, and the rest of the chief of the fathers of Israel, said unto them, Ye have nothing to do with us to build an house unto our God; but we ourselves together will build unto theLordGod of Israel, asking Cyrusthe king of Persia hath commanded us.",
        "4Then the people of the landweakenedthe hands of the people of Judah, and troubled them in building,",
        "5And hired counsellors against them, to frustrate their purpose, all the days of Cyrus king of Persia, even until the reign ofDariusking of Persia.",
        "6And in the reign ofAhasuerus, in the beginning of his reign, wrote theyunto himan accusation against the inhabitants of Judah and Jerusalem.",
        "7Â¶And in the days of Artaxerxes wrote Bishlam, Mithredath, Tabeel, and the rest of their companions, unto Artaxerxes king of Persia; and the writing of the letterwaswritten in theSyriantongue, and interpreted in the Syrian tongue.",
        "8Rehum the chancellor and Shimshai the scribe wrote a letter against Jerusalem to Artaxerxes the king in this sort:",
        "9ThenwroteRehum the chancellor, and Shimshai the scribe, and the rest of their companions; the Dinaites, the Apharsathchites, the Tarpelites, the Apharsites, the Archevites, the Babylonians, the Susanchites, the Dehavites,andthe Elamites,",
        "10And the rest of the nations whom the great and noble Asnappar brought over, and set in the cities of Samaria, and the restthat areonthis side the river, and at such a time.",
        "11Â¶Thisisthe copy of the letter that they sent unto him,evenunto Artaxerxes the king; Thy servants the men on this side the river, and at such a time.",
        "12Be it known unto the king, that the Jews which came up from thee to us are come unto Jerusalem, building the rebellious and the bad city, and have set up the wallsthereof,and joined the foundations.",
        "13Be it known now unto the king, that, if this city be builded, and the walls set upagain, thenwill they not pay toll, tribute, and custom, andsothou shalt endamage the revenue of the kings.",
        "14Now becausewe have maintenance fromthe kingâspalace, and it was not meet for us to see the kingâs dishonour, therefore have we sent and certified the king;",
        "15That search may be made in thebookof the records of thy fathers: so shalt thou find in thebookof the records, and know that this cityisa rebellious city, and hurtful unto kings and provinces, and that they have moved sedition within the same of old time: for which cause was this city destroyed.",
        "16We certify the king that, if this city be buildedagain,and the walls thereof set up, by this means thou shalt have no portion on this side the river.",
        "17Â¶Thensent the king an answer unto Rehum the chancellor, andtoShimshai the scribe, andtothe rest of their companions that dwell in Samaria, anduntothe rest beyond the river, Peace, and at such a time.",
        "18The letter which ye sent unto us hath been plainly read before me.",
        "19And I commanded, and search hath been made, and it is found that this city of old time hath made insurrection against kings, andthatrebellion and sedition have been made therein.",
        "20There have been mighty kings also over Jerusalem, which haveruledover allcountriesbeyond the river; and toll, tribute, and custom, was paid unto them.",
        "21Give ye now commandment to cause these men tocease, and that this city be not builded, untilanothercommandment shall be given from me.",
        "22Take heed now that ye fail not to do this: why should damage grow to the hurt of the kings?",
        "23Â¶Now when the copy of king Artaxerxesâ letterwasread before Rehum, and Shimshai the scribe, and their companions, they went up in haste to Jerusalem unto the Jews, and made them to cease by force and power.",
        "24Then ceased the work of the house of God whichisat Jerusalem. So it ceased unto the second year of the reign of Darius king of Persia."
      ],
      "full_text": "1Now when theadversariesof Judah and Benjamin heard that the children of the captivity builded the temple unto theLordGod of Israel; 2Then they came to Zerubbabel, and to the chief of the fathers, and said unto them, Let us build with you: for we seek your God, as yedo;and we do sacrifice unto him since the days of Esar-haddon king of Assur, whichbroughtus up hither. 3But Zerubbabel, and Jeshua, and the rest of the chief of the fathers of Israel, said unto them, Ye have nothing to do with us to build an house unto our God; but we ourselves together will build unto theLordGod of Israel, asking Cyrusthe king of Persia hath commanded us. 4Then the people of the landweakenedthe hands of the people of Judah, and troubled them in building, 5And hired counsellors against them, to frustrate their purpose, all the days of Cyrus king of Persia, even until the reign ofDariusking of Persia. 6And in the reign ofAhasuerus, in the beginning of his reign, wrote theyunto himan accusation against the inhabitants of Judah and Jerusalem. 7Â¶And in the days of Artaxerxes wrote Bishlam, Mithredath, Tabeel, and the rest of their companions, unto Artaxerxes king of Persia; and the writing of the letterwaswritten in theSyriantongue, and interpreted in the Syrian tongue. 8Rehum the chancellor and Shimshai the scribe wrote a letter against Jerusalem to Artaxerxes the king in this sort: 9ThenwroteRehum the chancellor, and Shimshai the scribe, and the rest of their companions; the Dinaites, the Apharsathchites, the Tarpelites, the Apharsites, the Archevites, the Babylonians, the Susanchites, the Dehavites,andthe Elamites, 10And the rest of the nations whom the great and noble Asnappar brought over, and set in the cities of Samaria, and the restthat areonthis side the river, and at such a time. 11Â¶Thisisthe copy of the letter that they sent unto him,evenunto Artaxerxes the king; Thy servants the men on this side the river, and at such a time. 12Be it known unto the king, that the Jews which came up from thee to us are come unto Jerusalem, building the rebellious and the bad city, and have set up the wallsthereof,and joined the foundations. 13Be it known now unto the king, that, if this city be builded, and the walls set upagain, thenwill they not pay toll, tribute, and custom, andsothou shalt endamage the revenue of the kings. 14Now becausewe have maintenance fromthe kingâspalace, and it was not meet for us to see the kingâs dishonour, therefore have we sent and certified the king; 15That search may be made in thebookof the records of thy fathers: so shalt thou find in thebookof the records, and know that this cityisa rebellious city, and hurtful unto kings and provinces, and that they have moved sedition within the same of old time: for which cause was this city destroyed. 16We certify the king that, if this city be buildedagain,and the walls thereof set up, by this means thou shalt have no portion on this side the river. 17Â¶Thensent the king an answer unto Rehum the chancellor, andtoShimshai the scribe, andtothe rest of their companions that dwell in Samaria, anduntothe rest beyond the river, Peace, and at such a time. 18The letter which ye sent unto us hath been plainly read before me. 19And I commanded, and search hath been made, and it is found that this city of old time hath made insurrection against kings, andthatrebellion and sedition have been made therein. 20There have been mighty kings also over Jerusalem, which haveruledover allcountriesbeyond the river; and toll, tribute, and custom, was paid unto them. 21Give ye now commandment to cause these men tocease, and that this city be not builded, untilanothercommandment shall be given from me. 22Take heed now that ye fail not to do this: why should damage grow to the hurt of the kings? 23Â¶Now when the copy of king Artaxerxesâ letterwasread before Rehum, and Shimshai the scribe, and their companions, they went up in haste to Jerusalem unto the Jews, and made them to cease by force and power. 24Then ceased the work of the house of God whichisat Jerusalem. So it ceased unto the second year of the reign of Darius king of Persia."
    },
    {
      "reference": "Ezra 5",
      "title": "Ezra 5",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezra/5?lang=eng",
      "summary": "Haggai and Zechariah prophesyâZerubbabel renews the building of the templeâThe Samaritans challenge the Jewsâ right to continue their building work.",
      "verses": [
        "1Then theprophets,Haggaithe prophet, andZechariahthe son of Iddo, prophesied unto the Jews thatwerein Judah and Jerusalem in the name of the God of Israel,evenunto them.",
        "2Then rose up Zerubbabel the son of Shealtiel, and Jeshua the son of Jozadak, and began to build the house of God whichisat Jerusalem: and with themwerethe prophets of God helping them.",
        "3Â¶At the same time came to them Tatnai, governoronthis side the river, and Shethar-boznai, and their companions, and said thus unto them, Who hath commanded you to build this house, and to make up this wall?",
        "4Then said we unto them after this manner, What are the names of the men that make this building?",
        "5But the eye of their God was upon the elders of the Jews, that they could not cause them to cease, till the matter came to Darius: and then they returned answer by letter concerning thismatter.",
        "6Â¶The copy of the letter that Tatnai, governor on this side the river, and Shethar-boznai, and his companions the Apharsachites, whichwereon this side the river, sent unto Darius the king:",
        "7They sent a letter unto him, wherein was written thus; Unto Darius the king, all peace.",
        "8Be it known unto theking, that we went into the province of Judea, to the house of the great God, which is builded with great stones, and timber is laid in the walls, and this work goeth fast on, and prospereth in their hands.",
        "9Then asked we those elders,andsaid unto them thus, Who commanded you to build this house, and to make up these walls?",
        "10We asked their names also, to certify thee, that we might write the names of the men thatwerethe chief of them.",
        "11And thus they returned us answer, saying, We are the servants of the God of heaven and earth, and build the house that was builded these many years ago, which a great king of Israel builded and set up.",
        "12But after that our fathers had provoked the God of heaven unto wrath, he gave them into the hand of Nebuchadnezzar the king of Babylon, the Chaldean, who destroyed this house, and carried the people away into Babylon.",
        "13But in the first year of Cyrus the king of Babylonthe samekingCyrusmade a decree to build this house of God.",
        "14And the vessels also of gold and silver of the house of God, which Nebuchadnezzar took out of the temple thatwasin Jerusalem, and brought them into the temple of Babylon, those did Cyrus the king take out of the temple of Babylon, and they were delivered untoone,whose namewasSheshbazzar, whom he had made governor;",
        "15And said unto him, Take these vessels, go, carry them into the temple thatisin Jerusalem, and let the house of God be builded in his place.",
        "16Then came the same Sheshbazzar,andlaid the foundation of the house of God whichisin Jerusalem: and since that time even until now hath it been in building, andyetit is not finished.",
        "17Now therefore, ifit seemgood to the king, let there be search made in the kingâs treasure house, whichisthere at Babylon, whether it beso,that a decree was made of Cyrus the king to build this house of God at Jerusalem, and let the king send his pleasure to us concerning this matter."
      ],
      "full_text": "1Then theprophets,Haggaithe prophet, andZechariahthe son of Iddo, prophesied unto the Jews thatwerein Judah and Jerusalem in the name of the God of Israel,evenunto them. 2Then rose up Zerubbabel the son of Shealtiel, and Jeshua the son of Jozadak, and began to build the house of God whichisat Jerusalem: and with themwerethe prophets of God helping them. 3Â¶At the same time came to them Tatnai, governoronthis side the river, and Shethar-boznai, and their companions, and said thus unto them, Who hath commanded you to build this house, and to make up this wall? 4Then said we unto them after this manner, What are the names of the men that make this building? 5But the eye of their God was upon the elders of the Jews, that they could not cause them to cease, till the matter came to Darius: and then they returned answer by letter concerning thismatter. 6Â¶The copy of the letter that Tatnai, governor on this side the river, and Shethar-boznai, and his companions the Apharsachites, whichwereon this side the river, sent unto Darius the king: 7They sent a letter unto him, wherein was written thus; Unto Darius the king, all peace. 8Be it known unto theking, that we went into the province of Judea, to the house of the great God, which is builded with great stones, and timber is laid in the walls, and this work goeth fast on, and prospereth in their hands. 9Then asked we those elders,andsaid unto them thus, Who commanded you to build this house, and to make up these walls? 10We asked their names also, to certify thee, that we might write the names of the men thatwerethe chief of them. 11And thus they returned us answer, saying, We are the servants of the God of heaven and earth, and build the house that was builded these many years ago, which a great king of Israel builded and set up. 12But after that our fathers had provoked the God of heaven unto wrath, he gave them into the hand of Nebuchadnezzar the king of Babylon, the Chaldean, who destroyed this house, and carried the people away into Babylon. 13But in the first year of Cyrus the king of Babylonthe samekingCyrusmade a decree to build this house of God. 14And the vessels also of gold and silver of the house of God, which Nebuchadnezzar took out of the temple thatwasin Jerusalem, and brought them into the temple of Babylon, those did Cyrus the king take out of the temple of Babylon, and they were delivered untoone,whose namewasSheshbazzar, whom he had made governor; 15And said unto him, Take these vessels, go, carry them into the temple thatisin Jerusalem, and let the house of God be builded in his place. 16Then came the same Sheshbazzar,andlaid the foundation of the house of God whichisin Jerusalem: and since that time even until now hath it been in building, andyetit is not finished. 17Now therefore, ifit seemgood to the king, let there be search made in the kingâs treasure house, whichisthere at Babylon, whether it beso,that a decree was made of Cyrus the king to build this house of God at Jerusalem, and let the king send his pleasure to us concerning this matter."
    },
    {
      "reference": "Ezra 6",
      "title": "Ezra 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezra/6?lang=eng",
      "summary": "Darius renews the decree of Cyrus to build the templeâIt is finished and dedicated, and sacrifices and feasts commence again.",
      "verses": [
        "1Then Darius the king made a decree, and search was made in the house of therolls, where the treasures were laid up in Babylon.",
        "2And there was found at Achmetha, in the palace thatisin the province of the Medes, aroll, and thereinwasa record thus written:",
        "3In the first year of Cyrus the kingthe sameCyrus the king made a decreeconcerningthe house of God at Jerusalem, Let thehousebe builded, the place where they offered sacrifices, and let the foundations thereof be strongly laid; the height thereof threescore cubits,andthe breadth thereof threescore cubits;",
        "4Withthree rows of great stones, and a row of new timber: and let the expenses be given out of the kingâs house:",
        "5And also let the golden and silver vessels of the house of God, which Nebuchadnezzar took forth out of the temple whichisat Jerusalem, and brought unto Babylon, be restored, and brought again unto the temple whichisat Jerusalem,every oneto his place, and placethemin the house of God.",
        "6Nowtherefore,Tatnai, governorbeyond the river, Shethar-boznai, and your companions the Apharsachites, whicharebeyond the river, be ye far from thence:",
        "7Let the work of this house of God alone; let the governor of the Jews and the elders of the Jews build this house of God in his place.",
        "8Moreover I make a decree what ye shall do to the elders of these Jews for the building of this house of God: that of the kingâs goods,evenof the tribute beyond the river, forthwith expenses be given unto these men, that they be not hindered.",
        "9And that which they have need of, both young bullocks, and rams, and lambs, for the burnt offerings of the God of heaven, wheat, salt, wine, and oil, according to the appointment of the priests whichareat Jerusalem, let it be given them day by day without fail:",
        "10That they may offersacrificesof sweet savours unto the God of heaven, andprayfor the life of the king, and of his sons.",
        "11Also I have made a decree, that whosoever shall alter this word, let timber be pulled down from his house, and being set up, let him be hanged thereon; and let his house be made a dunghill for this.",
        "12And the God that hath caused his name to dwell there destroy all kings and people, that shall put to their hand to alterandto destroy this house of God whichisat Jerusalem. I Darius have made a decree; let it be done with speed.",
        "13Â¶Then Tatnai, governoronthis side the river, Shethar-boznai, and their companions, according to that which Darius the king had sent, so they did speedily.",
        "14And the elders of the Jews builded, and they prospered through the prophesying ofHaggaithe prophet and Zechariah the son of Iddo. And they builded, and finishedit,according to the commandment of the God of Israel, and according to the commandment ofCyrus, and Darius, and Artaxerxes king of Persia.",
        "15And this house was finished on the third day of the monthAdar, which was in the sixth year of the reign of Darius the king.",
        "16Â¶And the children of Israel, the priests, and the Levites, and the rest of the children of the captivity, kept thededicationof this house of God with joy,",
        "17And offered at the dedication of this house of God an hundred bullocks, two hundred rams, four hundred lambs; and for a sin offering for all Israel, twelve he goats, according to the number of the tribes of Israel.",
        "18And they set thepriestsin their divisions, and the Levites in theircourses, for theserviceof God, whichisat Jerusalem; as it is written in the book of Moses.",
        "19And the children of the captivity kept thepassoverupon thefourteenthdayof the first month.",
        "20For the priests and the Levites were purified together, all of themwerepure, and killed the passover for all the children of the captivity, and for their brethren the priests, and for themselves.",
        "21And the children of Israel, which were come again out of captivity, and all such as hadseparatedthemselvesunto them from thefilthinessof theheathenof the land, to seek theLordGod of Israel, did eat,",
        "22And kept the feast of unleavened bread seven days with joy: for theLordhad made them joyful, and turned the heart of the king of Assyria unto them,to strengthen their handsin the work of the house of God, the God of Israel."
      ],
      "full_text": "1Then Darius the king made a decree, and search was made in the house of therolls, where the treasures were laid up in Babylon. 2And there was found at Achmetha, in the palace thatisin the province of the Medes, aroll, and thereinwasa record thus written: 3In the first year of Cyrus the kingthe sameCyrus the king made a decreeconcerningthe house of God at Jerusalem, Let thehousebe builded, the place where they offered sacrifices, and let the foundations thereof be strongly laid; the height thereof threescore cubits,andthe breadth thereof threescore cubits; 4Withthree rows of great stones, and a row of new timber: and let the expenses be given out of the kingâs house: 5And also let the golden and silver vessels of the house of God, which Nebuchadnezzar took forth out of the temple whichisat Jerusalem, and brought unto Babylon, be restored, and brought again unto the temple whichisat Jerusalem,every oneto his place, and placethemin the house of God. 6Nowtherefore,Tatnai, governorbeyond the river, Shethar-boznai, and your companions the Apharsachites, whicharebeyond the river, be ye far from thence: 7Let the work of this house of God alone; let the governor of the Jews and the elders of the Jews build this house of God in his place. 8Moreover I make a decree what ye shall do to the elders of these Jews for the building of this house of God: that of the kingâs goods,evenof the tribute beyond the river, forthwith expenses be given unto these men, that they be not hindered. 9And that which they have need of, both young bullocks, and rams, and lambs, for the burnt offerings of the God of heaven, wheat, salt, wine, and oil, according to the appointment of the priests whichareat Jerusalem, let it be given them day by day without fail: 10That they may offersacrificesof sweet savours unto the God of heaven, andprayfor the life of the king, and of his sons. 11Also I have made a decree, that whosoever shall alter this word, let timber be pulled down from his house, and being set up, let him be hanged thereon; and let his house be made a dunghill for this. 12And the God that hath caused his name to dwell there destroy all kings and people, that shall put to their hand to alterandto destroy this house of God whichisat Jerusalem. I Darius have made a decree; let it be done with speed. 13Â¶Then Tatnai, governoronthis side the river, Shethar-boznai, and their companions, according to that which Darius the king had sent, so they did speedily. 14And the elders of the Jews builded, and they prospered through the prophesying ofHaggaithe prophet and Zechariah the son of Iddo. And they builded, and finishedit,according to the commandment of the God of Israel, and according to the commandment ofCyrus, and Darius, and Artaxerxes king of Persia. 15And this house was finished on the third day of the monthAdar, which was in the sixth year of the reign of Darius the king. 16Â¶And the children of Israel, the priests, and the Levites, and the rest of the children of the captivity, kept thededicationof this house of God with joy, 17And offered at the dedication of this house of God an hundred bullocks, two hundred rams, four hundred lambs; and for a sin offering for all Israel, twelve he goats, according to the number of the tribes of Israel. 18And they set thepriestsin their divisions, and the Levites in theircourses, for theserviceof God, whichisat Jerusalem; as it is written in the book of Moses. 19And the children of the captivity kept thepassoverupon thefourteenthdayof the first month. 20For the priests and the Levites were purified together, all of themwerepure, and killed the passover for all the children of the captivity, and for their brethren the priests, and for themselves. 21And the children of Israel, which were come again out of captivity, and all such as hadseparatedthemselvesunto them from thefilthinessof theheathenof the land, to seek theLordGod of Israel, did eat, 22And kept the feast of unleavened bread seven days with joy: for theLordhad made them joyful, and turned the heart of the king of Assyria unto them,to strengthen their handsin the work of the house of God, the God of Israel."
    },
    {
      "reference": "Ezra 7",
      "title": "Ezra 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ezra/7?lang=eng",
      "summary": "Ezra goes up to JerusalemâArtaxerxes provides for beautifying the temple and sustains the Jews in their worship.",
      "verses": [
        "1Now after these things, in the reign of Artaxerxes king of Persia, Ezra the son of Seraiah, the son of Azariah, the son ofHilkiah,",
        "2The son of Shallum, the son of Zadok, the son of Ahitub,",
        "3The son of Amariah, the son of Azariah, the son of Meraioth,",
        "4The son of Zerahiah, the son of Uzzi, the son of Bukki,",
        "5The son of Abishua, the son of Phinehas, the son of Eleazar, the son of Aaron the chief priest:",
        "6This Ezra went up from Babylon; and hewasa readyscribein the law of Moses, which theLordGod of Israel had given: and the king granted him all his request, according to thehandof theLordhis God upon him.",
        "7And there went upsomeof the children of Israel, and of the priests, and the Levites, and the singers, and the porters, and the Nethinims, unto Jerusalem, in the seventh year of Artaxerxes the king.",
        "8And he came to Jerusalem in the fifth month, whichwasin the seventh year of the king.",
        "9For upon the firstdayof the first month began he to go up from Babylon, and on the firstdayof the fifth month came he to Jerusalem, according to the goodhandof his God upon him.",
        "10For Ezra hadpreparedhisheartto seek the law of theLord, and to doit,and to teach in Israelstatutesand judgments.",
        "11Â¶Now thisisthe copy of the letter that the king Artaxerxes gave unto Ezra the priest, the scribe,evenascribeof the words of the commandments of theLord, and of his statutes to Israel.",
        "12Artaxerxes, king of kings, unto Ezra the priest, a scribe of the law of the God of heaven, perfectpeace,and at such a time.",
        "13I make a decree, that all they of the people of Israel, andofhis priests and Levites, in my realm, which are minded of their own freewill to go up to Jerusalem, go with thee.",
        "14Forasmuch as thou art sent of the king, and of his seven counsellors, to inquire concerning Judah and Jerusalem, according to the law of thy God whichisin thine hand;",
        "15And to carry the silver and gold, which the king and his counsellors have freely offered unto the God of Israel, whose habitationisin Jerusalem,",
        "16And all the silver and gold that thou canst find in all the province of Babylon, with the freewill offering of the people, and of the priests, offering willingly for the house of their God whichisin Jerusalem:",
        "17That thou mayest buy speedily with this money bullocks, rams, lambs, with their meat offerings and their drink offerings, and offer them upon the altar of the house of your God whichisin Jerusalem.",
        "18And whatsoever shall seem good to thee, and to thy brethren, to do with the rest of thesilverand the gold, that do after the will of your God.",
        "19The vessels also that are giventhee for the service of the house of thy God,thosedeliver thou before the God of Jerusalem.",
        "20And whatsoever more shall be needful for the house of thy God, which thou shalt have occasion to bestow, bestowitout of the kingâs treasure house.",
        "21And I,evenI Artaxerxes the king, do make a decree to all the treasurers whicharebeyond the river, that whatsoever Ezra the priest, the scribe of the law of the God of heaven, shall require of you, it be done speedily,",
        "22Unto an hundred talents of silver, and to an hundred measures of wheat, and to an hundred baths of wine, and to an hundred baths of oil, and salt without prescribinghow much.",
        "23Whatsoever is commanded by the God of heaven, let it be diligently done for the house of the God of heaven: for why should there be wrath against the realm of the king and his sons?",
        "24Also wecertifyyou, that touching any of the priests and Levites, singers, porters,Nethinims, or ministers of this house of God, it shall not be lawful to impose toll, tribute, or custom, upon them.",
        "25And thou, Ezra, after the wisdom of thy God, thatisin thine hand, set magistrates andjudges, which may judge all the people thatarebeyond the river, all such as know thelawsof thy God; andteachye them that knowthemnot.",
        "26And whosoever will not do the law of thy God, and the law of the king, let judgment be executed speedily upon him, whetherit beuntodeath, or to banishment, or to confiscation of goods, or to imprisonment.",
        "27Â¶BlessedbetheLordGod of our fathers, which hath putsuch a thingas this in the kingâs heart, tobeautifythe house of theLordwhichisin Jerusalem:",
        "28And hath extended mercy unto me before the king, and his counsellors, and before all the kingâs mighty princes. And I was strengthened as the hand of theLordmy Godwasupon me, and I gathered together out of Israel chief men to go up with me."
      ],
      "full_text": "1Now after these things, in the reign of Artaxerxes king of Persia, Ezra the son of Seraiah, the son of Azariah, the son ofHilkiah, 2The son of Shallum, the son of Zadok, the son of Ahitub, 3The son of Amariah, the son of Azariah, the son of Meraioth, 4The son of Zerahiah, the son of Uzzi, the son of Bukki, 5The son of Abishua, the son of Phinehas, the son of Eleazar, the son of Aaron the chief priest: 6This Ezra went up from Babylon; and hewasa readyscribein the law of Moses, which theLordGod of Israel had given: and the king granted him all his request, according to thehandof theLordhis God upon him. 7And there went upsomeof the children of Israel, and of the priests, and the Levites, and the singers, and the porters, and the Nethinims, unto Jerusalem, in the seventh year of Artaxerxes the king. 8And he came to Jerusalem in the fifth month, whichwasin the seventh year of the king. 9For upon the firstdayof the first month began he to go up from Babylon, and on the firstdayof the fifth month came he to Jerusalem, according to the goodhandof his God upon him. 10For Ezra hadpreparedhisheartto seek the law of theLord, and to doit,and to teach in Israelstatutesand judgments. 11Â¶Now thisisthe copy of the letter that the king Artaxerxes gave unto Ezra the priest, the scribe,evenascribeof the words of the commandments of theLord, and of his statutes to Israel. 12Artaxerxes, king of kings, unto Ezra the priest, a scribe of the law of the God of heaven, perfectpeace,and at such a time. 13I make a decree, that all they of the people of Israel, andofhis priests and Levites, in my realm, which are minded of their own freewill to go up to Jerusalem, go with thee. 14Forasmuch as thou art sent of the king, and of his seven counsellors, to inquire concerning Judah and Jerusalem, according to the law of thy God whichisin thine hand; 15And to carry the silver and gold, which the king and his counsellors have freely offered unto the God of Israel, whose habitationisin Jerusalem, 16And all the silver and gold that thou canst find in all the province of Babylon, with the freewill offering of the people, and of the priests, offering willingly for the house of their God whichisin Jerusalem: 17That thou mayest buy speedily with this money bullocks, rams, lambs, with their meat offerings and their drink offerings, and offer them upon the altar of the house of your God whichisin Jerusalem. 18And whatsoever shall seem good to thee, and to thy brethren, to do with the rest of thesilverand the gold, that do after the will of your God. 19The vessels also that are giventhee for the service of the house of thy God,thosedeliver thou before the God of Jerusalem. 20And whatsoever more shall be needful for the house of thy God, which thou shalt have occasion to bestow, bestowitout of the kingâs treasure house. 21And I,evenI Artaxerxes the king, do make a decree to all the treasurers whicharebeyond the river, that whatsoever Ezra the priest, the scribe of the law of the God of heaven, shall require of you, it be done speedily, 22Unto an hundred talents of silver, and to an hundred measures of wheat, and to an hundred baths of wine, and to an hundred baths of oil, and salt without prescribinghow much. 23Whatsoever is commanded by the God of heaven, let it be diligently done for the house of the God of heaven: for why should there be wrath against the realm of the king and his sons? 24Also wecertifyyou, that touching any of the priests and Levites, singers, porters,Nethinims, or ministers of this house of God, it shall not be lawful to impose toll, tribute, or custom, upon them. 25And thou, Ezra, after the wisdom of thy God, thatisin thine hand, set magistrates andjudges, which may judge all the people thatarebeyond the river, all such as know thelawsof thy God; andteachye them that knowthemnot. 26And whosoever will not do the law of thy God, and the law of the king, let judgment be executed speedily upon him, whetherit beuntodeath, or to banishment, or to confiscation of goods, or to imprisonment. 27Â¶BlessedbetheLordGod of our fathers, which hath putsuch a thingas this in the kingâs heart, tobeautifythe house of theLordwhichisin Jerusalem: 28And hath extended mercy unto me before the king, and his counsellors, and before all the kingâs mighty princes. And I was strengthened as the hand of theLordmy Godwasupon me, and I gathered together out of Israel chief men to go up with me."
    },
    {
      "reference": "Nehemiah 2",
      "title": "Nehemiah 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/neh/2?lang=eng",
      "summary": "Artaxerxes sends Nehemiah to JerusalemâSanballat and others oppose Nehemiah in rebuilding the walls and gates of Jerusalem.",
      "verses": [
        "1And it came to pass in the month Nisan, in the twentieth year of Artaxerxes the king,thatwinewasbefore him: and I took up the wine, and gaveitunto the king. Now I had not beenbeforetimesad in his presence.",
        "2Wherefore the king said unto me, Whyisthy countenance sad, seeing thouartnot sick? thisisnothingelsebut sorrow of heart. Then I was very sore afraid,",
        "3And said unto the king, Let the king live for ever: why should not my countenance besad, when the city, the place of my fathersâ sepulchres,liethwaste, and the gates thereof are consumed with fire?",
        "4Then the king said unto me, For what dost thou make request? So I prayed to the God of heaven.",
        "5And I said unto the king, If it please the king, and if thy servant have found favour in thy sight, that thou wouldest send me unto Judah, unto the city of my fathersâ sepulchres, that I may build it.",
        "6And the king said unto me, (the queen also sitting by him,) For how long shall thy journey be? and when wilt thou return? So it pleased the king to send me; and I set him a time.",
        "7Moreover I said unto the king, If it please the king, let letters be given me to the governorsbeyond the river, that they may convey me over till I come into Judah;",
        "8And a letter unto Asaph the keeper of the kingâs forest, that he may give me timber to make beams for the gates of the palace whichappertainedto the house, and for the wall of the city, and for the house that I shall enter into. And the king granted me, according to the good hand of my God upon me.",
        "9Â¶Then I came to the governors beyond the river, and gave them the kingâs letters. Now the king had sent captains of the army and horsemen with me.",
        "10WhenSanballatthe Horonite, andTobiahthe servant, the Ammonite, heardof it,it grieved them exceedingly that there was come a man to seek the welfare of the children of Israel.",
        "11So I came to Jerusalem, and was there three days.",
        "12Â¶And I arose in the night, I and some few men with me; neither told Ianyman what my God had put in my heart to do at Jerusalem: neitherwas there anybeast with me, save the beast that I rode upon.",
        "13And I went out by night bythegateof thevalley, even before thedragon well, and to thedung port, and viewed the walls of Jerusalem, which were broken down, and the gates thereof were consumed with fire.",
        "14Then I went on to thegateof the fountain, and to the kingâs pool: butthere wasno place for the beastthat wasunder me to pass.",
        "15Then went I up in the night by the brook, and viewed the wall, and turned back, and entered by the gate of the valley, andsoreturned.",
        "16And the rulers knew not whither I went, or what I did; neither had I as yet tolditto the Jews, nor to the priests, nor to the nobles, nor to the rulers, nor to the rest that did the work.",
        "17Â¶Then said I unto them, Ye see the distress that wearein, how Jerusalemliethwaste, and the gates thereof are burned with fire: come, and let us build up the wall of Jerusalem, that we be no more a reproach.",
        "18Then I told them of the hand of my God which was good upon me; as also the kingâs words that he had spoken unto me. And they said, Let us rise up and build. So they strengthened their hands forthisgoodwork.",
        "19But when Sanballat the Horonite, and Tobiah the servant, the Ammonite, and Geshem the Arabian, heardit,theylaughedus toscorn, and despised us, and said, Whatisthis thing that ye do? will ye rebel against the king?",
        "20Then answered I them, and said unto them, The God of heaven, he will prosper us; therefore we his servants will arise and build: but ye have no portion, nor right, nor memorial, in Jerusalem."
      ],
      "full_text": "1And it came to pass in the month Nisan, in the twentieth year of Artaxerxes the king,thatwinewasbefore him: and I took up the wine, and gaveitunto the king. Now I had not beenbeforetimesad in his presence. 2Wherefore the king said unto me, Whyisthy countenance sad, seeing thouartnot sick? thisisnothingelsebut sorrow of heart. Then I was very sore afraid, 3And said unto the king, Let the king live for ever: why should not my countenance besad, when the city, the place of my fathersâ sepulchres,liethwaste, and the gates thereof are consumed with fire? 4Then the king said unto me, For what dost thou make request? So I prayed to the God of heaven. 5And I said unto the king, If it please the king, and if thy servant have found favour in thy sight, that thou wouldest send me unto Judah, unto the city of my fathersâ sepulchres, that I may build it. 6And the king said unto me, (the queen also sitting by him,) For how long shall thy journey be? and when wilt thou return? So it pleased the king to send me; and I set him a time. 7Moreover I said unto the king, If it please the king, let letters be given me to the governorsbeyond the river, that they may convey me over till I come into Judah; 8And a letter unto Asaph the keeper of the kingâs forest, that he may give me timber to make beams for the gates of the palace whichappertainedto the house, and for the wall of the city, and for the house that I shall enter into. And the king granted me, according to the good hand of my God upon me. 9Â¶Then I came to the governors beyond the river, and gave them the kingâs letters. Now the king had sent captains of the army and horsemen with me. 10WhenSanballatthe Horonite, andTobiahthe servant, the Ammonite, heardof it,it grieved them exceedingly that there was come a man to seek the welfare of the children of Israel. 11So I came to Jerusalem, and was there three days. 12Â¶And I arose in the night, I and some few men with me; neither told Ianyman what my God had put in my heart to do at Jerusalem: neitherwas there anybeast with me, save the beast that I rode upon. 13And I went out by night bythegateof thevalley, even before thedragon well, and to thedung port, and viewed the walls of Jerusalem, which were broken down, and the gates thereof were consumed with fire. 14Then I went on to thegateof the fountain, and to the kingâs pool: butthere wasno place for the beastthat wasunder me to pass. 15Then went I up in the night by the brook, and viewed the wall, and turned back, and entered by the gate of the valley, andsoreturned. 16And the rulers knew not whither I went, or what I did; neither had I as yet tolditto the Jews, nor to the priests, nor to the nobles, nor to the rulers, nor to the rest that did the work. 17Â¶Then said I unto them, Ye see the distress that wearein, how Jerusalemliethwaste, and the gates thereof are burned with fire: come, and let us build up the wall of Jerusalem, that we be no more a reproach. 18Then I told them of the hand of my God which was good upon me; as also the kingâs words that he had spoken unto me. And they said, Let us rise up and build. So they strengthened their hands forthisgoodwork. 19But when Sanballat the Horonite, and Tobiah the servant, the Ammonite, and Geshem the Arabian, heardit,theylaughedus toscorn, and despised us, and said, Whatisthis thing that ye do? will ye rebel against the king? 20Then answered I them, and said unto them, The God of heaven, he will prosper us; therefore we his servants will arise and build: but ye have no portion, nor right, nor memorial, in Jerusalem."
    },
    {
      "reference": "Nehemiah 4",
      "title": "Nehemiah 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/neh/4?lang=eng",
      "summary": "The Jewsâ enemies seek to prevent them from rebuilding the walls of JerusalemâNehemiah arms the laborers and keeps the work progressing.",
      "verses": [
        "1But it came to pass, that whenSanballatheard that we builded the wall, he was wroth, and took great indignation, and mocked the Jews.",
        "2And he spake before his brethren and the army of Samaria, and said, What do these feeble Jews? will they fortify themselves? will they sacrifice? will they make an end in a day? will they revive the stones out of the heaps of the rubbish which are burned?",
        "3Now Tobiah the Ammonitewasby him, and he said, Even that which they build, if a fox go up, he shall even break down their stone wall.",
        "4Hear, O our God; for we are despised: and turn their reproach upon their own head, and give them for a prey in the land of captivity:",
        "5And cover not their iniquity, and let not their sin be blotted out from before thee: for they have provokedtheeto anger before the builders.",
        "6So built we the wall; and all the wall was joined together unto the half thereof: for thepeoplehad a mind towork.",
        "7Â¶But it came to pass,thatwhenSanballat, and Tobiah, and the Arabians, and the Ammonites, and the Ashdodites, heard that the walls of Jerusalem were made up,andthat the breaches began to be stopped, then they were very wroth,",
        "8And conspired all of them together to comeandto fight against Jerusalem, and to hinder it.",
        "9Nevertheless we made our prayer unto our God, and set a watch against them day and night, because of them.",
        "10And Judah said, The strength of the bearers of burdens is decayed, andthere ismuch rubbish; so that we are not able to build the wall.",
        "11And our adversaries said, They shall not know, neither see, till we come in the midst among them, and slay them, and cause the work to cease.",
        "12And it came to pass, that when the Jews which dwelt by them came, they said unto us ten times, From all places whence ye shall return unto usthey will be upon you.",
        "13Â¶Therefore set I in the lower places behind the wall,andon the higher places, I even set the people after their families with their swords, their spears, and their bows.",
        "14And I looked, and rose up, and said unto the nobles, and to the rulers, and to the rest of the people, Be not yeafraidof them: remember the Lord,which isgreat andterrible, andfightfor your brethren, your sons, and your daughters, yourwives, and your houses.",
        "15And it came to pass, when our enemies heard that it was known unto us, and God had brought theircounselto nought, that we returnedall of us to the wall, every one unto his work.",
        "16And it came to pass from that time forth,thatthe half of my servants wrought in the work, and the other half of them held both the spears, the shields, and the bows, and thehabergeons; and the rulerswerebehind all the house of Judah.",
        "17They which builded on the wall, and they that bare burdens, with those that laded,every onewith one of his hands wrought in the work, and with the otherhandheld a weapon.",
        "18For the builders, every one had his sword girded by his side, andsobuilded. And he that sounded the trumpetwasby me.",
        "19Â¶And I said unto the nobles, and to the rulers, and to the rest of the people, The workisgreat and large, and we are separated upon the wall, one far from another.",
        "20In what placethereforeye hear the sound of the trumpet, resort ye thither unto us: our God shall fight for us.",
        "21So we laboured in the work: and half of them held the spears from the rising of the morning till the stars appeared.",
        "22Likewise at the same time said I unto the people, Let every one with his servant lodge within Jerusalem, that in the night they may be a guard to us, and labour on the day.",
        "23So neither I, nor my brethren, nor my servants, nor the men of the guard which followed me, none of us put off our clothes,saving thatevery one put them off for washing."
      ],
      "full_text": "1But it came to pass, that whenSanballatheard that we builded the wall, he was wroth, and took great indignation, and mocked the Jews. 2And he spake before his brethren and the army of Samaria, and said, What do these feeble Jews? will they fortify themselves? will they sacrifice? will they make an end in a day? will they revive the stones out of the heaps of the rubbish which are burned? 3Now Tobiah the Ammonitewasby him, and he said, Even that which they build, if a fox go up, he shall even break down their stone wall. 4Hear, O our God; for we are despised: and turn their reproach upon their own head, and give them for a prey in the land of captivity: 5And cover not their iniquity, and let not their sin be blotted out from before thee: for they have provokedtheeto anger before the builders. 6So built we the wall; and all the wall was joined together unto the half thereof: for thepeoplehad a mind towork. 7Â¶But it came to pass,thatwhenSanballat, and Tobiah, and the Arabians, and the Ammonites, and the Ashdodites, heard that the walls of Jerusalem were made up,andthat the breaches began to be stopped, then they were very wroth, 8And conspired all of them together to comeandto fight against Jerusalem, and to hinder it. 9Nevertheless we made our prayer unto our God, and set a watch against them day and night, because of them. 10And Judah said, The strength of the bearers of burdens is decayed, andthere ismuch rubbish; so that we are not able to build the wall. 11And our adversaries said, They shall not know, neither see, till we come in the midst among them, and slay them, and cause the work to cease. 12And it came to pass, that when the Jews which dwelt by them came, they said unto us ten times, From all places whence ye shall return unto usthey will be upon you. 13Â¶Therefore set I in the lower places behind the wall,andon the higher places, I even set the people after their families with their swords, their spears, and their bows. 14And I looked, and rose up, and said unto the nobles, and to the rulers, and to the rest of the people, Be not yeafraidof them: remember the Lord,which isgreat andterrible, andfightfor your brethren, your sons, and your daughters, yourwives, and your houses. 15And it came to pass, when our enemies heard that it was known unto us, and God had brought theircounselto nought, that we returnedall of us to the wall, every one unto his work. 16And it came to pass from that time forth,thatthe half of my servants wrought in the work, and the other half of them held both the spears, the shields, and the bows, and thehabergeons; and the rulerswerebehind all the house of Judah. 17They which builded on the wall, and they that bare burdens, with those that laded,every onewith one of his hands wrought in the work, and with the otherhandheld a weapon. 18For the builders, every one had his sword girded by his side, andsobuilded. And he that sounded the trumpetwasby me. 19Â¶And I said unto the nobles, and to the rulers, and to the rest of the people, The workisgreat and large, and we are separated upon the wall, one far from another. 20In what placethereforeye hear the sound of the trumpet, resort ye thither unto us: our God shall fight for us. 21So we laboured in the work: and half of them held the spears from the rising of the morning till the stars appeared. 22Likewise at the same time said I unto the people, Let every one with his servant lodge within Jerusalem, that in the night they may be a guard to us, and labour on the day. 23So neither I, nor my brethren, nor my servants, nor the men of the guard which followed me, none of us put off our clothes,saving thatevery one put them off for washing."
    },
    {
      "reference": "Nehemiah 5",
      "title": "Nehemiah 5",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/neh/5?lang=eng",
      "summary": "Many Jews are in bondage to their fellow JewsâAt Nehemiahâs direction they are freed, their lands are restored, and the taking of usury is discontinued.",
      "verses": [
        "1And there was a great cry of the people and of their wives against their brethren the Jews.",
        "2For there were that said, We, our sons, and our daughters,aremany: therefore we take up cornfor them,that we may eat, and live.",
        "3Somealso there were that said, We have mortgaged our lands, vineyards, and houses, that we might buy corn, because of thedearth.",
        "4There were also that said, We haveborrowedmoney for the kingâs tribute,and that uponour lands and vineyards.",
        "5Yet now our fleshisas the flesh of our brethren, our children as their children: and, lo, we bring into bondage our sons and our daughters to be servants, andsomeof our daughters are brought unto bondagealready:neitheris itin our powerto redeem them;for other men have our lands and vineyards.",
        "6Â¶And I was very angry when I heard their cry and these words.",
        "7Then I consulted with myself, and I rebuked the nobles, and the rulers, and said unto them, Ye exactusury, every one of his brother. And I set a great assembly against them.",
        "8And I said unto them, We after our ability have redeemed our brethren the Jews, which were sold unto the heathen; and will ye even sell your brethren? or shall they be sold unto us? Then held they their peace, and found nothingto answer.",
        "9Also I said, Itisnot good that ye do: ought ye not towalkin the fear of our God because of the reproach of theheathenour enemies?",
        "10I likewise,andmy brethren, and my servants, might exact of them money and corn: I pray you, let us leave off this usury.",
        "11Restore, I pray you, to them, even this day, their lands, their vineyards, their oliveyards, and their houses, alsothehundredthpartof the money, and of the corn, the wine, and the oil, that ye exact of them.",
        "12Then said they, We will restorethem,and will require nothing of them; so will we do as thou sayest. Then I called the priests, and took an oath of them, that they should do according to this promise.",
        "13Also I shook my lap, and said, So God shake out every man from his house, and from his labour, that performeth not this promise, even thus be he shaken out, and emptied. And all the congregation said, Amen, and praised theLord. And the people did according to this promise.",
        "14Â¶Moreover from the time that I was appointed to be their governor in the land of Judah, from the twentieth year even unto the two and thirtieth year of Artaxerxes the king,that is,twelve years, I and my brethrenhavenot eaten thebreadof the governor.",
        "15But the former governors thathad beenbefore mewerechargeable unto the people, and had taken of them bread and wine, beside forty shekels of silver; yea, even their servants bareruleover the people: but so did not I, because of thefearof God.",
        "16Yea, also I continued in the work of this wall, neither bought we any land: and all my servantsweregathered thither unto the work.",
        "17Moreoverthere wereat my table an hundred and fifty of the Jews and rulers, beside those that came unto us from among the heathen thatareabout us.",
        "18Nowthatwhich was preparedfor medailywasone oxandsix choice sheep; also fowls were prepared for me, and once in ten days store of all sorts of wine: yet for all this required not I the bread of the governor, because the bondage was heavy upon this people.",
        "19Think upon me, my God, for good,accordingto all that I have done for this people."
      ],
      "full_text": "1And there was a great cry of the people and of their wives against their brethren the Jews. 2For there were that said, We, our sons, and our daughters,aremany: therefore we take up cornfor them,that we may eat, and live. 3Somealso there were that said, We have mortgaged our lands, vineyards, and houses, that we might buy corn, because of thedearth. 4There were also that said, We haveborrowedmoney for the kingâs tribute,and that uponour lands and vineyards. 5Yet now our fleshisas the flesh of our brethren, our children as their children: and, lo, we bring into bondage our sons and our daughters to be servants, andsomeof our daughters are brought unto bondagealready:neitheris itin our powerto redeem them;for other men have our lands and vineyards. 6Â¶And I was very angry when I heard their cry and these words. 7Then I consulted with myself, and I rebuked the nobles, and the rulers, and said unto them, Ye exactusury, every one of his brother. And I set a great assembly against them. 8And I said unto them, We after our ability have redeemed our brethren the Jews, which were sold unto the heathen; and will ye even sell your brethren? or shall they be sold unto us? Then held they their peace, and found nothingto answer. 9Also I said, Itisnot good that ye do: ought ye not towalkin the fear of our God because of the reproach of theheathenour enemies? 10I likewise,andmy brethren, and my servants, might exact of them money and corn: I pray you, let us leave off this usury. 11Restore, I pray you, to them, even this day, their lands, their vineyards, their oliveyards, and their houses, alsothehundredthpartof the money, and of the corn, the wine, and the oil, that ye exact of them. 12Then said they, We will restorethem,and will require nothing of them; so will we do as thou sayest. Then I called the priests, and took an oath of them, that they should do according to this promise. 13Also I shook my lap, and said, So God shake out every man from his house, and from his labour, that performeth not this promise, even thus be he shaken out, and emptied. And all the congregation said, Amen, and praised theLord. And the people did according to this promise. 14Â¶Moreover from the time that I was appointed to be their governor in the land of Judah, from the twentieth year even unto the two and thirtieth year of Artaxerxes the king,that is,twelve years, I and my brethrenhavenot eaten thebreadof the governor. 15But the former governors thathad beenbefore mewerechargeable unto the people, and had taken of them bread and wine, beside forty shekels of silver; yea, even their servants bareruleover the people: but so did not I, because of thefearof God. 16Yea, also I continued in the work of this wall, neither bought we any land: and all my servantsweregathered thither unto the work. 17Moreoverthere wereat my table an hundred and fifty of the Jews and rulers, beside those that came unto us from among the heathen thatareabout us. 18Nowthatwhich was preparedfor medailywasone oxandsix choice sheep; also fowls were prepared for me, and once in ten days store of all sorts of wine: yet for all this required not I the bread of the governor, because the bondage was heavy upon this people. 19Think upon me, my God, for good,accordingto all that I have done for this people."
    },
    {
      "reference": "Nehemiah 6",
      "title": "Nehemiah 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/neh/6?lang=eng",
      "summary": "Sanballat engages in intrigue against Nehemiah and the building of the wallâThe Jews finish the construction of the wall.",
      "verses": [
        "1Now it came to pass, whenSanballat, and Tobiah, and Geshem the Arabian, and the rest of our enemies, heard that I had builded the wall, andthatthere was no breach left therein; (though at that time I had not set up the doors upon the gates;)",
        "2That Sanballat and Geshem sent unto me, saying, Come, let us meet together insome one ofthe villages in the plain of Ono. But they thought to do memischief.",
        "3And I sent messengers unto them, saying, Iamdoing a great work, so that I cannot come down: why should the work cease, whilst I leave it, and come down to you?",
        "4Yet they sent unto me four times after this sort; and I answered them after the same manner.",
        "5Then sent Sanballat his servant unto me in like manner the fifth time with an open letter in his hand;",
        "6Whereinwaswritten, It is reported among the heathen, andGashmusaithit, thatthou and the Jews think to rebel: for which cause thou buildest the wall, that thou mayest be their king, according to these words.",
        "7And thou hast also appointed prophets to preach of thee at Jerusalem, saying,There isa king in Judah: and now shall it be reported to the king according to these words. Come now therefore, and let us take counsel together.",
        "8Then I sent unto him, saying, There are no such things done as thou sayest, but thoufeignestthem out of thine own heart.",
        "9For they all made us afraid, saying, Their hands shall be weakened from the work, that it be not done. Now therefore,O God,strengthen my hands.",
        "10Afterward I came unto the house of Shemaiah the son of Delaiah the son of Mehetabeel, whowasshut up; and he said, Let us meet together in the house of God, within the temple, and let us shut the doors of the temple: for they will come to slay thee; yea, in the night will they come to slay thee.",
        "11And I said, Should such a man as I flee? and whoisthere,that,beingas Iam,would go into the temple to save his life? I will not go in.",
        "12And, lo, I perceived that God had not sent him; but that he pronounced this prophecy against me: for Tobiah and Sanballat had hired him.",
        "13Thereforewashe hired, that I should beafraid, and do so, and sin, andthatthey might havematterfor anevil report, that they might reproach me.",
        "14My God, think thou upon Tobiah and Sanballat according to these their works, and on the prophetess Noadiah, and the rest of the prophets, that would have put me in fear.",
        "15Â¶So the wall was finished in the twenty and fifthdayofthe monthElul, in fifty and two days.",
        "16And it came to pass, that when all ourenemiesheardthereof,and all the heathen thatwereabout us sawthese things,they were much cast down in their own eyes: for they perceived that this work was wrought of our God.",
        "17Â¶Moreover in those days the nobles of Judah sent many letters unto Tobiah, andthe lettersof Tobiah came unto them.",
        "18Forthere weremany in Judah sworn unto him, because hewasthe son in law of Shechaniah the son of Arah; and his son Johanan had taken the daughter ofMeshullamthe son of Berechiah.",
        "19Also they reported his good deeds before me, and uttered my words to him.AndTobiah sent letters to put me in fear."
      ],
      "full_text": "1Now it came to pass, whenSanballat, and Tobiah, and Geshem the Arabian, and the rest of our enemies, heard that I had builded the wall, andthatthere was no breach left therein; (though at that time I had not set up the doors upon the gates;) 2That Sanballat and Geshem sent unto me, saying, Come, let us meet together insome one ofthe villages in the plain of Ono. But they thought to do memischief. 3And I sent messengers unto them, saying, Iamdoing a great work, so that I cannot come down: why should the work cease, whilst I leave it, and come down to you? 4Yet they sent unto me four times after this sort; and I answered them after the same manner. 5Then sent Sanballat his servant unto me in like manner the fifth time with an open letter in his hand; 6Whereinwaswritten, It is reported among the heathen, andGashmusaithit, thatthou and the Jews think to rebel: for which cause thou buildest the wall, that thou mayest be their king, according to these words. 7And thou hast also appointed prophets to preach of thee at Jerusalem, saying,There isa king in Judah: and now shall it be reported to the king according to these words. Come now therefore, and let us take counsel together. 8Then I sent unto him, saying, There are no such things done as thou sayest, but thoufeignestthem out of thine own heart. 9For they all made us afraid, saying, Their hands shall be weakened from the work, that it be not done. Now therefore,O God,strengthen my hands. 10Afterward I came unto the house of Shemaiah the son of Delaiah the son of Mehetabeel, whowasshut up; and he said, Let us meet together in the house of God, within the temple, and let us shut the doors of the temple: for they will come to slay thee; yea, in the night will they come to slay thee. 11And I said, Should such a man as I flee? and whoisthere,that,beingas Iam,would go into the temple to save his life? I will not go in. 12And, lo, I perceived that God had not sent him; but that he pronounced this prophecy against me: for Tobiah and Sanballat had hired him. 13Thereforewashe hired, that I should beafraid, and do so, and sin, andthatthey might havematterfor anevil report, that they might reproach me. 14My God, think thou upon Tobiah and Sanballat according to these their works, and on the prophetess Noadiah, and the rest of the prophets, that would have put me in fear. 15Â¶So the wall was finished in the twenty and fifthdayofthe monthElul, in fifty and two days. 16And it came to pass, that when all ourenemiesheardthereof,and all the heathen thatwereabout us sawthese things,they were much cast down in their own eyes: for they perceived that this work was wrought of our God. 17Â¶Moreover in those days the nobles of Judah sent many letters unto Tobiah, andthe lettersof Tobiah came unto them. 18Forthere weremany in Judah sworn unto him, because hewasthe son in law of Shechaniah the son of Arah; and his son Johanan had taken the daughter ofMeshullamthe son of Berechiah. 19Also they reported his good deeds before me, and uttered my words to him.AndTobiah sent letters to put me in fear."
    },
    {
      "reference": "Nehemiah 8",
      "title": "Nehemiah 8",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/neh/8?lang=eng",
      "summary": "Ezra reads and interprets the law of Moses to the peopleâThey keep the Feast of Tabernacles.",
      "verses": [
        "1And all the people gathered themselves together as one man into the street thatwasbefore thewater gate; and they spake untoEzrathescribeto bring the book of the law of Moses, which theLordhad commanded to Israel.",
        "2And Ezra the priest brought thelawbefore the congregation both of men and women, and all that could hear with understanding, upon the first day of the seventh month.",
        "3And he read therein before the street thatwasbefore the water gate from the morning until midday, before the men and the women, and those that could understand; and the ears of all the peoplewere attentiveunto thebookof the law.",
        "4And Ezra the scribe stood upon apulpitof wood, which they had made for the purpose; and beside him stood Mattithiah, and Shema, and Anaiah, and Urijah, and Hilkiah, and Maaseiah, on his right hand; and on his left hand, Pedaiah, and Mishael, and Malchiah, and Hashum, and Hashbadana, Zechariah,andMeshullam.",
        "5And Ezra opened the book in the sight of all the people; (for he was above all the people;) and when he opened it, all the people stood up:",
        "6And Ezra blessed theLord, the great God. And all the people answered, Amen, Amen, with lifting up their hands: and they bowed their heads, and worshipped theLordwiththeirfaces to the ground.",
        "7Also Jeshua, and Bani, and Sherebiah, Jamin, Akkub, Shabbethai, Hodijah, Maaseiah, Kelita, Azariah, Jozabad, Hanan, Pelaiah, and the Levites, caused the people to understand the law: and the peoplestoodin their place.",
        "8So they read in the book in thelawof Goddistinctly, andgave the sense, and causedthemto understand the reading.",
        "9Â¶And Nehemiah, whichistheTirshatha, and Ezra the priest the scribe, and the Levites thattaughtthe people, said unto all the people, This dayisholy unto theLordyour God;mournnot, nor weep. For all the peoplewept, when they heard the words of the law.",
        "10Then he said unto them, Go your way, eat the fat, and drink the sweet, and sendportionsunto them for whom nothing is prepared: forthisdayisholy unto our Lord: neither be yesorry; for the joy of theLordis yourstrength.",
        "11So the Levites stilled all the people, saying, Hold your peace, for the dayisholy; neither be ye grieved.",
        "12And all the people went their way to eat, and to drink, and to send portions, and to make greatmirth, because they hadunderstoodthe words that were declared unto them.",
        "13Â¶And on the second day were gathered together the chief of the fathers of all the people, the priests, and the Levites, unto Ezra the scribe, even tounderstandthe words of the law.",
        "14And they found written in the law which theLordhad commanded by Moses, thatthechildren of Israel should dwell in booths in thefeastof the seventh month:",
        "15And that they should publish and proclaim in all their cities, and in Jerusalem, saying, Go forth unto the mount, and fetch olive branches,and pine branches, and myrtle branches, and palm branches, and branches of thick trees, to make booths, asit iswritten.",
        "16Â¶So the people went forth, and broughtthem,and made themselves booths, every one upon the roof of his house, and in their courts, and in the courts of the house of God, and in the street of the water gate, and in the street of the gate ofEphraim.",
        "17And all the congregation of them that were come again out of the captivity madebooths, and sat under the booths: for since the days ofJeshuathe son ofNununto that day had not the children of Israel done so. And there was very great gladness.",
        "18Also day by day, from the first day unto the last day, hereadin the book of the law of God. And they kept the feast seven days; and on the eighth daywasasolemn assembly, according unto the manner."
      ],
      "full_text": "1And all the people gathered themselves together as one man into the street thatwasbefore thewater gate; and they spake untoEzrathescribeto bring the book of the law of Moses, which theLordhad commanded to Israel. 2And Ezra the priest brought thelawbefore the congregation both of men and women, and all that could hear with understanding, upon the first day of the seventh month. 3And he read therein before the street thatwasbefore the water gate from the morning until midday, before the men and the women, and those that could understand; and the ears of all the peoplewere attentiveunto thebookof the law. 4And Ezra the scribe stood upon apulpitof wood, which they had made for the purpose; and beside him stood Mattithiah, and Shema, and Anaiah, and Urijah, and Hilkiah, and Maaseiah, on his right hand; and on his left hand, Pedaiah, and Mishael, and Malchiah, and Hashum, and Hashbadana, Zechariah,andMeshullam. 5And Ezra opened the book in the sight of all the people; (for he was above all the people;) and when he opened it, all the people stood up: 6And Ezra blessed theLord, the great God. And all the people answered, Amen, Amen, with lifting up their hands: and they bowed their heads, and worshipped theLordwiththeirfaces to the ground. 7Also Jeshua, and Bani, and Sherebiah, Jamin, Akkub, Shabbethai, Hodijah, Maaseiah, Kelita, Azariah, Jozabad, Hanan, Pelaiah, and the Levites, caused the people to understand the law: and the peoplestoodin their place. 8So they read in the book in thelawof Goddistinctly, andgave the sense, and causedthemto understand the reading. 9Â¶And Nehemiah, whichistheTirshatha, and Ezra the priest the scribe, and the Levites thattaughtthe people, said unto all the people, This dayisholy unto theLordyour God;mournnot, nor weep. For all the peoplewept, when they heard the words of the law. 10Then he said unto them, Go your way, eat the fat, and drink the sweet, and sendportionsunto them for whom nothing is prepared: forthisdayisholy unto our Lord: neither be yesorry; for the joy of theLordis yourstrength. 11So the Levites stilled all the people, saying, Hold your peace, for the dayisholy; neither be ye grieved. 12And all the people went their way to eat, and to drink, and to send portions, and to make greatmirth, because they hadunderstoodthe words that were declared unto them. 13Â¶And on the second day were gathered together the chief of the fathers of all the people, the priests, and the Levites, unto Ezra the scribe, even tounderstandthe words of the law. 14And they found written in the law which theLordhad commanded by Moses, thatthechildren of Israel should dwell in booths in thefeastof the seventh month: 15And that they should publish and proclaim in all their cities, and in Jerusalem, saying, Go forth unto the mount, and fetch olive branches,and pine branches, and myrtle branches, and palm branches, and branches of thick trees, to make booths, asit iswritten. 16Â¶So the people went forth, and broughtthem,and made themselves booths, every one upon the roof of his house, and in their courts, and in the courts of the house of God, and in the street of the water gate, and in the street of the gate ofEphraim. 17And all the congregation of them that were come again out of the captivity madebooths, and sat under the booths: for since the days ofJeshuathe son ofNununto that day had not the children of Israel done so. And there was very great gladness. 18Also day by day, from the first day unto the last day, hereadin the book of the law of God. And they kept the feast seven days; and on the eighth daywasasolemn assembly, according unto the manner."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:30:06",
  "metadata": {
    "week_number": 31,
    "title": "Week 31: July 27–August 2 - Ezra 1; 3–7; Nehemiah 2; 4–6; 8",
    "date_range": "July 27–August 2",
    "scraped_at": "2025-12-21T22:30:14.232569",
    "scraper_version": "2.0.0"
  }
}