{
  "week_number": 12,
  "date_range": "March 16–22",
  "title": "Week 12: March 16–22 - Genesis 42–50",
  "bundle_title": "Week 12: March 16–22: \"Week 12: March 16–22 - Genesis 42–50\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/12?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/12?lang=eng",
    "title": "Genesis 42–50",
    "scripture_references": "Genesis 42–50",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“March 16–22. ‘God Meant It unto Good’: Genesis 42–50,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“March 16–22. ‘God Meant It unto Good’,”Come, Follow Me: 2026\n\nIt had been about 22 years since Joseph’s brothers sold him into slavery. Joseph had suffered many trials, including false accusations and imprisonment. When he finally saw his brothers again, Joseph was the governor of all Egypt, second only to the pharaoh. He could easily have taken revenge on his brothers, and considering what they had done to Joseph, that might seem understandable. And yet Joseph forgave them. Not only that, but he helped them see divine purpose in his suffering. “God meant it unto good” (Genesis 50:20), he told them, because it put him in a position to save “all his father’s household” (Genesis 47:12) from famine.\n\nIn many ways, Joseph was like Jesus Christ. Even though our sins caused Jesus great suffering, He offers forgiveness, delivering all of us from a fate far worse than famine. Whether we need to receive forgiveness or extend it—at some point we all need to do both—Joseph’s example points us to the Savior, the true source of healing and reconciliation.",
    "learning_at_home_church": [
      {
        "title": "“God sent me before you to preserve you.”",
        "content": "Have you noticed any similarities between Joseph’s life and the atoning mission of Jesus Christ? To see some examples of these similarities, try comparing:\n\nGenesis 37:3withMatthew 3:17.\n\nGenesis 37:26–28withMatthew 26:14–16.\n\nGenesis 45:5–7withLuke 4:18.\n\nGenesis 47:12withJohn 6:35.\n\nWhat impressions do you have about the Savior and His mission as you read these passages?\n\nGenesis 45;50:15–21"
      },
      {
        "title": "Forgiveness brings healing.",
        "content": "Reading about Joseph forgiving his brothers of the terrible things they had done may prompt you to think about someone you are currently struggling to forgive. The following questions may help as you strive to apply this principle:\n\nWhy might it have been hard for Joseph to forgive his brothers? (to review what they did to him, seeGenesis 37). What experiences or attitudes might have given Joseph the strength to forgive? (see, for example,Genesis 45:1–15or50:15–21).\n\nWhat blessings came from Joseph’s forgiveness of his brothers? For example, compare the relationships in Jacob’s family at the beginning of the story (see, for example,Genesis 37:3–11) with the relationships at the end (seeGenesis 45:9–15;50:15–21). How might things have turned out differently if Joseph had not been willing to forgive?\n\nConsider writing down the name of someone who may need your forgiveness—whether or not they have asked for forgiveness. What can you do to invite the Savior’s healing power into that situation? If forgiving seems too difficult, consider reviewing the counsel of Elder Gerrit W. Gong in the last six paragraphs of his message “Happy and Forever” (Liahona, Nov. 2022, 85). What do you find that gives you hope that you can forgive?\n\nSee alsoDoctrine and Covenants 64:9–11; “Forgiveness: My Burden Was Made Light” (video), Gospel Library.\n\nForgiveness: My Burden Was Made Light\n\nGenesis 49"
      },
      {
        "title": "Jacob gave his family prophetic blessings.",
        "content": "Jacob’s blessings to his posterity contain vivid imagery, but they aren’t easy to understand. Thankfully, the restored gospel gives us some help. When you read the blessing to Joseph inGenesis 49:22–26, read the following verses too, and see what insights they provide:1 Nephi 15:12;2 Nephi 3:4–5;Jacob 2:25;Doctrine and Covenants 50:44.\n\nAs you read about Judah’s blessing inGenesis 49:8–12, remember that Jesus Christ was a descendant of Judah. What do you find in these verses that reminds you of the Savior? (see alsoRevelation 5:5–6, 9;1 Nephi 15:14–15;Doctrine and Covenants 45:59;133:46–50).\n\nReading these blessings might inspire you to review your patriarchal blessing—or, if you don’t have one, to receive one. What words and phrases in your blessing turn your thoughts to Jesus Christ?\n\nSee also Randall K. Bennett, “Your Patriarchal Blessing—Inspired Direction from Heavenly Father,”Liahona, May 2023, 42–44.\n\nGenesis 50:19–21"
      },
      {
        "title": "God can help me find meaning in my trials.",
        "content": "Though it may not have been clear while he was going through it, Joseph was eventually able to look back on his adversity in Egypt and see that “God meant it unto good” (Genesis 50:20). If you could have visited Joseph while he was in the pit or in prison, how would you have comforted him? How canGenesis 50:19–21help you in your times of trial?\n\nSee alsoDoctrine and Covenants 122; “How Firm a Foundation,”Hymns, no. 85.\n\nJoseph Smith among the Prophets, by Paul Mann (detail)\n\nGenesis 50:24–25"
      },
      {
        "title": "“A seer shall the Lord my God raise up.”",
        "content": "As you readGenesis 50:24–25andJoseph Smith Translation, Genesis 50:24–38(in the Bible appendix), ponder why it would have been important for Joseph to know about Moses and Joseph Smith so many centuries in advance. How did Joseph Smith fulfill Joseph’s prophecies about him? (seeDoctrine and Covenants 1:17–23;20:7–12;39:11;135:3).\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "I can show love and forgiveness to my family.",
        "content": "It might be fun for your children to reenact the story of Joseph reuniting his family (seeGenesis 42–44). Or they could use “Joseph and the Famine” (inOld Testament Stories, 57–60) or pictures in this outline to teach the story to each other. Here are some questions that could help your children learn from the story:\n\nWhat did Joseph do to show love for his family? (seeGenesis 45:4–15).\n\nWhy do you feel Joseph forgave his brothers?\n\nHow do you think Joseph’s brothers felt when they found out Joseph had forgiven them? Who in your life needs to be forgiven? How can you show love and forgiveness?\n\nJoseph and the Famine\n\nAs you prepare to teach, ask, “What will my children do to learn?”For example, in this activity your children are acting out or retelling a story. Doing this will help them remember both what happened and the gospel principles contained in the story.\n\nYou or your children may want to share an experience when they forgave someone or when someone forgave them. You could then sing a song such as “Love One Another” (Children’s Songbook, 136) or “Help Me, Dear Father” (Children’s Songbook, 99).\n\nGenesis 48:8–9"
      },
      {
        "title": "The Lord helps me through priesthood blessings.",
        "content": "You and your children could look at the picture of Jacob blessing his sons at the end of this outline and discuss what is happening (seeGenesis 48:8–9). If needed, explain that Jacob, Joseph’s father, wanted to give priesthood blessings to his family. Perhaps you could share with each other any experiences you’ve had receiving help from God through a priesthood blessing. What are some reasons we might ask for a priesthood blessing?\n\nGenesis 45:5–11"
      },
      {
        "title": "Heavenly Father sent Jesus Christ to save me.",
        "content": "How can you help your children see the Savior in the story of Joseph saving his family from famine? Consider making a chart with two columns labeledJosephandJesus Christ. Help your children search the following pairs of scriptures and fill in the chart with things that Joseph and Jesus have in common:Genesis 37:3andMatthew 3:17;Genesis 37:26–28andMatthew 26:14–16;Genesis 45:5–7andLuke 4:18; andGenesis 47:12andJohn 6:35.\n\nAsk your children what it means to save or rescue someone. If any of them have had an experience being saved or rescued from danger, invite them to share. How did Joseph save his brothers? (seeGenesis 42:1–3;45:5–7). Then you could look at a picture of the Savior together and ask your children to talk about how Jesus saves us.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nJacob Blessing Joseph (Jacob Blessing His Sons), by Harry Anderson"
      }
    ],
    "study_helps": [],
    "raw_text": "March 16–22. “God Meant It unto Good”: Genesis 42–50\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nFebruary 23–March 1\nGenesis 18–23\nThoughts to Keep in Mind\nThe House of Israel\nMarch 2–8\nGenesis 24–33\nMarch 9–15\nGenesis 37–41\nMarch 16–22\nGenesis 42–50\nMarch 23–29\nExodus 1–6\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nMarch 16–22. “God Meant It unto Good”: Genesis 42–50\n“March 16–22. ‘God Meant It unto Good’: Genesis 42–50,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“March 16–22. ‘God Meant It unto Good’,”\nCome, Follow Me: 2026\nForgiveness\n, by Megan Rieker\nMarch 16–22: “God Meant It unto Good”\nGenesis 42–50\nIt had been about 22 years since Joseph’s brothers sold him into slavery. Joseph had suffered many trials, including false accusations and imprisonment. When he finally saw his brothers again, Joseph was the governor of all Egypt, second only to the pharaoh. He could easily have taken revenge on his brothers, and considering what they had done to Joseph, that might seem understandable. And yet Joseph forgave them. Not only that, but he helped them see divine purpose in his suffering. “God meant it unto good” (\nGenesis 50:20\n), he told them, because it put him in a position to save “all his father’s household” (\nGenesis 47:12\n) from famine.\nIn many ways, Joseph was like Jesus Christ. Even though our sins caused Jesus great suffering, He offers forgiveness, delivering all of us from a fate far worse than famine. Whether we need to receive forgiveness or extend it—at some point we all need to do both—Joseph’s example points us to the Savior, the true source of healing and reconciliation.\nIdeas for Learning at Home and at Church\nGenesis 45:5–7\n;\n47:12\n“God sent me before you to preserve you.”\nHave you noticed any similarities between Joseph’s life and the atoning mission of Jesus Christ? To see some examples of these similarities, try comparing:\nGenesis 37:3\nwith\nMatthew 3:17\n.\nGenesis 37:26–28\nwith\nMatthew 26:14–16\n.\nGenesis 45:5–7\nwith\nLuke 4:18\n.\nGenesis 47:12\nwith\nJohn 6:35\n.\nWhat impressions do you have about the Savior and His mission as you read these passages?\nGenesis 45\n;\n50:15–21\nForgiveness brings healing.\nReading about Joseph forgiving his brothers of the terrible things they had done may prompt you to think about someone you are currently struggling to forgive. The following questions may help as you strive to apply this principle:\nWhy might it have been hard for Joseph to forgive his brothers? (to review what they did to him, see\nGenesis 37\n). What experiences or attitudes might have given Joseph the strength to forgive? (see, for example,\nGenesis 45:1–15\nor\n50:15–21\n).\nWhat blessings came from Joseph’s forgiveness of his brothers? For example, compare the relationships in Jacob’s family at the beginning of the story (see, for example,\nGenesis 37:3–11\n) with the relationships at the end (see\nGenesis 45:9–15\n;\n50:15–21\n). How might things have turned out differently if Joseph had not been willing to forgive?\nConsider writing down the name of someone who may need your forgiveness—whether or not they have asked for forgiveness. What can you do to invite the Savior’s healing power into that situation? If forgiving seems too difficult, consider reviewing the counsel of Elder Gerrit W. Gong in the last six paragraphs of his message “\nHappy and Forever\n” (\nLiahona\n, Nov. 2022, 85). What do you find that gives you hope that you can forgive?\nSee also\nDoctrine and Covenants 64:9–11\n; “Forgiveness: My Burden Was Made Light” (video), Gospel Library.\n8:24\nForgiveness: My Burden Was Made Light\nGenesis 49\nJacob gave his family prophetic blessings.\nJacob’s blessings to his posterity contain vivid imagery, but they aren’t easy to understand. Thankfully, the restored gospel gives us some help. When you read the blessing to Joseph in\nGenesis 49:22–26\n, read the following verses too, and see what insights they provide:\n1 Nephi 15:12\n;\n2 Nephi 3:4–5\n;\nJacob 2:25\n;\nDoctrine and Covenants 50:44\n.\nAs you read about Judah’s blessing in\nGenesis 49:8–12\n, remember that Jesus Christ was a descendant of Judah. What do you find in these verses that reminds you of the Savior? (see also\nRevelation 5:5–6, 9\n;\n1 Nephi 15:14–15\n;\nDoctrine and Covenants 45:59\n;\n133:46–50\n).\nReading these blessings might inspire you to review your patriarchal blessing—or, if you don’t have one, to receive one. What words and phrases in your blessing turn your thoughts to Jesus Christ?\nSee also Randall K. Bennett, “\nYour Patriarchal Blessing—Inspired Direction from Heavenly Father\n,”\nLiahona\n, May 2023, 42–44.\nGenesis 50:19–21\nGod can help me find meaning in my trials.\nThough it may not have been clear while he was going through it, Joseph was eventually able to look back on his adversity in Egypt and see that “God meant it unto good” (\nGenesis 50:20\n). If you could have visited Joseph while he was in the pit or in prison, how would you have comforted him? How can\nGenesis 50:19–21\nhelp you in your times of trial?\nSee also\nDoctrine and Covenants 122\n; “\nHow Firm a Foundation\n,”\nHymns\n, no. 85.\nJoseph Smith among the Prophets\n, by Paul Mann (detail)\nGenesis 50:24–25\n“A seer shall the Lord my God raise up.”\nAs you read\nGenesis 50:24–25\nand\nJoseph Smith Translation, Genesis 50:24–38\n(in the Bible appendix), ponder why it would have been important for Joseph to know about Moses and Joseph Smith so many centuries in advance. How did Joseph Smith fulfill Joseph’s prophecies about him? (see\nDoctrine and Covenants 1:17–23\n;\n20:7–12\n;\n39:11\n;\n135:3\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Joseph test his brothers?\nWhy did Jacob adopt Joseph’s two sons?\nWhy did Jacob place his right hand on Ephraim instead of Manasseh?\nClick to see more.\nIdeas for Teaching Children\nGenesis 42–44\n;\n45:4–15\nI can show love and forgiveness to my family.\nIt might be fun for your children to reenact the story of Joseph reuniting his family (see\nGenesis 42–44\n). Or they could use “\nJoseph and the Famine\n” (in\nOld Testament Stories\n, 57–60) or pictures in this outline to teach the story to each other. Here are some questions that could help your children learn from the story:\nWhat did Joseph do to show love for his family? (see\nGenesis 45:4–15\n).\nWhy do you feel Joseph forgave his brothers?\nHow do you think Joseph’s brothers felt when they found out Joseph had forgiven them? Who in your life needs to be forgiven? How can you show love and forgiveness?\n2:26\nJoseph and the Famine\nAs you prepare to teach, ask, “What will my children do to learn?”\nFor example, in this activity your children are acting out or retelling a story. Doing this will help them remember both what happened and the gospel principles contained in the story.\nYou or your children may want to share an experience when they forgave someone or when someone forgave them. You could then sing a song such as “\nLove One Another\n” (\nChildren’s Songbook\n, 136) or “\nHelp Me, Dear Father\n” (\nChildren’s Songbook\n, 99).\nGenesis 48:8–9\nThe Lord helps me through priesthood blessings.\nYou and your children could look at the picture of Jacob blessing his sons at the end of this outline and discuss what is happening (see\nGenesis 48:8–9\n). If needed, explain that Jacob, Joseph’s father, wanted to give priesthood blessings to his family. Perhaps you could share with each other any experiences you’ve had receiving help from God through a priesthood blessing. What are some reasons we might ask for a priesthood blessing?\nGenesis 45:5–11\nHeavenly Father sent Jesus Christ to save me.\nHow can you help your children see the Savior in the story of Joseph saving his family from famine? Consider making a chart with two columns labeled\nJoseph\nand\nJesus Christ\n. Help your children search the following pairs of scriptures and fill in the chart with things that Joseph and Jesus have in common:\nGenesis 37:3\nand\nMatthew 3:17\n;\nGenesis 37:26–28\nand\nMatthew 26:14–16\n;\nGenesis 45:5–7\nand\nLuke 4:18\n; and\nGenesis 47:12\nand\nJohn 6:35\n.\nAsk your children what it means to save or rescue someone. If any of them have had an experience being saved or rescued from danger, invite them to share. How did Joseph save his brothers? (see\nGenesis 42:1–3\n;\n45:5–7\n). Then you could look at a picture of the Savior together and ask your children to talk about how Jesus saves us.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nJacob Blessing Joseph (Jacob Blessing His Sons)\n, by Harry Anderson\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Genesis 42",
      "title": "Genesis 42",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/42?lang=eng",
      "summary": "Jacob sends his sons to buy grain in EgyptâThey bow before JosephâHe makes harsh accusations against them, imprisons Simeon, and sends them back for Benjamin.",
      "verses": [
        "1Now when Jacob saw that there wascornin Egypt, Jacob said unto his sons, Why do ye look one upon another?",
        "2And he said, Behold, I have heard that there is corn in Egypt: get you down thither, and buy for us from thence; that we may live, and not die.",
        "3Â¶And Josephâs ten brethren went down to buycornin Egypt.",
        "4ButBenjamin, Josephâs brother, Jacob sent not with his brethren; for he said, Lest peradventure mischief befall him.",
        "5And the sons of Israel came to buycornamong those that came: for the famine was in the land of Canaan.",
        "6And Josephwasthegovernorover the land,andheit wasthat sold to all the people of the land: and Josephâs brethren came, andboweddown themselves before himwiththeir faces to the earth.",
        "7And Joseph saw his brethren, and he knew them, but made himself strange unto them, and spake roughly unto them; and he said unto them, Whence come ye? And they said, From the land of Canaan to buy food.",
        "8And Joseph knew his brethren, but they knew not him.",
        "9And Joseph remembered thedreamswhich he dreamed of them, and said unto them, Yearespies; to see the nakedness of the land ye are come.",
        "10And they said unto him, Nay, my lord, but to buy food are thy servants come.",
        "11Weareall onemanâssons; wearetruemen,thy servants are no spies.",
        "12And he said unto them, Nay, but to see the nakedness of the land ye are come.",
        "13And they said, Thy servantsaretwelve brethren, the sons of one man in the land of Canaan; and, behold, the youngestisthis day with our father, and oneisnot.",
        "14And Joseph said unto them, Thatis itthat I spake unto you, saying, Yearespies:",
        "15Hereby ye shall be proved: By the life of Pharaoh ye shall not go forth hence, except your youngest brother come hither.",
        "16Send one of you, and let him fetch your brother, and ye shall be kept in prison, that your words may be proved, whetherthere be anytruth in you: or else by the life of Pharaoh surely yearespies.",
        "17And he put them all together into ward three days.",
        "18And Joseph said unto them the third day, This do, and live;forIfearGod:",
        "19If yebetruemen,let one of your brethren be bound in the house of your prison: go ye, carry corn for the famine of your houses:",
        "20But bring your youngest brother unto me; so shall your words be verified, and ye shall not die. And they did so.",
        "21Â¶And they said one to another, Weareverilyguiltyconcerning our brother, in that we saw the anguish of his soul, when he besought us, and we would not hear; therefore is this distress come upon us.",
        "22AndReubenanswered them, saying, Spake I not unto you, saying, Do not sin against the child; and ye would not hear? therefore, behold, also hisbloodis required.",
        "23And they knew not that Joseph understoodthem;for he spake unto them by an interpreter.",
        "24And he turned himself about from them, andwept; and returned to them again, and communed with them, and took from them Simeon, and bound him before their eyes.",
        "25Â¶Then Joseph commanded to fill their sacks with corn, and to restore every manâsmoneyinto his sack, and to give them provision for the way: and thus did he unto them.",
        "26And they laded their asses with the corn, and departed thence.",
        "27And as one of them opened his sack to give his ass provender in the inn, he espied hismoney; for, behold, itwasin his sackâs mouth.",
        "28And he said unto his brethren, My money is restored; and, lo,it iseven in my sack: and their heart failedthem,and they were afraid, saying one to another, WhatisthisthatGod hath done unto us?",
        "29Â¶And they came unto Jacob their father unto the land of Canaan, and told him all that befell unto them; saying,",
        "30The man,who isthe lord of the land, spake roughly to us, and took us for spies of the country.",
        "31And we said unto him, Wearetruemen;we are no spies:",
        "32Webetwelve brethren, sons of our father; oneisnot, and the youngestisthis day with our father in the land of Canaan.",
        "33And the man, the lord of the country, said unto us, Hereby shall I know that yearetruemen;leave one of your brethrenherewith me, and takefood forthe famine of your households, and be gone:",
        "34And bring your youngest brother unto me: then shall I know that yeareno spies, butthatyearetruemen: sowill I deliver you your brother, and ye shall traffick in the land.",
        "35Â¶And it came to pass as they emptied their sacks, that, behold, every manâs bundle of moneywasin his sack: and whenboththey and their father saw the bundles of money, they were afraid.",
        "36And Jacob their father said unto them, Me have ye bereavedof my children:Josephisnot, and Simeonisnot, and ye will takeBenjaminaway:all these things are against me.",
        "37AndReubenspake unto his father, saying, Slay my two sons, if I bring him not to thee: deliver him into my hand, and I will bring him to thee again.",
        "38And he said, My son shall not go down with you; for his brother is dead, and he is left alone: if mischief befall him by the way in the which ye go, then shall ye bring down my gray hairs withsorrowto the grave."
      ],
      "full_text": "1Now when Jacob saw that there wascornin Egypt, Jacob said unto his sons, Why do ye look one upon another? 2And he said, Behold, I have heard that there is corn in Egypt: get you down thither, and buy for us from thence; that we may live, and not die. 3Â¶And Josephâs ten brethren went down to buycornin Egypt. 4ButBenjamin, Josephâs brother, Jacob sent not with his brethren; for he said, Lest peradventure mischief befall him. 5And the sons of Israel came to buycornamong those that came: for the famine was in the land of Canaan. 6And Josephwasthegovernorover the land,andheit wasthat sold to all the people of the land: and Josephâs brethren came, andboweddown themselves before himwiththeir faces to the earth. 7And Joseph saw his brethren, and he knew them, but made himself strange unto them, and spake roughly unto them; and he said unto them, Whence come ye? And they said, From the land of Canaan to buy food. 8And Joseph knew his brethren, but they knew not him. 9And Joseph remembered thedreamswhich he dreamed of them, and said unto them, Yearespies; to see the nakedness of the land ye are come. 10And they said unto him, Nay, my lord, but to buy food are thy servants come. 11Weareall onemanâssons; wearetruemen,thy servants are no spies. 12And he said unto them, Nay, but to see the nakedness of the land ye are come. 13And they said, Thy servantsaretwelve brethren, the sons of one man in the land of Canaan; and, behold, the youngestisthis day with our father, and oneisnot. 14And Joseph said unto them, Thatis itthat I spake unto you, saying, Yearespies: 15Hereby ye shall be proved: By the life of Pharaoh ye shall not go forth hence, except your youngest brother come hither. 16Send one of you, and let him fetch your brother, and ye shall be kept in prison, that your words may be proved, whetherthere be anytruth in you: or else by the life of Pharaoh surely yearespies. 17And he put them all together into ward three days. 18And Joseph said unto them the third day, This do, and live;forIfearGod: 19If yebetruemen,let one of your brethren be bound in the house of your prison: go ye, carry corn for the famine of your houses: 20But bring your youngest brother unto me; so shall your words be verified, and ye shall not die. And they did so. 21Â¶And they said one to another, Weareverilyguiltyconcerning our brother, in that we saw the anguish of his soul, when he besought us, and we would not hear; therefore is this distress come upon us. 22AndReubenanswered them, saying, Spake I not unto you, saying, Do not sin against the child; and ye would not hear? therefore, behold, also hisbloodis required. 23And they knew not that Joseph understoodthem;for he spake unto them by an interpreter. 24And he turned himself about from them, andwept; and returned to them again, and communed with them, and took from them Simeon, and bound him before their eyes. 25Â¶Then Joseph commanded to fill their sacks with corn, and to restore every manâsmoneyinto his sack, and to give them provision for the way: and thus did he unto them. 26And they laded their asses with the corn, and departed thence. 27And as one of them opened his sack to give his ass provender in the inn, he espied hismoney; for, behold, itwasin his sackâs mouth. 28And he said unto his brethren, My money is restored; and, lo,it iseven in my sack: and their heart failedthem,and they were afraid, saying one to another, WhatisthisthatGod hath done unto us? 29Â¶And they came unto Jacob their father unto the land of Canaan, and told him all that befell unto them; saying, 30The man,who isthe lord of the land, spake roughly to us, and took us for spies of the country. 31And we said unto him, Wearetruemen;we are no spies: 32Webetwelve brethren, sons of our father; oneisnot, and the youngestisthis day with our father in the land of Canaan. 33And the man, the lord of the country, said unto us, Hereby shall I know that yearetruemen;leave one of your brethrenherewith me, and takefood forthe famine of your households, and be gone: 34And bring your youngest brother unto me: then shall I know that yeareno spies, butthatyearetruemen: sowill I deliver you your brother, and ye shall traffick in the land. 35Â¶And it came to pass as they emptied their sacks, that, behold, every manâs bundle of moneywasin his sack: and whenboththey and their father saw the bundles of money, they were afraid. 36And Jacob their father said unto them, Me have ye bereavedof my children:Josephisnot, and Simeonisnot, and ye will takeBenjaminaway:all these things are against me. 37AndReubenspake unto his father, saying, Slay my two sons, if I bring him not to thee: deliver him into my hand, and I will bring him to thee again. 38And he said, My son shall not go down with you; for his brother is dead, and he is left alone: if mischief befall him by the way in the which ye go, then shall ye bring down my gray hairs withsorrowto the grave."
    },
    {
      "reference": "Genesis 43",
      "title": "Genesis 43",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/43?lang=eng",
      "summary": "Jacob is persuaded to send Benjamin to EgyptâJosephâs brothers show respect to himâThey all eat and drink together.",
      "verses": [
        "1And the faminewassore in the land.",
        "2And it came to pass, when they had eaten up the corn which they had brought out of Egypt, their father said unto them, Go again, buy us a little food.",
        "3And Judah spake unto him, saying, The man did solemnly protest unto us, saying, Ye shall not see my face, except yourbrotherbewith you.",
        "4If thou wilt send our brother with us, we will go down and buy thee food:",
        "5But if thou wilt not sendhim,we will not go down: for the man said unto us, Ye shall not see my face, except yourbrotherbewith you.",
        "6And Israel said, Wherefore dealt yesoill with me,asto tell the man whether ye had yet a brother?",
        "7And they said, The man asked us straitly of our state, and of our kindred, saying,Isyour father yet alive? have yeanotherbrother? and we told him according to the tenor of these words: could we certainly know that he would say, Bring your brother down?",
        "8And Judah said unto Israel his father, Send the lad with me, and we will arise and go; that we may live, and not die, both we, and thou,andalso our little ones.",
        "9I will be surety for him; of my hand shalt thou require him: if I bring him not unto thee, and set him before thee, then let me bear theblamefor ever:",
        "10For except we had lingered, surely now we had returned this second time.",
        "11And their father Israel said unto them, Ifit must beso now, do this; take of the best fruits in the land in your vessels, and carry down the man a present, a little balm, and a little honey, spices, and myrrh, nuts, and almonds:",
        "12And take double money in your hand; and themoneythat was brought again in the mouth of your sacks, carryitagain in your hand; peradventure itwasan oversight:",
        "13Take also your brother, and arise, go again unto the man:",
        "14And God Almighty give you mercy before the man, that he may send away your other brother, and Benjamin. If I be bereavedof my children,I am bereaved.",
        "15Â¶And the men took that present, and they took double money in their hand, and Benjamin; and rose up, and went down to Egypt, and stood before Joseph.",
        "16And when Joseph saw Benjamin with them, he said to the ruler of his house, Bringthesemen home, and slay, and make ready; forthesemen shall dine with me at noon.",
        "17And the man did as Joseph bade; and the man brought the men into Josephâs house.",
        "18And the men were afraid, because they were brought into Josephâs house; and they said, Because of the money that was returned in our sacks at the first time are we brought in; that he may seek occasion against us, and fall upon us, and take us for bondmen, and our asses.",
        "19And they came near to the steward of Josephâs house, and they communed with him at the door of the house,",
        "20And said, Osir, we came indeed down at the first time to buyfood:",
        "21And it came to pass, when we came to the inn, that we opened our sacks, and, behold,everymanâsmoneywasin the mouth of his sack, our money in full weight: and we have brought it again in our hand.",
        "22And other money have we brought down in our hands to buy food: we cannot tell who put our money in our sacks.",
        "23And he said, Peacebeto you, fear not: your God, and the God of your father, hath given you treasure in your sacks: I had your money. And he brought Simeon out unto them.",
        "24And the man brought the men into Josephâs house, and gavethemwater, and theywashedtheir feet; and he gave their asses provender.",
        "25And they made ready the present against Joseph came at noon: for they heard that they should eat bread there.",
        "26Â¶And when Joseph came home, they brought him the present whichwasin their hand into the house, andbowedthemselves to him to the earth.",
        "27And he asked them oftheirwelfare, and said,Isyour father well, the oldmanof whom ye spake?Ishe yet alive?",
        "28And they answered, Thy servant our fatherisin good health, heisyet alive. And they bowed down their heads, and made obeisance.",
        "29And he lifted up his eyes, and saw his brotherBenjamin, his motherâs son, and said,Isthis your younger brother, of whom ye spake unto me? And he said, God be gracious unto thee, my son.",
        "30And Joseph made haste; for his bowels did yearn upon his brother: and he soughtwhereto weep; and he entered intohischamber, andweptthere.",
        "31And he washed his face, and went out, and refrained himself, and said, Set on bread.",
        "32And they set on for him by himself, and for them by themselves, and for the Egyptians, which did eat with him, by themselves: because the Egyptians might not eat bread with the Hebrews; for thatisanabominationunto the Egyptians.",
        "33And they sat before him, the firstborn according to hisbirthright, and the youngest according to his youth: and the men marvelled one at another.",
        "34And he tookand sentmessesunto them from before him: butBenjaminâsmess was five times so much as any of theirs. And they drank, and were merry with him."
      ],
      "full_text": "1And the faminewassore in the land. 2And it came to pass, when they had eaten up the corn which they had brought out of Egypt, their father said unto them, Go again, buy us a little food. 3And Judah spake unto him, saying, The man did solemnly protest unto us, saying, Ye shall not see my face, except yourbrotherbewith you. 4If thou wilt send our brother with us, we will go down and buy thee food: 5But if thou wilt not sendhim,we will not go down: for the man said unto us, Ye shall not see my face, except yourbrotherbewith you. 6And Israel said, Wherefore dealt yesoill with me,asto tell the man whether ye had yet a brother? 7And they said, The man asked us straitly of our state, and of our kindred, saying,Isyour father yet alive? have yeanotherbrother? and we told him according to the tenor of these words: could we certainly know that he would say, Bring your brother down? 8And Judah said unto Israel his father, Send the lad with me, and we will arise and go; that we may live, and not die, both we, and thou,andalso our little ones. 9I will be surety for him; of my hand shalt thou require him: if I bring him not unto thee, and set him before thee, then let me bear theblamefor ever: 10For except we had lingered, surely now we had returned this second time. 11And their father Israel said unto them, Ifit must beso now, do this; take of the best fruits in the land in your vessels, and carry down the man a present, a little balm, and a little honey, spices, and myrrh, nuts, and almonds: 12And take double money in your hand; and themoneythat was brought again in the mouth of your sacks, carryitagain in your hand; peradventure itwasan oversight: 13Take also your brother, and arise, go again unto the man: 14And God Almighty give you mercy before the man, that he may send away your other brother, and Benjamin. If I be bereavedof my children,I am bereaved. 15Â¶And the men took that present, and they took double money in their hand, and Benjamin; and rose up, and went down to Egypt, and stood before Joseph. 16And when Joseph saw Benjamin with them, he said to the ruler of his house, Bringthesemen home, and slay, and make ready; forthesemen shall dine with me at noon. 17And the man did as Joseph bade; and the man brought the men into Josephâs house. 18And the men were afraid, because they were brought into Josephâs house; and they said, Because of the money that was returned in our sacks at the first time are we brought in; that he may seek occasion against us, and fall upon us, and take us for bondmen, and our asses. 19And they came near to the steward of Josephâs house, and they communed with him at the door of the house, 20And said, Osir, we came indeed down at the first time to buyfood: 21And it came to pass, when we came to the inn, that we opened our sacks, and, behold,everymanâsmoneywasin the mouth of his sack, our money in full weight: and we have brought it again in our hand. 22And other money have we brought down in our hands to buy food: we cannot tell who put our money in our sacks. 23And he said, Peacebeto you, fear not: your God, and the God of your father, hath given you treasure in your sacks: I had your money. And he brought Simeon out unto them. 24And the man brought the men into Josephâs house, and gavethemwater, and theywashedtheir feet; and he gave their asses provender. 25And they made ready the present against Joseph came at noon: for they heard that they should eat bread there. 26Â¶And when Joseph came home, they brought him the present whichwasin their hand into the house, andbowedthemselves to him to the earth. 27And he asked them oftheirwelfare, and said,Isyour father well, the oldmanof whom ye spake?Ishe yet alive? 28And they answered, Thy servant our fatherisin good health, heisyet alive. And they bowed down their heads, and made obeisance. 29And he lifted up his eyes, and saw his brotherBenjamin, his motherâs son, and said,Isthis your younger brother, of whom ye spake unto me? And he said, God be gracious unto thee, my son. 30And Joseph made haste; for his bowels did yearn upon his brother: and he soughtwhereto weep; and he entered intohischamber, andweptthere. 31And he washed his face, and went out, and refrained himself, and said, Set on bread. 32And they set on for him by himself, and for them by themselves, and for the Egyptians, which did eat with him, by themselves: because the Egyptians might not eat bread with the Hebrews; for thatisanabominationunto the Egyptians. 33And they sat before him, the firstborn according to hisbirthright, and the youngest according to his youth: and the men marvelled one at another. 34And he tookand sentmessesunto them from before him: butBenjaminâsmess was five times so much as any of theirs. And they drank, and were merry with him."
    },
    {
      "reference": "Genesis 44",
      "title": "Genesis 44",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/44?lang=eng",
      "summary": "Joseph arranges to stop the return of his brothers to CanaanâJudah offers himself in place of Benjamin for their fatherâs sake.",
      "verses": [
        "1And he commanded the steward of his house, saying, Fill the menâs sackswithfood, as much as they can carry, and put every manâs money in his sackâs mouth.",
        "2And put my cup, the silver cup, in the sackâs mouth of the youngest, and his corn money. And he did according to the word that Joseph had spoken.",
        "3As soon as the morning was light, the men were sent away, they and their asses.",
        "4Andwhen they were gone out of the city,andnotyetfar off, Joseph said unto his steward, Up, follow after the men; and when thou dost overtake them, say unto them, Wherefore have ye rewarded evil for good?",
        "5Isnot thisitin which my lord drinketh, and whereby indeed he divineth? ye have done evil in so doing.",
        "6Â¶And he overtook them, and he spake unto them these same words.",
        "7And they said unto him, Wherefore saith my lord these words? God forbid that thy servants should do according to this thing:",
        "8Behold, the money, which we found in our sacksâ mouths, we brought again unto thee out of the land of Canaan: how then should we steal out of thy lordâs house silver or gold?",
        "9With whomsoever of thy servants it be found, both let him die, and we also will be my lordâs bondmen.",
        "10And he said, Now alsoletitbeaccording unto your words: he with whom it is found shall be my servant; and ye shall be blameless.",
        "11Then they speedily took down every man his sack to the ground, and opened every man his sack.",
        "12And he searched,andbegan at the eldest, and left at the youngest: and the cup was found in Benjaminâs sack.",
        "13Then theyrenttheir clothes, and laded every man his ass, and returned to the city.",
        "14Â¶And Judah and his brethren came to Josephâs house; for hewasyet there: and theyfellbefore him on the ground.",
        "15And Joseph said unto them, What deedisthis that ye have done? wot ye not that such a man as I can certainly divine?",
        "16And Judah said, What shall we say unto my lord? what shall we speak? or how shall we clear ourselves? God hath found out the iniquity of thy servants: behold, wearemy lordâs servants, both we, andhealso with whom the cup is found.",
        "17And he said, God forbid that I should do so:butthe man in whose hand the cup is found, he shall be my servant; and as for you, get you up in peace unto your father.",
        "18Â¶Then Judah came near unto him, and said, Oh mylord, let thy servant, I pray thee, speak a word in my lordâs ears, and let not thineangerburn against thy servant: for thouarteven as Pharaoh.",
        "19My lord asked his servants, saying, Have ye a father, or a brother?",
        "20And we said unto my lord, We have a father, an oldman, and a child of his old age, a little one; and his brother is dead, and he alone is left of his mother, and his father loveth him.",
        "21And thou saidst unto thy servants, Bring him down unto me, that I may set mine eyes upon him.",
        "22And we said unto my lord, The lad cannot leave his father: forifheshould leave his father,his fatherwould die.",
        "23And thou saidst unto thy servants, Except your youngestbrothercome down with you, ye shall see my face no more.",
        "24And it came to pass when we came up unto thy servant my father, we told him the words of my lord.",
        "25And our father said, Go again,andbuy us a little food.",
        "26And we said, We cannot go down: if our youngest brother be with us, then will we go down: for we may not see the manâs face, except ouryoungestbrotherbewith us.",
        "27And thy servant my father said unto us, Ye know that my wife bare me twosons:",
        "28And the one went out from me, and I said, Surely he istorninpieces; and I saw him not since:",
        "29And if yetakethis also from me, and mischief befallhim, ye shall bring down my gray hairs with sorrow to the grave.",
        "30Now therefore when I come to thy servant my father, and the ladbenot with us; seeing that his life isboundup in the ladâs life;",
        "31It shall come to pass, when he seeth that the ladisnotwith us,that he will die: and thy servants shall bring down the gray hairs of thy servant our father withsorrowto the grave.",
        "32For thy servant became surety for the lad unto my father, saying, If I bring him not unto thee, then I shall bear theblameto my father for ever.",
        "33Now therefore, I pray thee, let thy servant abide instead of the lad a bondman to my lord; and let the lad go up with his brethren.",
        "34For how shall I go up to my father, and the ladbenot with me? lest peradventure I see the evil that shall come on my father."
      ],
      "full_text": "1And he commanded the steward of his house, saying, Fill the menâs sackswithfood, as much as they can carry, and put every manâs money in his sackâs mouth. 2And put my cup, the silver cup, in the sackâs mouth of the youngest, and his corn money. And he did according to the word that Joseph had spoken. 3As soon as the morning was light, the men were sent away, they and their asses. 4Andwhen they were gone out of the city,andnotyetfar off, Joseph said unto his steward, Up, follow after the men; and when thou dost overtake them, say unto them, Wherefore have ye rewarded evil for good? 5Isnot thisitin which my lord drinketh, and whereby indeed he divineth? ye have done evil in so doing. 6Â¶And he overtook them, and he spake unto them these same words. 7And they said unto him, Wherefore saith my lord these words? God forbid that thy servants should do according to this thing: 8Behold, the money, which we found in our sacksâ mouths, we brought again unto thee out of the land of Canaan: how then should we steal out of thy lordâs house silver or gold? 9With whomsoever of thy servants it be found, both let him die, and we also will be my lordâs bondmen. 10And he said, Now alsoletitbeaccording unto your words: he with whom it is found shall be my servant; and ye shall be blameless. 11Then they speedily took down every man his sack to the ground, and opened every man his sack. 12And he searched,andbegan at the eldest, and left at the youngest: and the cup was found in Benjaminâs sack. 13Then theyrenttheir clothes, and laded every man his ass, and returned to the city. 14Â¶And Judah and his brethren came to Josephâs house; for hewasyet there: and theyfellbefore him on the ground. 15And Joseph said unto them, What deedisthis that ye have done? wot ye not that such a man as I can certainly divine? 16And Judah said, What shall we say unto my lord? what shall we speak? or how shall we clear ourselves? God hath found out the iniquity of thy servants: behold, wearemy lordâs servants, both we, andhealso with whom the cup is found. 17And he said, God forbid that I should do so:butthe man in whose hand the cup is found, he shall be my servant; and as for you, get you up in peace unto your father. 18Â¶Then Judah came near unto him, and said, Oh mylord, let thy servant, I pray thee, speak a word in my lordâs ears, and let not thineangerburn against thy servant: for thouarteven as Pharaoh. 19My lord asked his servants, saying, Have ye a father, or a brother? 20And we said unto my lord, We have a father, an oldman, and a child of his old age, a little one; and his brother is dead, and he alone is left of his mother, and his father loveth him. 21And thou saidst unto thy servants, Bring him down unto me, that I may set mine eyes upon him. 22And we said unto my lord, The lad cannot leave his father: forifheshould leave his father,his fatherwould die. 23And thou saidst unto thy servants, Except your youngestbrothercome down with you, ye shall see my face no more. 24And it came to pass when we came up unto thy servant my father, we told him the words of my lord. 25And our father said, Go again,andbuy us a little food. 26And we said, We cannot go down: if our youngest brother be with us, then will we go down: for we may not see the manâs face, except ouryoungestbrotherbewith us. 27And thy servant my father said unto us, Ye know that my wife bare me twosons: 28And the one went out from me, and I said, Surely he istorninpieces; and I saw him not since: 29And if yetakethis also from me, and mischief befallhim, ye shall bring down my gray hairs with sorrow to the grave. 30Now therefore when I come to thy servant my father, and the ladbenot with us; seeing that his life isboundup in the ladâs life; 31It shall come to pass, when he seeth that the ladisnotwith us,that he will die: and thy servants shall bring down the gray hairs of thy servant our father withsorrowto the grave. 32For thy servant became surety for the lad unto my father, saying, If I bring him not unto thee, then I shall bear theblameto my father for ever. 33Now therefore, I pray thee, let thy servant abide instead of the lad a bondman to my lord; and let the lad go up with his brethren. 34For how shall I go up to my father, and the ladbenot with me? lest peradventure I see the evil that shall come on my father."
    },
    {
      "reference": "Genesis 45",
      "title": "Genesis 45",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/45?lang=eng",
      "summary": "Joseph makes himself known to his brothersâThey rejoice togetherâPharaoh invites Jacob and his family to dwell in Egypt and eat the fat of the land.",
      "verses": [
        "1Then Joseph could notrefrainhimself before all them that stood by him; and hecried, Cause every man to go out from me. And there stood no man with him, while Joseph made himself known unto his brethren.",
        "2And he wept aloud: and the Egyptians and the house of Pharaoh heard.",
        "3And Joseph said unto his brethren, IamJoseph; doth my father yet live? And his brethren could not answer him; for they weretroubledat his presence.",
        "4And Joseph said unto his brethren, Come near to me, I pray you. And they came near. And he said, IamJosephyour brother, whom ye sold into Egypt.",
        "5Now therefore be notgrieved, nor angry with yourselves, that ye sold me hither: for God didsendme before you to preserve life.",
        "6For these two yearshaththe faminebeenin the land: and yetthere arefive years, in the whichthere shallneitherbeearing nor harvest.",
        "7And God sent me before you topreserveyou aposterityin the earth, and to save your lives by a great deliverance.",
        "8So nowit wasnot youthatsent me hither, but God: and he hath made me a father to Pharaoh, and lord of all his house, and arulerthroughout all the land of Egypt.",
        "9Haste ye, and go up to my father, and say unto him, Thus saith thy son Joseph, God hath made me lord of all Egypt: come down unto me, tarry not:",
        "10And thou shalt dwell in the land ofGoshen, and thou shalt be near unto me, thou, and thy children, and thy childrenâs children, and thy flocks, and thy herds, and all that thou hast:",
        "11And there will Inourishthee; for yetthere arefive years of famine; lest thou, and thy household, and all that thou hast, come to poverty.",
        "12And, behold, your eyes see, and the eyes of my brother Benjamin, thatit ismy mouth that speaketh unto you.",
        "13And ye shall tell my father of all my glory in Egypt, and of all that ye have seen; and ye shall haste and bring down myfatherhither.",
        "14And he fell upon his brother Benjaminâs neck, and wept; and Benjamin wept upon his neck.",
        "15Moreover he kissed all his brethren, and wept upon them: and after that his brethren talked with him.",
        "16Â¶And the fame thereof was heard in Pharaohâs house, saying, Josephâs brethren are come: and itpleasedPharaoh well, and his servants.",
        "17And Pharaoh said unto Joseph, Say unto thy brethren, This do ye; lade your beasts, and go, get you unto the land of Canaan;",
        "18And take your father and your households, and come unto me: and I will give you the good of the land of Egypt, and ye shall eat the fat of the land.",
        "19Now thou art commanded, this do ye; take youwagonsout of the land of Egypt for your little ones, and for your wives, and bring your father, and come.",
        "20Also regard not your stuff; for the good of all the land of Egyptisyours.",
        "21And the children of Israel did so: and Joseph gave them wagons, according to the commandment of Pharaoh, and gave them provision for the way.",
        "22To all of them he gave each man changes of raiment; but toBenjaminhe gave three hundredpiecesof silver, and five changes of raiment.",
        "23And to his father he sent after thismanner;ten asses laden with the good things of Egypt, and ten she asses laden with corn and bread and meat for his father by the way.",
        "24So he sent his brethren away, and they departed: and he said unto them, See that ye fall not out by the way.",
        "25Â¶And they went up out of Egypt, and came into the land of Canaan unto Jacob their father,",
        "26And told him, saying, Josephisyet alive, and heisgovernorover all the land of Egypt. And Jacobâs heart fainted, for he believed them not.",
        "27And they told him all the words of Joseph, which he had said unto them: and when he saw thewagonswhich Joseph had sent to carry him, the spirit of Jacob their fatherrevived:",
        "28And Israel said,It isenough; Joseph my sonisyet alive: I will go and see him before I die."
      ],
      "full_text": "1Then Joseph could notrefrainhimself before all them that stood by him; and hecried, Cause every man to go out from me. And there stood no man with him, while Joseph made himself known unto his brethren. 2And he wept aloud: and the Egyptians and the house of Pharaoh heard. 3And Joseph said unto his brethren, IamJoseph; doth my father yet live? And his brethren could not answer him; for they weretroubledat his presence. 4And Joseph said unto his brethren, Come near to me, I pray you. And they came near. And he said, IamJosephyour brother, whom ye sold into Egypt. 5Now therefore be notgrieved, nor angry with yourselves, that ye sold me hither: for God didsendme before you to preserve life. 6For these two yearshaththe faminebeenin the land: and yetthere arefive years, in the whichthere shallneitherbeearing nor harvest. 7And God sent me before you topreserveyou aposterityin the earth, and to save your lives by a great deliverance. 8So nowit wasnot youthatsent me hither, but God: and he hath made me a father to Pharaoh, and lord of all his house, and arulerthroughout all the land of Egypt. 9Haste ye, and go up to my father, and say unto him, Thus saith thy son Joseph, God hath made me lord of all Egypt: come down unto me, tarry not: 10And thou shalt dwell in the land ofGoshen, and thou shalt be near unto me, thou, and thy children, and thy childrenâs children, and thy flocks, and thy herds, and all that thou hast: 11And there will Inourishthee; for yetthere arefive years of famine; lest thou, and thy household, and all that thou hast, come to poverty. 12And, behold, your eyes see, and the eyes of my brother Benjamin, thatit ismy mouth that speaketh unto you. 13And ye shall tell my father of all my glory in Egypt, and of all that ye have seen; and ye shall haste and bring down myfatherhither. 14And he fell upon his brother Benjaminâs neck, and wept; and Benjamin wept upon his neck. 15Moreover he kissed all his brethren, and wept upon them: and after that his brethren talked with him. 16Â¶And the fame thereof was heard in Pharaohâs house, saying, Josephâs brethren are come: and itpleasedPharaoh well, and his servants. 17And Pharaoh said unto Joseph, Say unto thy brethren, This do ye; lade your beasts, and go, get you unto the land of Canaan; 18And take your father and your households, and come unto me: and I will give you the good of the land of Egypt, and ye shall eat the fat of the land. 19Now thou art commanded, this do ye; take youwagonsout of the land of Egypt for your little ones, and for your wives, and bring your father, and come. 20Also regard not your stuff; for the good of all the land of Egyptisyours. 21And the children of Israel did so: and Joseph gave them wagons, according to the commandment of Pharaoh, and gave them provision for the way. 22To all of them he gave each man changes of raiment; but toBenjaminhe gave three hundredpiecesof silver, and five changes of raiment. 23And to his father he sent after thismanner;ten asses laden with the good things of Egypt, and ten she asses laden with corn and bread and meat for his father by the way. 24So he sent his brethren away, and they departed: and he said unto them, See that ye fall not out by the way. 25Â¶And they went up out of Egypt, and came into the land of Canaan unto Jacob their father, 26And told him, saying, Josephisyet alive, and heisgovernorover all the land of Egypt. And Jacobâs heart fainted, for he believed them not. 27And they told him all the words of Joseph, which he had said unto them: and when he saw thewagonswhich Joseph had sent to carry him, the spirit of Jacob their fatherrevived: 28And Israel said,It isenough; Joseph my sonisyet alive: I will go and see him before I die."
    },
    {
      "reference": "Genesis 46",
      "title": "Genesis 46",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/46?lang=eng",
      "summary": "The Lord sends Jacob and his family of seventy souls to EgyptâThe descendants of Jacob are namedâJoseph meets Jacob.",
      "verses": [
        "1And Israel took his journey with all that he had, and came toBeer-sheba, and offered sacrifices unto the God of his father Isaac.",
        "2And God spake unto Israel in thevisionsof the night, and said, Jacob, Jacob. And he said, HereamI.",
        "3And he said, IamGod, the God of thyfather: fear not to go down intoEgypt; for I will there make of thee a greatnation:",
        "4Iwill go down with thee into Egypt; and I will also surelybringthee upagain:andJosephshall put his hand upon thine eyes.",
        "5And Jacobrose upfrom Beer-sheba: and the sons of Israel carried Jacob their father, and their little ones, and their wives, in thewagonswhich Pharaoh had sent to carry him.",
        "6And they took their cattle, and their goods, which they had gotten in the land of Canaan, and came intoEgypt, Jacob, and all his seed with him:",
        "7His sons, and his sonsâ sons with him, his daughters, and his sonsâ daughters, and all hisseedbrought he with him into Egypt.",
        "8Â¶And thesearethenamesof thechildren of Israel, which came into Egypt, Jacob and his sons: Reuben, Jacobâs firstborn.",
        "9And the sons ofReuben; Hanoch, and Phallu, and Hezron, and Carmi.",
        "10Â¶And the sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Shaul the son of a Canaanitish woman.",
        "11Â¶And the sons ofLevi; Gershon, Kohath, and Merari.",
        "12Â¶And the sons of Judah;Er, andOnan, and Shelah, and Pharez, andZerah: but Er and Onan died in the land of Canaan. And the sons of Pharez were Hezron and Hamul.",
        "13Â¶And the sons ofIssachar; Tola, and Phuvah, and Job, and Shimron.",
        "14Â¶And the sons of Zebulun; Sered, and Elon, and Jahleel.",
        "15Thesebethe sons ofLeah, which she bare unto Jacob in Padan-aram, with his daughter Dinah: all the souls of his sons and his daughterswerethirty and three.",
        "16Â¶And the sons ofGad; Ziphion, and Haggi, Shuni, and Ezbon, Eri, and Arodi, and Areli.",
        "17Â¶And the sons of Asher; Jimnah, and Ishuah, and Isui, and Beriah, and Serah their sister: and the sons of Beriah; Heber, and Malchiel.",
        "18Thesearethe sons ofZilpah, whom Laban gave to Leah his daughter, and these she bare unto Jacob,evensixteen souls.",
        "19The sons of Rachel Jacobâs wife; Joseph, andBenjamin.",
        "20Â¶And unto Joseph in the land of Egypt were bornManassehand Ephraim, whichAsenaththe daughter of Poti-pherah priest of On bare unto him.",
        "21Â¶And the sons ofBenjaminwereBelah, and Becher, and Ashbel, Gera, and Naaman, Ehi, and Rosh, Muppim, and Huppim, and Ard.",
        "22Thesearethe sons of Rachel, which were born to Jacob: all the soulswerefourteen.",
        "23Â¶And the sons ofDan; Hushim.",
        "24Â¶And the sons of Naphtali; Jahzeel, and Guni, and Jezer, and Shillem.",
        "25Thesearethe sons ofBilhah, which Laban gave unto Rachel his daughter, and she bare these unto Jacob: all the soulswereseven.",
        "26All the souls that came with Jacob into Egypt, which came outof his loins, besides Jacobâs sonsâ wives, all the soulswerethreescore and six;",
        "27And the sons of Joseph, which were born him in Egypt,weretwo souls: all the souls of the house ofJacob, which came into Egypt,werethreescoreand ten.",
        "28Â¶And he sent Judah before him unto Joseph, to direct his face unto Goshen; and they came into the land ofGoshen.",
        "29And Joseph made ready his chariot, and went up to meet Israel his father, to Goshen, and presented himself unto him; and he fell on his neck, andwepton his neck a good while.",
        "30And Israel said unto Joseph, Now let me die, since I have seen thy face, because thouartyet alive.",
        "31And Joseph said unto his brethren, and unto his fatherâs house, I will go up, and shewPharaoh, and say unto him, My brethren, and my fatherâs house, whichwerein the land of Canaan, are come unto me;",
        "32And the menareshepherds, for their trade hath been to feed cattle; and they have brought their flocks, and their herds, and all that they have.",
        "33And it shall come to pass, when Pharaoh shall call you, and shall say, Whatisyouroccupation?",
        "34That ye shall say, Thy servantsâ trade hath been aboutcattlefrom our youth even until now, both we,andalso our fathers: that ye may dwell in the land of Goshen; for every shepherdisanabominationunto the Egyptians."
      ],
      "full_text": "1And Israel took his journey with all that he had, and came toBeer-sheba, and offered sacrifices unto the God of his father Isaac. 2And God spake unto Israel in thevisionsof the night, and said, Jacob, Jacob. And he said, HereamI. 3And he said, IamGod, the God of thyfather: fear not to go down intoEgypt; for I will there make of thee a greatnation: 4Iwill go down with thee into Egypt; and I will also surelybringthee upagain:andJosephshall put his hand upon thine eyes. 5And Jacobrose upfrom Beer-sheba: and the sons of Israel carried Jacob their father, and their little ones, and their wives, in thewagonswhich Pharaoh had sent to carry him. 6And they took their cattle, and their goods, which they had gotten in the land of Canaan, and came intoEgypt, Jacob, and all his seed with him: 7His sons, and his sonsâ sons with him, his daughters, and his sonsâ daughters, and all hisseedbrought he with him into Egypt. 8Â¶And thesearethenamesof thechildren of Israel, which came into Egypt, Jacob and his sons: Reuben, Jacobâs firstborn. 9And the sons ofReuben; Hanoch, and Phallu, and Hezron, and Carmi. 10Â¶And the sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Shaul the son of a Canaanitish woman. 11Â¶And the sons ofLevi; Gershon, Kohath, and Merari. 12Â¶And the sons of Judah;Er, andOnan, and Shelah, and Pharez, andZerah: but Er and Onan died in the land of Canaan. And the sons of Pharez were Hezron and Hamul. 13Â¶And the sons ofIssachar; Tola, and Phuvah, and Job, and Shimron. 14Â¶And the sons of Zebulun; Sered, and Elon, and Jahleel. 15Thesebethe sons ofLeah, which she bare unto Jacob in Padan-aram, with his daughter Dinah: all the souls of his sons and his daughterswerethirty and three. 16Â¶And the sons ofGad; Ziphion, and Haggi, Shuni, and Ezbon, Eri, and Arodi, and Areli. 17Â¶And the sons of Asher; Jimnah, and Ishuah, and Isui, and Beriah, and Serah their sister: and the sons of Beriah; Heber, and Malchiel. 18Thesearethe sons ofZilpah, whom Laban gave to Leah his daughter, and these she bare unto Jacob,evensixteen souls. 19The sons of Rachel Jacobâs wife; Joseph, andBenjamin. 20Â¶And unto Joseph in the land of Egypt were bornManassehand Ephraim, whichAsenaththe daughter of Poti-pherah priest of On bare unto him. 21Â¶And the sons ofBenjaminwereBelah, and Becher, and Ashbel, Gera, and Naaman, Ehi, and Rosh, Muppim, and Huppim, and Ard. 22Thesearethe sons of Rachel, which were born to Jacob: all the soulswerefourteen. 23Â¶And the sons ofDan; Hushim. 24Â¶And the sons of Naphtali; Jahzeel, and Guni, and Jezer, and Shillem. 25Thesearethe sons ofBilhah, which Laban gave unto Rachel his daughter, and she bare these unto Jacob: all the soulswereseven. 26All the souls that came with Jacob into Egypt, which came outof his loins, besides Jacobâs sonsâ wives, all the soulswerethreescore and six; 27And the sons of Joseph, which were born him in Egypt,weretwo souls: all the souls of the house ofJacob, which came into Egypt,werethreescoreand ten. 28Â¶And he sent Judah before him unto Joseph, to direct his face unto Goshen; and they came into the land ofGoshen. 29And Joseph made ready his chariot, and went up to meet Israel his father, to Goshen, and presented himself unto him; and he fell on his neck, andwepton his neck a good while. 30And Israel said unto Joseph, Now let me die, since I have seen thy face, because thouartyet alive. 31And Joseph said unto his brethren, and unto his fatherâs house, I will go up, and shewPharaoh, and say unto him, My brethren, and my fatherâs house, whichwerein the land of Canaan, are come unto me; 32And the menareshepherds, for their trade hath been to feed cattle; and they have brought their flocks, and their herds, and all that they have. 33And it shall come to pass, when Pharaoh shall call you, and shall say, Whatisyouroccupation? 34That ye shall say, Thy servantsâ trade hath been aboutcattlefrom our youth even until now, both we,andalso our fathers: that ye may dwell in the land of Goshen; for every shepherdisanabominationunto the Egyptians."
    },
    {
      "reference": "Genesis 47",
      "title": "Genesis 47",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/47?lang=eng",
      "summary": "The Israelites settle in GoshenâJacob blesses PharaohâJoseph sells grain to the EgyptiansâPharaoh receives the Egyptiansâ cattle and landsâJacob desires to be buried with his fathers in Canaan.",
      "verses": [
        "1Then Joseph came and toldPharaoh, and said, My father and my brethren, and their flocks, and their herds, and all that they have, are come out of the land of Canaan; and, behold, theyarein the land ofGoshen.",
        "2And he took some of his brethren,evenfive men, and presented them untoPharaoh.",
        "3And Pharaoh said unto his brethren, Whatisyouroccupation? And they said unto Pharaoh, Thy servantsareshepherds, both we,andalso our fathers.",
        "4They said moreover unto Pharaoh, For tosojournin the land are we come; for thy servants have no pasture for their flocks; for the famineissore in the land of Canaan: now therefore, we pray thee, let thy servants dwell in the land of Goshen.",
        "5And Pharaoh spake unto Joseph, saying, Thy father and thy brethren are come unto thee:",
        "6The land ofEgyptisbefore thee; in the best of the land make thy father and brethren to dwell; in the land of Goshen let them dwell: and if thou knowestanymen of activity among them, then make them rulers over my cattle.",
        "7And Joseph brought in Jacob his father, and set him before Pharaoh: and Jacob blessed Pharaoh.",
        "8And Pharaoh said unto Jacob, How oldartthou?",
        "9And Jacob said unto Pharaoh, The days of the years of mypilgrimagearean hundred and thirty years: few andevilhave the days of the years of my life been, and have not attained unto thedaysof the years of the life of my fathers in the days of their pilgrimage.",
        "10And Jacob blessed Pharaoh, and went out from before Pharaoh.",
        "11Â¶And Joseph placed his father and his brethren, and gave them a possession in the land of Egypt, in the best of the land, in the land ofRameses, as Pharaoh had commanded.",
        "12And Josephnourishedhis father, and his brethren, and all his fatherâs household, with bread, according totheirfamilies.",
        "13Â¶Andthere wasno bread in all the land; for thefaminewasvery sore, so that the land of Egypt andallthe land of Canaan fainted by reason of the famine.",
        "14And Joseph gathered up all themoneythat was found in the land of Egypt, and in the land of Canaan, for the corn which they bought: and Joseph brought the money into Pharaohâs house.",
        "15And when money failed in the land of Egypt, and in the land of Canaan, all the Egyptians came unto Joseph, and said, Give usbread: for why should we die in thy presence? for the money faileth.",
        "16And Joseph said, Give your cattle; and I will give you for your cattle, if money fail.",
        "17And they brought their cattle unto Joseph: and Joseph gave them breadin exchangefor horses, and for the flocks, and for the cattle of the herds, and for the asses: and he fed them with bread for all their cattle for that year.",
        "18When that year was ended, they came unto him the second year, and said unto him, We will not hideitfrom my lord, how that our money is spent; my lord also hath our herds of cattle; there is not ought left in the sight of my lord, but our bodies, and our lands:",
        "19Wherefore shall we die before thine eyes, both we and our land? buy us and our land for bread, and we and our land will be servants unto Pharaoh: and giveusseed, that we may live, and not die, that the land be not desolate.",
        "20And Joseph bought all the land of Egypt for Pharaoh; for the Egyptians sold every man his field, because the famine prevailed over them: so the land became Pharaohâs.",
        "21And as for the people,heremoved them to cities fromoneend of the borders of Egypt even to theotherend thereof.",
        "22Only the land of thepriestsbought he not; for the priests had a portionassigned themof Pharaoh, and did eat their portion which Pharaoh gave them: wherefore they sold not their lands.",
        "23Then Joseph said unto the people, Behold, I have bought you this day and your land for Pharaoh: lo,here isseed for you, and ye shall sow the land.",
        "24And it shall come to passin the increase, that ye shall give thefifthpartunto Pharaoh, and four parts shall be your own, for seed of the field, and for your food, and for them of your households, and for food for your little ones.",
        "25And they said, Thou hast saved our lives: let us find grace in the sight of my lord, and we will be Pharaohâs servants.",
        "26And Joseph made it a law over the land of Egypt unto this day,thatPharaoh should have the fifthpart;except the land of thepriestsonly,whichbecame not Pharaohâs.",
        "27Â¶And Israel dwelt in the land of Egypt, in the country of Goshen; and they had possessions therein, and grew, and multiplied exceedingly.",
        "28And Jacob lived in the land of Egypt seventeen years: so the whole age ofJacobwas an hundred forty and seven years.",
        "29And thetimedrew nigh that Israel must die: and he called his son Joseph, and said unto him, If now I have found grace in thy sight, put, I pray thee, thy hand under mythigh, and deal kindly and truly with me;buryme not, I pray thee, in Egypt:",
        "30But I will lie with my fathers, and thou shalt carry me out of Egypt, andburyme in their buryingplace. And he said, I will do as thou hast said.",
        "31And he said, Swear unto me. And he sware unto him. And Israelbowedhimselfuponthebedâshead."
      ],
      "full_text": "1Then Joseph came and toldPharaoh, and said, My father and my brethren, and their flocks, and their herds, and all that they have, are come out of the land of Canaan; and, behold, theyarein the land ofGoshen. 2And he took some of his brethren,evenfive men, and presented them untoPharaoh. 3And Pharaoh said unto his brethren, Whatisyouroccupation? And they said unto Pharaoh, Thy servantsareshepherds, both we,andalso our fathers. 4They said moreover unto Pharaoh, For tosojournin the land are we come; for thy servants have no pasture for their flocks; for the famineissore in the land of Canaan: now therefore, we pray thee, let thy servants dwell in the land of Goshen. 5And Pharaoh spake unto Joseph, saying, Thy father and thy brethren are come unto thee: 6The land ofEgyptisbefore thee; in the best of the land make thy father and brethren to dwell; in the land of Goshen let them dwell: and if thou knowestanymen of activity among them, then make them rulers over my cattle. 7And Joseph brought in Jacob his father, and set him before Pharaoh: and Jacob blessed Pharaoh. 8And Pharaoh said unto Jacob, How oldartthou? 9And Jacob said unto Pharaoh, The days of the years of mypilgrimagearean hundred and thirty years: few andevilhave the days of the years of my life been, and have not attained unto thedaysof the years of the life of my fathers in the days of their pilgrimage. 10And Jacob blessed Pharaoh, and went out from before Pharaoh. 11Â¶And Joseph placed his father and his brethren, and gave them a possession in the land of Egypt, in the best of the land, in the land ofRameses, as Pharaoh had commanded. 12And Josephnourishedhis father, and his brethren, and all his fatherâs household, with bread, according totheirfamilies. 13Â¶Andthere wasno bread in all the land; for thefaminewasvery sore, so that the land of Egypt andallthe land of Canaan fainted by reason of the famine. 14And Joseph gathered up all themoneythat was found in the land of Egypt, and in the land of Canaan, for the corn which they bought: and Joseph brought the money into Pharaohâs house. 15And when money failed in the land of Egypt, and in the land of Canaan, all the Egyptians came unto Joseph, and said, Give usbread: for why should we die in thy presence? for the money faileth. 16And Joseph said, Give your cattle; and I will give you for your cattle, if money fail. 17And they brought their cattle unto Joseph: and Joseph gave them breadin exchangefor horses, and for the flocks, and for the cattle of the herds, and for the asses: and he fed them with bread for all their cattle for that year. 18When that year was ended, they came unto him the second year, and said unto him, We will not hideitfrom my lord, how that our money is spent; my lord also hath our herds of cattle; there is not ought left in the sight of my lord, but our bodies, and our lands: 19Wherefore shall we die before thine eyes, both we and our land? buy us and our land for bread, and we and our land will be servants unto Pharaoh: and giveusseed, that we may live, and not die, that the land be not desolate. 20And Joseph bought all the land of Egypt for Pharaoh; for the Egyptians sold every man his field, because the famine prevailed over them: so the land became Pharaohâs. 21And as for the people,heremoved them to cities fromoneend of the borders of Egypt even to theotherend thereof. 22Only the land of thepriestsbought he not; for the priests had a portionassigned themof Pharaoh, and did eat their portion which Pharaoh gave them: wherefore they sold not their lands. 23Then Joseph said unto the people, Behold, I have bought you this day and your land for Pharaoh: lo,here isseed for you, and ye shall sow the land. 24And it shall come to passin the increase, that ye shall give thefifthpartunto Pharaoh, and four parts shall be your own, for seed of the field, and for your food, and for them of your households, and for food for your little ones. 25And they said, Thou hast saved our lives: let us find grace in the sight of my lord, and we will be Pharaohâs servants. 26And Joseph made it a law over the land of Egypt unto this day,thatPharaoh should have the fifthpart;except the land of thepriestsonly,whichbecame not Pharaohâs. 27Â¶And Israel dwelt in the land of Egypt, in the country of Goshen; and they had possessions therein, and grew, and multiplied exceedingly. 28And Jacob lived in the land of Egypt seventeen years: so the whole age ofJacobwas an hundred forty and seven years. 29And thetimedrew nigh that Israel must die: and he called his son Joseph, and said unto him, If now I have found grace in thy sight, put, I pray thee, thy hand under mythigh, and deal kindly and truly with me;buryme not, I pray thee, in Egypt: 30But I will lie with my fathers, and thou shalt carry me out of Egypt, andburyme in their buryingplace. And he said, I will do as thou hast said. 31And he said, Swear unto me. And he sware unto him. And Israelbowedhimselfuponthebedâshead."
    },
    {
      "reference": "Genesis 48",
      "title": "Genesis 48",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/48?lang=eng",
      "summary": "Jacob tells of the appearance of God to him in LuzâHe adopts Ephraim and Manasseh as his own childrenâJacob blesses JosephâHe puts Ephraim before ManassehâThe seed of Ephraim will become a multitude of nationsâThe children of Israel will come again into the land of their fathers.",
      "verses": [
        "1And it came to pass after these things, thatonetold Joseph, Behold, thy fatherissick: and he took with him his two sons, Manasseh and Ephraim.",
        "2AndonetoldJacob, and said, Behold, thy son Joseph cometh unto thee: and Israelstrengthenedhimself, and sat upon the bed.",
        "3And Jacob said unto Joseph, GodAlmightyappearedunto me atLuzin the land of Canaan, and blessed me,",
        "4And said unto me, Behold, I will make theefruitful, and multiply thee, and I will make of thee a multitude of people; and will give thislandto thy seed after theeforan everlastingpossession.",
        "5Â¶Andnow thy two sons,EphraimandManasseh, which were born unto thee in the land of Egypt before I came unto thee into Egypt,aremine; as Reuben and Simeon, they shall be mine.",
        "6And thy issue, which thou begettest after them, shall be thine,andshall be called after the name of their brethren in their inheritance.",
        "7And as for me, when I came from Padan,Racheldied by me in the land of Canaan in the way, when yetthere wasbut a little way to come unto Ephrath: and I buried her there in the way of Ephrath; the sameisBeth-lehem.",
        "8And Israel beheld Josephâs sons, and said, Whoarethese?",
        "9And Joseph said unto his father, Theyaremy sons, whom God hath given me in thisplace.And he said, Bring them, I pray thee, unto me, and I willblessthem.",
        "10Now the eyes of Israel weredimfor age,so thathe could not see. And he brought themnearunto him; and he kissed them, and embraced them.",
        "11And Israel said unto Joseph, I had not thought to see thy face: and, lo, God hath shewed me also thy seed.",
        "12And Joseph brought them out from between his knees, and he bowed himself with his face to the earth.",
        "13And Joseph took them both, Ephraim in his right hand toward Israelâs left hand, and Manasseh in his left hand toward Israelâs right hand, and broughtthemnear unto him.",
        "14And Israel stretched out his right hand, and laidituponEphraimâshead, whowasthe younger, and his left hand upon Manassehâs head,guiding his handswittingly; for Manassehwasthe firstborn.",
        "15Â¶And he blessedJoseph, and said, God, before whom my fathers Abraham and Isaac didwalk, the God whichfedme all my life long unto this day,",
        "16TheAngelwhich redeemed me from all evil, bless the lads; and let mynamebe named on them, and the name of my fathers Abraham and Isaac; and let them grow into a multitude in the midst of the earth.",
        "17And when Joseph saw that his father laid his righthandupon the head ofEphraim,it displeased him: and he held up his fatherâs hand, to remove it from Ephraimâs head unto Manassehâs head.",
        "18And Joseph said unto his father, Not so, my father: for thisisthe firstborn; put thy right hand upon his head.",
        "19And his father refused, and said, I knowit,my son, I knowit:he also shall become a people, and he also shall begreat: but truly his younger brother shall be greater than he, and hisseedshall become amultitudeofnations.",
        "20And he blessed them that day, saying,In theeshall Israelbless, saying, God make thee as Ephraim and as Manasseh: and he setEphraimbefore Manasseh.",
        "21And Israel said unto Joseph, Behold, I die: butGodshall be with you, andbringyou again unto thelandof your fathers.",
        "22Moreover I have given to thee oneportionabove thy brethren, which I took out of the hand of the Amorite with my sword and with my bow."
      ],
      "full_text": "1And it came to pass after these things, thatonetold Joseph, Behold, thy fatherissick: and he took with him his two sons, Manasseh and Ephraim. 2AndonetoldJacob, and said, Behold, thy son Joseph cometh unto thee: and Israelstrengthenedhimself, and sat upon the bed. 3And Jacob said unto Joseph, GodAlmightyappearedunto me atLuzin the land of Canaan, and blessed me, 4And said unto me, Behold, I will make theefruitful, and multiply thee, and I will make of thee a multitude of people; and will give thislandto thy seed after theeforan everlastingpossession. 5Â¶Andnow thy two sons,EphraimandManasseh, which were born unto thee in the land of Egypt before I came unto thee into Egypt,aremine; as Reuben and Simeon, they shall be mine. 6And thy issue, which thou begettest after them, shall be thine,andshall be called after the name of their brethren in their inheritance. 7And as for me, when I came from Padan,Racheldied by me in the land of Canaan in the way, when yetthere wasbut a little way to come unto Ephrath: and I buried her there in the way of Ephrath; the sameisBeth-lehem. 8And Israel beheld Josephâs sons, and said, Whoarethese? 9And Joseph said unto his father, Theyaremy sons, whom God hath given me in thisplace.And he said, Bring them, I pray thee, unto me, and I willblessthem. 10Now the eyes of Israel weredimfor age,so thathe could not see. And he brought themnearunto him; and he kissed them, and embraced them. 11And Israel said unto Joseph, I had not thought to see thy face: and, lo, God hath shewed me also thy seed. 12And Joseph brought them out from between his knees, and he bowed himself with his face to the earth. 13And Joseph took them both, Ephraim in his right hand toward Israelâs left hand, and Manasseh in his left hand toward Israelâs right hand, and broughtthemnear unto him. 14And Israel stretched out his right hand, and laidituponEphraimâshead, whowasthe younger, and his left hand upon Manassehâs head,guiding his handswittingly; for Manassehwasthe firstborn. 15Â¶And he blessedJoseph, and said, God, before whom my fathers Abraham and Isaac didwalk, the God whichfedme all my life long unto this day, 16TheAngelwhich redeemed me from all evil, bless the lads; and let mynamebe named on them, and the name of my fathers Abraham and Isaac; and let them grow into a multitude in the midst of the earth. 17And when Joseph saw that his father laid his righthandupon the head ofEphraim,it displeased him: and he held up his fatherâs hand, to remove it from Ephraimâs head unto Manassehâs head. 18And Joseph said unto his father, Not so, my father: for thisisthe firstborn; put thy right hand upon his head. 19And his father refused, and said, I knowit,my son, I knowit:he also shall become a people, and he also shall begreat: but truly his younger brother shall be greater than he, and hisseedshall become amultitudeofnations. 20And he blessed them that day, saying,In theeshall Israelbless, saying, God make thee as Ephraim and as Manasseh: and he setEphraimbefore Manasseh. 21And Israel said unto Joseph, Behold, I die: butGodshall be with you, andbringyou again unto thelandof your fathers. 22Moreover I have given to thee oneportionabove thy brethren, which I took out of the hand of the Amorite with my sword and with my bow."
    },
    {
      "reference": "Genesis 49",
      "title": "Genesis 49",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/49?lang=eng",
      "summary": "Jacob blesses his sons and their seedâReuben, Simeon, and Levi are chastenedâJudah will rule until Shiloh (Christ) comesâJoseph is a fruitful bough by a wellâHis branches (the Nephites and Lamanites) will run over the wallâThe Shepherd and Stone of Israel (Christ) will bless Joseph temporally and spirituallyâJacob chooses to be buried with his fathers in CanaanâHe yields up the ghost and is gathered to his people.",
      "verses": [
        "1AndJacobcalled unto hissons, and said, Gather yourselves together, that I may tell youthatwhich shall befall you in thelast days.",
        "2Gather yourselves together, and hear, ye sons of Jacob; and hearken unto Israel yourfather.",
        "3Â¶Reuben, thouartmy firstborn, my might, and thebeginningof my strength, the excellency of dignity, and the excellency of power:",
        "4Unstable as water, thou shalt not excel; because thou wentest up to thy fatherâsbed; thendefiledstthouit:he went up to my couch.",
        "5Â¶SimeonandLeviarebrethren;instruments ofcrueltyare intheir habitations.",
        "6O my soul, come not thou into their secret; unto their assembly, mine honour, be not thouunited: for in theirangertheyslewa man, and in their selfwill they digged down a wall.",
        "7Cursedbetheiranger, forit wasfierce; and their wrath, for it wascruel: I will divide them in Jacob, and scatter them in Israel.",
        "8Â¶Judah, thouart hewhom thy brethren shallpraise: thy handshall bein theneckof thine enemies; thy fatherâs children shallbowdown before thee.",
        "9Judahisalionâswhelp: from the prey, my son, thou art gone up: he stooped down, he couched as alion, and as an old lion; who shall rouse him up?",
        "10The sceptre shall not depart fromJudah, nor alawgiverfrom between his feet, untilShilohcome; and unto himshallthegatheringof the peoplebe.",
        "11Binding his foal unto the vine, and his assâs colt unto the choicevine; hewashedhis garments in wine, and his clothes in thebloodof grapes:",
        "12His eyesshall bered with wine, and his teeth white with milk.",
        "13Â¶Zebulunshall dwell at the haven of the sea; and heshall befor an haven of ships; and his bordershall beunto Zidon.",
        "14Â¶Issacharisa strong ass couching down between two burdens:",
        "15And he saw that restwasgood, and the land thatit waspleasant; and bowed his shoulder to bear, and became a servant unto tribute.",
        "16Â¶Danshalljudgehis people, as one of the tribes of Israel.",
        "17Dan shall be a serpent by the way, an adder in the path, that biteth the horse heels, so that his rider shall fall backward.",
        "18I havewaitedfor thy salvation, OLord.",
        "19Â¶Gad, atroopshall overcome him: but he shall overcome at the last.",
        "20Â¶Out ofAsherhis breadshall befat, and he shall yield royal dainties.",
        "21Â¶Naphtaliisa hind let loose: he giveth goodly words.",
        "22Â¶Josephisa fruitfulbough,evena fruitful bough by a well;whosebranchesrunover the wall:",
        "23The archers have sorely grieved him, and shotat him,and hated him:",
        "24But his bow abode in strength, and the arms of his hands were madestrong by the hands of the mightyGodof Jacob; (fromthenceistheshepherd, thestoneof Israel:)",
        "25Evenby the God of thy father, who shall help thee; and by theAlmighty, who shall bless thee with blessings of heaven above, blessings of the deep that lieth under, blessings of the breasts, and of thewomb:",
        "26Theblessingsof thy father have prevailed above the blessings of my progenitors unto theutmostbound of the everlastinghills: they shall be on the head ofJoseph, and on the crown of the head of him that was separate from his brethren.",
        "27Â¶Benjaminshall ravinasa wolf: in the morning he shall devour the prey, and at night he shall divide the spoil.",
        "28Â¶All thesearethetwelve tribesof Israel: and thisis itthat their father spake unto them, andblessedthem; every one according to hisblessinghe blessed them.",
        "29And he charged them, and said unto them, I am to be gathered unto mypeople:buryme with my fathers in the cave thatisin the field of Ephron the Hittite,",
        "30In the cave thatisin the field ofMachpelah, whichisbefore Mamre, in the land of Canaan, which Abraham bought with the field ofEphronthe Hittite for a possession of a buryingplace.",
        "31There theyburiedAbraham and Sarah his wife; there they buried Isaac and Rebekah his wife; and there I buried Leah.",
        "32The purchase of the field and of the cave thatisthereinwasfrom the children of Heth.",
        "33And when Jacob had made an end of commanding his sons, he gathered up his feet into the bed, and yielded up theghost, and wasgatheredunto his people."
      ],
      "full_text": "1AndJacobcalled unto hissons, and said, Gather yourselves together, that I may tell youthatwhich shall befall you in thelast days. 2Gather yourselves together, and hear, ye sons of Jacob; and hearken unto Israel yourfather. 3Â¶Reuben, thouartmy firstborn, my might, and thebeginningof my strength, the excellency of dignity, and the excellency of power: 4Unstable as water, thou shalt not excel; because thou wentest up to thy fatherâsbed; thendefiledstthouit:he went up to my couch. 5Â¶SimeonandLeviarebrethren;instruments ofcrueltyare intheir habitations. 6O my soul, come not thou into their secret; unto their assembly, mine honour, be not thouunited: for in theirangertheyslewa man, and in their selfwill they digged down a wall. 7Cursedbetheiranger, forit wasfierce; and their wrath, for it wascruel: I will divide them in Jacob, and scatter them in Israel. 8Â¶Judah, thouart hewhom thy brethren shallpraise: thy handshall bein theneckof thine enemies; thy fatherâs children shallbowdown before thee. 9Judahisalionâswhelp: from the prey, my son, thou art gone up: he stooped down, he couched as alion, and as an old lion; who shall rouse him up? 10The sceptre shall not depart fromJudah, nor alawgiverfrom between his feet, untilShilohcome; and unto himshallthegatheringof the peoplebe. 11Binding his foal unto the vine, and his assâs colt unto the choicevine; hewashedhis garments in wine, and his clothes in thebloodof grapes: 12His eyesshall bered with wine, and his teeth white with milk. 13Â¶Zebulunshall dwell at the haven of the sea; and heshall befor an haven of ships; and his bordershall beunto Zidon. 14Â¶Issacharisa strong ass couching down between two burdens: 15And he saw that restwasgood, and the land thatit waspleasant; and bowed his shoulder to bear, and became a servant unto tribute. 16Â¶Danshalljudgehis people, as one of the tribes of Israel. 17Dan shall be a serpent by the way, an adder in the path, that biteth the horse heels, so that his rider shall fall backward. 18I havewaitedfor thy salvation, OLord. 19Â¶Gad, atroopshall overcome him: but he shall overcome at the last. 20Â¶Out ofAsherhis breadshall befat, and he shall yield royal dainties. 21Â¶Naphtaliisa hind let loose: he giveth goodly words. 22Â¶Josephisa fruitfulbough,evena fruitful bough by a well;whosebranchesrunover the wall: 23The archers have sorely grieved him, and shotat him,and hated him: 24But his bow abode in strength, and the arms of his hands were madestrong by the hands of the mightyGodof Jacob; (fromthenceistheshepherd, thestoneof Israel:) 25Evenby the God of thy father, who shall help thee; and by theAlmighty, who shall bless thee with blessings of heaven above, blessings of the deep that lieth under, blessings of the breasts, and of thewomb: 26Theblessingsof thy father have prevailed above the blessings of my progenitors unto theutmostbound of the everlastinghills: they shall be on the head ofJoseph, and on the crown of the head of him that was separate from his brethren. 27Â¶Benjaminshall ravinasa wolf: in the morning he shall devour the prey, and at night he shall divide the spoil. 28Â¶All thesearethetwelve tribesof Israel: and thisis itthat their father spake unto them, andblessedthem; every one according to hisblessinghe blessed them. 29And he charged them, and said unto them, I am to be gathered unto mypeople:buryme with my fathers in the cave thatisin the field of Ephron the Hittite, 30In the cave thatisin the field ofMachpelah, whichisbefore Mamre, in the land of Canaan, which Abraham bought with the field ofEphronthe Hittite for a possession of a buryingplace. 31There theyburiedAbraham and Sarah his wife; there they buried Isaac and Rebekah his wife; and there I buried Leah. 32The purchase of the field and of the cave thatisthereinwasfrom the children of Heth. 33And when Jacob had made an end of commanding his sons, he gathered up his feet into the bed, and yielded up theghost, and wasgatheredunto his people."
    },
    {
      "reference": "Genesis 50",
      "title": "Genesis 50",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/50?lang=eng",
      "summary": "Jacobâs body is embalmedâJoseph buries him in CanaanâJoseph comforts his brothersâThe children of Israel multiplyâJoseph promises that God will bring Israel out of Egypt into CanaanâJoseph dies in Egypt and is embalmed.",
      "verses": [
        "1AndJosephfell upon his fatherâs face, andweptupon him, and kissed him.",
        "2And Joseph commanded his servants the physicians toembalmhis father: and the physicians embalmed Israel.",
        "3And forty days were fulfilled for him; for so are fulfilled the days of those which are embalmed: and the Egyptians mourned for him threescore and ten days.",
        "4And when the days of his mourning were past, Joseph spake unto the house of Pharaoh, saying, If now I have found grace in your eyes, speak, I pray you, in the ears of Pharaoh, saying,",
        "5My father made me swear, saying, Lo, I die: in mygravewhich I have digged for me in the land of Canaan, there shalt thou bury me. Now therefore let me go up, I pray thee, and bury my father, and I will come again.",
        "6And Pharaoh said, Go up, and bury thy father, according as he made thee swear.",
        "7Â¶And Joseph went up to bury his father: and with him went up all the servants of Pharaoh, the elders of his house, and all the elders of the land of Egypt,",
        "8And all the house of Joseph, and his brethren, and his fatherâs house: only their little ones, and their flocks, and their herds, they left in the land ofGoshen.",
        "9And there went up with him both chariots and horsemen: and it was a very great company.",
        "10And they came to the threshingfloor of Atad, whichisbeyond Jordan, and there theymournedwith a great and very sore lamentation: and he made amourningfor his father seven days.",
        "11And when the inhabitants of the land, the Canaanites, saw the mourning in the floor of Atad, they said, Thisisa grievous mourning to the Egyptians: wherefore the name of it was calledAbel-mizraim, whichisbeyond Jordan.",
        "12And his sons did unto him according as he commanded them:",
        "13For his sonscarriedhim into the land of Canaan, and buried him in the cave of the field of Machpelah, which Abraham bought with the field for a possession of aburyingplaceofEphronthe Hittite, before Mamre.",
        "14Â¶And Joseph returned into Egypt, he, and his brethren, and all that went up with him to bury his father, after he had buried his father.",
        "15Â¶And when Josephâs brethren saw that their father was dead, they said,Josephwill peradventure hate us, and will certainly requite us all the evil which we did unto him.",
        "16And they sent a messenger unto Joseph, saying, Thy father did command before he died, saying,",
        "17So shall ye say unto Joseph,Forgive, I pray thee now, the trespass of thy brethren, and their sin; for they did unto thee evil: and now, we pray thee, forgive the trespass of the servants of the God of thy father. And Josephweptwhen they spake unto him.",
        "18And his brethren also went and fell down before his face; and they said, Behold, webethyservants.",
        "19And Joseph said unto them, Fear not: foramI in the place of God?",
        "20But as for you, ye thoughtevilagainst me;butGodmeantit untogood, to bring to pass, asit isthis day, to save much people alive.",
        "21Now therefore fear ye not: I willnourishyou, and your little ones. And he comforted them, and spake kindly unto them.",
        "22Â¶AndJosephdwelt in Egypt, he, and his fatherâs house: and Joseph lived an hundred and ten years.",
        "23And Joseph saw Ephraimâschildrenof the thirdgeneration:the children also of Machir the son ofManassehwere brought up upon Josephâs knees.",
        "24AndJoseph said unto his brethren, I die: and God will surely visit you, andbringyou out of this land unto thelandwhich he sware toAbraham, to Isaac, and to Jacob.",
        "25And Joseph took anoathof the children of Israel, saying, God will surely visit you, and ye shall carry up mybonesfrom hence.",
        "26SoJosephdied,beingan hundred and ten years old: and theyembalmedhim, and he was put in a coffin in Egypt."
      ],
      "full_text": "1AndJosephfell upon his fatherâs face, andweptupon him, and kissed him. 2And Joseph commanded his servants the physicians toembalmhis father: and the physicians embalmed Israel. 3And forty days were fulfilled for him; for so are fulfilled the days of those which are embalmed: and the Egyptians mourned for him threescore and ten days. 4And when the days of his mourning were past, Joseph spake unto the house of Pharaoh, saying, If now I have found grace in your eyes, speak, I pray you, in the ears of Pharaoh, saying, 5My father made me swear, saying, Lo, I die: in mygravewhich I have digged for me in the land of Canaan, there shalt thou bury me. Now therefore let me go up, I pray thee, and bury my father, and I will come again. 6And Pharaoh said, Go up, and bury thy father, according as he made thee swear. 7Â¶And Joseph went up to bury his father: and with him went up all the servants of Pharaoh, the elders of his house, and all the elders of the land of Egypt, 8And all the house of Joseph, and his brethren, and his fatherâs house: only their little ones, and their flocks, and their herds, they left in the land ofGoshen. 9And there went up with him both chariots and horsemen: and it was a very great company. 10And they came to the threshingfloor of Atad, whichisbeyond Jordan, and there theymournedwith a great and very sore lamentation: and he made amourningfor his father seven days. 11And when the inhabitants of the land, the Canaanites, saw the mourning in the floor of Atad, they said, Thisisa grievous mourning to the Egyptians: wherefore the name of it was calledAbel-mizraim, whichisbeyond Jordan. 12And his sons did unto him according as he commanded them: 13For his sonscarriedhim into the land of Canaan, and buried him in the cave of the field of Machpelah, which Abraham bought with the field for a possession of aburyingplaceofEphronthe Hittite, before Mamre. 14Â¶And Joseph returned into Egypt, he, and his brethren, and all that went up with him to bury his father, after he had buried his father. 15Â¶And when Josephâs brethren saw that their father was dead, they said,Josephwill peradventure hate us, and will certainly requite us all the evil which we did unto him. 16And they sent a messenger unto Joseph, saying, Thy father did command before he died, saying, 17So shall ye say unto Joseph,Forgive, I pray thee now, the trespass of thy brethren, and their sin; for they did unto thee evil: and now, we pray thee, forgive the trespass of the servants of the God of thy father. And Josephweptwhen they spake unto him. 18And his brethren also went and fell down before his face; and they said, Behold, webethyservants. 19And Joseph said unto them, Fear not: foramI in the place of God? 20But as for you, ye thoughtevilagainst me;butGodmeantit untogood, to bring to pass, asit isthis day, to save much people alive. 21Now therefore fear ye not: I willnourishyou, and your little ones. And he comforted them, and spake kindly unto them. 22Â¶AndJosephdwelt in Egypt, he, and his fatherâs house: and Joseph lived an hundred and ten years. 23And Joseph saw Ephraimâschildrenof the thirdgeneration:the children also of Machir the son ofManassehwere brought up upon Josephâs knees. 24AndJoseph said unto his brethren, I die: and God will surely visit you, andbringyou out of this land unto thelandwhich he sware toAbraham, to Isaac, and to Jacob. 25And Joseph took anoathof the children of Israel, saying, God will surely visit you, and ye shall carry up mybonesfrom hence. 26SoJosephdied,beingan hundred and ten years old: and theyembalmedhim, and he was put in a coffin in Egypt."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:27:42",
  "metadata": {
    "week_number": 12,
    "title": "Week 12: March 16–22 - Genesis 42–50",
    "date_range": "March 16–22",
    "scraped_at": "2025-12-21T22:27:50.830091",
    "scraper_version": "2.0.0"
  }
}