{
  "week_number": 50,
  "date_range": "December 7–13",
  "title": "Week 50: December 7–13 - Haggai 1–2; Zechariah 1–4; 7–14",
  "bundle_title": "Week 50: December 7–13: \"Week 50: December 7–13 - Haggai 1–2; Zechariah 1–4; 7–14\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/50?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/50?lang=eng",
    "title": "Haggai 1–2;Zechariah 1–4;7–14",
    "scripture_references": "Haggai 1–2; Zechariah 1–4; 7–14",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\nAfter decades of captivity, a group of Israelites, probably including the prophets Haggai and Zechariah, were allowed to return to Jerusalem. Some in this group remembered what the temple looked like before it was destroyed. To those who wondered whether it would ever again resemble the Lord’s “house in her first glory” (Haggai 2:3), Haggai spoke the Lord’s words of encouragement: “Be strong, all ye people of the land, saith the Lord, and work: for I am with you, … fear ye not.” “I will fill this house with glory, … and in this place will I give peace” (Haggai 2:4–5, 7, 9).\n\nBut it wasn’t just the holy temple that needed rebuilding. In many ways, God’s people were spiritually in ruins. And rebuilding a holy people takes more than cutting stones and positioning them to build a holy house. It means the inscription “Holiness unto the Lord” must be engraved not just on a temple wall, or even on “the bells of the horses” and “every pot in Jerusalem” (Zechariah 14:20–21). They must also be engraved on every heart.\n\nFor an overview of the books of Haggai and Zechariah, see “Haggai” and “Zechariah” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "“Consider your ways.”",
        "content": "There were many important things to do to rebuild Jerusalem. But after roughly 15 years had passed since the Israelites’ return, the Lord was displeased that the rebuilding of the temple had not been given higher priority (seeHaggai 1:2–5; see alsoEzra 4:24). As you readHaggai 1;2:1–9, consider questions like these:\n\nWhat consequences did the Israelites face because they had not finished the temple?\n\nWhat blessings did the Lord promise them if they finished building His house?\n\nWhat is the Lord’s message to you inHaggai 1:5–7? How could you align your priorities with the Lord’s? When have you been blessed for putting God first in your life?\n\nThe early Latter-day Saints faced a similar situation to the Israelites in Haggai’s day (seeDoctrine and Covenants 95). What do you learn from these two examples about the Lord’s feelings about temples?\n\nSee also Dale G. Renlund, “Jesus Christ Is the Treasure,”Liahona, Nov. 2023, 96–99; Terence M. Vinson, “True Disciples of the Savior,”EnsignorLiahona, Nov. 2019, 9–11; “We Love Thy House, O God,”Hymns, no. 247; “Provo City Center Temple Completed” (video),ChurchofJesusChrist.org.\n\nProvo City Center Temple Completed\n\nZechariah 1–3;7–8;14"
      },
      {
        "title": "The Lord can make me holy.",
        "content": "In your opinion, what’s the value of having “holiness unto the Lord” engraved on everyday objects like those mentioned inZechariah 14:20? (see alsoExodus 28:36–38). What’s the value of having it engraved on temples today? What does this phrase mean to you? How can you make holiness part of your daily life? Ponder these questions as you read the Lord’s invitations to His people to become more holy inZechariah 1:1–6;3:1–7;7:8–10;8:16–17.\n\nYou could also readZechariah 2:10–11;8:1–8;14:9–11, 20–21to learn what life will be like in a future day when we all dwell with the Lord in a state of holiness. What impresses you about Zechariah’s vision of the future of Jerusalem? What do you find here that you would like to see in your community? How can you prepare to live in the conditions Zechariah described?\n\n“Behold, thy King cometh unto thee: he is just, and having salvation; lowly, and riding upon an ass” (Zechariah 9:9).Triumphal Entry, by Harry Anderson\n\nZechariah 9:9–11;11:12–13;12:10;13:6–7;14:1–9"
      },
      {
        "title": "Jesus Christ is the promised Messiah.",
        "content": "Several of Zechariah’s writings point both to the earthly ministry of Jesus Christ and to His eventual Second Coming. Below are some of Zechariah’s prophecies, along with scriptures about their fulfillment. As you study these passages, ask yourself: What does this teach me about the Savior?\n\nZechariah 9:9–11(seeMatthew 21:1–11;1 Peter 3:18–19)\n\nZechariah 11:12–13(seeMatthew 26:14–16;27:1–7)\n\nZechariah 12:10(seeJohn 19:37;Revelation 1:7)\n\nZechariah 13:6–7;14:1–9(seeMatthew 26:31;Doctrine and Covenants 45:47–53)\n\nWhat do you think it would have been like to be among the people welcoming Jesus into Jerusalem as described inZechariah 9:9–11? How can you welcome Him into your life, your homes, and your community?\n\nSee also Guide to the Scriptures, “Messiah,” Gospel Library; “The Lord’s Triumphal Entry into Jerusalem” (video), Gospel Library; Ronald A. Rasband, “Hosanna to the Most High God,”Liahona, May 2023, 108–12.\n\nThe Lord's Triumphal Entry into Jerusalem\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "“Consider your ways.”",
        "content": "As you read parts ofHaggai 1:2–5with your children, help them find out why the Lord was not pleased with the people. Perhaps your children could pick a phrase fromverse 6and draw a picture of it. They could show it to each other and guess what phrase each drawing represents. When we spend time on things other than what the Lord wants, how is that like eating but not being filled? You might talk with each other about how you can make time for the things that are important to the Lord.\n\nYou could also readverse 8to your children and invite them to pretend to “go up to the mountain,” “bring wood,” and “build the house [of the Lord].” Your children could make a list of things they do in a typical day, including things the Lord has asked them to do. Ask your children to “consider [their] ways” by circling what the Lord might say are the most important things on their list.\n\nHome-centered teaching.President Russell M. Nelson has taught that the home should be the “center of gospel learning” (“Becoming Exemplary Latter-day Saints,”EnsignorLiahona, Nov. 2018, 113). As your family studies Haggai’s counsel to “consider your ways,” you could talk about how to put God first in your family life.\n\nZechariah 3:1–7"
      },
      {
        "title": "Making and keeping covenants can help me be more like Heavenly Father and Jesus Christ.",
        "content": "In a vision, Zechariah saw a high priest who was “clothed with filthy garments” (Zechariah 3:3). An angel gave him clean clothing. You could help your children discover important truths by reading togetherZechariah 3:1–7and talking about what the dirty clothing and clean clothing might represent. How do we become clean from our sins, even after we are baptized? How does our baptismal covenant help us “walk in [the Lord’s] ways”?\n\nYou and your children could look at a picture of a baptism, like the one in this outline. Why do we wear white at our baptism? You could also sing a song about baptism, such as “When I Am Baptized” (Children’s Songbook, 103); what does the song teach about why the Lord wants us to be baptized?\n\nZechariah 9:9–11;11:12;13:6–7"
      },
      {
        "title": "Jesus Christ is the promised Messiah.",
        "content": "Your children might like to visualize the event foretold inZechariah 9:9, when Jesus came into Jerusalem during the last week of His mortal life. To help with this, show them a picture of the event, like the one in this outline. You could also share with them “The Savior Goes to Jerusalem” (inNew Testament Stories, 110–12). Your children could point to people in the pictures who are “rejoicing greatly.” Who is the King inZechariah 9:9? Why are we thankful for Him?\n\nChapter 44: The Savior Goes to Jerusalem\n\nConsider helping your children compare prophecies from Zechariah with the New Testament verses describing their fulfillment. Here are some examples:Zechariah 9:9andMatthew 21:5–9;Zechariah 9:11and1 Peter 3:18–19;Zechariah 11:12andMatthew 26:14–16;Zechariah 13:7andMatthew 26:31. What do we learn about the Savior from these verses?\n\nFor more, see this month’s issue of theFriendmagazine.\n\n“Holiness to the Lord” appears on every temple."
      }
    ],
    "study_helps": [],
    "raw_text": "December 7–13. “Holiness unto the Lord”: Haggai 1–2; Zechariah 1–4; 7–14\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nNovember 30–December 6\nMicah; Nahum; Habakkuk; Zephaniah\nDecember 7–13\nHaggai 1–2; Zechariah 1–4; 7–14\nDecember 14–20\nMalachi\nDecember 21–27\nChristmas\nAppendixes\nDecember 7–13. “Holiness unto the Lord”: Haggai 1–2; Zechariah 1–4; 7–14\n“December 7–13. ‘Holiness unto the Lord”: Haggai 1–2; Zechariah 1–4; 7–14,’\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“December 7–13. ‘Holiness unto the Lord,’”\nCome, Follow Me: Old Testament 2026\nLaie Hawaii Temple\nDecember 7–13: “Holiness unto the Lord”\nHaggai 1–2\n;\nZechariah 1–4\n;\n7–14\nAfter decades of captivity, a group of Israelites, probably including the prophets Haggai and Zechariah, were allowed to return to Jerusalem. Some in this group remembered what the temple looked like before it was destroyed. To those who wondered whether it would ever again resemble the Lord’s “house in her first glory” (\nHaggai 2:3\n), Haggai spoke the Lord’s words of encouragement: “Be strong, all ye people of the land, saith the Lord, and work: for I am with you, … fear ye not.” “I will fill this house with glory, … and in this place will I give peace” (\nHaggai 2:4–5, 7, 9\n).\nBut it wasn’t just the holy temple that needed rebuilding. In many ways, God’s people were spiritually in ruins. And rebuilding a holy people takes more than cutting stones and positioning them to build a holy house. It means the inscription “Holiness unto the Lord” must be engraved not just on a temple wall, or even on “the bells of the horses” and “every pot in Jerusalem” (\nZechariah 14:20–21\n). They must also be engraved on every heart.\nFor an overview of the books of Haggai and Zechariah, see “\nHaggai\n” and “\nZechariah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nHaggai 1\n;\n2:1–9\n“Consider your ways.”\nThere were many important things to do to rebuild Jerusalem. But after roughly 15 years had passed since the Israelites’ return, the Lord was displeased that the rebuilding of the temple had not been given higher priority (see\nHaggai 1:2–5\n; see also\nEzra 4:24\n). As you read\nHaggai 1\n;\n2:1–9\n, consider questions like these:\nWhat consequences did the Israelites face because they had not finished the temple?\nWhat blessings did the Lord promise them if they finished building His house?\nWhat is the Lord’s message to you in\nHaggai 1:5–7\n? How could you align your priorities with the Lord’s? When have you been blessed for putting God first in your life?\nThe early Latter-day Saints faced a similar situation to the Israelites in Haggai’s day (see\nDoctrine and Covenants 95\n). What do you learn from these two examples about the Lord’s feelings about temples?\nSee also Dale G. Renlund, “\nJesus Christ Is the Treasure\n,”\nLiahona\n, Nov. 2023, 96–99; Terence M. Vinson, “\nTrue Disciples of the Savior\n,”\nEnsign\nor\nLiahona\n, Nov. 2019, 9–11; “\nWe Love Thy House, O God\n,”\nHymns\n, no. 247; “Provo City Center Temple Completed” (video),\nChurchofJesusChrist.org\n.\n7:17\nProvo City Center Temple Completed\nZechariah 1–3\n;\n7–8\n;\n14\nThe Lord can make me holy.\nIn your opinion, what’s the value of having “holiness unto the Lord” engraved on everyday objects like those mentioned in\nZechariah 14:20\n? (see also\nExodus 28:36–38\n). What’s the value of having it engraved on temples today? What does this phrase mean to you? How can you make holiness part of your daily life? Ponder these questions as you read the Lord’s invitations to His people to become more holy in\nZechariah 1:1–6\n;\n3:1–7\n;\n7:8–10\n;\n8:16–17\n.\nYou could also read\nZechariah 2:10–11\n;\n8:1–8\n;\n14:9–11, 20–21\nto learn what life will be like in a future day when we all dwell with the Lord in a state of holiness. What impresses you about Zechariah’s vision of the future of Jerusalem? What do you find here that you would like to see in your community? How can you prepare to live in the conditions Zechariah described?\n“Behold, thy King cometh unto thee: he is just, and having salvation; lowly, and riding upon an ass” (\nZechariah 9:9\n).\nTriumphal Entry\n, by Harry Anderson\nZechariah 9:9–11\n;\n11:12–13\n;\n12:10\n;\n13:6–7\n;\n14:1–9\nJesus Christ is the promised Messiah.\nSeveral of Zechariah’s writings point both to the earthly ministry of Jesus Christ and to His eventual Second Coming. Below are some of Zechariah’s prophecies, along with scriptures about their fulfillment. As you study these passages, ask yourself: What does this teach me about the Savior?\nZechariah 9:9–11\n(see\nMatthew 21:1–11\n;\n1 Peter 3:18–19\n)\nZechariah 11:12–13\n(see\nMatthew 26:14–16\n;\n27:1–7\n)\nZechariah 12:10\n(see\nJohn 19:37\n;\nRevelation 1:7\n)\nZechariah 13:6–7\n;\n14:1–9\n(see\nMatthew 26:31\n;\nDoctrine and Covenants 45:47–53\n)\nWhat do you think it would have been like to be among the people welcoming Jesus into Jerusalem as described in\nZechariah 9:9–11\n? How can you welcome Him into your life, your homes, and your community?\nSee also Guide to the Scriptures, “\nMessiah\n,” Gospel Library; “The Lord’s Triumphal Entry into Jerusalem” (video), Gospel Library; Ronald A. Rasband, “\nHosanna to the Most High God\n,”\nLiahona\n, May 2023, 108–12.\n1:22\nThe Lord's Triumphal Entry into Jerusalem\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nHaggai 1:2–8\n“Consider your ways.”\nAs you read parts of\nHaggai 1:2–5\nwith your children, help them find out why the Lord was not pleased with the people. Perhaps your children could pick a phrase from\nverse 6\nand draw a picture of it. They could show it to each other and guess what phrase each drawing represents. When we spend time on things other than what the Lord wants, how is that like eating but not being filled? You might talk with each other about how you can make time for the things that are important to the Lord.\nYou could also read\nverse 8\nto your children and invite them to pretend to “go up to the mountain,” “bring wood,” and “build the house [of the Lord].” Your children could make a list of things they do in a typical day, including things the Lord has asked them to do. Ask your children to “consider [their] ways” by circling what the Lord might say are the most important things on their list.\nHome-centered teaching.\nPresident Russell M. Nelson has taught that the home should be the “center of gospel learning” (“\nBecoming Exemplary Latter-day Saints\n,”\nEnsign\nor\nLiahona\n, Nov. 2018, 113). As your family studies Haggai’s counsel to “consider your ways,” you could talk about how to put God first in your family life.\nZechariah 3:1–7\nMaking and keeping covenants can help me be more like Heavenly Father and Jesus Christ.\nIn a vision, Zechariah saw a high priest who was “clothed with filthy garments” (\nZechariah 3:3\n). An angel gave him clean clothing. You could help your children discover important truths by reading together\nZechariah 3:1–7\nand talking about what the dirty clothing and clean clothing might represent. How do we become clean from our sins, even after we are baptized? How does our baptismal covenant help us “walk in [the Lord’s] ways”?\nYou and your children could look at a picture of a baptism, like the one in this outline. Why do we wear white at our baptism? You could also sing a song about baptism, such as “\nWhen I Am Baptized\n” (\nChildren’s Songbook\n, 103); what does the song teach about why the Lord wants us to be baptized?\nZechariah 9:9–11\n;\n11:12\n;\n13:6–7\nJesus Christ is the promised Messiah.\nYour children might like to visualize the event foretold in\nZechariah 9:9\n, when Jesus came into Jerusalem during the last week of His mortal life. To help with this, show them a picture of the event, like the one in this outline. You could also share with them “\nThe Savior Goes to Jerusalem\n” (in\nNew Testament Stories\n, 110–12). Your children could point to people in the pictures who are “rejoicing greatly.” Who is the King in\nZechariah 9:9\n? Why are we thankful for Him?\n1:35\nChapter 44: The Savior Goes to Jerusalem\nConsider helping your children compare prophecies from Zechariah with the New Testament verses describing their fulfillment. Here are some examples:\nZechariah 9:9\nand\nMatthew 21:5–9\n;\nZechariah 9:11\nand\n1 Peter 3:18–19\n;\nZechariah 11:12\nand\nMatthew 26:14–16\n;\nZechariah 13:7\nand\nMatthew 26:31\n. What do we learn about the Savior from these verses?\nFor more, see this month’s issue of the\nFriend\nmagazine.\n“Holiness to the Lord” appears on every temple.\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Haggai 1",
      "title": "Haggai",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/hag/1?lang=eng",
      "summary": "Haggai exhorts the people to build the temple.",
      "verses": [
        "1Inthe second yearof Darius the king, in the sixthmonth, in the first day of the month, came the word of theLordby Haggai the prophet untoZerubbabelthe son of Shealtiel, governor of Judah, and to Joshua the son of Josedech, the high priest, saying,",
        "2Thus speaketh theLordof hosts, saying, This people say, The time is not come, the time that theLordâs house should be built.",
        "3Then came the word of theLordby Haggai the prophet, saying,",
        "4Is ittime for you, O ye, to dwell in yourceiledhouses, and this houseliewaste?",
        "5Now therefore thus saith theLordof hosts;Consideryour ways.",
        "6Ye havesownmuch, and bring in little; yeeat, but ye have not enough; ye drink, but ye are not filled with drink; ye clothe you, but there is none warm; and he thatearnethwages earnethwagesto put itinto a bag withholes.",
        "7Â¶Thus saith theLordof hosts;Consideryourways.",
        "8Go up to the mountain, and bring wood, and build thehouse; and I will take pleasure in it, and I will be glorified, saith theLord.",
        "9Ye looked for much, and, lo,it cameto little; and when ye broughtithome, I did blow upon it. Why? saith theLordof hosts. Because of mine house thatiswaste, and ye run every man unto his own house.",
        "10Therefore the heaven over you is stayed from dew, and the earth is stayedfromherfruit.",
        "11And I called for adroughtupon the land, and upon the mountains, and upon thecorn, and upon the new wine, and upon the oil, and uponthatwhich the ground bringeth forth, and upon men, and upon cattle, and upon all the labour of the hands.",
        "12Â¶Then Zerubbabel the son of Shealtiel, and Joshua the son of Josedech, the high priest, with all the remnant of the people, obeyed the voice of theLordtheir God, and the words of Haggai the prophet, as theLordtheir God hadsenthim, and the people did fear before theLord.",
        "13Then spake Haggai theLordâs messenger in theLordâs message unto the people, saying, Iamwith you, saith theLord.",
        "14And theLordstirred up the spirit of Zerubbabel the son of Shealtiel, governor of Judah, and the spirit of Joshua the son of Josedech, the high priest, and the spirit of all the remnant of the people; and they came and did work in the house of theLordof hosts, their God,",
        "15In the four and twentieth day of the sixth month, in the second year of Darius the king."
      ],
      "full_text": "1Inthe second yearof Darius the king, in the sixthmonth, in the first day of the month, came the word of theLordby Haggai the prophet untoZerubbabelthe son of Shealtiel, governor of Judah, and to Joshua the son of Josedech, the high priest, saying, 2Thus speaketh theLordof hosts, saying, This people say, The time is not come, the time that theLordâs house should be built. 3Then came the word of theLordby Haggai the prophet, saying, 4Is ittime for you, O ye, to dwell in yourceiledhouses, and this houseliewaste? 5Now therefore thus saith theLordof hosts;Consideryour ways. 6Ye havesownmuch, and bring in little; yeeat, but ye have not enough; ye drink, but ye are not filled with drink; ye clothe you, but there is none warm; and he thatearnethwages earnethwagesto put itinto a bag withholes. 7Â¶Thus saith theLordof hosts;Consideryourways. 8Go up to the mountain, and bring wood, and build thehouse; and I will take pleasure in it, and I will be glorified, saith theLord. 9Ye looked for much, and, lo,it cameto little; and when ye broughtithome, I did blow upon it. Why? saith theLordof hosts. Because of mine house thatiswaste, and ye run every man unto his own house. 10Therefore the heaven over you is stayed from dew, and the earth is stayedfromherfruit. 11And I called for adroughtupon the land, and upon the mountains, and upon thecorn, and upon the new wine, and upon the oil, and uponthatwhich the ground bringeth forth, and upon men, and upon cattle, and upon all the labour of the hands. 12Â¶Then Zerubbabel the son of Shealtiel, and Joshua the son of Josedech, the high priest, with all the remnant of the people, obeyed the voice of theLordtheir God, and the words of Haggai the prophet, as theLordtheir God hadsenthim, and the people did fear before theLord. 13Then spake Haggai theLordâs messenger in theLordâs message unto the people, saying, Iamwith you, saith theLord. 14And theLordstirred up the spirit of Zerubbabel the son of Shealtiel, governor of Judah, and the spirit of Joshua the son of Josedech, the high priest, and the spirit of all the remnant of the people; and they came and did work in the house of theLordof hosts, their God, 15In the four and twentieth day of the sixth month, in the second year of Darius the king."
    },
    {
      "reference": "Haggai 2",
      "title": "Haggai 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/hag/2?lang=eng",
      "summary": "Haggai speaks about the MessiahâThe Desire of All Nations will comeâThe Lord will give peace in His temple.",
      "verses": [
        "1In the seventhmonth,in the one and twentiethdayof the month, came the word of theLordby the prophet Haggai, saying,",
        "2Speak now to Zerubbabel the son of Shealtiel, governor of Judah, and to Joshua the son of Josedech, the high priest, and to the residue of the people, saying,",
        "3Whoisleft among you that saw thishousein her first glory? and how do ye see it now?is itnot in your eyes in comparison of it as nothing?",
        "4Yet now be strong, O Zerubbabel, saith theLord; and be strong, O Joshua, son of Josedech, the high priest; and bestrong, all ye people of the land, saith theLord, and work: for Iamwith you, saith theLordof hosts:",
        "5According tothe word that I covenanted with you when ye came out of Egypt, so myspiritremaineth among you: fear ye not.",
        "6For thus saith theLordof hosts; Yet once, itisa little while, and I willshakethe heavens, and the earth, and the sea, and the dryland;",
        "7And I will shake all nations, and the desire of all nations shallcome: and I will fill this house withglory, saith theLordof hosts.",
        "8Thesilverismine, and the goldismine, saith theLordof hosts.",
        "9The glory of this latter house shall be greater than of the former, saith theLordof hosts: and in this place will I givepeace, saith theLordof hosts.",
        "10Â¶In the four and twentiethdayof the ninthmonth,in the second year of Darius, came the word of theLordby Haggai the prophet, saying,",
        "11Thus saith theLordof hosts; Ask now the priestsconcerningthe law, saying,",
        "12If one bear holy flesh in the skirt of his garment, and with his skirt do touch bread, or pottage, or wine, or oil, or any meat, shall it be holy? And the priests answered and said, No.",
        "13Then said Haggai, Ifone that isunclean by a dead body touch any of these, shall it be unclean? And the priests answered and said, It shall be unclean.",
        "14Then answered Haggai, and said, Soisthis people, and soisthis nation before me, saith theLord; and soisevery work of their hands; and that which they offer thereisunclean.",
        "15And now, I pray you, consider from this day and upward, from before a stone was laid upon a stone in the temple of theLord:",
        "16Since thosedayswere, whenonecame to an heap of twentymeasures,there werebutten: whenonecame to thepressfatfor to draw out fiftyvesselsout of the press, there werebuttwenty.",
        "17Ismoteyou withblastingand with mildew and with hail in all the labours of your hands; yet yeturnednot to me, saith theLord.",
        "18Considernow from this day and upward, from the four and twentieth day of the ninthmonth, evenfrom the day that the foundation of theLordâs temple was laid, considerit.",
        "19Is the seed yet in the barn? yea, as yet the vine, and the fig tree, and the pomegranate, and the olive tree, hath not brought forth: from this day will I blessyou.",
        "20Â¶And again the word of theLordcame unto Haggai in the four and twentiethdayof the month, saying,",
        "21Speak to Zerubbabel, governor of Judah, saying, I will shake the heavens and theearth;",
        "22And I willoverthrowthe throne of kingdoms, and I will destroy the strength of the kingdoms of the heathen; and I will overthrow the chariots, and those that ride in them; and thehorsesand their riders shall come down, every one by the sword of hisbrother.",
        "23In that day, saith theLordof hosts, will I take thee, O Zerubbabel, my servant, the son of Shealtiel, saith theLord, and will make thee asa signet: for I havechosenthee, saith theLordof hosts."
      ],
      "full_text": "1In the seventhmonth,in the one and twentiethdayof the month, came the word of theLordby the prophet Haggai, saying, 2Speak now to Zerubbabel the son of Shealtiel, governor of Judah, and to Joshua the son of Josedech, the high priest, and to the residue of the people, saying, 3Whoisleft among you that saw thishousein her first glory? and how do ye see it now?is itnot in your eyes in comparison of it as nothing? 4Yet now be strong, O Zerubbabel, saith theLord; and be strong, O Joshua, son of Josedech, the high priest; and bestrong, all ye people of the land, saith theLord, and work: for Iamwith you, saith theLordof hosts: 5According tothe word that I covenanted with you when ye came out of Egypt, so myspiritremaineth among you: fear ye not. 6For thus saith theLordof hosts; Yet once, itisa little while, and I willshakethe heavens, and the earth, and the sea, and the dryland; 7And I will shake all nations, and the desire of all nations shallcome: and I will fill this house withglory, saith theLordof hosts. 8Thesilverismine, and the goldismine, saith theLordof hosts. 9The glory of this latter house shall be greater than of the former, saith theLordof hosts: and in this place will I givepeace, saith theLordof hosts. 10Â¶In the four and twentiethdayof the ninthmonth,in the second year of Darius, came the word of theLordby Haggai the prophet, saying, 11Thus saith theLordof hosts; Ask now the priestsconcerningthe law, saying, 12If one bear holy flesh in the skirt of his garment, and with his skirt do touch bread, or pottage, or wine, or oil, or any meat, shall it be holy? And the priests answered and said, No. 13Then said Haggai, Ifone that isunclean by a dead body touch any of these, shall it be unclean? And the priests answered and said, It shall be unclean. 14Then answered Haggai, and said, Soisthis people, and soisthis nation before me, saith theLord; and soisevery work of their hands; and that which they offer thereisunclean. 15And now, I pray you, consider from this day and upward, from before a stone was laid upon a stone in the temple of theLord: 16Since thosedayswere, whenonecame to an heap of twentymeasures,there werebutten: whenonecame to thepressfatfor to draw out fiftyvesselsout of the press, there werebuttwenty. 17Ismoteyou withblastingand with mildew and with hail in all the labours of your hands; yet yeturnednot to me, saith theLord. 18Considernow from this day and upward, from the four and twentieth day of the ninthmonth, evenfrom the day that the foundation of theLordâs temple was laid, considerit. 19Is the seed yet in the barn? yea, as yet the vine, and the fig tree, and the pomegranate, and the olive tree, hath not brought forth: from this day will I blessyou. 20Â¶And again the word of theLordcame unto Haggai in the four and twentiethdayof the month, saying, 21Speak to Zerubbabel, governor of Judah, saying, I will shake the heavens and theearth; 22And I willoverthrowthe throne of kingdoms, and I will destroy the strength of the kingdoms of the heathen; and I will overthrow the chariots, and those that ride in them; and thehorsesand their riders shall come down, every one by the sword of hisbrother. 23In that day, saith theLordof hosts, will I take thee, O Zerubbabel, my servant, the son of Shealtiel, saith theLord, and will make thee asa signet: for I havechosenthee, saith theLordof hosts."
    },
    {
      "reference": "Zechariah 1",
      "title": "Zechariah",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/1?lang=eng",
      "summary": "Zechariah calls upon Judah to repentâHe is shown in vision that the cities of Judah and the temple will be rebuilt.",
      "verses": [
        "1In the eighth month, in the second year of Darius, came the word of theLorduntoZechariah, the son of Berechiah, the son of Iddo the prophet, saying,",
        "2TheLordhath been sore displeased with your fathers.",
        "3Therefore say thou unto them, Thus saith theLordof hosts;Turnye unto me, saith theLordof hosts, and I will turn unto you, saith theLordof hosts.",
        "4Be ye not as yourfathers, unto whom the former prophets have cried, saying, Thus saith theLordof hosts; Turn ye now from your evil ways, andfromyour evil doings: but they didnot hear, norhearkenunto me, saith theLord.",
        "5Your fathers, wherearethey? and the prophets, do they live for ever?",
        "6But my words and my statutes, which I commanded my servants the prophets, did they not take hold of your fathers? and they returned and said, Like as theLordof hoststhoughtto do unto us, according to our ways, and according to our doings, so hath he dealt with us.",
        "7Â¶Upon the four and twentieth day of the eleventh month, whichisthe month Sebat, in the second year of Darius, came the word of theLordunto Zechariah, the son of Berechiah, the son of Iddo the prophet, saying,",
        "8I saw by night, and behold a man riding upon a red horse, and he stood among the myrtle trees thatwerein thebottom; and behind himwere therered horses, speckled, and white.",
        "9Then said I, O my lord, whatarethese? And theangelthat talked with me said unto me, I will shew thee what thesebe.",
        "10And the man that stood among the myrtle trees answered and said, Theseare theywhom theLordhath sent to walk to and fro through the earth.",
        "11And they answered the angel oftheLordthat stood among the myrtle trees, and said, We have walked to and fro through the earth, and, behold, all the earth sitteth still, and is at rest.",
        "12Â¶Then the angel of theLordanswered and said, OLordof hosts, how long wilt thou not have mercy on Jerusalem and on the cities of Judah, against which thou hast had indignation these threescore and ten years?",
        "13And theLordanswered the angel that talked with mewithgood wordsandcomfortable words.",
        "14So the angel that communed with me said unto me, Cry thou, saying, Thus saith theLordof hosts; I amjealousfor Jerusalem and for Zion with a great jealousy.",
        "15And I am very sore displeased with the heathenthat areat ease: for I was but a little displeased, and they helped forward the affliction.",
        "16Therefore thus saith theLord; I am returned to Jerusalem with mercies: myhouseshall be built in it, saith theLordof hosts, and alineshall be stretched forth upon Jerusalem.",
        "17Cry yet, saying, Thus saith theLordof hosts; My cities through prosperity shall yet be spread abroad; and theLordshall yetcomfortZion, and shall yetchooseJerusalem.",
        "18Â¶Then lifted I up mine eyes, and saw, and behold four horns.",
        "19And I said unto the angel that talked with me, Whatbethese? And he answered me, Thesearethe horns which have scattered Judah, Israel, and Jerusalem.",
        "20And theLordshewed me fourcarpenters.",
        "21Then said I, What come these to do? And he spake, saying, Thesearethe horns which have scattered Judah, so that no man did lift up his head: but these are come tofraythem, to cast out the horns of the Gentiles, which lifted uptheirhorn over the land of Judah to scatter it."
      ],
      "full_text": "1In the eighth month, in the second year of Darius, came the word of theLorduntoZechariah, the son of Berechiah, the son of Iddo the prophet, saying, 2TheLordhath been sore displeased with your fathers. 3Therefore say thou unto them, Thus saith theLordof hosts;Turnye unto me, saith theLordof hosts, and I will turn unto you, saith theLordof hosts. 4Be ye not as yourfathers, unto whom the former prophets have cried, saying, Thus saith theLordof hosts; Turn ye now from your evil ways, andfromyour evil doings: but they didnot hear, norhearkenunto me, saith theLord. 5Your fathers, wherearethey? and the prophets, do they live for ever? 6But my words and my statutes, which I commanded my servants the prophets, did they not take hold of your fathers? and they returned and said, Like as theLordof hoststhoughtto do unto us, according to our ways, and according to our doings, so hath he dealt with us. 7Â¶Upon the four and twentieth day of the eleventh month, whichisthe month Sebat, in the second year of Darius, came the word of theLordunto Zechariah, the son of Berechiah, the son of Iddo the prophet, saying, 8I saw by night, and behold a man riding upon a red horse, and he stood among the myrtle trees thatwerein thebottom; and behind himwere therered horses, speckled, and white. 9Then said I, O my lord, whatarethese? And theangelthat talked with me said unto me, I will shew thee what thesebe. 10And the man that stood among the myrtle trees answered and said, Theseare theywhom theLordhath sent to walk to and fro through the earth. 11And they answered the angel oftheLordthat stood among the myrtle trees, and said, We have walked to and fro through the earth, and, behold, all the earth sitteth still, and is at rest. 12Â¶Then the angel of theLordanswered and said, OLordof hosts, how long wilt thou not have mercy on Jerusalem and on the cities of Judah, against which thou hast had indignation these threescore and ten years? 13And theLordanswered the angel that talked with mewithgood wordsandcomfortable words. 14So the angel that communed with me said unto me, Cry thou, saying, Thus saith theLordof hosts; I amjealousfor Jerusalem and for Zion with a great jealousy. 15And I am very sore displeased with the heathenthat areat ease: for I was but a little displeased, and they helped forward the affliction. 16Therefore thus saith theLord; I am returned to Jerusalem with mercies: myhouseshall be built in it, saith theLordof hosts, and alineshall be stretched forth upon Jerusalem. 17Cry yet, saying, Thus saith theLordof hosts; My cities through prosperity shall yet be spread abroad; and theLordshall yetcomfortZion, and shall yetchooseJerusalem. 18Â¶Then lifted I up mine eyes, and saw, and behold four horns. 19And I said unto the angel that talked with me, Whatbethese? And he answered me, Thesearethe horns which have scattered Judah, Israel, and Jerusalem. 20And theLordshewed me fourcarpenters. 21Then said I, What come these to do? And he spake, saying, Thesearethe horns which have scattered Judah, so that no man did lift up his head: but these are come tofraythem, to cast out the horns of the Gentiles, which lifted uptheirhorn over the land of Judah to scatter it."
    },
    {
      "reference": "Zechariah 2",
      "title": "Zechariah 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/2?lang=eng",
      "summary": "In the last days, Judah will gather to JerusalemâThe people will come from the land of the northâThe Lord will dwell among them.",
      "verses": [
        "1I lifted up mine eyes again, and looked, and behold a man with a measuringlinein his hand.",
        "2Then said I, Whither goest thou? And he said unto me, To measure Jerusalem, to see whatisthe breadth thereof, and whatisthe length thereof.",
        "3And, behold, the angel that talked with me went forth, and another angel went out to meet him,",
        "4And said unto him, Run, speak to this young man, saying, Jerusalem shall beinhabitedastowns without walls for the multitude of men and cattle therein:",
        "5For I, saith theLord, will be unto her a wall offireround about, and will be thegloryin the midst of her.",
        "6Â¶Ho, ho,come forth,and flee from the land of thenorth, saith theLord: for I havespreadyou abroad as thefourwinds of the heaven, saith theLord.",
        "7Deliverthyself, O Zion, that dwellestwiththe daughter of Babylon.",
        "8For thus saith theLordof hosts; After the glory hath he sent me unto the nations which spoiled you: for he that toucheth you toucheth the apple of his eye.",
        "9For, behold, I will shake mine hand upon them, and they shall be a spoil to their servants: and ye shallknow that theLordof hosts hath sent me.",
        "10Â¶Sing and rejoice, O daughter of Zion: for, lo, I come, and I willdwellin the midst of thee, saith theLord.",
        "11And manynationsshall be joined to theLordin that day, and shall be my people: and I will dwell in themidstof thee, and thou shalt know that theLordof hosts hath sent me unto thee.",
        "12And theLordshall inheritJudahhis portion in the holy land, and shall choose Jerusalem again.",
        "13Be silent, O all flesh, before theLord: for he is raised up out of his holyhabitation."
      ],
      "full_text": "1I lifted up mine eyes again, and looked, and behold a man with a measuringlinein his hand. 2Then said I, Whither goest thou? And he said unto me, To measure Jerusalem, to see whatisthe breadth thereof, and whatisthe length thereof. 3And, behold, the angel that talked with me went forth, and another angel went out to meet him, 4And said unto him, Run, speak to this young man, saying, Jerusalem shall beinhabitedastowns without walls for the multitude of men and cattle therein: 5For I, saith theLord, will be unto her a wall offireround about, and will be thegloryin the midst of her. 6Â¶Ho, ho,come forth,and flee from the land of thenorth, saith theLord: for I havespreadyou abroad as thefourwinds of the heaven, saith theLord. 7Deliverthyself, O Zion, that dwellestwiththe daughter of Babylon. 8For thus saith theLordof hosts; After the glory hath he sent me unto the nations which spoiled you: for he that toucheth you toucheth the apple of his eye. 9For, behold, I will shake mine hand upon them, and they shall be a spoil to their servants: and ye shallknow that theLordof hosts hath sent me. 10Â¶Sing and rejoice, O daughter of Zion: for, lo, I come, and I willdwellin the midst of thee, saith theLord. 11And manynationsshall be joined to theLordin that day, and shall be my people: and I will dwell in themidstof thee, and thou shalt know that theLordof hosts hath sent me unto thee. 12And theLordshall inheritJudahhis portion in the holy land, and shall choose Jerusalem again. 13Be silent, O all flesh, before theLord: for he is raised up out of his holyhabitation."
    },
    {
      "reference": "Zechariah 3",
      "title": "Zechariah 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/3?lang=eng",
      "summary": "Zechariah speaks about the MessiahâThe Branch will comeâAt the Second Coming, iniquity will be removed in one day.",
      "verses": [
        "1And he shewed me Joshua the high priest standing before theangelof theLord, andSatanstanding at his right hand toresisthim.",
        "2And theLordsaid unto Satan, TheLordrebuke thee, O Satan; even theLordthat hath chosen Jerusalem rebuke thee:isnot this abrandplucked out of the fire?",
        "3Now Joshua was clothed withfilthygarments, and stood before the angel.",
        "4And he answered and spake unto those that stood before him, saying, Take away the filthy garments from him. And unto him he said, Behold, I have caused thine iniquity to pass from thee, and I will clothe thee with change of raiment.",
        "5And I said, Let them seta fair mitreupon his head. So they set a fair mitre upon his head, and clothed him with garments. And the angel of theLordstood by.",
        "6And the angel of theLordprotested unto Joshua, saying,",
        "7Thus saith theLordof hosts; If thou wiltwalkin my ways, and if thou wilt keep mycharge, then thou shalt also judge my house, and shalt also keep my courts, and I will give thee places to walk amongthese that stand by.",
        "8Hear now, O Joshua the high priest, thou, and thy fellows that sit before thee: for theyaremen wondered at: for, behold, I will bring forth my servant theBranch.",
        "9For behold the stone that I have laid before Joshua; upon one stoneshall beseven eyes: behold, I will engrave the graving thereof, saith theLordof hosts, and I will remove the iniquity of that land in one day.",
        "10In that day, saith theLordof hosts, shall ye call every man his neighbour under the vine and under the fig tree."
      ],
      "full_text": "1And he shewed me Joshua the high priest standing before theangelof theLord, andSatanstanding at his right hand toresisthim. 2And theLordsaid unto Satan, TheLordrebuke thee, O Satan; even theLordthat hath chosen Jerusalem rebuke thee:isnot this abrandplucked out of the fire? 3Now Joshua was clothed withfilthygarments, and stood before the angel. 4And he answered and spake unto those that stood before him, saying, Take away the filthy garments from him. And unto him he said, Behold, I have caused thine iniquity to pass from thee, and I will clothe thee with change of raiment. 5And I said, Let them seta fair mitreupon his head. So they set a fair mitre upon his head, and clothed him with garments. And the angel of theLordstood by. 6And the angel of theLordprotested unto Joshua, saying, 7Thus saith theLordof hosts; If thou wiltwalkin my ways, and if thou wilt keep mycharge, then thou shalt also judge my house, and shalt also keep my courts, and I will give thee places to walk amongthese that stand by. 8Hear now, O Joshua the high priest, thou, and thy fellows that sit before thee: for theyaremen wondered at: for, behold, I will bring forth my servant theBranch. 9For behold the stone that I have laid before Joshua; upon one stoneshall beseven eyes: behold, I will engrave the graving thereof, saith theLordof hosts, and I will remove the iniquity of that land in one day. 10In that day, saith theLordof hosts, shall ye call every man his neighbour under the vine and under the fig tree."
    },
    {
      "reference": "Zechariah 4",
      "title": "Zechariah 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/4?lang=eng",
      "summary": "Zerubbabel will lay the foundation of and finish the house of the Lord, the temple of Zerubbabel.",
      "verses": [
        "1And the angel that talked with me came again, and waked me, as a man that is wakened out of his sleep,",
        "2And said unto me, What seest thou? And I said, I have looked, and behold acandlestickallofgold, with a bowl upon the top of it, and his seven lamps thereon, and sevenpipes to the seven lamps, whichareupon the top thereof:",
        "3And two olive trees by it, one upon the rightsideof the bowl, and the other upon the leftsidethereof.",
        "4So I answered and spake to the angel that talked with me, saying, Whatarethese, my lord?",
        "5Then the angel that talked with me answered and said unto me, Knowest thou not what these be? And I said, No, my lord.",
        "6Then he answered and spake unto me, saying, Thisisthe word of theLordunto Zerubbabel, saying, Not by might, nor by power, but by myspirit, saith theLordof hosts.",
        "7Whoartthou, O great mountain? before Zerubbabelthou shalt becomea plain: and he shall bring forth the headstonethereof withshoutings,crying,Grace, grace unto it.",
        "8Moreover the word of theLordcame unto me, saying,",
        "9The hands of Zerubbabel have laid the foundation of this house; his hands shall also finish it; and thou shalt know that theLordof hosts hath sent me unto you.",
        "10For who hath despised the day of small things? for they shall rejoice, and shall see the plummet in the hand of Zerubbabelwiththose seven; theyarethe eyes of theLord, which run to and fro through the whole earth.",
        "11Â¶Then answered I, and said unto him, Whatarethese two olive trees upon the rightsideof the candlestick and upon the leftsidethereof?",
        "12And I answered again, and said unto him, Whatbe thesetwo olive branches which through the two golden pipes empty the goldenoilout of themselves?",
        "13And he answered me and said, Knowest thou not what thesebe?And I said, No, my lord.",
        "14Then said he, Thesearethe twoanointedones, that stand by the Lord of the whole earth."
      ],
      "full_text": "1And the angel that talked with me came again, and waked me, as a man that is wakened out of his sleep, 2And said unto me, What seest thou? And I said, I have looked, and behold acandlestickallofgold, with a bowl upon the top of it, and his seven lamps thereon, and sevenpipes to the seven lamps, whichareupon the top thereof: 3And two olive trees by it, one upon the rightsideof the bowl, and the other upon the leftsidethereof. 4So I answered and spake to the angel that talked with me, saying, Whatarethese, my lord? 5Then the angel that talked with me answered and said unto me, Knowest thou not what these be? And I said, No, my lord. 6Then he answered and spake unto me, saying, Thisisthe word of theLordunto Zerubbabel, saying, Not by might, nor by power, but by myspirit, saith theLordof hosts. 7Whoartthou, O great mountain? before Zerubbabelthou shalt becomea plain: and he shall bring forth the headstonethereof withshoutings,crying,Grace, grace unto it. 8Moreover the word of theLordcame unto me, saying, 9The hands of Zerubbabel have laid the foundation of this house; his hands shall also finish it; and thou shalt know that theLordof hosts hath sent me unto you. 10For who hath despised the day of small things? for they shall rejoice, and shall see the plummet in the hand of Zerubbabelwiththose seven; theyarethe eyes of theLord, which run to and fro through the whole earth. 11Â¶Then answered I, and said unto him, Whatarethese two olive trees upon the rightsideof the candlestick and upon the leftsidethereof? 12And I answered again, and said unto him, Whatbe thesetwo olive branches which through the two golden pipes empty the goldenoilout of themselves? 13And he answered me and said, Knowest thou not what thesebe?And I said, No, my lord. 14Then said he, Thesearethe twoanointedones, that stand by the Lord of the whole earth."
    },
    {
      "reference": "Zechariah 7",
      "title": "Zechariah 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/7?lang=eng",
      "summary": "The Lord reproves hypocrisy in fastsâHe calls upon the people to show mercy and compassion and to live godly lives.",
      "verses": [
        "1And it came to pass in the fourth year of king Darius,thatthe word of theLordcame unto Zechariah in the fourthdayof the ninth month,evenin Chisleu;",
        "2When they had sent unto the house of God Sherezer and Regem-melech, and their men, to pray before theLord,",
        "3Andto speak unto the priests whichwerein the house of theLordof hosts, and to the prophets, saying, Should I weep in the fifth month, separating myself, as I have done these so many years?",
        "4Â¶Then came the word of theLordof hosts unto me, saying,",
        "5Speak unto all the people of the land, and to the priests, saying, When ye fasted and mourned in the fifth and seventhmonth,even those seventy years, did ye at allfastunto me,evento me?",
        "6And when ye did eat, and when ye did drink, did not ye eatfor yourselves,and drinkfor yourselves?",
        "7Should yenothearthe words which theLordhath cried by theformerprophets, when Jerusalem was inhabited and in prosperity, and the cities thereof round about her, whenmeninhabited the south and the plain?",
        "8Â¶And the word of theLordcame unto Zechariah, saying,",
        "9Thus speaketh theLordof hosts, saying, Execute truejudgment, and shewmercyandcompassionsevery man to his brother:",
        "10Andoppressnot the widow, nor the fatherless, the stranger, nor thepoor; and let none of you imagine evil against his brother in your heart.",
        "11But they refused to hearken, and pulled away the shoulder, and stopped their ears, that they should not hear.",
        "12Yea, they made their heartsasan adamantstone, lest they should hear the law, and the words which theLordof hosts hath sent in his spirit by the formerprophets: therefore came a great wrath from theLordof hosts.",
        "13Therefore it is come to pass,thatas he cried, and they would not hear; sotheycried, and I would not hear, saith theLordof hosts:",
        "14But Iscatteredthem with a whirlwind among all the nations whom they knew not. Thus the land was desolate after them, that no man passed through nor returned: for they laid the pleasant land desolate."
      ],
      "full_text": "1And it came to pass in the fourth year of king Darius,thatthe word of theLordcame unto Zechariah in the fourthdayof the ninth month,evenin Chisleu; 2When they had sent unto the house of God Sherezer and Regem-melech, and their men, to pray before theLord, 3Andto speak unto the priests whichwerein the house of theLordof hosts, and to the prophets, saying, Should I weep in the fifth month, separating myself, as I have done these so many years? 4Â¶Then came the word of theLordof hosts unto me, saying, 5Speak unto all the people of the land, and to the priests, saying, When ye fasted and mourned in the fifth and seventhmonth,even those seventy years, did ye at allfastunto me,evento me? 6And when ye did eat, and when ye did drink, did not ye eatfor yourselves,and drinkfor yourselves? 7Should yenothearthe words which theLordhath cried by theformerprophets, when Jerusalem was inhabited and in prosperity, and the cities thereof round about her, whenmeninhabited the south and the plain? 8Â¶And the word of theLordcame unto Zechariah, saying, 9Thus speaketh theLordof hosts, saying, Execute truejudgment, and shewmercyandcompassionsevery man to his brother: 10Andoppressnot the widow, nor the fatherless, the stranger, nor thepoor; and let none of you imagine evil against his brother in your heart. 11But they refused to hearken, and pulled away the shoulder, and stopped their ears, that they should not hear. 12Yea, they made their heartsasan adamantstone, lest they should hear the law, and the words which theLordof hosts hath sent in his spirit by the formerprophets: therefore came a great wrath from theLordof hosts. 13Therefore it is come to pass,thatas he cried, and they would not hear; sotheycried, and I would not hear, saith theLordof hosts: 14But Iscatteredthem with a whirlwind among all the nations whom they knew not. Thus the land was desolate after them, that no man passed through nor returned: for they laid the pleasant land desolate."
    },
    {
      "reference": "Zechariah 8",
      "title": "Zechariah 8",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/8?lang=eng",
      "summary": "In the last days, Jerusalem will be restored, Judah will be gathered, and the Lord will bless His people beyond anything in the past.",
      "verses": [
        "1Again the word of theLordof hosts cameto me,saying,",
        "2Thus saith theLordof hosts; I was jealous for Zion with great jealousy, and I wasjealousfor her with great fury.",
        "3Thus saith theLord; I am returned unto Zion, and will dwell in the midst of Jerusalem: andJerusalemshall be called a city of truth; and themountainof theLordof hosts the holy mountain.",
        "4Thus saith theLordof hosts; There shall yetoldmen and old women dwell in the streets of Jerusalem, and every man with his staff in his hand for very age.",
        "5And the streets of the city shall be full of boys and girls playing in the streets thereof.",
        "6Thus saith theLordof hosts; If it be marvellous in the eyes of the remnant of this people in these days, should it also be marvellous in mine eyes? saith theLordof hosts.",
        "7Thus saith theLordof hosts; Behold, I willsavemy people from the east country, and from the west country;",
        "8And I will bring them, and they shall dwell in the midst of Jerusalem: and they shall be mypeople, and I will be their God, in truth and in righteousness.",
        "9Â¶Thus saith theLordof hosts; Let your hands be strong, ye that hear in these days these words by the mouth of theprophets, whichwerein the daythatthe foundation of the house of theLordof hosts was laid, that the temple might be built.",
        "10For before these days there was no hire for man, nor any hire for beast; neitherwas there anypeace to him that went out or came in because of the affliction: for I set all men every one against his neighbour.",
        "11But now Iwillnotbeunto the residue of this people as in the former days, saith theLordof hosts.",
        "12For the seedshall beprosperous; the vine shall give her fruit, and the ground shall give her increase, and the heavens shall give their dew; and I will cause the remnant of this people to possess all thesethings.",
        "13And it shall come to pass,thatas ye were acurseamong the heathen, O house of Judah, and house of Israel; so will Isaveyou, and ye shall be ablessing: fear not,butlet your hands be strong.",
        "14For thus saith theLordof hosts; As I thought to punish you, when your fathers provoked me to wrath, saith theLordof hosts, and Irepentednot:",
        "15So again have I thought in these days to do well unto Jerusalem and to the house of Judah: fear ye not.",
        "16Â¶Thesearethe things that ye shall do; Speak ye every man thetruthto his neighbour; execute thejudgmentof truth andpeacein your gates:",
        "17And let none of you imagine evil in your hearts against his neighbour; and love nofalse oath: for all theseare thingsthat I hate, saith theLord.",
        "18Â¶And the word of theLordof hosts came unto me, saying,",
        "19Thus saith theLordof hosts; The fast of the fourthmonth,and the fast of the fifth, and the fast of the seventh, and the fast of the tenth, shall be to the house of Judah joy and gladness, and cheerful feasts; therefore love the truth and peace.",
        "20Thus saith theLordof hosts;It shallyetcome to pass,that there shall come people, and the inhabitants of many cities:",
        "21And the inhabitants of onecityshall go to another, saying, Let us go speedily to pray before theLord, and to seek theLordof hosts: I will go also.",
        "22Yea, manypeopleand strong nations shall come to seek theLordof hosts in Jerusalem, and to pray before theLord.",
        "23Thus saith theLordof hosts; In those daysit shall come to pass,that ten men shall take hold out of all languages of the nations, even shall take hold of the skirt of him that is a Jew, saying, We will go with you: for we have heardthatGodiswithyou."
      ],
      "full_text": "1Again the word of theLordof hosts cameto me,saying, 2Thus saith theLordof hosts; I was jealous for Zion with great jealousy, and I wasjealousfor her with great fury. 3Thus saith theLord; I am returned unto Zion, and will dwell in the midst of Jerusalem: andJerusalemshall be called a city of truth; and themountainof theLordof hosts the holy mountain. 4Thus saith theLordof hosts; There shall yetoldmen and old women dwell in the streets of Jerusalem, and every man with his staff in his hand for very age. 5And the streets of the city shall be full of boys and girls playing in the streets thereof. 6Thus saith theLordof hosts; If it be marvellous in the eyes of the remnant of this people in these days, should it also be marvellous in mine eyes? saith theLordof hosts. 7Thus saith theLordof hosts; Behold, I willsavemy people from the east country, and from the west country; 8And I will bring them, and they shall dwell in the midst of Jerusalem: and they shall be mypeople, and I will be their God, in truth and in righteousness. 9Â¶Thus saith theLordof hosts; Let your hands be strong, ye that hear in these days these words by the mouth of theprophets, whichwerein the daythatthe foundation of the house of theLordof hosts was laid, that the temple might be built. 10For before these days there was no hire for man, nor any hire for beast; neitherwas there anypeace to him that went out or came in because of the affliction: for I set all men every one against his neighbour. 11But now Iwillnotbeunto the residue of this people as in the former days, saith theLordof hosts. 12For the seedshall beprosperous; the vine shall give her fruit, and the ground shall give her increase, and the heavens shall give their dew; and I will cause the remnant of this people to possess all thesethings. 13And it shall come to pass,thatas ye were acurseamong the heathen, O house of Judah, and house of Israel; so will Isaveyou, and ye shall be ablessing: fear not,butlet your hands be strong. 14For thus saith theLordof hosts; As I thought to punish you, when your fathers provoked me to wrath, saith theLordof hosts, and Irepentednot: 15So again have I thought in these days to do well unto Jerusalem and to the house of Judah: fear ye not. 16Â¶Thesearethe things that ye shall do; Speak ye every man thetruthto his neighbour; execute thejudgmentof truth andpeacein your gates: 17And let none of you imagine evil in your hearts against his neighbour; and love nofalse oath: for all theseare thingsthat I hate, saith theLord. 18Â¶And the word of theLordof hosts came unto me, saying, 19Thus saith theLordof hosts; The fast of the fourthmonth,and the fast of the fifth, and the fast of the seventh, and the fast of the tenth, shall be to the house of Judah joy and gladness, and cheerful feasts; therefore love the truth and peace. 20Thus saith theLordof hosts;It shallyetcome to pass,that there shall come people, and the inhabitants of many cities: 21And the inhabitants of onecityshall go to another, saying, Let us go speedily to pray before theLord, and to seek theLordof hosts: I will go also. 22Yea, manypeopleand strong nations shall come to seek theLordof hosts in Jerusalem, and to pray before theLord. 23Thus saith theLordof hosts; In those daysit shall come to pass,that ten men shall take hold out of all languages of the nations, even shall take hold of the skirt of him that is a Jew, saying, We will go with you: for we have heardthatGodiswithyou."
    },
    {
      "reference": "Zechariah 9",
      "title": "Zechariah 9",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/9?lang=eng",
      "summary": "Zechariah speaks as the MessiahâThe Messiah will come, having salvation, lowly and riding upon an assâHe will free the prisoners from the pitâJudah and Ephraim are instruments of the Lord.",
      "verses": [
        "1The burden of the word of theLordin the land of Hadrach, and Damascusshall bethe rest thereof: when the eyes of man, as of all the tribes of Israel,shall betoward theLord.",
        "2And Hamath also shall border thereby; Tyrus, and Zidon, though it be very wise.",
        "3AndTyrusdid build herself a strong hold, and heaped up silver as the dust, and fine gold as the mire of the streets.",
        "4Behold, the Lord will cast her out, and he will smite her power inthe sea; and she shall be devoured with fire.",
        "5Ashkelonshall seeit,and fear; Gaza alsoshall see it,and be very sorrowful, and Ekron; for her expectation shall be ashamed; and the king shall perish from Gaza, and Ashkelon shall not be inhabited.",
        "6And a bastard shall dwell in Ashdod, and I will cut off the pride of the Philistines.",
        "7And I will take away his blood out of his mouth, and his abominations from between his teeth: but he that remaineth, even he,shall befor our God, and he shall be as a governor in Judah, and Ekron as aJebusite.",
        "8And I will encamp about mine house because of the army, because of him that passeth by, and because of him that returneth: and no oppressor shall pass through them any more: for now have I seen with mine eyes.",
        "9Â¶Rejoice greatly, Odaughterof Zion; shout, O daughter of Jerusalem: behold, thyKingcometh unto thee: heisjust, and having salvation; lowly, andridingupon anass, and upon acoltthe foal of an ass.",
        "10And I will cut off the chariot from Ephraim, and thehorsefrom Jerusalem, and the battle bow shall be cut off: and he shall speak peace unto theheathen: and hisdominionshall befrom seaevento sea, and from the riverevento the ends of the earth.",
        "11As for thee also, by thebloodof thycovenantI have sent forth thyprisonersout of thepitwhereinisno water.",
        "12Â¶Turn you to the strong hold, ye prisoners ofhope: even to day do I declarethatI willrenderdoubleunto thee;",
        "13When I have bent Judah for me, filled the bow with Ephraim, and raised up thy sons, O Zion, against thy sons, O Greece, and made thee as the sword of a mighty man.",
        "14And theLordshall be seen over them, and his arrow shall go forth as the lightning: and the LordGodshall blow the trumpet, and shall go withwhirlwindsof the south.",
        "15TheLordof hosts shall defend them; and they shall devour, and subdue with sling stones; and they shall drink,andmake a noise as through wine; and they shall be filled like bowls,andas the corners of the altar.",
        "16And theLordtheir God shallsavethem in thatdayas the flock of his people: forthey shall be asthestonesof acrown, lifted up as anensignupon his land.",
        "17For how greatishis goodness, and how greatishis beauty! corn shall make the young men cheerful, and new wine the maids."
      ],
      "full_text": "1The burden of the word of theLordin the land of Hadrach, and Damascusshall bethe rest thereof: when the eyes of man, as of all the tribes of Israel,shall betoward theLord. 2And Hamath also shall border thereby; Tyrus, and Zidon, though it be very wise. 3AndTyrusdid build herself a strong hold, and heaped up silver as the dust, and fine gold as the mire of the streets. 4Behold, the Lord will cast her out, and he will smite her power inthe sea; and she shall be devoured with fire. 5Ashkelonshall seeit,and fear; Gaza alsoshall see it,and be very sorrowful, and Ekron; for her expectation shall be ashamed; and the king shall perish from Gaza, and Ashkelon shall not be inhabited. 6And a bastard shall dwell in Ashdod, and I will cut off the pride of the Philistines. 7And I will take away his blood out of his mouth, and his abominations from between his teeth: but he that remaineth, even he,shall befor our God, and he shall be as a governor in Judah, and Ekron as aJebusite. 8And I will encamp about mine house because of the army, because of him that passeth by, and because of him that returneth: and no oppressor shall pass through them any more: for now have I seen with mine eyes. 9Â¶Rejoice greatly, Odaughterof Zion; shout, O daughter of Jerusalem: behold, thyKingcometh unto thee: heisjust, and having salvation; lowly, andridingupon anass, and upon acoltthe foal of an ass. 10And I will cut off the chariot from Ephraim, and thehorsefrom Jerusalem, and the battle bow shall be cut off: and he shall speak peace unto theheathen: and hisdominionshall befrom seaevento sea, and from the riverevento the ends of the earth. 11As for thee also, by thebloodof thycovenantI have sent forth thyprisonersout of thepitwhereinisno water. 12Â¶Turn you to the strong hold, ye prisoners ofhope: even to day do I declarethatI willrenderdoubleunto thee; 13When I have bent Judah for me, filled the bow with Ephraim, and raised up thy sons, O Zion, against thy sons, O Greece, and made thee as the sword of a mighty man. 14And theLordshall be seen over them, and his arrow shall go forth as the lightning: and the LordGodshall blow the trumpet, and shall go withwhirlwindsof the south. 15TheLordof hosts shall defend them; and they shall devour, and subdue with sling stones; and they shall drink,andmake a noise as through wine; and they shall be filled like bowls,andas the corners of the altar. 16And theLordtheir God shallsavethem in thatdayas the flock of his people: forthey shall be asthestonesof acrown, lifted up as anensignupon his land. 17For how greatishis goodness, and how greatishis beauty! corn shall make the young men cheerful, and new wine the maids."
    },
    {
      "reference": "Zechariah 10",
      "title": "Zechariah 10",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/10?lang=eng",
      "summary": "Judah and Joseph will be scattered among the people in far countriesâThe Lord will hiss for them, gather them, and redeem them.",
      "verses": [
        "1Ask ye of theLordrain in the time of thelatterrain;sotheLordshall make bright clouds, and give them showers of rain, to every one grass in the field.",
        "2For the idols have spoken vanity, and thedivinershave seen a lie, and have told falsedreams; theycomfort in vain: therefore they went their way as a flock, they were troubled, becausethere wasnoshepherd.",
        "3Mine anger was kindled against the shepherds, and I punished the goats: for theLordof hosts hath visited his flock the house of Judah, and hath made them as his goodly horse in the battle.",
        "4Out of him came forththe corner, out of him thenail, out of him the battle bow, out of him every oppressor together.",
        "5Â¶And they shall be as mightymen,which tread downtheir enemiesin the mire of the streets in the battle: and they shall fight, because theLordiswith them, and the riders on horses shall be confounded.",
        "6And I will strengthen the house of Judah, and I will save the house of Joseph, and I will bring them again to place them; for I have mercy upon them: and they shall be as though I had not cast them off: for IamtheLordtheir God, and willhearthem.",
        "7Andthey ofEphraimshall be like a mightyman,and their heart shall rejoice as through wine: yea, their children shall seeit,and be glad; their heart shall rejoice in theLord.",
        "8I will hiss for them, andgatherthem; for I have redeemed them: and they shall increase as they have increased.",
        "9And I willsowthem among the people: and they shallrememberme in far countries; and they shall live with their children, and turn again.",
        "10I will bring them again also out of the land of Egypt, and gather them out ofAssyria; and I will bring them into the land of Gilead and Lebanon; andplaceshall not be found for them.",
        "11And he shall pass through the sea with affliction, and shall smite the waves in the sea, and all the deeps of the river shall dry up: and the pride ofAssyriashall be brought down, and thesceptreofEgyptshall depart away.",
        "12And I willstrengthenthem in theLord; and they shall walk up and down in hisname, saith theLord."
      ],
      "full_text": "1Ask ye of theLordrain in the time of thelatterrain;sotheLordshall make bright clouds, and give them showers of rain, to every one grass in the field. 2For the idols have spoken vanity, and thedivinershave seen a lie, and have told falsedreams; theycomfort in vain: therefore they went their way as a flock, they were troubled, becausethere wasnoshepherd. 3Mine anger was kindled against the shepherds, and I punished the goats: for theLordof hosts hath visited his flock the house of Judah, and hath made them as his goodly horse in the battle. 4Out of him came forththe corner, out of him thenail, out of him the battle bow, out of him every oppressor together. 5Â¶And they shall be as mightymen,which tread downtheir enemiesin the mire of the streets in the battle: and they shall fight, because theLordiswith them, and the riders on horses shall be confounded. 6And I will strengthen the house of Judah, and I will save the house of Joseph, and I will bring them again to place them; for I have mercy upon them: and they shall be as though I had not cast them off: for IamtheLordtheir God, and willhearthem. 7Andthey ofEphraimshall be like a mightyman,and their heart shall rejoice as through wine: yea, their children shall seeit,and be glad; their heart shall rejoice in theLord. 8I will hiss for them, andgatherthem; for I have redeemed them: and they shall increase as they have increased. 9And I willsowthem among the people: and they shallrememberme in far countries; and they shall live with their children, and turn again. 10I will bring them again also out of the land of Egypt, and gather them out ofAssyria; and I will bring them into the land of Gilead and Lebanon; andplaceshall not be found for them. 11And he shall pass through the sea with affliction, and shall smite the waves in the sea, and all the deeps of the river shall dry up: and the pride ofAssyriashall be brought down, and thesceptreofEgyptshall depart away. 12And I willstrengthenthem in theLord; and they shall walk up and down in hisname, saith theLord."
    },
    {
      "reference": "Zechariah 11",
      "title": "Zechariah 11",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/11?lang=eng",
      "summary": "Zechariah speaks about the MessiahâThe Messiah will be betrayed for thirty pieces of silverâThey will be cast to the potter in the house of the Lord.",
      "verses": [
        "1Open thy doors, O Lebanon, that the fire may devour thy cedars.",
        "2Howl,fir tree; for the cedar is fallen; because the mighty are spoiled: howl, O yeoaksof Bashan; for the forest of the vintage is come down.",
        "3Â¶There isa voice of the howling of the shepherds; for their glory is spoiled: a voice of the roaring of young lions; for the pride of Jordan is spoiled.",
        "4Thus saith theLordmy God; Feed the flock of the slaughter;",
        "5Whose possessors slay them, and hold themselves notguilty: and they that sell them say, BlessedbetheLord; for I amrich: and their own shepherds pity them not.",
        "6For I will no more pity the inhabitants of the land, saith theLord: but, lo, I will deliver the men every one into his neighbourâs hand, and into the hand of his king: and they shall smite the land, and out of their hand I will not deliverthem.",
        "7And I will feed the flock ofslaughter,evenyou, O poor of the flock. And I took unto me two staves; the one I called Beauty, and the other I calledBands; and I fed the flock.",
        "8Three shepherds also I cut off in one month; and my soul lothed them, and their soul also abhorred me.",
        "9Then said I, I will not feed you: that that dieth, let it die; and that that is to be cut off, let it be cut off; and let the rest eat every one the flesh of another.",
        "10Â¶And I took my staff,evenBeauty, and cut it asunder, that I might break my covenant which I had made with all the people.",
        "11And it was broken in that day: and so the poor of the flockthat waited upon meknew that itwasthe word of theLord.",
        "12And I said unto them, If ye think good, givememy price; and if not, forbear. So they weighed for my pricethirtypiecesofsilver.",
        "13And theLordsaid unto me, Cast it unto thepotter: a goodly price that I wasprisedat of them. And I took the thirtypiecesof silver, and cast them to the potter in the house of theLord.",
        "14Then I cut asunder mine other staff,evenBands, that I might break the brotherhood between Judah and Israel.",
        "15Â¶And theLordsaid unto me, Take unto thee yet the instruments of a foolish shepherd.",
        "16For, lo, I will raise up a shepherd in the land,whichshall not visit those that be cut off, neither shall seek the young one, nor heal that that is broken, nor feed that that standeth still: but he shall eat the flesh of the fat, and tear their claws in pieces.",
        "17Woe to the idolshepherdthat leaveth the flock! the swordshall beupon his arm, and upon his right eye: his arm shall be clean dried up, and his right eye shall be utterly darkened."
      ],
      "full_text": "1Open thy doors, O Lebanon, that the fire may devour thy cedars. 2Howl,fir tree; for the cedar is fallen; because the mighty are spoiled: howl, O yeoaksof Bashan; for the forest of the vintage is come down. 3Â¶There isa voice of the howling of the shepherds; for their glory is spoiled: a voice of the roaring of young lions; for the pride of Jordan is spoiled. 4Thus saith theLordmy God; Feed the flock of the slaughter; 5Whose possessors slay them, and hold themselves notguilty: and they that sell them say, BlessedbetheLord; for I amrich: and their own shepherds pity them not. 6For I will no more pity the inhabitants of the land, saith theLord: but, lo, I will deliver the men every one into his neighbourâs hand, and into the hand of his king: and they shall smite the land, and out of their hand I will not deliverthem. 7And I will feed the flock ofslaughter,evenyou, O poor of the flock. And I took unto me two staves; the one I called Beauty, and the other I calledBands; and I fed the flock. 8Three shepherds also I cut off in one month; and my soul lothed them, and their soul also abhorred me. 9Then said I, I will not feed you: that that dieth, let it die; and that that is to be cut off, let it be cut off; and let the rest eat every one the flesh of another. 10Â¶And I took my staff,evenBeauty, and cut it asunder, that I might break my covenant which I had made with all the people. 11And it was broken in that day: and so the poor of the flockthat waited upon meknew that itwasthe word of theLord. 12And I said unto them, If ye think good, givememy price; and if not, forbear. So they weighed for my pricethirtypiecesofsilver. 13And theLordsaid unto me, Cast it unto thepotter: a goodly price that I wasprisedat of them. And I took the thirtypiecesof silver, and cast them to the potter in the house of theLord. 14Then I cut asunder mine other staff,evenBands, that I might break the brotherhood between Judah and Israel. 15Â¶And theLordsaid unto me, Take unto thee yet the instruments of a foolish shepherd. 16For, lo, I will raise up a shepherd in the land,whichshall not visit those that be cut off, neither shall seek the young one, nor heal that that is broken, nor feed that that standeth still: but he shall eat the flesh of the fat, and tear their claws in pieces. 17Woe to the idolshepherdthat leaveth the flock! the swordshall beupon his arm, and upon his right eye: his arm shall be clean dried up, and his right eye shall be utterly darkened."
    },
    {
      "reference": "Zechariah 12",
      "title": "Zechariah 12",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/12?lang=eng",
      "summary": "In the final great war, all nations will be engaged at Jerusalem, but the Lord will defend His peopleâThen the Jews will look upon the Lord, whom they crucified, and there will be great mourning.",
      "verses": [
        "1The burden of the word of theLordfor Israel, saith theLord, which stretcheth forth the heavens, and layeth the foundation of theearth, and formeth thespiritof man within him.",
        "2Behold, I will make Jerusalem acupof trembling unto all thepeopleround about, when they shall be in the siege both against Judahandagainst Jerusalem.",
        "3Â¶And in that day will I make Jerusalem a burdensome stone for all people: all that burden themselves with it shall be cut in pieces, though all the people of the earth begatheredtogether against it.",
        "4In that day, saith theLord, I will smite every horse with astonishment, and his rider with madness: and I will open mine eyes upon the house of Judah, and will smite every horse of the people with blindness.",
        "5And the governors of Judah shall say in their heart, The inhabitants of Jerusalemshall bemy strength in theLordof hosts their God.",
        "6Â¶In that day will I make the governors of Judah like anhearthof fire among the wood, and like a torch of fire in a sheaf; and they shall devour all thepeopleround about, on the right hand and on the left: andJerusalemshall beinhabitedagain in her own place,evenin Jerusalem.",
        "7TheLordalso shall save the tents of Judah first, that the glory of the house ofDavidand the glory of the inhabitants of Jerusalem do not magnifythemselvesagainst Judah.",
        "8In that day shall theLorddefend the inhabitants of Jerusalem; and he that is feeble among them at that day shall be as David; and the house of Davidshall beas God, as the angel of theLordbefore them.",
        "9Â¶And it shall come to pass in that day,thatI will seek todestroyall the nations that come againstJerusalem.",
        "10And I willpourupon the house of David, and upon the inhabitants of Jerusalem, the spirit ofgraceand of supplications: and they shalllookupon me whom they havepierced, and they shallmournfor him, as one mourneth forhisonlyson,and shall be in bitterness for him, as one that is in bitterness forhisfirstborn.",
        "11In that day shall there be a greatmourningin Jerusalem, as the mourning of Hadadrimmon in the valley of Megiddon.",
        "12And the land shallmourn, every family apart; the family of the house of David apart, and their wives apart; the family of the house of Nathan apart, and their wives apart;",
        "13The family of the house of Levi apart, and their wives apart; the family of Shimei apart, and their wives apart;",
        "14All the families that remain, every family apart, and their wives apart."
      ],
      "full_text": "1The burden of the word of theLordfor Israel, saith theLord, which stretcheth forth the heavens, and layeth the foundation of theearth, and formeth thespiritof man within him. 2Behold, I will make Jerusalem acupof trembling unto all thepeopleround about, when they shall be in the siege both against Judahandagainst Jerusalem. 3Â¶And in that day will I make Jerusalem a burdensome stone for all people: all that burden themselves with it shall be cut in pieces, though all the people of the earth begatheredtogether against it. 4In that day, saith theLord, I will smite every horse with astonishment, and his rider with madness: and I will open mine eyes upon the house of Judah, and will smite every horse of the people with blindness. 5And the governors of Judah shall say in their heart, The inhabitants of Jerusalemshall bemy strength in theLordof hosts their God. 6Â¶In that day will I make the governors of Judah like anhearthof fire among the wood, and like a torch of fire in a sheaf; and they shall devour all thepeopleround about, on the right hand and on the left: andJerusalemshall beinhabitedagain in her own place,evenin Jerusalem. 7TheLordalso shall save the tents of Judah first, that the glory of the house ofDavidand the glory of the inhabitants of Jerusalem do not magnifythemselvesagainst Judah. 8In that day shall theLorddefend the inhabitants of Jerusalem; and he that is feeble among them at that day shall be as David; and the house of Davidshall beas God, as the angel of theLordbefore them. 9Â¶And it shall come to pass in that day,thatI will seek todestroyall the nations that come againstJerusalem. 10And I willpourupon the house of David, and upon the inhabitants of Jerusalem, the spirit ofgraceand of supplications: and they shalllookupon me whom they havepierced, and they shallmournfor him, as one mourneth forhisonlyson,and shall be in bitterness for him, as one that is in bitterness forhisfirstborn. 11In that day shall there be a greatmourningin Jerusalem, as the mourning of Hadadrimmon in the valley of Megiddon. 12And the land shallmourn, every family apart; the family of the house of David apart, and their wives apart; the family of the house of Nathan apart, and their wives apart; 13The family of the house of Levi apart, and their wives apart; the family of Shimei apart, and their wives apart; 14All the families that remain, every family apart, and their wives apart."
    },
    {
      "reference": "Zechariah 13",
      "title": "Zechariah 13",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/13?lang=eng",
      "summary": "The Jews will gain forgiveness at the Second ComingâThey will ask the Lord, What are these wounds in Thine hands?âThe remnant, tried and refined, will be His people.",
      "verses": [
        "1In that day there shall be afountainopened to the house of David and to the inhabitants of Jerusalem for sin and for uncleanness.",
        "2Â¶And it shall come to pass in that day, saith theLordof hosts,thatI will cut off the names of theidolsout of the land, and they shall no more be remembered: and also I will cause the prophets and the unclean spirit to pass out of the land.",
        "3And it shall come to pass,thatwhen any shall yet prophesy, then his father and his mother that begat him shall say unto him, Thou shalt not live; for thou speakest lies in the name of theLord: and his father and his mother that begat him shall thrust him through when he prophesieth.",
        "4And it shall come to pass in that day,thatthe prophets shall beashamedevery one of his vision, when he hath prophesied; neither shall they wear aroughgarment to deceive:",
        "5But he shall say, Iamno prophet, Iaman husbandman; for man taught me to keep cattle from my youth.",
        "6Andoneshall say unto him, Whatarethesewoundsin thine hands? Then he shall answer,Thosewith which I waswoundedinthe house of my friends.",
        "7Â¶Awake, O sword, against my shepherd, and against the manthat ismy fellow, saith theLordofhosts: smite theshepherd, and thesheepshall bescattered: and I will turn mine hand upon the little ones.",
        "8And it shall come to pass,thatin all the land, saith theLord, two parts therein shall be cut offanddie; but the third shall belefttherein.",
        "9And I will bring the third part through the fire, and willrefinethem as silver is refined, and willtrythem as gold istried: they shall call on my name, and I will hear them: I will say, Itismypeople: and they shall say, TheLordismy God."
      ],
      "full_text": "1In that day there shall be afountainopened to the house of David and to the inhabitants of Jerusalem for sin and for uncleanness. 2Â¶And it shall come to pass in that day, saith theLordof hosts,thatI will cut off the names of theidolsout of the land, and they shall no more be remembered: and also I will cause the prophets and the unclean spirit to pass out of the land. 3And it shall come to pass,thatwhen any shall yet prophesy, then his father and his mother that begat him shall say unto him, Thou shalt not live; for thou speakest lies in the name of theLord: and his father and his mother that begat him shall thrust him through when he prophesieth. 4And it shall come to pass in that day,thatthe prophets shall beashamedevery one of his vision, when he hath prophesied; neither shall they wear aroughgarment to deceive: 5But he shall say, Iamno prophet, Iaman husbandman; for man taught me to keep cattle from my youth. 6Andoneshall say unto him, Whatarethesewoundsin thine hands? Then he shall answer,Thosewith which I waswoundedinthe house of my friends. 7Â¶Awake, O sword, against my shepherd, and against the manthat ismy fellow, saith theLordofhosts: smite theshepherd, and thesheepshall bescattered: and I will turn mine hand upon the little ones. 8And it shall come to pass,thatin all the land, saith theLord, two parts therein shall be cut offanddie; but the third shall belefttherein. 9And I will bring the third part through the fire, and willrefinethem as silver is refined, and willtrythem as gold istried: they shall call on my name, and I will hear them: I will say, Itismypeople: and they shall say, TheLordismy God."
    },
    {
      "reference": "Zechariah 14",
      "title": "Zechariah 14",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zech/14?lang=eng",
      "summary": "At His Second Coming, the Lord will fight for IsraelâHis feet will stand upon the Mount of OlivesâHe will be King over all the earthâPlagues will destroy the wicked.",
      "verses": [
        "1Behold, thedayof theLordcometh, and thy spoil shall be divided in the midst of thee.",
        "2For I will gather all nations against Jerusalem tobattle; and the city shall be taken, and thehousesrifled, and the women ravished; and half of the city shall go forth into captivity, and the residue of the people shall not be cut off from the city.",
        "3Then shall theLordgo forth, andfightagainst those nations, as when he fought in the day of battle.",
        "4Â¶And hisfeetshallstandin that day upon themount of Olives, whichisbefore Jerusalem on the east, and the mount of Olives shall cleave in the midst thereof toward the east and toward the west,and there shall bea very great valley; and half of the mountain shall remove toward the north, and half of it toward the south.",
        "5And ye shall fleetothe valley of the mountains; for the valley of the mountains shall reach unto Azal: yea, ye shall flee, like as ye fled from before theearthquakein the days of Uzziah king of Judah: and theLordmy God shall come,andall thesaintswith thee.",
        "6And it shall come to pass in that day,thatthelightshall not be clear,nordark:",
        "7But it shall be one day which shall be known to theLord, not day, nor night: but it shall come to pass,thatat evening time it shall be light.",
        "8And it shall be in that day,thatlivingwatersshall go out from Jerusalem; half of them toward the former sea, and half of them toward the hinder sea: in summer and in winter shall it be.",
        "9And theLordshall bekingover all the earth: in that day shall there be oneLord, and his name one.",
        "10All the land shall be turned as aplainfrom Geba to Rimmon south of Jerusalem: anditshall be lifted up, and inhabited in herplace, from Benjaminâs gate unto the place of the first gate, unto the corner gate, andfromthe tower of Hananeel unto the kingâs winepresses.",
        "11Andmenshall dwell in it, and there shall be no more utter destruction; but Jerusalem shall be safely inhabited.",
        "12Â¶And this shall be theplaguewherewith theLordwillsmiteallthe people that have fought against Jerusalem; Their flesh shall consume away while they stand upon their feet, and their eyes shall consume away in their holes, and their tongue shall consume away in their mouth.",
        "13And it shall come to pass in that day,thata great tumult from theLordshall be among them; and they shall lay hold every one on the hand of his neighbour, and his hand shall rise up against the hand of hisneighbour.",
        "14And Judah also shall fight at Jerusalem; and the wealth of all theheathenround about shall be gathered together, gold, and silver, and apparel, in great abundance.",
        "15Andso shall be the plague of the horse, of the mule, of the camel, and of the ass, and of all the beasts that shall be in thesetents, as this plague.",
        "16Â¶And it shall come to pass,thatevery one that is left of all the nations which came against Jerusalem shall even go up from year to year toworshiptheKing, theLordof hosts, and to keep thefeastoftabernacles.",
        "17And it shall be,thatwhoso will not come up ofallthe families of the earth unto Jerusalem to worship the King, theLordof hosts, even upon them shall be no rain.",
        "18And if the family of Egypt go not up, and come not, thathavenorain;there shall be the plague, wherewith theLordwill smite theheathenthat come not up to keep the feast of tabernacles.",
        "19This shall be the punishment of Egypt, and the punishment of all nations that come not up to keep the feast of tabernacles.",
        "20Â¶In that day shall there be upon the bells of the horses,Holinessunto theLord; and the pots in theLordâs house shall be like the bowls before the altar.",
        "21Yea, every pot in Jerusalem and in Judah shall beholinessunto theLordof hosts: and all they that sacrifice shall come and take of them, andseethe therein: and in that day there shall be no more theCanaanitein the house of theLordof hosts."
      ],
      "full_text": "1Behold, thedayof theLordcometh, and thy spoil shall be divided in the midst of thee. 2For I will gather all nations against Jerusalem tobattle; and the city shall be taken, and thehousesrifled, and the women ravished; and half of the city shall go forth into captivity, and the residue of the people shall not be cut off from the city. 3Then shall theLordgo forth, andfightagainst those nations, as when he fought in the day of battle. 4Â¶And hisfeetshallstandin that day upon themount of Olives, whichisbefore Jerusalem on the east, and the mount of Olives shall cleave in the midst thereof toward the east and toward the west,and there shall bea very great valley; and half of the mountain shall remove toward the north, and half of it toward the south. 5And ye shall fleetothe valley of the mountains; for the valley of the mountains shall reach unto Azal: yea, ye shall flee, like as ye fled from before theearthquakein the days of Uzziah king of Judah: and theLordmy God shall come,andall thesaintswith thee. 6And it shall come to pass in that day,thatthelightshall not be clear,nordark: 7But it shall be one day which shall be known to theLord, not day, nor night: but it shall come to pass,thatat evening time it shall be light. 8And it shall be in that day,thatlivingwatersshall go out from Jerusalem; half of them toward the former sea, and half of them toward the hinder sea: in summer and in winter shall it be. 9And theLordshall bekingover all the earth: in that day shall there be oneLord, and his name one. 10All the land shall be turned as aplainfrom Geba to Rimmon south of Jerusalem: anditshall be lifted up, and inhabited in herplace, from Benjaminâs gate unto the place of the first gate, unto the corner gate, andfromthe tower of Hananeel unto the kingâs winepresses. 11Andmenshall dwell in it, and there shall be no more utter destruction; but Jerusalem shall be safely inhabited. 12Â¶And this shall be theplaguewherewith theLordwillsmiteallthe people that have fought against Jerusalem; Their flesh shall consume away while they stand upon their feet, and their eyes shall consume away in their holes, and their tongue shall consume away in their mouth. 13And it shall come to pass in that day,thata great tumult from theLordshall be among them; and they shall lay hold every one on the hand of his neighbour, and his hand shall rise up against the hand of hisneighbour. 14And Judah also shall fight at Jerusalem; and the wealth of all theheathenround about shall be gathered together, gold, and silver, and apparel, in great abundance. 15Andso shall be the plague of the horse, of the mule, of the camel, and of the ass, and of all the beasts that shall be in thesetents, as this plague. 16Â¶And it shall come to pass,thatevery one that is left of all the nations which came against Jerusalem shall even go up from year to year toworshiptheKing, theLordof hosts, and to keep thefeastoftabernacles. 17And it shall be,thatwhoso will not come up ofallthe families of the earth unto Jerusalem to worship the King, theLordof hosts, even upon them shall be no rain. 18And if the family of Egypt go not up, and come not, thathavenorain;there shall be the plague, wherewith theLordwill smite theheathenthat come not up to keep the feast of tabernacles. 19This shall be the punishment of Egypt, and the punishment of all nations that come not up to keep the feast of tabernacles. 20Â¶In that day shall there be upon the bells of the horses,Holinessunto theLord; and the pots in theLordâs house shall be like the bowls before the altar. 21Yea, every pot in Jerusalem and in Judah shall beholinessunto theLordof hosts: and all they that sacrifice shall come and take of them, andseethe therein: and in that day there shall be no more theCanaanitein the house of theLordof hosts."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:33:59",
  "metadata": {
    "week_number": 50,
    "title": "Week 50: December 7–13 - Haggai 1–2; Zechariah 1–4; 7–14",
    "date_range": "December 7–13",
    "scraped_at": "2025-12-21T22:34:09.815010",
    "scraper_version": "2.0.0"
  }
}