{
  "week_number": 30,
  "date_range": "July 20–26",
  "title": "Week 30: July 20–26 - 2 Chronicles 14–20; 26; 30",
  "bundle_title": "Week 30: July 20–26: \"Week 30: July 20–26 - 2 Chronicles 14–20; 26; 30\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/30?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/30?lang=eng",
    "title": "2 Chronicles 14–20;26;30",
    "scripture_references": "2 Chronicles 14–20; 26; 30",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“July 20–26. ‘Our Eyes Are upon Thee’: 2 Chronicles 14–20; 26; 30,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“July 20–26. ‘Our Eyes Are upon Thee,’”Come, Follow Me: 2026\n\nThe Kingdom of Judah was surrounded. Armies from three powerful enemy nations were all advancing at once, prepared for battle. In this desperate moment of need, Jehoshaphat, King of Judah, turned to the King of heaven and earth. Jehoshaphat gathered his people at the temple and prayed. He acknowledged their human weakness and pleaded for deliverance. In response, the Lord promised His protection: “Fear not, nor be dismayed” (2 Chronicles 20:17).\n\nWe might not have an invading army at our doorstep threatening to destroy us, but sometimes we do feel surrounded by adversity and evil. Our path to deliverance is the same one Jehoshaphat sought, and our prayer can be like his too: “O our God, … we have no might against this great company that cometh against us; neither know we what to do: but our eyes are upon thee” (2 Chronicles 20:12).\n\nIn2 Chronicles 14–30, you will read about Jehoshaphat and other kings in Judah. Consider how their faith-driven reforms, victories, and challenges can apply to your own life.\n\nFor an overview of the book of 2 Chronicles, see “Chronicles” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "Trusting in God will bring me peace.",
        "content": "When Asa was the king of Judah, he faced many challenges—just like we all do today. As you read about the trials he faced, notice where he put his trust and how that changed over time.\n\nReference\n\nChallenges Asa faced\n\nWhere Asa put his trust\n\nReference\n\n2 Chronicles 14:9–12\n\nReference\n\n2 Chronicles 15:1–8\n\nReference\n\n2 Chronicles 16:1–10\n\nWhy do we sometimes stop trusting the Lord? What else do you learn from Asa’s life?\n\nSee also Elder D. Todd Christofferson, “Our Relationship with God,”Liahona, May 2022, 78–80.\n\n2 Chronicles 18"
      },
      {
        "title": "I can defend the truth, even when it’s unpopular.",
        "content": "The prophet Micaiah must have felt a lot of pressure to predict success for the kings Jehoshaphat and Ahab in their war against Syria. Look for evidence of that pressure in2 Chronicles 18:1–12. What evidence do you find of Micaiah’s courage and integrity inverses 13–27? (Note that inverse 14, Micaiah gives a sarcastic response; his real answer is inverse 16.) How are Micaiah’s words fulfilled inverses 28–34?\n\nWhat are some situations in which you might face pressure like Micaiah faced? What gives you courage to stand up for the Lord and His teachings?\n\nIn the days of King Jehoshaphat, three nations attacked Jerusalem.\n\n2 Chronicles 20:1–25"
      },
      {
        "title": "In difficult times, I can turn to God and His prophets.",
        "content": "As you read2 Chronicles 20:1–12, look for what King Jehoshaphat did when multiple nations came to attack Judah. How could you apply his actions in the challenging circumstances you face?\n\nThe Lord’s response to Jehoshaphat’s prayer is found inverses 14–17. What phrases do you find there that could comfort you or someone you know during difficult times?\n\nThe following day, the people of Jerusalem went out to meet the opposing army. As you read2 Chronicles 20:20, look for the message Jehoshaphat gave to the people of Jerusalem. How were his words fulfilled? (seeverses 22–23). How has God blessed you for believing in Him and following His prophets?\n\nPresident Russell M. Nelson said: “My experience is that once you stop putting question marks behind the prophet’s statements and put exclamation points instead, anddo it, the blessings just pour. I never ask myself, ‘When does the prophet speak as a prophet and when does he not?’ My interest has been, ‘How can I be more like him?’” (in Lane Johnson, “Russell M. Nelson: A Study in Obedience,”Ensign, Aug. 1982, 24).\n\nSee alsoDoctrine and Covenants 21:4–6; “A Secure Anchor” (video), Gospel Library; “Make inspired choices,”For the Strength of Youth: A Guide for Making Choices(2022), 4–5.\n\nA Secure Anchor\n\nIdentify simple statements of truth.Elder Neal A. Maxwell taught: “The scriptures offer us so many doctrinal diamonds. And when the light of the Spirit plays upon their several facets, they sparkle with celestial sense and illuminate the path we are to follow” (“According to the Desire of [Our] Hearts,”Ensign, Nov. 1996, 21). As you study the scriptures, consider taking time to identify, mark, and ponder short yet powerful messages. Some examples can be found in2 Chronicles 14:11;15:7;18:13;20:15;26:5. What other “doctrinal diamonds” can you find?\n\n2 Chronicles 26:3–21"
      },
      {
        "title": "Pride leads to destruction.",
        "content": "As with many other kings of Judah, Uzziah’s reign began with great accomplishments but ended with tragedy. Look for this pattern in2 Chronicles 26. What would you say was the turning point in Uzziah’s life?\n\nAs you readverses 16–23, keep in mind that at this time, only priests were allowed to burn incense in the temple. Why do you think King Uzziah disobeyed God? What do you learn from this tragic experience?\n\nSee also “Be Thou Humble,”Hymns, no. 130.\n\n2 Chronicles 30"
      },
      {
        "title": "I can be a peacemaker.",
        "content": "In2 Chronicles 30, Hezekiah was the king of Judah. He invited the rival Kingdom of Israel to gather in Jerusalem to celebrate Passover—something the Israelites hadn’t been able to do for many years (seeverses 1–12). What impresses you about the invitation and how it was received—both by the Israelite guests and by their hosts in Judah?\n\nBecause it had been so long, some visitors to Jerusalem were not familiar with the details of how to participate in Passover. As you read2 Chronicles 30:18–27, what do you learn from Hezekiah’s response and the results of his response?\n\nSee also Russell M. Nelson, “Peacemakers Needed,”Liahona, May 2023, 98–101.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "I can trust God.",
        "content": "To introduce the idea of trusting the Lord, you might show your children something you trust to keep you dry when it rains, like an umbrella or jacket. Let them talk about why we can trust these things. Then help them compare that to our trust in the Lord. Why do we trust Him to keep us safe spiritually?\n\nYou could help your children discover how King Asa and King Jehoshaphat responded to challenges by trusting in the Lord (see2 Chronicles 14:11;20:3–5, 12). Share with each other ways you can show the Lord that you trust Him.\n\n2 Chronicles 20:1–29"
      },
      {
        "title": "God will hear and answer my prayers.",
        "content": "This week’s activity page can help your children understand the story of Jehoshaphat’s prayer and the Lord’s answer. You and your children could share times when God heard and answered your prayers. Consider including times when the answers came in ways or at times that you didn’t expect. A song about prayer, such as “I Pray in Faith” (Children’s Songbook, 14), could help build your children’s faith.\n\n2 Chronicles 26:3–23"
      },
      {
        "title": "I can be humble.",
        "content": "To learn about the dangers of pride, your children could build a tower with blocks or small cups. As they place each block or cup on the tower, help them identify one of Uzziah’s accomplishments from2 Chronicles 26:3–15. After they finish the tower, discuss with your children how Uzziah could keep it tall and strong. What could make it fall? Then, as you readverse 16, you could talk about what it means to have our hearts “lifted up to [our] destruction.” Share with your children what happened to Uzziah inverses 16–23. Let them knock down their tower. Talk about what we can do to stay humble.\n\nKing Hezekiah and the People Thank God, © Lifeway Collection/licensed from goodsalt.com\n\n2 Chronicles 30"
      },
      {
        "title": "I can be a peacemaker.",
        "content": "The picture above shows when Hezekiah invited Judah’s neighbors from the Kingdom of Israel to celebrate Passover with them. You could look at this image with your children and read2 Chronicles 30:18–19, which explains that some of the guests had not washed themselves according to the law of Moses. What did Hezekiah do? How would this have made the guests feel? Help your children think of how they can be like Hezekiah in the way they treat others.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nUzziah’s Pride and Punishment, by A. M. Boon"
      }
    ],
    "study_helps": [],
    "raw_text": "July 20–26. “Our Eyes Are upon Thee”: 2 Chronicles 14–20; 26; 30\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nJune 29–July 5\n1 Kings 12–13; 17–22\nJuly 6–12\n2 Kings 2–7\nThoughts to Keep in Mind\nJesus Will Say to All Israel, “Come Home”\nJuly 13–19\n2 Kings 16–25\nJuly 20–26\n2 Chronicles 14–20; 26; 30\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nJuly 20–26. “Our Eyes Are upon Thee”: 2 Chronicles 14–20; 26; 30\n“July 20–26. ‘Our Eyes Are upon Thee’: 2 Chronicles 14–20; 26; 30,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“July 20–26. ‘Our Eyes Are upon Thee,’”\nCome, Follow Me: 2026\nKing Jehoshaphat’s Prayer\n, by Keeley Rae\nJuly 20–26: “Our Eyes Are upon Thee”\n2 Chronicles 14–20\n;\n26\n;\n30\nThe Kingdom of Judah was surrounded. Armies from three powerful enemy nations were all advancing at once, prepared for battle. In this desperate moment of need, Jehoshaphat, King of Judah, turned to the King of heaven and earth. Jehoshaphat gathered his people at the temple and prayed. He acknowledged their human weakness and pleaded for deliverance. In response, the Lord promised His protection: “Fear not, nor be dismayed” (\n2 Chronicles 20:17\n).\nWe might not have an invading army at our doorstep threatening to destroy us, but sometimes we do feel surrounded by adversity and evil. Our path to deliverance is the same one Jehoshaphat sought, and our prayer can be like his too: “O our God, … we have no might against this great company that cometh against us; neither know we what to do: but our eyes are upon thee” (\n2 Chronicles 20:12\n).\nIn\n2 Chronicles 14–30\n, you will read about Jehoshaphat and other kings in Judah. Consider how their faith-driven reforms, victories, and challenges can apply to your own life.\nFor an overview of the book of 2 Chronicles, see “\nChronicles\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n2 Chronicles 14–16\nTrusting in God will bring me peace.\nWhen Asa was the king of Judah, he faced many challenges—just like we all do today. As you read about the trials he faced, notice where he put his trust and how that changed over time.\nReference\nChallenges Asa faced\nWhere Asa put his trust\nReference\n2 Chronicles 14:9–12\nReference\n2 Chronicles 15:1–8\nReference\n2 Chronicles 16:1–10\nWhy do we sometimes stop trusting the Lord? What else do you learn from Asa’s life?\nSee also Elder D. Todd Christofferson, “\nOur Relationship with God\n,”\nLiahona\n, May 2022, 78–80.\n2 Chronicles 18\nI can defend the truth, even when it’s unpopular.\nThe prophet Micaiah must have felt a lot of pressure to predict success for the kings Jehoshaphat and Ahab in their war against Syria. Look for evidence of that pressure in\n2 Chronicles 18:1–12\n. What evidence do you find of Micaiah’s courage and integrity in\nverses 13–27\n? (Note that in\nverse 14\n, Micaiah gives a sarcastic response; his real answer is in\nverse 16\n.) How are Micaiah’s words fulfilled in\nverses 28–34\n?\nWhat are some situations in which you might face pressure like Micaiah faced? What gives you courage to stand up for the Lord and His teachings?\nIn the days of King Jehoshaphat, three nations attacked Jerusalem.\n2 Chronicles 20:1–25\nIn difficult times, I can turn to God and His prophets.\nAs you read\n2 Chronicles 20:1–12\n, look for what King Jehoshaphat did when multiple nations came to attack Judah. How could you apply his actions in the challenging circumstances you face?\nThe Lord’s response to Jehoshaphat’s prayer is found in\nverses 14–17\n. What phrases do you find there that could comfort you or someone you know during difficult times?\nThe following day, the people of Jerusalem went out to meet the opposing army. As you read\n2 Chronicles 20:20\n, look for the message Jehoshaphat gave to the people of Jerusalem. How were his words fulfilled? (see\nverses 22–23\n). How has God blessed you for believing in Him and following His prophets?\nPresident Russell M. Nelson said: “My experience is that once you stop putting question marks behind the prophet’s statements and put exclamation points instead, and\ndo it\n, the blessings just pour. I never ask myself, ‘When does the prophet speak as a prophet and when does he not?’ My interest has been, ‘How can I be more like him?’” (in Lane Johnson, “\nRussell M. Nelson: A Study in Obedience\n,”\nEnsign\n, Aug. 1982, 24).\nSee also\nDoctrine and Covenants 21:4–6\n; “A Secure Anchor” (video), Gospel Library; “\nMake inspired choices\n,”\nFor the Strength of Youth: A Guide for Making Choices\n(2022), 4–5.\n3:37\nA Secure Anchor\nIdentify simple statements of truth.\nElder Neal A. Maxwell taught: “The scriptures offer us so many doctrinal diamonds. And when the light of the Spirit plays upon their several facets, they sparkle with celestial sense and illuminate the path we are to follow” (“\nAccording to the Desire of [Our] Hearts\n,”\nEnsign\n, Nov. 1996, 21). As you study the scriptures, consider taking time to identify, mark, and ponder short yet powerful messages. Some examples can be found in\n2 Chronicles 14:11\n;\n15:7\n;\n18:13\n;\n20:15\n;\n26:5\n. What other “doctrinal diamonds” can you find?\n2 Chronicles 26:3–21\nPride leads to destruction.\nAs with many other kings of Judah, Uzziah’s reign began with great accomplishments but ended with tragedy. Look for this pattern in\n2 Chronicles 26\n. What would you say was the turning point in Uzziah’s life?\nAs you read\nverses 16–23\n, keep in mind that at this time, only priests were allowed to burn incense in the temple. Why do you think King Uzziah disobeyed God? What do you learn from this tragic experience?\nSee also “\nBe Thou Humble\n,”\nHymns\n, no. 130.\n2 Chronicles 30\nI can be a peacemaker.\nIn\n2 Chronicles 30\n, Hezekiah was the king of Judah. He invited the rival Kingdom of Israel to gather in Jerusalem to celebrate Passover—something the Israelites hadn’t been able to do for many years (see\nverses 1–12\n). What impresses you about the invitation and how it was received—both by the Israelite guests and by their hosts in Judah?\nBecause it had been so long, some visitors to Jerusalem were not familiar with the details of how to participate in Passover. As you read\n2 Chronicles 30:18–27\n, what do you learn from Hezekiah’s response and the results of his response?\nSee also Russell M. Nelson, “\nPeacemakers Needed\n,”\nLiahona\n, May 2023, 98–101.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n2 Chronicles 14–16\n;\n20\nI can trust God.\nTo introduce the idea of trusting the Lord, you might show your children something you trust to keep you dry when it rains, like an umbrella or jacket. Let them talk about why we can trust these things. Then help them compare that to our trust in the Lord. Why do we trust Him to keep us safe spiritually?\nYou could help your children discover how King Asa and King Jehoshaphat responded to challenges by trusting in the Lord (see\n2 Chronicles 14:11\n;\n20:3–5, 12\n). Share with each other ways you can show the Lord that you trust Him.\n2 Chronicles 20:1–29\nGod will hear and answer my prayers.\nThis week’s activity page can help your children understand the story of Jehoshaphat’s prayer and the Lord’s answer. You and your children could share times when God heard and answered your prayers. Consider including times when the answers came in ways or at times that you didn’t expect. A song about prayer, such as “\nI Pray in Faith\n” (\nChildren’s Songbook\n, 14), could help build your children’s faith.\n2 Chronicles 26:3–23\nI can be humble.\nTo learn about the dangers of pride, your children could build a tower with blocks or small cups. As they place each block or cup on the tower, help them identify one of Uzziah’s accomplishments from\n2 Chronicles 26:3–15\n. After they finish the tower, discuss with your children how Uzziah could keep it tall and strong. What could make it fall? Then, as you read\nverse 16\n, you could talk about what it means to have our hearts “lifted up to [our] destruction.” Share with your children what happened to Uzziah in\nverses 16–23\n. Let them knock down their tower. Talk about what we can do to stay humble.\nKing Hezekiah and the People Thank God\n, © Lifeway Collection/licensed from goodsalt.com\n2 Chronicles 30\nI can be a peacemaker.\nThe picture above shows when Hezekiah invited Judah’s neighbors from the Kingdom of Israel to celebrate Passover with them. You could look at this image with your children and read\n2 Chronicles 30:18–19\n, which explains that some of the guests had not washed themselves according to the law of Moses. What did Hezekiah do? How would this have made the guests feel? Help your children think of how they can be like Hezekiah in the way they treat others.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nUzziah’s Pride and Punishment\n, by A. M. Boon\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "2 Chronicles 14",
      "title": "2 Chronicles 14",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/14?lang=eng",
      "summary": "Asa reigns in Judah, rebuilds the cities, and defeats and plunders the Ethiopians, who attack Judah.",
      "verses": [
        "1So Abijah slept with his fathers, and they buried him in the city of David: and Asa his son reigned in his stead. In his days the land was quiet ten years.",
        "2AndAsadidthat which wasgood and right in the eyes of theLordhis God:",
        "3For he took away the altars of the strangegods,and the high places, and brake down the images, and cut down thegroves:",
        "4And commanded Judah to seek theLordGod of their fathers, and to do the law and the commandment.",
        "5Also he took away out of all the cities of Judah the high places and the images: and the kingdom was quiet before him.",
        "6Â¶And he built fenced cities in Judah: for the land had rest, and he had no war in those years; because theLordhad given him rest.",
        "7Therefore he said unto Judah, Let us build these cities, and make aboutthemwalls, and towers, gates, and bars,whilethe landisyet before us; because we have sought theLordour God, we have soughthim,and he hath given us rest on every side. So they built and prospered.",
        "8And Asa had an armyof menthat baretargetsand spears, out of Judah three hundred thousand; and out of Benjamin, that bare shields and drew bows, two hundred and fourscore thousand: all theseweremighty men of valour.",
        "9Â¶And there came out against them Zerah the Ethiopian with an host of a thousand thousand, and three hundred chariots; and came unto Mareshah.",
        "10Then Asa went out against him, and they set the battle in array in the valley of Zephathah at Mareshah.",
        "11And Asa cried unto theLordhis God, and said,Lord,it isnothing with thee to help, whether with many, or with them that have no power: help us, OLordour God; for we rest on thee, and in thy name we go against this multitude. OLord, thouartour God; let not man prevail against thee.",
        "12So theLordsmote the Ethiopians before Asa, and before Judah; and the Ethiopians fled.",
        "13And Asa and the people thatwerewith him pursued them unto Gerar: and the Ethiopians were overthrown, that they could not recover themselves; for they were destroyed before theLord, and before his host; and they carried away very much spoil.",
        "14And they smote all the cities round about Gerar; for the fear of theLordcame upon them: and they spoiled all the cities; for there was exceeding much spoil in them.",
        "15They smote also the tents of cattle, and carried away sheep and camels in abundance, and returned to Jerusalem."
      ],
      "full_text": "1So Abijah slept with his fathers, and they buried him in the city of David: and Asa his son reigned in his stead. In his days the land was quiet ten years. 2AndAsadidthat which wasgood and right in the eyes of theLordhis God: 3For he took away the altars of the strangegods,and the high places, and brake down the images, and cut down thegroves: 4And commanded Judah to seek theLordGod of their fathers, and to do the law and the commandment. 5Also he took away out of all the cities of Judah the high places and the images: and the kingdom was quiet before him. 6Â¶And he built fenced cities in Judah: for the land had rest, and he had no war in those years; because theLordhad given him rest. 7Therefore he said unto Judah, Let us build these cities, and make aboutthemwalls, and towers, gates, and bars,whilethe landisyet before us; because we have sought theLordour God, we have soughthim,and he hath given us rest on every side. So they built and prospered. 8And Asa had an armyof menthat baretargetsand spears, out of Judah three hundred thousand; and out of Benjamin, that bare shields and drew bows, two hundred and fourscore thousand: all theseweremighty men of valour. 9Â¶And there came out against them Zerah the Ethiopian with an host of a thousand thousand, and three hundred chariots; and came unto Mareshah. 10Then Asa went out against him, and they set the battle in array in the valley of Zephathah at Mareshah. 11And Asa cried unto theLordhis God, and said,Lord,it isnothing with thee to help, whether with many, or with them that have no power: help us, OLordour God; for we rest on thee, and in thy name we go against this multitude. OLord, thouartour God; let not man prevail against thee. 12So theLordsmote the Ethiopians before Asa, and before Judah; and the Ethiopians fled. 13And Asa and the people thatwerewith him pursued them unto Gerar: and the Ethiopians were overthrown, that they could not recover themselves; for they were destroyed before theLord, and before his host; and they carried away very much spoil. 14And they smote all the cities round about Gerar; for the fear of theLordcame upon them: and they spoiled all the cities; for there was exceeding much spoil in them. 15They smote also the tents of cattle, and carried away sheep and camels in abundance, and returned to Jerusalem."
    },
    {
      "reference": "2 Chronicles 15",
      "title": "2 Chronicles 15",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/15?lang=eng",
      "summary": "Azariah prophesies that Judah will prosper if the people keep the commandmentsâAsa does away with false worship in JudahâMany from Ephraim, Manasseh, and Simeon migrate to JudahâThe people covenant to serve the Lord and are blessed.",
      "verses": [
        "1And the Spirit of God came upon Azariah the son of Oded:",
        "2And he went out to meet Asa, and said unto him, Hear ye me, Asa, and all Judah and Benjamin; TheLordiswith you, while ye be with him; and if ye seek him, he will be found of you; but if ye forsake him, he will forsake you.",
        "3Now for a long season Israelhath beenwithout the true God, and without ateachingpriest, and without law.",
        "4But when they in theirtroubledid turn unto theLordGod of Israel, andsoughthim, he was found of them.",
        "5And in those timesthere wasno peace to him that went out, nor to him that came in, but great vexationswereupon all the inhabitants of the countries.",
        "6And nation was destroyed of nation, and city of city: for God did vex them with all adversity.",
        "7Be ye strong therefore, and let not your hands be weak: for yourworkshall be rewarded.",
        "8And when Asa heard these words, and the prophecy of Oded the prophet, he took courage, and put away the abominable idols out of all the land of Judah and Benjamin, and out of the cities which he had taken from mount Ephraim, and renewed the altar of theLord, thatwasbefore the porch of theLord.",
        "9And he gathered all Judah and Benjamin, and thestrangerswith them out of Ephraim and Manasseh, and out of Simeon: for they fell to him out of Israel in abundance, when they saw that theLordhis Godwaswith him.",
        "10So they gathered themselves together at Jerusalem in the third month, in the fifteenth year of the reign of Asa.",
        "11And they offered unto theLordthe same time, of the spoilwhichthey had brought, seven hundred oxen and seven thousand sheep.",
        "12And they entered into acovenantto seek theLordGod of their fathers with all their heart and with all their soul;",
        "13That whosoever would not seek theLordGod of Israel should be put to death, whether small or great, whether man or woman.",
        "14And they sware unto theLordwith a loud voice, and with shouting, and with trumpets, and withcornets.",
        "15And all Judah rejoiced at the oath: for they had sworn with all their heart, and sought him with their whole desire; and he wasfoundof them: and theLordgave them rest round about.",
        "16Â¶And alsoconcerningMaachah themotherof Asa the king, he removed her frombeingqueen, because she had made an idol in a grove: and Asa cut down her idol, and stampedit,and burntitat the brook Kidron.",
        "17But the high places were not taken away out of Israel: nevertheless the heart of Asa was perfect all his days.",
        "18Â¶And he brought into the house of God the things that his father had dedicated, and that he himself had dedicated, silver, and gold, and vessels.",
        "19And there was nomorewar unto the five and thirtieth year of the reign of Asa."
      ],
      "full_text": "1And the Spirit of God came upon Azariah the son of Oded: 2And he went out to meet Asa, and said unto him, Hear ye me, Asa, and all Judah and Benjamin; TheLordiswith you, while ye be with him; and if ye seek him, he will be found of you; but if ye forsake him, he will forsake you. 3Now for a long season Israelhath beenwithout the true God, and without ateachingpriest, and without law. 4But when they in theirtroubledid turn unto theLordGod of Israel, andsoughthim, he was found of them. 5And in those timesthere wasno peace to him that went out, nor to him that came in, but great vexationswereupon all the inhabitants of the countries. 6And nation was destroyed of nation, and city of city: for God did vex them with all adversity. 7Be ye strong therefore, and let not your hands be weak: for yourworkshall be rewarded. 8And when Asa heard these words, and the prophecy of Oded the prophet, he took courage, and put away the abominable idols out of all the land of Judah and Benjamin, and out of the cities which he had taken from mount Ephraim, and renewed the altar of theLord, thatwasbefore the porch of theLord. 9And he gathered all Judah and Benjamin, and thestrangerswith them out of Ephraim and Manasseh, and out of Simeon: for they fell to him out of Israel in abundance, when they saw that theLordhis Godwaswith him. 10So they gathered themselves together at Jerusalem in the third month, in the fifteenth year of the reign of Asa. 11And they offered unto theLordthe same time, of the spoilwhichthey had brought, seven hundred oxen and seven thousand sheep. 12And they entered into acovenantto seek theLordGod of their fathers with all their heart and with all their soul; 13That whosoever would not seek theLordGod of Israel should be put to death, whether small or great, whether man or woman. 14And they sware unto theLordwith a loud voice, and with shouting, and with trumpets, and withcornets. 15And all Judah rejoiced at the oath: for they had sworn with all their heart, and sought him with their whole desire; and he wasfoundof them: and theLordgave them rest round about. 16Â¶And alsoconcerningMaachah themotherof Asa the king, he removed her frombeingqueen, because she had made an idol in a grove: and Asa cut down her idol, and stampedit,and burntitat the brook Kidron. 17But the high places were not taken away out of Israel: nevertheless the heart of Asa was perfect all his days. 18Â¶And he brought into the house of God the things that his father had dedicated, and that he himself had dedicated, silver, and gold, and vessels. 19And there was nomorewar unto the five and thirtieth year of the reign of Asa."
    },
    {
      "reference": "2 Chronicles 16",
      "title": "2 Chronicles 16",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/16?lang=eng",
      "summary": "Asa employs Syria to defeat IsraelâHanani the seer reproves Asa for lack of faithâAsa suffers from disease and dies.",
      "verses": [
        "1In the six and thirtieth year of the reign of Asa Baasha king of Israel came up against Judah, and built Ramah, to the intent that he might let none go out or come in to Asa king of Judah.",
        "2Then Asa brought out silver and gold out of the treasures of the house of theLordand of the kingâs house, and sent to Ben-hadad king of Syria, that dwelt at Damascus, saying,",
        "3There isa league between me and thee, asthere wasbetween my father and thy father: behold, I have sent thee silver and gold; go, break thy league with Baasha king of Israel, that he may depart from me.",
        "4And Ben-hadad hearkened unto king Asa, and sent the captains of his armies against the cities of Israel; and they smote Ijon, andDan, and Abel-maim, and all the store cities of Naphtali.",
        "5And it came to pass, when Baasha heardit,that he left off building of Ramah, and let his work cease.",
        "6Then Asa the king took all Judah; and they carried away the stones of Ramah, and the timber thereof, wherewith Baasha was building; and he built therewith Geba and Mizpah.",
        "7Â¶And at that time Hanani theseercame to Asa king of Judah, and said unto him, Because thou hast relied on thekingof Syria, and notreliedon theLordthy God, therefore is the host of the king ofSyriaescaped out of thine hand.",
        "8Were not the Ethiopians and the Lubims a huge host, with very many chariots and horsemen? yet, because thou didst rely on theLord, he delivered them into thine hand.",
        "9For the eyes of theLordrun to and fro throughout the whole earth, to shew himself strong in the behalf ofthemwhose heartisperfect toward him. Herein thou hast done foolishly: therefore from henceforth thou shalt have wars.",
        "10Then Asa was wroth with the seer, and put him ina prison house; forhe wasin a rage with him because of thisthing.And Asa oppressedsomeof the people the same time.",
        "11Â¶And, behold, the acts of Asa, first and last, lo, theyarewritten in the book of the kings of Judah and Israel.",
        "12And Asa in the thirty and ninth year of his reign was diseased in his feet, until his diseasewasexceedinggreat:yet in his disease he sought not to theLord, but to the physicians.",
        "13Â¶And Asa slept with his fathers, and died in the one and fortieth year of his reign.",
        "14And they buried him in his own sepulchres, which he had made for himself in the city of David, and laid him in the bed which was filled with sweet odours and divers kindsof spicesprepared by the apothecariesâ art: and they made a very greatburningfor him."
      ],
      "full_text": "1In the six and thirtieth year of the reign of Asa Baasha king of Israel came up against Judah, and built Ramah, to the intent that he might let none go out or come in to Asa king of Judah. 2Then Asa brought out silver and gold out of the treasures of the house of theLordand of the kingâs house, and sent to Ben-hadad king of Syria, that dwelt at Damascus, saying, 3There isa league between me and thee, asthere wasbetween my father and thy father: behold, I have sent thee silver and gold; go, break thy league with Baasha king of Israel, that he may depart from me. 4And Ben-hadad hearkened unto king Asa, and sent the captains of his armies against the cities of Israel; and they smote Ijon, andDan, and Abel-maim, and all the store cities of Naphtali. 5And it came to pass, when Baasha heardit,that he left off building of Ramah, and let his work cease. 6Then Asa the king took all Judah; and they carried away the stones of Ramah, and the timber thereof, wherewith Baasha was building; and he built therewith Geba and Mizpah. 7Â¶And at that time Hanani theseercame to Asa king of Judah, and said unto him, Because thou hast relied on thekingof Syria, and notreliedon theLordthy God, therefore is the host of the king ofSyriaescaped out of thine hand. 8Were not the Ethiopians and the Lubims a huge host, with very many chariots and horsemen? yet, because thou didst rely on theLord, he delivered them into thine hand. 9For the eyes of theLordrun to and fro throughout the whole earth, to shew himself strong in the behalf ofthemwhose heartisperfect toward him. Herein thou hast done foolishly: therefore from henceforth thou shalt have wars. 10Then Asa was wroth with the seer, and put him ina prison house; forhe wasin a rage with him because of thisthing.And Asa oppressedsomeof the people the same time. 11Â¶And, behold, the acts of Asa, first and last, lo, theyarewritten in the book of the kings of Judah and Israel. 12And Asa in the thirty and ninth year of his reign was diseased in his feet, until his diseasewasexceedinggreat:yet in his disease he sought not to theLord, but to the physicians. 13Â¶And Asa slept with his fathers, and died in the one and fortieth year of his reign. 14And they buried him in his own sepulchres, which he had made for himself in the city of David, and laid him in the bed which was filled with sweet odours and divers kindsof spicesprepared by the apothecariesâ art: and they made a very greatburningfor him."
    },
    {
      "reference": "2 Chronicles 17",
      "title": "2 Chronicles 17",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/17?lang=eng",
      "summary": "Jehoshaphat reigns well and prospers in JudahâPriests travel and teach out of the book of the law of the Lord.",
      "verses": [
        "1And Jehoshaphat his son reigned in his stead, and strengthened himself against Israel.",
        "2And he placed forces in all the fenced cities of Judah, and set garrisons in the land of Judah, and in the cities of Ephraim, which Asa his father had taken.",
        "3And theLordwas with Jehoshaphat, because he walked in the first ways of his father David, and sought not unto Baalim;",
        "4But sought to theLordGod of his father, and walked in his commandments, and not after the doings of Israel.",
        "5Therefore theLordstablished the kingdom in his hand; and all Judah brought to Jehoshaphat presents; and he had riches and honour in abundance.",
        "6And his heart was lifted up in the ways of theLord: moreover he took away the high places and groves out of Judah.",
        "7Â¶Also in the third year of his reign he sent to his princes,evento Ben-hail, and to Obadiah, and to Zechariah, and to Nethaneel, and to Michaiah, to teach in the cities of Judah.",
        "8And with themhe sentLevites,evenShemaiah, and Nethaniah, and Zebadiah, and Asahel, and Shemiramoth, and Jehonathan, and Adonijah, and Tobijah, and Tob-adonijah, Levites; and with them Elishama and Jehoram, priests.",
        "9And they taught in Judah, andhadthe book of the law of theLordwith them, and went about throughout all the cities of Judah, andtaughtthe people.",
        "10Â¶And the fear of theLordfell upon all the kingdoms of the lands thatwereround about Judah, so that they made no war against Jehoshaphat.",
        "11Alsosomeof the Philistines brought Jehoshaphat presents, and tribute silver; and the Arabians brought him flocks, seven thousand and seven hundred rams, and seven thousand and seven hundred he goats.",
        "12Â¶And Jehoshaphat waxed great exceedingly; and he built in Judahcastles, and cities of store.",
        "13And he had much business in the cities of Judah: and the men of war, mighty men of valour,werein Jerusalem.",
        "14And thesearethe numbers of them according to the house of their fathers: Of Judah, the captains of thousands; Adnah the chief, and with him mighty men of valour three hundred thousand.",
        "15And next to himwasJehohanan the captain, and with him two hundred and fourscore thousand.",
        "16And next himwasAmasiah the son of Zichri, who willingly offered himself unto theLord; and with him two hundred thousand mighty men of valour.",
        "17And of Benjamin; Eliada a mighty man of valour, and with him armed men with bow and shield two hundred thousand.",
        "18And next himwasJehozabad, and with him an hundred and fourscore thousand ready prepared for the war.",
        "19These waited on the king, besidethosewhom the king put in the fenced cities throughout all Judah."
      ],
      "full_text": "1And Jehoshaphat his son reigned in his stead, and strengthened himself against Israel. 2And he placed forces in all the fenced cities of Judah, and set garrisons in the land of Judah, and in the cities of Ephraim, which Asa his father had taken. 3And theLordwas with Jehoshaphat, because he walked in the first ways of his father David, and sought not unto Baalim; 4But sought to theLordGod of his father, and walked in his commandments, and not after the doings of Israel. 5Therefore theLordstablished the kingdom in his hand; and all Judah brought to Jehoshaphat presents; and he had riches and honour in abundance. 6And his heart was lifted up in the ways of theLord: moreover he took away the high places and groves out of Judah. 7Â¶Also in the third year of his reign he sent to his princes,evento Ben-hail, and to Obadiah, and to Zechariah, and to Nethaneel, and to Michaiah, to teach in the cities of Judah. 8And with themhe sentLevites,evenShemaiah, and Nethaniah, and Zebadiah, and Asahel, and Shemiramoth, and Jehonathan, and Adonijah, and Tobijah, and Tob-adonijah, Levites; and with them Elishama and Jehoram, priests. 9And they taught in Judah, andhadthe book of the law of theLordwith them, and went about throughout all the cities of Judah, andtaughtthe people. 10Â¶And the fear of theLordfell upon all the kingdoms of the lands thatwereround about Judah, so that they made no war against Jehoshaphat. 11Alsosomeof the Philistines brought Jehoshaphat presents, and tribute silver; and the Arabians brought him flocks, seven thousand and seven hundred rams, and seven thousand and seven hundred he goats. 12Â¶And Jehoshaphat waxed great exceedingly; and he built in Judahcastles, and cities of store. 13And he had much business in the cities of Judah: and the men of war, mighty men of valour,werein Jerusalem. 14And thesearethe numbers of them according to the house of their fathers: Of Judah, the captains of thousands; Adnah the chief, and with him mighty men of valour three hundred thousand. 15And next to himwasJehohanan the captain, and with him two hundred and fourscore thousand. 16And next himwasAmasiah the son of Zichri, who willingly offered himself unto theLord; and with him two hundred thousand mighty men of valour. 17And of Benjamin; Eliada a mighty man of valour, and with him armed men with bow and shield two hundred thousand. 18And next himwasJehozabad, and with him an hundred and fourscore thousand ready prepared for the war. 19These waited on the king, besidethosewhom the king put in the fenced cities throughout all Judah."
    },
    {
      "reference": "2 Chronicles 18",
      "title": "2 Chronicles 18",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/18?lang=eng",
      "summary": "Jehoshaphat of Judah joins Ahab of Israel to fight SyriaâAhabâs false prophets foretell victoryâMicaiah prophesies the fall and death of AhabâThe Syrians slay Ahab.",
      "verses": [
        "1Now Jehoshaphat had riches and honour in abundance, andjoined affinitywith Ahab.",
        "2And aftercertainyears he went down to Ahab to Samaria. And Ahab killed sheep and oxen for him in abundance, and for the people thathe hadwith him, and persuaded him to go upwith himto Ramoth-gilead.",
        "3And Ahab king of Israel said unto Jehoshaphat king of Judah, Wilt thou go with me to Ramoth-gilead? And he answered him, Iamas thouart,and my people as thy people; andwe will bewith thee in the war.",
        "4Â¶And Jehoshaphat said unto the king of Israel,Inquire, I pray thee, at the word of theLordto day.",
        "5Therefore the king of Israel gathered together of prophets four hundred men, and said unto them, Shall we go to Ramoth-gilead to battle, or shall I forbear? And they said, Go up; for God will deliveritinto the kingâs hand.",
        "6But Jehoshaphat said,Is therenot here a prophet of theLordbesides, that we might inquire of him?",
        "7And the king of Israel said unto Jehoshaphat,There isyet one man, by whom we mayinquireof theLord: but I hate him; for he never prophesied good unto me, but always evil: the sameisMicaiah the son of Imla. And Jehoshaphat said, Let not the king say so.",
        "8And the king of Israel called for oneof hisofficers, and said, Fetch quickly Micaiah the son of Imla.",
        "9And the king of Israel and Jehoshaphat king of Judah sat either of them on his throne, clothed intheirrobes, and they sat in a void place at the entering in of the gate of Samaria; and all the prophets prophesied before them.",
        "10And Zedekiah the son of Chenaanah had made himhorns of iron, and said, Thus saith theLord, With these thou shalt push Syria until they be consumed.",
        "11And all the prophets prophesiedso, saying, Go up to Ramoth-gilead, and prosper: for theLordshall deliveritinto the hand of the king.",
        "12And the messenger that went to call Micaiah spake to him, saying, Behold, the words of the prophetsdeclaregood to the king with one assent; let thy word therefore, I pray thee, be like one of theirs, and speak thou good.",
        "13And Micaiah said,AstheLordliveth, even what my God saith, that will I speak.",
        "14And when he was come to the king, the king said unto him, Micaiah, shall we go to Ramoth-gilead to battle, or shall I forbear? And he said, Go ye up, and prosper, and they shall be delivered into your hand.",
        "15And the king said to him, How many times shall I adjure thee that thou say nothing but the truth to me in the name of theLord?",
        "16Then he said, I did see all Israel scattered upon the mountains, as sheep that have no shepherd: and theLordsaid, These have no master; let them returnthereforeevery man to his house in peace.",
        "17And the king of Israel said to Jehoshaphat, Did I not tell theethathe would not prophesy good unto me, but evil?",
        "18Again he said, Therefore hear the word of theLord; I saw theLordsitting upon his throne, and all the host of heaven standing on his right hand andonhis left.",
        "19And theLordsaid, Who shall entice Ahab king of Israel, that he may go up and fall at Ramoth-gilead? And one spake saying after this manner, and another saying after that manner.",
        "20Then there came out aspirit, and stood before theLord, and said, I will entice him. And theLordsaid unto him, Wherewith?",
        "21And he said, I will go out, and be a lying spirit in the mouth of all his prophets. AndtheLordsaid, Thou shalt enticehim,and thou shalt also prevail: go out, and doevenso.",
        "22Now therefore, behold, theLordhathputa lying spirit in the mouth of these thy prophets, and theLordhath spoken evil against thee.",
        "23Then Zedekiah the son of Chenaanah came near, and smote Micaiah upon the cheek, and said, Which way went the Spirit of theLordfrom me to speak unto thee?",
        "24And Micaiah said, Behold, thou shalt see on that day when thou shalt go into an inner chamber to hide thyself.",
        "25Then the king of Israel said, Take ye Micaiah, and carry him back to Amon the governor of the city, and to Joash the kingâs son;",
        "26And say, Thus saith the king, Put thisfellowin the prison, and feed him with bread of affliction and with water of affliction, until I return in peace.",
        "27And Micaiah said, If thou certainly return in peace,thenhath not theLordspoken by me. And he said, Hearken, all ye people.",
        "28So the king of Israel and Jehoshaphat the king of Judah went up to Ramoth-gilead.",
        "29And the king of Israel said unto Jehoshaphat, I will disguise myself, and will go to the battle; but put thou on thy robes. So the king of Israel disguised himself; and they went to the battle.",
        "30Now the king of Syria had commanded the captains of the chariots thatwerewith him, saying, Fight ye not with small or great, save only with the king of Israel.",
        "31And it came to pass, when the captains of the chariots saw Jehoshaphat, that they said, Itisthe king of Israel. Therefore they compassed about him to fight: but Jehoshaphat cried out, and theLordhelped him; and God moved themto departfrom him.",
        "32For it came to pass, that, when the captains of the chariotsperceived that it was not the king of Israel, they turned back again from pursuing him.",
        "33And acertainman drew a bow at a venture, and smote the king of Israel between the joints of the harness: therefore he said to his chariot man, Turn thine hand, that thou mayest carry me out of the host; for I am wounded.",
        "34And the battle increased that day: howbeit the king of Israel stayedhimselfup inhischariot against the Syrians until the even: and about the time of the sun going down he died."
      ],
      "full_text": "1Now Jehoshaphat had riches and honour in abundance, andjoined affinitywith Ahab. 2And aftercertainyears he went down to Ahab to Samaria. And Ahab killed sheep and oxen for him in abundance, and for the people thathe hadwith him, and persuaded him to go upwith himto Ramoth-gilead. 3And Ahab king of Israel said unto Jehoshaphat king of Judah, Wilt thou go with me to Ramoth-gilead? And he answered him, Iamas thouart,and my people as thy people; andwe will bewith thee in the war. 4Â¶And Jehoshaphat said unto the king of Israel,Inquire, I pray thee, at the word of theLordto day. 5Therefore the king of Israel gathered together of prophets four hundred men, and said unto them, Shall we go to Ramoth-gilead to battle, or shall I forbear? And they said, Go up; for God will deliveritinto the kingâs hand. 6But Jehoshaphat said,Is therenot here a prophet of theLordbesides, that we might inquire of him? 7And the king of Israel said unto Jehoshaphat,There isyet one man, by whom we mayinquireof theLord: but I hate him; for he never prophesied good unto me, but always evil: the sameisMicaiah the son of Imla. And Jehoshaphat said, Let not the king say so. 8And the king of Israel called for oneof hisofficers, and said, Fetch quickly Micaiah the son of Imla. 9And the king of Israel and Jehoshaphat king of Judah sat either of them on his throne, clothed intheirrobes, and they sat in a void place at the entering in of the gate of Samaria; and all the prophets prophesied before them. 10And Zedekiah the son of Chenaanah had made himhorns of iron, and said, Thus saith theLord, With these thou shalt push Syria until they be consumed. 11And all the prophets prophesiedso, saying, Go up to Ramoth-gilead, and prosper: for theLordshall deliveritinto the hand of the king. 12And the messenger that went to call Micaiah spake to him, saying, Behold, the words of the prophetsdeclaregood to the king with one assent; let thy word therefore, I pray thee, be like one of theirs, and speak thou good. 13And Micaiah said,AstheLordliveth, even what my God saith, that will I speak. 14And when he was come to the king, the king said unto him, Micaiah, shall we go to Ramoth-gilead to battle, or shall I forbear? And he said, Go ye up, and prosper, and they shall be delivered into your hand. 15And the king said to him, How many times shall I adjure thee that thou say nothing but the truth to me in the name of theLord? 16Then he said, I did see all Israel scattered upon the mountains, as sheep that have no shepherd: and theLordsaid, These have no master; let them returnthereforeevery man to his house in peace. 17And the king of Israel said to Jehoshaphat, Did I not tell theethathe would not prophesy good unto me, but evil? 18Again he said, Therefore hear the word of theLord; I saw theLordsitting upon his throne, and all the host of heaven standing on his right hand andonhis left. 19And theLordsaid, Who shall entice Ahab king of Israel, that he may go up and fall at Ramoth-gilead? And one spake saying after this manner, and another saying after that manner. 20Then there came out aspirit, and stood before theLord, and said, I will entice him. And theLordsaid unto him, Wherewith? 21And he said, I will go out, and be a lying spirit in the mouth of all his prophets. AndtheLordsaid, Thou shalt enticehim,and thou shalt also prevail: go out, and doevenso. 22Now therefore, behold, theLordhathputa lying spirit in the mouth of these thy prophets, and theLordhath spoken evil against thee. 23Then Zedekiah the son of Chenaanah came near, and smote Micaiah upon the cheek, and said, Which way went the Spirit of theLordfrom me to speak unto thee? 24And Micaiah said, Behold, thou shalt see on that day when thou shalt go into an inner chamber to hide thyself. 25Then the king of Israel said, Take ye Micaiah, and carry him back to Amon the governor of the city, and to Joash the kingâs son; 26And say, Thus saith the king, Put thisfellowin the prison, and feed him with bread of affliction and with water of affliction, until I return in peace. 27And Micaiah said, If thou certainly return in peace,thenhath not theLordspoken by me. And he said, Hearken, all ye people. 28So the king of Israel and Jehoshaphat the king of Judah went up to Ramoth-gilead. 29And the king of Israel said unto Jehoshaphat, I will disguise myself, and will go to the battle; but put thou on thy robes. So the king of Israel disguised himself; and they went to the battle. 30Now the king of Syria had commanded the captains of the chariots thatwerewith him, saying, Fight ye not with small or great, save only with the king of Israel. 31And it came to pass, when the captains of the chariots saw Jehoshaphat, that they said, Itisthe king of Israel. Therefore they compassed about him to fight: but Jehoshaphat cried out, and theLordhelped him; and God moved themto departfrom him. 32For it came to pass, that, when the captains of the chariotsperceived that it was not the king of Israel, they turned back again from pursuing him. 33And acertainman drew a bow at a venture, and smote the king of Israel between the joints of the harness: therefore he said to his chariot man, Turn thine hand, that thou mayest carry me out of the host; for I am wounded. 34And the battle increased that day: howbeit the king of Israel stayedhimselfup inhischariot against the Syrians until the even: and about the time of the sun going down he died."
    },
    {
      "reference": "2 Chronicles 19",
      "title": "2 Chronicles 19",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/19?lang=eng",
      "summary": "Jehoshaphat is rebuked for helping ungodly AhabâHe helps the people return to the Lord, sets up judges, and administers justice.",
      "verses": [
        "1And Jehoshaphat the king of Judah returned to his house in peace to Jerusalem.",
        "2And Jehu the son of Hanani theseerwent out to meet him, and said to king Jehoshaphat, Shouldest thou help the ungodly, and love them that hate theLord? thereforeiswrath upon thee from before theLord.",
        "3Nevertheless there are good things found in thee, in that thou hast taken away the groves out of the land, and hast prepared thine heart to seek God.",
        "4And Jehoshaphat dwelt at Jerusalem: and he went outagainthrough the people from Beer-sheba to mount Ephraim, and brought them back unto theLordGod of their fathers.",
        "5Â¶And he setjudgesin the land throughout all the fenced cities of Judah, city by city,",
        "6And said to the judges, Take heed what ye do: for ye judge not for man, but for theLord, whoiswith you in thejudgment.",
        "7Wherefore now let the fear of theLordbe upon you; take heed and doit:forthere isno iniquity with theLordour God, norrespectof persons, nor taking ofgifts.",
        "8Â¶Moreover in Jerusalem did Jehoshaphat set of the Levites, andofthe priests, and of the chief of the fathers of Israel, for the judgment of theLord, and for controversies, when they returned to Jerusalem.",
        "9And he charged them, saying, Thus shall ye do in thefearof theLord, faithfully, and with a perfect heart.",
        "10And whatcausesoever shall come to you of your brethren that dwell in their cities, between blood and blood, between law and commandment, statutes and judgments, ye shall evenwarnthem that they trespass not against theLord, andsowrath come upon you, and upon your brethren: this do, and ye shall not trespass.",
        "11And, behold, Amariah the chiefpriestisover you in all matters of theLord; and Zebadiah the son of Ishmael, the ruler of the house of Judah, for all the kingâs matters: also the Levitesshall beofficers before you. Dealcourageously, and theLordshall be with the good."
      ],
      "full_text": "1And Jehoshaphat the king of Judah returned to his house in peace to Jerusalem. 2And Jehu the son of Hanani theseerwent out to meet him, and said to king Jehoshaphat, Shouldest thou help the ungodly, and love them that hate theLord? thereforeiswrath upon thee from before theLord. 3Nevertheless there are good things found in thee, in that thou hast taken away the groves out of the land, and hast prepared thine heart to seek God. 4And Jehoshaphat dwelt at Jerusalem: and he went outagainthrough the people from Beer-sheba to mount Ephraim, and brought them back unto theLordGod of their fathers. 5Â¶And he setjudgesin the land throughout all the fenced cities of Judah, city by city, 6And said to the judges, Take heed what ye do: for ye judge not for man, but for theLord, whoiswith you in thejudgment. 7Wherefore now let the fear of theLordbe upon you; take heed and doit:forthere isno iniquity with theLordour God, norrespectof persons, nor taking ofgifts. 8Â¶Moreover in Jerusalem did Jehoshaphat set of the Levites, andofthe priests, and of the chief of the fathers of Israel, for the judgment of theLord, and for controversies, when they returned to Jerusalem. 9And he charged them, saying, Thus shall ye do in thefearof theLord, faithfully, and with a perfect heart. 10And whatcausesoever shall come to you of your brethren that dwell in their cities, between blood and blood, between law and commandment, statutes and judgments, ye shall evenwarnthem that they trespass not against theLord, andsowrath come upon you, and upon your brethren: this do, and ye shall not trespass. 11And, behold, Amariah the chiefpriestisover you in all matters of theLord; and Zebadiah the son of Ishmael, the ruler of the house of Judah, for all the kingâs matters: also the Levitesshall beofficers before you. Dealcourageously, and theLordshall be with the good."
    },
    {
      "reference": "2 Chronicles 20",
      "title": "2 Chronicles 20",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/20?lang=eng",
      "summary": "The Ammonites and others attack JudahâJehoshaphat and all the people fast and prayâJahaziel prophesies the deliverance of JudahâJudahâs attackers war among and destroy themselves.",
      "verses": [
        "1It came to pass after this also,thatthe children of Moab, and the children of Ammon, and with themotherbeside the Ammonites, came against Jehoshaphat to battle.",
        "2Then there came some that told Jehoshaphat, saying, There cometh a great multitude against thee from beyond the sea on this side Syria;and, behold, theybein Hazazon-tamar, whichisEn-gedi.",
        "3And Jehoshaphat feared, and set himself to seek theLord, and proclaimed afastthroughout all Judah.",
        "4And Judah gathered themselves together, to askhelpof theLord: even out of all the cities of Judah they came to seek theLord.",
        "5Â¶And Jehoshaphat stood in the congregation of Judah and Jerusalem, in the house of theLord, before the new court,",
        "6And said, OLordGod of our fathers,artnot thou God in heaven? and rulestnotthou over all the kingdoms of the heathen? and in thine handis there notpower and might, so that none is able to withstand thee?",
        "7Artnot thou our God,whodidst drive out the inhabitants of this land before thy people Israel, and gavest it to theseed of Abrahamthy friend for ever?",
        "8And they dwelt therein, and have built thee a sanctuary therein for thy name, saying,",
        "9If,whenevil cometh upon us,asthe sword, judgment, or pestilence, or famine, we stand before this house, and in thy presence, (for thy nameisin this house,) and cry unto thee in ouraffliction, then thou wilt hear and help.",
        "10And now, behold, the children of Ammon and Moab and mount Seir, whom thou wouldest not let Israel invade, when they came out of the land of Egypt, but they turned from them, and destroyed them not;",
        "11Behold,I say, howthey reward us, to come to cast us out of thy possession, which thou hast given us to inherit.",
        "12O our God, wilt thou not judge them? for we have no might against this great company that cometh against us; neitherknowwe what to do: but our eyesareupon thee.",
        "13And all Judah stood before theLord, with their little ones, their wives, and their children.",
        "14Â¶Then upon Jahaziel the son of Zechariah, the son of Benaiah, the son of Jeiel, the son of Mattaniah, a Levite of the sons of Asaph, came the Spirit of theLordin the midst of the congregation;",
        "15And he said, Hearken ye, all Judah, and ye inhabitants of Jerusalem, and thou king Jehoshaphat, Thus saith theLordunto you, Be not afraid nor dismayed by reason of this great multitude; for thebattleisnot yours, but Godâs.",
        "16To morrow go ye down against them: behold, they come up by thecliffof Ziz; and ye shall find them at the end of thebrook,beforethe wilderness of Jeruel.",
        "17Ye shall notneedto fight in thisbattle:set yourselves, stand yestill,and see thesalvationof theLordwith you, O Judah and Jerusalem: fear not, nor be dismayed; to morrow go out against them: for theLordwill bewith you.",
        "18And Jehoshaphat bowed his head withhisface to the ground: and all Judah and the inhabitants of Jerusalem fell before theLord, worshipping theLord.",
        "19And the Levites, of the children of the Kohathites, and of the children of the Korhites, stood up to praise theLordGod of Israel with a loud voice on high.",
        "20Â¶And they rose early in the morning, and went forth into the wilderness of Tekoa: and as they went forth, Jehoshaphat stood and said, Hear me, O Judah, and ye inhabitants of Jerusalem;Believein theLordyour God, so shall ye be established;believehis prophets, so shall yeprosper.",
        "21And when he had consulted with the people, he appointed singers unto theLord, and that should praisethe beauty of holiness, as they went out before the army, and to say, Praise theLord; for his mercyendurethfor ever.",
        "22Â¶And when they began to sing and to praise, theLordset ambushments against the children of Ammon, Moab, and mount Seir, which were come against Judah; and theywere smitten.",
        "23For the children of Ammon and Moab stood up against the inhabitants of mount Seir, utterly to slay and destroythem:and when they had made an end of the inhabitants of Seir, every one helped to destroyanother.",
        "24And when Judah came toward the watch tower in the wilderness, they looked unto the multitude, and, behold, theyweredead bodies fallen to the earth, and none escaped.",
        "25And when Jehoshaphat and his people came to take away the spoil of them, they found among them in abundance both riches with the dead bodies, and precious jewels, which they stripped off for themselves, more than they could carry away: and they were three days in gathering of the spoil, it was so much.",
        "26Â¶And on the fourth day they assembled themselves in the valley of Berachah; for there they blessed theLord: therefore the name of the same place was called, The valley ofBerachah, unto this day.",
        "27Then they returned, every man of Judah and Jerusalem, and Jehoshaphat in the forefront of them, to go again to Jerusalem with joy; for theLordhad made them to rejoice over their enemies.",
        "28And they came to Jerusalem with psalteries and harps and trumpets unto the house of theLord.",
        "29And the fear of God was on all the kingdoms ofthosecountries, when they had heard that theLordfought against the enemies of Israel.",
        "30So the realm of Jehoshaphat was quiet: for his God gave him rest round about.",
        "31Â¶And Jehoshaphat reigned over Judah:he wasthirty and five years old when he began to reign, and he reigned twenty and five years in Jerusalem. And his motherâs namewasAzubah the daughter of Shilhi.",
        "32And he walked in the way of Asa his father, and departed not from it, doingthat which wasright in the sight of theLord.",
        "33Howbeit the high places were not taken away: for as yet the people had not prepared their hearts unto the God of their fathers.",
        "34Now the rest of the acts of Jehoshaphat, first and last, behold, theyarewritten in the book ofJehuthe son of Hanani, whoismentioned in the book of the kings of Israel.",
        "35Â¶And after this did Jehoshaphat king of Judah join himself with Ahaziah king of Israel, who did very wickedly:",
        "36And he joined himself with him to make ships to go to Tarshish: and they made the ships in Ezion-geber.",
        "37Then Eliezer the son of Dodavah of Mareshah prophesied against Jehoshaphat, saying, Because thou hast joined thyself with Ahaziah, theLordhath broken thy works. And the ships were broken, that they were not able to go to Tarshish."
      ],
      "full_text": "1It came to pass after this also,thatthe children of Moab, and the children of Ammon, and with themotherbeside the Ammonites, came against Jehoshaphat to battle. 2Then there came some that told Jehoshaphat, saying, There cometh a great multitude against thee from beyond the sea on this side Syria;and, behold, theybein Hazazon-tamar, whichisEn-gedi. 3And Jehoshaphat feared, and set himself to seek theLord, and proclaimed afastthroughout all Judah. 4And Judah gathered themselves together, to askhelpof theLord: even out of all the cities of Judah they came to seek theLord. 5Â¶And Jehoshaphat stood in the congregation of Judah and Jerusalem, in the house of theLord, before the new court, 6And said, OLordGod of our fathers,artnot thou God in heaven? and rulestnotthou over all the kingdoms of the heathen? and in thine handis there notpower and might, so that none is able to withstand thee? 7Artnot thou our God,whodidst drive out the inhabitants of this land before thy people Israel, and gavest it to theseed of Abrahamthy friend for ever? 8And they dwelt therein, and have built thee a sanctuary therein for thy name, saying, 9If,whenevil cometh upon us,asthe sword, judgment, or pestilence, or famine, we stand before this house, and in thy presence, (for thy nameisin this house,) and cry unto thee in ouraffliction, then thou wilt hear and help. 10And now, behold, the children of Ammon and Moab and mount Seir, whom thou wouldest not let Israel invade, when they came out of the land of Egypt, but they turned from them, and destroyed them not; 11Behold,I say, howthey reward us, to come to cast us out of thy possession, which thou hast given us to inherit. 12O our God, wilt thou not judge them? for we have no might against this great company that cometh against us; neitherknowwe what to do: but our eyesareupon thee. 13And all Judah stood before theLord, with their little ones, their wives, and their children. 14Â¶Then upon Jahaziel the son of Zechariah, the son of Benaiah, the son of Jeiel, the son of Mattaniah, a Levite of the sons of Asaph, came the Spirit of theLordin the midst of the congregation; 15And he said, Hearken ye, all Judah, and ye inhabitants of Jerusalem, and thou king Jehoshaphat, Thus saith theLordunto you, Be not afraid nor dismayed by reason of this great multitude; for thebattleisnot yours, but Godâs. 16To morrow go ye down against them: behold, they come up by thecliffof Ziz; and ye shall find them at the end of thebrook,beforethe wilderness of Jeruel. 17Ye shall notneedto fight in thisbattle:set yourselves, stand yestill,and see thesalvationof theLordwith you, O Judah and Jerusalem: fear not, nor be dismayed; to morrow go out against them: for theLordwill bewith you. 18And Jehoshaphat bowed his head withhisface to the ground: and all Judah and the inhabitants of Jerusalem fell before theLord, worshipping theLord. 19And the Levites, of the children of the Kohathites, and of the children of the Korhites, stood up to praise theLordGod of Israel with a loud voice on high. 20Â¶And they rose early in the morning, and went forth into the wilderness of Tekoa: and as they went forth, Jehoshaphat stood and said, Hear me, O Judah, and ye inhabitants of Jerusalem;Believein theLordyour God, so shall ye be established;believehis prophets, so shall yeprosper. 21And when he had consulted with the people, he appointed singers unto theLord, and that should praisethe beauty of holiness, as they went out before the army, and to say, Praise theLord; for his mercyendurethfor ever. 22Â¶And when they began to sing and to praise, theLordset ambushments against the children of Ammon, Moab, and mount Seir, which were come against Judah; and theywere smitten. 23For the children of Ammon and Moab stood up against the inhabitants of mount Seir, utterly to slay and destroythem:and when they had made an end of the inhabitants of Seir, every one helped to destroyanother. 24And when Judah came toward the watch tower in the wilderness, they looked unto the multitude, and, behold, theyweredead bodies fallen to the earth, and none escaped. 25And when Jehoshaphat and his people came to take away the spoil of them, they found among them in abundance both riches with the dead bodies, and precious jewels, which they stripped off for themselves, more than they could carry away: and they were three days in gathering of the spoil, it was so much. 26Â¶And on the fourth day they assembled themselves in the valley of Berachah; for there they blessed theLord: therefore the name of the same place was called, The valley ofBerachah, unto this day. 27Then they returned, every man of Judah and Jerusalem, and Jehoshaphat in the forefront of them, to go again to Jerusalem with joy; for theLordhad made them to rejoice over their enemies. 28And they came to Jerusalem with psalteries and harps and trumpets unto the house of theLord. 29And the fear of God was on all the kingdoms ofthosecountries, when they had heard that theLordfought against the enemies of Israel. 30So the realm of Jehoshaphat was quiet: for his God gave him rest round about. 31Â¶And Jehoshaphat reigned over Judah:he wasthirty and five years old when he began to reign, and he reigned twenty and five years in Jerusalem. And his motherâs namewasAzubah the daughter of Shilhi. 32And he walked in the way of Asa his father, and departed not from it, doingthat which wasright in the sight of theLord. 33Howbeit the high places were not taken away: for as yet the people had not prepared their hearts unto the God of their fathers. 34Now the rest of the acts of Jehoshaphat, first and last, behold, theyarewritten in the book ofJehuthe son of Hanani, whoismentioned in the book of the kings of Israel. 35Â¶And after this did Jehoshaphat king of Judah join himself with Ahaziah king of Israel, who did very wickedly: 36And he joined himself with him to make ships to go to Tarshish: and they made the ships in Ezion-geber. 37Then Eliezer the son of Dodavah of Mareshah prophesied against Jehoshaphat, saying, Because thou hast joined thyself with Ahaziah, theLordhath broken thy works. And the ships were broken, that they were not able to go to Tarshish."
    },
    {
      "reference": "2 Chronicles 26",
      "title": "2 Chronicles 26",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/26?lang=eng",
      "summary": "Uzziah reigns and prospers as long as he keeps the commandmentsâHe transgresses, attempts to burn incense upon the altar, and is cursed with leprosy.",
      "verses": [
        "1Then all the people of Judah tookUzziah, whowassixteen years old, and made him king in the room of his father Amaziah.",
        "2He built Eloth, and restored it to Judah, after that the king slept with his fathers.",
        "3Sixteen years oldwasUzziah when he began to reign, and he reigned fifty and two years in Jerusalem. His motherâs name alsowasJecoliah of Jerusalem.",
        "4And he didthat which wasright in the sight of theLord, according to all that his father Amaziah did.",
        "5And he sought God in the days of Zechariah, who had understanding in thevisionsof God: and as long as he sought theLord, God made him toprosper.",
        "6And he went forth and warred against the Philistines, and brake down the wall of Gath, and the wall of Jabneh, and the wall of Ashdod, and built cities about Ashdod, and among the Philistines.",
        "7And God helped him against the Philistines, and against the Arabians that dwelt in Gur-baal, and the Mehunims.",
        "8And the Ammonites gave gifts to Uzziah: and his name spread abroadevento the entering in of Egypt; for he strengthenedhimselfexceedingly.",
        "9Moreover Uzziah built towers in Jerusalem at the corner gate, and at the valley gate, and at the turningof the wall,and fortified them.",
        "10Also he built towers in the desert, and digged many wells: for he had much cattle, both in the low country, and in the plains: husbandmenalso,and vine dressers in the mountains, and inCarmel: for he lovedhusbandry.",
        "11Moreover Uzziah had an host of fighting men, that went out to war by bands, according to the number of their account by the hand of Jeiel the scribe and Maaseiah the ruler, under the hand of Hananiah,oneof the kingâs captains.",
        "12The whole number of the chief of the fathers of the mighty men of valourweretwo thousand and six hundred.",
        "13And under their handwasan army, three hundred thousand andseven thousand and five hundred, that made war with mighty power, to help the king against the enemy.",
        "14And Uzziah prepared for them throughout all the host shields, and spears, and helmets, andhabergeons, and bows, and slingsto caststones.",
        "15And he made in Jerusalem engines, invented by cunning men, to be on the towers and upon the bulwarks, to shoot arrows and great stones withal. And his name spread far abroad; for he was marvellously helped, till he was strong.",
        "16Â¶But when he was strong, his heart was lifted up tohisdestruction: for he transgressed against theLordhis God, and went into the temple of theLordto burn incense upon the altar of incense.",
        "17AndAzariahthe priest went in after him, and with him fourscore priests of theLord,that werevaliant men:",
        "18And they withstood Uzziah the king, and said unto him,Itappertainethnotunto thee, Uzziah, toburnincense unto theLord, but to the priests the sons ofAaron, that are consecrated to burnincense: go out of the sanctuary; for thou hast trespassed; neithershall it befor thine honour from theLordGod.",
        "19Then Uzziah was wroth, andhada censer in his hand to burn incense: and while he was wroth with the priests, the leprosy even rose up in his forehead before the priests in the house of theLord, from beside the incense altar.",
        "20And Azariah the chief priest, and all the priests, looked upon him, and, behold, hewasleprous in his forehead, and they thrust him out from thence; yea, himself hasted also to go out, because theLordhadsmittenhim.",
        "21And Uzziah the king was aleperunto the day of his death, and dwelt in aseveralhouse,beinga leper; for he was cut off from the house of theLord: and Jotham his sonwasover the kingâs house, judging the people of the land.",
        "22Â¶Now the rest of the acts of Uzziah, first and last, did Isaiah the prophet, the son of Amoz,write.",
        "23So Uzziah slept with his fathers, and they buried him with his fathers in the field of the burial whichbelongedto the kings; for they said, Heisa leper: and Jotham his son reigned in his stead."
      ],
      "full_text": "1Then all the people of Judah tookUzziah, whowassixteen years old, and made him king in the room of his father Amaziah. 2He built Eloth, and restored it to Judah, after that the king slept with his fathers. 3Sixteen years oldwasUzziah when he began to reign, and he reigned fifty and two years in Jerusalem. His motherâs name alsowasJecoliah of Jerusalem. 4And he didthat which wasright in the sight of theLord, according to all that his father Amaziah did. 5And he sought God in the days of Zechariah, who had understanding in thevisionsof God: and as long as he sought theLord, God made him toprosper. 6And he went forth and warred against the Philistines, and brake down the wall of Gath, and the wall of Jabneh, and the wall of Ashdod, and built cities about Ashdod, and among the Philistines. 7And God helped him against the Philistines, and against the Arabians that dwelt in Gur-baal, and the Mehunims. 8And the Ammonites gave gifts to Uzziah: and his name spread abroadevento the entering in of Egypt; for he strengthenedhimselfexceedingly. 9Moreover Uzziah built towers in Jerusalem at the corner gate, and at the valley gate, and at the turningof the wall,and fortified them. 10Also he built towers in the desert, and digged many wells: for he had much cattle, both in the low country, and in the plains: husbandmenalso,and vine dressers in the mountains, and inCarmel: for he lovedhusbandry. 11Moreover Uzziah had an host of fighting men, that went out to war by bands, according to the number of their account by the hand of Jeiel the scribe and Maaseiah the ruler, under the hand of Hananiah,oneof the kingâs captains. 12The whole number of the chief of the fathers of the mighty men of valourweretwo thousand and six hundred. 13And under their handwasan army, three hundred thousand andseven thousand and five hundred, that made war with mighty power, to help the king against the enemy. 14And Uzziah prepared for them throughout all the host shields, and spears, and helmets, andhabergeons, and bows, and slingsto caststones. 15And he made in Jerusalem engines, invented by cunning men, to be on the towers and upon the bulwarks, to shoot arrows and great stones withal. And his name spread far abroad; for he was marvellously helped, till he was strong. 16Â¶But when he was strong, his heart was lifted up tohisdestruction: for he transgressed against theLordhis God, and went into the temple of theLordto burn incense upon the altar of incense. 17AndAzariahthe priest went in after him, and with him fourscore priests of theLord,that werevaliant men: 18And they withstood Uzziah the king, and said unto him,Itappertainethnotunto thee, Uzziah, toburnincense unto theLord, but to the priests the sons ofAaron, that are consecrated to burnincense: go out of the sanctuary; for thou hast trespassed; neithershall it befor thine honour from theLordGod. 19Then Uzziah was wroth, andhada censer in his hand to burn incense: and while he was wroth with the priests, the leprosy even rose up in his forehead before the priests in the house of theLord, from beside the incense altar. 20And Azariah the chief priest, and all the priests, looked upon him, and, behold, hewasleprous in his forehead, and they thrust him out from thence; yea, himself hasted also to go out, because theLordhadsmittenhim. 21And Uzziah the king was aleperunto the day of his death, and dwelt in aseveralhouse,beinga leper; for he was cut off from the house of theLord: and Jotham his sonwasover the kingâs house, judging the people of the land. 22Â¶Now the rest of the acts of Uzziah, first and last, did Isaiah the prophet, the son of Amoz,write. 23So Uzziah slept with his fathers, and they buried him with his fathers in the field of the burial whichbelongedto the kings; for they said, Heisa leper: and Jotham his son reigned in his stead."
    },
    {
      "reference": "2 Chronicles 30",
      "title": "2 Chronicles 30",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/30?lang=eng",
      "summary": "Hezekiah invites all Israel to a solemn Passover in JerusalemâSome accept the call; others laugh him to scornâThe faithful Israelites worship the Lord in Jerusalem.",
      "verses": [
        "1And Hezekiah sent to all Israel and Judah, and wrote letters also to Ephraim and Manasseh, that they should come to the house of theLordat Jerusalem, to keep the passover unto theLordGod of Israel.",
        "2For the king had taken counsel, and his princes, and all the congregation in Jerusalem, to keep the passover in thesecondmonth.",
        "3For they could not keep it atthat time, because the priests had not sanctified themselves sufficiently, neither had the people gathered themselves together to Jerusalem.",
        "4And the thing pleased the king and all the congregation.",
        "5So they established a decree to make proclamation throughout all Israel, from Beer-sheba even to Dan, that they should come to keep the passover unto theLordGod of Israel at Jerusalem: for they had not doneitof a longtimein such sortas it was written.",
        "6So thepostswent with the letters from the king and his princes throughout all Israel and Judah, and according to the commandment of the king, saying, Ye children of Israel,turnagain unto theLordGod of Abraham, Isaac, and Israel, and he will return to the remnant of you, that are escaped out of the hand of the kings of Assyria.",
        "7And be not ye like yourfathers, and like your brethren, which trespassed against theLordGod of their fathers,whotherefore gave them up to desolation, as ye see.",
        "8Now be ye notstiffnecked, as your fatherswere, butyieldyourselves unto theLord, and enter into his sanctuary, which he hath sanctified for ever: and serve theLordyour God, that the fierceness of his wrath may turn away from you.",
        "9For if yeturnagain unto theLord, your brethren and your childrenshall findcompassion before them that lead them captive, so that they shall come again into this land: for theLordyour Godisgracious andmerciful, and will not turn awayhisface from you, if ye return unto him.",
        "10So the posts passed from city to city through the country of Ephraim and Manasseh even unto Zebulun: but they laughed them to scorn, andmockedthem.",
        "11Neverthelessdiversof Asher and Manasseh and of Zebulun humbled themselves, and came to Jerusalem.",
        "12Also in Judah the hand of God was to give themoneheart to do the commandment of the king and of the princes, by the word of theLord.",
        "13Â¶And there assembled at Jerusalem much people to keep the feast ofunleavenedbread in the second month, a very great congregation.",
        "14And they arose and took away the altars thatwerein Jerusalem, and all the altars for incense took they away, and casttheminto the brook Kidron.",
        "15Then they killed the passover on the fourteenthdayof the second month: and the priests and the Levites were ashamed, and sanctified themselves, and brought in the burnt offerings into the house of theLord.",
        "16And they stood in their place after their manner, according to the law of Moses the man of God: the priests sprinkled theblood,which they receivedof the hand of the Levites.",
        "17Forthere weremany in the congregation that were not sanctified: therefore the Levites had the charge of the killing of the passovers for every onethat wasnot clean, to sanctifythemunto theLord.",
        "18For a multitude of the people,evenmany of Ephraim, and Manasseh, Issachar, and Zebulun, had notcleansedthemselves, yet did they eat the passover otherwise than it was written. But Hezekiah prayed for them, saying, The goodLordpardon every one",
        "19Thatprepareth his heart to seek God, theLordGod of his fathers, thoughhe benotcleansedaccording to the purification of the sanctuary.",
        "20And theLordhearkened to Hezekiah, andhealedthe people.",
        "21And the children of Israel that were present at Jerusalem kept the feast of unleavened bread seven days with great gladness: and the Levites and the priests praised theLordday by day,singingwith loud instruments unto theLord.",
        "22And Hezekiah spakecomfortablyunto all the Levites that taught the good knowledge of theLord:and they did eat throughout the feast seven days, offering peace offerings, and makingconfessionto theLordGod of their fathers.",
        "23And the whole assembly took counsel to keep other seven days: and they keptotherseven days with gladness.",
        "24For Hezekiah king of Judah did give to the congregation a thousand bullocks and seven thousand sheep; and the princes gave to the congregation a thousand bullocks and ten thousand sheep: and a great number of priestssanctifiedthemselves.",
        "25And all the congregation of Judah, with the priests and the Levites, and all the congregation that came out of Israel, and the strangers that came out of the land of Israel, and that dwelt in Judah, rejoiced.",
        "26So there was great joy in Jerusalem: for since the time of Solomon the son of David king of Israelthere wasnot the like in Jerusalem.",
        "27Â¶Then the priests the Levites arose andblessedthe people: and their voice was heard, and their prayer cameupto his holy dwelling place,evenunto heaven."
      ],
      "full_text": "1And Hezekiah sent to all Israel and Judah, and wrote letters also to Ephraim and Manasseh, that they should come to the house of theLordat Jerusalem, to keep the passover unto theLordGod of Israel. 2For the king had taken counsel, and his princes, and all the congregation in Jerusalem, to keep the passover in thesecondmonth. 3For they could not keep it atthat time, because the priests had not sanctified themselves sufficiently, neither had the people gathered themselves together to Jerusalem. 4And the thing pleased the king and all the congregation. 5So they established a decree to make proclamation throughout all Israel, from Beer-sheba even to Dan, that they should come to keep the passover unto theLordGod of Israel at Jerusalem: for they had not doneitof a longtimein such sortas it was written. 6So thepostswent with the letters from the king and his princes throughout all Israel and Judah, and according to the commandment of the king, saying, Ye children of Israel,turnagain unto theLordGod of Abraham, Isaac, and Israel, and he will return to the remnant of you, that are escaped out of the hand of the kings of Assyria. 7And be not ye like yourfathers, and like your brethren, which trespassed against theLordGod of their fathers,whotherefore gave them up to desolation, as ye see. 8Now be ye notstiffnecked, as your fatherswere, butyieldyourselves unto theLord, and enter into his sanctuary, which he hath sanctified for ever: and serve theLordyour God, that the fierceness of his wrath may turn away from you. 9For if yeturnagain unto theLord, your brethren and your childrenshall findcompassion before them that lead them captive, so that they shall come again into this land: for theLordyour Godisgracious andmerciful, and will not turn awayhisface from you, if ye return unto him. 10So the posts passed from city to city through the country of Ephraim and Manasseh even unto Zebulun: but they laughed them to scorn, andmockedthem. 11Neverthelessdiversof Asher and Manasseh and of Zebulun humbled themselves, and came to Jerusalem. 12Also in Judah the hand of God was to give themoneheart to do the commandment of the king and of the princes, by the word of theLord. 13Â¶And there assembled at Jerusalem much people to keep the feast ofunleavenedbread in the second month, a very great congregation. 14And they arose and took away the altars thatwerein Jerusalem, and all the altars for incense took they away, and casttheminto the brook Kidron. 15Then they killed the passover on the fourteenthdayof the second month: and the priests and the Levites were ashamed, and sanctified themselves, and brought in the burnt offerings into the house of theLord. 16And they stood in their place after their manner, according to the law of Moses the man of God: the priests sprinkled theblood,which they receivedof the hand of the Levites. 17Forthere weremany in the congregation that were not sanctified: therefore the Levites had the charge of the killing of the passovers for every onethat wasnot clean, to sanctifythemunto theLord. 18For a multitude of the people,evenmany of Ephraim, and Manasseh, Issachar, and Zebulun, had notcleansedthemselves, yet did they eat the passover otherwise than it was written. But Hezekiah prayed for them, saying, The goodLordpardon every one 19Thatprepareth his heart to seek God, theLordGod of his fathers, thoughhe benotcleansedaccording to the purification of the sanctuary. 20And theLordhearkened to Hezekiah, andhealedthe people. 21And the children of Israel that were present at Jerusalem kept the feast of unleavened bread seven days with great gladness: and the Levites and the priests praised theLordday by day,singingwith loud instruments unto theLord. 22And Hezekiah spakecomfortablyunto all the Levites that taught the good knowledge of theLord:and they did eat throughout the feast seven days, offering peace offerings, and makingconfessionto theLordGod of their fathers. 23And the whole assembly took counsel to keep other seven days: and they keptotherseven days with gladness. 24For Hezekiah king of Judah did give to the congregation a thousand bullocks and seven thousand sheep; and the princes gave to the congregation a thousand bullocks and ten thousand sheep: and a great number of priestssanctifiedthemselves. 25And all the congregation of Judah, with the priests and the Levites, and all the congregation that came out of Israel, and the strangers that came out of the land of Israel, and that dwelt in Judah, rejoiced. 26So there was great joy in Jerusalem: for since the time of Solomon the son of David king of Israelthere wasnot the like in Jerusalem. 27Â¶Then the priests the Levites arose andblessedthe people: and their voice was heard, and their prayer cameupto his holy dwelling place,evenunto heaven."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:29:58",
  "metadata": {
    "week_number": 30,
    "title": "Week 30: July 20–26 - 2 Chronicles 14–20; 26; 30",
    "date_range": "July 20–26",
    "scraped_at": "2025-12-21T22:30:05.238859",
    "scraper_version": "2.0.0"
  }
}