{
  "week_number": 51,
  "date_range": "December 14–20",
  "title": "Week 51: December 14–20 - Malachi",
  "bundle_title": "Week 51: December 14–20: \"Week 51: December 14–20 - Malachi\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/51?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/51?lang=eng",
    "title": "Malachi",
    "scripture_references": "Malachi",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“I have loved you,” the Lord told His people through the prophet Malachi. But the Israelites, who had suffered generations of affliction and captivity, asked, “Wherein hast thou loved us?” (Malachi 1:2). After all Israel had been through, they may have wondered whether their history is really a story of God’s love for His covenant people. In some ways, it’s easier to see it as a story of human weakness and rebellion. Yet through it all, God never stopped reaching out in love. When the sons of Jacob mistreated their brother Joseph, the Lord still saved them from famine (seeGenesis 45:4–8). When Israel murmured in the wilderness, He fed them with manna (seeExodus 16:1–4). Even when Israel turned to other gods and were scattered, God promised that if they repented, He would gather and redeem them “with great mercies” (seeIsaiah 54:7). Truly, the Old Testament is a story of God’s patient, enduring love. And this story continues today. Jesus Christ, “the Sun of Righteousness,” as Malachi called Him, has come “with healing in his wings” (Malachi 4:2). He is the greatest evidence of God’s love for ancient Israel and for all of us.\n\nFor more information about the book of Malachi, see “Malachi” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "“Return unto me, and I will return unto you.”",
        "content": "In Malachi’s day, the Israelites had already rebuilt the temple in Jerusalem, but as a people they still needed to rebuild their relationship with the Lord. As you study Malachi, look for questions that the Lord asked the Israelites or that they asked Him. Consider asking yourself similar questions (some examples are suggested below) to help you evaluate your relationship with the Lord and draw closer to Him.\n\nHow have I felt the Lord’s love for me? (seeMalachi 1:2).\n\nDo my offerings to the Lord truly honor Him? (seeMalachi 1:6–11)\n\nIn what ways do I need to “return” to the Lord? (seeMalachi 3:7).\n\nAm I robbing God in any way? (seeMalachi 3:8–11).\n\nHow does my attitude during difficult times reflect my feelings toward the Lord? (seeMalachi 3:13–15; see also2:17).\n\nMalachi 1:6–14"
      },
      {
        "title": "The Lord asks for “a pure offering.”",
        "content": "As you read about the offerings described inMalachi 1, what do you notice about the sacrifices the priests were offering? What do these sacrifices suggest about the priests’ feelings toward the Lord? (seeMalachi 1:13). Consider making a list of offerings, or sacrifices, that you make to the Lord. For each item on the list, ponder what might make it a “polluted” offering or a “pure” offering (Malachi 1:7, 11).\n\nMalachi 3:8–12"
      },
      {
        "title": "The Lord opens the windows of heaven as I show my faith by paying tithing.",
        "content": "Imagine you have a friend who just found out that you pay tithing. “Why do you do that?” your friend asks. Think about this as you readMalachi 3:8–12. What do you find there that could help answer your friend’s question? What else would you want your friend to understand about tithing? For more help, you could search Elder Neil L. Andersen’s message “Tithing: Opening the Windows of Heaven” (Liahona, Nov. 2023, 32–35), looking for answers to questions like these:\n\nWhy does the Lord want us to pay tithing?\n\nWhat might keep someone from paying tithing, and how can we overcome those obstacles?\n\nHow does paying tithing strengthen our faith in Heavenly Father and Jesus Christ?\n\nYou could also share with your friend how the Lord has blessed you when you pay tithing. You can find ideas in the section titled “Lesson Number 1—Significant but Subtle Blessings” in Elder David A. Bednar’s message “The Windows of Heaven” (EnsignorLiahona, Nov. 2013, 17–18). What kind of people do we become by paying tithing?\n\nWhat do you think the phrase “open you the windows of heaven” (verse 10) might mean? Maybe you could look out a window and think about the purposes of windows. Why is “windows of heaven” a good way to describe how the Lord blesses us when we pay tithing?\n\nVision in the Kirtland Temple, by Gary Smith\n\nMalachi 4:5–6"
      },
      {
        "title": "“I will send you Elijah the prophet.”",
        "content": "When Moroni quotedMalachi 4:5–6to Joseph Smith, he did so “with a little variation from the way it reads” in the Bible (seeJoseph Smith—History 1:36–39). What does Moroni’s variation add to your understanding of this prophecy? In particular, ponder questions like these:\n\nWho are “the fathers”? (seeDeuteronomy 29:13). What promises have been made to them? (seeAbraham 2:9–11). How do you help fulfill these promises?\n\nWhat experiences have helped you turn your heart to your ancestors? Why is that so important to Heavenly Father’s plan?\n\nTo learn more about the coming of Elijah and how this prophecy is being fulfilled today, seeDoctrine and Covenants 110:13–16and D. Todd Christofferson, “The Sealing Power” (Liahona, Nov. 2023, 19–22). Why are you grateful that Elijah has come?\n\nSee also Gerrit W. Gong, “We Each Have a Story,”Liahona, May 2022, 43–46; “Turn Your Hearts,”Hymns, no. 291; “The Sealing Power” (video),ChurchofJesusChrist.org.\n\nThe Sealing Power\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "The Lord loves me.",
        "content": "How would you and your children answer the question inMalachi 1:2—“Wherein hast [the Lord] loved us?” Share with each other reasons you know He loves you. Maybe your children could draw pictures that remind them of His love.\n\nEngage children in gospel discussions.If you are teaching younger children, you may need to think of creative ways to involve them in gospel discussions. For example, your children could pass around a ball; when they are holding the ball, they could share one reason they know Jesus loves them.\n\nMalachi 3:8–12"
      },
      {
        "title": "The Lord will bless me as I pay tithing.",
        "content": "How will you help your children learn about tithing? You could ask them to count 10 small objects, such as the coins on this week’s activity page. Then they could separate one of the objects from the rest—this is how much we give to the Lord as tithing. According toMalachi 3:8–12, why does the Lord want us to pay tithing? (see also “Malachi the Prophet” inOld Testament Stories, 171–72; “First Things First!” [video], Gospel Library).\n\nMalachi the Prophet\n\nFirst Things First!\n\nAs you readMalachi 3:10together, you could invite your children to stand by a window when you read the phrase “windows of heaven.” Or you could pour water into a cup until it overflows to illustrate the phrase “there shall not be room enough to receive it.” Tell the children about the blessings God has given you as you pay tithing. Your children could draw pictures representing these blessings and hang them on or near a window in your home.\n\nMalachi 4:5–6"
      },
      {
        "title": "Elijah came to turn our hearts to our families.",
        "content": "InMalachi 4:5–6, your children could look for answers to the following questions about Malachi’s prophecy:Whodid the Lord promise to send?Whendid He say this person would come?Whatdid the Lord say that this person would do?Whywould this person need to come?Wherewas this prophecy fulfilled? (seeDoctrine and Covenants 110:13–16).\n\nTo find out how the promise inMalachi 4:5was fulfilled, you can also review “Joseph and Oliver Receive Priesthood Keys” inDoctrine and Covenants Stories, 26–30. A song like “The Hearts of the Children” (Children’s Songbook, 92) can help your children learn why it was so important that Elijah came. You could also visitFamilySearch.org/discovery, theFamilySearch Tree app, or theMy Familybookletfor activities that can help you and your children turn your hearts to your ancestors.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nMourning’s Hosanna, by Rose Datoc Dall. A woman named Mourning stands in the spirit world, surrounded by her ancestors. She celebrates their deliverance from spiritual captivity."
      }
    ],
    "study_helps": [],
    "raw_text": "December 14–20. “I Have Loved You, Saith the Lord”: Malachi\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nNovember 30–December 6\nMicah; Nahum; Habakkuk; Zephaniah\nDecember 7–13\nHaggai 1–2; Zechariah 1–4; 7–14\nDecember 14–20\nMalachi\nDecember 21–27\nChristmas\nAppendixes\nDecember 14–20. “I Have Loved You, Saith the Lord”: Malachi\n“December 14–20. ‘I Have Loved You, Saith the Lord’: Malachi,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“December 14–20. ‘I Have Loved You, Saith the Lord,’”\nCome, Follow Me: Old Testament 2026\nDecember 14–20: “I Have Loved You, Saith the Lord”\nMalachi\n“I have loved you,” the Lord told His people through the prophet Malachi. But the Israelites, who had suffered generations of affliction and captivity, asked, “Wherein hast thou loved us?” (\nMalachi 1:2\n). After all Israel had been through, they may have wondered whether their history is really a story of God’s love for His covenant people. In some ways, it’s easier to see it as a story of human weakness and rebellion. Yet through it all, God never stopped reaching out in love. When the sons of Jacob mistreated their brother Joseph, the Lord still saved them from famine (see\nGenesis 45:4–8\n). When Israel murmured in the wilderness, He fed them with manna (see\nExodus 16:1–4\n). Even when Israel turned to other gods and were scattered, God promised that if they repented, He would gather and redeem them “with great mercies” (see\nIsaiah 54:7\n). Truly, the Old Testament is a story of God’s patient, enduring love. And this story continues today. Jesus Christ, “the Sun of Righteousness,” as Malachi called Him, has come “with healing in his wings” (\nMalachi 4:2\n). He is the greatest evidence of God’s love for ancient Israel and for all of us.\nFor more information about the book of Malachi, see “\nMalachi\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nMalachi 1–4\n“Return unto me, and I will return unto you.”\nIn Malachi’s day, the Israelites had already rebuilt the temple in Jerusalem, but as a people they still needed to rebuild their relationship with the Lord. As you study Malachi, look for questions that the Lord asked the Israelites or that they asked Him. Consider asking yourself similar questions (some examples are suggested below) to help you evaluate your relationship with the Lord and draw closer to Him.\nHow have I felt the Lord’s love for me? (see\nMalachi 1:2\n).\nDo my offerings to the Lord truly honor Him? (see\nMalachi 1:6–11\n)\nIn what ways do I need to “return” to the Lord? (see\nMalachi 3:7\n).\nAm I robbing God in any way? (see\nMalachi 3:8–11\n).\nHow does my attitude during difficult times reflect my feelings toward the Lord? (see\nMalachi 3:13–15\n; see also\n2:17\n).\nMalachi 1:6–14\nThe Lord asks for “a pure offering.”\nAs you read about the offerings described in\nMalachi 1\n, what do you notice about the sacrifices the priests were offering? What do these sacrifices suggest about the priests’ feelings toward the Lord? (see\nMalachi 1:13\n). Consider making a list of offerings, or sacrifices, that you make to the Lord. For each item on the list, ponder what might make it a “polluted” offering or a “pure” offering (\nMalachi 1:7, 11\n).\nMalachi 3:8–12\nThe Lord opens the windows of heaven as I show my faith by paying tithing.\nImagine you have a friend who just found out that you pay tithing. “Why do you do that?” your friend asks. Think about this as you read\nMalachi 3:8–12\n. What do you find there that could help answer your friend’s question? What else would you want your friend to understand about tithing? For more help, you could search Elder Neil L. Andersen’s message “\nTithing: Opening the Windows of Heaven\n” (\nLiahona\n, Nov. 2023, 32–35), looking for answers to questions like these:\nWhy does the Lord want us to pay tithing?\nWhat might keep someone from paying tithing, and how can we overcome those obstacles?\nHow does paying tithing strengthen our faith in Heavenly Father and Jesus Christ?\nYou could also share with your friend how the Lord has blessed you when you pay tithing. You can find ideas in the section titled “\nLesson Number 1—Significant but Subtle Blessings\n” in Elder David A. Bednar’s message “\nThe Windows of Heaven\n” (\nEnsign\nor\nLiahona\n, Nov. 2013, 17–18). What kind of people do we become by paying tithing?\nWhat do you think the phrase “open you the windows of heaven” (\nverse 10\n) might mean? Maybe you could look out a window and think about the purposes of windows. Why is “windows of heaven” a good way to describe how the Lord blesses us when we pay tithing?\nVision in the Kirtland Temple\n, by Gary Smith\nMalachi 4:5–6\n“I will send you Elijah the prophet.”\nWhen Moroni quoted\nMalachi 4:5–6\nto Joseph Smith, he did so “with a little variation from the way it reads” in the Bible (see\nJoseph Smith—History 1:36–39\n). What does Moroni’s variation add to your understanding of this prophecy? In particular, ponder questions like these:\nWho are “the fathers”? (see\nDeuteronomy 29:13\n). What promises have been made to them? (see\nAbraham 2:9–11\n). How do you help fulfill these promises?\nWhat experiences have helped you turn your heart to your ancestors? Why is that so important to Heavenly Father’s plan?\nTo learn more about the coming of Elijah and how this prophecy is being fulfilled today, see\nDoctrine and Covenants 110:13–16\nand D. Todd Christofferson, “\nThe Sealing Power\n” (\nLiahona\n, Nov. 2023, 19–22). Why are you grateful that Elijah has come?\nSee also Gerrit W. Gong, “\nWe Each Have a Story\n,”\nLiahona\n, May 2022, 43–46; “\nTurn Your Hearts\n,”\nHymns\n, no. 291; “The Sealing Power” (video),\nChurchofJesusChrist.org\n.\n3:38\nThe Sealing Power\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nMalachi 1:2\nThe Lord loves me.\nHow would you and your children answer the question in\nMalachi 1:2\n—“Wherein hast [the Lord] loved us?” Share with each other reasons you know He loves you. Maybe your children could draw pictures that remind them of His love.\nEngage children in gospel discussions.\nIf you are teaching younger children, you may need to think of creative ways to involve them in gospel discussions. For example, your children could pass around a ball; when they are holding the ball, they could share one reason they know Jesus loves them.\nMalachi 3:8–12\nThe Lord will bless me as I pay tithing.\nHow will you help your children learn about tithing? You could ask them to count 10 small objects, such as the coins on this week’s activity page. Then they could separate one of the objects from the rest—this is how much we give to the Lord as tithing. According to\nMalachi 3:8–12\n, why does the Lord want us to pay tithing? (see also “\nMalachi the Prophet\n” in\nOld Testament Stories\n, 171–72; “First Things First!” [video], Gospel Library).\n0:58\nMalachi the Prophet\n1:18\nFirst Things First!\nAs you read\nMalachi 3:10\ntogether, you could invite your children to stand by a window when you read the phrase “windows of heaven.” Or you could pour water into a cup until it overflows to illustrate the phrase “there shall not be room enough to receive it.” Tell the children about the blessings God has given you as you pay tithing. Your children could draw pictures representing these blessings and hang them on or near a window in your home.\nMalachi 4:5–6\nElijah came to turn our hearts to our families.\nIn\nMalachi 4:5–6\n, your children could look for answers to the following questions about Malachi’s prophecy:\nWho\ndid the Lord promise to send?\nWhen\ndid He say this person would come?\nWhat\ndid the Lord say that this person would do?\nWhy\nwould this person need to come?\nWhere\nwas this prophecy fulfilled? (see\nDoctrine and Covenants 110:13–16\n).\nTo find out how the promise in\nMalachi 4:5\nwas fulfilled, you can also review “Joseph and Oliver Receive Priesthood Keys” in\nDoctrine and Covenants Stories\n, 26–30. A song like “\nThe Hearts of the Children\n” (\nChildren’s Songbook\n, 92) can help your children learn why it was so important that Elijah came. You could also visit\nFamilySearch.org/discovery\n, the\nFamilySearch Tree app\n, or the\nMy Family\nbooklet\nfor activities that can help you and your children turn your hearts to your ancestors.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nMourning’s Hosanna\n, by Rose Datoc Dall. A woman named Mourning stands in the spirit world, surrounded by her ancestors. She celebrates their deliverance from spiritual captivity.\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Malachi 1",
      "title": "Malachi",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/mal/1?lang=eng",
      "summary": "The Jews despise the Lord by offering polluted bread upon the altar and by sacrificing animals with blemishesâThe Lordâs name will be great among the Gentiles.",
      "verses": [
        "1The burden of thewordof theLordto Israel by Malachi.",
        "2I havelovedyou, saith theLord. Yet ye say, Wherein hast thou loved us?Wasnot Esau Jacobâs brother? saith theLord: yet IlovedJacob,",
        "3And I hated Esau, and laid his mountains and hisheritagewastefor thedragonsof the wilderness.",
        "4Whereas Edom saith, We are impoverished, but we will return and build the desolate places; thus saith theLordof hosts, They shall build, but I will throw down; and they shall call them, The border of wickedness, and, The people against whom theLordhath indignation for ever.",
        "5And your eyes shall see, and ye shall say, TheLordwill be magnified from the border of Israel.",
        "6Â¶A sonhonourethhisfather, and a servant his master: if then Ibea father, whereisminehonour? and if Ibea master, whereismy fear? saith theLordof hosts unto you, O priests, that despise my name. And ye say, Wherein have we despised thy name?",
        "7Ye offer polluted bread upon mine altar; and ye say, Wherein have we polluted thee? In that ye say, The table of theLordiscontemptible.",
        "8And if ye offer theblindforsacrifice,is itnot evil? and if ye offerthe lame and sick,is itnot evil? offer it now unto thy governor; will he be pleased with thee, or accept thy person? saith theLordof hosts.",
        "9And now, I pray you, beseech God that he will be gracious unto us: this hath been by your means: will he regard your persons? saith theLordof hosts.",
        "10Whois thereeven among you that would shut the doorsfor nought?neither do ye kindlefireon mine altar for nought. I have no pleasure in you, saith theLordof hosts, neither will Iacceptan offering at your hand.",
        "11For from therisingof the sun even unto the going down of the same mynameshall begreat among theGentiles; and in every place incenseshall beoffered unto my name, and a pure offering: for my nameshall begreat among the heathen, saith theLordof hosts.",
        "12Â¶But ye have profaned it, in that ye say, Thetableof theLordispolluted; and the fruit thereof,evenhis meat,iscontemptible.",
        "13Ye said also, Behold, what a wearinessis it!and ye havesnuffed at it, saith theLordof hosts; and ye broughtthat which wastorn, and thelame, and the sick; thus ye brought an offering: should Iacceptthis of your hand? saith theLord.",
        "14Butcursedbethe deceiver, which hath in his flock a male, and voweth, and sacrificeth unto the Lord a corrupt thing: for Iama great King, saith theLordof hosts, and my nameisdreadfulamong the heathen."
      ],
      "full_text": "1The burden of thewordof theLordto Israel by Malachi. 2I havelovedyou, saith theLord. Yet ye say, Wherein hast thou loved us?Wasnot Esau Jacobâs brother? saith theLord: yet IlovedJacob, 3And I hated Esau, and laid his mountains and hisheritagewastefor thedragonsof the wilderness. 4Whereas Edom saith, We are impoverished, but we will return and build the desolate places; thus saith theLordof hosts, They shall build, but I will throw down; and they shall call them, The border of wickedness, and, The people against whom theLordhath indignation for ever. 5And your eyes shall see, and ye shall say, TheLordwill be magnified from the border of Israel. 6Â¶A sonhonourethhisfather, and a servant his master: if then Ibea father, whereisminehonour? and if Ibea master, whereismy fear? saith theLordof hosts unto you, O priests, that despise my name. And ye say, Wherein have we despised thy name? 7Ye offer polluted bread upon mine altar; and ye say, Wherein have we polluted thee? In that ye say, The table of theLordiscontemptible. 8And if ye offer theblindforsacrifice,is itnot evil? and if ye offerthe lame and sick,is itnot evil? offer it now unto thy governor; will he be pleased with thee, or accept thy person? saith theLordof hosts. 9And now, I pray you, beseech God that he will be gracious unto us: this hath been by your means: will he regard your persons? saith theLordof hosts. 10Whois thereeven among you that would shut the doorsfor nought?neither do ye kindlefireon mine altar for nought. I have no pleasure in you, saith theLordof hosts, neither will Iacceptan offering at your hand. 11For from therisingof the sun even unto the going down of the same mynameshall begreat among theGentiles; and in every place incenseshall beoffered unto my name, and a pure offering: for my nameshall begreat among the heathen, saith theLordof hosts. 12Â¶But ye have profaned it, in that ye say, Thetableof theLordispolluted; and the fruit thereof,evenhis meat,iscontemptible. 13Ye said also, Behold, what a wearinessis it!and ye havesnuffed at it, saith theLordof hosts; and ye broughtthat which wastorn, and thelame, and the sick; thus ye brought an offering: should Iacceptthis of your hand? saith theLord. 14Butcursedbethe deceiver, which hath in his flock a male, and voweth, and sacrificeth unto the Lord a corrupt thing: for Iama great King, saith theLordof hosts, and my nameisdreadfulamong the heathen."
    },
    {
      "reference": "Malachi 2",
      "title": "Malachi 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/mal/2?lang=eng",
      "summary": "The priests are reproved for not keeping their covenants and not teaching the peopleâThe Jews are condemned for dealing treacherously with one another and with their wives.",
      "verses": [
        "1And now, O ye priests, this commandmentisfor you.",
        "2If ye will nothear, and if ye will not layitto heart, to give glory unto my name, saith theLordof hosts, I will even send acurseupon you, and I will curse your blessings: yea, I have cursed them already, because ye do not layitto heart.",
        "3Behold, I willcorruptyour seed, and spread dung upon your faces,eventhe dung of your solemn feasts; andoneshall take you away with it.",
        "4And ye shall know that I have sent this commandment unto you, that mycovenantmight be with Levi, saith theLordof hosts.",
        "5Mycovenantwas with him of life and peace; and I gave them to himforthe fear wherewith he feared me, and was afraid before my name.",
        "6The law oftruthwas in his mouth, and iniquity was not found in his lips: he walked with me in peace and equity, and didturnmany away frominiquity.",
        "7For the priestâs lips should keepknowledge, and they should seek thelawat his mouth: for heisthemessengerof theLordof hosts.",
        "8But ye aredepartedout of the way; ye have caused many tostumbleat the law; ye havecorruptedthecovenantof Levi, saith theLordof hosts.",
        "9Therefore have I also made youcontemptibleand base before all the people, according as ye have not kept my ways, but have been partial in the law.",
        "10Have we not all onefather? hath not one Godcreatedus? why do we deal treacherously every man against his brother, byprofaningthe covenant of our fathers?",
        "11Â¶Judah hath dealt treacherously, and an abomination is committed in Israel and in Jerusalem; for Judah hath profaned the holiness of theLordwhich he loved, and hathmarriedthe daughter of astrange god.",
        "12TheLordwillcut offthe man that doeth this, the master and the scholar, out of the tabernacles of Jacob, and him that offereth an offering unto theLordof hosts.",
        "13And this have ye done again, covering the altar of theLordwith tears, with weeping, and with crying out, insomuch that he regardeth not the offering any more, or receivethitwith good will at your hand.",
        "14Â¶Yet ye say, Wherefore? Because theLordhath been witness between thee and thewifeof thy youth, against whom thou hast dealt treacherously: yetisshe thy companion, and the wife of thy covenant.",
        "15And did not he makeone? Yet had he the residue of the spirit. And wherefore one? That he might seek agodlyseed. Therefore take heed to your spirit, and let none deal treacherously against thewifeof his youth.",
        "16For theLord, the God of Israel, saith that he hatethputting away: foronecovereth violence with his garment, saith theLordof hosts: therefore take heed to your spirit, that ye deal not treacherously.",
        "17Â¶Ye have wearied theLordwith your words. Yet ye say, Wherein have we weariedhim?When ye say, Every one that doethevilisgood in the sight of theLord, and he delighteth in them; or, Whereisthe God ofjudgment?"
      ],
      "full_text": "1And now, O ye priests, this commandmentisfor you. 2If ye will nothear, and if ye will not layitto heart, to give glory unto my name, saith theLordof hosts, I will even send acurseupon you, and I will curse your blessings: yea, I have cursed them already, because ye do not layitto heart. 3Behold, I willcorruptyour seed, and spread dung upon your faces,eventhe dung of your solemn feasts; andoneshall take you away with it. 4And ye shall know that I have sent this commandment unto you, that mycovenantmight be with Levi, saith theLordof hosts. 5Mycovenantwas with him of life and peace; and I gave them to himforthe fear wherewith he feared me, and was afraid before my name. 6The law oftruthwas in his mouth, and iniquity was not found in his lips: he walked with me in peace and equity, and didturnmany away frominiquity. 7For the priestâs lips should keepknowledge, and they should seek thelawat his mouth: for heisthemessengerof theLordof hosts. 8But ye aredepartedout of the way; ye have caused many tostumbleat the law; ye havecorruptedthecovenantof Levi, saith theLordof hosts. 9Therefore have I also made youcontemptibleand base before all the people, according as ye have not kept my ways, but have been partial in the law. 10Have we not all onefather? hath not one Godcreatedus? why do we deal treacherously every man against his brother, byprofaningthe covenant of our fathers? 11Â¶Judah hath dealt treacherously, and an abomination is committed in Israel and in Jerusalem; for Judah hath profaned the holiness of theLordwhich he loved, and hathmarriedthe daughter of astrange god. 12TheLordwillcut offthe man that doeth this, the master and the scholar, out of the tabernacles of Jacob, and him that offereth an offering unto theLordof hosts. 13And this have ye done again, covering the altar of theLordwith tears, with weeping, and with crying out, insomuch that he regardeth not the offering any more, or receivethitwith good will at your hand. 14Â¶Yet ye say, Wherefore? Because theLordhath been witness between thee and thewifeof thy youth, against whom thou hast dealt treacherously: yetisshe thy companion, and the wife of thy covenant. 15And did not he makeone? Yet had he the residue of the spirit. And wherefore one? That he might seek agodlyseed. Therefore take heed to your spirit, and let none deal treacherously against thewifeof his youth. 16For theLord, the God of Israel, saith that he hatethputting away: foronecovereth violence with his garment, saith theLordof hosts: therefore take heed to your spirit, that ye deal not treacherously. 17Â¶Ye have wearied theLordwith your words. Yet ye say, Wherein have we weariedhim?When ye say, Every one that doethevilisgood in the sight of theLord, and he delighteth in them; or, Whereisthe God ofjudgment?"
    },
    {
      "reference": "Malachi 3",
      "title": "Malachi 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/mal/3?lang=eng",
      "summary": "The Lordâs messenger will prepare the way for the Second ComingâThe Lord will sit in judgmentâThe people of Israel are commanded to pay tithes and offeringsâThey keep a book of remembrance.",
      "verses": [
        "1Behold, I willsendmymessenger, and he shall prepare the way before me: and the Lord, whom ye seek, shall suddenlycometo histemple, even themessengerof the covenant, whom ye delight in: behold, he shall come, saith theLordof hosts.",
        "2But who mayabidethedayof hiscoming? and who shallstandwhen he appeareth? for heislike arefinerâsfire, and like fullersâsoap:",
        "3And he shall sitasarefinerand purifier of silver: and he shallpurifythesonsofLevi, and purge them as gold and silver, that they may offer unto theLordanofferingin righteousness.",
        "4Then shall the offering ofJudahand Jerusalem bepleasantunto theLord, as in the days of old, and as in former years.",
        "5And I will come near to you tojudgment; and I will be a swift witness against thesorcerers, and against theadulterers, and againstfalseswearers, and against those thatoppressthe hireling inhiswages, thewidow, and the fatherless, and that turn aside thestrangerfrom his right,and fear not me, saith theLordof hosts.",
        "6For IamtheLord, Ichange not; therefore ye sons ofJacobare notconsumed.",
        "7Â¶Even from the days of yourfathersye are gone away from mineordinances, and have not keptthem.Returnunto me, and I will return unto you, saith theLordof hosts. But ye said, Wherein shall we return?",
        "8Â¶Willa manrobGod? Yet ye have robbed me. But ye say, Wherein have we robbed thee? Intithesand offerings.",
        "9Yearecursedwith a curse: for ye have robbed me,eventhis whole nation.",
        "10Bring ye all thetithesinto the storehouse, that there may bemeatin mine house, andproveme now herewith, saith theLordof hosts, if I will notopenyou thewindows of heaven, and pour you out ablessing, thatthere shallnotbe roomenoughto receive it.",
        "11And I willrebukethedevourerfor your sakes, and he shall not destroy the fruits of your ground; neither shall your vine cast her fruit before the time in the field, saith theLordof hosts.",
        "12And all nations shall call you blessed: for ye shall be a delightsome land, saith theLordof hosts.",
        "13Â¶Your words have beenstoutagainst me, saith theLord. Yet ye say, What have we spokenso muchagainst thee?",
        "14Ye have said, Itisvainto serve God: and whatprofitis itthat we have kept his ordinance, and that we have walked mournfully before theLordof hosts?",
        "15And now we call theproudhappy; yea, they that workwickednessare set up; yea,they thattempt God are even delivered.",
        "16Â¶Then they that feared theLordspake often one to another: and theLordhearkened, and heardit,and abookofremembrancewas written before him for them that feared theLord, and that thought upon his name.",
        "17And they shall bemine, saith theLordof hosts, in that day when I make up myjewels; and I willsparethem, as a man spareth his own son that serveth him.",
        "18Then shall ye return, anddiscernbetween the righteous and the wicked, between him that serveth God and him that serveth him not."
      ],
      "full_text": "1Behold, I willsendmymessenger, and he shall prepare the way before me: and the Lord, whom ye seek, shall suddenlycometo histemple, even themessengerof the covenant, whom ye delight in: behold, he shall come, saith theLordof hosts. 2But who mayabidethedayof hiscoming? and who shallstandwhen he appeareth? for heislike arefinerâsfire, and like fullersâsoap: 3And he shall sitasarefinerand purifier of silver: and he shallpurifythesonsofLevi, and purge them as gold and silver, that they may offer unto theLordanofferingin righteousness. 4Then shall the offering ofJudahand Jerusalem bepleasantunto theLord, as in the days of old, and as in former years. 5And I will come near to you tojudgment; and I will be a swift witness against thesorcerers, and against theadulterers, and againstfalseswearers, and against those thatoppressthe hireling inhiswages, thewidow, and the fatherless, and that turn aside thestrangerfrom his right,and fear not me, saith theLordof hosts. 6For IamtheLord, Ichange not; therefore ye sons ofJacobare notconsumed. 7Â¶Even from the days of yourfathersye are gone away from mineordinances, and have not keptthem.Returnunto me, and I will return unto you, saith theLordof hosts. But ye said, Wherein shall we return? 8Â¶Willa manrobGod? Yet ye have robbed me. But ye say, Wherein have we robbed thee? Intithesand offerings. 9Yearecursedwith a curse: for ye have robbed me,eventhis whole nation. 10Bring ye all thetithesinto the storehouse, that there may bemeatin mine house, andproveme now herewith, saith theLordof hosts, if I will notopenyou thewindows of heaven, and pour you out ablessing, thatthere shallnotbe roomenoughto receive it. 11And I willrebukethedevourerfor your sakes, and he shall not destroy the fruits of your ground; neither shall your vine cast her fruit before the time in the field, saith theLordof hosts. 12And all nations shall call you blessed: for ye shall be a delightsome land, saith theLordof hosts. 13Â¶Your words have beenstoutagainst me, saith theLord. Yet ye say, What have we spokenso muchagainst thee? 14Ye have said, Itisvainto serve God: and whatprofitis itthat we have kept his ordinance, and that we have walked mournfully before theLordof hosts? 15And now we call theproudhappy; yea, they that workwickednessare set up; yea,they thattempt God are even delivered. 16Â¶Then they that feared theLordspake often one to another: and theLordhearkened, and heardit,and abookofremembrancewas written before him for them that feared theLord, and that thought upon his name. 17And they shall bemine, saith theLordof hosts, in that day when I make up myjewels; and I willsparethem, as a man spareth his own son that serveth him. 18Then shall ye return, anddiscernbetween the righteous and the wicked, between him that serveth God and him that serveth him not."
    },
    {
      "reference": "Malachi 4",
      "title": "Malachi 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/mal/4?lang=eng",
      "summary": "At the Second Coming, the proud and wicked will be burned as stubbleâElijah will return before that great and dreadful day.",
      "verses": [
        "1For, behold, thedaycometh, that shallburnas an oven; and all theproud, yea, and all that dowickedly, shall bestubble: and the day that cometh shall burn them up, saith theLordof hosts, that it shall leave them neither root norbranch.",
        "2Â¶But unto you that fear my name shall theSunof righteousnessarisewith healing in his wings; and ye shall go forth, and grow up as calves of thestall.",
        "3And ye shalltreaddown the wicked; for they shall be ashes under the soles of your feet in the day that I shall dothis,saith theLordof hosts.",
        "4Â¶Remember ye the law of Moses my servant, which Icommandedunto him inHorebfor all Israel,withthe statutes and judgments.",
        "5Â¶Behold, I willsendyouElijahthe prophetbeforethe coming of thegreatand dreadfuldayof theLord:",
        "6And he shallturntheheartof thefathersto thechildren, and the heart of thechildrento their fathers, lest I come andsmitetheearthwith acurse."
      ],
      "full_text": "1For, behold, thedaycometh, that shallburnas an oven; and all theproud, yea, and all that dowickedly, shall bestubble: and the day that cometh shall burn them up, saith theLordof hosts, that it shall leave them neither root norbranch. 2Â¶But unto you that fear my name shall theSunof righteousnessarisewith healing in his wings; and ye shall go forth, and grow up as calves of thestall. 3And ye shalltreaddown the wicked; for they shall be ashes under the soles of your feet in the day that I shall dothis,saith theLordof hosts. 4Â¶Remember ye the law of Moses my servant, which Icommandedunto him inHorebfor all Israel,withthe statutes and judgments. 5Â¶Behold, I willsendyouElijahthe prophetbeforethe coming of thegreatand dreadfuldayof theLord: 6And he shallturntheheartof thefathersto thechildren, and the heart of thechildrento their fathers, lest I come andsmitetheearthwith acurse."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:34:10",
  "metadata": {
    "week_number": 51,
    "title": "Week 51: December 14–20 - Malachi",
    "date_range": "December 14–20",
    "scraped_at": "2025-12-21T22:34:13.634547",
    "scraper_version": "2.0.0"
  }
}