{
  "week_number": 16,
  "date_range": "April 13–19",
  "title": "Week 16: April 13–19 - Exodus 14–18",
  "bundle_title": "Week 16: April 13–19: \"Week 16: April 13–19 - Exodus 14–18\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/16?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/16?lang=eng",
    "title": "Exodus 14–18",
    "scripture_references": "Exodus 14–18",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“April 13–19. ‘Stand Still, and See the Salvation of the Lord: Exodus 14–18,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“April 13–19. ‘Stand Still, and See the Salvation of the Lord,’”Come, Follow Me: Old Testament 2026\n\nApril 13–19: “Stand Still, and See the Salvation of the Lord”\n\nThe Israelites were trapped. The Red Sea was on one side, and the army of Pharaoh was advancing on the other. Their escape from Egypt, it seemed, would be short lived. But God had a message for the Israelites that He wanted them to remember for generations: “Fear ye not. … The Lord shall fight for you” (Exodus 14:13–14).\n\nSince that time, when God’s people have needed faith and courage, they have told this story. When Nephi wanted to inspire his brothers, he said, “Let us be strong like unto Moses; for he truly spake unto the waters of the Red Sea and they divided hither and thither, and our fathers came through, out of captivity, on dry ground” (1 Nephi 4:2). When King Limhi wanted his captive people to “lift up [their] heads, and rejoice,” he reminded them of this same story (Mosiah 7:19). So did Alma, when he wanted to testify to his son of God’s power (seeAlma 36:28). And when we feel trapped—when we need a little more faith to “see the salvation of the Lord”—we can remember how “the Lord saved Israel that day” (Exodus 14:13, 30).",
    "learning_at_home_church": [
      {
        "title": "The Lord can do a “great work” in my life.",
        "content": "As you readExodus 14:1–10, imagine how the Israelites might have felt as they saw Pharaoh’s army closing in. Perhaps you feel that you need a miracle to survive a difficult challenge you are facing. What do you find inExodus 14:13–31that inspires you to seek God’s power in your life? Ponder how you have seen His power in the past. What have you learned about Him from these experiences?\n\nExodus 15:1–19is a song of praise that the Israelites sang after the Lord parted the Red Sea. Which phrases in this song do you find especially meaningful? Maybe there’s a hymn that you feel like singing when the Lord has done something amazing for you, such as “Redeemer of Israel” (Hymns, no. 6). Consider singing or listening to it as part of your worship today.\n\nSee alsoDoctrine and Covenants 8:2–3.\n\nExodus 15:22–27;16:1–15;17:1–7"
      },
      {
        "title": "The Lord can make bitter things sweet.",
        "content": "Reading about Israel’s journey might lead you to think about things in your life that have seemed “bitter” like the waters of Marah (seeExodus 15:23–27). How has the Lord made bitter things in your life sweet? What value have these experiences had in your life?\n\nYou’ll notice more examples of bitter experiences for the Israelites inExodus 16and17. It’s tempting to be critical of their murmuring or complaining, but as you read, consider whether you have ever done the same thing. What do you learn from the Israelites’ experiences that can help you murmur less and trust God more? What do these verses teach you about God?\n\nSee also1 Nephi 2:11–12.\n\nThe Israelites gathering manna. Neo-gothic fresco, Trnava (detail)\n\nExodus 16"
      },
      {
        "title": "The Lord offers me daily spiritual nourishment.",
        "content": "Since we all need to eat, the Lord often compares spiritual things to food. Look for His spiritual lessons in the Israelites’ experiences with manna inExodus 16. For example, what do you find in the Lord’s instructions inExodus 16:16, 19, 22–26that applies to your spiritual nourishment?\n\nTo discover other lessons the Lord may want you to learn from this miracle, ponder questions like these:\n\nWhat does the Lord give me that is like the daily manna that He gave the Israelites?\n\nWhat can I do that is like gathering manna?\n\nYou may find additional insights in one or more of these videos: “Daily Bread: Pattern,” “Daily Bread: Experience,” and “Daily Bread: Change” (Gospel Library).\n\nDaily Bread: Pattern\n\nDaily Bread: Experience\n\nDaily Bread: Change\n\nThink of other things, besides eating, that you do every day. Why do certain things have to be done daily to be effective? What do you feel inspired to do to seek daily spiritual experiences?\n\nSee also Dieter F. Uchtdorf, “Daily Restoration,”Liahona, Nov. 2021, 77–79; “Daily Restoration” (video), Gospel Library.\n\nDaily Restoration\n\nExodus 17:1–7"
      },
      {
        "title": "Jesus Christ is my spiritual rock and living water.",
        "content": "Think about the Savior as you readExodus 17:1–7. How is Jesus Christ like a rock to you? (seePsalm 62:6–7;Helaman 5:12). How is He like water? (seeJohn 4:10–14;1 Corinthians 10:1–4;1 Nephi 11:25).\n\nLook for physical objects that testify of Christ.Whenever the scriptures describe things that could be symbols of Jesus Christ, likeExodus 17:1–7does, it might be an opportunity for an object lesson. Looking at or touching a rock or water can make it easier to understand how these objects are like Jesus Christ. If you can involve multiple senses in learning, it will be more memorable and impactful.\n\nExodus 17:8–16;18:13–26"
      },
      {
        "title": "Disciples help each other “bear the burden” of doing the Lord’s work.",
        "content": "There may be times in your life when you can relate to Moses—when others are depending on you, but your “hands [feel] heavy” (Exodus 17:12). Other times, you might be more like Aaron, Hur, and Jethro, who supported Moses. Put yourself in the position of each of these people as you readExodus 17:8–16;18:13–26, and see what the Lord teaches you about His work.\n\nSee alsoMosiah 4:27;18:8–9.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "The Lord can do a “great work” in my life.",
        "content": "When the Lord parted the Red Sea, Moses and the Israelites saw how powerful He is. Let your children help you think of a fun way to reenact the story fromExodus 14:5–22(see also “The Passover” inOld Testament Stories, 70–74). Maybe you could set up chairs or blankets and “divide” them like the Red Sea. Then you could share with each other how you have seen God’s power in your lives.\n\nThe Passover\n\nWhat doesDoctrine and Covenants 8:2–3add to our understanding of the story inExodus 14? Consider telling your children about an experience when the Holy Ghost told you something in your mind or heart, and invite them to talk about their experiences. You could also sing a song about the Holy Ghost, such as “Let the Holy Spirit Guide” (Hymns, no. 143).\n\nExodus 15:22–25"
      },
      {
        "title": "The Lord can make bitter things sweet.",
        "content": "Maybe you and your children could drink something sweet and something bitter while studyingExodus 15:22–25together. How has the Savior made “bitter” experiences in our lives “sweet”?\n\nExodus 15:23–25;16:14–15;17:1–6"
      },
      {
        "title": "Jesus is my Living Water, my Bread of Life, and my Rock.",
        "content": "As you and your children readExodus 15:23–25;16:14–15;17:1–6, let them help you find objects to help tell each story—like a branch (to heal the water at Marah), a jar or pot (to fill with manna), and a rock (for the water at Horeb). What do these stories remind us about what Jesus Christ does for us? As part of your discussion, you might readMatthew 7:24–27;John 4:10–14;6:29–35, 48–51;Helaman 5:12;Doctrine and Covenants 20:77, 79.\n\nOne Before God, by Joseph Brickey (detail)\n\nExodus 17:8–16;18:13–26"
      },
      {
        "title": "I can help “bear the burden” of doing the Lord’s work.",
        "content": "As you readExodus 17:8–16, you could invite a child to hold their hands high in the air. When the child gets tired, other children could help, the way Aaron and Hur helped Moses. What does this story teach about how we can help God’s kingdom be successful? You could also readExodus 18:13–26and talk about the heavy responsibilities of people who serve in your ward. What can we do today to help our Church leaders, just as Aaron and Hur helped the prophet Moses?\n\nFor more, see this month’s issue of theFriendmagazine.\n\nCrossing the Red Sea, by Otto Semler"
      }
    ],
    "study_helps": [],
    "raw_text": "April 13–19. “Stand Still, and See the Salvation of the Lord”: Exodus 14–18\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMarch 30–April 5\nEaster\nApril 6–12\nExodus 7–13\nApril 13–19\nExodus 14–18\nApril 20–26\nExodus 19–20; 24; 31–34\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nApril 13–19. “Stand Still, and See the Salvation of the Lord”: Exodus 14–18\n“April 13–19. ‘Stand Still, and See the Salvation of the Lord: Exodus 14–18,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“April 13–19. ‘Stand Still, and See the Salvation of the Lord,’”\nCome, Follow Me: Old Testament 2026\nApril 13–19: “Stand Still, and See the Salvation of the Lord”\nExodus 14–18\nThe Israelites were trapped. The Red Sea was on one side, and the army of Pharaoh was advancing on the other. Their escape from Egypt, it seemed, would be short lived. But God had a message for the Israelites that He wanted them to remember for generations: “Fear ye not. … The Lord shall fight for you” (\nExodus 14:13–14\n).\nSince that time, when God’s people have needed faith and courage, they have told this story. When Nephi wanted to inspire his brothers, he said, “Let us be strong like unto Moses; for he truly spake unto the waters of the Red Sea and they divided hither and thither, and our fathers came through, out of captivity, on dry ground” (\n1 Nephi 4:2\n). When King Limhi wanted his captive people to “lift up [their] heads, and rejoice,” he reminded them of this same story (\nMosiah 7:19\n). So did Alma, when he wanted to testify to his son of God’s power (see\nAlma 36:28\n). And when we feel trapped—when we need a little more faith to “see the salvation of the Lord”—we can remember how “the Lord saved Israel that day” (\nExodus 14:13, 30\n).\nIdeas for Learning at Home and at Church\nExodus 14\n;\nExodus 15:1–21\nThe Lord can do a “great work” in my life.\nAs you read\nExodus 14:1–10\n, imagine how the Israelites might have felt as they saw Pharaoh’s army closing in. Perhaps you feel that you need a miracle to survive a difficult challenge you are facing. What do you find in\nExodus 14:13–31\nthat inspires you to seek God’s power in your life? Ponder how you have seen His power in the past. What have you learned about Him from these experiences?\nExodus 15:1–19\nis a song of praise that the Israelites sang after the Lord parted the Red Sea. Which phrases in this song do you find especially meaningful? Maybe there’s a hymn that you feel like singing when the Lord has done something amazing for you, such as “\nRedeemer of Israel\n” (\nHymns\n, no. 6). Consider singing or listening to it as part of your worship today.\nSee also\nDoctrine and Covenants 8:2–3\n.\nExodus 15:22–27\n;\n16:1–15\n;\n17:1–7\nThe Lord can make bitter things sweet.\nReading about Israel’s journey might lead you to think about things in your life that have seemed “bitter” like the waters of Marah (see\nExodus 15:23–27\n). How has the Lord made bitter things in your life sweet? What value have these experiences had in your life?\nYou’ll notice more examples of bitter experiences for the Israelites in\nExodus 16\nand\n17\n. It’s tempting to be critical of their murmuring or complaining, but as you read, consider whether you have ever done the same thing. What do you learn from the Israelites’ experiences that can help you murmur less and trust God more? What do these verses teach you about God?\nSee also\n1 Nephi 2:11–12\n.\nThe Israelites gathering manna. Neo-gothic fresco, Trnava (detail)\nExodus 16\nThe Lord offers me daily spiritual nourishment.\nSince we all need to eat, the Lord often compares spiritual things to food. Look for His spiritual lessons in the Israelites’ experiences with manna in\nExodus 16\n. For example, what do you find in the Lord’s instructions in\nExodus 16:16, 19, 22–26\nthat applies to your spiritual nourishment?\nTo discover other lessons the Lord may want you to learn from this miracle, ponder questions like these:\nWhat does the Lord give me that is like the daily manna that He gave the Israelites?\nWhat can I do that is like gathering manna?\nYou may find additional insights in one or more of these videos: “Daily Bread: Pattern,” “Daily Bread: Experience,” and “Daily Bread: Change” (Gospel Library).\n2:52\nDaily Bread: Pattern\n3:12\nDaily Bread: Experience\n3:0\nDaily Bread: Change\nThink of other things, besides eating, that you do every day. Why do certain things have to be done daily to be effective? What do you feel inspired to do to seek daily spiritual experiences?\nSee also Dieter F. Uchtdorf, “\nDaily Restoration\n,”\nLiahona\n, Nov. 2021, 77–79; “Daily Restoration” (video), Gospel Library.\n5:27\nDaily Restoration\nExodus 17:1–7\nJesus Christ is my spiritual rock and living water.\nThink about the Savior as you read\nExodus 17:1–7\n. How is Jesus Christ like a rock to you? (see\nPsalm 62:6–7\n;\nHelaman 5:12\n). How is He like water? (see\nJohn 4:10–14\n;\n1 Corinthians 10:1–4\n;\n1 Nephi 11:25\n).\nLook for physical objects that testify of Christ.\nWhenever the scriptures describe things that could be symbols of Jesus Christ, like\nExodus 17:1–7\ndoes, it might be an opportunity for an object lesson. Looking at or touching a rock or water can make it easier to understand how these objects are like Jesus Christ. If you can involve multiple senses in learning, it will be more memorable and impactful.\nExodus 17:8–16\n;\n18:13–26\nDisciples help each other “bear the burden” of doing the Lord’s work.\nThere may be times in your life when you can relate to Moses—when others are depending on you, but your “hands [feel] heavy” (\nExodus 17:12\n). Other times, you might be more like Aaron, Hur, and Jethro, who supported Moses. Put yourself in the position of each of these people as you read\nExodus 17:8–16\n;\n18:13–26\n, and see what the Lord teaches you about His work.\nSee also\nMosiah 4:27\n;\n18:8–9\n.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat was the purpose of the pillar of cloud and fire?\nWhat was symbolic about Israel’s crossing of the Red Sea?\nWhy did the Lord command Moses to destroy the Amalekites?\nClick to see more.\nIdeas for Teaching Children\nExodus 14:5–22\nThe Lord can do a “great work” in my life.\nWhen the Lord parted the Red Sea, Moses and the Israelites saw how powerful He is. Let your children help you think of a fun way to reenact the story from\nExodus 14:5–22\n(see also “\nThe Passover\n” in\nOld Testament Stories\n, 70–74). Maybe you could set up chairs or blankets and “divide” them like the Red Sea. Then you could share with each other how you have seen God’s power in your lives.\n2:54\nThe Passover\nWhat does\nDoctrine and Covenants 8:2–3\nadd to our understanding of the story in\nExodus 14\n? Consider telling your children about an experience when the Holy Ghost told you something in your mind or heart, and invite them to talk about their experiences. You could also sing a song about the Holy Ghost, such as “\nLet the Holy Spirit Guide\n” (\nHymns\n, no. 143).\nExodus 15:22–25\nThe Lord can make bitter things sweet.\nMaybe you and your children could drink something sweet and something bitter while studying\nExodus 15:22–25\ntogether. How has the Savior made “bitter” experiences in our lives “sweet”?\nExodus 15:23–25\n;\n16:14–15\n;\n17:1–6\nJesus is my Living Water, my Bread of Life, and my Rock.\nAs you and your children read\nExodus 15:23–25\n;\n16:14–15\n;\n17:1–6\n, let them help you find objects to help tell each story—like a branch (to heal the water at Marah), a jar or pot (to fill with manna), and a rock (for the water at Horeb). What do these stories remind us about what Jesus Christ does for us? As part of your discussion, you might read\nMatthew 7:24–27\n;\nJohn 4:10–14\n;\n6:29–35, 48–51\n;\nHelaman 5:12\n;\nDoctrine and Covenants 20:77, 79\n.\nOne Before God\n, by Joseph Brickey (detail)\nExodus 17:8–16\n;\n18:13–26\nI can help “bear the burden” of doing the Lord’s work.\nAs you read\nExodus 17:8–16\n, you could invite a child to hold their hands high in the air. When the child gets tired, other children could help, the way Aaron and Hur helped Moses. What does this story teach about how we can help God’s kingdom be successful? You could also read\nExodus 18:13–26\nand talk about the heavy responsibilities of people who serve in your ward. What can we do today to help our Church leaders, just as Aaron and Hur helped the prophet Moses?\nFor more, see this month’s issue of the\nFriend\nmagazine.\nCrossing the Red Sea\n, by Otto Semler"
  },
  "scripture_content": [
    {
      "reference": "Exodus 14",
      "title": "Exodus 14",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/14?lang=eng",
      "summary": "Israel goes out of EgyptâIsrael passes through the Red Sea on dry groundâThe Lord overthrows the Egyptians in the midst of the sea.",
      "verses": [
        "1And theLordspake unto Moses, saying,",
        "2Speak unto the children of Israel, that theyturnand encamp before Pi-hahiroth, betweenMigdoland the sea, over against Baal-zephon: before it shall ye encamp by the sea.",
        "3For Pharaoh will say of the children of Israel, Theyareentangled in the land, the wilderness hath shut them in.",
        "4AndI will harden Pharaohâs heart, that he shall follow after them; and I will be honoureduponPharaoh, and upon all hishost; that the Egyptians mayknowthat IamtheLord. And they did so.",
        "5Â¶And it was told the king of Egypt that the people fled: and the heart of Pharaoh and of his servants was turned against the people, and they said, Why have we done this, that we have let Israel go from serving us?",
        "6And he made ready his chariot, and took his people with him:",
        "7And he took six hundred chosenchariots, andall the chariotsof Egypt, and captains over every one of them.",
        "8AndtheLordhardened the heart of Pharaoh king of Egypt, and he pursued after the children of Israel: and the children of Israel went outwithanhighhand.",
        "9But the Egyptianspursuedafter them, all the horsesandchariots of Pharaoh, and his horsemen, and his army, and overtook them encamping by the sea, besidePi-hahiroth, before Baal-zephon.",
        "10Â¶And when Pharaoh drew nigh,the children of Israel lifted up their eyes, and, behold, the Egyptians marched after them; and they were sore afraid: and the children of Israel cried out unto theLord.",
        "11And they said unto Moses, Becausethere wereno graves in Egypt, hast thou taken us away todiein the wilderness? wherefore hast thoudealtthus with us, to carry us forth out of Egypt?",
        "12Isnot this thewordthat we did tell thee in Egypt, saying, Let us alone, that we may serve the Egyptians? Forit had beenbetter for us toservethe Egyptians, than that we should die in the wilderness.",
        "13Â¶And Moses said unto the people, Fear ye not, stand still, and see the salvation of theLord, which he willshew to youto day: for the Egyptians whom ye have seen to day, ye shall see them again no more for ever.",
        "14TheLordshallfightfor you, and ye shall hold yourpeace.",
        "15Â¶And theLordsaid unto Moses, Wherefore criest thou unto me? speak unto the children of Israel, that they go forward:",
        "16But lift thou up thyrod, and stretch out thine hand over the sea, anddivideit: and the children of Israel shall go ondrygroundthrough the midst of the sea.",
        "17AndI, behold, I willhardenthe hearts of the Egyptians, and they shall follow them: andIwill get me honour upon Pharaoh, and upon all his host, upon his chariots, and upon his horsemen.",
        "18And the Egyptians shall know that IamtheLord, when I have gotten me honour upon Pharaoh, upon his chariots, and upon his horsemen.",
        "19Â¶And theangelof God, which went before the camp of Israel, removed and went behind them; and thepillarof the cloud went from before their face, and stood behind them:",
        "20And it came between the camp of the Egyptians and the camp of Israel;andit was a cloud anddarknessto them,but it gave light by nightto these:so that the one came not near the other all the night.",
        "21And Moses stretched out his hand over thesea; and theLordcausedtheseatogobackby a strong east wind all that night, and made the seadryland,and thewatersweredivided.",
        "22And the children of Israel went into the midst of the sea upon the dryground:and the waterswerea wall unto them on their right hand, and on their left.",
        "23Â¶And the Egyptians pursued, and went in after them to the midst of the sea,evenall Pharaohâs horses, his chariots, and his horsemen.",
        "24And it came to pass, that in the morning watch theLordlooked unto the host of the Egyptians through the pillar of fire and of the cloud, and troubled the host of the Egyptians,",
        "25Andtookoff their chariot wheels, that they drave them heavily: so that the Egyptians said,Let us flee from the face of Israel; for theLordfighteth for them against the Egyptians.",
        "26Â¶And theLordsaid unto Moses, Stretch out thinehandover the sea, that the waters may come again upon the Egyptians, upon their chariots, and upon their horsemen.",
        "27And Moses stretched forth his hand over the sea, and the sea returned tohis strengthwhen the morning appeared; and the Egyptians fledagainst it; and theLordoverthrew theEgyptiansin the midst of the sea.",
        "28And thewatersreturned, andcoveredthe chariots, and the horsemen,andall the host of Pharaoh that came into theseaafter them; there remained not so much asoneof them.",
        "29But the children of Israel walked upondrylandin the midst of the sea; and the waterswerea wall unto them on their right hand, and on their left.",
        "30Thus theLordsavedIsrael that day out of the hand of the Egyptians; and Israel saw the Egyptians dead upon the sea shore.",
        "31And Israel saw that great work which theLorddid upon the Egyptians: and the people feared theLord, andbelievedtheLord, and his servant Moses."
      ],
      "full_text": "1And theLordspake unto Moses, saying, 2Speak unto the children of Israel, that theyturnand encamp before Pi-hahiroth, betweenMigdoland the sea, over against Baal-zephon: before it shall ye encamp by the sea. 3For Pharaoh will say of the children of Israel, Theyareentangled in the land, the wilderness hath shut them in. 4AndI will harden Pharaohâs heart, that he shall follow after them; and I will be honoureduponPharaoh, and upon all hishost; that the Egyptians mayknowthat IamtheLord. And they did so. 5Â¶And it was told the king of Egypt that the people fled: and the heart of Pharaoh and of his servants was turned against the people, and they said, Why have we done this, that we have let Israel go from serving us? 6And he made ready his chariot, and took his people with him: 7And he took six hundred chosenchariots, andall the chariotsof Egypt, and captains over every one of them. 8AndtheLordhardened the heart of Pharaoh king of Egypt, and he pursued after the children of Israel: and the children of Israel went outwithanhighhand. 9But the Egyptianspursuedafter them, all the horsesandchariots of Pharaoh, and his horsemen, and his army, and overtook them encamping by the sea, besidePi-hahiroth, before Baal-zephon. 10Â¶And when Pharaoh drew nigh,the children of Israel lifted up their eyes, and, behold, the Egyptians marched after them; and they were sore afraid: and the children of Israel cried out unto theLord. 11And they said unto Moses, Becausethere wereno graves in Egypt, hast thou taken us away todiein the wilderness? wherefore hast thoudealtthus with us, to carry us forth out of Egypt? 12Isnot this thewordthat we did tell thee in Egypt, saying, Let us alone, that we may serve the Egyptians? Forit had beenbetter for us toservethe Egyptians, than that we should die in the wilderness. 13Â¶And Moses said unto the people, Fear ye not, stand still, and see the salvation of theLord, which he willshew to youto day: for the Egyptians whom ye have seen to day, ye shall see them again no more for ever. 14TheLordshallfightfor you, and ye shall hold yourpeace. 15Â¶And theLordsaid unto Moses, Wherefore criest thou unto me? speak unto the children of Israel, that they go forward: 16But lift thou up thyrod, and stretch out thine hand over the sea, anddivideit: and the children of Israel shall go ondrygroundthrough the midst of the sea. 17AndI, behold, I willhardenthe hearts of the Egyptians, and they shall follow them: andIwill get me honour upon Pharaoh, and upon all his host, upon his chariots, and upon his horsemen. 18And the Egyptians shall know that IamtheLord, when I have gotten me honour upon Pharaoh, upon his chariots, and upon his horsemen. 19Â¶And theangelof God, which went before the camp of Israel, removed and went behind them; and thepillarof the cloud went from before their face, and stood behind them: 20And it came between the camp of the Egyptians and the camp of Israel;andit was a cloud anddarknessto them,but it gave light by nightto these:so that the one came not near the other all the night. 21And Moses stretched out his hand over thesea; and theLordcausedtheseatogobackby a strong east wind all that night, and made the seadryland,and thewatersweredivided. 22And the children of Israel went into the midst of the sea upon the dryground:and the waterswerea wall unto them on their right hand, and on their left. 23Â¶And the Egyptians pursued, and went in after them to the midst of the sea,evenall Pharaohâs horses, his chariots, and his horsemen. 24And it came to pass, that in the morning watch theLordlooked unto the host of the Egyptians through the pillar of fire and of the cloud, and troubled the host of the Egyptians, 25Andtookoff their chariot wheels, that they drave them heavily: so that the Egyptians said,Let us flee from the face of Israel; for theLordfighteth for them against the Egyptians. 26Â¶And theLordsaid unto Moses, Stretch out thinehandover the sea, that the waters may come again upon the Egyptians, upon their chariots, and upon their horsemen. 27And Moses stretched forth his hand over the sea, and the sea returned tohis strengthwhen the morning appeared; and the Egyptians fledagainst it; and theLordoverthrew theEgyptiansin the midst of the sea. 28And thewatersreturned, andcoveredthe chariots, and the horsemen,andall the host of Pharaoh that came into theseaafter them; there remained not so much asoneof them. 29But the children of Israel walked upondrylandin the midst of the sea; and the waterswerea wall unto them on their right hand, and on their left. 30Thus theLordsavedIsrael that day out of the hand of the Egyptians; and Israel saw the Egyptians dead upon the sea shore. 31And Israel saw that great work which theLorddid upon the Egyptians: and the people feared theLord, andbelievedtheLord, and his servant Moses."
    },
    {
      "reference": "Exodus 15",
      "title": "Exodus 15",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/15?lang=eng",
      "summary": "The children of Israel sing the song of MosesâThey extol the Lord as a man of war and rejoice in their deliverance from EgyptâThe waters of Marah are healedâThe Lord promises to free Israel from the diseases of Egypt.",
      "verses": [
        "1ThensangMoses and the children of Israel this song unto theLord, and spake, saying, I willsingunto theLord, for he hath triumphed gloriously: the horse and his rider hath he thrown into the sea.",
        "2TheLordismystrengthand song, and he is become mysalvation: heismy God, and I willprepare him an habitation; my fatherâs God, and I willexalthim.",
        "3TheLordisa man ofwar: theLordishisname.",
        "4Pharaohâschariotsand his host hath hecastinto the sea: his chosen captains also are drowned in theRed sea.",
        "5The depths have covered them: they sank into the bottom as astone.",
        "6Thyrighthand, OLord, is become glorious in power: thy right hand, OLord, hath dashed in pieces the enemy.",
        "7And in the greatness of thine excellency thou hast overthrown them that rose up against thee: thou sentest forth thy wrath,whichconsumed them asstubble.",
        "8And with the blast of thy nostrils thewaterswere gathered together, the floods stood upright as anheap,andthe depths were congealed in the heart of the sea.",
        "9The enemy said, I willpursue, I will overtake, I will divide the spoil; mylustshall be satisfied upon them; I will draw my sword, my hand shall destroy them.",
        "10Thou didst blow with thy wind, the sea covered them: they sank as lead in the mighty waters.",
        "11Whoislikeunto thee, OLord, among the gods? whoislike thee, glorious inholiness,fearfulinpraises, doing wonders?",
        "12Thou stretchedst out thy right hand, the earth swallowed them.",
        "13Thou in thy mercy hastledforth the peoplewhichthou hast redeemed: thou hast guidedthemin thy strength unto thy holy habitation.",
        "14The people shallhear,andbe afraid: sorrow shall take hold on the inhabitants ofPalestina.",
        "15Then thedukesofEdomshall be amazed; the mighty men of Moab, trembling shall take hold upon them; all the inhabitants of Canaan shallmeltaway.",
        "16Fearanddreadshall fall upon them; by the greatness of thine arm they shall beasstill as a stone; till thy people pass over, OLord, till the people pass over,whichthou hastpurchased.",
        "17Thou shalt bring them in, and plant them in the mountain of thine inheritance,inthe place, OLord,whichthou hast made for thee to dwell in,intheSanctuary, O Lord,whichthy hands have established.",
        "18TheLordshall reign for ever and ever.",
        "19For the horse of Pharaoh went in with his chariots and with his horsemen into the sea, and theLordbrought again the waters of the sea upon them; but the children of Israel went on drylandin the midst of the sea.",
        "20Â¶AndMiriamtheprophetess, thesisterof Aaron, took atimbrelin her hand; and all the women went out after her with timbrels and with dances.",
        "21And Miriam answered them,Singye to theLord, for he hath triumphed gloriously; the horse and his rider hath he thrown into the sea.",
        "22So Moses brought Israel from the Red sea, and they went out into the wilderness ofShur; and they went three days in the wilderness, and found no water.",
        "23Â¶And when they came toMarah, they could not drink of the waters of Marah, for theywerebitter: therefore the name of it was called Marah.",
        "24And the peoplemurmuredagainst Moses, saying, What shall we drink?",
        "25And he cried unto theLord; and theLordshewed him a tree,whichwhen he had cast into the waters, thewaterswere made sweet: there he made for them a statute and an ordinance, and there heprovedthem,",
        "26And said, If thou wiltdiligentlyhearkento the voice of theLordthy God, and wilt do that which is right in his sight, and wilt give ear to his commandments, andkeepall his statutes, I will put none of thesediseasesupon thee, which I have brought upon the Egyptians: for IamtheLordthathealeththee.",
        "27Â¶And they came to Elim, whereweretwelve wells of water, andthreescore and tenpalm trees: and they encamped there by the waters."
      ],
      "full_text": "1ThensangMoses and the children of Israel this song unto theLord, and spake, saying, I willsingunto theLord, for he hath triumphed gloriously: the horse and his rider hath he thrown into the sea. 2TheLordismystrengthand song, and he is become mysalvation: heismy God, and I willprepare him an habitation; my fatherâs God, and I willexalthim. 3TheLordisa man ofwar: theLordishisname. 4Pharaohâschariotsand his host hath hecastinto the sea: his chosen captains also are drowned in theRed sea. 5The depths have covered them: they sank into the bottom as astone. 6Thyrighthand, OLord, is become glorious in power: thy right hand, OLord, hath dashed in pieces the enemy. 7And in the greatness of thine excellency thou hast overthrown them that rose up against thee: thou sentest forth thy wrath,whichconsumed them asstubble. 8And with the blast of thy nostrils thewaterswere gathered together, the floods stood upright as anheap,andthe depths were congealed in the heart of the sea. 9The enemy said, I willpursue, I will overtake, I will divide the spoil; mylustshall be satisfied upon them; I will draw my sword, my hand shall destroy them. 10Thou didst blow with thy wind, the sea covered them: they sank as lead in the mighty waters. 11Whoislikeunto thee, OLord, among the gods? whoislike thee, glorious inholiness,fearfulinpraises, doing wonders? 12Thou stretchedst out thy right hand, the earth swallowed them. 13Thou in thy mercy hastledforth the peoplewhichthou hast redeemed: thou hast guidedthemin thy strength unto thy holy habitation. 14The people shallhear,andbe afraid: sorrow shall take hold on the inhabitants ofPalestina. 15Then thedukesofEdomshall be amazed; the mighty men of Moab, trembling shall take hold upon them; all the inhabitants of Canaan shallmeltaway. 16Fearanddreadshall fall upon them; by the greatness of thine arm they shall beasstill as a stone; till thy people pass over, OLord, till the people pass over,whichthou hastpurchased. 17Thou shalt bring them in, and plant them in the mountain of thine inheritance,inthe place, OLord,whichthou hast made for thee to dwell in,intheSanctuary, O Lord,whichthy hands have established. 18TheLordshall reign for ever and ever. 19For the horse of Pharaoh went in with his chariots and with his horsemen into the sea, and theLordbrought again the waters of the sea upon them; but the children of Israel went on drylandin the midst of the sea. 20Â¶AndMiriamtheprophetess, thesisterof Aaron, took atimbrelin her hand; and all the women went out after her with timbrels and with dances. 21And Miriam answered them,Singye to theLord, for he hath triumphed gloriously; the horse and his rider hath he thrown into the sea. 22So Moses brought Israel from the Red sea, and they went out into the wilderness ofShur; and they went three days in the wilderness, and found no water. 23Â¶And when they came toMarah, they could not drink of the waters of Marah, for theywerebitter: therefore the name of it was called Marah. 24And the peoplemurmuredagainst Moses, saying, What shall we drink? 25And he cried unto theLord; and theLordshewed him a tree,whichwhen he had cast into the waters, thewaterswere made sweet: there he made for them a statute and an ordinance, and there heprovedthem, 26And said, If thou wiltdiligentlyhearkento the voice of theLordthy God, and wilt do that which is right in his sight, and wilt give ear to his commandments, andkeepall his statutes, I will put none of thesediseasesupon thee, which I have brought upon the Egyptians: for IamtheLordthathealeththee. 27Â¶And they came to Elim, whereweretwelve wells of water, andthreescore and tenpalm trees: and they encamped there by the waters."
    },
    {
      "reference": "Exodus 16",
      "title": "Exodus 16",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/16?lang=eng",
      "summary": "Israel murmurs for want of bread and lusts for the fleshpots of EgyptâThe Lord rains bread from heaven and sends quail for meatâIsrael is given manna each day, except the Sabbath, for forty years.",
      "verses": [
        "1And they took their journey from Elim, and all the congregation of the children of Israel came unto the wilderness of Sin, whichisbetween Elim and Sinai, on the fifteenth day of the second month after their departing out of the land of Egypt.",
        "2And the whole congregation of the children of Israelmurmuredagainst Moses and Aaron in the wilderness:",
        "3And the children of Israel said unto them, Would to God we had died by the hand of theLordin the land of Egypt, when we sat by theflesh pots,andwhen we did eat bread to the full; for ye have brought us forth into this wilderness, to kill this whole assembly withhunger.",
        "4Â¶Then said theLordunto Moses, Behold, I will rainbreadfrom heaven for you; and the people shall go out and gather a certainrateevery day, that I mayprovethem, whether they willwalkin my law, or no.",
        "5And it shall come to pass, that on the sixth day they shall preparethatwhich they bring in; and it shall be twice as much as they gather daily.",
        "6And Moses and Aaron said unto all the children of Israel, At even, then ye shall know that theLordhath brought you out from the land of Egypt:",
        "7And in the morning, then ye shall see thegloryof theLord; for that he heareth your murmurings against theLord: and whatarewe, that ye murmur against us?",
        "8And Moses said,This shall be,when theLordshall give you in the evening flesh to eat, and in the morning bread to the full; for that theLordheareth your murmurings which ye murmur against him: and whatarewe? yourmurmuringsarenot against us, butagainsttheLord.",
        "9Â¶And Mosesspakeunto Aaron, Say unto all the congregation of the children of Israel, Come near before theLord: for he hath heard your murmurings.",
        "10And it came to pass, as Aaron spake unto the whole congregation of the children of Israel, that they looked toward the wilderness, and, behold, thegloryof theLordappeared in thecloud.",
        "11Â¶And theLordspake unto Moses, saying,",
        "12I have heard themurmuringsof the children of Israel: speak unto them, saying, At even ye shall eat flesh, and in the morning ye shall be filled with bread; and ye shall know that IamtheLordyour God.",
        "13And it came to pass, that at even thequailscame up, and covered the camp: and in the morning the dew lay round about thehost.",
        "14And when the dew that lay was gone up, behold, upon the face of the wildernessthere laya smallroundthing,assmall as the hoar frost on the ground.",
        "15And when the children of Israel sawit,they said one to another,Itismanna: for they wist not what itwas.And Moses said unto them, Thisisthebreadwhich theLordhath given you to eat.",
        "16Â¶Thisisthe thing which theLordhath commanded, Gather of it every manaccordingtohis eating, anomerfor every man,according tothe number of your persons; take ye every man forthemwhicharein his tents.",
        "17And the children of Israel did so, and gathered, some more, some less.",
        "18And when they did meteitwith an omer, he thatgatheredmuch had nothing over, and he that gathered little had no lack; they gathered every man according to his eating.",
        "19And Moses said, Let no man leave of it till the morning.",
        "20Notwithstanding theyhearkenednot unto Moses; but some of them left of it until the morning, and it bred worms, and stank: and Moses was wroth with them.",
        "21And they gathered it every morning, every man according to his eating: and when the sunwaxedhot, it melted.",
        "22Â¶And it came to pass,thaton the sixth day they gathered twice as much bread, two omers for oneman:and all the rulers of thecongregationcame and told Moses.",
        "23And he said unto them, Thisis thatwhich theLordhath said, To morrowisthe rest of the holysabbathunto theLord:bakethatwhich ye will baketo day,andseethethat ye will seethe; and that which remaineth over lay up for you to be kept until the morning.",
        "24And they laid it up till the morning, as Moses bade: and it did not stink, neither was there any worm therein.",
        "25And Moses said, Eat that to day; for to dayisa sabbath unto theLord: to day ye shall not find it in the field.",
        "26Six days ye shall gather it; but on the seventh day,which isthe sabbath, in it there shall be none.",
        "27Â¶And it came to pass,thatthere went outsomeof the people on the seventh day for to gather, and they found none.",
        "28And theLordsaid unto Moses, How long refuse ye tokeepmy commandments and my laws?",
        "29See, for that theLordhath given you the sabbath, therefore he giveth you on the sixth day the bread of two days; abide ye every man in his place, let no man go out of his place on the seventh day.",
        "30So the people rested on the seventh day.",
        "31And the house of Israel called the name thereof Manna: and itwaslikecorianderseed, white; and the taste of itwaslike wafersmadewith honey.",
        "32Â¶And Moses said, Thisisthe thing which theLordcommandeth, Fill an omer of it to be kept for yourgenerations; that they may see the bread wherewith I have fed you in the wilderness, when I brought you forth from the land of Egypt.",
        "33And Moses said unto Aaron, Take apot, and put an omer full of manna therein, and lay it up before theLord, to be kept for your generations.",
        "34As theLordcommanded Moses, so Aaron laid it up before theTestimony, to be kept.",
        "35And the children of Israel did eatmannaforty years, until they came to a land inhabited; they did eat manna, until they came unto the borders of the land of Canaan.",
        "36Now anomeristhe tenthpartof an ephah."
      ],
      "full_text": "1And they took their journey from Elim, and all the congregation of the children of Israel came unto the wilderness of Sin, whichisbetween Elim and Sinai, on the fifteenth day of the second month after their departing out of the land of Egypt. 2And the whole congregation of the children of Israelmurmuredagainst Moses and Aaron in the wilderness: 3And the children of Israel said unto them, Would to God we had died by the hand of theLordin the land of Egypt, when we sat by theflesh pots,andwhen we did eat bread to the full; for ye have brought us forth into this wilderness, to kill this whole assembly withhunger. 4Â¶Then said theLordunto Moses, Behold, I will rainbreadfrom heaven for you; and the people shall go out and gather a certainrateevery day, that I mayprovethem, whether they willwalkin my law, or no. 5And it shall come to pass, that on the sixth day they shall preparethatwhich they bring in; and it shall be twice as much as they gather daily. 6And Moses and Aaron said unto all the children of Israel, At even, then ye shall know that theLordhath brought you out from the land of Egypt: 7And in the morning, then ye shall see thegloryof theLord; for that he heareth your murmurings against theLord: and whatarewe, that ye murmur against us? 8And Moses said,This shall be,when theLordshall give you in the evening flesh to eat, and in the morning bread to the full; for that theLordheareth your murmurings which ye murmur against him: and whatarewe? yourmurmuringsarenot against us, butagainsttheLord. 9Â¶And Mosesspakeunto Aaron, Say unto all the congregation of the children of Israel, Come near before theLord: for he hath heard your murmurings. 10And it came to pass, as Aaron spake unto the whole congregation of the children of Israel, that they looked toward the wilderness, and, behold, thegloryof theLordappeared in thecloud. 11Â¶And theLordspake unto Moses, saying, 12I have heard themurmuringsof the children of Israel: speak unto them, saying, At even ye shall eat flesh, and in the morning ye shall be filled with bread; and ye shall know that IamtheLordyour God. 13And it came to pass, that at even thequailscame up, and covered the camp: and in the morning the dew lay round about thehost. 14And when the dew that lay was gone up, behold, upon the face of the wildernessthere laya smallroundthing,assmall as the hoar frost on the ground. 15And when the children of Israel sawit,they said one to another,Itismanna: for they wist not what itwas.And Moses said unto them, Thisisthebreadwhich theLordhath given you to eat. 16Â¶Thisisthe thing which theLordhath commanded, Gather of it every manaccordingtohis eating, anomerfor every man,according tothe number of your persons; take ye every man forthemwhicharein his tents. 17And the children of Israel did so, and gathered, some more, some less. 18And when they did meteitwith an omer, he thatgatheredmuch had nothing over, and he that gathered little had no lack; they gathered every man according to his eating. 19And Moses said, Let no man leave of it till the morning. 20Notwithstanding theyhearkenednot unto Moses; but some of them left of it until the morning, and it bred worms, and stank: and Moses was wroth with them. 21And they gathered it every morning, every man according to his eating: and when the sunwaxedhot, it melted. 22Â¶And it came to pass,thaton the sixth day they gathered twice as much bread, two omers for oneman:and all the rulers of thecongregationcame and told Moses. 23And he said unto them, Thisis thatwhich theLordhath said, To morrowisthe rest of the holysabbathunto theLord:bakethatwhich ye will baketo day,andseethethat ye will seethe; and that which remaineth over lay up for you to be kept until the morning. 24And they laid it up till the morning, as Moses bade: and it did not stink, neither was there any worm therein. 25And Moses said, Eat that to day; for to dayisa sabbath unto theLord: to day ye shall not find it in the field. 26Six days ye shall gather it; but on the seventh day,which isthe sabbath, in it there shall be none. 27Â¶And it came to pass,thatthere went outsomeof the people on the seventh day for to gather, and they found none. 28And theLordsaid unto Moses, How long refuse ye tokeepmy commandments and my laws? 29See, for that theLordhath given you the sabbath, therefore he giveth you on the sixth day the bread of two days; abide ye every man in his place, let no man go out of his place on the seventh day. 30So the people rested on the seventh day. 31And the house of Israel called the name thereof Manna: and itwaslikecorianderseed, white; and the taste of itwaslike wafersmadewith honey. 32Â¶And Moses said, Thisisthe thing which theLordcommandeth, Fill an omer of it to be kept for yourgenerations; that they may see the bread wherewith I have fed you in the wilderness, when I brought you forth from the land of Egypt. 33And Moses said unto Aaron, Take apot, and put an omer full of manna therein, and lay it up before theLord, to be kept for your generations. 34As theLordcommanded Moses, so Aaron laid it up before theTestimony, to be kept. 35And the children of Israel did eatmannaforty years, until they came to a land inhabited; they did eat manna, until they came unto the borders of the land of Canaan. 36Now anomeristhe tenthpartof an ephah."
    },
    {
      "reference": "Exodus 17",
      "title": "Exodus 17",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/17?lang=eng",
      "summary": "Israel murmurs for want of waterâMoses smites a rock in Horeb, and water gushes forthâAaron and Hur uphold Mosesâ hands so that Joshua prevails against Amalek.",
      "verses": [
        "1And all the congregation of the children of Israel journeyed from the wilderness ofSin, after their journeys, according to the commandment of theLord, andpitchedin Rephidim: andthere wasno water for the people to drink.",
        "2Wherefore the peopledid chide withMoses, and said, Give us water that we may drink. And Moses said unto them, Why chide ye with me? wherefore do yetempt theLord?",
        "3And the people thirsted there for water; and the peoplemurmuredagainst Moses, and said, Whereforeisthisthatthou hast brought us up out of Egypt, to kill us and our children and our cattle with thirst?",
        "4And Moses cried unto theLord, saying, What shall I do unto this people? they be almost ready to stone me.",
        "5And theLordsaid unto Moses, Go on before the people, and take with thee of the elders of Israel; and thyrod,wherewiththou smotest the river, take in thine hand, and go.",
        "6Behold, I will stand before thee there upon the rock in Horeb; and thou shaltsmitetherock, and there shall comewaterout of it, that the people may drink. And Moses did so in the sight of the elders of Israel.",
        "7And he called the name of the placeMassah, andMeribah, because of thechidingof the children of Israel, and because they tempted theLord, saying, Is theLordamong us, or not?",
        "8Â¶Then cameAmalek, and fought with Israel in Rephidim.",
        "9And Moses said untoJoshua, Choose us out men, and go out, fight with Amalek: to morrow I will stand on the top of the hill with therodof God in mine hand.",
        "10So Joshua did as Moses had said to him, and fought with Amalek: and Moses, Aaron, and Hur went up to the top of the hill.",
        "11And it came to pass, when Moses held up his hand, that Israel prevailed: and when he let down his hand, Amalek prevailed.",
        "12But Mosesâ handswereheavy; and they took a stone, and putitunder him, and he sat thereon; and Aaron and Hurstayed uphis hands, the one on the one side, and the other on the other side; and his hands were steady until the going down of the sun.",
        "13And JoshuadiscomfitedAmalek and his people with the edge of the sword.",
        "14And theLordsaid unto Moses, Write thisfora memorial in abook, and rehearseitin the ears of Joshua: for I will utterly put out the remembrance ofAmalekfrom under heaven.",
        "15And Moses built an altar, and called the name of itJehovah-nissi:",
        "16For he said,BecausetheLordhath swornthattheLordwill havewar with Amalek from generation to generation."
      ],
      "full_text": "1And all the congregation of the children of Israel journeyed from the wilderness ofSin, after their journeys, according to the commandment of theLord, andpitchedin Rephidim: andthere wasno water for the people to drink. 2Wherefore the peopledid chide withMoses, and said, Give us water that we may drink. And Moses said unto them, Why chide ye with me? wherefore do yetempt theLord? 3And the people thirsted there for water; and the peoplemurmuredagainst Moses, and said, Whereforeisthisthatthou hast brought us up out of Egypt, to kill us and our children and our cattle with thirst? 4And Moses cried unto theLord, saying, What shall I do unto this people? they be almost ready to stone me. 5And theLordsaid unto Moses, Go on before the people, and take with thee of the elders of Israel; and thyrod,wherewiththou smotest the river, take in thine hand, and go. 6Behold, I will stand before thee there upon the rock in Horeb; and thou shaltsmitetherock, and there shall comewaterout of it, that the people may drink. And Moses did so in the sight of the elders of Israel. 7And he called the name of the placeMassah, andMeribah, because of thechidingof the children of Israel, and because they tempted theLord, saying, Is theLordamong us, or not? 8Â¶Then cameAmalek, and fought with Israel in Rephidim. 9And Moses said untoJoshua, Choose us out men, and go out, fight with Amalek: to morrow I will stand on the top of the hill with therodof God in mine hand. 10So Joshua did as Moses had said to him, and fought with Amalek: and Moses, Aaron, and Hur went up to the top of the hill. 11And it came to pass, when Moses held up his hand, that Israel prevailed: and when he let down his hand, Amalek prevailed. 12But Mosesâ handswereheavy; and they took a stone, and putitunder him, and he sat thereon; and Aaron and Hurstayed uphis hands, the one on the one side, and the other on the other side; and his hands were steady until the going down of the sun. 13And JoshuadiscomfitedAmalek and his people with the edge of the sword. 14And theLordsaid unto Moses, Write thisfora memorial in abook, and rehearseitin the ears of Joshua: for I will utterly put out the remembrance ofAmalekfrom under heaven. 15And Moses built an altar, and called the name of itJehovah-nissi: 16For he said,BecausetheLordhath swornthattheLordwill havewar with Amalek from generation to generation."
    },
    {
      "reference": "Exodus 18",
      "title": "Exodus 18",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/18?lang=eng",
      "summary": "Jethro comes to Moses bringing Mosesâ wife and sons and offers sacrifices to the LordâMoses sits in the judgment seat and hears all casesâJethro counsels Moses to teach the law, to appoint lesser judges, and to delegate power to them.",
      "verses": [
        "1WhenJethro, thepriestofMidian, Mosesâ father in law, heard of all thatGodhad done for Moses, and for Israel his people,andthat theLordhad brought Israel out of Egypt;",
        "2Then Jethro, Mosesâ father in law, tookZipporah, Mosesâ wife, after he had sent her back,",
        "3And her twosons; of which the name of the onewasGershom; for he said,Ihave been an alien in a strange land:",
        "4And the name of the otherwasEliezer; for the God of my father,said he, wasmine help, and delivered me from the sword of Pharaoh:",
        "5And Jethro, Mosesâ father in law, came with his sons and his wife unto Moses into the wilderness, where he encamped at themount of God:",
        "6And hesaidunto Moses, I thy father in law Jethro am come unto thee, and thy wife, and her two sons with her.",
        "7Â¶And Moses went out to meet his father in law, and did obeisance, and kissed him; and they asked each other oftheirwelfare; and they came into the tent.",
        "8And Moses told his father in law all that theLordhad done unto Pharaoh and to the Egyptians for Israelâs sake,andall the travail that had come upon them by the way, andhowtheLorddelivered them.",
        "9And Jethro rejoiced for all the goodness which theLordhad done to Israel, whom he had delivered out of the hand of the Egyptians.",
        "10And Jethro said, BlessedbetheLord, who hath delivered you out of the hand of the Egyptians, and out of the hand of Pharaoh, who hath delivered the people from under the hand of the Egyptians.",
        "11Now I know that theLordisgreater than all gods: for in the thing wherein they dealtproudlyhe wasabove them.",
        "12And Jethro, Mosesâ father in law, took a burnt offering and sacrifices for God: and Aaron came, and all the elders of Israel, to eatbreadwith Mosesâ father in law before God.",
        "13Â¶And it came to pass on the morrow, that Moses sat tojudgethe people: and the people stood by Moses from the morning unto the evening.",
        "14And when Mosesâ father in law saw all that he did to the people, he said, Whatisthis thing that thou doest to the people? why sittest thou thyself alone, and all the people stand by thee from morning unto even?",
        "15And Moses said unto his father in law, Because the people come unto me toinquireof God:",
        "16When they have amatter, they come unto me; and I judge between one and another, and I do makethemknow the statutes of God, and his laws.",
        "17And Mosesâ father in law said unto him, The thing that thou doestisnot good.",
        "18Thou wilt surely wear away, both thou, and this people thatiswith thee: for this thingistooheavy for thee; thou art not able to perform it thyself alone.",
        "19Hearken now unto my voice, I will give thee counsel, and God shall be with thee:Bethou for the people toGod-ward, that thou mayest bring the causes unto God:",
        "20And thou shaltteachthemordinancesandlaws, and shalt shew them thewaywherein they mustwalk, and the work that they must do.",
        "21Moreover thou shalt provide out of all the peopleablemen, such asfearGod,men of truth, hatingcovetousness; and placesuchover them,to berulersof thousands,andrulers ofhundreds, rulers of fifties, and rulers of tens:",
        "22And let themjudgethe people at all seasons: and it shall be,thatevery great matter they shall bring unto thee, but every small matter they shall judge: so shall it be easier for thyself, and they shall beartheburdenwith thee.",
        "23If thou shalt do this thing, and God command theeso,then thou shalt be able to endure, and all this people shall also go to their place in peace.",
        "24So Moses hearkened to the voice of his father in law, and did all that he had said.",
        "25And Moses chose able men out of all Israel, and made themheadsover the people, rulers of thousands, rulers of hundreds, rulers of fifties, and rulers of tens.",
        "26And they judged the people at all seasons: the hard causes they brought unto Moses, but every small matter they judged themselves.",
        "27Â¶And Moses let his father in law depart; and he went his way into his own land."
      ],
      "full_text": "1WhenJethro, thepriestofMidian, Mosesâ father in law, heard of all thatGodhad done for Moses, and for Israel his people,andthat theLordhad brought Israel out of Egypt; 2Then Jethro, Mosesâ father in law, tookZipporah, Mosesâ wife, after he had sent her back, 3And her twosons; of which the name of the onewasGershom; for he said,Ihave been an alien in a strange land: 4And the name of the otherwasEliezer; for the God of my father,said he, wasmine help, and delivered me from the sword of Pharaoh: 5And Jethro, Mosesâ father in law, came with his sons and his wife unto Moses into the wilderness, where he encamped at themount of God: 6And hesaidunto Moses, I thy father in law Jethro am come unto thee, and thy wife, and her two sons with her. 7Â¶And Moses went out to meet his father in law, and did obeisance, and kissed him; and they asked each other oftheirwelfare; and they came into the tent. 8And Moses told his father in law all that theLordhad done unto Pharaoh and to the Egyptians for Israelâs sake,andall the travail that had come upon them by the way, andhowtheLorddelivered them. 9And Jethro rejoiced for all the goodness which theLordhad done to Israel, whom he had delivered out of the hand of the Egyptians. 10And Jethro said, BlessedbetheLord, who hath delivered you out of the hand of the Egyptians, and out of the hand of Pharaoh, who hath delivered the people from under the hand of the Egyptians. 11Now I know that theLordisgreater than all gods: for in the thing wherein they dealtproudlyhe wasabove them. 12And Jethro, Mosesâ father in law, took a burnt offering and sacrifices for God: and Aaron came, and all the elders of Israel, to eatbreadwith Mosesâ father in law before God. 13Â¶And it came to pass on the morrow, that Moses sat tojudgethe people: and the people stood by Moses from the morning unto the evening. 14And when Mosesâ father in law saw all that he did to the people, he said, Whatisthis thing that thou doest to the people? why sittest thou thyself alone, and all the people stand by thee from morning unto even? 15And Moses said unto his father in law, Because the people come unto me toinquireof God: 16When they have amatter, they come unto me; and I judge between one and another, and I do makethemknow the statutes of God, and his laws. 17And Mosesâ father in law said unto him, The thing that thou doestisnot good. 18Thou wilt surely wear away, both thou, and this people thatiswith thee: for this thingistooheavy for thee; thou art not able to perform it thyself alone. 19Hearken now unto my voice, I will give thee counsel, and God shall be with thee:Bethou for the people toGod-ward, that thou mayest bring the causes unto God: 20And thou shaltteachthemordinancesandlaws, and shalt shew them thewaywherein they mustwalk, and the work that they must do. 21Moreover thou shalt provide out of all the peopleablemen, such asfearGod,men of truth, hatingcovetousness; and placesuchover them,to berulersof thousands,andrulers ofhundreds, rulers of fifties, and rulers of tens: 22And let themjudgethe people at all seasons: and it shall be,thatevery great matter they shall bring unto thee, but every small matter they shall judge: so shall it be easier for thyself, and they shall beartheburdenwith thee. 23If thou shalt do this thing, and God command theeso,then thou shalt be able to endure, and all this people shall also go to their place in peace. 24So Moses hearkened to the voice of his father in law, and did all that he had said. 25And Moses chose able men out of all Israel, and made themheadsover the people, rulers of thousands, rulers of hundreds, rulers of fifties, and rulers of tens. 26And they judged the people at all seasons: the hard causes they brought unto Moses, but every small matter they judged themselves. 27Â¶And Moses let his father in law depart; and he went his way into his own land."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:28:04",
  "metadata": {
    "week_number": 16,
    "title": "Week 16: April 13–19 - Exodus 14–18",
    "date_range": "April 13–19",
    "scraped_at": "2025-12-21T22:28:08.069029",
    "scraper_version": "2.0.0"
  }
}