{
  "week_number": 20,
  "date_range": "May 11–17",
  "title": "Week 20: May 11–17 - Deuteronomy 6–8; 15; 18; 29–30; 34",
  "bundle_title": "Week 20: May 11–17: \"Week 20: May 11–17 - Deuteronomy 6–8; 15; 18; 29–30; 34\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/20?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/20?lang=eng",
    "title": "Deuteronomy 6–8;15;18;29–30;34",
    "scripture_references": "Deuteronomy 6–8; 15; 18; 29–30; 34",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“May 11–17. ‘Beware Lest Thou Forget the Lord’: Deuteronomy 6–8; 15; 18; 29–30; 34,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“May 11–17. ‘Beware Lest Thou Forget the Lord,’”Come, Follow Me: Old Testament 2026\n\nMoses on Mount Nebo, by John Steel, © Providence Collection/licensed fromgoodsalt.com\n\nMoses’s earthly ministry began on a mountain, when God spoke to him from a burning bush (seeExodus 3:1–10). It also ended on a mountain, more than 40 years later, when God gave him a glimpse of the promised land from the top of Mount Nebo (seeDeuteronomy 34:1–4). Moses had spent his life preparing the children of Israel to enter that promised land, and the book of Deuteronomy records his final instructions, reminders, exhortations, and pleadings with the Israelites. Reading his words makes it clear that the real object of Moses’s ministry—the preparation the people needed—wasn’t about wilderness survival, conquering enemies, or building a nation. It was about learning to love God, obey Him, and remain loyal to Him. That’s the preparation we all need to enter the promised land of eternal life. So although Moses never set foot in the “land flowing with milk and honey” (Exodus 3:8), because of his faith and faithfulness, he did enter the promised land that God has prepared for all those who follow Him.\n\nFor an overview of Deuteronomy, see “Deuteronomy” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "“Love the Lord thy God with all thine heart.”",
        "content": "The law of Moses included many outward ceremonies and rituals. As you’ll see in Moses’s counsel in Deuteronomy, the Lord was also concerned about His people’s inward state—the spiritual condition of their hearts.\n\nIn the passages below, look for the wordheart, and ponder what it might symbolize. You might think of these passages as a kind of spiritual checkup on your heart. What diagnosis would you give yourself? What treatments would you prescribe to improve the spiritual health of your heart? Write down your impressions:\n\nDeuteronomy 6:4–7:\n\nDeuteronomy 8:2–5:\n\nDeuteronomy 8:11–17:\n\nDeuteronomy 29:18–20:\n\nDeuteronomy 30:6–10:\n\nDeuteronomy 30:14–20:\n\nOne way to organize your thoughts could be to draw a heart and write inside it things that the Lord says you should have in your heart. Then you could write outside it things that you should keep out of your heart.\n\nHow do you show that you love God with all your heart? For ideas, see “Love God, love your neighbor” inFor the Strength of Youth: A Guide for Making Choices, 10–12.\n\nSee also M. Russell Ballard, “Lovest Thou Me More Than These?,”Liahona, Nov. 2021, 51–53.\n\nSeek your own spiritual insights.Come, Follow Mesuggests passages and principles to focus on in the scriptures, but don’t let that limit your study. As you read Deuteronomy, you might discover a principle that is not highlighted here. Let the Spirit guide you to what you need to learn.\n\nDeuteronomy 6:4–12, 20–25"
      },
      {
        "title": "“Beware lest thou forget the Lord.”",
        "content": "Most of the Israelites who would enter the promised land had not seen the plagues in Egypt or crossed the Red Sea. Moses knew that they—and future generations—would need to remember God’s miracles and God’s laws to remain God’s people.\n\nWhat counsel do you find inDeuteronomy 6:4–12, 20–25that could help you remember the great things God has done for you? What are you inspired to do so that the word of the Lord will daily “be in thine heart”? (verse 6).\n\nYou might also study Brother Jan E. Newman’s message “Preserving the Voice of the Covenant People in the Rising Generation” (Liahona, Nov. 2023, 36–38) and consider how you will pass your faith in Christ to future generations.\n\nSee alsoDeuteronomy 11:18–21; Dale G. Renlund, “Consider the Goodness and Greatness of God,”EnsignorLiahona, May 2020, 41–44; Bible Dictionary, “Frontlets or phylacteries.”\n\nDeuteronomy 15:1–15"
      },
      {
        "title": "Helping people in need involves generous hands and willing hearts.",
        "content": "We haven’t yet arrived at the day “when there shall be no poor among you” (Deuteronomy 15:4), so the principles about helping the poor inDeuteronomy 15are still valuable, even if the particular practices have changed. Notice whatverses 1–15teach about why we help people in need and what our attitude should be about it.\n\nWhat does it mean to “open thine hand wide” to people in need? (verses 8, 11). What do you learn from the Lord’s example about helping people in need? (seeverse 15).\n\nSee also “Have I Done Any Good?,”Hymns, no. 223.\n\nDeuteronomy 18:15–19"
      },
      {
        "title": "Moses was “like unto” Jesus Christ.",
        "content": "Peter, Nephi, Moroni, and the Savior Himself all commented on the prophecy inDeuteronomy 18:15–19(seeActs 3:20–23;1 Nephi 22:20–21;Joseph Smith—History 1:40;3 Nephi 20:23). What do you learn about the Savior from these verses? Think about what you’ve read about Moses over the past few weeks. How is Moses “like unto” Jesus Christ?\n\nJesus Christ told His people in ancient America, “I am he of whom the prophet Moses spake” (3 Nephi 20:23).\n\nDeuteronomy 29:9;30:15–20"
      },
      {
        "title": "The Lord invites me to choose between good and evil.",
        "content": "It might be interesting to compare Moses’s words inDeuteronomy 29:9;30:15–20with some of Lehi’s final teachings to his family in2 Nephi 2:26–29;4:4. How did Lehi expand on what Moses taught? What do you find in these passages that inspires you to “choose life”? (Deuteronomy 30:19)."
      }
    ],
    "teaching_children": [
      {
        "title": "I can love God with all my heart.",
        "content": "To help your children understandDeuteronomy 6:5, you could draw a heart, an outline of a body, and a strong arm. Your children could point to the pictures as you read the words “heart,” “soul,” and “might” in the verse. How do we show the Lord that we love Him with all our heart, soul, and might?\n\nDeuteronomy 6:6–15"
      },
      {
        "title": "I can keep the word of God in my heart.",
        "content": "Read with your children the Lord’s counsel to the Israelites to put scripture passages where they would see them every day (seeDeuteronomy 6:6–9). This might inspire you and your children to think of ways to make sure you don’t “forget the Lord” (verse 12) and to remember what He has done for you.\n\nYou might point out thatDeuteronomy 6:13, 16and8:3helped the Savior during an important moment in His life. To see how, read togetherMatthew 4:1–10. Then you could share with each other some scripture passages that have helped you in times of need.\n\nDeuteronomy 18:15–18"
      },
      {
        "title": "Prophets teach us about Jesus Christ.",
        "content": "As you readDeuteronomy 18:18together, help your children understand that the Prophet like Moses in this verse is Jesus Christ. Maybe you could look at pictures of things Moses did and things Jesus Christ did, and let your children match them (seeGospel Art Book,nos. 15,16,38,39). What has our prophet today taught us about the Savior?\n\nDeuteronomy 29:12–13;30:8–10"
      },
      {
        "title": "Because of my covenants, I am part of God’s people.",
        "content": "Talking aboutDeuteronomy 29:12–13provides an opportunity for you and your children to talk about covenants they will make or have made with Heavenly Father. What does it mean to be God’s people? How do our promises make us God’s people? (seeverse 13; see alsoMosiah 18:8–10).\n\nIf your children need help understanding what a covenant is, suggest that they find a definition in “Covenant” in the Guide to the Scriptures (Gospel Library). What promises did God and the Israelites make with each other inDeuteronomy 30:8–10? What promises have we made with God? (seeDoctrine and Covenants 20:37, 77). How do these promises connect us with Him? Consider singing together a song about covenants, such as “Standing on the Promises” (Gospel Library).\n\nFor more, see this month’s issue of theFriendmagazine.\n\nThe Lord Shewed Him All the Land, by Walter Rane"
      }
    ],
    "study_helps": [],
    "raw_text": "May 11–17. “Beware Lest Thou Forget the Lord”: Deuteronomy 6–8; 15; 18; 29–30; 34\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nThoughts to Keep in Mind\nThe Tabernacle and Sacrifice\nApril 27–May 3\nExodus 35–40; Leviticus 1; 4; 16; 19\nMay 4–10\nNumbers 11–14; 20–24; 27\nMay 11–17\nDeuteronomy 6–8; 15; 18; 29–30; 34\nThoughts to Keep in Mind\nThe Historical Books in the Old Testament\nMay 18–24\nJoshua 1–8; 23–24\nMay 25–31\nJudges 2–4; 6–8; 13–16\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nMay 11–17. “Beware Lest Thou Forget the Lord”: Deuteronomy 6–8; 15; 18; 29–30; 34\n“May 11–17. ‘Beware Lest Thou Forget the Lord’: Deuteronomy 6–8; 15; 18; 29–30; 34,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“May 11–17. ‘Beware Lest Thou Forget the Lord,’”\nCome, Follow Me: Old Testament 2026\nMoses on Mount Nebo\n, by John Steel, © Providence Collection/licensed from\ngoodsalt.com\nMay 11–17: “Beware Lest Thou Forget the Lord”\nDeuteronomy 6–8\n;\n15\n;\n18\n;\n29–30\n;\n34\nMoses’s earthly ministry began on a mountain, when God spoke to him from a burning bush (see\nExodus 3:1–10\n). It also ended on a mountain, more than 40 years later, when God gave him a glimpse of the promised land from the top of Mount Nebo (see\nDeuteronomy 34:1–4\n). Moses had spent his life preparing the children of Israel to enter that promised land, and the book of Deuteronomy records his final instructions, reminders, exhortations, and pleadings with the Israelites. Reading his words makes it clear that the real object of Moses’s ministry—the preparation the people needed—wasn’t about wilderness survival, conquering enemies, or building a nation. It was about learning to love God, obey Him, and remain loyal to Him. That’s the preparation we all need to enter the promised land of eternal life. So although Moses never set foot in the “land flowing with milk and honey” (\nExodus 3:8\n), because of his faith and faithfulness, he did enter the promised land that God has prepared for all those who follow Him.\nFor an overview of Deuteronomy, see “\nDeuteronomy\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nDeuteronomy 6:4–7\n;\n8:2–5, 11–17\n;\n29:18–20\n;\n30:6–10, 14–20\n“Love the Lord thy God with all thine heart.”\nThe law of Moses included many outward ceremonies and rituals. As you’ll see in Moses’s counsel in Deuteronomy, the Lord was also concerned about His people’s inward state—the spiritual condition of their hearts.\nIn the passages below, look for the word\nheart\n, and ponder what it might symbolize. You might think of these passages as a kind of spiritual checkup on your heart. What diagnosis would you give yourself? What treatments would you prescribe to improve the spiritual health of your heart? Write down your impressions:\nDeuteronomy 6:4–7\n:\nDeuteronomy 8:2–5\n:\nDeuteronomy 8:11–17\n:\nDeuteronomy 29:18–20\n:\nDeuteronomy 30:6–10\n:\nDeuteronomy 30:14–20\n:\nOne way to organize your thoughts could be to draw a heart and write inside it things that the Lord says you should have in your heart. Then you could write outside it things that you should keep out of your heart.\nHow do you show that you love God with all your heart? For ideas, see “\nLove God, love your neighbor\n” in\nFor the Strength of Youth: A Guide for Making Choices\n, 10–12.\nSee also M. Russell Ballard, “\nLovest Thou Me More Than These?\n,”\nLiahona\n, Nov. 2021, 51–53.\nSeek your own spiritual insights.\nCome, Follow Me\nsuggests passages and principles to focus on in the scriptures, but don’t let that limit your study. As you read Deuteronomy, you might discover a principle that is not highlighted here. Let the Spirit guide you to what you need to learn.\nDeuteronomy 6:4–12, 20–25\n“Beware lest thou forget the Lord.”\nMost of the Israelites who would enter the promised land had not seen the plagues in Egypt or crossed the Red Sea. Moses knew that they—and future generations—would need to remember God’s miracles and God’s laws to remain God’s people.\nWhat counsel do you find in\nDeuteronomy 6:4–12, 20–25\nthat could help you remember the great things God has done for you? What are you inspired to do so that the word of the Lord will daily “be in thine heart”? (\nverse 6\n).\nYou might also study Brother Jan E. Newman’s message “\nPreserving the Voice of the Covenant People in the Rising Generation\n” (\nLiahona\n, Nov. 2023, 36–38) and consider how you will pass your faith in Christ to future generations.\nSee also\nDeuteronomy 11:18–21\n; Dale G. Renlund, “\nConsider the Goodness and Greatness of God\n,”\nEnsign\nor\nLiahona\n, May 2020, 41–44; Bible Dictionary, “\nFrontlets or phylacteries\n.”\nDeuteronomy 15:1–15\nHelping people in need involves generous hands and willing hearts.\nWe haven’t yet arrived at the day “when there shall be no poor among you” (\nDeuteronomy 15:4\n), so the principles about helping the poor in\nDeuteronomy 15\nare still valuable, even if the particular practices have changed. Notice what\nverses 1–15\nteach about why we help people in need and what our attitude should be about it.\nWhat does it mean to “open thine hand wide” to people in need? (\nverses 8, 11\n). What do you learn from the Lord’s example about helping people in need? (see\nverse 15\n).\nSee also “\nHave I Done Any Good?\n,”\nHymns\n, no. 223.\nDeuteronomy 18:15–19\nMoses was “like unto” Jesus Christ.\nPeter, Nephi, Moroni, and the Savior Himself all commented on the prophecy in\nDeuteronomy 18:15–19\n(see\nActs 3:20–23\n;\n1 Nephi 22:20–21\n;\nJoseph Smith—History 1:40\n;\n3 Nephi 20:23\n). What do you learn about the Savior from these verses? Think about what you’ve read about Moses over the past few weeks. How is Moses “like unto” Jesus Christ?\nJesus Christ told His people in ancient America, “I am he of whom the prophet Moses spake” (\n3 Nephi 20:23\n).\nDeuteronomy 29:9\n;\n30:15–20\nThe Lord invites me to choose between good and evil.\nIt might be interesting to compare Moses’s words in\nDeuteronomy 29:9\n;\n30:15–20\nwith some of Lehi’s final teachings to his family in\n2 Nephi 2:26–29\n;\n4:4\n. How did Lehi expand on what Moses taught? What do you find in these passages that inspires you to “choose life”? (\nDeuteronomy 30:19\n).\nStudy Helps\nHow did the Israelites follow Moses’s instructions to remember the Lord?\nWhy did the Lord command Israel to destroy the Canaanites?\nWhat happened to Moses at the end of his life?\nClick to see more.\nIdeas for Teaching Children\nDeuteronomy 6:5\nI can love God with all my heart.\nTo help your children understand\nDeuteronomy 6:5\n, you could draw a heart, an outline of a body, and a strong arm. Your children could point to the pictures as you read the words “heart,” “soul,” and “might” in the verse. How do we show the Lord that we love Him with all our heart, soul, and might?\nDeuteronomy 6:6–15\nI can keep the word of God in my heart.\nRead with your children the Lord’s counsel to the Israelites to put scripture passages where they would see them every day (see\nDeuteronomy 6:6–9\n). This might inspire you and your children to think of ways to make sure you don’t “forget the Lord” (\nverse 12\n) and to remember what He has done for you.\nYou might point out that\nDeuteronomy 6:13, 16\nand\n8:3\nhelped the Savior during an important moment in His life. To see how, read together\nMatthew 4:1–10\n. Then you could share with each other some scripture passages that have helped you in times of need.\nDeuteronomy 18:15–18\nProphets teach us about Jesus Christ.\nAs you read\nDeuteronomy 18:18\ntogether, help your children understand that the Prophet like Moses in this verse is Jesus Christ. Maybe you could look at pictures of things Moses did and things Jesus Christ did, and let your children match them (see\nGospel Art Book\n,\nnos. 15\n,\n16\n,\n38\n,\n39\n). What has our prophet today taught us about the Savior?\nDeuteronomy 29:12–13\n;\n30:8–10\nBecause of my covenants, I am part of God’s people.\nTalking about\nDeuteronomy 29:12–13\nprovides an opportunity for you and your children to talk about covenants they will make or have made with Heavenly Father. What does it mean to be God’s people? How do our promises make us God’s people? (see\nverse 13\n; see also\nMosiah 18:8–10\n).\nIf your children need help understanding what a covenant is, suggest that they find a definition in “\nCovenant\n” in the Guide to the Scriptures (Gospel Library). What promises did God and the Israelites make with each other in\nDeuteronomy 30:8–10\n? What promises have we made with God? (see\nDoctrine and Covenants 20:37, 77\n). How do these promises connect us with Him? Consider singing together a song about covenants, such as “Standing on the Promises” (Gospel Library).\nFor more, see this month’s issue of the\nFriend\nmagazine.\nThe Lord Shewed Him All the Land\n, by Walter Rane\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Deuteronomy 6",
      "title": "Deuteronomy 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/deut/6?lang=eng",
      "summary": "Moses proclaims, The Lord our God is one Lord, and, Thou shalt love the Lord thy GodâThe children of Israel are commanded to teach their childrenâMoses exhorts them to keep the commandments, testimonies, and statutes of the Lord that they may prosper.",
      "verses": [
        "1Now thesearethe commandments, thestatutes, and thejudgments, which theLordyour God commanded to teach you, that ye might dothemin the land whither ye go to possess it:",
        "2That thou mightest fear theLordthy God, to keep all his statutes and his commandments, which I command thee, thou, and thy son, and thy sonâs son, all the days of thy life; and that thy days may beprolonged.",
        "3Â¶Hear therefore, O Israel, andobserveto doit;that it may be well with thee, and that ye may increase mightily, as theLordGod of thy fathers hath promised thee, in the land that floweth with milk and honey.",
        "4Hear, O Israel: TheLordour GodisoneLord:",
        "5And thou shaltlovetheLordthy God with all thineheart, and with all thy soul, and with all thymight.",
        "6And thesewords, which I command thee this day, shall be in thineheart:",
        "7And thou shaltteachthem diligently unto thy children, and shalttalkof them when thou sittest in thine house, and when thou walkest by the way, and when thou liest down, and when thou risest up.",
        "8And thou shaltbindthem for asignupon thine hand, and they shall be asfrontletsbetween thine eyes.",
        "9And thou shalt write them upon thepostsof thy house, and on thy gates.",
        "10And it shall be, when theLordthy God shall have brought thee into the land which he sware unto thy fathers, to Abraham, to Isaac, and to Jacob, to give thee great and goodly cities, which thou buildedst not,",
        "11And houses full of all goodthings,which thou filledst not, and wells digged, which thou diggedst not, vineyards and olive trees, which thou plantedst not; when thou shalt have eaten and be full;",
        "12Thenbeware lest thouforgettheLord, which brought thee forth out of the land of Egypt, from the house of bondage.",
        "13Thou shaltfeartheLordthy God, andservehim, and shaltswearby his name.",
        "14Ye shall not go afterothergods, of the gods of the people whichareround about you;",
        "15(For theLordthy GodisajealousGod among you) lest theangerof theLordthy God be kindled against thee, and destroy thee from off the face of the earth.",
        "16Â¶Ye shall nottempttheLordyour God, as ye temptedhimin Massah.",
        "17Ye shalldiligentlykeep thecommandmentsof theLordyour God, and his testimonies, and his statutes, which he hath commanded thee.",
        "18And thou shalt dothat which isrightand good in the sight of theLord: that it may be well with thee, and that thou mayest go in and possess the good land which theLordswareunto thy fathers,",
        "19Tocast outall thine enemies from before thee, as theLordhath spoken.",
        "20Andwhen thy sonaskeththee in time to come, saying, Whatmeanthetestimonies, and the statutes, and the judgments, which theLordour God hath commanded you?",
        "21Then thou shalt say unto thyson, We were Pharaohâs bondmen in Egypt; and theLordbrought us out of Egypt with a mighty hand:",
        "22And theLordshewed signs and wonders, great andsore, upon Egypt, upon Pharaoh, and upon all his household, before our eyes:",
        "23And he brought us out from thence, that he might bring us in, togive us the land which he sware unto our fathers.",
        "24And theLordcommandedus to do all these statutes, tofeartheLordour God, for ourgoodalways, that he mightpreserveus alive, asit isat this day.",
        "25And it shall be ourrighteousness, if weobserveto do all these commandments before theLordour God, as he hath commanded us."
      ],
      "full_text": "1Now thesearethe commandments, thestatutes, and thejudgments, which theLordyour God commanded to teach you, that ye might dothemin the land whither ye go to possess it: 2That thou mightest fear theLordthy God, to keep all his statutes and his commandments, which I command thee, thou, and thy son, and thy sonâs son, all the days of thy life; and that thy days may beprolonged. 3Â¶Hear therefore, O Israel, andobserveto doit;that it may be well with thee, and that ye may increase mightily, as theLordGod of thy fathers hath promised thee, in the land that floweth with milk and honey. 4Hear, O Israel: TheLordour GodisoneLord: 5And thou shaltlovetheLordthy God with all thineheart, and with all thy soul, and with all thymight. 6And thesewords, which I command thee this day, shall be in thineheart: 7And thou shaltteachthem diligently unto thy children, and shalttalkof them when thou sittest in thine house, and when thou walkest by the way, and when thou liest down, and when thou risest up. 8And thou shaltbindthem for asignupon thine hand, and they shall be asfrontletsbetween thine eyes. 9And thou shalt write them upon thepostsof thy house, and on thy gates. 10And it shall be, when theLordthy God shall have brought thee into the land which he sware unto thy fathers, to Abraham, to Isaac, and to Jacob, to give thee great and goodly cities, which thou buildedst not, 11And houses full of all goodthings,which thou filledst not, and wells digged, which thou diggedst not, vineyards and olive trees, which thou plantedst not; when thou shalt have eaten and be full; 12Thenbeware lest thouforgettheLord, which brought thee forth out of the land of Egypt, from the house of bondage. 13Thou shaltfeartheLordthy God, andservehim, and shaltswearby his name. 14Ye shall not go afterothergods, of the gods of the people whichareround about you; 15(For theLordthy GodisajealousGod among you) lest theangerof theLordthy God be kindled against thee, and destroy thee from off the face of the earth. 16Â¶Ye shall nottempttheLordyour God, as ye temptedhimin Massah. 17Ye shalldiligentlykeep thecommandmentsof theLordyour God, and his testimonies, and his statutes, which he hath commanded thee. 18And thou shalt dothat which isrightand good in the sight of theLord: that it may be well with thee, and that thou mayest go in and possess the good land which theLordswareunto thy fathers, 19Tocast outall thine enemies from before thee, as theLordhath spoken. 20Andwhen thy sonaskeththee in time to come, saying, Whatmeanthetestimonies, and the statutes, and the judgments, which theLordour God hath commanded you? 21Then thou shalt say unto thyson, We were Pharaohâs bondmen in Egypt; and theLordbrought us out of Egypt with a mighty hand: 22And theLordshewed signs and wonders, great andsore, upon Egypt, upon Pharaoh, and upon all his household, before our eyes: 23And he brought us out from thence, that he might bring us in, togive us the land which he sware unto our fathers. 24And theLordcommandedus to do all these statutes, tofeartheLordour God, for ourgoodalways, that he mightpreserveus alive, asit isat this day. 25And it shall be ourrighteousness, if weobserveto do all these commandments before theLordour God, as he hath commanded us."
    },
    {
      "reference": "Deuteronomy 7",
      "title": "Deuteronomy 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/deut/7?lang=eng",
      "summary": "Israel is to destroy the seven nations of CanaanâMarriages with them are forbidden lest apostasy resultâIsrael has a mission as a holy and chosen peopleâThe Lord shows mercy unto those who love Him and keep His commandmentsâHe promises to remove sickness from the children of Israel if they obey.",
      "verses": [
        "1When theLordthy God shall bring thee into the land whither thou goest to possess it, and hath cast out many nations before thee, the Hittites, and the Girgashites, and the Amorites, and the Canaanites, and the Perizzites, and the Hivites, and the Jebusites, sevennationsgreater and mightier than thou;",
        "2And when theLordthy God shall deliver them before thee; thou shalt smite them,andutterlydestroythem; thou shaltmakenocovenantwith them, nor shew mercy unto them:",
        "3Neither shalt thou makemarriageswith them; thy daughter thou shalt not give unto his son, nor his daughter shalt thou take unto thy son.",
        "4For they willturn awaythy son from following me, that they mayserveother gods: so will theangerof theLordbe kindled against you, and destroy thee suddenly.",
        "5But thus shall ye deal with them; ye shalldestroytheir altars, and break down theirimages, and cut down theirgroves, and burn their graven images with fire.",
        "6For thouartanholypeople unto theLordthy God: theLordthy God hathchosenthee to be aspecialpeople unto himself, above all people thatareupon the face of the earth.",
        "7TheLorddid not set his love upon you, nor choose you, because ye were more in number than any people; for yewerethe fewest of all people:",
        "8But because theLordlovedyou, and because he would keep theoathwhich he had sworn unto your fathers, hath theLordbrought you out with a mighty hand, andredeemedyou out of the house of bondmen, from the hand of Pharaoh king of Egypt.",
        "9Know therefore that theLordthy God, heisGod, the faithful God, whichkeepethcovenant andmercywith them that love him and keep his commandments to a thousand generations;",
        "10Andrepayeththem that hate him to their face, todestroythem: he will not be slack to him thathatethhim, he will repay him to his face.",
        "11Thou shalt therefore keep the commandments, and the statutes, and thejudgments, which Icommandthee this day, to do them.",
        "12Â¶Wherefore it shall come to pass, if yehearkento thesejudgments, and keep, and do them, that theLordthy God shall keep unto thee thecovenantand the mercy which he sware unto thy fathers:",
        "13And he willlovethee, and bless thee, andmultiplythee: he will also bless the fruit of thy womb, and thefruitof thy land, thycorn, and thy wine, and thine oil, the increase of thy kine, and the flocks of thy sheep, in the land which he sware unto thy fathers to give thee.",
        "14Thou shalt be blessed above all people: there shall not be male or femalebarrenamong you, or among your cattle.",
        "15And theLordwill take away from thee allsickness, and will put none of the evildiseasesof Egypt, which thou knowest, upon thee; but will lay them upon allthemthat hate thee.",
        "16And thou shalt consume all the people which theLordthy God shall deliver thee; thine eye shall have no pity upon them: neither shalt thou serve theirgods; for thatwill bea snare unto thee.",
        "17If thou shalt say in thine heart, These nationsaremore than I; how can I dispossess them?",
        "18Thou shalt not be afraid of them:butshalt well remember what theLordthy God did unto Pharaoh, and unto all Egypt;",
        "19The greattemptationswhich thine eyes saw, and the signs, and thewonders, and the mighty hand, and the stretched out arm, whereby theLordthy God brought thee out: so shall theLordthy God do unto all the people of whom thou art afraid.",
        "20Moreover theLordthy God will send the hornet among them, until they that are left, and hide themselves from thee, be destroyed.",
        "21Thou shalt not be affrighted at them: for theLordthy Godisamong you, a mighty God andterrible.",
        "22And theLordthy God willput outthose nations before thee by little and little: thou mayest not consume them at once, lest thebeastsof the field increase upon thee.",
        "23But theLordthy God shalldeliverthem unto thee, and shalldestroythem with a mighty destruction, until they be destroyed.",
        "24And he shall deliver their kings into thine hand, and thou shalt destroy their name from under heaven: there shall no man be able to stand before thee, until thou have destroyed them.",
        "25The graven images of their gods shall ye burn with fire: thou shalt not desire the silver or goldthat ison them, nor takeitunto thee, lest thou be snared therein: for itisan abomination to theLordthy God.",
        "26Neither shalt thou bring an abomination into thine house, lest thou be a cursed thing like it:butthou shalt utterly detest it, and thou shalt utterly abhor it; for itisa cursed thing."
      ],
      "full_text": "1When theLordthy God shall bring thee into the land whither thou goest to possess it, and hath cast out many nations before thee, the Hittites, and the Girgashites, and the Amorites, and the Canaanites, and the Perizzites, and the Hivites, and the Jebusites, sevennationsgreater and mightier than thou; 2And when theLordthy God shall deliver them before thee; thou shalt smite them,andutterlydestroythem; thou shaltmakenocovenantwith them, nor shew mercy unto them: 3Neither shalt thou makemarriageswith them; thy daughter thou shalt not give unto his son, nor his daughter shalt thou take unto thy son. 4For they willturn awaythy son from following me, that they mayserveother gods: so will theangerof theLordbe kindled against you, and destroy thee suddenly. 5But thus shall ye deal with them; ye shalldestroytheir altars, and break down theirimages, and cut down theirgroves, and burn their graven images with fire. 6For thouartanholypeople unto theLordthy God: theLordthy God hathchosenthee to be aspecialpeople unto himself, above all people thatareupon the face of the earth. 7TheLorddid not set his love upon you, nor choose you, because ye were more in number than any people; for yewerethe fewest of all people: 8But because theLordlovedyou, and because he would keep theoathwhich he had sworn unto your fathers, hath theLordbrought you out with a mighty hand, andredeemedyou out of the house of bondmen, from the hand of Pharaoh king of Egypt. 9Know therefore that theLordthy God, heisGod, the faithful God, whichkeepethcovenant andmercywith them that love him and keep his commandments to a thousand generations; 10Andrepayeththem that hate him to their face, todestroythem: he will not be slack to him thathatethhim, he will repay him to his face. 11Thou shalt therefore keep the commandments, and the statutes, and thejudgments, which Icommandthee this day, to do them. 12Â¶Wherefore it shall come to pass, if yehearkento thesejudgments, and keep, and do them, that theLordthy God shall keep unto thee thecovenantand the mercy which he sware unto thy fathers: 13And he willlovethee, and bless thee, andmultiplythee: he will also bless the fruit of thy womb, and thefruitof thy land, thycorn, and thy wine, and thine oil, the increase of thy kine, and the flocks of thy sheep, in the land which he sware unto thy fathers to give thee. 14Thou shalt be blessed above all people: there shall not be male or femalebarrenamong you, or among your cattle. 15And theLordwill take away from thee allsickness, and will put none of the evildiseasesof Egypt, which thou knowest, upon thee; but will lay them upon allthemthat hate thee. 16And thou shalt consume all the people which theLordthy God shall deliver thee; thine eye shall have no pity upon them: neither shalt thou serve theirgods; for thatwill bea snare unto thee. 17If thou shalt say in thine heart, These nationsaremore than I; how can I dispossess them? 18Thou shalt not be afraid of them:butshalt well remember what theLordthy God did unto Pharaoh, and unto all Egypt; 19The greattemptationswhich thine eyes saw, and the signs, and thewonders, and the mighty hand, and the stretched out arm, whereby theLordthy God brought thee out: so shall theLordthy God do unto all the people of whom thou art afraid. 20Moreover theLordthy God will send the hornet among them, until they that are left, and hide themselves from thee, be destroyed. 21Thou shalt not be affrighted at them: for theLordthy Godisamong you, a mighty God andterrible. 22And theLordthy God willput outthose nations before thee by little and little: thou mayest not consume them at once, lest thebeastsof the field increase upon thee. 23But theLordthy God shalldeliverthem unto thee, and shalldestroythem with a mighty destruction, until they be destroyed. 24And he shall deliver their kings into thine hand, and thou shalt destroy their name from under heaven: there shall no man be able to stand before thee, until thou have destroyed them. 25The graven images of their gods shall ye burn with fire: thou shalt not desire the silver or goldthat ison them, nor takeitunto thee, lest thou be snared therein: for itisan abomination to theLordthy God. 26Neither shalt thou bring an abomination into thine house, lest thou be a cursed thing like it:butthou shalt utterly detest it, and thou shalt utterly abhor it; for itisa cursed thing."
    },
    {
      "reference": "Deuteronomy 8",
      "title": "Deuteronomy 8",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/deut/8?lang=eng",
      "summary": "The Lord tested the children of Israel in the wilderness for forty yearsâEating manna taught them that man lives by the word of GodâTheir clothing did not wear outâThe Lord chastened themâIf they serve other gods, they will perish.",
      "verses": [
        "1All the commandments which Icommandthee this day shall yeobserve to do, that ye may live, and multiply, and go in and possess the land which theLordsware unto your fathers.",
        "2And thou shalt remember all the way which theLordthy God led thee these forty years in the wilderness, tohumblethee,andtoprovethee, to know whatwasin thine heart, whether thou wouldest keep his commandments, or no.",
        "3And hehumbledthee, and suffered thee to hunger, and fed thee withmanna, which thou knewest not, neither did thy fathers know; that he might make thee know thatmandoth not live bybreadonly, but by everywordthat proceedeth out of the mouth of theLorddoth man live.",
        "4Thyraiment waxed not old upon thee, neither did thy foot swell, these forty years.",
        "5Thou shalt also consider in thine heart, that, as a manchastenethhis son,sotheLordthy God chasteneth thee.",
        "6Therefore thou shalt keep the commandments of theLordthy God, towalkin his ways, and to fear him.",
        "7For theLordthy God bringeth thee into agoodland, a land of brooks of water, offountainsand depths that spring out of valleys and hills;",
        "8A land of wheat, and barley, and vines, and fig trees, and pomegranates; a land ofoil olive, and honey;",
        "9A land wherein thou shalt eat bread without scarceness, thou shalt not lack anythingin it; a land whose stonesareiron, and out of whose hills thou mayest digbrass.",
        "10When thou hast eaten and art full, then thou shalt bless theLordthy God for the good land which he hath given thee.",
        "11Beware that thouforgetnot theLordthy God, in not keeping his commandments, and hisjudgments, and his statutes, which I command thee this day:",
        "12Lestwhenthou hast eaten and art full, and hast built goodly houses, and dwelttherein;",
        "13Andwhenthy herds and thy flocks multiply, and thy silver and thy gold is multiplied, and all that thou hast is multiplied;",
        "14Then thineheartbelifted up, and thouforgettheLordthy God, which brought thee forth out of the land of Egypt, from the house of bondage;",
        "15Who led thee through that great and terrible wilderness,wherein werefieryserpents, and scorpions, anddrought, wherethere wasno water; who brought thee forthwaterout of the rock of flint;",
        "16Who fed thee in the wilderness withmanna, which thy fathers knew not, that he might humble thee, and that he mightprovethee, to do thee good at thy latter end;",
        "17And thou say in thine heart, My power and the might ofminehand hath gotten me this wealth.",
        "18But thou shalt remember theLordthy God: forit ishe that giveth thee power to getwealth, that he may establish his covenant which he sware unto thy fathers, asit isthis day.",
        "19And it shall be, if thou do at all forget theLordthy God, andwalkafter othergods, and serve them, and worship them, I testify against you this day that ye shall surelyperish.",
        "20As the nations which theLorddestroyeth before your face, so shall ye perish; because ye would not beobedientunto the voice of theLordyour God."
      ],
      "full_text": "1All the commandments which Icommandthee this day shall yeobserve to do, that ye may live, and multiply, and go in and possess the land which theLordsware unto your fathers. 2And thou shalt remember all the way which theLordthy God led thee these forty years in the wilderness, tohumblethee,andtoprovethee, to know whatwasin thine heart, whether thou wouldest keep his commandments, or no. 3And hehumbledthee, and suffered thee to hunger, and fed thee withmanna, which thou knewest not, neither did thy fathers know; that he might make thee know thatmandoth not live bybreadonly, but by everywordthat proceedeth out of the mouth of theLorddoth man live. 4Thyraiment waxed not old upon thee, neither did thy foot swell, these forty years. 5Thou shalt also consider in thine heart, that, as a manchastenethhis son,sotheLordthy God chasteneth thee. 6Therefore thou shalt keep the commandments of theLordthy God, towalkin his ways, and to fear him. 7For theLordthy God bringeth thee into agoodland, a land of brooks of water, offountainsand depths that spring out of valleys and hills; 8A land of wheat, and barley, and vines, and fig trees, and pomegranates; a land ofoil olive, and honey; 9A land wherein thou shalt eat bread without scarceness, thou shalt not lack anythingin it; a land whose stonesareiron, and out of whose hills thou mayest digbrass. 10When thou hast eaten and art full, then thou shalt bless theLordthy God for the good land which he hath given thee. 11Beware that thouforgetnot theLordthy God, in not keeping his commandments, and hisjudgments, and his statutes, which I command thee this day: 12Lestwhenthou hast eaten and art full, and hast built goodly houses, and dwelttherein; 13Andwhenthy herds and thy flocks multiply, and thy silver and thy gold is multiplied, and all that thou hast is multiplied; 14Then thineheartbelifted up, and thouforgettheLordthy God, which brought thee forth out of the land of Egypt, from the house of bondage; 15Who led thee through that great and terrible wilderness,wherein werefieryserpents, and scorpions, anddrought, wherethere wasno water; who brought thee forthwaterout of the rock of flint; 16Who fed thee in the wilderness withmanna, which thy fathers knew not, that he might humble thee, and that he mightprovethee, to do thee good at thy latter end; 17And thou say in thine heart, My power and the might ofminehand hath gotten me this wealth. 18But thou shalt remember theLordthy God: forit ishe that giveth thee power to getwealth, that he may establish his covenant which he sware unto thy fathers, asit isthis day. 19And it shall be, if thou do at all forget theLordthy God, andwalkafter othergods, and serve them, and worship them, I testify against you this day that ye shall surelyperish. 20As the nations which theLorddestroyeth before your face, so shall ye perish; because ye would not beobedientunto the voice of theLordyour God."
    },
    {
      "reference": "Deuteronomy 15",
      "title": "Deuteronomy 15",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/deut/15?lang=eng",
      "summary": "Every seven years, all debts are to be releasedâThe people are admonished to care for the poorâHebrew servants are to be released and given gifts during the seventh yearâThe firstling males of herds and flocks are the Lordâs.",
      "verses": [
        "1At the end ofeverysevenyears thou shalt make arelease.",
        "2And thisisthe manner of therelease: Every creditor that lendethoughtunto his neighbour shall releaseit;he shall not exactitof his neighbour, or of his brother; because it is called theLordâs release.",
        "3Of a foreigner thou mayest exactit again:butthatwhich is thine with thy brother thine hand shall release;",
        "4Savewhen there shall be nopoor among you; for theLordshall greatly bless thee in the land which theLordthy God giveth theeforan inheritance to possess it:",
        "5Only if thou carefully hearken unto the voice of theLordthy God, to observe to do all these commandments which I command thee this day.",
        "6For theLordthy God blesseth thee, as he promised thee: and thou shalt lend unto many nations, but thou shalt notborrow; and thou shalt reign over many nations, but they shall not reign over thee.",
        "7Â¶If there be among you a poor man of one of thy brethren within any of thygatesin thy land which theLordthy God giveth thee, thou shalt nothardenthine heart, nor shut thine hand from thypoorbrother:",
        "8But thou shalt open thinehandwide unto him, and shalt surely lend him sufficient for his need,in thatwhich hewanteth.",
        "9Beware that there be not a thought in thy wicked heart, saying, The seventh year, the year of release, is at hand; and thineeyebe evil against thy poor brother, and thou givest him nought; and hecryunto theLordagainst thee, and it be sin unto thee.",
        "10Thou shalt surely give him, and thine heart shall not be grieved when thou givest unto him: because that for this thing theLordthy God shall bless thee in all thy works, and in all that thou puttest thine hand unto.",
        "11For the poor shall never cease out of the land: therefore I command thee, saying, Thou shalt open thinehandwide unto thy brother, to thy poor, and to thy needy, in thy land.",
        "12Â¶Andif thy brother, an Hebrew man, or an Hebrew woman, besoldunto thee, and serve thee six years; then in the seventh year thou shalt let him go free from thee.",
        "13And when thou sendest him out free from thee, thou shalt not let him go away empty:",
        "14Thou shalt furnish him liberally out of thy flock, and out of thyfloor, and out of thy winepress:of thatwherewith theLordthy God hath blessed thee thou shalt give unto him.",
        "15And thou shaltrememberthat thou wast a bondman in the land of Egypt, and theLordthy God redeemed thee: therefore I command thee this thing to day.",
        "16And it shall be, if he say unto thee, I will not go away from thee; because he loveth thee and thine house, because he is well with thee;",
        "17Then thou shalt take an awl, and thrustitthrough hisearunto the door, and he shall be thy servant for ever. And also unto thy maidservant thou shalt do likewise.",
        "18It shall not seem hard unto thee, when thou sendest him away free from thee; for he hath beenwortha double hired servantto thee,in serving thee six years: and theLordthy God shall bless thee in all that thou doest.",
        "19Â¶All thefirstlingmales that come of thy herd and of thy flock thou shaltsanctifyunto theLordthy God: thou shalt do no work with the firstling of thybullock, nor shear the firstling of thy sheep.",
        "20Thou shalt eatitbefore theLordthy God year by year in theplacewhich theLordshall choose, thou and thy household.",
        "21And if there beanyblemishtherein,as if it belame, or blind,orhaveanyillblemish, thou shalt notsacrificeit unto theLordthy God.",
        "22Thou shalt eat it within thy gates: theuncleanand the cleanperson shall eat italike, as the roebuck, and as the hart.",
        "23Only thou shalt not eat the blood thereof; thou shalt pour it upon the ground as water."
      ],
      "full_text": "1At the end ofeverysevenyears thou shalt make arelease. 2And thisisthe manner of therelease: Every creditor that lendethoughtunto his neighbour shall releaseit;he shall not exactitof his neighbour, or of his brother; because it is called theLordâs release. 3Of a foreigner thou mayest exactit again:butthatwhich is thine with thy brother thine hand shall release; 4Savewhen there shall be nopoor among you; for theLordshall greatly bless thee in the land which theLordthy God giveth theeforan inheritance to possess it: 5Only if thou carefully hearken unto the voice of theLordthy God, to observe to do all these commandments which I command thee this day. 6For theLordthy God blesseth thee, as he promised thee: and thou shalt lend unto many nations, but thou shalt notborrow; and thou shalt reign over many nations, but they shall not reign over thee. 7Â¶If there be among you a poor man of one of thy brethren within any of thygatesin thy land which theLordthy God giveth thee, thou shalt nothardenthine heart, nor shut thine hand from thypoorbrother: 8But thou shalt open thinehandwide unto him, and shalt surely lend him sufficient for his need,in thatwhich hewanteth. 9Beware that there be not a thought in thy wicked heart, saying, The seventh year, the year of release, is at hand; and thineeyebe evil against thy poor brother, and thou givest him nought; and hecryunto theLordagainst thee, and it be sin unto thee. 10Thou shalt surely give him, and thine heart shall not be grieved when thou givest unto him: because that for this thing theLordthy God shall bless thee in all thy works, and in all that thou puttest thine hand unto. 11For the poor shall never cease out of the land: therefore I command thee, saying, Thou shalt open thinehandwide unto thy brother, to thy poor, and to thy needy, in thy land. 12Â¶Andif thy brother, an Hebrew man, or an Hebrew woman, besoldunto thee, and serve thee six years; then in the seventh year thou shalt let him go free from thee. 13And when thou sendest him out free from thee, thou shalt not let him go away empty: 14Thou shalt furnish him liberally out of thy flock, and out of thyfloor, and out of thy winepress:of thatwherewith theLordthy God hath blessed thee thou shalt give unto him. 15And thou shaltrememberthat thou wast a bondman in the land of Egypt, and theLordthy God redeemed thee: therefore I command thee this thing to day. 16And it shall be, if he say unto thee, I will not go away from thee; because he loveth thee and thine house, because he is well with thee; 17Then thou shalt take an awl, and thrustitthrough hisearunto the door, and he shall be thy servant for ever. And also unto thy maidservant thou shalt do likewise. 18It shall not seem hard unto thee, when thou sendest him away free from thee; for he hath beenwortha double hired servantto thee,in serving thee six years: and theLordthy God shall bless thee in all that thou doest. 19Â¶All thefirstlingmales that come of thy herd and of thy flock thou shaltsanctifyunto theLordthy God: thou shalt do no work with the firstling of thybullock, nor shear the firstling of thy sheep. 20Thou shalt eatitbefore theLordthy God year by year in theplacewhich theLordshall choose, thou and thy household. 21And if there beanyblemishtherein,as if it belame, or blind,orhaveanyillblemish, thou shalt notsacrificeit unto theLordthy God. 22Thou shalt eat it within thy gates: theuncleanand the cleanperson shall eat italike, as the roebuck, and as the hart. 23Only thou shalt not eat the blood thereof; thou shalt pour it upon the ground as water."
    },
    {
      "reference": "Deuteronomy 18",
      "title": "Deuteronomy 18",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/deut/18?lang=eng",
      "summary": "How priests are supportedâDivination, spiritualism, and the like are abominationsâA Prophet (Christ) will arise like unto Moses.",
      "verses": [
        "1The priests the Levites,andall the tribe of Levi, shall have nopartnorinheritancewith Israel: they shalleatthe offerings of theLordmade by fire, and his inheritance.",
        "2Therefore shall they have no inheritance among their brethren: theLordistheirinheritance, as he hath said unto them.",
        "3Â¶And this shall be the priestâsduefrom the people, from them that offer a sacrifice, whetherit beox or sheep; and they shall give unto the priest the shoulder, and the two cheeks, and themaw.",
        "4Thefirstfruitalsoof thycorn, of thy wine, and of thine oil, and the first of the fleece of thy sheep, shalt thou give him.",
        "5For theLordthy God hath chosen him out of all thy tribes, to stand toministerin thenameof theLord, him and his sons for ever.",
        "6Â¶And if a Levite come from any of thygatesout of all Israel, where hesojourned, and come with all the desire of his mind unto theplacewhich theLordshall choose;",
        "7Then he shall minister in the name of theLordhis God, as all his brethren the Levitesdo,which stand there before theLord.",
        "8They shall have like portions to eat, beside that which cometh of the sale of his patrimony.",
        "9Â¶When thou art come into thelandwhich theLordthy God giveth thee, thou shalt not learn to do after theabominationsof those nations.",
        "10There shall not be found among youany onethat maketh his son or his daughtertopass through thefire,orthat usethdivination,oran observer of times, or anenchanter, or a witch,",
        "11Or a charmer, or a consulter withfamiliar spirits, or a wizard, or a necromancer.",
        "12For all that do these thingsareanabominationunto theLord: and because of theseabominationstheLordthy God doth drive them out from before thee.",
        "13Thou shalt beperfectwith theLordthy God.",
        "14For these nations, which thou shaltpossess, hearkened untoobserversof times, and unto diviners: but as for thee, theLordthy God hath not suffered thee soto do.",
        "15Â¶TheLordthy God willraise upunto thee aProphetfrom the midst of thee, of thy brethren, like unto me; unto him ye shall hearken;",
        "16According to all that thou desiredst of theLordthy God in Horeb in the day of the assembly, saying, Let me nothearagain the voice of theLordmy God, neither let me see this great fire any more, that I die not.",
        "17And theLordsaid unto me, They have wellspoken thatwhich they have spoken.",
        "18I will raise them up aProphetfrom among their brethren, like unto thee, and will put mywordsin his mouth; and he shallspeakunto them all that I shall command him.",
        "19And it shall come to pass,thatwhosoever will not hearken unto my words which he shall speak in my name, I will requireitof him.",
        "20But theprophet, which shallpresumeto speak a word in my name, which I have not commanded him to speak, or that shall speak in the name of other gods, even that prophet shall die.",
        "21And if thou say in thine heart, How shall weknowthe word which theLordhath not spoken?",
        "22When aprophetspeakethin the name of theLord, if the thing follow not, nor come to pass, thatisthe thing which theLordhath not spoken,butthe prophet hath spoken it presumptuously: thou shalt not be afraid of him."
      ],
      "full_text": "1The priests the Levites,andall the tribe of Levi, shall have nopartnorinheritancewith Israel: they shalleatthe offerings of theLordmade by fire, and his inheritance. 2Therefore shall they have no inheritance among their brethren: theLordistheirinheritance, as he hath said unto them. 3Â¶And this shall be the priestâsduefrom the people, from them that offer a sacrifice, whetherit beox or sheep; and they shall give unto the priest the shoulder, and the two cheeks, and themaw. 4Thefirstfruitalsoof thycorn, of thy wine, and of thine oil, and the first of the fleece of thy sheep, shalt thou give him. 5For theLordthy God hath chosen him out of all thy tribes, to stand toministerin thenameof theLord, him and his sons for ever. 6Â¶And if a Levite come from any of thygatesout of all Israel, where hesojourned, and come with all the desire of his mind unto theplacewhich theLordshall choose; 7Then he shall minister in the name of theLordhis God, as all his brethren the Levitesdo,which stand there before theLord. 8They shall have like portions to eat, beside that which cometh of the sale of his patrimony. 9Â¶When thou art come into thelandwhich theLordthy God giveth thee, thou shalt not learn to do after theabominationsof those nations. 10There shall not be found among youany onethat maketh his son or his daughtertopass through thefire,orthat usethdivination,oran observer of times, or anenchanter, or a witch, 11Or a charmer, or a consulter withfamiliar spirits, or a wizard, or a necromancer. 12For all that do these thingsareanabominationunto theLord: and because of theseabominationstheLordthy God doth drive them out from before thee. 13Thou shalt beperfectwith theLordthy God. 14For these nations, which thou shaltpossess, hearkened untoobserversof times, and unto diviners: but as for thee, theLordthy God hath not suffered thee soto do. 15Â¶TheLordthy God willraise upunto thee aProphetfrom the midst of thee, of thy brethren, like unto me; unto him ye shall hearken; 16According to all that thou desiredst of theLordthy God in Horeb in the day of the assembly, saying, Let me nothearagain the voice of theLordmy God, neither let me see this great fire any more, that I die not. 17And theLordsaid unto me, They have wellspoken thatwhich they have spoken. 18I will raise them up aProphetfrom among their brethren, like unto thee, and will put mywordsin his mouth; and he shallspeakunto them all that I shall command him. 19And it shall come to pass,thatwhosoever will not hearken unto my words which he shall speak in my name, I will requireitof him. 20But theprophet, which shallpresumeto speak a word in my name, which I have not commanded him to speak, or that shall speak in the name of other gods, even that prophet shall die. 21And if thou say in thine heart, How shall weknowthe word which theLordhath not spoken? 22When aprophetspeakethin the name of theLord, if the thing follow not, nor come to pass, thatisthe thing which theLordhath not spoken,butthe prophet hath spoken it presumptuously: thou shalt not be afraid of him."
    },
    {
      "reference": "Deuteronomy 29",
      "title": "Deuteronomy 29",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/deut/29?lang=eng",
      "summary": "The children of Israel make a covenant with the Lord under which they will be blessed if they are obedient, and cursed if they are disobedientâIf they are disobedient, their land will be as brimstone and salt.",
      "verses": [
        "1Thesearethe words of thecovenant, which theLordcommanded Moses to make with the children of Israel in the land of Moab, beside the covenant which he made with them in Horeb.",
        "2Â¶And Moses called unto all Israel, and said unto them, Ye have seen all that theLorddid before your eyes in the land of Egypt unto Pharaoh, and unto all his servants, and unto all his land;",
        "3The greattemptationswhich thine eyes have seen, the signs, and those greatmiracles:",
        "4Yet theLordhath not given you an heart to perceive, and eyes to see, and ears to hear, unto this day.",
        "5And I have led you forty years in the wilderness: your clothes are notwaxen oldupon you, and thy shoe is not waxen old upon thy foot.",
        "6Ye have not eaten bread, neither have ye drunk wine or strong drink: that ye might know that IamtheLordyour God.",
        "7And when ye came unto this place,Sihonthe king of Heshbon, and Og the king of Bashan, came out against us unto battle, and wesmotethem:",
        "8And we took their land, and gave it for an inheritance unto the Reubenites, and to the Gadites, and to the half tribe of Manasseh.",
        "9Keep therefore the words of this covenant, and do them, that ye mayprosperin all that ye do.",
        "10Â¶Ye stand this day all of you before theLordyour God; your captains of your tribes, your elders, and your officers,withall the men of Israel,",
        "11Your little ones, your wives, and thy stranger thatisin thy camp, from thehewerof thy wood unto the drawer of thy water:",
        "12That thou shouldest enter intocovenantwith theLordthy God, and into hisoath, which theLordthy God maketh with thee this day:",
        "13That he may establish thee to day for a people unto himself, andthathe may be unto thee aGod, as he hath said unto thee, and as he hath sworn unto thy fathers, to Abraham, to Isaac, and to Jacob.",
        "14Neither with you only do I make this covenant and this oath;",
        "15But withhimthat standeth here with us this day before theLordour God, and also withhimthatisnot here with us this day:",
        "16(For ye know how we have dwelt in the land of Egypt; and how we came through the nations which ye passed by;",
        "17And ye have seen their abominations, and their idols, wood and stone, silver and gold, whichwereamong them:)",
        "18Lest there should be among you man, or woman, or family, or tribe, whose heartturnethaway this day from theLordour God, to goandserve the gods of these nations; lest there should be among you a root that bearethgall and wormwood;",
        "19And it come to pass, when he heareth the words of thiscurse, that heblesshimself in his heart, saying, I shall have peace, though I walk in the imagination of mine heart, to adddrunkennessto thirst:",
        "20TheLordwill not spare him, but then the anger of theLordand his jealousy shall smoke against that man, and all thecursesthat are written in this book shall lie upon him, and theLordshallblot outhis name from under heaven.",
        "21And theLordshall separate him unto evil out of all the tribes of Israel, according to all the curses of the covenant that are written in this book of the law:",
        "22So that the generation to come of your children that shall rise up after you, and the stranger that shall come from a far land, shall say, when they see the plagues of that land, and the sicknesses which theLordhath laid upon it;",
        "23And thatthe whole land thereofisbrimstone, andsalt,andburning,thatit is not sown, nor beareth, nor any grass groweth therein, like the overthrow of Sodom, and Gomorrah,Admah, and Zeboim, which theLordoverthrew in his anger, and in his wrath:",
        "24Even all nations shall say,Whereforehath theLorddonethus unto this land? whatmeaneththe heat of this great anger?",
        "25Then men shall say, Becausethey haveforsakenthecovenantof theLordGod of their fathers, which he made with them when he brought them forth out of the land of Egypt:",
        "26For they went and served other gods, and worshipped them, gods whom they knew not, andwhomhe had not given unto them:",
        "27And the anger of theLordwas kindled against this land, to bring upon it all the curses that are written in this book:",
        "28And theLordrootedthem out of theirlandin anger, and in wrath, and in greatindignation, and cast them into another land, asit isthis day.",
        "29Thesecretthings belongunto theLordour God: but thosethings which arerevealedbelongunto us and to our children for ever, thatwemay do all the words of this law."
      ],
      "full_text": "1Thesearethe words of thecovenant, which theLordcommanded Moses to make with the children of Israel in the land of Moab, beside the covenant which he made with them in Horeb. 2Â¶And Moses called unto all Israel, and said unto them, Ye have seen all that theLorddid before your eyes in the land of Egypt unto Pharaoh, and unto all his servants, and unto all his land; 3The greattemptationswhich thine eyes have seen, the signs, and those greatmiracles: 4Yet theLordhath not given you an heart to perceive, and eyes to see, and ears to hear, unto this day. 5And I have led you forty years in the wilderness: your clothes are notwaxen oldupon you, and thy shoe is not waxen old upon thy foot. 6Ye have not eaten bread, neither have ye drunk wine or strong drink: that ye might know that IamtheLordyour God. 7And when ye came unto this place,Sihonthe king of Heshbon, and Og the king of Bashan, came out against us unto battle, and wesmotethem: 8And we took their land, and gave it for an inheritance unto the Reubenites, and to the Gadites, and to the half tribe of Manasseh. 9Keep therefore the words of this covenant, and do them, that ye mayprosperin all that ye do. 10Â¶Ye stand this day all of you before theLordyour God; your captains of your tribes, your elders, and your officers,withall the men of Israel, 11Your little ones, your wives, and thy stranger thatisin thy camp, from thehewerof thy wood unto the drawer of thy water: 12That thou shouldest enter intocovenantwith theLordthy God, and into hisoath, which theLordthy God maketh with thee this day: 13That he may establish thee to day for a people unto himself, andthathe may be unto thee aGod, as he hath said unto thee, and as he hath sworn unto thy fathers, to Abraham, to Isaac, and to Jacob. 14Neither with you only do I make this covenant and this oath; 15But withhimthat standeth here with us this day before theLordour God, and also withhimthatisnot here with us this day: 16(For ye know how we have dwelt in the land of Egypt; and how we came through the nations which ye passed by; 17And ye have seen their abominations, and their idols, wood and stone, silver and gold, whichwereamong them:) 18Lest there should be among you man, or woman, or family, or tribe, whose heartturnethaway this day from theLordour God, to goandserve the gods of these nations; lest there should be among you a root that bearethgall and wormwood; 19And it come to pass, when he heareth the words of thiscurse, that heblesshimself in his heart, saying, I shall have peace, though I walk in the imagination of mine heart, to adddrunkennessto thirst: 20TheLordwill not spare him, but then the anger of theLordand his jealousy shall smoke against that man, and all thecursesthat are written in this book shall lie upon him, and theLordshallblot outhis name from under heaven. 21And theLordshall separate him unto evil out of all the tribes of Israel, according to all the curses of the covenant that are written in this book of the law: 22So that the generation to come of your children that shall rise up after you, and the stranger that shall come from a far land, shall say, when they see the plagues of that land, and the sicknesses which theLordhath laid upon it; 23And thatthe whole land thereofisbrimstone, andsalt,andburning,thatit is not sown, nor beareth, nor any grass groweth therein, like the overthrow of Sodom, and Gomorrah,Admah, and Zeboim, which theLordoverthrew in his anger, and in his wrath: 24Even all nations shall say,Whereforehath theLorddonethus unto this land? whatmeaneththe heat of this great anger? 25Then men shall say, Becausethey haveforsakenthecovenantof theLordGod of their fathers, which he made with them when he brought them forth out of the land of Egypt: 26For they went and served other gods, and worshipped them, gods whom they knew not, andwhomhe had not given unto them: 27And the anger of theLordwas kindled against this land, to bring upon it all the curses that are written in this book: 28And theLordrootedthem out of theirlandin anger, and in wrath, and in greatindignation, and cast them into another land, asit isthis day. 29Thesecretthings belongunto theLordour God: but thosethings which arerevealedbelongunto us and to our children for ever, thatwemay do all the words of this law."
    },
    {
      "reference": "Deuteronomy 30",
      "title": "Deuteronomy 30",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/deut/30?lang=eng",
      "summary": "The scattered Israelites will be gathered from all nations when they remember the covenantâMoses places life or death, blessing or cursing, before the people.",
      "verses": [
        "1And it shall come to pass, when all these things are come upon thee, theblessingand the curse, which I have set before thee, and thou shalt callthemto mind among all the nations, whither theLordthy God hath driven thee,",
        "2And shaltreturnunto theLordthy God, and shalt obey his voice according to all that I command thee this day, thou and thy children, with all thine heart, and with all thy soul;",
        "3That then theLordthy God will turn thycaptivity, and havecompassionupon thee, and will return andgatherthee from all the nations, whither theLordthy God hath scattered thee.",
        "4Ifanyof thine be driven out unto the outmostpartsofheaven, from thence will theLordthy God gather thee, and from thence will he fetch thee:",
        "5And theLordthy God will bring thee into the land which thy fathers possessed, and thou shalt possess it; and he will do thee good, and multiply thee above thy fathers.",
        "6And theLordthy God willcircumcisethine heart, and the heart of thy seed, tolovetheLordthy God with all thine heart, and with all thy soul, that thou mayest live.",
        "7And theLordthy God will put all thesecursesupon thineenemies, and on them that hate thee, which persecuted thee.",
        "8And thou shalt return and obey the voice of theLord, and do all his commandments which I command thee this day.",
        "9And theLordthy God will make theeplenteousin every work of thine hand, in the fruit of thy body, and in the fruit of thy cattle, and in the fruit of thy land, for good: for theLordwill again rejoice over thee for good, as he rejoiced over thy fathers:",
        "10If thou shalt hearken unto the voice of theLordthy God, to keep his commandments and his statutes which are written in this book of the law,andif thouturnunto theLordthy God with all thine heart, and with all thy soul.",
        "11Â¶For this commandment which I command thee this day, itisnothidden from thee, neitherisit far off.",
        "12Itisnot in heaven, that thou shouldest say, Who shall go up for us to heaven, and bring it unto us, that we may hear it, and do it?",
        "13Neitherisit beyond the sea, that thou shouldest say, Who shall go over the sea for us, and bring it unto us, that we may hear it, and do it?",
        "14But the wordisvery nigh unto thee, in thy mouth, and in thyheart, that thou mayest do it.",
        "15Â¶See, I have set before thee this daylifeand good, and death andevil;",
        "16In that I command thee this day to love theLordthy God, towalkin his ways, and to keep his commandments and his statutes and hisjudgments, that thou mayest live and multiply: and theLordthy God shall bless thee in the land whither thou goest to possess it.",
        "17But if thine heart turn away, so that thou wilt not hear, but shalt be drawn away, and worship other gods, and serve them;",
        "18Idenounceunto you this day, that ye shall surely perish,and thatye shall not prolongyourdays upon the land, whither thou passest over Jordan to go to possess it.",
        "19I call heaven and earth to record this day against you,thatI have set before you life and death, blessing andcursing: thereforechooselife, that both thou and thy seed may live:",
        "20That thou mayest love theLordthy God,andthat thou mayestobeyhis voice, and that thou mayest cleave unto him: for heisthylife, and the length of thy days: that thou mayest dwell in the land which theLordsware unto thy fathers, to Abraham, to Isaac, and to Jacob, to give them."
      ],
      "full_text": "1And it shall come to pass, when all these things are come upon thee, theblessingand the curse, which I have set before thee, and thou shalt callthemto mind among all the nations, whither theLordthy God hath driven thee, 2And shaltreturnunto theLordthy God, and shalt obey his voice according to all that I command thee this day, thou and thy children, with all thine heart, and with all thy soul; 3That then theLordthy God will turn thycaptivity, and havecompassionupon thee, and will return andgatherthee from all the nations, whither theLordthy God hath scattered thee. 4Ifanyof thine be driven out unto the outmostpartsofheaven, from thence will theLordthy God gather thee, and from thence will he fetch thee: 5And theLordthy God will bring thee into the land which thy fathers possessed, and thou shalt possess it; and he will do thee good, and multiply thee above thy fathers. 6And theLordthy God willcircumcisethine heart, and the heart of thy seed, tolovetheLordthy God with all thine heart, and with all thy soul, that thou mayest live. 7And theLordthy God will put all thesecursesupon thineenemies, and on them that hate thee, which persecuted thee. 8And thou shalt return and obey the voice of theLord, and do all his commandments which I command thee this day. 9And theLordthy God will make theeplenteousin every work of thine hand, in the fruit of thy body, and in the fruit of thy cattle, and in the fruit of thy land, for good: for theLordwill again rejoice over thee for good, as he rejoiced over thy fathers: 10If thou shalt hearken unto the voice of theLordthy God, to keep his commandments and his statutes which are written in this book of the law,andif thouturnunto theLordthy God with all thine heart, and with all thy soul. 11Â¶For this commandment which I command thee this day, itisnothidden from thee, neitherisit far off. 12Itisnot in heaven, that thou shouldest say, Who shall go up for us to heaven, and bring it unto us, that we may hear it, and do it? 13Neitherisit beyond the sea, that thou shouldest say, Who shall go over the sea for us, and bring it unto us, that we may hear it, and do it? 14But the wordisvery nigh unto thee, in thy mouth, and in thyheart, that thou mayest do it. 15Â¶See, I have set before thee this daylifeand good, and death andevil; 16In that I command thee this day to love theLordthy God, towalkin his ways, and to keep his commandments and his statutes and hisjudgments, that thou mayest live and multiply: and theLordthy God shall bless thee in the land whither thou goest to possess it. 17But if thine heart turn away, so that thou wilt not hear, but shalt be drawn away, and worship other gods, and serve them; 18Idenounceunto you this day, that ye shall surely perish,and thatye shall not prolongyourdays upon the land, whither thou passest over Jordan to go to possess it. 19I call heaven and earth to record this day against you,thatI have set before you life and death, blessing andcursing: thereforechooselife, that both thou and thy seed may live: 20That thou mayest love theLordthy God,andthat thou mayestobeyhis voice, and that thou mayest cleave unto him: for heisthylife, and the length of thy days: that thou mayest dwell in the land which theLordsware unto thy fathers, to Abraham, to Isaac, and to Jacob, to give them."
    },
    {
      "reference": "Deuteronomy 34",
      "title": "Deuteronomy 34",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/deut/34?lang=eng",
      "summary": "Moses sees the promised land and is taken by the LordâJoshua leads IsraelâMoses was Israelâs greatest prophet.",
      "verses": [
        "1And Moses went up from the plains of Moab unto the mountain of Nebo, to the top of Pisgah, thatisover againstJericho. And theLordshewed him all the land of Gilead, unto Dan,",
        "2And all Naphtali, and the land of Ephraim, and Manasseh, and all the land of Judah, untothe utmost sea,",
        "3And thesouth, and the plain of the valley ofJericho, the city of palm trees, unto Zoar.",
        "4And theLordsaid unto him, Thisisthe land which Iswareunto Abraham, unto Isaac, and unto Jacob, saying, I will give it unto thy seed: I have caused thee to seeitwith thine eyes, but thou shalt not go over thither.",
        "5Â¶SoMosesthe servant of theLorddiedthere in the land of Moab, according to the word of theLord.",
        "6And heburiedhim in a valley in the land of Moab, over against Beth-peor: but no man knowethofhissepulchreunto this day.",
        "7Â¶And Moseswasanhundredand twenty years old when he died: his eye was not dim, nor his natural force abated.",
        "8Â¶And the children of Israel wept for Moses in the plains of Moab thirty days: so the days of weepingandmourningfor Moses were ended.",
        "9Â¶And Joshua the son ofNunwas full of the spirit of wisdom; for Moses hadlaidhis hands upon him: and the children of Israelhearkenedunto him, and did as theLordcommanded Moses.",
        "10Â¶And there arose not aprophetsince in Israel like unto Moses, whom theLordknewface to face,",
        "11In all the signs and the wonders, which theLordsent him to do in the land of Egypt to Pharaoh, and to all his servants, and to all his land,",
        "12And in all that mightyhand, and in all the greatterrorwhich Moses shewed in the sight of all Israel."
      ],
      "full_text": "1And Moses went up from the plains of Moab unto the mountain of Nebo, to the top of Pisgah, thatisover againstJericho. And theLordshewed him all the land of Gilead, unto Dan, 2And all Naphtali, and the land of Ephraim, and Manasseh, and all the land of Judah, untothe utmost sea, 3And thesouth, and the plain of the valley ofJericho, the city of palm trees, unto Zoar. 4And theLordsaid unto him, Thisisthe land which Iswareunto Abraham, unto Isaac, and unto Jacob, saying, I will give it unto thy seed: I have caused thee to seeitwith thine eyes, but thou shalt not go over thither. 5Â¶SoMosesthe servant of theLorddiedthere in the land of Moab, according to the word of theLord. 6And heburiedhim in a valley in the land of Moab, over against Beth-peor: but no man knowethofhissepulchreunto this day. 7Â¶And Moseswasanhundredand twenty years old when he died: his eye was not dim, nor his natural force abated. 8Â¶And the children of Israel wept for Moses in the plains of Moab thirty days: so the days of weepingandmourningfor Moses were ended. 9Â¶And Joshua the son ofNunwas full of the spirit of wisdom; for Moses hadlaidhis hands upon him: and the children of Israelhearkenedunto him, and did as theLordcommanded Moses. 10Â¶And there arose not aprophetsince in Israel like unto Moses, whom theLordknewface to face, 11In all the signs and the wonders, which theLordsent him to do in the land of Egypt to Pharaoh, and to all his servants, and to all his land, 12And in all that mightyhand, and in all the greatterrorwhich Moses shewed in the sight of all Israel."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:28:34",
  "metadata": {
    "week_number": 20,
    "title": "Week 20: May 11–17 - Deuteronomy 6–8; 15; 18; 29–30; 34",
    "date_range": "May 11–17",
    "scraped_at": "2025-12-21T22:28:39.977776",
    "scraper_version": "2.0.0"
  }
}