{
  "week_number": 39,
  "date_range": "September 21–27",
  "title": "Week 39: September 21–27 - Isaiah 13–14; 22; 24–30; 35",
  "bundle_title": "Week 39: September 21–27: \"Week 39: September 21–27 - Isaiah 13–14; 22; 24–30; 35\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/39?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/39?lang=eng",
    "title": "Isaiah 13–14;22;24–30;35",
    "scripture_references": "Isaiah 13–14; 22; 24–30; 35",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\nProverbs 1–4; 15–16; 22; 31; Ecclesiastes 1–3; 11–12\n\n“September 21–27. ‘A Marvellous Work and a Wonder’: Isaiah 13–14; 22; 24–30; 35,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“September 21–27. ‘A Marvellous Work and a Wonder,’”Come, Follow Me: 2026\n\nOne thing that the Lord asks prophets to do is to warn about the consequences of sin. For Old Testament prophets, this often meant telling the rulers of mighty kingdoms that they needed to repent. It was a dangerous task, but Isaiah was fearless, and his warnings to the kingdoms of his day—including Israel, Judah, and surrounding nations—were bold (seeIsaiah 13–23).\n\nHowever, Isaiah also had a message of hope. Even though the prophesied destructions did come upon these kingdoms, Isaiah foresaw a chance for restoration and renewal. The Lord would invite His people to return to Him. He would make “the parched ground … become a pool, and the thirsty land springs of water” (Isaiah 35:7). He would perform “a marvellous work and a wonder” (Isaiah 29:14), restoring to Israel the blessings He had promised them. Neither Isaiah nor anyone else alive at that time lived to see this marvelous work. But we are seeing it today. In fact, we are part of it.",
    "learning_at_home_church": [
      {
        "title": "Pride and worldliness will fail.",
        "content": "In Isaiah’s day, Babylon was a mighty kingdom with a powerful ruler. Now Babylon is ancient history. So why is Isaiah’s message to Babylon, inIsaiah 13–14, important to us today? Because Babylon symbolizes pride, greed, and sin, things that still surround us today. Think about this symbolism as you readIsaiah 13:1–11, 19–22;14:1–20. You might consider questions like these:\n\nWhat similarities do you see between the pride of the Babylonian king and the pride of Satan? (seeIsaiah 14:4–20;Moses 4:1–4). What warnings do you find for yourself in these verses?\n\nHow does the Savior provide “rest from thy sorrow, and from thy fear”? (Isaiah 14:3).\n\n“He will swallow up death in victory” (Isaiah 25:8).\n\nIsaiah 22:22–23;24:21–23;25:6–8;26:19;28:16"
      },
      {
        "title": "Jesus Christ is the promised Messiah.",
        "content": "The teachings of Isaiah often refer to the Savior’s mission, including His atoning sacrifice, Resurrection, and Second Coming. What aspects of His mission come to mind as you read these verses:Isaiah 22:22–23;24:21–23;25:6–8;26:19;28:16? What other passages do you find that remind you of the Savior?\n\nGive learners opportunities to bear testimony of Jesus Christ.“To be a teacher of Jesus Christ’s gospel means to help others understand and rely on His teachings, redeeming power, and perfect love” (Teaching in the Savior’s Way,8). One simple way to do that every time you teach is to ask a question like “What did you find in the scriptures this week that taught you something about the Savior?” Then let learners share their experiences and strengthen each other’s faith.\n\nIsaiah 24:1–12;28:1–8;29:7–13;30:8–14"
      },
      {
        "title": "Turning away from the Lord brings spiritual danger.",
        "content": "In His mercy, the Lord sent Isaiah to warn the covenant people that they were straying from Him. See if you can find the spiritual warning signs of this inIsaiah 24:5;29:13;30:8–12. Why are these attitudes and actions spiritually dangerous?\n\nTo warn about the consequences of turning away from the Lord, Isaiah used some memorable comparisons. As you study them, ask yourself how turning away from the Lord is like:\n\nA sad, empty earth (Isaiah 24:1–12).\n\nDrunkenness (Isaiah 28:7–8).\n\nHunger and thirst (Isaiah 29:7–10).\n\nA broken wall or vessel (Isaiah 30:13–14).\n\nWhy is it important to you to stay close to the Lord?\n\nIsaiah 29;30:18–26;35"
      },
      {
        "title": "The Lord can restore what is lost or broken.",
        "content": "Have you ever lost something that you thought you would never find again? Or maybe something broke, and you worried that it could never be repaired. When we turn away from the Lord, Satan wants us to think that we can never return or be healed. However, Isaiah described some of the marvelous things the Lord will do to help us return to Him. What do you learn fromIsaiah 29:13–24;30:18–26;35about the Lord, His love, and His power? Perhaps you could find a phrase in these passages that gives you hope when you need healing. You could also look in Sister Amy A. Wright’s message “Christ Heals That Which Is Broken” (Liahona, May 2022, 81–84).\n\nOne way the Lord manifests His power and mercy is through the Restoration of His gospel.Isaiah 29contains several passages that have parallels with events of the Restoration. For example:\n\nCompareIsaiah 29:11–12with2 Nephi 27:6–26andJoseph Smith—History 1:63–65.\n\nCompareIsaiah 29:13–14withDoctrine and Covenants 4andJoseph Smith—History 1:17–19.\n\nCompareIsaiah 29:18–24with thetitle page of the Book of Mormon.\n\nIn your opinion, why are “marvellous” and “wonder” (Isaiah 29:14) good words to describe the Lord restoring His gospel? How can you help fulfill the prophecies about the Restoration? For ideas, look in Elder Gerrit W. Gong’s message “All Nations, Kindreds, and Tongues” (EnsignorLiahona, Nov. 2020, 38–41).\n\nSee also “The Restoration of the Fulness of the Gospel of Jesus Christ: A Bicentennial Proclamation to the World” (Gospel Library); “The Morning Breaks,”Hymns, no 1.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "Jesus Christ can save me from sin and death.",
        "content": "How will you help your children see the Savior in the writings of Isaiah? You might help them find phrases that remind them of Him inIsaiah 14:3;25:8; or28:16. They could also match these verses from Isaiah with other verses that teach about the Savior, such asMatthew 11:28–30;1 Corinthians 15:53–57;Helaman 5:12. What great things has the Lord done for us?\n\nAfter readingIsaiah 25:8–9together, you could look at pictures of the Savior in Gethsemane, on the cross, and after His Resurrection. Let your children talk about what is happening in the pictures and why they love Jesus and “rejoice in his salvation” (verse 9).\n\nYou might choose to tell your children about the sadness you felt when someone you love passed away. Testify of the comfort you receive because of Jesus Christ. Maybe your children could draw a crying face and then erase the tears as you readIsaiah 25:8together.\n\nThy Will Be Done, by Ken Spencer\n\nIsaiah 25:4–6"
      },
      {
        "title": "Jesus gives me “refuge from the storm.”",
        "content": "Have you and your children ever experienced the blessing of safe shelter during a storm or shade on a hot summer day? Or have you enjoyed a good meal when you were hungry? Talk about these experiences as you readIsaiah 25:4–6. How is Jesus like these things?\n\nIsaiah 29:11–18, 24"
      },
      {
        "title": "The Restoration of the gospel is a “marvellous work.”",
        "content": "As you and your children readIsaiah 29:14, share with them other words that mean the same thing as “marvellous” and “wonder.” Let them help you find objects or pictures that represent some of the Lord’s marvelous works during the latter days. These might include a copy of the Book of Mormon, a picture of a temple, or a picture of the First Vision (there’s one at the beginning of this outline). Then your children could choose an item and share why it is marvelous to them.\n\nA song about the Restoration of the gospel could go well withIsaiah 29, such as “On a Golden Springtime” (Children’s Songbook, 88). And perhaps a personal experience could help the children understand whatrestorationmeans. For example, you and your children could talk about something that you lost and how you found it. Help your children compare this to the Restoration of the gospel. According toIsaiah 29:13–15, why do we need the Restoration? What marvelous works is the Lord doing to restore His gospel? (see this week’s activity page).\n\nFor more, see this month’s issue of theFriendmagazine.\n\nThe Crucifixion, by Carl Heinrich Bloch, at the Frederiksborg Museum of National History"
      }
    ],
    "study_helps": [],
    "raw_text": "September 21–27. “A Marvellous Work and a Wonder”: Isaiah 13–14; 22; 24–30; 35\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nAugust 31–September 6\nPsalms 102–3; 110; 116–19; 127–28; 135–39; 146–50\nSeptember 7–13\nProverbs 1–4; 15–16; 22; 31; Ecclesiastes 1–3; 11–12\nThoughts to Keep in Mind\nProphets and Prophecy\nSeptember 14–20\nIsaiah 1–12\nSeptember 21–27\nIsaiah 13–14; 22; 24–30; 35\nOctober\nNovember\nDecember\nAppendixes\nSeptember 21–27. “A Marvellous Work and a Wonder”: Isaiah 13–14; 22; 24–30; 35\n“September 21–27. ‘A Marvellous Work and a Wonder’: Isaiah 13–14; 22; 24–30; 35,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“September 21–27. ‘A Marvellous Work and a Wonder,’”\nCome, Follow Me: 2026\nSacred Grove\n, by Brent Borup\nSeptember 21–27: “A Marvellous Work and a Wonder”\nIsaiah 13–14\n;\n22\n;\n24–30\n;\n35\nOne thing that the Lord asks prophets to do is to warn about the consequences of sin. For Old Testament prophets, this often meant telling the rulers of mighty kingdoms that they needed to repent. It was a dangerous task, but Isaiah was fearless, and his warnings to the kingdoms of his day—including Israel, Judah, and surrounding nations—were bold (see\nIsaiah 13–23\n).\nHowever, Isaiah also had a message of hope. Even though the prophesied destructions did come upon these kingdoms, Isaiah foresaw a chance for restoration and renewal. The Lord would invite His people to return to Him. He would make “the parched ground … become a pool, and the thirsty land springs of water” (\nIsaiah 35:7\n). He would perform “a marvellous work and a wonder” (\nIsaiah 29:14\n), restoring to Israel the blessings He had promised them. Neither Isaiah nor anyone else alive at that time lived to see this marvelous work. But we are seeing it today. In fact, we are part of it.\nIdeas for Learning at Home and at Church\nIsaiah 13:1–11, 19–22\n;\n14:1–20\nPride and worldliness will fail.\nIn Isaiah’s day, Babylon was a mighty kingdom with a powerful ruler. Now Babylon is ancient history. So why is Isaiah’s message to Babylon, in\nIsaiah 13–14\n, important to us today? Because Babylon symbolizes pride, greed, and sin, things that still surround us today. Think about this symbolism as you read\nIsaiah 13:1–11, 19–22\n;\n14:1–20\n. You might consider questions like these:\nWhat similarities do you see between the pride of the Babylonian king and the pride of Satan? (see\nIsaiah 14:4–20\n;\nMoses 4:1–4\n). What warnings do you find for yourself in these verses?\nHow does the Savior provide “rest from thy sorrow, and from thy fear”? (\nIsaiah 14:3\n).\n“He will swallow up death in victory” (\nIsaiah 25:8\n).\nIsaiah 22:22–23\n;\n24:21–23\n;\n25:6–8\n;\n26:19\n;\n28:16\nJesus Christ is the promised Messiah.\nThe teachings of Isaiah often refer to the Savior’s mission, including His atoning sacrifice, Resurrection, and Second Coming. What aspects of His mission come to mind as you read these verses:\nIsaiah 22:22–23\n;\n24:21–23\n;\n25:6–8\n;\n26:19\n;\n28:16\n? What other passages do you find that remind you of the Savior?\nGive learners opportunities to bear testimony of Jesus Christ.\n“To be a teacher of Jesus Christ’s gospel means to help others understand and rely on His teachings, redeeming power, and perfect love” (\nTeaching in the Savior’s Way\n,\n8\n). One simple way to do that every time you teach is to ask a question like “What did you find in the scriptures this week that taught you something about the Savior?” Then let learners share their experiences and strengthen each other’s faith.\nIsaiah 24:1–12\n;\n28:1–8\n;\n29:7–13\n;\n30:8–14\nTurning away from the Lord brings spiritual danger.\nIn His mercy, the Lord sent Isaiah to warn the covenant people that they were straying from Him. See if you can find the spiritual warning signs of this in\nIsaiah 24:5\n;\n29:13\n;\n30:8–12\n. Why are these attitudes and actions spiritually dangerous?\nTo warn about the consequences of turning away from the Lord, Isaiah used some memorable comparisons. As you study them, ask yourself how turning away from the Lord is like:\nA sad, empty earth (\nIsaiah 24:1–12\n).\nDrunkenness (\nIsaiah 28:7–8\n).\nHunger and thirst (\nIsaiah 29:7–10\n).\nA broken wall or vessel (\nIsaiah 30:13–14\n).\nWhy is it important to you to stay close to the Lord?\nIsaiah 29\n;\n30:18–26\n;\n35\nThe Lord can restore what is lost or broken.\nHave you ever lost something that you thought you would never find again? Or maybe something broke, and you worried that it could never be repaired. When we turn away from the Lord, Satan wants us to think that we can never return or be healed. However, Isaiah described some of the marvelous things the Lord will do to help us return to Him. What do you learn from\nIsaiah 29:13–24\n;\n30:18–26\n;\n35\nabout the Lord, His love, and His power? Perhaps you could find a phrase in these passages that gives you hope when you need healing. You could also look in Sister Amy A. Wright’s message “\nChrist Heals That Which Is Broken\n” (\nLiahona\n, May 2022, 81–84).\nOne way the Lord manifests His power and mercy is through the Restoration of His gospel.\nIsaiah 29\ncontains several passages that have parallels with events of the Restoration. For example:\nCompare\nIsaiah 29:11–12\nwith\n2 Nephi 27:6–26\nand\nJoseph Smith—History 1:63–65\n.\nCompare\nIsaiah 29:13–14\nwith\nDoctrine and Covenants 4\nand\nJoseph Smith—History 1:17–19\n.\nCompare\nIsaiah 29:18–24\nwith the\ntitle page of the Book of Mormon\n.\nIn your opinion, why are “marvellous” and “wonder” (\nIsaiah 29:14\n) good words to describe the Lord restoring His gospel? How can you help fulfill the prophecies about the Restoration? For ideas, look in Elder Gerrit W. Gong’s message “\nAll Nations, Kindreds, and Tongues\n” (\nEnsign\nor\nLiahona\n, Nov. 2020, 38–41).\nSee also “\nThe Restoration of the Fulness of the Gospel of Jesus Christ: A Bicentennial Proclamation to the World\n” (Gospel Library); “\nThe Morning Breaks\n,”\nHymns\n, no 1.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 14:3\n;\n25:8–9\n;\n28:16\nJesus Christ can save me from sin and death.\nHow will you help your children see the Savior in the writings of Isaiah? You might help them find phrases that remind them of Him in\nIsaiah 14:3\n;\n25:8\n; or\n28:16\n. They could also match these verses from Isaiah with other verses that teach about the Savior, such as\nMatthew 11:28–30\n;\n1 Corinthians 15:53–57\n;\nHelaman 5:12\n. What great things has the Lord done for us?\nAfter reading\nIsaiah 25:8–9\ntogether, you could look at pictures of the Savior in Gethsemane, on the cross, and after His Resurrection. Let your children talk about what is happening in the pictures and why they love Jesus and “rejoice in his salvation” (\nverse 9\n).\nYou might choose to tell your children about the sadness you felt when someone you love passed away. Testify of the comfort you receive because of Jesus Christ. Maybe your children could draw a crying face and then erase the tears as you read\nIsaiah 25:8\ntogether.\nThy Will Be Done\n, by Ken Spencer\nIsaiah 25:4–6\nJesus gives me “refuge from the storm.”\nHave you and your children ever experienced the blessing of safe shelter during a storm or shade on a hot summer day? Or have you enjoyed a good meal when you were hungry? Talk about these experiences as you read\nIsaiah 25:4–6\n. How is Jesus like these things?\nIsaiah 29:11–18, 24\nThe Restoration of the gospel is a “marvellous work.”\nAs you and your children read\nIsaiah 29:14\n, share with them other words that mean the same thing as “marvellous” and “wonder.” Let them help you find objects or pictures that represent some of the Lord’s marvelous works during the latter days. These might include a copy of the Book of Mormon, a picture of a temple, or a picture of the First Vision (there’s one at the beginning of this outline). Then your children could choose an item and share why it is marvelous to them.\nA song about the Restoration of the gospel could go well with\nIsaiah 29\n, such as “\nOn a Golden Springtime\n” (\nChildren’s Songbook\n, 88). And perhaps a personal experience could help the children understand what\nrestoration\nmeans. For example, you and your children could talk about something that you lost and how you found it. Help your children compare this to the Restoration of the gospel. According to\nIsaiah 29:13–15\n, why do we need the Restoration? What marvelous works is the Lord doing to restore His gospel? (see this week’s activity page).\nFor more, see this month’s issue of the\nFriend\nmagazine.\nThe Crucifixion\n, by Carl Heinrich Bloch, at the Frederiksborg Museum of National History\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Isaiah 13",
      "title": "Isaiah 13",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/13?lang=eng",
      "summary": "The destruction of Babylon is a type of the destruction at the Second ComingâIt will be a day of wrath and vengeanceâBabylon (the world) will fall foreverâCompare2Â Nephi 23.",
      "verses": [
        "1TheburdenofBabylon, which Isaiah the son of Amoz did see.",
        "2Lift ye up abannerupon the highmountain,exaltthe voice unto them, shake the hand, that they may go into the gates of the nobles.",
        "3I have commanded mysanctified ones, I have also called mymightyones for mine anger,eventhem that rejoice in my highness.",
        "4The noise of a multitude in the mountains, like as of a great people; a tumultuous noise of thekingdomsof nations gathered together: theLordof hosts mustereth the host of thebattle.",
        "5They come from a far country, from the end of heaven,eventheLord, and the weapons of his indignation, todestroythe whole land.",
        "6Â¶Howlye; for thedayof theLordisat hand; it shall come as a destruction from the Almighty.",
        "7Therefore shall all hands be faint, and every manâs heart shallmelt:",
        "8And they shall be afraid: pangs and sorrows shall take hold of them; they shall be inpainas a woman thattravaileth: they shall be amazed one at another; their facesshall be asflames.",
        "9Behold, the day of theLordcometh, cruel both with wrath and fierce anger, to lay the land desolate: and he shalldestroythe sinners thereof out of it.",
        "10For the stars of heaven and the constellations thereof shall not give their light: the sun shall bedarkenedin his going forth, and the moon shall not cause her light to shine.",
        "11And I willpunishtheworldfortheirevil, and the wicked for their iniquity; and I will cause the arrogancy of the proud to cease, and will lay low thehaughtinessof theterrible.",
        "12I will make a man morepreciousthan fine gold; even a man than thegoldenwedge of Ophir.",
        "13Therefore I willshakethe heavens, and theearthshallremoveout of her place, in the wrath of theLordof hosts, and in the day of his fierceanger.",
        "14And it shall be as thechased roe, and as a sheep thatno man taketh up: they shall every man turn to his ownpeople, and flee every one into his ownland.",
        "15Every one that is found shall bethrustthrough; and every one that is joinedunto themshall fall by the sword.",
        "16Theirchildrenalso shall be dashed to pieces before their eyes; theirhousesshall bespoiled, and their wives ravished.",
        "17Behold, I will stir up theMedesagainst them, which shall not regard silver; andas forgold, they shall not delight in it.",
        "18Theirbows also shall dash the young men to pieces; and they shall have no pity on the fruit of the womb; their eye shall not spare children.",
        "19Â¶AndBabylon, the glory of kingdoms, thebeautyof theChaldeesâexcellency, shall be as when GodoverthrewSodomand Gomorrah.",
        "20It shall never beinhabited, neither shall it be dwelt in from generation to generation: neither shall the Arabian pitch tent there; neither shall the shepherds make their fold there.",
        "21Butwildbeasts of the desert shall lie there; and their houses shall be full of doleful creatures; and owls shall dwell there, andsatyrsshall dance there.",
        "22And the wild beasts of the islands shall cry in their desolatehouses, anddragonsintheirpleasant palaces: and her timeisnear to come, and her days shall not be prolonged."
      ],
      "full_text": "1TheburdenofBabylon, which Isaiah the son of Amoz did see. 2Lift ye up abannerupon the highmountain,exaltthe voice unto them, shake the hand, that they may go into the gates of the nobles. 3I have commanded mysanctified ones, I have also called mymightyones for mine anger,eventhem that rejoice in my highness. 4The noise of a multitude in the mountains, like as of a great people; a tumultuous noise of thekingdomsof nations gathered together: theLordof hosts mustereth the host of thebattle. 5They come from a far country, from the end of heaven,eventheLord, and the weapons of his indignation, todestroythe whole land. 6Â¶Howlye; for thedayof theLordisat hand; it shall come as a destruction from the Almighty. 7Therefore shall all hands be faint, and every manâs heart shallmelt: 8And they shall be afraid: pangs and sorrows shall take hold of them; they shall be inpainas a woman thattravaileth: they shall be amazed one at another; their facesshall be asflames. 9Behold, the day of theLordcometh, cruel both with wrath and fierce anger, to lay the land desolate: and he shalldestroythe sinners thereof out of it. 10For the stars of heaven and the constellations thereof shall not give their light: the sun shall bedarkenedin his going forth, and the moon shall not cause her light to shine. 11And I willpunishtheworldfortheirevil, and the wicked for their iniquity; and I will cause the arrogancy of the proud to cease, and will lay low thehaughtinessof theterrible. 12I will make a man morepreciousthan fine gold; even a man than thegoldenwedge of Ophir. 13Therefore I willshakethe heavens, and theearthshallremoveout of her place, in the wrath of theLordof hosts, and in the day of his fierceanger. 14And it shall be as thechased roe, and as a sheep thatno man taketh up: they shall every man turn to his ownpeople, and flee every one into his ownland. 15Every one that is found shall bethrustthrough; and every one that is joinedunto themshall fall by the sword. 16Theirchildrenalso shall be dashed to pieces before their eyes; theirhousesshall bespoiled, and their wives ravished. 17Behold, I will stir up theMedesagainst them, which shall not regard silver; andas forgold, they shall not delight in it. 18Theirbows also shall dash the young men to pieces; and they shall have no pity on the fruit of the womb; their eye shall not spare children. 19Â¶AndBabylon, the glory of kingdoms, thebeautyof theChaldeesâexcellency, shall be as when GodoverthrewSodomand Gomorrah. 20It shall never beinhabited, neither shall it be dwelt in from generation to generation: neither shall the Arabian pitch tent there; neither shall the shepherds make their fold there. 21Butwildbeasts of the desert shall lie there; and their houses shall be full of doleful creatures; and owls shall dwell there, andsatyrsshall dance there. 22And the wild beasts of the islands shall cry in their desolatehouses, anddragonsintheirpleasant palaces: and her timeisnear to come, and her days shall not be prolonged."
    },
    {
      "reference": "Isaiah 14",
      "title": "Isaiah 14",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/14?lang=eng",
      "summary": "Israel will be gathered and enjoy millennial restâLucifer was cast out of heaven for rebellionâIsrael will triumph over Babylon (the world)âCompare2Â Nephi 24.",
      "verses": [
        "1FortheLordwill havemercyon Jacob, and will yetchooseIsrael, and set them in their ownland: and thestrangersshall be joined with them, and they shall cleave to the house of Jacob.",
        "2And thepeople shall take them, andbringthem to their place: and the house of Israel shall possess them in the land of theLordfor servants and handmaids: and they shall take themcaptives, whose captives they were; and they shallruleover their oppressors.",
        "3And it shall come to pass in the day that theLordshall give thee rest from thy sorrow, and from thy fear, and from the hard bondage wherein thou wast made to serve,",
        "4Â¶That thou shalt take up thisproverbagainst the king ofBabylon, and say, How hath the oppressor ceased! thegoldencity ceased!",
        "5TheLordhath broken thestaffof thewicked,andthe sceptre of the rulers.",
        "6He who smote the people in wrath witha continual stroke, he that ruled the nations in anger, is persecuted,andnone hindereth.",
        "7The whole earth is atrest,andis quiet: they break forth into singing.",
        "8Yea, thefir treesrejoice at thee,andthe cedars of Lebanon,saying,Since thou artlaid down,nofeller is come up against us.",
        "9Hellfrom beneath is moved for thee to meettheeat thy coming: it stirreth up thedeadfor thee,evenall the chief ones of the earth; it hath raised up from their thrones all the kings of the nations.",
        "10All they shall speak and say unto thee, Art thou also become weak as we? art thou become like unto us?",
        "11Thy pomp is brought down tothe grave,andthe noise of thyviols: the worm is spread under thee, and the worms cover thee.",
        "12How art thoufallenfromheaven, OLucifer, son of the morning!howart thou cut down to the ground, which didst weaken thenations!",
        "13For thou hast said in thineheart,Iwill ascend into heaven, I willexaltmythroneabove the stars of God: I will sit also upon the mount of the congregation, in the sides of thenorth:",
        "14I will ascend above the heights of the clouds; I will be like themostHigh.",
        "15Yet thou shalt be brought down tohell, to the sides of the pit.",
        "16They that seetheeshallnarrowly look upon thee,andconsider thee,saying, Isthis the man that made the earth to tremble, that did shake kingdoms;",
        "17Thatmade the world as a wilderness, and destroyed the cities thereof;thatopened not the house of his prisoners?",
        "18All the kings of the nations,evenall of them, lie inglory, every one inhis own house.",
        "19But thou art cast out of thy grave likean abominable branch,and asthe raiment of those that are slain, thrust through with a sword, that go down tothe stonesof the pit; as a carcase trodden under feet.",
        "20Thou shalt not bejoinedwith them in burial, because thou hast destroyed thy land,andslain thy people: theseedofevildoersshall never be renowned.",
        "21Prepareslaughter for his children for the iniquity of their fathers; that they do not rise, nor possess the land, nor fill the face of the world with cities.",
        "22For I will rise up against them, saith theLordof hosts, andcut offfrom Babylon the name, and remnant, and son, and nephew, saith theLord.",
        "23I will also make it a possession for thebittern, and pools of water: and I will sweep it with thebesomof destruction, saith theLordof hosts.",
        "24Â¶TheLordof hosts hath sworn, saying, Surely as I have thought, so shall it come to pass; and as I have purposed,soshall it stand:",
        "25ThatIwill break the Assyrian in my land, and uponmy mountainstread him under foot: then shall hisyokedepart from off them, and his burden depart from off their shoulders.",
        "26Thisisthe purpose that is purposed upon the wholeearth: and thisisthe hand that is stretched out uponall the nations.",
        "27For theLordof hosts hathpurposed, and who shall disannulit?and his handisstretched out, and who shall turn it back?",
        "28In theyearthat kingAhazdied was thisburden.",
        "29Â¶Rejoice not thou, wholePalestina, because the rod of him that smote thee is broken: for out of the serpentâs root shall come forth a cockatrice, and his fruitshall bea fiery flying serpent.",
        "30And the firstborn of the poor shall feed, and the needy shall lie down in safety: and I will kill thy root with famine, and he shall slay thy remnant.",
        "31Howl, O gate; cry, O city; thou, wholePalestina,artdissolved: for there shall come from the north a smoke, and noneshall bealone in his appointed times.",
        "32What shallonethen answer the messengers of thenation? That theLordhath foundedZion, and thepoorof his people shalltrust in it."
      ],
      "full_text": "1FortheLordwill havemercyon Jacob, and will yetchooseIsrael, and set them in their ownland: and thestrangersshall be joined with them, and they shall cleave to the house of Jacob. 2And thepeople shall take them, andbringthem to their place: and the house of Israel shall possess them in the land of theLordfor servants and handmaids: and they shall take themcaptives, whose captives they were; and they shallruleover their oppressors. 3And it shall come to pass in the day that theLordshall give thee rest from thy sorrow, and from thy fear, and from the hard bondage wherein thou wast made to serve, 4Â¶That thou shalt take up thisproverbagainst the king ofBabylon, and say, How hath the oppressor ceased! thegoldencity ceased! 5TheLordhath broken thestaffof thewicked,andthe sceptre of the rulers. 6He who smote the people in wrath witha continual stroke, he that ruled the nations in anger, is persecuted,andnone hindereth. 7The whole earth is atrest,andis quiet: they break forth into singing. 8Yea, thefir treesrejoice at thee,andthe cedars of Lebanon,saying,Since thou artlaid down,nofeller is come up against us. 9Hellfrom beneath is moved for thee to meettheeat thy coming: it stirreth up thedeadfor thee,evenall the chief ones of the earth; it hath raised up from their thrones all the kings of the nations. 10All they shall speak and say unto thee, Art thou also become weak as we? art thou become like unto us? 11Thy pomp is brought down tothe grave,andthe noise of thyviols: the worm is spread under thee, and the worms cover thee. 12How art thoufallenfromheaven, OLucifer, son of the morning!howart thou cut down to the ground, which didst weaken thenations! 13For thou hast said in thineheart,Iwill ascend into heaven, I willexaltmythroneabove the stars of God: I will sit also upon the mount of the congregation, in the sides of thenorth: 14I will ascend above the heights of the clouds; I will be like themostHigh. 15Yet thou shalt be brought down tohell, to the sides of the pit. 16They that seetheeshallnarrowly look upon thee,andconsider thee,saying, Isthis the man that made the earth to tremble, that did shake kingdoms; 17Thatmade the world as a wilderness, and destroyed the cities thereof;thatopened not the house of his prisoners? 18All the kings of the nations,evenall of them, lie inglory, every one inhis own house. 19But thou art cast out of thy grave likean abominable branch,and asthe raiment of those that are slain, thrust through with a sword, that go down tothe stonesof the pit; as a carcase trodden under feet. 20Thou shalt not bejoinedwith them in burial, because thou hast destroyed thy land,andslain thy people: theseedofevildoersshall never be renowned. 21Prepareslaughter for his children for the iniquity of their fathers; that they do not rise, nor possess the land, nor fill the face of the world with cities. 22For I will rise up against them, saith theLordof hosts, andcut offfrom Babylon the name, and remnant, and son, and nephew, saith theLord. 23I will also make it a possession for thebittern, and pools of water: and I will sweep it with thebesomof destruction, saith theLordof hosts. 24Â¶TheLordof hosts hath sworn, saying, Surely as I have thought, so shall it come to pass; and as I have purposed,soshall it stand: 25ThatIwill break the Assyrian in my land, and uponmy mountainstread him under foot: then shall hisyokedepart from off them, and his burden depart from off their shoulders. 26Thisisthe purpose that is purposed upon the wholeearth: and thisisthe hand that is stretched out uponall the nations. 27For theLordof hosts hathpurposed, and who shall disannulit?and his handisstretched out, and who shall turn it back? 28In theyearthat kingAhazdied was thisburden. 29Â¶Rejoice not thou, wholePalestina, because the rod of him that smote thee is broken: for out of the serpentâs root shall come forth a cockatrice, and his fruitshall bea fiery flying serpent. 30And the firstborn of the poor shall feed, and the needy shall lie down in safety: and I will kill thy root with famine, and he shall slay thy remnant. 31Howl, O gate; cry, O city; thou, wholePalestina,artdissolved: for there shall come from the north a smoke, and noneshall bealone in his appointed times. 32What shallonethen answer the messengers of thenation? That theLordhath foundedZion, and thepoorof his people shalltrust in it."
    },
    {
      "reference": "Isaiah 22",
      "title": "Isaiah 22",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/22?lang=eng",
      "summary": "Jerusalem will be attacked and scourgedâThe people will be carried captiveâThe Messiah will hold the key of the house of David, inheritglory, and be fastened as a nail in a sure place.",
      "verses": [
        "1Theburdenof the valley of vision. What aileth thee now, that thou art wholly gone up to the housetops?",
        "2Thou that art full ofstirs, a tumultuous city, a joyous city: thy slainmen arenot slain with the sword, nor dead in battle.",
        "3All thy rulers are fled together, they are bound by the archers: all that are found in thee are bound together,whichhave fled from far.",
        "4Therefore said I, Look away from me; I willweepbitterly, labour not to comfort me, because of the spoiling of the daughter of my people.",
        "5Forit isa day oftrouble, and of treading down, and of perplexity by the LordGodof hosts in the valley of vision, breaking down the walls, and of crying to the mountains.",
        "6And Elam bare the quiver with chariots of menandhorsemen, and Kir uncovered the shield.",
        "7And it shall come to pass,thatthy choicest valleys shall be full of chariots, and the horsemen shall set themselves in array at the gate.",
        "8Â¶And hediscoveredthe covering of Judah, and thou didst look in that day to the armour of thehouseof the forest.",
        "9Ye have seen also thebreachesof the city of David, that they are many: and ye gathered together the waters of the lowerpool.",
        "10And ye have numbered the houses of Jerusalem, and the houses have ye broken down to fortify the wall.",
        "11Ye made also aditchbetween the two walls for the water of the old pool: but ye have not looked unto themakerthereof, neither had respect unto him that fashioned it long ago.",
        "12And in that day did the LordGodof hostscalltoweeping, and to mourning, and tobaldness, and to girding with sackcloth:",
        "13And beholdjoyand gladness, slaying oxen, and killing sheep, eating flesh, and drinking wine: let useatand drink; forto morrowwe shall die.",
        "14And it was revealed in mine ears by theLordof hosts, Surely this iniquity shall not be purged from you till ye die, saith the LordGodof hosts.",
        "15Â¶Thus saith the LordGodof hosts, Go, get thee unto this treasurer,evenuntoShebna, whichisover the house,and say,",
        "16What hast thou here? and whom hast thou here, that thou hast hewed thee out a sepulchre here,ashe that heweth him out a sepulchre on high,andthat graveth an habitation for himself in a rock?",
        "17Behold, theLordwill carry thee away with a mighty captivity, and will surely cover thee.",
        "18He will surely violently turn and toss theelikea ball into a largecountry: there shalt thou die, and there the chariots of thy gloryshall bethe shame of thy lordâs house.",
        "19And I will drive thee from thy station, and from thy state shall he pull thee down.",
        "20Â¶And it shall come to pass in that day, that I willcallmy servantEliakimthe son of Hilkiah:",
        "21And I will clothe him with thy robe, and strengthen him with thy girdle, and I will commit thygovernmentinto his hand: and he shall be a father to the inhabitants of Jerusalem, and to the house of Judah.",
        "22And thekeyof the house of David will I lay upon his shoulder; so he shall open, and none shall shut; and he shall shut, and none shall open.",
        "23And I will fasten himasanailin a sure place; and he shall be for a glorious throne to his fatherâs house.",
        "24And they shall hang upon him all the glory of his fatherâs house, the offspring and the issue, all vessels of small quantity, from the vessels of cups, even to all the vessels of flagons.",
        "25In that day, saith theLordof hosts, shall the nail that is fastened in the sure place be removed, and be cut down, and fall; and the burden thatwasupon it shall be cut off: for theLordhath spokenit."
      ],
      "full_text": "1Theburdenof the valley of vision. What aileth thee now, that thou art wholly gone up to the housetops? 2Thou that art full ofstirs, a tumultuous city, a joyous city: thy slainmen arenot slain with the sword, nor dead in battle. 3All thy rulers are fled together, they are bound by the archers: all that are found in thee are bound together,whichhave fled from far. 4Therefore said I, Look away from me; I willweepbitterly, labour not to comfort me, because of the spoiling of the daughter of my people. 5Forit isa day oftrouble, and of treading down, and of perplexity by the LordGodof hosts in the valley of vision, breaking down the walls, and of crying to the mountains. 6And Elam bare the quiver with chariots of menandhorsemen, and Kir uncovered the shield. 7And it shall come to pass,thatthy choicest valleys shall be full of chariots, and the horsemen shall set themselves in array at the gate. 8Â¶And hediscoveredthe covering of Judah, and thou didst look in that day to the armour of thehouseof the forest. 9Ye have seen also thebreachesof the city of David, that they are many: and ye gathered together the waters of the lowerpool. 10And ye have numbered the houses of Jerusalem, and the houses have ye broken down to fortify the wall. 11Ye made also aditchbetween the two walls for the water of the old pool: but ye have not looked unto themakerthereof, neither had respect unto him that fashioned it long ago. 12And in that day did the LordGodof hostscalltoweeping, and to mourning, and tobaldness, and to girding with sackcloth: 13And beholdjoyand gladness, slaying oxen, and killing sheep, eating flesh, and drinking wine: let useatand drink; forto morrowwe shall die. 14And it was revealed in mine ears by theLordof hosts, Surely this iniquity shall not be purged from you till ye die, saith the LordGodof hosts. 15Â¶Thus saith the LordGodof hosts, Go, get thee unto this treasurer,evenuntoShebna, whichisover the house,and say, 16What hast thou here? and whom hast thou here, that thou hast hewed thee out a sepulchre here,ashe that heweth him out a sepulchre on high,andthat graveth an habitation for himself in a rock? 17Behold, theLordwill carry thee away with a mighty captivity, and will surely cover thee. 18He will surely violently turn and toss theelikea ball into a largecountry: there shalt thou die, and there the chariots of thy gloryshall bethe shame of thy lordâs house. 19And I will drive thee from thy station, and from thy state shall he pull thee down. 20Â¶And it shall come to pass in that day, that I willcallmy servantEliakimthe son of Hilkiah: 21And I will clothe him with thy robe, and strengthen him with thy girdle, and I will commit thygovernmentinto his hand: and he shall be a father to the inhabitants of Jerusalem, and to the house of Judah. 22And thekeyof the house of David will I lay upon his shoulder; so he shall open, and none shall shut; and he shall shut, and none shall open. 23And I will fasten himasanailin a sure place; and he shall be for a glorious throne to his fatherâs house. 24And they shall hang upon him all the glory of his fatherâs house, the offspring and the issue, all vessels of small quantity, from the vessels of cups, even to all the vessels of flagons. 25In that day, saith theLordof hosts, shall the nail that is fastened in the sure place be removed, and be cut down, and fall; and the burden thatwasupon it shall be cut off: for theLordhath spokenit."
    },
    {
      "reference": "Isaiah 24",
      "title": "Isaiah 24",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/24?lang=eng",
      "summary": "Men will transgress the law and break the everlasting covenantâAt the Second Coming, they will be burned, the earth will reel, and the sun will be ashamedâThen the Lord will reign in Zion and in Jerusalem.",
      "verses": [
        "1Behold, theLordmaketh theearthempty, and maketh it waste, andturnethit upside down, and scattereth abroad the inhabitants thereof.",
        "2And it shall be, as with the people, so with the priest; as with the servant, so with his master; as with the maid, so with her mistress; as with thebuyer, so with the seller; as with the lender, so with the borrower; as withthetaker of usury, so with the giver of usury to him.",
        "3The land shall be utterly emptied, and utterly spoiled: for theLordhath spoken this word.",
        "4The earthmournethandfadeth away, the world languishethandfadeth away,thehaughty people of the earth do languish.",
        "5The earth also is defiled under the inhabitants thereof; because they havetransgressedthe laws,changedtheordinance,brokentheeverlastingcovenant.",
        "6Therefore hath thecursedevoured the earth, and they that dwell therein are desolate: therefore theinhabitantsof the earth areburned, andfewmen left.",
        "7The new wine mourneth, the vine languisheth, all the merryhearted do sigh.",
        "8The mirth oftabretsceaseth, the noise of them that rejoice endeth, the joy of the harp ceaseth.",
        "9They shall not drink wine with a song; strongdrinkshall be bitter to them that drink it.",
        "10The city of confusion is broken down: every house is shut up, that no man may come in.",
        "11There isa crying for wine in the streets; alljoyis darkened, the mirth of the land is gone.",
        "12In the city is left desolation, and the gate is smitten with destruction.",
        "13Â¶When thus it shall be in the midst of the land among thepeople,there shall beas the shaking of an olive tree,andas the gleaning grapes when the vintage is done.",
        "14Theyshall lift up their voice, they shall sing for the majesty of theLord, they shall cry aloud from the sea.",
        "15Wherefore glorify ye theLordin thefires,eventhe name of theLordGod of Israel in the isles of the sea.",
        "16Â¶From the uttermost part of the earth have we heard songs,evenglory to the righteous. But I said,Myleanness, my leanness, woe unto me! the treacherous dealers have dealt treacherously; yea,thetreacherous dealers have dealt very treacherously.",
        "17Fear, and the pit, and the snare,areupon thee, O inhabitant of the earth.",
        "18And it shall come to pass,thathe who fleeth from the noise of the fear shall fall into the pit; and he that cometh up out of the midst of the pit shall be taken in the snare: for the windows from on high are open, and the foundations of the earth do shake.",
        "19The earth is utterly broken down, the earth is clean dissolved, the earth ismovedexceedingly.",
        "20Theearthshall reel to and fro like a drunkard, and shall be removed like a cottage; and the transgression thereof shall be heavy upon it; and it shall fall, and not rise again.",
        "21And it shall come to pass in thatday,thattheLordshallpunishthe host of the high onesthat areon high, and the kings of the earth upon the earth.",
        "22And they shall be gathered together,asprisonersare gathered in the pit, and shall be shut up in theprison, and after many days shall they bevisited.",
        "23Then the moon shall be confounded, and the sunashamed, when theLordof hosts shall reign in mountZion, and in Jerusalem, and beforehis ancients gloriously."
      ],
      "full_text": "1Behold, theLordmaketh theearthempty, and maketh it waste, andturnethit upside down, and scattereth abroad the inhabitants thereof. 2And it shall be, as with the people, so with the priest; as with the servant, so with his master; as with the maid, so with her mistress; as with thebuyer, so with the seller; as with the lender, so with the borrower; as withthetaker of usury, so with the giver of usury to him. 3The land shall be utterly emptied, and utterly spoiled: for theLordhath spoken this word. 4The earthmournethandfadeth away, the world languishethandfadeth away,thehaughty people of the earth do languish. 5The earth also is defiled under the inhabitants thereof; because they havetransgressedthe laws,changedtheordinance,brokentheeverlastingcovenant. 6Therefore hath thecursedevoured the earth, and they that dwell therein are desolate: therefore theinhabitantsof the earth areburned, andfewmen left. 7The new wine mourneth, the vine languisheth, all the merryhearted do sigh. 8The mirth oftabretsceaseth, the noise of them that rejoice endeth, the joy of the harp ceaseth. 9They shall not drink wine with a song; strongdrinkshall be bitter to them that drink it. 10The city of confusion is broken down: every house is shut up, that no man may come in. 11There isa crying for wine in the streets; alljoyis darkened, the mirth of the land is gone. 12In the city is left desolation, and the gate is smitten with destruction. 13Â¶When thus it shall be in the midst of the land among thepeople,there shall beas the shaking of an olive tree,andas the gleaning grapes when the vintage is done. 14Theyshall lift up their voice, they shall sing for the majesty of theLord, they shall cry aloud from the sea. 15Wherefore glorify ye theLordin thefires,eventhe name of theLordGod of Israel in the isles of the sea. 16Â¶From the uttermost part of the earth have we heard songs,evenglory to the righteous. But I said,Myleanness, my leanness, woe unto me! the treacherous dealers have dealt treacherously; yea,thetreacherous dealers have dealt very treacherously. 17Fear, and the pit, and the snare,areupon thee, O inhabitant of the earth. 18And it shall come to pass,thathe who fleeth from the noise of the fear shall fall into the pit; and he that cometh up out of the midst of the pit shall be taken in the snare: for the windows from on high are open, and the foundations of the earth do shake. 19The earth is utterly broken down, the earth is clean dissolved, the earth ismovedexceedingly. 20Theearthshall reel to and fro like a drunkard, and shall be removed like a cottage; and the transgression thereof shall be heavy upon it; and it shall fall, and not rise again. 21And it shall come to pass in thatday,thattheLordshallpunishthe host of the high onesthat areon high, and the kings of the earth upon the earth. 22And they shall be gathered together,asprisonersare gathered in the pit, and shall be shut up in theprison, and after many days shall they bevisited. 23Then the moon shall be confounded, and the sunashamed, when theLordof hosts shall reign in mountZion, and in Jerusalem, and beforehis ancients gloriously."
    },
    {
      "reference": "Isaiah 25",
      "title": "Isaiah 25",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/25?lang=eng",
      "summary": "In Mount Zion the Lord will prepare a gospel feast of rich foodâHe will swallow up death in victoryâIt will be said, Lo, this is our God.",
      "verses": [
        "1OLord, thouartmy God; I will exalt thee, I will praise thy name; for thou hast done wonderfulthings; thycounsels of oldarefaithfulnessandtruth.",
        "2For thou hast made of a city an heap;ofa defenced city a ruin: a palace of strangers to be no city; it shall never be built.",
        "3Therefore shall the strong people glorify thee, the city of the terrible nations shall fear thee.",
        "4For thou hast been a strength to thepoor, a strength to the needy in hisdistress, arefugefrom the storm, a shadow from the heat, when the blast of the terrible onesisas a stormagainstthe wall.",
        "5Thou shalt bring down the noise of strangers, as the heat in a dry place;eventhe heat with the shadow of a cloud: thebranchof the terrible ones shall be brought low.",
        "6Â¶And in this mountain shall theLordof hosts make unto allpeoplea feast of fat things, a feast of wines on the lees, of fat things full of marrow, of wines on the lees well refined.",
        "7And he will destroy in this mountain the face of the covering cast over all people, and theveilthat is spread over all nations.",
        "8He will swallow updeathinvictory; and the LordGodwill wipe away tears from off all faces; and therebuke of his peopleshall he take away from off all the earth: for theLordhath spokenit.",
        "9Â¶And it shall be said in that day, Lo, thisisourGod; we have waited for him, and he will save us: thisistheLord; we havewaitedfor him, we will be glad and rejoice in hissalvation.",
        "10For in this mountain shall the hand of theLordrest, and Moab shall be trodden down under him, even as straw is trodden down for the dunghill.",
        "11And he shall spread forth his hands in the midst of them, as he that swimmeth spreadeth forthhis handsto swim: and he shall bring down their pride together with the spoils of their hands.",
        "12And the fortress of the high fort of thy walls shall he bring down, lay low,andbring to the ground,evento thedust."
      ],
      "full_text": "1OLord, thouartmy God; I will exalt thee, I will praise thy name; for thou hast done wonderfulthings; thycounsels of oldarefaithfulnessandtruth. 2For thou hast made of a city an heap;ofa defenced city a ruin: a palace of strangers to be no city; it shall never be built. 3Therefore shall the strong people glorify thee, the city of the terrible nations shall fear thee. 4For thou hast been a strength to thepoor, a strength to the needy in hisdistress, arefugefrom the storm, a shadow from the heat, when the blast of the terrible onesisas a stormagainstthe wall. 5Thou shalt bring down the noise of strangers, as the heat in a dry place;eventhe heat with the shadow of a cloud: thebranchof the terrible ones shall be brought low. 6Â¶And in this mountain shall theLordof hosts make unto allpeoplea feast of fat things, a feast of wines on the lees, of fat things full of marrow, of wines on the lees well refined. 7And he will destroy in this mountain the face of the covering cast over all people, and theveilthat is spread over all nations. 8He will swallow updeathinvictory; and the LordGodwill wipe away tears from off all faces; and therebuke of his peopleshall he take away from off all the earth: for theLordhath spokenit. 9Â¶And it shall be said in that day, Lo, thisisourGod; we have waited for him, and he will save us: thisistheLord; we havewaitedfor him, we will be glad and rejoice in hissalvation. 10For in this mountain shall the hand of theLordrest, and Moab shall be trodden down under him, even as straw is trodden down for the dunghill. 11And he shall spread forth his hands in the midst of them, as he that swimmeth spreadeth forthhis handsto swim: and he shall bring down their pride together with the spoils of their hands. 12And the fortress of the high fort of thy walls shall he bring down, lay low,andbring to the ground,evento thedust."
    },
    {
      "reference": "Isaiah 26",
      "title": "Isaiah 26",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/26?lang=eng",
      "summary": "Trust in the Lord foreverâJehovah will die and be resurrectedâAll men will rise in the Resurrection.",
      "verses": [
        "1In that day shall this song be sung in the land of Judah; We have a strong city; salvation willGodappointforwallsand bulwarks.",
        "2Open ye thegates, that the righteous nation which keepeth the truth may enter in.",
        "3Thou wilt keephimin perfectpeace,whosemindisstayedon thee:because he trusteth in thee.",
        "4Trust ye in theLordfor ever: for in theLordJehovahiseverlastingstrength:",
        "5Â¶For he bringeth down them that dwell on high; the lofty city, he layeth it low; he layeth it low,evento the ground; he bringeth itevento the dust.",
        "6The foot shall tread it down,eventhe feet of the poor,andthe steps of the needy.",
        "7The way of the justisuprightness: thou, mostupright, dost weigh the path of the just.",
        "8Yea, in the way of thy judgments, OLord, have wewaitedfor thee; the desire ofoursoulisto thy name, and to the remembrance of thee.",
        "9With my soul have I desired thee in the night; yea, with my spirit within me will Iseektheeearly: for when thyjudgmentsarein the earth, the inhabitants of the world will learn righteousness.",
        "10Let favour be shewed to the wicked,yetwill he not learn righteousness: in the land of uprightness will he deal unjustly, and will not behold the majesty of theLord.",
        "11Lord,whenthy hand is lifted up, they will not see:buttheyshall see, and beashamedfortheirenvy at the people; yea, the fire of thine enemies shall devour them.",
        "12Â¶Lord, thou wilt ordain peace for us: for thou also hast wrought all ourworksin us.",
        "13OLordour God,otherlordsbeside thee have had dominion over us:butby thee only will we make mention of thy name.",
        "14Theyaredead, they shall not live;they aredeceased, they shallnot rise: therefore hast thou visited and destroyed them, and made all their memory to perish.",
        "15Thou hastincreasedthe nation, OLord, thou hast increased the nation: thou art glorified: thou hadstremoveditfaruntoall the ends of the earth.",
        "16Lord, introublehave they visited thee, they poured out a prayerwhenthychasteningwasupon them.",
        "17Like as a woman with child,thatdraweth near the time of her delivery, is in pain,andcrieth out in her pangs; so have we been in thy sight, OLord.",
        "18We have been with child, we have been in pain, we have as it were brought forth wind; we have not wrought any deliverance in the earth; neither have the inhabitants of the worldfallen.",
        "19Thy deadmenshalllive,together withmydead body shall theyarise. Awake and sing, ye that dwell in dust: for thy dewis asthe dew of herbs, and the earth shall cast out the dead.",
        "20Â¶Come, my people, enter thou into thy chambers, and shut thy doors about thee: hide thyself as it were for a little moment,untilthe indignation be overpast.",
        "21For, behold, theLordcometh out of his place to punish the inhabitants of the earth for their iniquity: the earth also shall disclose herblood, and shall no more cover her slain."
      ],
      "full_text": "1In that day shall this song be sung in the land of Judah; We have a strong city; salvation willGodappointforwallsand bulwarks. 2Open ye thegates, that the righteous nation which keepeth the truth may enter in. 3Thou wilt keephimin perfectpeace,whosemindisstayedon thee:because he trusteth in thee. 4Trust ye in theLordfor ever: for in theLordJehovahiseverlastingstrength: 5Â¶For he bringeth down them that dwell on high; the lofty city, he layeth it low; he layeth it low,evento the ground; he bringeth itevento the dust. 6The foot shall tread it down,eventhe feet of the poor,andthe steps of the needy. 7The way of the justisuprightness: thou, mostupright, dost weigh the path of the just. 8Yea, in the way of thy judgments, OLord, have wewaitedfor thee; the desire ofoursoulisto thy name, and to the remembrance of thee. 9With my soul have I desired thee in the night; yea, with my spirit within me will Iseektheeearly: for when thyjudgmentsarein the earth, the inhabitants of the world will learn righteousness. 10Let favour be shewed to the wicked,yetwill he not learn righteousness: in the land of uprightness will he deal unjustly, and will not behold the majesty of theLord. 11Lord,whenthy hand is lifted up, they will not see:buttheyshall see, and beashamedfortheirenvy at the people; yea, the fire of thine enemies shall devour them. 12Â¶Lord, thou wilt ordain peace for us: for thou also hast wrought all ourworksin us. 13OLordour God,otherlordsbeside thee have had dominion over us:butby thee only will we make mention of thy name. 14Theyaredead, they shall not live;they aredeceased, they shallnot rise: therefore hast thou visited and destroyed them, and made all their memory to perish. 15Thou hastincreasedthe nation, OLord, thou hast increased the nation: thou art glorified: thou hadstremoveditfaruntoall the ends of the earth. 16Lord, introublehave they visited thee, they poured out a prayerwhenthychasteningwasupon them. 17Like as a woman with child,thatdraweth near the time of her delivery, is in pain,andcrieth out in her pangs; so have we been in thy sight, OLord. 18We have been with child, we have been in pain, we have as it were brought forth wind; we have not wrought any deliverance in the earth; neither have the inhabitants of the worldfallen. 19Thy deadmenshalllive,together withmydead body shall theyarise. Awake and sing, ye that dwell in dust: for thy dewis asthe dew of herbs, and the earth shall cast out the dead. 20Â¶Come, my people, enter thou into thy chambers, and shut thy doors about thee: hide thyself as it were for a little moment,untilthe indignation be overpast. 21For, behold, theLordcometh out of his place to punish the inhabitants of the earth for their iniquity: the earth also shall disclose herblood, and shall no more cover her slain."
    },
    {
      "reference": "Isaiah 27",
      "title": "Isaiah 27",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/27?lang=eng",
      "summary": "The people of Israel will blossom and bud and fill the earth with fruitâThey will be gathered one by one and will worship the Lord.",
      "verses": [
        "1In that day theLordwith hissoreand great and strongswordshall punishleviathanthe piercing serpent, even leviathan that crookedserpent; and he shall slay thedragonthatisin the sea.",
        "2In that daysingye unto her, A vineyard of red wine.",
        "3I theLorddo keep it; I will water it every moment: lestanyhurt it, I will keep it night and day.",
        "4Furyisnot in me: who would set the briersandthorns against me in battle? I would go through them, I would burn them together.",
        "5Or let him take hold of my strength,thathe may make peace with me;andhe shall make peace with me.",
        "6He shall cause them that come of Jacob to take root:Israelshall blossom and bud, and fill the face of the world withfruit.",
        "7Â¶Hath he smitten him, as he smote those that smote him?oris he slain according to the slaughter of them that are slain by him?",
        "8In measure, when it shooteth forth, thou wilt debate with it: he stayeth his rough wind in the day of the east wind.",
        "9By this therefore shall the iniquity of Jacob bepurged; and thisisall the fruit to take away his sin; when he maketh all the stones of thealtar as chalkstones that are beaten in sunder, the groves andimagesshall not stand up.",
        "10Yet the defenced cityshall bedesolate,andthe habitation forsaken, and left like a wilderness: there shall the calf feed, and there shall he lie down, and consume the branches thereof.",
        "11When theboughsthereof are withered, they shall be broken off: the women come,andset them on fire: for itisa people of nounderstanding: therefore he thatmadethem will not have mercy on them, and he that formed them will shew them no favour.",
        "12Â¶And it shall come to pass in that day,thattheLordshallbeat offfromthe channel of the river unto the stream of Egypt, and ye shall begatheredone by one, O ye children of Israel.",
        "13And it shall come to pass in that day,thatthegreat trumpetshall be blown, and they shall come which were ready to perish in the land of Assyria, and the outcasts in the land of Egypt, and shall worship theLordin theholymount at Jerusalem."
      ],
      "full_text": "1In that day theLordwith hissoreand great and strongswordshall punishleviathanthe piercing serpent, even leviathan that crookedserpent; and he shall slay thedragonthatisin the sea. 2In that daysingye unto her, A vineyard of red wine. 3I theLorddo keep it; I will water it every moment: lestanyhurt it, I will keep it night and day. 4Furyisnot in me: who would set the briersandthorns against me in battle? I would go through them, I would burn them together. 5Or let him take hold of my strength,thathe may make peace with me;andhe shall make peace with me. 6He shall cause them that come of Jacob to take root:Israelshall blossom and bud, and fill the face of the world withfruit. 7Â¶Hath he smitten him, as he smote those that smote him?oris he slain according to the slaughter of them that are slain by him? 8In measure, when it shooteth forth, thou wilt debate with it: he stayeth his rough wind in the day of the east wind. 9By this therefore shall the iniquity of Jacob bepurged; and thisisall the fruit to take away his sin; when he maketh all the stones of thealtar as chalkstones that are beaten in sunder, the groves andimagesshall not stand up. 10Yet the defenced cityshall bedesolate,andthe habitation forsaken, and left like a wilderness: there shall the calf feed, and there shall he lie down, and consume the branches thereof. 11When theboughsthereof are withered, they shall be broken off: the women come,andset them on fire: for itisa people of nounderstanding: therefore he thatmadethem will not have mercy on them, and he that formed them will shew them no favour. 12Â¶And it shall come to pass in that day,thattheLordshallbeat offfromthe channel of the river unto the stream of Egypt, and ye shall begatheredone by one, O ye children of Israel. 13And it shall come to pass in that day,thatthegreat trumpetshall be blown, and they shall come which were ready to perish in the land of Assyria, and the outcasts in the land of Egypt, and shall worship theLordin theholymount at Jerusalem."
    },
    {
      "reference": "Isaiah 28",
      "title": "Isaiah 28",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/28?lang=eng",
      "summary": "Woe to the drunkards of Ephraim!âRevelation comes line upon line and precept upon preceptâChrist, the sure foundation, is promised.",
      "verses": [
        "1Woe to the crown of pride, to thedrunkardsofEphraim, whose glorious beautyisa fading flower, whichareon the head ofthe fat valleysof them that are overcome with wine!",
        "2Behold, the Lord hath a mighty and strong one,whichas atempestof hailanda destroyingstorm, as a flood of mighty waters overflowing, shall cast down to the earth with the hand.",
        "3The crown of pride, the drunkards of Ephraim, shall be trodden under feet:",
        "4And the glorious beauty, whichison the head of the fat valley, shall be a fading flower,andas thehasty fruitbefore the summer; whichwhenhe that looketh upon it seeth, while it is yet in his hand he eateth it up.",
        "5Â¶Inthat dayshall theLordof hosts be for a crown ofglory, and for a diadem of beauty, unto the residue of his people,",
        "6And for a spirit of judgment to him that sitteth in judgment, and for strength to them that turn the battle to the gate.",
        "7Â¶Buttheyalso haveerredthroughwine, and through strong drink are out of the way; the priest and theprophethave erred through strong drink, they are swallowed up of wine, they are out of the way through strong drink; they err in vision, they stumbleinjudgment.",
        "8For all tables are full of vomitandfilthiness,so that there isno placeclean.",
        "9Â¶Whom shall he teachknowledge? and whom shall he make to understand doctrine?them that areweanedfrom themilk,anddrawn from the breasts.",
        "10For preceptmust beupon precept,preceptupon precept; lineupon line, line upon line; here a little,andthere a little:",
        "11For with stammering lips and another tongue will he speak to this people.",
        "12To whom he said, Thisisthe restwherewithye may cause the weary to rest; and thisisthe refreshing: yet they would not hear.",
        "13But the word of theLordwas unto them precept upon precept,preceptupon precept; line upon line, line upon line; here a little,andthere a little; that they might go, andfallbackward, and be broken, and snared, and taken.",
        "14Â¶Wherefore hear the word of theLord, ye scornful men, that rule this people whichisin Jerusalem.",
        "15Because ye have said, We have made a covenant with death, and with hell are we at agreement; when the overflowingscourgeshall pass through, it shall not come unto us: for we have made lies ourrefuge, and under falsehood have we hid ourselves:",
        "16Â¶Therefore thus saith the LordGod, Behold, I lay in Zion for afoundationastone, a tried stone, a preciouscornerstone,a sure foundation: he that believeth shall not make haste.",
        "17Judgment also will I lay to the line, and righteousness to the plummet: and the hail shall sweep away the refuge of lies, and the waters shall overflow the hiding place.",
        "18Â¶Andyour covenant with deathshall be disannulled, and your agreement with hell shall not stand; when the overflowing scourge shall pass through, then ye shall be trodden down by it.",
        "19From the time that it goeth forth it shall take you: for morning by morning shall it pass over, by day and by night: and it shall be a vexation onlytounderstand the report.",
        "20For the bed is shorter than thata mancan stretch himselfon it:and the covering narrower than that he can wrap himselfin it.",
        "21For theLordshall rise up asinmount Perazim, he shall be wroth asinthe valley ofGibeon, that he may do his work, his strange work; and bring to pass his act, hisstrange act.",
        "22Now therefore be ye not mockers, lest your bands be made strong: for I have heard from the LordGodof hosts aconsumption, even determined upon the whole earth.",
        "23Â¶Give ye ear, and hear my voice; hearken, and hear my speech.",
        "24Doth the plowman plow all day to sow? doth he open and break the clods of his ground?",
        "25When he hath made plain the face thereof, doth he not cast abroad the fitches, and scatter the cummin, and cast in the principal wheat and the appointed barley and the rie in their place?",
        "26For his God doth instruct him to discretion,anddoth teach him.",
        "27For the fitches are not threshed with a threshing instrument, neither is a cart wheel turned about upon the cummin; but the fitches are beaten out with a staff, and the cummin with a rod.",
        "28Breadcornis bruised; because he will not ever be threshing it, nor breakit withthe wheel of his cart, nor bruise itwithhis horsemen.",
        "29This alsocomethforth from theLordof hosts,whichis wonderful in counsel,andexcellent in working."
      ],
      "full_text": "1Woe to the crown of pride, to thedrunkardsofEphraim, whose glorious beautyisa fading flower, whichareon the head ofthe fat valleysof them that are overcome with wine! 2Behold, the Lord hath a mighty and strong one,whichas atempestof hailanda destroyingstorm, as a flood of mighty waters overflowing, shall cast down to the earth with the hand. 3The crown of pride, the drunkards of Ephraim, shall be trodden under feet: 4And the glorious beauty, whichison the head of the fat valley, shall be a fading flower,andas thehasty fruitbefore the summer; whichwhenhe that looketh upon it seeth, while it is yet in his hand he eateth it up. 5Â¶Inthat dayshall theLordof hosts be for a crown ofglory, and for a diadem of beauty, unto the residue of his people, 6And for a spirit of judgment to him that sitteth in judgment, and for strength to them that turn the battle to the gate. 7Â¶Buttheyalso haveerredthroughwine, and through strong drink are out of the way; the priest and theprophethave erred through strong drink, they are swallowed up of wine, they are out of the way through strong drink; they err in vision, they stumbleinjudgment. 8For all tables are full of vomitandfilthiness,so that there isno placeclean. 9Â¶Whom shall he teachknowledge? and whom shall he make to understand doctrine?them that areweanedfrom themilk,anddrawn from the breasts. 10For preceptmust beupon precept,preceptupon precept; lineupon line, line upon line; here a little,andthere a little: 11For with stammering lips and another tongue will he speak to this people. 12To whom he said, Thisisthe restwherewithye may cause the weary to rest; and thisisthe refreshing: yet they would not hear. 13But the word of theLordwas unto them precept upon precept,preceptupon precept; line upon line, line upon line; here a little,andthere a little; that they might go, andfallbackward, and be broken, and snared, and taken. 14Â¶Wherefore hear the word of theLord, ye scornful men, that rule this people whichisin Jerusalem. 15Because ye have said, We have made a covenant with death, and with hell are we at agreement; when the overflowingscourgeshall pass through, it shall not come unto us: for we have made lies ourrefuge, and under falsehood have we hid ourselves: 16Â¶Therefore thus saith the LordGod, Behold, I lay in Zion for afoundationastone, a tried stone, a preciouscornerstone,a sure foundation: he that believeth shall not make haste. 17Judgment also will I lay to the line, and righteousness to the plummet: and the hail shall sweep away the refuge of lies, and the waters shall overflow the hiding place. 18Â¶Andyour covenant with deathshall be disannulled, and your agreement with hell shall not stand; when the overflowing scourge shall pass through, then ye shall be trodden down by it. 19From the time that it goeth forth it shall take you: for morning by morning shall it pass over, by day and by night: and it shall be a vexation onlytounderstand the report. 20For the bed is shorter than thata mancan stretch himselfon it:and the covering narrower than that he can wrap himselfin it. 21For theLordshall rise up asinmount Perazim, he shall be wroth asinthe valley ofGibeon, that he may do his work, his strange work; and bring to pass his act, hisstrange act. 22Now therefore be ye not mockers, lest your bands be made strong: for I have heard from the LordGodof hosts aconsumption, even determined upon the whole earth. 23Â¶Give ye ear, and hear my voice; hearken, and hear my speech. 24Doth the plowman plow all day to sow? doth he open and break the clods of his ground? 25When he hath made plain the face thereof, doth he not cast abroad the fitches, and scatter the cummin, and cast in the principal wheat and the appointed barley and the rie in their place? 26For his God doth instruct him to discretion,anddoth teach him. 27For the fitches are not threshed with a threshing instrument, neither is a cart wheel turned about upon the cummin; but the fitches are beaten out with a staff, and the cummin with a rod. 28Breadcornis bruised; because he will not ever be threshing it, nor breakit withthe wheel of his cart, nor bruise itwithhis horsemen. 29This alsocomethforth from theLordof hosts,whichis wonderful in counsel,andexcellent in working."
    },
    {
      "reference": "Isaiah 29",
      "title": "Isaiah 29",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/29?lang=eng",
      "summary": "A people (the Nephites) will speak as a voice from the dustâThe Apostasy, restoration of the gospel, and coming forth of a sealed book (the Book of Mormon) are foretoldâCompare2Â Nephi 27.",
      "verses": [
        "1WoetoAriel, to Ariel, the citywhereDavid dwelt! add ye year to year; let them kill sacrifices.",
        "2Yet I will distress Ariel, and there shall be heaviness andsorrow: and it shall be unto me as Ariel.",
        "3And I willcampagainst thee round about, and will lay siege against thee with a mount, and I will raise forts against thee.",
        "4And thou shalt be brought down,andshalt speak out of the ground, and thy speech shall be low out of thedust, and thy voice shall be, as of one that hath a familiar spirit, out of theground, and thy speech shall whisper out of the dust.",
        "5Moreover the multitude of thy strangers shall be like small dust, and the multitude of the terrible onesshall beas chaff that passeth away: yea, it shall be at an instant suddenly.",
        "6Thou shalt be visited of theLordof hosts with thunder, and with earthquake, and great noise, with storm and tempest, and the flame of devouringfire.",
        "7Â¶And the multitude of all the nations that fight against Ariel, even all that fight against her and her munition, and that distress her, shall be as a dream of a night vision.",
        "8It shall even be as when an hungrymandreameth, and, behold, he eateth; but he awaketh, and his soul is empty: or as when a thirsty man dreameth, and, behold, he drinketh; but he awaketh, and, behold,he isfaint, and his soul hath appetite: so shall the multitude of all the nations be, thatfightagainst mountZion.",
        "9Â¶Stay yourselves, and wonder; cry ye out, and cry: they aredrunken, but not with wine; they stagger, but not with strong drink.",
        "10For theLordhath poured out upon you the spirit of deepsleep, and hath closed youreyes: theprophetsand your rulers, theseershath hecovered.",
        "11And the vision of all is become unto you as the words of abookthat issealed, whichmendeliver to one that is learned, saying, Read this, I pray thee: and he saith, I cannot; for itissealed:",
        "12And the book is delivered tohimthat is not learned, saying, Read this, I pray thee: and he saith, I am not learned.",
        "13Â¶Wherefore the Lord said, Forasmuch as this peopledraw nearmewith theirmouth, and with their lips dohonourme, but haveremovedtheirheartfar from me, and theirfear toward meis taught by thepreceptof men:",
        "14Therefore, behold, I will proceed to do amarvellousworkamong this people,evena marvellous work and a wonder: for thewisdomof their wisemenshallperish, andtheunderstandingof theirprudentmenshall be hid.",
        "15Woe unto them that seek deep to hide theircounselfrom theLord, and their works are in the dark, and they say, Whoseethus? and who knoweth us?",
        "16Surely your turning of things upside down shall be esteemed as the potterâs clay: for shall theworksay of him that made it, He made me not? or shall the thing framed say of him that framed it, He had no understanding?",
        "17Isit not yet a very little while, and Lebanon shall be turned into a fruitful field, and the fruitful field shall be esteemed as a forest?",
        "18Â¶And in thatdayshall the deaf hear the words of thebook, and theeyesof the blind shall see out ofobscurity, and out of darkness.",
        "19The meek also shall increasetheirjoyin theLord, and thepooramong men shall rejoice in the Holy One of Israel.",
        "20For the terrible one is brought to nought, and the scorner is consumed, and all thatwatchfor iniquity arecut off:",
        "21That make a man anoffenderfor a word, and lay a snare for him that reproveth inthe gate, andturnaside the just for a thing of nought.",
        "22Therefore thus saith theLord, who redeemed Abraham, concerning thehouse of Jacob, Jacob shall not now be ashamed, neither shall his face now wax pale.",
        "23But when he seeth his children, theworkof mine hands, in the midst of him, they shall sanctify my name, and sanctify the Holy One of Jacob, and shallfeartheGodof Israel.",
        "24They also thaterredin spirit shall come to understanding, and they that murmured shalllearndoctrine."
      ],
      "full_text": "1WoetoAriel, to Ariel, the citywhereDavid dwelt! add ye year to year; let them kill sacrifices. 2Yet I will distress Ariel, and there shall be heaviness andsorrow: and it shall be unto me as Ariel. 3And I willcampagainst thee round about, and will lay siege against thee with a mount, and I will raise forts against thee. 4And thou shalt be brought down,andshalt speak out of the ground, and thy speech shall be low out of thedust, and thy voice shall be, as of one that hath a familiar spirit, out of theground, and thy speech shall whisper out of the dust. 5Moreover the multitude of thy strangers shall be like small dust, and the multitude of the terrible onesshall beas chaff that passeth away: yea, it shall be at an instant suddenly. 6Thou shalt be visited of theLordof hosts with thunder, and with earthquake, and great noise, with storm and tempest, and the flame of devouringfire. 7Â¶And the multitude of all the nations that fight against Ariel, even all that fight against her and her munition, and that distress her, shall be as a dream of a night vision. 8It shall even be as when an hungrymandreameth, and, behold, he eateth; but he awaketh, and his soul is empty: or as when a thirsty man dreameth, and, behold, he drinketh; but he awaketh, and, behold,he isfaint, and his soul hath appetite: so shall the multitude of all the nations be, thatfightagainst mountZion. 9Â¶Stay yourselves, and wonder; cry ye out, and cry: they aredrunken, but not with wine; they stagger, but not with strong drink. 10For theLordhath poured out upon you the spirit of deepsleep, and hath closed youreyes: theprophetsand your rulers, theseershath hecovered. 11And the vision of all is become unto you as the words of abookthat issealed, whichmendeliver to one that is learned, saying, Read this, I pray thee: and he saith, I cannot; for itissealed: 12And the book is delivered tohimthat is not learned, saying, Read this, I pray thee: and he saith, I am not learned. 13Â¶Wherefore the Lord said, Forasmuch as this peopledraw nearmewith theirmouth, and with their lips dohonourme, but haveremovedtheirheartfar from me, and theirfear toward meis taught by thepreceptof men: 14Therefore, behold, I will proceed to do amarvellousworkamong this people,evena marvellous work and a wonder: for thewisdomof their wisemenshallperish, andtheunderstandingof theirprudentmenshall be hid. 15Woe unto them that seek deep to hide theircounselfrom theLord, and their works are in the dark, and they say, Whoseethus? and who knoweth us? 16Surely your turning of things upside down shall be esteemed as the potterâs clay: for shall theworksay of him that made it, He made me not? or shall the thing framed say of him that framed it, He had no understanding? 17Isit not yet a very little while, and Lebanon shall be turned into a fruitful field, and the fruitful field shall be esteemed as a forest? 18Â¶And in thatdayshall the deaf hear the words of thebook, and theeyesof the blind shall see out ofobscurity, and out of darkness. 19The meek also shall increasetheirjoyin theLord, and thepooramong men shall rejoice in the Holy One of Israel. 20For the terrible one is brought to nought, and the scorner is consumed, and all thatwatchfor iniquity arecut off: 21That make a man anoffenderfor a word, and lay a snare for him that reproveth inthe gate, andturnaside the just for a thing of nought. 22Therefore thus saith theLord, who redeemed Abraham, concerning thehouse of Jacob, Jacob shall not now be ashamed, neither shall his face now wax pale. 23But when he seeth his children, theworkof mine hands, in the midst of him, they shall sanctify my name, and sanctify the Holy One of Jacob, and shallfeartheGodof Israel. 24They also thaterredin spirit shall come to understanding, and they that murmured shalllearndoctrine."
    },
    {
      "reference": "Isaiah 30",
      "title": "Isaiah 30",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/30?lang=eng",
      "summary": "Israel is scattered for rejecting the seers and prophetsâIsraelâs people will be gathered and blessed temporally and spirituallyâThe Lord will come in a day of apostasy to judge and destroy the wicked.",
      "verses": [
        "1Woe to therebelliouschildren, saith theLord, that takecounsel, but not of me; and that cover with a covering, but not of my spirit, that they may add sin to sin:",
        "2That walk to go down into Egypt, and have not asked at my mouth; to strengthen themselves in the strength ofPharaoh, and to trustinthe shadow ofEgypt!",
        "3Therefore shall the strength of Pharaoh be your shame, and the trust in the shadow of Egyptyourconfusion.",
        "4For his princes were at Zoan, and his ambassadors came to Hanes.",
        "5Theywereallashamedof a peoplethatcould not profit them, nor be an help nor profit, but a shame, and also a reproach.",
        "6Theburdenof the beasts of thesouth: into the land of trouble and anguish, from whencecometheyoung and old lion, the viper and fiery flying serpent, they will carry their riches upon the shoulders of young asses, and their treasures upon the bunches of camels, to a peoplethatshall not profitthem.",
        "7For theEgyptiansshall help in vain, and to no purpose: therefore have I cried concerning this, Their strengthisto sit still.",
        "8Â¶Now go,writeit before them in a table, and note it in a book, that it may be for the time to come for ever and ever:",
        "9Thatthisisarebelliouspeople, lying children, childrenthatwill not hear the law of theLord:",
        "10Which say to theseers, See not; and to the prophets, Prophesy not unto us right things, speak unto ussmooththings, prophesydeceits:",
        "11Get you out of the way, turn aside out of the path, cause the Holy One of Israel to cease from before us.",
        "12Wherefore thus saith the Holy One of Israel, Because ye despise this word, and trust in oppression and perverseness, and stay thereon:",
        "13Therefore this iniquity shall be to you as a breach ready to fall, swelling out in a high wall, whose breaking cometh suddenly at an instant.",
        "14And he shall break it as thebreakingof the pottersâ vessel that is broken in pieces; he shall not spare: so that there shall not be found in the bursting of it a sherd to take fire from the hearth, or to take waterwithalout of the pit.",
        "15For thus saith the LordGod, the Holy One of Israel; In returning and rest shall ye be saved; inquietnessand in confidence shall be your strength: and ye would not.",
        "16But ye said, No; for we will flee uponhorses; therefore shall ye flee: and, We will ride upon the swift; therefore shall they that pursue you be swift.",
        "17One thousandshall fleeat the rebuke of one; at the rebuke of five shall ye flee: till ye be left as a beacon upon the top of a mountain, and as anensignon an hill.",
        "18Â¶And therefore will theLordwait, that he may be gracious unto you, and therefore will he be exalted, that he may have mercy upon you: for theLordisa God ofjudgment: blessedareall they thatwaitfor him.",
        "19For the people shall dwell inZionat Jerusalem: thou shalt weep no more: he will be very gracious unto thee at the voice of thy cry; when he shall hear it, he will answer thee.",
        "20Andthoughthe Lord give you the bread ofadversity, and the water of affliction, yet shall notthy teachersbe removed into a corner any more, but thine eyes shall see thyteachers:",
        "21And thine ears shall hear a word behind thee, saying, Thisisthe way,walkye in it, when ye turn to the right hand, and when ye turn to the left.",
        "22Ye shall defile also the covering of thy graven images of silver, and the ornament of thy molten images of gold: thou shalt cast them away as a menstruous cloth; thou shalt say unto it, Get thee hence.",
        "23Then shall he give the rainof thy seed, that thou shalt sow the ground withal; and bread of the increase of the earth, and it shall be fat and plenteous: in that day shall thy cattle feed in large pastures.",
        "24The oxen likewise and the youngasses thatear the groundshall eat clean provender, which hath been winnowed with the shovel and with the fan.",
        "25And there shall be upon every high mountain, and upon every high hill, riversandstreams of waters in thedayof the great slaughter, when the towers fall.",
        "26Moreover the light of the moon shall be as the light of the sun, and the light of the sun shall be sevenfold, as the light of seven days, in the day that theLordbindeth up the breach of his people, andhealeththe stroke of their wound.",
        "27Â¶Behold, thenameof theLordcometh from far, burningwithhisanger, and the burdenthereof isheavy: his lips are full of indignation, and his tongue as a devouring fire:",
        "28And hisbreath, as an overflowing stream, shall reach to the midst of theneck, to sift the nations with the sieve ofvanity: andthere shall bea bridle in the jaws of the people, causingthemto err.",
        "29Yeshall have a song, as in the nightwhena holy solemnityis kept; and gladness of heart, as when one goeth with a pipe to come into themountainof theLord, to themighty Oneof Israel.",
        "30And theLordshall cause his glorious voice to be heard, and shall shew the lighting down of his arm, with the indignation ofhisanger, andwiththe flame of a devouring fire,withscattering, andtempest, and hailstones.",
        "31For through the voice of theLordshall theAssyrianbe beaten down,whichsmotewith a rod.",
        "32Andinevery place where the grounded staff shall pass, which theLordshall lay upon him,itshall be with tabrets and harps: andin battles of shakingwill he fightwith it.",
        "33ForTophetisordained of old; yea, for the king it is prepared; he hath madeitdeepandlarge: the pile thereofisfire and much wood; the breath of theLord, like a stream of brimstone, doth kindle it."
      ],
      "full_text": "1Woe to therebelliouschildren, saith theLord, that takecounsel, but not of me; and that cover with a covering, but not of my spirit, that they may add sin to sin: 2That walk to go down into Egypt, and have not asked at my mouth; to strengthen themselves in the strength ofPharaoh, and to trustinthe shadow ofEgypt! 3Therefore shall the strength of Pharaoh be your shame, and the trust in the shadow of Egyptyourconfusion. 4For his princes were at Zoan, and his ambassadors came to Hanes. 5Theywereallashamedof a peoplethatcould not profit them, nor be an help nor profit, but a shame, and also a reproach. 6Theburdenof the beasts of thesouth: into the land of trouble and anguish, from whencecometheyoung and old lion, the viper and fiery flying serpent, they will carry their riches upon the shoulders of young asses, and their treasures upon the bunches of camels, to a peoplethatshall not profitthem. 7For theEgyptiansshall help in vain, and to no purpose: therefore have I cried concerning this, Their strengthisto sit still. 8Â¶Now go,writeit before them in a table, and note it in a book, that it may be for the time to come for ever and ever: 9Thatthisisarebelliouspeople, lying children, childrenthatwill not hear the law of theLord: 10Which say to theseers, See not; and to the prophets, Prophesy not unto us right things, speak unto ussmooththings, prophesydeceits: 11Get you out of the way, turn aside out of the path, cause the Holy One of Israel to cease from before us. 12Wherefore thus saith the Holy One of Israel, Because ye despise this word, and trust in oppression and perverseness, and stay thereon: 13Therefore this iniquity shall be to you as a breach ready to fall, swelling out in a high wall, whose breaking cometh suddenly at an instant. 14And he shall break it as thebreakingof the pottersâ vessel that is broken in pieces; he shall not spare: so that there shall not be found in the bursting of it a sherd to take fire from the hearth, or to take waterwithalout of the pit. 15For thus saith the LordGod, the Holy One of Israel; In returning and rest shall ye be saved; inquietnessand in confidence shall be your strength: and ye would not. 16But ye said, No; for we will flee uponhorses; therefore shall ye flee: and, We will ride upon the swift; therefore shall they that pursue you be swift. 17One thousandshall fleeat the rebuke of one; at the rebuke of five shall ye flee: till ye be left as a beacon upon the top of a mountain, and as anensignon an hill. 18Â¶And therefore will theLordwait, that he may be gracious unto you, and therefore will he be exalted, that he may have mercy upon you: for theLordisa God ofjudgment: blessedareall they thatwaitfor him. 19For the people shall dwell inZionat Jerusalem: thou shalt weep no more: he will be very gracious unto thee at the voice of thy cry; when he shall hear it, he will answer thee. 20Andthoughthe Lord give you the bread ofadversity, and the water of affliction, yet shall notthy teachersbe removed into a corner any more, but thine eyes shall see thyteachers: 21And thine ears shall hear a word behind thee, saying, Thisisthe way,walkye in it, when ye turn to the right hand, and when ye turn to the left. 22Ye shall defile also the covering of thy graven images of silver, and the ornament of thy molten images of gold: thou shalt cast them away as a menstruous cloth; thou shalt say unto it, Get thee hence. 23Then shall he give the rainof thy seed, that thou shalt sow the ground withal; and bread of the increase of the earth, and it shall be fat and plenteous: in that day shall thy cattle feed in large pastures. 24The oxen likewise and the youngasses thatear the groundshall eat clean provender, which hath been winnowed with the shovel and with the fan. 25And there shall be upon every high mountain, and upon every high hill, riversandstreams of waters in thedayof the great slaughter, when the towers fall. 26Moreover the light of the moon shall be as the light of the sun, and the light of the sun shall be sevenfold, as the light of seven days, in the day that theLordbindeth up the breach of his people, andhealeththe stroke of their wound. 27Â¶Behold, thenameof theLordcometh from far, burningwithhisanger, and the burdenthereof isheavy: his lips are full of indignation, and his tongue as a devouring fire: 28And hisbreath, as an overflowing stream, shall reach to the midst of theneck, to sift the nations with the sieve ofvanity: andthere shall bea bridle in the jaws of the people, causingthemto err. 29Yeshall have a song, as in the nightwhena holy solemnityis kept; and gladness of heart, as when one goeth with a pipe to come into themountainof theLord, to themighty Oneof Israel. 30And theLordshall cause his glorious voice to be heard, and shall shew the lighting down of his arm, with the indignation ofhisanger, andwiththe flame of a devouring fire,withscattering, andtempest, and hailstones. 31For through the voice of theLordshall theAssyrianbe beaten down,whichsmotewith a rod. 32Andinevery place where the grounded staff shall pass, which theLordshall lay upon him,itshall be with tabrets and harps: andin battles of shakingwill he fightwith it. 33ForTophetisordained of old; yea, for the king it is prepared; he hath madeitdeepandlarge: the pile thereofisfire and much wood; the breath of theLord, like a stream of brimstone, doth kindle it."
    },
    {
      "reference": "Isaiah 35",
      "title": "Isaiah 35",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/35?lang=eng",
      "summary": "In the day of restoration, the desert will blossom, the Lord will come, Israel will be gathered, and Zion will be built up.",
      "verses": [
        "1The wilderness and thesolitaryplace shall begladforthem; and thedesertshall rejoice, andblossomas the rose.",
        "2It shall blossom abundantly, and rejoice even with joy and singing: the glory ofLebanonshall be given unto it, the excellency of Carmel and Sharon, they shall see thegloryof theLord,andthe excellency of our God.",
        "3Â¶Strengthen ye theweakhands, and confirm thefeebleknees.",
        "4Say to themthat areof a fearful heart, Be strong, fear not: behold, your God will comewithvengeance,evenGodwitha recompence; he will come and save you.",
        "5Then theeyesof theblindshall be opened, and the ears of the deaf shall be unstopped.",
        "6Then shall the lamemanleap as anhart, and the tongue of the dumbsing: for in the wilderness shall waters break out, and streams in the desert.",
        "7And theparchedground shall become a pool, and the thirsty land springs of water: in thehabitation of dragons, where each lay,shall begrass with reeds and rushes.",
        "8And anhighwayshall be there, and a way, and it shall be called The way ofholiness; theuncleanshall not pass over it; but itshall befor those: the wayfaring men, though fools, shall not errtherein.",
        "9No lion shall be there, noranyravenous beast shall go up thereon,it shall not be found there; but theredeemedshall walkthere:",
        "10And the ransomed of theLordshallreturn, and come toZionwithsongsand everlastingjoyupon their heads: they shall obtain joy and gladness, andsorrowand sighing shall flee away."
      ],
      "full_text": "1The wilderness and thesolitaryplace shall begladforthem; and thedesertshall rejoice, andblossomas the rose. 2It shall blossom abundantly, and rejoice even with joy and singing: the glory ofLebanonshall be given unto it, the excellency of Carmel and Sharon, they shall see thegloryof theLord,andthe excellency of our God. 3Â¶Strengthen ye theweakhands, and confirm thefeebleknees. 4Say to themthat areof a fearful heart, Be strong, fear not: behold, your God will comewithvengeance,evenGodwitha recompence; he will come and save you. 5Then theeyesof theblindshall be opened, and the ears of the deaf shall be unstopped. 6Then shall the lamemanleap as anhart, and the tongue of the dumbsing: for in the wilderness shall waters break out, and streams in the desert. 7And theparchedground shall become a pool, and the thirsty land springs of water: in thehabitation of dragons, where each lay,shall begrass with reeds and rushes. 8And anhighwayshall be there, and a way, and it shall be called The way ofholiness; theuncleanshall not pass over it; but itshall befor those: the wayfaring men, though fools, shall not errtherein. 9No lion shall be there, noranyravenous beast shall go up thereon,it shall not be found there; but theredeemedshall walkthere: 10And the ransomed of theLordshallreturn, and come toZionwithsongsand everlastingjoyupon their heads: they shall obtain joy and gladness, andsorrowand sighing shall flee away."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:31:58",
  "metadata": {
    "week_number": 39,
    "title": "Week 39: September 21–27 - Isaiah 13–14; 22; 24–30; 35",
    "date_range": "September 21–27",
    "scraped_at": "2025-12-21T22:32:09.279469",
    "scraper_version": "2.0.0"
  }
}