{
  "week_number": 10,
  "date_range": "March 2–8",
  "title": "Week 10: March 2–8 - Genesis 24–33",
  "bundle_title": "Week 10: March 2–8: \"Week 10: March 2–8 - Genesis 24–33\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/10?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/10?lang=eng",
    "title": "Genesis 24–33",
    "scripture_references": "Genesis 24–33",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“March 2–8. ‘Let God Prevail’,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“March 2–8. ‘Let God Prevail’,”Come, Follow Me: 2026\n\nEsau Sells His Birthright, by Glen S. Hopkinson (detail)\n\nHow do you secure for yourself a blessing from God? You might say that the account of Jacob, grandson of Abraham and Sarah, is the story of a man who learned the answer to that question. In a culture where the firstborn son received a birthright blessing, Jacob was born second, grasping the heel of his twin brother, Esau. The name “Jacob” means “supplanter”—one who replaces someone else. Jacob lived up to that name by trying, more than once, to supplant Esau as inheritor of the birthright blessing because Esau was unworthy of it (seeGenesis 25:30–34;26:34–35;27:36). The result was discord in the family, and Jacob had to flee for his life into the wilderness.\n\nYears later, God commanded Jacob to return home. On the way, Jacob, in humility, again sought a blessing from God. The scriptures describe this time as a “wrestle” for Jacob, and he declared that he would not give up “except thou bless me” (Genesis 32:26). Then came the lesson—and the blessing. God changed Jacob’s name to Israel—meaning, among other things, “let God prevail.” Israel learned that to receive God’s most valuable blessings, His covenant blessings, it’s not necessary to supplant someone else. His blessings aren’t purchased or seized or won. He gives them freely to all who live up to the name of Israel—who let God prevail in their lives.",
    "learning_at_home_church": [
      {
        "title": "Covenant marriage is essential to God’s eternal plan.",
        "content": "While readingGenesis 24, ask yourself why Abraham considered the marriage of his son Isaac to be so important. Why is marriage important to God?\n\nWhat qualities do you find in Rebekah that would contribute to a strong marriage and family? (see especiallyverses 15–28, 57–61).\n\nSee also Topics and Questions, “Marriage,” Gospel Library.\n\nGenesis 25:29–34"
      },
      {
        "title": "I can value eternal things over temporal things.",
        "content": "In Isaac and Rebekah’s culture, the oldest son received the birthright, which meant a greater inheritance, along with greater responsibilities for caring for the family. As you readGenesis 25:29–34, ponder why Esau might have been willing to give up his birthright in exchange for a meal. What lessons do you find for yourself in this account? It might help to make two lists: (1) eternal blessings God wants to give you and (2) worldly things that might distract you. Then you could read the passage, replacing “birthright” with something from the first list and “pottage” with something from the second. How will you focus on the Savior and the eternal blessings of His gospel?\n\nSee alsoMatthew 6:19–33; M. Russell Ballard, “Remember What Matters Most,”Liahona, May 2023, 105–7.\n\nJacob at Bethel, by James Smetham\n\nGenesis 28"
      },
      {
        "title": "The covenants of the Lord’s house bring God’s power into my life.",
        "content": "While sleeping on a pillow of stones, Jacob had a life-changing dream. It was such a sacred experience that Jacob named the place Bethel, or “house of God,” declaring, “Surely the Lord is in this place” (Genesis 28:16).\n\nAs you readGenesis 28, you might ask yourself what made this experience so sacred to Jacob. What was he going through at the time? How might he have been feeling? You could also look for words and phrases inverses 10–22that remind you of the house of the Lord. What impressions do you receive about God, His house, and His covenants?\n\nAt the end of this outline is a painting that depicts Jacob’s dream; you might refer to it as you read. If you were to create your own artistic depiction of his dream, what would you do? What truths from the story would you try to portray?\n\nThe hymn “Nearer, My God, to Thee” (Hymns, no. 100) is based on Jacob’s experience. What connections do you see between this song andGenesis 28:10–22? How does the temple help you feel nearer to God? Consider looking for answers to this question in President Russell M. Nelson’s message “The Temple and Your Spiritual Foundation” (Liahona, Nov. 2021, 93–96). You may also want to review the covenants and blessings of the house of the Lord inGeneral Handbook,27.2(Gospel Library). How does keeping these covenants bring God’s power into your life?\n\nBe creative.There are many ways to learn from the scriptures besides just reading them. Some people find that they understand the scriptures better if they draw pictures of the accounts. Others find spiritual insights in sacred music related to the scriptures. Don’t limit yourself to one way of learning; be open to trying a variety of approaches.\n\nGenesis 29:31–35;30:1–24"
      },
      {
        "title": "The Lord remembers me in my trials.",
        "content": "As you readGenesis 29:31–35and30:1–24, look for words describing God’s mercy to Rachel and Leah. Ponder how God has “looked upon [your] affliction” and “remembered” you (Genesis 29:32;30:22).\n\nGenesis 32–33"
      },
      {
        "title": "The Savior can heal my family.",
        "content": "As Jacob returned to Canaan, he was “greatly afraid and distressed” about how his brother, Esau, would receive him (Genesis 32:7). As you readGenesis 32–33, ponder your own family relationships—perhaps especially one that needs healing. Maybe this story could inspire you to reach out to someone. Questions like these could guide your reading:\n\nHow did Jacob prepare to meet Esau?\n\nWhat stands out to you about Jacob’s prayer found inGenesis 32:9–12?\n\nWhat do you learn about forgiveness from Esau’s example?\n\nHow can the Savior help us heal family relationships?\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "I can be kind to others.",
        "content": "To highlight Rebekah’s impressive example of kindness, you could show your children the picture below or this week’s activity page as you summarize the story inGenesis 24:10–21. Your children might enjoy acting out the story. This could lead to a conversation about acts of kindness you and your children have seen.\n\nConsider singing a song about kindness together, such as “Kindness Begins with Me” (Children’s Songbook, 145). Your children could listen for the word “kindness” (or a similar word) and stand when they hear it. How can we be kind like Rebekah?\n\nOld Testament Heroes, by Dilleen Marsh (detail)\n\nGenesis 25:21–34"
      },
      {
        "title": "Eternal things are more important than worldly things.",
        "content": "Consider using “Jacob and Esau” (inOld Testament Stories, 38–41) to help your children understand the story inGenesis 25:21–34. Maybe your children could imagine that Esau asked for their advice about whether he should trade his birthright for the pottage. What would they say to him?\n\nJacob and Esau\n\nWhat things matter eternally to you and your children? Perhaps your children could find pictures or objects that represent these things. How can we show the Lord that these things are important to us?\n\nGenesis 28:10–22"
      },
      {
        "title": "Covenants help me return to Heavenly Father.",
        "content": "As you readGenesis 28:10–22together, you could use a ladder or a staircase (or a picture like the one at the end of this outline) to talk about how our covenants are like a ladder. Maybe your children could pretend to climb a ladder, and with each step, talk about times when we promise to obey God, such as when we are baptized, take the sacrament, or go to the temple. How do our covenants bring us closer to God?\n\nGenesis 32:6–11;33:1–4"
      },
      {
        "title": "Heavenly Father and Jesus Christ can help me love my family.",
        "content": "To introduce these verses, you might explain that after many years of hard feelings, Jacob was going to meet Esau again. Read togetherGenesis 32:6–11. How did Jacob feel? What did he do to get help? Read togetherGenesis 33:1–4to discover how the Lord answered Jacob’s prayer. If Jacob and Esau could talk to us today, what might they say to help us when there is contention in our family?\n\nFor more, see this month’s issue of theFriendmagazine.\n\nJacob’s Dream, by J. Ken Spencer"
      }
    ],
    "study_helps": [],
    "raw_text": "March 2–8. “Let God Prevail”: Genesis 24–33\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nFebruary 23–March 1\nGenesis 18–23\nThoughts to Keep in Mind\nThe House of Israel\nMarch 2–8\nGenesis 24–33\nMarch 9–15\nGenesis 37–41\nMarch 16–22\nGenesis 42–50\nMarch 23–29\nExodus 1–6\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nMarch 2–8. “Let God Prevail”: Genesis 24–33\n“March 2–8. ‘Let God Prevail’,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“March 2–8. ‘Let God Prevail’,”\nCome, Follow Me: 2026\nEsau Sells His Birthright\n, by Glen S. Hopkinson (detail)\nMarch 2–8: “Let God Prevail”\nGenesis 24–33\nHow do you secure for yourself a blessing from God? You might say that the account of Jacob, grandson of Abraham and Sarah, is the story of a man who learned the answer to that question. In a culture where the firstborn son received a birthright blessing, Jacob was born second, grasping the heel of his twin brother, Esau. The name “Jacob” means “supplanter”—one who replaces someone else. Jacob lived up to that name by trying, more than once, to supplant Esau as inheritor of the birthright blessing because Esau was unworthy of it (see\nGenesis 25:30–34\n;\n26:34–35\n;\n27:36\n). The result was discord in the family, and Jacob had to flee for his life into the wilderness.\nYears later, God commanded Jacob to return home. On the way, Jacob, in humility, again sought a blessing from God. The scriptures describe this time as a “wrestle” for Jacob, and he declared that he would not give up “except thou bless me” (\nGenesis 32:26\n). Then came the lesson—and the blessing. God changed Jacob’s name to Israel—meaning, among other things, “let God prevail.” Israel learned that to receive God’s most valuable blessings, His covenant blessings, it’s not necessary to supplant someone else. His blessings aren’t purchased or seized or won. He gives them freely to all who live up to the name of Israel—who let God prevail in their lives.\nIdeas for Learning at Home and at Church\nGenesis 24\nCovenant marriage is essential to God’s eternal plan.\nWhile reading\nGenesis 24\n, ask yourself why Abraham considered the marriage of his son Isaac to be so important. Why is marriage important to God?\nWhat qualities do you find in Rebekah that would contribute to a strong marriage and family? (see especially\nverses 15–28, 57–61\n).\nSee also Topics and Questions, “\nMarriage\n,” Gospel Library.\nGenesis 25:29–34\nI can value eternal things over temporal things.\nIn Isaac and Rebekah’s culture, the oldest son received the birthright, which meant a greater inheritance, along with greater responsibilities for caring for the family. As you read\nGenesis 25:29–34\n, ponder why Esau might have been willing to give up his birthright in exchange for a meal. What lessons do you find for yourself in this account? It might help to make two lists: (1) eternal blessings God wants to give you and (2) worldly things that might distract you. Then you could read the passage, replacing “birthright” with something from the first list and “pottage” with something from the second. How will you focus on the Savior and the eternal blessings of His gospel?\nSee also\nMatthew 6:19–33\n; M. Russell Ballard, “\nRemember What Matters Most\n,”\nLiahona\n, May 2023, 105–7.\nJacob at Bethel\n, by James Smetham\nGenesis 28\nThe covenants of the Lord’s house bring God’s power into my life.\nWhile sleeping on a pillow of stones, Jacob had a life-changing dream. It was such a sacred experience that Jacob named the place Bethel, or “house of God,” declaring, “Surely the Lord is in this place” (\nGenesis 28:16\n).\nAs you read\nGenesis 28\n, you might ask yourself what made this experience so sacred to Jacob. What was he going through at the time? How might he have been feeling? You could also look for words and phrases in\nverses 10–22\nthat remind you of the house of the Lord. What impressions do you receive about God, His house, and His covenants?\nAt the end of this outline is a painting that depicts Jacob’s dream; you might refer to it as you read. If you were to create your own artistic depiction of his dream, what would you do? What truths from the story would you try to portray?\nThe hymn “\nNearer, My God, to Thee\n” (\nHymns\n, no. 100) is based on Jacob’s experience. What connections do you see between this song and\nGenesis 28:10–22\n? How does the temple help you feel nearer to God? Consider looking for answers to this question in President Russell M. Nelson’s message “\nThe Temple and Your Spiritual Foundation\n” (\nLiahona\n, Nov. 2021, 93–96). You may also want to review the covenants and blessings of the house of the Lord in\nGeneral Handbook\n,\n27.2\n(Gospel Library). How does keeping these covenants bring God’s power into your life?\nBe creative.\nThere are many ways to learn from the scriptures besides just reading them. Some people find that they understand the scriptures better if they draw pictures of the accounts. Others find spiritual insights in sacred music related to the scriptures. Don’t limit yourself to one way of learning; be open to trying a variety of approaches.\nGenesis 29:31–35\n;\n30:1–24\nThe Lord remembers me in my trials.\nAs you read\nGenesis 29:31–35\nand\n30:1–24\n, look for words describing God’s mercy to Rachel and Leah. Ponder how God has “looked upon [your] affliction” and “remembered” you (\nGenesis 29:32\n;\n30:22\n).\nGenesis 32–33\nThe Savior can heal my family.\nAs Jacob returned to Canaan, he was “greatly afraid and distressed” about how his brother, Esau, would receive him (\nGenesis 32:7\n). As you read\nGenesis 32–33\n, ponder your own family relationships—perhaps especially one that needs healing. Maybe this story could inspire you to reach out to someone. Questions like these could guide your reading:\nHow did Jacob prepare to meet Esau?\nWhat stands out to you about Jacob’s prayer found in\nGenesis 32:9–12\n?\nWhat do you learn about forgiveness from Esau’s example?\nHow can the Savior help us heal family relationships?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Abraham not want Isaac to marry a Canaanite?\nWhy did Jacob pretend to be Esau?\nClick to see more.\nIdeas for Teaching Children\nGenesis 24:10–21\nI can be kind to others.\nTo highlight Rebekah’s impressive example of kindness, you could show your children the picture below or this week’s activity page as you summarize the story in\nGenesis 24:10–21\n. Your children might enjoy acting out the story. This could lead to a conversation about acts of kindness you and your children have seen.\nConsider singing a song about kindness together, such as “\nKindness Begins with Me\n” (\nChildren’s Songbook\n, 145). Your children could listen for the word “kindness” (or a similar word) and stand when they hear it. How can we be kind like Rebekah?\nOld Testament Heroes\n, by Dilleen Marsh (detail)\nGenesis 25:21–34\nEternal things are more important than worldly things.\nConsider using “\nJacob and Esau\n” (in\nOld Testament Stories\n, 38–41) to help your children understand the story in\nGenesis 25:21–34\n. Maybe your children could imagine that Esau asked for their advice about whether he should trade his birthright for the pottage. What would they say to him?\n2:5\nJacob and Esau\nWhat things matter eternally to you and your children? Perhaps your children could find pictures or objects that represent these things. How can we show the Lord that these things are important to us?\nGenesis 28:10–22\nCovenants help me return to Heavenly Father.\nAs you read\nGenesis 28:10–22\ntogether, you could use a ladder or a staircase (or a picture like the one at the end of this outline) to talk about how our covenants are like a ladder. Maybe your children could pretend to climb a ladder, and with each step, talk about times when we promise to obey God, such as when we are baptized, take the sacrament, or go to the temple. How do our covenants bring us closer to God?\nGenesis 32:6–11\n;\n33:1–4\nHeavenly Father and Jesus Christ can help me love my family.\nTo introduce these verses, you might explain that after many years of hard feelings, Jacob was going to meet Esau again. Read together\nGenesis 32:6–11\n. How did Jacob feel? What did he do to get help? Read together\nGenesis 33:1–4\nto discover how the Lord answered Jacob’s prayer. If Jacob and Esau could talk to us today, what might they say to help us when there is contention in our family?\nFor more, see this month’s issue of the\nFriend\nmagazine.\nJacob’s Dream\n, by J. Ken Spencer\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Genesis 24",
      "title": "Genesis 24",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/24?lang=eng",
      "summary": "Abraham commands that Isaac shall not marry a CanaaniteâThe Lord guides Abrahamâs servant in choosing Rebekah as a wife for IsaacâRebekah is blessed to be the mother of thousands of millionsâShe marries Isaac.",
      "verses": [
        "1And Abraham was old,andwellstricken in age: and theLordhadblessedAbraham in allthings.",
        "2And Abraham said unto his eldestservantof his house, that ruled over all that he had, Put, I pray thee, thy hand under mythigh:",
        "3And I will make theeswearby theLord, the God of heaven, and the God of the earth, that thou shaltnottake awifeunto my son of the daughters of theCanaanites, among whom I dwell:",
        "4But thou shalt go unto mycountry, and to mykindred, and take a wife unto my son Isaac.",
        "5And the servant said unto him,Peradventurethe woman will not be willing to follow me unto this land: must I needs bring thy son again unto the land from whence thou camest?",
        "6And Abraham said unto him, Beware thou that thou bring not my son thither again.",
        "7Â¶TheLordGodof heaven, which took me from myfatherâshouse, and from the land of my kindred, and which spake unto me, and that sware unto me, saying, Unto thy seed will I give thisland; he shall send hisangelbefore thee, and thou shalt take a wife unto my son from thence.",
        "8And if the woman will not be willing to follow thee, then thou shalt be clear from this my oath: only bring not my son thither again.",
        "9And the servant put his hand under thethighof Abraham his master, and sware to him concerning that matter.",
        "10Â¶And the servant took ten camels of the camels of his master, and departed; for all the goods of his masterwerein his hand: and he arose, and went toMesopotamia, unto the city ofNahor.",
        "11And he made his camels to kneel down without the city by a well of water at the time of the evening,eventhe time that women go out to drawwater.",
        "12And he said, OLordGodof my master Abraham, I pray thee,sendme good speed this day, and shew kindness unto my master Abraham.",
        "13Behold, I standhereby the well of water; and the daughters of the men of the city come out to drawwater:",
        "14And let it come to pass, that the damsel to whom I shall say, Let down thy pitcher, I pray thee, that I may drink; and she shall say, Drink, and I will give thy camels drink also:let the same beshethatthou hastappointedfor thy servant Isaac; and thereby shall I know that thou hast shewed kindness unto my master.",
        "15Â¶And it came to pass, before he had done speaking, that, behold, Rebekah came out, who was born toBethuel, son ofMilcah, the wife of Nahor, Abrahamâs brother, with her pitcher upon her shoulder.",
        "16And the damselwasveryfairto look upon, a virgin, neither had any manknown her: and she went down to the well, and filled her pitcher, and came up.",
        "17And the servant ran to meet her, and said, Let me, I pray thee, drink a little water of thy pitcher.",
        "18And she said, Drink, my lord: and she hasted, and let down her pitcher upon her hand, and gave him drink.",
        "19And when she had done giving him drink, she said, I will drawwaterfor thy camels also, until they have done drinking.",
        "20And she hasted, and emptied her pitcher into the trough, and ran again unto the well to drawwater,and drew for all his camels.",
        "21And the man wondering at her held his peace, to wit whether theLordhad made his journeyprosperousor not.",
        "22And it came to pass, as the camels had done drinking, that the man took a goldenearringof half a shekel weight, and two bracelets for her hands of tenshekelsweight of gold;",
        "23And said, Whose daughterartthou? tell me, I pray thee: is there roominthy fatherâs house for us to lodge in?",
        "24And she said unto him, Iamthe daughter of Bethuel the son of Milcah, which she bare untoNahor.",
        "25She said moreover unto him, We have both straw and provender enough, and room to lodge in.",
        "26And the manboweddown his head, and worshipped theLord.",
        "27And he said, BlessedbetheLordGodof my master Abraham, who hath not left destitute my master of hismercyand his truth: Ibeingin the way, theLordledme to the house of my masterâs brethren.",
        "28And the damsel ran, and toldthem ofher motherâs house these things.",
        "29Â¶And Rebekah had a brother, and his namewasLaban: andLabanran out unto the man, unto the well.",
        "30And it came to pass, when he saw the earring and bracelets upon his sisterâs hands, and when he heard the words of Rebekah his sister, saying, Thus spake the man unto me; that he came unto the man; and, behold, he stood by the camels at the well.",
        "31And he said, Come in, thoublessedof theLord; wherefore standest thou without? for I have prepared the house, and room for the camels.",
        "32Â¶And the man came into the house: and he ungirded his camels, and gave straw andprovenderfor the camels, and water towashhis feet, and the menâs feet thatwerewith him.",
        "33And there was setmeatbeforehim to eat: but he said, I will not eat, until I have told mine errand. And he said, Speak on.",
        "34And he said, IamAbrahamâs servant.",
        "35And theLordhathblessedmy master greatly; and he is becomegreat: and he hath given him flocks, and herds, and silver, and gold, and menservants, and maidservants, and camels, and asses.",
        "36And Sarah my masterâs wife bare asonto my master when she wasold: and unto him hath hegivenall that he hath.",
        "37And my master made meswear, saying, Thou shalt not take a wife to my son of the daughters of the Canaanites, in whose land I dwell:",
        "38But thou shalt go unto myfatherâshouse, and to my kindred, and take a wife unto my son.",
        "39And I said unto my master,Peradventurethe woman will not follow me.",
        "40And he said unto me, TheLord, before whom Iwalk, will send his angel with thee, and prosper thy way; and thou shalt take a wife for my son of my kindred, and of my fatherâs house:",
        "41Then shalt thou be clear fromthismy oath, when thou comest to my kindred; and if they give not theeone,thou shalt be clear from my oath.",
        "42And I came this day unto the well, and said, OLordGod of my master Abraham, if now thou do prosper my way which I go:",
        "43Behold, I stand by the well of water; and it shall come to pass, that when the virgin cometh forth to drawwater,and I say to her, Give me, I pray thee, a little water of thy pitcher to drink;",
        "44And she say to me, Both drink thou, and I will also draw for thy camels:letthe samebethe woman whom theLordhathappointedout for my masterâs son.",
        "45And before I had done speaking in mineheart, behold, Rebekah came forth with her pitcher on her shoulder; and she went down unto the well, and drewwater:and I said unto her, Let me drink, I pray thee.",
        "46And she made haste, and let down her pitcher from hershoulder,and said, Drink, and I will give thy camels drink also: so I drank, and she made the camels drink also.",
        "47And I asked her, and said, Whose daughterartthou? And she said, The daughter of Bethuel, Nahorâs son, whom Milcah bare unto him: and I put theearring upon her face, and the bracelets upon her hands.",
        "48And Iboweddown my head, and worshipped theLord, and blessed theLordGod of my master Abraham, which had led me in the right way to take my masterâs brotherâsdaughterunto his son.",
        "49And now if ye will deal kindly and truly with my master, tell me: and if not, tell me; that I may turn to the right hand, or to the left.",
        "50Then Laban and Bethuel answered and said, The thing proceedeth from theLord: we cannotspeakunto thee bad or good."
      ],
      "full_text": "1And Abraham was old,andwellstricken in age: and theLordhadblessedAbraham in allthings. 2And Abraham said unto his eldestservantof his house, that ruled over all that he had, Put, I pray thee, thy hand under mythigh: 3And I will make theeswearby theLord, the God of heaven, and the God of the earth, that thou shaltnottake awifeunto my son of the daughters of theCanaanites, among whom I dwell: 4But thou shalt go unto mycountry, and to mykindred, and take a wife unto my son Isaac. 5And the servant said unto him,Peradventurethe woman will not be willing to follow me unto this land: must I needs bring thy son again unto the land from whence thou camest? 6And Abraham said unto him, Beware thou that thou bring not my son thither again. 7Â¶TheLordGodof heaven, which took me from myfatherâshouse, and from the land of my kindred, and which spake unto me, and that sware unto me, saying, Unto thy seed will I give thisland; he shall send hisangelbefore thee, and thou shalt take a wife unto my son from thence. 8And if the woman will not be willing to follow thee, then thou shalt be clear from this my oath: only bring not my son thither again. 9And the servant put his hand under thethighof Abraham his master, and sware to him concerning that matter. 10Â¶And the servant took ten camels of the camels of his master, and departed; for all the goods of his masterwerein his hand: and he arose, and went toMesopotamia, unto the city ofNahor. 11And he made his camels to kneel down without the city by a well of water at the time of the evening,eventhe time that women go out to drawwater. 12And he said, OLordGodof my master Abraham, I pray thee,sendme good speed this day, and shew kindness unto my master Abraham. 13Behold, I standhereby the well of water; and the daughters of the men of the city come out to drawwater: 14And let it come to pass, that the damsel to whom I shall say, Let down thy pitcher, I pray thee, that I may drink; and she shall say, Drink, and I will give thy camels drink also:let the same beshethatthou hastappointedfor thy servant Isaac; and thereby shall I know that thou hast shewed kindness unto my master. 15Â¶And it came to pass, before he had done speaking, that, behold, Rebekah came out, who was born toBethuel, son ofMilcah, the wife of Nahor, Abrahamâs brother, with her pitcher upon her shoulder. 16And the damselwasveryfairto look upon, a virgin, neither had any manknown her: and she went down to the well, and filled her pitcher, and came up. 17And the servant ran to meet her, and said, Let me, I pray thee, drink a little water of thy pitcher. 18And she said, Drink, my lord: and she hasted, and let down her pitcher upon her hand, and gave him drink. 19And when she had done giving him drink, she said, I will drawwaterfor thy camels also, until they have done drinking. 20And she hasted, and emptied her pitcher into the trough, and ran again unto the well to drawwater,and drew for all his camels. 21And the man wondering at her held his peace, to wit whether theLordhad made his journeyprosperousor not. 22And it came to pass, as the camels had done drinking, that the man took a goldenearringof half a shekel weight, and two bracelets for her hands of tenshekelsweight of gold; 23And said, Whose daughterartthou? tell me, I pray thee: is there roominthy fatherâs house for us to lodge in? 24And she said unto him, Iamthe daughter of Bethuel the son of Milcah, which she bare untoNahor. 25She said moreover unto him, We have both straw and provender enough, and room to lodge in. 26And the manboweddown his head, and worshipped theLord. 27And he said, BlessedbetheLordGodof my master Abraham, who hath not left destitute my master of hismercyand his truth: Ibeingin the way, theLordledme to the house of my masterâs brethren. 28And the damsel ran, and toldthem ofher motherâs house these things. 29Â¶And Rebekah had a brother, and his namewasLaban: andLabanran out unto the man, unto the well. 30And it came to pass, when he saw the earring and bracelets upon his sisterâs hands, and when he heard the words of Rebekah his sister, saying, Thus spake the man unto me; that he came unto the man; and, behold, he stood by the camels at the well. 31And he said, Come in, thoublessedof theLord; wherefore standest thou without? for I have prepared the house, and room for the camels. 32Â¶And the man came into the house: and he ungirded his camels, and gave straw andprovenderfor the camels, and water towashhis feet, and the menâs feet thatwerewith him. 33And there was setmeatbeforehim to eat: but he said, I will not eat, until I have told mine errand. And he said, Speak on. 34And he said, IamAbrahamâs servant. 35And theLordhathblessedmy master greatly; and he is becomegreat: and he hath given him flocks, and herds, and silver, and gold, and menservants, and maidservants, and camels, and asses. 36And Sarah my masterâs wife bare asonto my master when she wasold: and unto him hath hegivenall that he hath. 37And my master made meswear, saying, Thou shalt not take a wife to my son of the daughters of the Canaanites, in whose land I dwell: 38But thou shalt go unto myfatherâshouse, and to my kindred, and take a wife unto my son. 39And I said unto my master,Peradventurethe woman will not follow me. 40And he said unto me, TheLord, before whom Iwalk, will send his angel with thee, and prosper thy way; and thou shalt take a wife for my son of my kindred, and of my fatherâs house: 41Then shalt thou be clear fromthismy oath, when thou comest to my kindred; and if they give not theeone,thou shalt be clear from my oath. 42And I came this day unto the well, and said, OLordGod of my master Abraham, if now thou do prosper my way which I go: 43Behold, I stand by the well of water; and it shall come to pass, that when the virgin cometh forth to drawwater,and I say to her, Give me, I pray thee, a little water of thy pitcher to drink; 44And she say to me, Both drink thou, and I will also draw for thy camels:letthe samebethe woman whom theLordhathappointedout for my masterâs son. 45And before I had done speaking in mineheart, behold, Rebekah came forth with her pitcher on her shoulder; and she went down unto the well, and drewwater:and I said unto her, Let me drink, I pray thee. 46And she made haste, and let down her pitcher from hershoulder,and said, Drink, and I will give thy camels drink also: so I drank, and she made the camels drink also. 47And I asked her, and said, Whose daughterartthou? And she said, The daughter of Bethuel, Nahorâs son, whom Milcah bare unto him: and I put theearring upon her face, and the bracelets upon her hands. 48And Iboweddown my head, and worshipped theLord, and blessed theLordGod of my master Abraham, which had led me in the right way to take my masterâs brotherâsdaughterunto his son. 49And now if ye will deal kindly and truly with my master, tell me: and if not, tell me; that I may turn to the right hand, or to the left. 50Then Laban and Bethuel answered and said, The thing proceedeth from theLord: we cannotspeakunto thee bad or good. 51Behold, Rebekahisbefore thee, takeher,and go, and let her be thy masterâs sonâswife, as theLordhath spoken. 52And it came to pass, that, when Abrahamâs servant heard their words, he worshipped theLord,bowing himselfto the earth. 53And the servant brought forthjewelsof silver, and jewels of gold, and raiment, and gavethemto Rebekah: he gave also to her brother and to her mother precious things. 54And they did eat and drink, he and the men thatwerewith him, and tarried all night; and they rose up in the morning, and he said, Send me away unto my master. 55And her brother and her mother said, Let the damsel abide with usa fewdays, at the least ten; after that she shall go. 56And he said unto them, Hinder me not, seeing theLordhathprosperedmy way; send me away that I may go to my master. 57And they said, We will call the damsel, and inquire at her mouth. 58And they called Rebekah, and said unto her, Wilt thou go with this man? And she said, I will go. 59And they sent away Rebekah their sister, and hernurse, and Abrahamâs servant, and his men. 60And they blessed Rebekah, and said unto her, Thouartour sister, be thouthemotherof thousands of millions, and let thy seed possess thegateof those whichhatethem. 61Â¶And Rebekah arose, and her damsels, and they rode upon the camels, and followed the man: and the servant took Rebekah, and went his way. 62And Isaac came from the way of thewellLahai-roi; for he dwelt in the south country. 63And Isaac went out tomeditatein the field at the eventide: and he lifted up his eyes, and saw, and, behold, the camelswerecoming. 64And Rebekah lifted up her eyes, and when she saw Isaac,she lighted offthe camel. 65For shehadsaid unto the servant, What manisthis that walketh in the field to meet us? And the servanthadsaid, Itismy master: therefore she took a veil, and covered herself. 66And the servant told Isaac all things that he had done. 67And Isaac brought her into his mother Sarahâs tent, and took Rebekah, and she became his wife; and he loved her: and Isaac wascomfortedafter his motherâsdeath."
    },
    {
      "reference": "Genesis 25",
      "title": "Genesis 25",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/25?lang=eng",
      "summary": "Abraham marries, has descendants, dies, and is buried in the cave of MachpelahâHis descendants through Ishmael are listedâRebekah conceives, and Jacob and Esau struggle in her wombâThe Lord reveals their destiny to RebekahâEsau sells his birthright for a mess of pottage.",
      "verses": [
        "1Then again Abraham took a wife, and her namewasKeturah.",
        "2And she bare him Zimran, and Jokshan, andMedan, andMidian, and Ishbak, and Shuah.",
        "3And Jokshan begat Sheba, and Dedan. And the sons of Dedan were Asshurim, and Letushim, and Leummim.",
        "4And the sons ofMidian; Ephah, and Epher, and Hanoch, and Abida, and Eldaah. All thesewerethe children ofKeturah.",
        "5Â¶AndAbrahamgaveall that he had unto Isaac.",
        "6But unto the sons of theconcubines, which Abraham had, Abraham gave gifts, andsentthem away from Isaac his son, while he yet lived, eastward, unto theeastcountry.",
        "7And thesearethedaysof the years ofAbrahamâslife which he lived, an hundred threescore and fifteen years.",
        "8Then Abraham gave up theghost, and died in a goodoldage, an old man, and fullof years;and wasgatheredto his people.",
        "9And his sons Isaac and Ishmaelburiedhim in the cave ofMachpelah, in the field of Ephron the son of Zohar the Hittite, whichisbefore Mamre;",
        "10The field which Abrahampurchasedof the sons of Heth: there was Abrahamburied, and Sarah his wife.",
        "11Â¶And it came to pass after the death of Abraham, that God blessed his son Isaac; and Isaac dwelt by thewellLahai-roi.",
        "12Â¶Now thesearethegenerationsof Ishmael, Abrahamâs son, whomHagarthe Egyptian, Sarahâs handmaid,bareunto Abraham:",
        "13And thesearethe names of the sons ofIshmael, by their names, according to their generations: the firstborn of Ishmael, Nebajoth; and Kedar, and Adbeel, and Mibsam,",
        "14And Mishma, and Dumah, and Massa,",
        "15Hadar, and Tema, Jetur, Naphish, and Kedemah:",
        "16Thesearethe sons of Ishmael, and thesearetheir names, by their towns, and by their castles;twelveprinces according to their nations.",
        "17And thesearethe years of the life of Ishmael, an hundred and thirty and seven years: and he gave up the ghost and died; and was gathered unto his people.",
        "18And they dwelt fromHavilahuntoShur, thatisbefore Egypt, as thou goest toward Assyria:andhe died in the presence of all his brethren.",
        "19Â¶And thesearethe generations of Isaac, Abrahamâs son:Abrahambegat Isaac:",
        "20And Isaac was forty years old when he took Rebekah to wife, the daughter ofBethuelthe Syrian ofPadan-aram, the sister to Laban the Syrian.",
        "21And Isaac entreated theLordfor hiswife, because shewasbarren: and theLordwasentreatedof him, and Rebekah his wife conceived.",
        "22And the children struggled together within her; and she said, Ifit beso, whyamI thus? And she went toinquireof theLord.",
        "23And theLordsaid unto her,Twonationsarein thy womb, and two manner of people shall be separated from thy bowels; andthe onepeople shall be stronger thanthe otherpeople; and theeldershall serve the younger.",
        "24Â¶And when her days to be delivered were fulfilled, behold,there weretwins in her womb.",
        "25And the first came out red, all over like anhairygarment; and they called his nameEsau.",
        "26And after that came his brother out, and his hand took hold on Esauâsheel; and hisnamewas calledJacob: and Isaacwasthreescore years old when she bare them.",
        "27And the boys grew: and Esau was a cunninghunter, a man of the field; and Jacobwasaplainman, dwelling intents.",
        "28And Isaac loved Esau, because he did eat ofhisvenison: butRebekahloved Jacob.",
        "29Â¶And Jacob sod pottage: and Esau came from the field, and hewasfaint:",
        "30And Esau said to Jacob, Feed me, I pray thee, with that same redpottage;for Iamfaint: therefore was his name calledEdom.",
        "31And Jacob said, Sell me this day thybirthright.",
        "32And Esau said, Behold, Iamat the point to die: and what profit shall this birthright do to me?",
        "33And Jacob said, Swear to me this day; and he sware unto him: and he sold his birthright unto Jacob.",
        "34Then Jacob gave Esau bread and pottage of lentiles; and he did eat and drink, and rose up, and went his way: thus Esau despisedhisbirthright."
      ],
      "full_text": "1Then again Abraham took a wife, and her namewasKeturah. 2And she bare him Zimran, and Jokshan, andMedan, andMidian, and Ishbak, and Shuah. 3And Jokshan begat Sheba, and Dedan. And the sons of Dedan were Asshurim, and Letushim, and Leummim. 4And the sons ofMidian; Ephah, and Epher, and Hanoch, and Abida, and Eldaah. All thesewerethe children ofKeturah. 5Â¶AndAbrahamgaveall that he had unto Isaac. 6But unto the sons of theconcubines, which Abraham had, Abraham gave gifts, andsentthem away from Isaac his son, while he yet lived, eastward, unto theeastcountry. 7And thesearethedaysof the years ofAbrahamâslife which he lived, an hundred threescore and fifteen years. 8Then Abraham gave up theghost, and died in a goodoldage, an old man, and fullof years;and wasgatheredto his people. 9And his sons Isaac and Ishmaelburiedhim in the cave ofMachpelah, in the field of Ephron the son of Zohar the Hittite, whichisbefore Mamre; 10The field which Abrahampurchasedof the sons of Heth: there was Abrahamburied, and Sarah his wife. 11Â¶And it came to pass after the death of Abraham, that God blessed his son Isaac; and Isaac dwelt by thewellLahai-roi. 12Â¶Now thesearethegenerationsof Ishmael, Abrahamâs son, whomHagarthe Egyptian, Sarahâs handmaid,bareunto Abraham: 13And thesearethe names of the sons ofIshmael, by their names, according to their generations: the firstborn of Ishmael, Nebajoth; and Kedar, and Adbeel, and Mibsam, 14And Mishma, and Dumah, and Massa, 15Hadar, and Tema, Jetur, Naphish, and Kedemah: 16Thesearethe sons of Ishmael, and thesearetheir names, by their towns, and by their castles;twelveprinces according to their nations. 17And thesearethe years of the life of Ishmael, an hundred and thirty and seven years: and he gave up the ghost and died; and was gathered unto his people. 18And they dwelt fromHavilahuntoShur, thatisbefore Egypt, as thou goest toward Assyria:andhe died in the presence of all his brethren. 19Â¶And thesearethe generations of Isaac, Abrahamâs son:Abrahambegat Isaac: 20And Isaac was forty years old when he took Rebekah to wife, the daughter ofBethuelthe Syrian ofPadan-aram, the sister to Laban the Syrian. 21And Isaac entreated theLordfor hiswife, because shewasbarren: and theLordwasentreatedof him, and Rebekah his wife conceived. 22And the children struggled together within her; and she said, Ifit beso, whyamI thus? And she went toinquireof theLord. 23And theLordsaid unto her,Twonationsarein thy womb, and two manner of people shall be separated from thy bowels; andthe onepeople shall be stronger thanthe otherpeople; and theeldershall serve the younger. 24Â¶And when her days to be delivered were fulfilled, behold,there weretwins in her womb. 25And the first came out red, all over like anhairygarment; and they called his nameEsau. 26And after that came his brother out, and his hand took hold on Esauâsheel; and hisnamewas calledJacob: and Isaacwasthreescore years old when she bare them. 27And the boys grew: and Esau was a cunninghunter, a man of the field; and Jacobwasaplainman, dwelling intents. 28And Isaac loved Esau, because he did eat ofhisvenison: butRebekahloved Jacob. 29Â¶And Jacob sod pottage: and Esau came from the field, and hewasfaint: 30And Esau said to Jacob, Feed me, I pray thee, with that same redpottage;for Iamfaint: therefore was his name calledEdom. 31And Jacob said, Sell me this day thybirthright. 32And Esau said, Behold, Iamat the point to die: and what profit shall this birthright do to me? 33And Jacob said, Swear to me this day; and he sware unto him: and he sold his birthright unto Jacob. 34Then Jacob gave Esau bread and pottage of lentiles; and he did eat and drink, and rose up, and went his way: thus Esau despisedhisbirthright."
    },
    {
      "reference": "Genesis 26",
      "title": "Genesis 26",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/26?lang=eng",
      "summary": "The Lord promises Isaac posterity as the stars of heaven in numberâIn his seed, all nations will be blessedâThe Lord prospers Isaac, temporally and spiritually, for Abrahamâs sakeâIsaac offers sacrificesâEsau marries Hittite wives to the sorrow of his parents.",
      "verses": [
        "1And there was afaminein the land, beside the first famine that was in the days of Abraham. And Isaac went untoAbimelechking of thePhilistinesunto Gerar.",
        "2And theLordappeared unto him, and said, Go not down into Egypt; dwell in the land which I shall tell thee of:",
        "3Sojournin this land, and I will be with thee, and willblessthee; for unto thee, and unto thy seed, I will give all thesecountries, and I will perform theoathwhich I sware unto Abraham thy father;",
        "4And I will make thyseedto multiply as the stars of heaven, and will give unto thy seed all these countries; and in thy seed shall all thenationsof the earth be blessed;",
        "5Because that Abrahamobeyedmy voice, and kept mycharge, my commandments, my statutes, and my laws.",
        "6Â¶And Isaac dwelt inGerar:",
        "7And the men of the place askedhimof his wife; and he said, Sheismysister: for he feared to say,She ismy wife; lest,said he,the men of the place should kill me for Rebekah; because shewasfairto look upon.",
        "8And it came to pass, when he had been there a long time, that Abimelech king of the Philistines looked out at a window, and saw, and, behold, Isaacwassporting with Rebekah his wife.",
        "9And Abimelech called Isaac, and said, Behold, of a surety sheisthy wife: and how saidst thou, Sheismy sister? And Isaac said unto him, Because I said, Lest I die for her.",
        "10AndAbimelechsaid, Whatisthis thou hast done unto us? one of the people might lightly havelienwith thy wife, and thou shouldest havebroughtguiltiness upon us.",
        "11And Abimelech charged allhispeople, saying, He that toucheth this man or his wife shall surely be put to death.",
        "12Then Isaac sowed in that land, and received in the same year anhundredfold: and theLordblessedhim.",
        "13Andthe man waxedgreat, and went forward, and grew until he became very great:",
        "14For he had possession of flocks, and possession of herds, and great store of servants: and the Philistinesenviedhim.",
        "15For all thewellswhich his fatherâs servants had digged in the days of Abraham his father, the Philistineshadstopped them, and filled them with earth.",
        "16And Abimelech said unto Isaac, Go from us; for thou art muchmightierthan we.",
        "17Â¶And Isaac departed thence, and pitched his tent in the valley of Gerar, and dwelt there.",
        "18And Isaac digged again the wells of water, which they had digged in the days of Abraham his father; for the Philistines had stopped them after the death of Abraham: and he called theirnamesafter the names by which his father had called them.",
        "19And Isaacâs servants digged in the valley, and found there a well of springing water.",
        "20And the herdmen of Gerar didstrivewith Isaacâs herdmen, saying, The waterisours: and he called the name of the wellEsek; because they strove with him.",
        "21And they digged another well, and strove for that also: and he called the name of itSitnah.",
        "22And heremovedfrom thence, and digged another well; and for that theystrovenot: and he called the name of itRehoboth; and he said, For now theLordhath made room for us, and we shall befruitfulin the land.",
        "23And he went up from thence toBeer-sheba.",
        "24And theLordappeared unto him the same night, and said, Iamthe God of Abraham thy father:fear not, forIamwith thee, and will bless thee, and multiply thyseedfor my servant Abrahamâs sake.",
        "25And he builded analtarthere, and called upon thenameof theLord, and pitched his tent there: and there Isaacâs servants digged a well.",
        "26Â¶Then Abimelech went to him from Gerar, and Ahuzzath one of his friends, andPhicholthe chief captain of his army.",
        "27And Isaac said unto them, Wherefore come ye to me, seeing yehateme, and have sent me away from you?",
        "28And they said, We saw certainly that theLordwas with thee: and we said, Let there be now an oath betwixt us,evenbetwixt us and thee, and let us make a covenant with thee;",
        "29That thou wilt do us no hurt, as we have not touched thee, and as we have done unto thee nothing but good, and have sent thee away inpeace: thouartnow theblessedof theLord.",
        "30And he made them a feast, and they did eat and drink.",
        "31And theyrose up betimesin the morning, andswareone to another: and Isaac sent them away, and they departed from him in peace.",
        "32And it came to pass the same day, that Isaacâs servants came, and told him concerning the well which they had digged, and said unto him, We have found water.",
        "33And he called it Shebah: therefore the name of the cityisBeer-shebaunto this day.",
        "34Â¶And Esau was forty years old when he took towifeJudith the daughter of Beeri the Hittite, and Bashemath the daughter of Elon the Hittite:",
        "35Which were agrief of mindunto Isaac and to Rebekah."
      ],
      "full_text": "1And there was afaminein the land, beside the first famine that was in the days of Abraham. And Isaac went untoAbimelechking of thePhilistinesunto Gerar. 2And theLordappeared unto him, and said, Go not down into Egypt; dwell in the land which I shall tell thee of: 3Sojournin this land, and I will be with thee, and willblessthee; for unto thee, and unto thy seed, I will give all thesecountries, and I will perform theoathwhich I sware unto Abraham thy father; 4And I will make thyseedto multiply as the stars of heaven, and will give unto thy seed all these countries; and in thy seed shall all thenationsof the earth be blessed; 5Because that Abrahamobeyedmy voice, and kept mycharge, my commandments, my statutes, and my laws. 6Â¶And Isaac dwelt inGerar: 7And the men of the place askedhimof his wife; and he said, Sheismysister: for he feared to say,She ismy wife; lest,said he,the men of the place should kill me for Rebekah; because shewasfairto look upon. 8And it came to pass, when he had been there a long time, that Abimelech king of the Philistines looked out at a window, and saw, and, behold, Isaacwassporting with Rebekah his wife. 9And Abimelech called Isaac, and said, Behold, of a surety sheisthy wife: and how saidst thou, Sheismy sister? And Isaac said unto him, Because I said, Lest I die for her. 10AndAbimelechsaid, Whatisthis thou hast done unto us? one of the people might lightly havelienwith thy wife, and thou shouldest havebroughtguiltiness upon us. 11And Abimelech charged allhispeople, saying, He that toucheth this man or his wife shall surely be put to death. 12Then Isaac sowed in that land, and received in the same year anhundredfold: and theLordblessedhim. 13Andthe man waxedgreat, and went forward, and grew until he became very great: 14For he had possession of flocks, and possession of herds, and great store of servants: and the Philistinesenviedhim. 15For all thewellswhich his fatherâs servants had digged in the days of Abraham his father, the Philistineshadstopped them, and filled them with earth. 16And Abimelech said unto Isaac, Go from us; for thou art muchmightierthan we. 17Â¶And Isaac departed thence, and pitched his tent in the valley of Gerar, and dwelt there. 18And Isaac digged again the wells of water, which they had digged in the days of Abraham his father; for the Philistines had stopped them after the death of Abraham: and he called theirnamesafter the names by which his father had called them. 19And Isaacâs servants digged in the valley, and found there a well of springing water. 20And the herdmen of Gerar didstrivewith Isaacâs herdmen, saying, The waterisours: and he called the name of the wellEsek; because they strove with him. 21And they digged another well, and strove for that also: and he called the name of itSitnah. 22And heremovedfrom thence, and digged another well; and for that theystrovenot: and he called the name of itRehoboth; and he said, For now theLordhath made room for us, and we shall befruitfulin the land. 23And he went up from thence toBeer-sheba. 24And theLordappeared unto him the same night, and said, Iamthe God of Abraham thy father:fear not, forIamwith thee, and will bless thee, and multiply thyseedfor my servant Abrahamâs sake. 25And he builded analtarthere, and called upon thenameof theLord, and pitched his tent there: and there Isaacâs servants digged a well. 26Â¶Then Abimelech went to him from Gerar, and Ahuzzath one of his friends, andPhicholthe chief captain of his army. 27And Isaac said unto them, Wherefore come ye to me, seeing yehateme, and have sent me away from you? 28And they said, We saw certainly that theLordwas with thee: and we said, Let there be now an oath betwixt us,evenbetwixt us and thee, and let us make a covenant with thee; 29That thou wilt do us no hurt, as we have not touched thee, and as we have done unto thee nothing but good, and have sent thee away inpeace: thouartnow theblessedof theLord. 30And he made them a feast, and they did eat and drink. 31And theyrose up betimesin the morning, andswareone to another: and Isaac sent them away, and they departed from him in peace. 32And it came to pass the same day, that Isaacâs servants came, and told him concerning the well which they had digged, and said unto him, We have found water. 33And he called it Shebah: therefore the name of the cityisBeer-shebaunto this day. 34Â¶And Esau was forty years old when he took towifeJudith the daughter of Beeri the Hittite, and Bashemath the daughter of Elon the Hittite: 35Which were agrief of mindunto Isaac and to Rebekah."
    },
    {
      "reference": "Genesis 27",
      "title": "Genesis 27",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/27?lang=eng",
      "summary": "Rebekah guides Jacob in seeking blessingsâJacob is blessed to have dominion and rule over peoples and nationsâEsau hates Jacob and plans to slay himâRebekah fears that Jacob may marry one of the daughters of Heth.",
      "verses": [
        "1And it came to pass, that when Isaac was old, and his eyes weredim, so that he could not see, he called Esau his eldest son, and said unto him, My son: and he said unto him, Behold,here amI.",
        "2And he said, Behold now, I am old, I know not the day of my death:",
        "3Now therefore take, I pray thee, thy weapons, thyquiverand thy bow, and go out to the field, andtakemesomevenison;",
        "4And make mesavourymeat, such as I love, and bringitto me, that I may eat; that my soul may bless thee before I die.",
        "5And Rebekah heard when Isaac spake to Esau his son. And Esau went to the field to huntforvenison,andto bringit.",
        "6Â¶AndRebekahspake unto Jacob her son, saying, Behold, I heard thy father speak unto Esau thy brother, saying,",
        "7Bring me venison, and make me savoury meat, that I may eat, and bless thee before theLordbefore my death.",
        "8Now therefore, my son, obey my voice according to that which I command thee.",
        "9Go now to the flock, and fetch me from thence two good kids of the goats; and I will make them savoury meat for thy father, such as he loveth:",
        "10And thou shalt bringitto thy father, that he may eat, and that he may bless thee before his death.",
        "11And Jacob said to Rebekah his mother, Behold, Esau my brotherisahairyman, and Iama smooth man:",
        "12My father peradventure will feel me, and I shall seem to him as a deceiver; and I shall bring a curse upon me, and not a blessing.",
        "13And his mother said unto him, Upon mebethy curse, my son: only obey my voice, and go fetch methem.",
        "14And he went, and fetched, and broughtthemto his mother: and his mother made savoury meat, such as his father loved.",
        "15And Rebekah took goodly raiment of her eldest son Esau, whichwerewith her in the house, and put them upon Jacob her younger son:",
        "16And she put theskinsof the kids of the goats upon his hands, and upon the smooth of his neck:",
        "17And she gave the savoury meat and the bread, which she had prepared, into the hand of her son Jacob.",
        "18Â¶And he came unto his father, and said, My father: and he said, HereamI; whoartthou, my son?",
        "19And Jacob said unto his father, IamEsau thy firstborn; I have done according as thou badest me: arise, I pray thee, sit and eat of my venison, that thy soul may bless me.",
        "20And Isaac said unto his son, Howis itthat thou hast founditso quickly, my son? And he said, Because theLordthy God broughtitto me.",
        "21And Isaac said unto Jacob, Come near, I pray thee, that I may feel thee, my son, whether thoubemy very son Esau or not.",
        "22And Jacob went near unto Isaac his father; and he felt him, and said, The voiceisJacobâs voice, but the handsarethe hands of Esau.",
        "23And he discerned him not, because his hands were hairy, as his brother Esauâs hands: so he blessed him.",
        "24And he said,Artthou my very son Esau? And he said, Iam.",
        "25And he said, Bringitnear to me, and I will eat of my sonâs venison, that my soul may bless thee. And he broughtitnear to him, and he did eat: and he brought him wine, and he drank.",
        "26And his father Isaac said unto him, Come near now, and kiss me, my son.",
        "27And he camenear, and kissed him: and he smelled the smell of his raiment, andblessedhim, and said, See, the smell of my sonisas the smell of a field which theLordhath blessed:",
        "28Therefore God give thee of thedewof heaven, and the fatness of the earth, and plenty of corn and wine:",
        "29Let peopleservethee, and nations bow down to thee: be lord over thy brethren, and let thy motherâs sonsbowdown to thee: cursedbeevery one that curseth thee, andblessedbehe thatblesseththee.",
        "30Â¶And it came to pass, as soon as Isaac had made an end of blessing Jacob, and Jacob was yet scarce gone out from the presence of Isaac his father, that Esau his brother came in from his hunting.",
        "31And he also had made savoury meat, and brought it unto his father, and said unto his father, Let my father arise, and eat of his sonâs venison, that thy soul may bless me.",
        "32And Isaac his father said unto him, Whoartthou? And he said, Iamthy son, thy firstborn Esau.",
        "33And Isaac trembled very exceedingly, and said, Who? whereishe that hathtaken venison, and broughtitme, and I have eaten of all before thou camest, and haveblessedhim? yea,andhe shall be blessed.",
        "34And when Esau heard the words of his father, he cried with a great and exceeding bitter cry, and said unto his father, Bless me,evenme also, O my father.",
        "35And he said, Thy brother came with subtilty, and hath taken away thy blessing.",
        "36And he said, Is not he rightly namedJacob? for he hath supplanted me these two times: he took away mybirthright; and, behold, now he hath taken away my blessing. And he said, Hast thou not reserved a blessing for me?",
        "37And Isaac answered and said unto Esau, Behold, I have made him thy lord, and all his brethren have I given to him forservants; and with corn and wine have I sustained him: and what shall I do now unto thee, my son?",
        "38And Esau said unto his father, Hast thou but one blessing, my father? bless me,evenme also, O my father. And Esau lifted up his voice, andwept.",
        "39And Isaac his father answered and said unto him, Behold, thy dwelling shall be the fatness of the earth, and of the dew of heaven from above;",
        "40And by thy sword shalt thou live, and shalt serve thybrother; and it shall come to pass when thou shalt have the dominion, that thou shaltbreakhisyokefrom off thy neck.",
        "41Â¶And Esau hated Jacob becauseof the blessing wherewith his father blessed him: and Esau said in his heart, The days of mourning for my father are at hand; then will I slay my brother Jacob.",
        "42And these words of Esau her elder son were told to Rebekah: and she sent and called Jacob her younger son, and said unto him, Behold, thy brother Esau, as touching thee, doth comfort himself,purposingto kill thee.",
        "43Now therefore, my son, obey my voice; and arise,fleethou to Laban mybrothertoHaran;",
        "44And tarry with him a few days, until thy brotherâs fury turn away;",
        "45Until thy brotherâsangerturn away from thee, and he forgetthatwhich thou hast done to him: then I will send, and fetch thee from thence: why should I be deprived also of you both in one day?",
        "46And Rebekah said to Isaac, I am weary of my life because of thedaughtersof Heth: if Jacob take a wife of the daughters of Heth, such as thesewhich areof the daughters of the land, what good shall my life do me?"
      ],
      "full_text": "1And it came to pass, that when Isaac was old, and his eyes weredim, so that he could not see, he called Esau his eldest son, and said unto him, My son: and he said unto him, Behold,here amI. 2And he said, Behold now, I am old, I know not the day of my death: 3Now therefore take, I pray thee, thy weapons, thyquiverand thy bow, and go out to the field, andtakemesomevenison; 4And make mesavourymeat, such as I love, and bringitto me, that I may eat; that my soul may bless thee before I die. 5And Rebekah heard when Isaac spake to Esau his son. And Esau went to the field to huntforvenison,andto bringit. 6Â¶AndRebekahspake unto Jacob her son, saying, Behold, I heard thy father speak unto Esau thy brother, saying, 7Bring me venison, and make me savoury meat, that I may eat, and bless thee before theLordbefore my death. 8Now therefore, my son, obey my voice according to that which I command thee. 9Go now to the flock, and fetch me from thence two good kids of the goats; and I will make them savoury meat for thy father, such as he loveth: 10And thou shalt bringitto thy father, that he may eat, and that he may bless thee before his death. 11And Jacob said to Rebekah his mother, Behold, Esau my brotherisahairyman, and Iama smooth man: 12My father peradventure will feel me, and I shall seem to him as a deceiver; and I shall bring a curse upon me, and not a blessing. 13And his mother said unto him, Upon mebethy curse, my son: only obey my voice, and go fetch methem. 14And he went, and fetched, and broughtthemto his mother: and his mother made savoury meat, such as his father loved. 15And Rebekah took goodly raiment of her eldest son Esau, whichwerewith her in the house, and put them upon Jacob her younger son: 16And she put theskinsof the kids of the goats upon his hands, and upon the smooth of his neck: 17And she gave the savoury meat and the bread, which she had prepared, into the hand of her son Jacob. 18Â¶And he came unto his father, and said, My father: and he said, HereamI; whoartthou, my son? 19And Jacob said unto his father, IamEsau thy firstborn; I have done according as thou badest me: arise, I pray thee, sit and eat of my venison, that thy soul may bless me. 20And Isaac said unto his son, Howis itthat thou hast founditso quickly, my son? And he said, Because theLordthy God broughtitto me. 21And Isaac said unto Jacob, Come near, I pray thee, that I may feel thee, my son, whether thoubemy very son Esau or not. 22And Jacob went near unto Isaac his father; and he felt him, and said, The voiceisJacobâs voice, but the handsarethe hands of Esau. 23And he discerned him not, because his hands were hairy, as his brother Esauâs hands: so he blessed him. 24And he said,Artthou my very son Esau? And he said, Iam. 25And he said, Bringitnear to me, and I will eat of my sonâs venison, that my soul may bless thee. And he broughtitnear to him, and he did eat: and he brought him wine, and he drank. 26And his father Isaac said unto him, Come near now, and kiss me, my son. 27And he camenear, and kissed him: and he smelled the smell of his raiment, andblessedhim, and said, See, the smell of my sonisas the smell of a field which theLordhath blessed: 28Therefore God give thee of thedewof heaven, and the fatness of the earth, and plenty of corn and wine: 29Let peopleservethee, and nations bow down to thee: be lord over thy brethren, and let thy motherâs sonsbowdown to thee: cursedbeevery one that curseth thee, andblessedbehe thatblesseththee. 30Â¶And it came to pass, as soon as Isaac had made an end of blessing Jacob, and Jacob was yet scarce gone out from the presence of Isaac his father, that Esau his brother came in from his hunting. 31And he also had made savoury meat, and brought it unto his father, and said unto his father, Let my father arise, and eat of his sonâs venison, that thy soul may bless me. 32And Isaac his father said unto him, Whoartthou? And he said, Iamthy son, thy firstborn Esau. 33And Isaac trembled very exceedingly, and said, Who? whereishe that hathtaken venison, and broughtitme, and I have eaten of all before thou camest, and haveblessedhim? yea,andhe shall be blessed. 34And when Esau heard the words of his father, he cried with a great and exceeding bitter cry, and said unto his father, Bless me,evenme also, O my father. 35And he said, Thy brother came with subtilty, and hath taken away thy blessing. 36And he said, Is not he rightly namedJacob? for he hath supplanted me these two times: he took away mybirthright; and, behold, now he hath taken away my blessing. And he said, Hast thou not reserved a blessing for me? 37And Isaac answered and said unto Esau, Behold, I have made him thy lord, and all his brethren have I given to him forservants; and with corn and wine have I sustained him: and what shall I do now unto thee, my son? 38And Esau said unto his father, Hast thou but one blessing, my father? bless me,evenme also, O my father. And Esau lifted up his voice, andwept. 39And Isaac his father answered and said unto him, Behold, thy dwelling shall be the fatness of the earth, and of the dew of heaven from above; 40And by thy sword shalt thou live, and shalt serve thybrother; and it shall come to pass when thou shalt have the dominion, that thou shaltbreakhisyokefrom off thy neck. 41Â¶And Esau hated Jacob becauseof the blessing wherewith his father blessed him: and Esau said in his heart, The days of mourning for my father are at hand; then will I slay my brother Jacob. 42And these words of Esau her elder son were told to Rebekah: and she sent and called Jacob her younger son, and said unto him, Behold, thy brother Esau, as touching thee, doth comfort himself,purposingto kill thee. 43Now therefore, my son, obey my voice; and arise,fleethou to Laban mybrothertoHaran; 44And tarry with him a few days, until thy brotherâs fury turn away; 45Until thy brotherâsangerturn away from thee, and he forgetthatwhich thou hast done to him: then I will send, and fetch thee from thence: why should I be deprived also of you both in one day? 46And Rebekah said to Isaac, I am weary of my life because of thedaughtersof Heth: if Jacob take a wife of the daughters of Heth, such as thesewhich areof the daughters of the land, what good shall my life do me?"
    },
    {
      "reference": "Genesis 28",
      "title": "Genesis 28",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/28?lang=eng",
      "summary": "Isaac forbids Jacob to marry a CanaaniteâHe blesses Jacob and his seed with the blessings of AbrahamâEsau marries a daughter of IshmaelâJacob sees in vision a ladder reaching up into heavenâThe Lord promises him seed as the dust of the earth in numberâThe Lord also promises Jacob that in him and in his seed all the families of the earth will be blessedâJacob covenants to pay tithes.",
      "verses": [
        "1And Isaac called Jacob, and blessed him, and charged him, and said unto him, Thou shalt not take awifeof the daughters ofCanaan.",
        "2Arise, go toPadan-aram, to the house ofBethuelthy motherâs father; and take thee a wife from thence of the daughters ofLabanthy motherâs brother.",
        "3And GodAlmightyblessthee, and make theefruitful, and multiply thee, that thou mayest be amultitudeof people;",
        "4And give thee the blessing of Abraham, to thee, and to thyseedwith thee; that thou mayest inherit the land wherein thou art a stranger, which God gave unto Abraham.",
        "5And Isaac sent away Jacob: and he went to Padan-aram unto Laban, son of Bethuel theSyrian, the brother of Rebekah, Jacobâs and Esauâs mother.",
        "6Â¶When Esau saw that Isaac had blessed Jacob, and sent him away to Padan-aram, to take him a wife from thence; and that as he blessed him he gave him a charge, saying, Thou shalt not take a wife of the daughters of Canaan;",
        "7And that Jacob obeyed his father and his mother, and was gone to Padan-aram;",
        "8And Esau seeing that the daughters of Canaan pleased not Isaac his father;",
        "9Then went Esau untoIshmael, and took unto the wives which he had Mahalath the daughter of Ishmael Abrahamâs son, the sister of Nebajoth, to be hiswife.",
        "10Â¶And Jacob went out from Beer-sheba, and went toward Haran.",
        "11And he lighted upon a certain place, and tarried there all night, because the sun was set; and he took of the stones of that place, and putthem forhis pillows, and lay down in that place to sleep.",
        "12And hedreamed, and behold aladder set up on the earth, and the top of it reached to heaven: and behold theangelsof God ascending and descending on it.",
        "13And, behold, theLordstoodabove it, and said, IamtheLordGodof Abraham thy father, and the God of Isaac: thelandwhereon thou liest, to thee will I give it, and to thy seed;",
        "14And thy seed shall be as the dust of the earth, and thou shalt spread abroad to the west, and to the east, and to thenorth, and to the south: and in thee and in thyseedshall all thefamiliesof the earth beblessed.",
        "15And, behold,Iamwith thee, and will keep thee in allplaceswhither thou goest, and willbringthee again into thisland; for I will not leave thee, until I have donethatwhich I have spoken to thee of.",
        "16Â¶And Jacob awaked out of his sleep, and he said, Surely theLordis in this place; and I knewitnot.",
        "17And he was afraid, and said, How dreadfulisthis place! thisisnone other but the house of God, and thisisthe gate ofheaven.",
        "18And Jacob rose up early in the morning, and took the stone that he had putforhis pillows, and set it upforapillar, and poured oil upon the top of it.",
        "19And he called the name of that placeBeth-el: but the name of that citywas calledLuzat the first.",
        "20And Jacob vowed avow, saying, If God will be with me, and will keep me in this way that I go, and will give me bread to eat, and raiment to put on,",
        "21So that I come again to my fatherâs house in peace; then shall theLordbe my God:",
        "22And this stone, which I have setfora pillar, shall be Godâs house: and of all that thou shalt give me I will surely give thetenthunto thee."
      ],
      "full_text": "1And Isaac called Jacob, and blessed him, and charged him, and said unto him, Thou shalt not take awifeof the daughters ofCanaan. 2Arise, go toPadan-aram, to the house ofBethuelthy motherâs father; and take thee a wife from thence of the daughters ofLabanthy motherâs brother. 3And GodAlmightyblessthee, and make theefruitful, and multiply thee, that thou mayest be amultitudeof people; 4And give thee the blessing of Abraham, to thee, and to thyseedwith thee; that thou mayest inherit the land wherein thou art a stranger, which God gave unto Abraham. 5And Isaac sent away Jacob: and he went to Padan-aram unto Laban, son of Bethuel theSyrian, the brother of Rebekah, Jacobâs and Esauâs mother. 6Â¶When Esau saw that Isaac had blessed Jacob, and sent him away to Padan-aram, to take him a wife from thence; and that as he blessed him he gave him a charge, saying, Thou shalt not take a wife of the daughters of Canaan; 7And that Jacob obeyed his father and his mother, and was gone to Padan-aram; 8And Esau seeing that the daughters of Canaan pleased not Isaac his father; 9Then went Esau untoIshmael, and took unto the wives which he had Mahalath the daughter of Ishmael Abrahamâs son, the sister of Nebajoth, to be hiswife. 10Â¶And Jacob went out from Beer-sheba, and went toward Haran. 11And he lighted upon a certain place, and tarried there all night, because the sun was set; and he took of the stones of that place, and putthem forhis pillows, and lay down in that place to sleep. 12And hedreamed, and behold aladder set up on the earth, and the top of it reached to heaven: and behold theangelsof God ascending and descending on it. 13And, behold, theLordstoodabove it, and said, IamtheLordGodof Abraham thy father, and the God of Isaac: thelandwhereon thou liest, to thee will I give it, and to thy seed; 14And thy seed shall be as the dust of the earth, and thou shalt spread abroad to the west, and to the east, and to thenorth, and to the south: and in thee and in thyseedshall all thefamiliesof the earth beblessed. 15And, behold,Iamwith thee, and will keep thee in allplaceswhither thou goest, and willbringthee again into thisland; for I will not leave thee, until I have donethatwhich I have spoken to thee of. 16Â¶And Jacob awaked out of his sleep, and he said, Surely theLordis in this place; and I knewitnot. 17And he was afraid, and said, How dreadfulisthis place! thisisnone other but the house of God, and thisisthe gate ofheaven. 18And Jacob rose up early in the morning, and took the stone that he had putforhis pillows, and set it upforapillar, and poured oil upon the top of it. 19And he called the name of that placeBeth-el: but the name of that citywas calledLuzat the first. 20And Jacob vowed avow, saying, If God will be with me, and will keep me in this way that I go, and will give me bread to eat, and raiment to put on, 21So that I come again to my fatherâs house in peace; then shall theLordbe my God: 22And this stone, which I have setfora pillar, shall be Godâs house: and of all that thou shalt give me I will surely give thetenthunto thee."
    },
    {
      "reference": "Genesis 29",
      "title": "Genesis 29",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/29?lang=eng",
      "summary": "Jacob meets Rachel at the wellâHe serves Laban seven years for herâLaban gives to Jacob first Leah then Rachel in marriageâJacob serves another seven yearsâLeah bears Reuben, Simeon, Levi, and Judah.",
      "verses": [
        "1Then Jacob went on his journey, and came into the land of the people of the east.",
        "2And he looked, and behold a well in the field, and, lo, therewerethree flocks of sheep lying by it; for out of that well they watered the flocks: and a great stonewasupon the wellâs mouth.",
        "3And thither were all the flocks gathered: and they rolled the stone from the wellâs mouth, and watered the sheep, and put the stone again upon the wellâs mouth in his place.",
        "4And Jacob said unto them, My brethren, whencebeye? And they said, OfHaranarewe.",
        "5And he said unto them, Know yeLabanthe son of Nahor? And they said, We knowhim.",
        "6And he said unto them,Ishe well? And they said,He iswell: and, behold, Rachel his daughter cometh with the sheep.",
        "7And he said, Lo,it isyet high day, neitheris ittime that the cattle should be gathered together: water ye the sheep, and goandfeedthem.",
        "8And they said, We cannot, until allthe flocksbe gathered together, andtillthey roll the stone from the wellâs mouth; then we water the sheep.",
        "9Â¶And while he yet spake with them, Rachel came with her fatherâs sheep: for she kept them.",
        "10And it came to pass, when Jacob saw Rachel the daughter of Laban his motherâs brother, and the sheep of Laban his motherâs brother, that Jacob went near, and rolled the stone from the wellâs mouth, andwateredthe flock of Laban his motherâs brother.",
        "11And Jacob kissed Rachel, and lifted up his voice, and wept.",
        "12And Jacob told Rachel that hewasher fatherâs brother, and that hewasRebekahâs son: and she ran and told her father.",
        "13And it came to pass, when Laban heard the tidings of Jacob his sisterâs son, that he ran to meet him, and embraced him, and kissed him, and brought him to his house. And he told Laban all these things.",
        "14And Laban said to him, Surely thouartmy bone and myflesh. And he abode with him the space of a month.",
        "15Â¶And Laban said unto Jacob, Because thouartmy brother, shouldest thou therefore serve me for nought? tell me, whatshallthy wagesbe?",
        "16And Laban had two daughters: the name of the elderwasLeah, and the name of the youngerwasRachel.",
        "17Leahwastender eyed; but Rachelwasbeautifuland wellfavoured.",
        "18And Jacob loved Rachel; and said, I willservethee seven years for Rachel thy younger daughter.",
        "19And Laban said,It isbetter that I give her to thee, than that I should give her to another man: abide with me.",
        "20And Jacob served seven years forRachel; and they seemed unto himbuta few days, for thelovehe had to her.",
        "21Â¶And Jacob said unto Laban, Givememy wife, for my days are fulfilled, that I may go in unto her.",
        "22And Laban gathered together all the men of the place, and made afeast.",
        "23And it came to pass in the evening, that he took Leah his daughter, and brought her to him; and he went in unto her.",
        "24And Laban gave unto his daughter LeahZilpahhis maidforan handmaid.",
        "25And it came to pass, that in the morning, behold, itwasLeah: and he said to Laban, Whatisthis thou hast done unto me? did not I serve with thee for Rachel? wherefore then hast thou beguiled me?",
        "26And Laban said, It must not be so done in our country, to give the younger before thefirstborn.",
        "27Fulfil her week, and we will give thee this also for the service which thou shalt serve with me yet seven other years.",
        "28And Jacob did so, and fulfilled her week: and he gave him Rachel his daughter to wife also.",
        "29And Laban gave to Rachel his daughterBilhahhis handmaid to be her maid.",
        "30And he went in also unto Rachel, and helovedalso Rachel more than Leah, andservedwith him yet seven other years.",
        "31Â¶And when theLordsaw that Leahwashated, he opened her womb: but Rachelwasbarren.",
        "32AndLeahconceived, and bare a son, and she called his nameReuben: for she said, Surely theLordhath looked upon my affliction; now therefore my husband will love me.",
        "33And she conceived again, and bare a son; and said, Because theLordhath heard that Iwashated, he hath therefore given me thissonalso: and she called his nameSimeon.",
        "34And she conceived again, and bare a son; and said, Now this time will my husband be joined unto me, because I have born him three sons: therefore was his name calledLevi.",
        "35And she conceived again, and bare a son: and she said, Now will IpraisetheLord: therefore she called his nameJudah; and left bearing."
      ],
      "full_text": "1Then Jacob went on his journey, and came into the land of the people of the east. 2And he looked, and behold a well in the field, and, lo, therewerethree flocks of sheep lying by it; for out of that well they watered the flocks: and a great stonewasupon the wellâs mouth. 3And thither were all the flocks gathered: and they rolled the stone from the wellâs mouth, and watered the sheep, and put the stone again upon the wellâs mouth in his place. 4And Jacob said unto them, My brethren, whencebeye? And they said, OfHaranarewe. 5And he said unto them, Know yeLabanthe son of Nahor? And they said, We knowhim. 6And he said unto them,Ishe well? And they said,He iswell: and, behold, Rachel his daughter cometh with the sheep. 7And he said, Lo,it isyet high day, neitheris ittime that the cattle should be gathered together: water ye the sheep, and goandfeedthem. 8And they said, We cannot, until allthe flocksbe gathered together, andtillthey roll the stone from the wellâs mouth; then we water the sheep. 9Â¶And while he yet spake with them, Rachel came with her fatherâs sheep: for she kept them. 10And it came to pass, when Jacob saw Rachel the daughter of Laban his motherâs brother, and the sheep of Laban his motherâs brother, that Jacob went near, and rolled the stone from the wellâs mouth, andwateredthe flock of Laban his motherâs brother. 11And Jacob kissed Rachel, and lifted up his voice, and wept. 12And Jacob told Rachel that hewasher fatherâs brother, and that hewasRebekahâs son: and she ran and told her father. 13And it came to pass, when Laban heard the tidings of Jacob his sisterâs son, that he ran to meet him, and embraced him, and kissed him, and brought him to his house. And he told Laban all these things. 14And Laban said to him, Surely thouartmy bone and myflesh. And he abode with him the space of a month. 15Â¶And Laban said unto Jacob, Because thouartmy brother, shouldest thou therefore serve me for nought? tell me, whatshallthy wagesbe? 16And Laban had two daughters: the name of the elderwasLeah, and the name of the youngerwasRachel. 17Leahwastender eyed; but Rachelwasbeautifuland wellfavoured. 18And Jacob loved Rachel; and said, I willservethee seven years for Rachel thy younger daughter. 19And Laban said,It isbetter that I give her to thee, than that I should give her to another man: abide with me. 20And Jacob served seven years forRachel; and they seemed unto himbuta few days, for thelovehe had to her. 21Â¶And Jacob said unto Laban, Givememy wife, for my days are fulfilled, that I may go in unto her. 22And Laban gathered together all the men of the place, and made afeast. 23And it came to pass in the evening, that he took Leah his daughter, and brought her to him; and he went in unto her. 24And Laban gave unto his daughter LeahZilpahhis maidforan handmaid. 25And it came to pass, that in the morning, behold, itwasLeah: and he said to Laban, Whatisthis thou hast done unto me? did not I serve with thee for Rachel? wherefore then hast thou beguiled me? 26And Laban said, It must not be so done in our country, to give the younger before thefirstborn. 27Fulfil her week, and we will give thee this also for the service which thou shalt serve with me yet seven other years. 28And Jacob did so, and fulfilled her week: and he gave him Rachel his daughter to wife also. 29And Laban gave to Rachel his daughterBilhahhis handmaid to be her maid. 30And he went in also unto Rachel, and helovedalso Rachel more than Leah, andservedwith him yet seven other years. 31Â¶And when theLordsaw that Leahwashated, he opened her womb: but Rachelwasbarren. 32AndLeahconceived, and bare a son, and she called his nameReuben: for she said, Surely theLordhath looked upon my affliction; now therefore my husband will love me. 33And she conceived again, and bare a son; and said, Because theLordhath heard that Iwashated, he hath therefore given me thissonalso: and she called his nameSimeon. 34And she conceived again, and bare a son; and said, Now this time will my husband be joined unto me, because I have born him three sons: therefore was his name calledLevi. 35And she conceived again, and bare a son: and she said, Now will IpraisetheLord: therefore she called his nameJudah; and left bearing."
    },
    {
      "reference": "Genesis 30",
      "title": "Genesis 30",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/30?lang=eng",
      "summary": "Jacob marries Bilhah, and she bears Dan and NaphtaliâHe marries Zilpah, and she bears Gad and AsherâLeah bears Issachar and Zebulun and a daughter, DinahâThen Rachel conceives and bears JosephâJacob works for Laban for wages of cattle and sheep.",
      "verses": [
        "1And when Rachel saw that she bare Jacob no children, Rachelenviedher sister; and said unto Jacob, Give me children, or else I die.",
        "2And Jacobâs anger was kindled against Rachel: and he said,AmI inGodâsstead, who hath withheld from thee the fruit of the womb?",
        "3And she said, Behold my maid Bilhah, go in unto her; and she shall bear upon my knees, that I may alsohave children by her.",
        "4And she gave himBilhahher handmaid to wife: and Jacob went in unto her.",
        "5AndBilhahconceived, and bare Jacob a son.",
        "6And Rachel said, God hath judged me, and hath also heard my voice, and hath given me a son: therefore called she his nameDan.",
        "7And Bilhah Rachelâs maid conceived again, and bare Jacob a second son.",
        "8And Rachel said,Withgreat wrestlings have I wrestled with my sister, and I have prevailed: and she called his nameNaphtali.",
        "9When Leah saw that she had left bearing, she took Zilpah her maid, and gave her Jacob to wife.",
        "10And Zilpah Leahâs maid bare Jacob a son.",
        "11And Leah said, Atroopcometh: and she called his nameGad.",
        "12AndZilpahLeahâs maid bare Jacob a second son.",
        "13And Leah said, Happy am I, for the daughters will call meblessed: and she called his nameAsher.",
        "14Â¶And Reuben went in the days of wheat harvest, and foundmandrakesin the field, and brought them unto his mother Leah. Then Rachel said to Leah, Give me, I pray thee, of thy sonâs mandrakes.",
        "15And she said unto her,Is ita small matter that thou hasttakenmy husband? and wouldest thou take away my sonâs mandrakes also? And Rachel said, Therefore he shall lie with thee to night for thy sonâs mandrakes.",
        "16And Jacob came out of the field in the evening, and Leah went out to meet him, and said, Thou must comein unto me; for surely I have hired thee with my sonâs mandrakes. And he lay with her that night.",
        "17And God hearkened unto Leah, and she conceived, and bare Jacob the fifth son.",
        "18And Leah said, God hath given me myhire, because I have given my maiden to my husband: and she called his nameIssachar.",
        "19And Leah conceived again, and bare Jacob the sixth son.",
        "20And Leah said, God hath endued mewitha good dowry; now will my husbanddwell with me, because I have born him six sons: and she called his nameZebulun.",
        "21And afterwards she bare a daughter, and called her name Dinah.",
        "22Â¶And GodrememberedRachel, and God hearkened to her, and opened her womb.",
        "23And she conceived, and bare a son; and said, God hath taken away myreproach:",
        "24And she called his nameJoseph; and said, TheLordshall add to me another son.",
        "25Â¶And it came to pass, when Rachel had born Joseph, that Jacob said unto Laban, Send me away, that I may go unto mine own place, and to my country.",
        "26Givememy wives and my children, for whom I haveservedthee, and let me go: for thou knowest my service which I have done thee.",
        "27And Laban said unto him, I pray thee, if I have found favour in thine eyes,tarry: forI have learned by experience that theLordhathblessedme for thysake.",
        "28And he said, Appoint me thy wages, and I will giveit.",
        "29And he said unto him, Thou knowest how I have served thee, and how thy cattle was with me.",
        "30Forit waslittle which thou hadst before Icame,and it isnowincreased unto a multitude; and theLordhath blessed thee since my coming: and now when shall I provide for mine own house also?",
        "31And he said, What shall I give thee? And Jacob said, Thou shalt not give me any thing: if thou wilt do this thing for me, I will again feedandkeep thy flock:",
        "32I will pass through all thy flock to day, removing from thence all the speckled and spottedcattle, and all the brown cattle among the sheep, and the spotted and speckled among the goats: andof suchshall be my hire.",
        "33So shall myrighteousnessanswer for me in time to come, when it shall come for my hire before thy face: every one thatisnot speckled and spotted among the goats, and brown among the sheep, that shall be counted stolen with me.",
        "34And Laban said, Behold, I would it might be according to thy word.",
        "35And he removed that day the he goats that were ringstraked and spotted, and all the she goats that were speckled and spotted,andevery one that hadsomewhite in it, and all the brown among the sheep, and gavetheminto the hand of his sons.",
        "36And he set three daysâ journey betwixt himself and Jacob: and Jacob fed the rest of Labanâs flocks.",
        "37Â¶And Jacob took him rods of green poplar, and of thehazelandchestnut tree; andpilledwhite strakes in them, and made the white appear whichwasin the rods.",
        "38And he set the rods which he had pilled before the flocks in the gutters in the watering troughs when the flocks came to drink, that they should conceive when they came to drink.",
        "39And the flocks conceived before therods, and brought forth cattle ringstraked, speckled, and spotted.",
        "40And Jacob did separate the lambs, and set the faces of the flocks toward the ringstraked, and all the brown in the flock of Laban; and he put his own flocks by themselves, and put them not unto Labanâs cattle.",
        "41And it came to pass, whensoever the stronger cattle did conceive, that Jacob laid the rods before the eyes of the cattle in the gutters, that they might conceive among the rods.",
        "42But when the cattle were feeble, he putthemnot in: so the feebler were Labanâs, and the stronger Jacobâs.",
        "43And the manincreasedexceedingly, and had much cattle, and maidservants, and menservants, and camels, and asses."
      ],
      "full_text": "1And when Rachel saw that she bare Jacob no children, Rachelenviedher sister; and said unto Jacob, Give me children, or else I die. 2And Jacobâs anger was kindled against Rachel: and he said,AmI inGodâsstead, who hath withheld from thee the fruit of the womb? 3And she said, Behold my maid Bilhah, go in unto her; and she shall bear upon my knees, that I may alsohave children by her. 4And she gave himBilhahher handmaid to wife: and Jacob went in unto her. 5AndBilhahconceived, and bare Jacob a son. 6And Rachel said, God hath judged me, and hath also heard my voice, and hath given me a son: therefore called she his nameDan. 7And Bilhah Rachelâs maid conceived again, and bare Jacob a second son. 8And Rachel said,Withgreat wrestlings have I wrestled with my sister, and I have prevailed: and she called his nameNaphtali. 9When Leah saw that she had left bearing, she took Zilpah her maid, and gave her Jacob to wife. 10And Zilpah Leahâs maid bare Jacob a son. 11And Leah said, Atroopcometh: and she called his nameGad. 12AndZilpahLeahâs maid bare Jacob a second son. 13And Leah said, Happy am I, for the daughters will call meblessed: and she called his nameAsher. 14Â¶And Reuben went in the days of wheat harvest, and foundmandrakesin the field, and brought them unto his mother Leah. Then Rachel said to Leah, Give me, I pray thee, of thy sonâs mandrakes. 15And she said unto her,Is ita small matter that thou hasttakenmy husband? and wouldest thou take away my sonâs mandrakes also? And Rachel said, Therefore he shall lie with thee to night for thy sonâs mandrakes. 16And Jacob came out of the field in the evening, and Leah went out to meet him, and said, Thou must comein unto me; for surely I have hired thee with my sonâs mandrakes. And he lay with her that night. 17And God hearkened unto Leah, and she conceived, and bare Jacob the fifth son. 18And Leah said, God hath given me myhire, because I have given my maiden to my husband: and she called his nameIssachar. 19And Leah conceived again, and bare Jacob the sixth son. 20And Leah said, God hath endued mewitha good dowry; now will my husbanddwell with me, because I have born him six sons: and she called his nameZebulun. 21And afterwards she bare a daughter, and called her name Dinah. 22Â¶And GodrememberedRachel, and God hearkened to her, and opened her womb. 23And she conceived, and bare a son; and said, God hath taken away myreproach: 24And she called his nameJoseph; and said, TheLordshall add to me another son. 25Â¶And it came to pass, when Rachel had born Joseph, that Jacob said unto Laban, Send me away, that I may go unto mine own place, and to my country. 26Givememy wives and my children, for whom I haveservedthee, and let me go: for thou knowest my service which I have done thee. 27And Laban said unto him, I pray thee, if I have found favour in thine eyes,tarry: forI have learned by experience that theLordhathblessedme for thysake. 28And he said, Appoint me thy wages, and I will giveit. 29And he said unto him, Thou knowest how I have served thee, and how thy cattle was with me. 30Forit waslittle which thou hadst before Icame,and it isnowincreased unto a multitude; and theLordhath blessed thee since my coming: and now when shall I provide for mine own house also? 31And he said, What shall I give thee? And Jacob said, Thou shalt not give me any thing: if thou wilt do this thing for me, I will again feedandkeep thy flock: 32I will pass through all thy flock to day, removing from thence all the speckled and spottedcattle, and all the brown cattle among the sheep, and the spotted and speckled among the goats: andof suchshall be my hire. 33So shall myrighteousnessanswer for me in time to come, when it shall come for my hire before thy face: every one thatisnot speckled and spotted among the goats, and brown among the sheep, that shall be counted stolen with me. 34And Laban said, Behold, I would it might be according to thy word. 35And he removed that day the he goats that were ringstraked and spotted, and all the she goats that were speckled and spotted,andevery one that hadsomewhite in it, and all the brown among the sheep, and gavetheminto the hand of his sons. 36And he set three daysâ journey betwixt himself and Jacob: and Jacob fed the rest of Labanâs flocks. 37Â¶And Jacob took him rods of green poplar, and of thehazelandchestnut tree; andpilledwhite strakes in them, and made the white appear whichwasin the rods. 38And he set the rods which he had pilled before the flocks in the gutters in the watering troughs when the flocks came to drink, that they should conceive when they came to drink. 39And the flocks conceived before therods, and brought forth cattle ringstraked, speckled, and spotted. 40And Jacob did separate the lambs, and set the faces of the flocks toward the ringstraked, and all the brown in the flock of Laban; and he put his own flocks by themselves, and put them not unto Labanâs cattle. 41And it came to pass, whensoever the stronger cattle did conceive, that Jacob laid the rods before the eyes of the cattle in the gutters, that they might conceive among the rods. 42But when the cattle were feeble, he putthemnot in: so the feebler were Labanâs, and the stronger Jacobâs. 43And the manincreasedexceedingly, and had much cattle, and maidservants, and menservants, and camels, and asses."
    },
    {
      "reference": "Genesis 31",
      "title": "Genesis 31",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/31?lang=eng",
      "summary": "The Lord commands Jacob to return to Canaan, and Jacob departs secretlyâLaban pursues him; they resolve their differences and make a covenant of peaceâLaban blesses his descendants, and he and Jacob part company.",
      "verses": [
        "1And he heard the words of Labanâs sons, saying, Jacob hath taken away all thatwasour fatherâs; and ofthatwhichwasour fatherâs hath he gotten all thisglory.",
        "2And Jacob beheld the countenance of Laban, and, behold, itwasnot toward him as before.",
        "3And theLordsaid unto Jacob,Returnunto the land of thy fathers, and to thy kindred; andIwill be with thee.",
        "4AndJacobsent and called Rachel and Leah to the field unto his flock,",
        "5And said unto them, I see your fatherâs countenance, that itisnot toward me as before; but the God of my father hath been with me.",
        "6And ye know that with all my power I have served your father.",
        "7And your father hath deceived me, and changed my wages ten times; but God suffered him not to hurt me.",
        "8If he said thus, The speckled shall be thy wages; then all the cattle bare speckled: and if he said thus, The ringstraked shall be thy hire; then bare all the cattle ringstraked.",
        "9Thus God hath taken away the cattle of your father, and giventhemto me.",
        "10And it came to pass at the time that thecattleconceived, that I lifted up mine eyes, and saw in a dream, and, behold, the rams which leaped upon the cattlewereringstraked, speckled, and grisled.",
        "11And theangelof God spake unto me in a dream,saying,Jacob: And I said, HereamI.",
        "12And he said, Lift up now thine eyes, and see, all the rams which leap upon thecattleareringstraked, speckled, and grisled: for I have seen all that Laban doeth unto thee.",
        "13IamtheGodof Beth-el, where thou anointedst thepillar,andwhere thou vowedst avowunto me: now arise, get thee out from this land, and return unto the land of thy kindred.",
        "14And Rachel and Leah answered and said unto him,Is thereyet any portion orinheritancefor us in our fatherâs house?",
        "15Are we not counted of him strangers? for he hath sold us, and hath quite devoured also our money.",
        "16For all the riches which God hath taken from our father, thatisours, and our childrenâs: now then, whatsoever God hath said unto thee, do.",
        "17Â¶Then Jacob rose up, and set his sons and his wives upon camels;",
        "18And he carried away all his cattle, and all his goods which he had gotten, the cattle of his getting, which he had gotten in Padan-aram, for to go to Isaac his father in the land of Canaan.",
        "19And Laban went to shear his sheep: and Rachel had stolen theimagesthatwereher fatherâs.",
        "20And Jacob stole away unawares to Laban theSyrian, in that he told him not that he fled.",
        "21So he fled with all that he had; and he rose up, and passed over the river, and set his facetowardthe mount Gilead.",
        "22And it was told Laban on the third day that Jacob was fled.",
        "23And he took his brethren with him, and pursued after him seven daysâ journey; and they overtook him in the mount Gilead.",
        "24And God came to Laban the Syrian in adreamby night, and said unto him, Take heed that thouspeak notto Jacob either good or bad.",
        "25Â¶Then Laban overtook Jacob. Now Jacob had pitched his tent in the mount: and Laban with his brethren pitched in the mount of Gilead.",
        "26And Laban said to Jacob, What hast thou done, that thou hast stolen away unawares to me, and carried away my daughters, as captivestakenwith the sword?",
        "27Wherefore didst thou flee away secretly, and steal away from me; and didst not tell me, that I might have sent thee away with mirth, and with songs, with tabret, and withharp?",
        "28And hast not suffered me to kiss my sons and my daughters? thou hast now done foolishly insodoing.",
        "29It is in the power of my hand to do you hurt: but the God of your father spake unto me yesternight, saying, Take thou heed that thou speak not to Jacob either good or bad.",
        "30And now,thoughthou wouldest needs be gone, because thou sore longedst after thy fatherâs house,yetwherefore hast thou stolen my gods?",
        "31And Jacob answered and said to Laban, Because I was afraid: for I said, Peradventure thou wouldest take by force thy daughters from me.",
        "32With whomsoever thou findest thy gods, let him not live: before our brethren discern thou whatisthine with me, and takeitto thee. For Jacob knew not that Rachel had stolen them.",
        "33And Laban went into Jacobâs tent, and into Leahâs tent, and into the two maidservantsâ tents; but he foundthemnot. Then went he out of Leahâs tent, and entered into Rachelâs tent.",
        "34Now Rachel had taken the images, and put them in the camelâs furniture, and sat upon them. And Laban searched all the tent, but foundthemnot.",
        "35And she said to her father, Let it not displease my lord that I cannot rise up before thee; for the custom of womenisupon me. And he searched, but found not the images.",
        "36Â¶And Jacob was wroth, and chode with Laban: and Jacob answered and said to Laban, Whatismy trespass? whatismy sin, that thou hast so hotly pursued after me?",
        "37Whereas thou hast searched all my stuff, what hast thou found of all thy household stuff? setithere before my brethren and thy brethren, that they may judge betwixt us both.",
        "38This twenty yearshaveIbeenwith thee; thy ewes and thy she goats have not cast their young, and the rams of thy flock have I not eaten.",
        "39That which wastornof beastsI brought not unto thee; I bare the loss of it; of my hand didst thou require it,whetherstolen by day, or stolen by night.",
        "40ThusI was; in the day thedroughtconsumed me, and the frost by night; and my sleep departed from mine eyes.",
        "41Thus have I been twenty years in thy house; Iservedthee fourteen years for thy two daughters, and six years for thy cattle: and thou hast changed my wages ten times.",
        "42Except the God of my father, the God of Abraham, and the fear of Isaac, had been with me, surely thou hadst sent me away now empty. God hath seen mine affliction and thelabourof my hands, and rebukedtheeyesternight.",
        "43Â¶And Laban answered and said unto Jacob,Thesedaughtersaremy daughters, andthesechildrenaremy children, andthesecattlearemy cattle, and all that thou seestismine: and what can I do this day unto these my daughters, or unto their children which they have born?",
        "44Now therefore come thou, let us make a covenant, I and thou; and let it be for a witness between me and thee.",
        "45And Jacob took a stone, and set it upforapillar.",
        "46And Jacob said unto his brethren, Gather stones; and they took stones, and made an heap: and they did eat there upon the heap.",
        "47And Laban called itJegar-sahadutha: but Jacob called itGaleed.",
        "48And Laban said, This heapisa witness between me and thee this day. Therefore was the name of it called Galeed;",
        "49AndMizpah; for he said, TheLordwatchbetween me and thee, when we are absent one from another.",
        "50If thou shalt afflict my daughters, or if thou shalt takeotherwives beside my daughters, no maniswith us; see, Godiswitness betwixt me and thee."
      ],
      "full_text": "1And he heard the words of Labanâs sons, saying, Jacob hath taken away all thatwasour fatherâs; and ofthatwhichwasour fatherâs hath he gotten all thisglory. 2And Jacob beheld the countenance of Laban, and, behold, itwasnot toward him as before. 3And theLordsaid unto Jacob,Returnunto the land of thy fathers, and to thy kindred; andIwill be with thee. 4AndJacobsent and called Rachel and Leah to the field unto his flock, 5And said unto them, I see your fatherâs countenance, that itisnot toward me as before; but the God of my father hath been with me. 6And ye know that with all my power I have served your father. 7And your father hath deceived me, and changed my wages ten times; but God suffered him not to hurt me. 8If he said thus, The speckled shall be thy wages; then all the cattle bare speckled: and if he said thus, The ringstraked shall be thy hire; then bare all the cattle ringstraked. 9Thus God hath taken away the cattle of your father, and giventhemto me. 10And it came to pass at the time that thecattleconceived, that I lifted up mine eyes, and saw in a dream, and, behold, the rams which leaped upon the cattlewereringstraked, speckled, and grisled. 11And theangelof God spake unto me in a dream,saying,Jacob: And I said, HereamI. 12And he said, Lift up now thine eyes, and see, all the rams which leap upon thecattleareringstraked, speckled, and grisled: for I have seen all that Laban doeth unto thee. 13IamtheGodof Beth-el, where thou anointedst thepillar,andwhere thou vowedst avowunto me: now arise, get thee out from this land, and return unto the land of thy kindred. 14And Rachel and Leah answered and said unto him,Is thereyet any portion orinheritancefor us in our fatherâs house? 15Are we not counted of him strangers? for he hath sold us, and hath quite devoured also our money. 16For all the riches which God hath taken from our father, thatisours, and our childrenâs: now then, whatsoever God hath said unto thee, do. 17Â¶Then Jacob rose up, and set his sons and his wives upon camels; 18And he carried away all his cattle, and all his goods which he had gotten, the cattle of his getting, which he had gotten in Padan-aram, for to go to Isaac his father in the land of Canaan. 19And Laban went to shear his sheep: and Rachel had stolen theimagesthatwereher fatherâs. 20And Jacob stole away unawares to Laban theSyrian, in that he told him not that he fled. 21So he fled with all that he had; and he rose up, and passed over the river, and set his facetowardthe mount Gilead. 22And it was told Laban on the third day that Jacob was fled. 23And he took his brethren with him, and pursued after him seven daysâ journey; and they overtook him in the mount Gilead. 24And God came to Laban the Syrian in adreamby night, and said unto him, Take heed that thouspeak notto Jacob either good or bad. 25Â¶Then Laban overtook Jacob. Now Jacob had pitched his tent in the mount: and Laban with his brethren pitched in the mount of Gilead. 26And Laban said to Jacob, What hast thou done, that thou hast stolen away unawares to me, and carried away my daughters, as captivestakenwith the sword? 27Wherefore didst thou flee away secretly, and steal away from me; and didst not tell me, that I might have sent thee away with mirth, and with songs, with tabret, and withharp? 28And hast not suffered me to kiss my sons and my daughters? thou hast now done foolishly insodoing. 29It is in the power of my hand to do you hurt: but the God of your father spake unto me yesternight, saying, Take thou heed that thou speak not to Jacob either good or bad. 30And now,thoughthou wouldest needs be gone, because thou sore longedst after thy fatherâs house,yetwherefore hast thou stolen my gods? 31And Jacob answered and said to Laban, Because I was afraid: for I said, Peradventure thou wouldest take by force thy daughters from me. 32With whomsoever thou findest thy gods, let him not live: before our brethren discern thou whatisthine with me, and takeitto thee. For Jacob knew not that Rachel had stolen them. 33And Laban went into Jacobâs tent, and into Leahâs tent, and into the two maidservantsâ tents; but he foundthemnot. Then went he out of Leahâs tent, and entered into Rachelâs tent. 34Now Rachel had taken the images, and put them in the camelâs furniture, and sat upon them. And Laban searched all the tent, but foundthemnot. 35And she said to her father, Let it not displease my lord that I cannot rise up before thee; for the custom of womenisupon me. And he searched, but found not the images. 36Â¶And Jacob was wroth, and chode with Laban: and Jacob answered and said to Laban, Whatismy trespass? whatismy sin, that thou hast so hotly pursued after me? 37Whereas thou hast searched all my stuff, what hast thou found of all thy household stuff? setithere before my brethren and thy brethren, that they may judge betwixt us both. 38This twenty yearshaveIbeenwith thee; thy ewes and thy she goats have not cast their young, and the rams of thy flock have I not eaten. 39That which wastornof beastsI brought not unto thee; I bare the loss of it; of my hand didst thou require it,whetherstolen by day, or stolen by night. 40ThusI was; in the day thedroughtconsumed me, and the frost by night; and my sleep departed from mine eyes. 41Thus have I been twenty years in thy house; Iservedthee fourteen years for thy two daughters, and six years for thy cattle: and thou hast changed my wages ten times. 42Except the God of my father, the God of Abraham, and the fear of Isaac, had been with me, surely thou hadst sent me away now empty. God hath seen mine affliction and thelabourof my hands, and rebukedtheeyesternight. 43Â¶And Laban answered and said unto Jacob,Thesedaughtersaremy daughters, andthesechildrenaremy children, andthesecattlearemy cattle, and all that thou seestismine: and what can I do this day unto these my daughters, or unto their children which they have born? 44Now therefore come thou, let us make a covenant, I and thou; and let it be for a witness between me and thee. 45And Jacob took a stone, and set it upforapillar. 46And Jacob said unto his brethren, Gather stones; and they took stones, and made an heap: and they did eat there upon the heap. 47And Laban called itJegar-sahadutha: but Jacob called itGaleed. 48And Laban said, This heapisa witness between me and thee this day. Therefore was the name of it called Galeed; 49AndMizpah; for he said, TheLordwatchbetween me and thee, when we are absent one from another. 50If thou shalt afflict my daughters, or if thou shalt takeotherwives beside my daughters, no maniswith us; see, Godiswitness betwixt me and thee. 51And Laban said to Jacob, Behold this heap, and beholdthispillar, which I have cast betwixt me and thee; 52This heapbewitness, andthispillarbewitness, that I will not pass over this heap to thee, and that thou shalt not pass over this heap and this pillar unto me, for harm. 53The God of Abraham, and the God of Nahor, the God of their father, judge betwixt us. And Jacob sware by the fear of his father Isaac. 54Then Jacob offered sacrifice upon the mount, and called his brethren to eat bread: and they did eatbread, and tarried all night in the mount. 55And early in the morning Laban rose up, and kissed his sons and his daughters, and blessed them: and Laban departed, and returned unto his place."
    },
    {
      "reference": "Genesis 32",
      "title": "Genesis 32",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/32?lang=eng",
      "summary": "Jacob sees angelsâHe asks God to preserve him from Esau, for whom he prepares presentsâHe wrestles all night with a messenger of GodâJacobâs name is changed to IsraelâHe sees God face to face.",
      "verses": [
        "1And Jacob went on his way, and the angels of God met him.",
        "2And when Jacob saw them, he said, ThisisGodâshost: and he called the name of that placeMahanaim.",
        "3And Jacob sent messengers before him to Esau his brother unto the land ofSeir, the country ofEdom.",
        "4And he commanded them,saying, Thus shall ye speak unto my lord Esau; Thy servant Jacob saith thus, I have sojourned with Laban, and stayed there until now:",
        "5And I have oxen, and asses, flocks, and menservants, and womenservants: and I have sent to tell my lord, that I may find grace in thy sight.",
        "6Â¶And the messengers returned to Jacob, saying, We came to thy brother Esau, and also he cometh to meet thee, and four hundred men with him.",
        "7Then Jacob was greatly afraid anddistressed: and he divided the people thatwaswith him, and the flocks, and herds, and the camels, into two bands;",
        "8And said, If Esau come to the one company, and smite it, then the other company which is left shall escape.",
        "9Â¶And Jacob said, OGodof my father Abraham, and God of my father Isaac, theLordwhich saidst unto me,Returnunto thy country, and to thy kindred, and I will deal well with thee:",
        "10Iam not worthy of the least of all themercies, and of all the truth, which thou hast shewed unto thy servant; for with my staff I passed over this Jordan; and now I am become two bands.",
        "11Deliverme, I pray thee, from the hand of my brother, from the hand of Esau: for I fear him, lest he will come and smite me,andthe mother with the children.",
        "12And thou saidst, I will surely do thee good, and make thyseedas thesandof the sea, which cannot be numbered for multitude.",
        "13Â¶And he lodged there that same night; and took of that which came to his hand a present for Esau his brother;",
        "14Two hundred she goats, and twenty he goats, two hundred ewes, and twenty rams,",
        "15Thirty milch camels with their colts, forty kine, and ten bulls, twenty she asses, and ten foals.",
        "16And he deliveredtheminto the hand of his servants, every drove by themselves; and said unto his servants, Pass over before me, and put a space betwixt drove and drove.",
        "17And he commanded the foremost, saying, When Esau my brother meeteth thee, and asketh thee, saying, Whoseartthou? and whither goest thou? and whosearethese before thee?",
        "18Then thou shalt say,They bethy servant Jacobâs; itisa present sent unto my lord Esau: and, behold, also heisbehind us.",
        "19And so commanded he the second, and the third, and all that followed the droves, saying, On this manner shall ye speak unto Esau, when ye find him.",
        "20And say ye moreover, Behold, thy servant Jacobisbehind us. For he said, I will appease him with the present that goeth before me, and afterward I will see his face; peradventure he will accept of me.",
        "21So went the present over before him: and himself lodged that night in the company.",
        "22And he rose up that night, and took his two wives, and his two womenservants, and his eleven sons, and passed over the ford Jabbok.",
        "23And he took them, and sent them over the brook, and sent over that he had.",
        "24Â¶And Jacob was left alone; and therewrestleda man with him until the breaking of the day.",
        "25And when he saw that he prevailed not against him, he touched the hollow of his thigh; and thehollow of Jacobâs thigh was out of joint, as he wrestled with him.",
        "26And he said, Let me go, for the day breaketh. And he said, I will not let thee go, except thou bless me.",
        "27And he said unto him, Whatisthy name? And he said, Jacob.",
        "28And he said, Thynameshall be called no more Jacob, butIsrael:foras aprincehast thoupowerwith God and with men, and hastprevailed.",
        "29And Jacob askedhim,and said, Tellme,I pray thee, thy name. And he said, Whereforeisitthatthou dost ask after myname? And heblessedhim there.",
        "30And Jacob called the name of the placePeniel: for I haveseenGodface to face, and my life is preserved.",
        "31And as he passed overPenuelthe sun rose upon him, and he halted upon his thigh.",
        "32Therefore the children of Israel eat notofthe sinew which shrank, whichisupon the hollow of the thigh, unto this day: because he touched the hollow of Jacobâs thigh in the sinew that shrank."
      ],
      "full_text": "1And Jacob went on his way, and the angels of God met him. 2And when Jacob saw them, he said, ThisisGodâshost: and he called the name of that placeMahanaim. 3And Jacob sent messengers before him to Esau his brother unto the land ofSeir, the country ofEdom. 4And he commanded them,saying, Thus shall ye speak unto my lord Esau; Thy servant Jacob saith thus, I have sojourned with Laban, and stayed there until now: 5And I have oxen, and asses, flocks, and menservants, and womenservants: and I have sent to tell my lord, that I may find grace in thy sight. 6Â¶And the messengers returned to Jacob, saying, We came to thy brother Esau, and also he cometh to meet thee, and four hundred men with him. 7Then Jacob was greatly afraid anddistressed: and he divided the people thatwaswith him, and the flocks, and herds, and the camels, into two bands; 8And said, If Esau come to the one company, and smite it, then the other company which is left shall escape. 9Â¶And Jacob said, OGodof my father Abraham, and God of my father Isaac, theLordwhich saidst unto me,Returnunto thy country, and to thy kindred, and I will deal well with thee: 10Iam not worthy of the least of all themercies, and of all the truth, which thou hast shewed unto thy servant; for with my staff I passed over this Jordan; and now I am become two bands. 11Deliverme, I pray thee, from the hand of my brother, from the hand of Esau: for I fear him, lest he will come and smite me,andthe mother with the children. 12And thou saidst, I will surely do thee good, and make thyseedas thesandof the sea, which cannot be numbered for multitude. 13Â¶And he lodged there that same night; and took of that which came to his hand a present for Esau his brother; 14Two hundred she goats, and twenty he goats, two hundred ewes, and twenty rams, 15Thirty milch camels with their colts, forty kine, and ten bulls, twenty she asses, and ten foals. 16And he deliveredtheminto the hand of his servants, every drove by themselves; and said unto his servants, Pass over before me, and put a space betwixt drove and drove. 17And he commanded the foremost, saying, When Esau my brother meeteth thee, and asketh thee, saying, Whoseartthou? and whither goest thou? and whosearethese before thee? 18Then thou shalt say,They bethy servant Jacobâs; itisa present sent unto my lord Esau: and, behold, also heisbehind us. 19And so commanded he the second, and the third, and all that followed the droves, saying, On this manner shall ye speak unto Esau, when ye find him. 20And say ye moreover, Behold, thy servant Jacobisbehind us. For he said, I will appease him with the present that goeth before me, and afterward I will see his face; peradventure he will accept of me. 21So went the present over before him: and himself lodged that night in the company. 22And he rose up that night, and took his two wives, and his two womenservants, and his eleven sons, and passed over the ford Jabbok. 23And he took them, and sent them over the brook, and sent over that he had. 24Â¶And Jacob was left alone; and therewrestleda man with him until the breaking of the day. 25And when he saw that he prevailed not against him, he touched the hollow of his thigh; and thehollow of Jacobâs thigh was out of joint, as he wrestled with him. 26And he said, Let me go, for the day breaketh. And he said, I will not let thee go, except thou bless me. 27And he said unto him, Whatisthy name? And he said, Jacob. 28And he said, Thynameshall be called no more Jacob, butIsrael:foras aprincehast thoupowerwith God and with men, and hastprevailed. 29And Jacob askedhim,and said, Tellme,I pray thee, thy name. And he said, Whereforeisitthatthou dost ask after myname? And heblessedhim there. 30And Jacob called the name of the placePeniel: for I haveseenGodface to face, and my life is preserved. 31And as he passed overPenuelthe sun rose upon him, and he halted upon his thigh. 32Therefore the children of Israel eat notofthe sinew which shrank, whichisupon the hollow of the thigh, unto this day: because he touched the hollow of Jacobâs thigh in the sinew that shrank."
    },
    {
      "reference": "Genesis 33",
      "title": "Genesis 33",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/33?lang=eng",
      "summary": "Jacob and Esau meet and are reconciledâEsau receives Jacobâs presentsâJacob settles in Canaan, where he builds an altar.",
      "verses": [
        "1And Jacob lifted up his eyes, and looked, and, behold, Esau came, and with him four hundred men. And he divided the children unto Leah, and unto Rachel, and unto the two handmaids.",
        "2And he put the handmaids and their children foremost, and Leah and her children after, and Rachel and Joseph hindermost.",
        "3And he passed over before them, andbowedhimself to the ground seven times, until he came near to his brother.",
        "4And Esau ran to meet him, and embraced him, and fell on his neck, and kissed him: and they wept.",
        "5And he lifted up his eyes, and saw the women and the children; and said, Whoarethose with thee? And he said, The children which God hath graciously given thy servant.",
        "6Then the handmaidens came near, they and their children, and they bowed themselves.",
        "7And Leah also with her children came near, and bowed themselves: and after came Joseph near and Rachel, and they bowed themselves.",
        "8And he said, Whatmeanestthou by all this drove which I met? And he said,These areto find grace in the sight of my lord.",
        "9And Esau said, I have enough, my brother; keep that thou hast unto thyself.",
        "10And Jacob said, Nay, I pray thee, if now I have found grace in thy sight, then receive my present at my hand: for therefore I have seen thy face, as though I had seen the face of God, and thou wast pleased with me.",
        "11Take, I pray thee, my blessing that is brought to thee; because God hath dealt graciously with me, and because I have enough. And he urged him, and he tookit.",
        "12And he said, Let us take our journey, and let us go, and I will go before thee.",
        "13And he said unto him, My lord knoweth that the childrenaretender, and the flocks and herds with youngarewith me: and if men shouldoverdrive them one day, all the flock will die.",
        "14Let my lord, I pray thee, pass over before his servant: and I will lead on softly, according as the cattle that goeth before me and the children be able to endure, until I come unto my lord unto Seir.",
        "15And Esau said, Let me now leave with theesomeof the folk thatarewith me. And he said, What needeth it? let me find grace in the sight of my lord.",
        "16Â¶So Esau returned that day on his way unto Seir.",
        "17And Jacob journeyed toSuccoth, and built him an house, and made booths for his cattle: therefore the name of the place is calledSuccoth.",
        "18Â¶And Jacob came to Shalem, a city of Shechem, whichisin the land of Canaan, when he came from Padan-aram; and pitched his tent before the city.",
        "19And he bought a parcel of a field, where he had spread his tent, at the hand of the children of Hamor, Shechemâs father, for an hundred pieces of money.",
        "20And he erected there an altar, and called itEl-elohe-Israel."
      ],
      "full_text": "1And Jacob lifted up his eyes, and looked, and, behold, Esau came, and with him four hundred men. And he divided the children unto Leah, and unto Rachel, and unto the two handmaids. 2And he put the handmaids and their children foremost, and Leah and her children after, and Rachel and Joseph hindermost. 3And he passed over before them, andbowedhimself to the ground seven times, until he came near to his brother. 4And Esau ran to meet him, and embraced him, and fell on his neck, and kissed him: and they wept. 5And he lifted up his eyes, and saw the women and the children; and said, Whoarethose with thee? And he said, The children which God hath graciously given thy servant. 6Then the handmaidens came near, they and their children, and they bowed themselves. 7And Leah also with her children came near, and bowed themselves: and after came Joseph near and Rachel, and they bowed themselves. 8And he said, Whatmeanestthou by all this drove which I met? And he said,These areto find grace in the sight of my lord. 9And Esau said, I have enough, my brother; keep that thou hast unto thyself. 10And Jacob said, Nay, I pray thee, if now I have found grace in thy sight, then receive my present at my hand: for therefore I have seen thy face, as though I had seen the face of God, and thou wast pleased with me. 11Take, I pray thee, my blessing that is brought to thee; because God hath dealt graciously with me, and because I have enough. And he urged him, and he tookit. 12And he said, Let us take our journey, and let us go, and I will go before thee. 13And he said unto him, My lord knoweth that the childrenaretender, and the flocks and herds with youngarewith me: and if men shouldoverdrive them one day, all the flock will die. 14Let my lord, I pray thee, pass over before his servant: and I will lead on softly, according as the cattle that goeth before me and the children be able to endure, until I come unto my lord unto Seir. 15And Esau said, Let me now leave with theesomeof the folk thatarewith me. And he said, What needeth it? let me find grace in the sight of my lord. 16Â¶So Esau returned that day on his way unto Seir. 17And Jacob journeyed toSuccoth, and built him an house, and made booths for his cattle: therefore the name of the place is calledSuccoth. 18Â¶And Jacob came to Shalem, a city of Shechem, whichisin the land of Canaan, when he came from Padan-aram; and pitched his tent before the city. 19And he bought a parcel of a field, where he had spread his tent, at the hand of the children of Hamor, Shechemâs father, for an hundred pieces of money. 20And he erected there an altar, and called itEl-elohe-Israel."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:27:29",
  "metadata": {
    "week_number": 10,
    "title": "Week 10: March 2–8 - Genesis 24–33",
    "date_range": "March 2–8",
    "scraped_at": "2025-12-21T22:27:36.845061",
    "scraper_version": "2.0.0"
  }
}