{
  "week_number": 48,
  "date_range": "November 23–29",
  "title": "Week 48: November 23–29 - Amos; Obadiah; Jonah",
  "bundle_title": "Week 48: November 23–29: \"Week 48: November 23–29 - Amos; Obadiah; Jonah\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/48?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/48?lang=eng",
    "title": "Amos;Obadiah;Jonah",
    "scripture_references": "Amos; Obadiah; Jonah",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“November 23–29. ‘Seek the Lord, and Ye Shall Live’: Amos; Obadiah; Jonah,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“November 23–29. ‘Seek the Lord, and Ye Shall Live,’”Come, Follow Me: Old Testament 2026\n\nJonah was on a ship headed for Tarshish. There’s nothing wrong with sailing to Tarshish, except that it is far away from Nineveh, where Jonah was supposed to go to deliver God’s message. When the ship encountered a great storm, Jonah knew it was because of his disobedience. At Jonah’s insistence, his fellow mariners cast him into the depths of the sea to stop the storm. It looked like the end of Jonah and his ministry. But the Lord hadn’t given up on Jonah—just as He hadn’t given up on the people of Nineveh, on the house of Israel, or on any of us.\n\nSo He keeps sending prophets—like Jonah, Amos, Obadiah, and our prophets today—with the message that if we repent, we will not be cast off forever. Of all the “secrets” God reveals (seeAmos 3:7), this one is among the most precious: that because of Jesus Christ, it’s not too late to change. He still wants to help us live up to the covenants we made with Him, and He’s willing to offer us another chance.\n\nFor more about these books, see “Amos,” “Obadiah,” and “Jonah” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "The Lord reveals truth through His prophets.",
        "content": "InAmos 3:3–6, the prophet Amos presented examples of conclusions we can draw from signs we hear or see: when a lion roars, it must have captured prey; if a bird is caught in a trap, there must have been bait there. Inverses 7–8, Amos applied this logic to prophets. What conclusions can we draw when a prophet prophesies? What else do you learn about prophets fromAmos 7:10–15?\n\nWhat has the Lord revealed to you through His prophets?\n\nElder Ulisses Soares said that “having prophets is a sign of God’s love” (“Prophets Speak by the Power of the Holy Spirit,”EnsignorLiahona, May 2018, 99). Consider how you would complete this sentence: “I know God loves me, because He sends prophets who …” Here are some scriptures that can help:Deuteronomy 18:18;Ezekiel 3:16–17;Ephesians 4:11–14;1 Nephi 22:2;Doctrine and Covenants 21:4–6;84:36–38;107:91–92.\n\nWhat would you say to someone who feels prophets are not needed today?\n\nSee also Topics and Questions, “Prophets,” Gospel Library.\n\nAmos 4–5"
      },
      {
        "title": "“Seek the Lord, and ye shall live.”",
        "content": "According toAmos 4:6–13, what had the Lord hoped would happen after the Israelites experienced trials? (see alsoHelaman 12:3). While your trials may not have been sent by God, how have they given you opportunities to turn to Him?\n\nAs you readAmos 5:4, 14–15, ponder how the Lord has been gracious to you. How has seeking Him brought you life?\n\nAmos 8:11–12"
      },
      {
        "title": "The word of the Lord can satisfy spiritual hunger and thirst.",
        "content": "As you readAmos 8:11–12, think about why famine is a good comparison for living without God’s word (see alsoJohn 6:26–35;2 Nephi 9:50–51;32:3;Enos 1:4–8). How do you know when you are spiritually hungry?\n\nThese verses could also apply to the Great Apostasy (see Topics and Questions, “Apostasy,” Gospel Library). How has that spiritual “famine” affected God’s children? How has the Restoration satisfied your spiritual hunger?\n\nSee also “The Great Apostasy” (video), Gospel Library.\n\nThe Great Apostasy\n\nObadiah 1:21"
      },
      {
        "title": "Who are the “saviours … on mount Zion”?",
        "content": "Referring toObadiah 1:21, President Gordon B. Hinckley explained that we become saviors on Mount Zion when we receive ordinances for the dead in the temple (see “Closing Remarks,”EnsignorLiahona, Nov. 2004, 105). How is doing that work similar—if only in a small way—to what the Savior did for us? How has doing this work helped you feel closer to the Savior?\n\nSee also “Holy Temples on Mount Zion,”Hymns, no. 289.\n\nJonah 1–4"
      },
      {
        "title": "The Lord is merciful to all who turn to Him.",
        "content": "Nineveh was an enemy of Israel known for its violence and cruelty. To Jonah, it seemed unrealistic that they were ready to repent. It might be interesting to compare Jonah’s attitude (seeJonah 1;3–4) to the feelings of Alma and the sons of Mosiah (seeMosiah 28:1–5;Alma 17:23–25). What do you learn fromJonah 3that inspires you to share the gospel even with people who may not seem ready to change?\n\nAs you read Jonah, look for examples of the Lord’s mercy. Why do you feel Jonah was “displeased” and “very angry” (Jonah 4:1) when the Lord extended mercy to the people of Nineveh? What do you feel the Lord was trying to teach him inchapter 4? Ponder how you have experienced His mercy in your life. What do you learn from Jonah that can help you be more merciful?"
      }
    ],
    "teaching_children": [
      {
        "title": "Prophets are messengers of Jesus Christ.",
        "content": "To help your children understandAmos 3:7, you could whisper a simple message to one of them and ask them to share the message with the other children. How is the messenger in this activity like a prophet? Why does the Lord give us prophets?\n\nTo learn more about what prophets do, you and your children could reviewrecent messages from the current President of the Church. You could also sing a song like “Follow the Prophet” (Children’s Songbook, 110–11). Share with each other why you choose to follow God’s prophet.\n\nHelp children memorize scriptures.Elder Richard G. Scott shared: “To memorize a scripture is to forge a new friendship. It is like discovering a new individual who can help in time of need, give inspiration and comfort, and be a source of motivation for needed change” (“The Power of Scripture,”Ensign, Nov. 2011, 6). To help your children memorize all or part ofAmos 3:7, you could write it down and repeat it together. Then you could erase or cover a few words at a time until your children can repeat the entire verse from memory.\n\nAmos 8:11–12"
      },
      {
        "title": "The Restoration of the gospel ended the famine of apostasy.",
        "content": "Invite your children to pretend to be hungry as you readAmos 8:11–12. What does it feel like when we are hungry for God’s word? Maybe your children could pretend to eat as you share with each other some of your favorite scriptures.\n\nYou could use Guide to the Scriptures, “Apostasy” (Gospel Library), or “After the New Testament” (inNew Testament Stories, 167–70) to help your children understand the “famine” that came from the Great Apostasy and how it ended with the Restoration. Share with each other reasons you are grateful that the Lord restored His gospel in our day.\n\nAfter the New Testament\n\nJonah 1–3"
      },
      {
        "title": "The Lord will help me obey Him, even when it’s hard.",
        "content": "To help your children learn the story of Jonah, you could review “Jonah the Prophet” inOld Testament Stories; see also this week’s activity page). You could then ask:\n\nWhat happened when Jonah didn’t obey the Lord? (seeJonah 1:4–17).\n\nWhat did Jonah do to repent? (seeJonah 1:10–12;2:1–4, 9;3:1–4).\n\nWhat happened when Jonah did obey? (seeJonah 3:5).\n\nJonah the Prophet\n\nYour children might enjoy retelling the story of Jonah or acting it out. Share with each other some experiences when the Lord wanted you to do something that was hard for you. How did He help you obey Him?\n\nJonah 1–4"
      },
      {
        "title": "The Lord is merciful to all who turn to Him.",
        "content": "Maybe your children could pretend they are interviewing Jonah about his experience. What questions would they ask him? Encourage them to ask questions to find out what Jonah learned about the Lord. What might Jonah say, for example, about the Lord’s mercy? (see, for example,Jonah 2:7–10;3:10;4:2).\n\nChrist and the Palsied Man, by J. Kirk Richards\n\nHelp your children think of examples when the Savior showed mercy to others, such asMark 2:3–12;Luke 23:33–34; andJohn 8:1–11. You and your children could search for pictures of these examples. What opportunities do we have to be merciful to others?\n\nFor more, see this month’s issue of theFriendmagazine.\n\nJonah and the Whale, by Kevin Carden"
      }
    ],
    "study_helps": [],
    "raw_text": "November 23–29. “Seek the Lord, and Ye Shall Live”: Amos; Obadiah; Jonah\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nOctober 26–November 1\nJeremiah 31–33; 36–38; Lamentations 1; 3\nNovember 2–8\nEzekiel 1–3; 33–34; 36–37; 47\nNovember 9–15\nDaniel 1–7\nNovember 16–22\nHosea 1–6; 10–14; Joel\nNovember 23–29\nAmos; Obadiah; Jonah\nDecember\nAppendixes\nNovember 23–29. “Seek the Lord, and Ye Shall Live”: Amos; Obadiah; Jonah\n“November 23–29. ‘Seek the Lord, and Ye Shall Live’: Amos; Obadiah; Jonah,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“November 23–29. ‘Seek the Lord, and Ye Shall Live,’”\nCome, Follow Me: Old Testament 2026\nJonah on the Beach at Nineveh\n, by Daniel Lewis\nNovember 23–29: “Seek the Lord, and Ye Shall Live”\nAmos\n;\nObadiah\n;\nJonah\nJonah was on a ship headed for Tarshish. There’s nothing wrong with sailing to Tarshish, except that it is far away from Nineveh, where Jonah was supposed to go to deliver God’s message. When the ship encountered a great storm, Jonah knew it was because of his disobedience. At Jonah’s insistence, his fellow mariners cast him into the depths of the sea to stop the storm. It looked like the end of Jonah and his ministry. But the Lord hadn’t given up on Jonah—just as He hadn’t given up on the people of Nineveh, on the house of Israel, or on any of us.\nSo He keeps sending prophets—like Jonah, Amos, Obadiah, and our prophets today—with the message that if we repent, we will not be cast off forever. Of all the “secrets” God reveals (see\nAmos 3:7\n), this one is among the most precious: that because of Jesus Christ, it’s not too late to change. He still wants to help us live up to the covenants we made with Him, and He’s willing to offer us another chance.\nFor more about these books, see “\nAmos\n,” “\nObadiah\n,” and “\nJonah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nAmos 3:1–8\n;\n7:10–15\nThe Lord reveals truth through His prophets.\nIn\nAmos 3:3–6\n, the prophet Amos presented examples of conclusions we can draw from signs we hear or see: when a lion roars, it must have captured prey; if a bird is caught in a trap, there must have been bait there. In\nverses 7–8\n, Amos applied this logic to prophets. What conclusions can we draw when a prophet prophesies? What else do you learn about prophets from\nAmos 7:10–15\n?\nWhat has the Lord revealed to you through His prophets?\nElder Ulisses Soares said that “having prophets is a sign of God’s love” (“\nProphets Speak by the Power of the Holy Spirit\n,”\nEnsign\nor\nLiahona\n, May 2018, 99). Consider how you would complete this sentence: “I know God loves me, because He sends prophets who …” Here are some scriptures that can help:\nDeuteronomy 18:18\n;\nEzekiel 3:16–17\n;\nEphesians 4:11–14\n;\n1 Nephi 22:2\n;\nDoctrine and Covenants 21:4–6\n;\n84:36–38\n;\n107:91–92\n.\nWhat would you say to someone who feels prophets are not needed today?\nSee also Topics and Questions, “\nProphets,\n” Gospel Library.\nAmos 4–5\n“Seek the Lord, and ye shall live.”\nAccording to\nAmos 4:6–13\n, what had the Lord hoped would happen after the Israelites experienced trials? (see also\nHelaman 12:3\n). While your trials may not have been sent by God, how have they given you opportunities to turn to Him?\nAs you read\nAmos 5:4, 14–15\n, ponder how the Lord has been gracious to you. How has seeking Him brought you life?\nAmos 8:11–12\nThe word of the Lord can satisfy spiritual hunger and thirst.\nAs you read\nAmos 8:11–12\n, think about why famine is a good comparison for living without God’s word (see also\nJohn 6:26–35\n;\n2 Nephi 9:50–51\n;\n32:3\n;\nEnos 1:4–8\n). How do you know when you are spiritually hungry?\nThese verses could also apply to the Great Apostasy (see Topics and Questions, “\nApostasy\n,” Gospel Library). How has that spiritual “famine” affected God’s children? How has the Restoration satisfied your spiritual hunger?\nSee also “The Great Apostasy” (video), Gospel Library.\n16:36\nThe Great Apostasy\nObadiah 1:21\nWho are the “saviours … on mount Zion”?\nReferring to\nObadiah 1:21\n, President Gordon B. Hinckley explained that we become saviors on Mount Zion when we receive ordinances for the dead in the temple (see “\nClosing Remarks\n,”\nEnsign\nor\nLiahona\n, Nov. 2004, 105). How is doing that work similar—if only in a small way—to what the Savior did for us? How has doing this work helped you feel closer to the Savior?\nSee also “\nHoly Temples on Mount Zion\n,”\nHymns\n, no. 289.\nJonah 1–4\nThe Lord is merciful to all who turn to Him.\nNineveh was an enemy of Israel known for its violence and cruelty. To Jonah, it seemed unrealistic that they were ready to repent. It might be interesting to compare Jonah’s attitude (see\nJonah 1\n;\n3–4\n) to the feelings of Alma and the sons of Mosiah (see\nMosiah 28:1–5\n;\nAlma 17:23–25\n). What do you learn from\nJonah 3\nthat inspires you to share the gospel even with people who may not seem ready to change?\nAs you read Jonah, look for examples of the Lord’s mercy. Why do you feel Jonah was “displeased” and “very angry” (\nJonah 4:1\n) when the Lord extended mercy to the people of Nineveh? What do you feel the Lord was trying to teach him in\nchapter 4\n? Ponder how you have experienced His mercy in your life. What do you learn from Jonah that can help you be more merciful?\nIdeas for Teaching Children\nBecause this Sunday is the fifth Sunday of the month, Primary teachers are encouraged to use learning activities in “\nAppendix B: Preparing Children for a Lifetime on God’s Covenant Path\n.”\nAmos 3:7\nProphets are messengers of Jesus Christ.\nTo help your children understand\nAmos 3:7\n, you could whisper a simple message to one of them and ask them to share the message with the other children. How is the messenger in this activity like a prophet? Why does the Lord give us prophets?\nTo learn more about what prophets do, you and your children could review\nrecent messages from the current President of the Church\n. You could also sing a song like “\nFollow the Prophet\n” (\nChildren’s Songbook\n, 110–11). Share with each other why you choose to follow God’s prophet.\nHelp children memorize scriptures.\nElder Richard G. Scott shared: “To memorize a scripture is to forge a new friendship. It is like discovering a new individual who can help in time of need, give inspiration and comfort, and be a source of motivation for needed change” (“\nThe Power of Scripture\n,”\nEnsign\n, Nov. 2011, 6). To help your children memorize all or part of\nAmos 3:7\n, you could write it down and repeat it together. Then you could erase or cover a few words at a time until your children can repeat the entire verse from memory.\nAmos 8:11–12\nThe Restoration of the gospel ended the famine of apostasy.\nInvite your children to pretend to be hungry as you read\nAmos 8:11–12\n. What does it feel like when we are hungry for God’s word? Maybe your children could pretend to eat as you share with each other some of your favorite scriptures.\nYou could use Guide to the Scriptures, “\nApostasy\n” (Gospel Library), or “\nAfter the New Testament\n” (in\nNew Testament Stories\n, 167–70) to help your children understand the “famine” that came from the Great Apostasy and how it ended with the Restoration. Share with each other reasons you are grateful that the Lord restored His gospel in our day.\n2:52\nAfter the New Testament\nJonah 1–3\nThe Lord will help me obey Him, even when it’s hard.\nTo help your children learn the story of Jonah, you could review “\nJonah the Prophet\n” in\nOld Testament Stories\n; see also this week’s activity page). You could then ask:\nWhat happened when Jonah didn’t obey the Lord? (see\nJonah 1:4–17\n).\nWhat did Jonah do to repent? (see\nJonah 1:10–12\n;\n2:1–4, 9\n;\n3:1–4\n).\nWhat happened when Jonah did obey? (see\nJonah 3:5\n).\n2:30\nJonah the Prophet\nYour children might enjoy retelling the story of Jonah or acting it out. Share with each other some experiences when the Lord wanted you to do something that was hard for you. How did He help you obey Him?\nJonah 1–4\nThe Lord is merciful to all who turn to Him.\nMaybe your children could pretend they are interviewing Jonah about his experience. What questions would they ask him? Encourage them to ask questions to find out what Jonah learned about the Lord. What might Jonah say, for example, about the Lord’s mercy? (see, for example,\nJonah 2:7–10\n;\n3:10\n;\n4:2\n).\nChrist and the Palsied Man\n, by J. Kirk Richards\nHelp your children think of examples when the Savior showed mercy to others, such as\nMark 2:3–12\n;\nLuke 23:33–34\n; and\nJohn 8:1–11\n. You and your children could search for pictures of these examples. What opportunities do we have to be merciful to others?\nFor more, see this month’s issue of the\nFriend\nmagazine.\nJonah and the Whale\n, by Kevin Carden\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Amos 1",
      "title": "Amos",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/1?lang=eng",
      "summary": "Amos shows the Lordâs judgments upon Syria, the Philistines, Tyre, Edom, and Ammon.",
      "verses": [
        "1The words of Amos, who was among the herdmen of Tekoa, which he saw concerning Israel in the days ofUzziahking of Judah, and in the days ofJeroboamthe son of Joash king of Israel, two years before theearthquake.",
        "2And he said, TheLordwillroarfrom Zion, and utter his voice from Jerusalem; and thehabitationsof the shepherds shall mourn, and the top of Carmel shall wither.",
        "3Thus saith theLord; For three transgressions of Damascus, and for four, I will not turn awaythe punishmentthereof; because they havethreshedGilead with threshing instruments of iron:",
        "4But I will send a fire into the house ofHazael, which shall devour the palaces of Ben-hadad.",
        "5I will break also the bar of Damascus, and cut off the inhabitant from the plain of Aven, and him that holdeth the sceptre from the house of Eden: and the people of Syria shall go into captivity unto Kir, saith theLord.",
        "6Â¶Thus saith theLord; For three transgressions of Gaza, and for four, I will not turn awaythe punishmentthereof; because they carried away captive the whole captivity, to deliverthemup to Edom:",
        "7But I will send a fire on the wall of Gaza, which shall devour the palaces thereof:",
        "8And I will cut off the inhabitant fromAshdod, and him that holdeth the sceptre from Ashkelon, and I will turn mine hand against Ekron: and the remnant of thePhilistinesshall perish, saith the LordGod.",
        "9Â¶Thus saith theLord; For three transgressions ofTyrus, and for four, I will not turn awaythe punishmentthereof; because they delivered up the whole captivity to Edom, and remembered not thebrotherlycovenant:",
        "10But I will send a fire on the wall ofTyrus, which shall devour the palaces thereof.",
        "11Â¶Thus saith theLord; For three transgressions ofEdom, and for four, I will not turn awaythe punishmentthereof; because he did pursue his brother with the sword, and did cast off all pity, and his anger did tear perpetually, and he kept his wrath for ever:",
        "12But I will send a fire uponTeman, which shall devour the palaces of Bozrah.",
        "13Â¶Thus saith theLord; For three transgressions of the children of Ammon, and for four, I will not turn awaythe punishmentthereof; because they have ripped up the women with child of Gilead, that they might enlarge their border:",
        "14But I will kindle a fire in the wall ofRabbah, and it shall devour the palaces thereof, with shouting in the day of battle, with a tempest in the day of the whirlwind:",
        "15And their king shall go into captivity, he and his princes together, saith theLord."
      ],
      "full_text": "1The words of Amos, who was among the herdmen of Tekoa, which he saw concerning Israel in the days ofUzziahking of Judah, and in the days ofJeroboamthe son of Joash king of Israel, two years before theearthquake. 2And he said, TheLordwillroarfrom Zion, and utter his voice from Jerusalem; and thehabitationsof the shepherds shall mourn, and the top of Carmel shall wither. 3Thus saith theLord; For three transgressions of Damascus, and for four, I will not turn awaythe punishmentthereof; because they havethreshedGilead with threshing instruments of iron: 4But I will send a fire into the house ofHazael, which shall devour the palaces of Ben-hadad. 5I will break also the bar of Damascus, and cut off the inhabitant from the plain of Aven, and him that holdeth the sceptre from the house of Eden: and the people of Syria shall go into captivity unto Kir, saith theLord. 6Â¶Thus saith theLord; For three transgressions of Gaza, and for four, I will not turn awaythe punishmentthereof; because they carried away captive the whole captivity, to deliverthemup to Edom: 7But I will send a fire on the wall of Gaza, which shall devour the palaces thereof: 8And I will cut off the inhabitant fromAshdod, and him that holdeth the sceptre from Ashkelon, and I will turn mine hand against Ekron: and the remnant of thePhilistinesshall perish, saith the LordGod. 9Â¶Thus saith theLord; For three transgressions ofTyrus, and for four, I will not turn awaythe punishmentthereof; because they delivered up the whole captivity to Edom, and remembered not thebrotherlycovenant: 10But I will send a fire on the wall ofTyrus, which shall devour the palaces thereof. 11Â¶Thus saith theLord; For three transgressions ofEdom, and for four, I will not turn awaythe punishmentthereof; because he did pursue his brother with the sword, and did cast off all pity, and his anger did tear perpetually, and he kept his wrath for ever: 12But I will send a fire uponTeman, which shall devour the palaces of Bozrah. 13Â¶Thus saith theLord; For three transgressions of the children of Ammon, and for four, I will not turn awaythe punishmentthereof; because they have ripped up the women with child of Gilead, that they might enlarge their border: 14But I will kindle a fire in the wall ofRabbah, and it shall devour the palaces thereof, with shouting in the day of battle, with a tempest in the day of the whirlwind: 15And their king shall go into captivity, he and his princes together, saith theLord."
    },
    {
      "reference": "Amos 2",
      "title": "Amos 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/2?lang=eng",
      "summary": "The Lord will pour out judgments upon Moab, Judah, and Israel for their unrighteousness.",
      "verses": [
        "1Thus saith theLord; For three transgressions ofMoab, and for four, I will not turn awaythe punishmentthereof; because he burned the bones of the king of Edom into lime:",
        "2But I will send a fire upon Moab, and it shall devour the palaces of Kerioth: and Moab shall die with tumult, with shouting,andwith the sound of the trumpet:",
        "3And I will cut off the judge from the midst thereof, and will slay all the princes thereof with him, saith theLord.",
        "4Â¶Thus saith theLord; For three transgressions of Judah, and for four, I will not turn awaythe punishmentthereof; because they havedespisedthe law of theLord, and have not kept his commandments, and their lies caused them to err, after the which their fathers have walked:",
        "5But I will send a fire upon Judah, and it shall devour the palaces of Jerusalem.",
        "6Â¶Thus saith theLord; For three transgressions of Israel, and for four, I will not turn awaythe punishmentthereof; because theysoldthe righteous for silver, and the poor for a pair of shoes;",
        "7That pant after the dust of the earth on the head of the poor, and turn aside the way of the meek: anda man and his father will go in unto thesamemaid, toprofanemy holy name:",
        "8And they laythemselvesdown upon clothes laid to pledge by every altar, and they drink the wine of the condemnedinthe house of their god.",
        "9Â¶YetdestroyedI the Amorite before them, whose heightwaslike the height of the cedars, and hewasstrong as the oaks; yet I destroyed his fruit from above, and his roots from beneath.",
        "10Also Ibroughtyou up from the land of Egypt, and led youfortyyears through the wilderness, to possess the land of the Amorite.",
        "11And I raised up of your sons for prophets, and of your young men forNazarites.Is itnot even thus, O ye children of Israel? saith theLord.",
        "12But ye gave the Nazarites wine to drink; and commanded the prophets, saying, Prophesy not.",
        "13Behold, I am pressed under you, as a cart is pressedthat isfull of sheaves.",
        "14Therefore theflightshall perish from theswift, and the strong shall not strengthen his force, neither shall the mightydeliverhimself:",
        "15Neither shall he stand that handleth the bow; andhe that isswift of foot shall not deliverhimself:neither shall he that rideth the horsedeliverhimself.",
        "16Andhe that iscourageous among the mighty shall flee away naked in that day, saith theLord."
      ],
      "full_text": "1Thus saith theLord; For three transgressions ofMoab, and for four, I will not turn awaythe punishmentthereof; because he burned the bones of the king of Edom into lime: 2But I will send a fire upon Moab, and it shall devour the palaces of Kerioth: and Moab shall die with tumult, with shouting,andwith the sound of the trumpet: 3And I will cut off the judge from the midst thereof, and will slay all the princes thereof with him, saith theLord. 4Â¶Thus saith theLord; For three transgressions of Judah, and for four, I will not turn awaythe punishmentthereof; because they havedespisedthe law of theLord, and have not kept his commandments, and their lies caused them to err, after the which their fathers have walked: 5But I will send a fire upon Judah, and it shall devour the palaces of Jerusalem. 6Â¶Thus saith theLord; For three transgressions of Israel, and for four, I will not turn awaythe punishmentthereof; because theysoldthe righteous for silver, and the poor for a pair of shoes; 7That pant after the dust of the earth on the head of the poor, and turn aside the way of the meek: anda man and his father will go in unto thesamemaid, toprofanemy holy name: 8And they laythemselvesdown upon clothes laid to pledge by every altar, and they drink the wine of the condemnedinthe house of their god. 9Â¶YetdestroyedI the Amorite before them, whose heightwaslike the height of the cedars, and hewasstrong as the oaks; yet I destroyed his fruit from above, and his roots from beneath. 10Also Ibroughtyou up from the land of Egypt, and led youfortyyears through the wilderness, to possess the land of the Amorite. 11And I raised up of your sons for prophets, and of your young men forNazarites.Is itnot even thus, O ye children of Israel? saith theLord. 12But ye gave the Nazarites wine to drink; and commanded the prophets, saying, Prophesy not. 13Behold, I am pressed under you, as a cart is pressedthat isfull of sheaves. 14Therefore theflightshall perish from theswift, and the strong shall not strengthen his force, neither shall the mightydeliverhimself: 15Neither shall he stand that handleth the bow; andhe that isswift of foot shall not deliverhimself:neither shall he that rideth the horsedeliverhimself. 16Andhe that iscourageous among the mighty shall flee away naked in that day, saith theLord."
    },
    {
      "reference": "Amos 3",
      "title": "Amos 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/3?lang=eng",
      "summary": "The Lord reveals His secrets unto His servants the prophetsâBecause Israel rejects the prophets and follows evil, the nation is overwhelmed by an adversary.",
      "verses": [
        "1Hear this word that theLordhath spoken against you, O children of Israel, against the whole family which Ibrought upfrom the land of Egypt, saying,",
        "2Youonlyhave Iknownof all the families of the earth: therefore I willpunishyou for all your iniquities.",
        "3Can two walk together, except they beagreed?",
        "4Will a lion roar in the forest, when he hath no prey? will a young lion cry out of his den, if he have taken nothing?",
        "5Can a bird fall in a snare upon the earth, where noginisfor him? shallonetake up a snare from the earth, and have taken nothing at all?",
        "6Shall a trumpet be blown in the city, and the people not be afraid? shall there beevilin a city, and theLordhath notdoneit?",
        "7Surely the LordGodwill do nothing,butherevealethhissecretunto his servants theprophets.",
        "8The lion hath roared, who will not fear? the LordGodhath spoken, who can butprophesy?",
        "9Â¶Publish in the palaces atAshdod, and in the palaces in the land of Egypt, and say, Assemble yourselves upon the mountains of Samaria, and behold the great tumultsin the midst thereof, and the oppressed in the midst thereof.",
        "10For they know not to do right, saith theLord, who store upviolenceand robbery in their palaces.",
        "11Therefore thus saith the LordGod; An adversarythere shall beeven round about the land; and he shall bring down thy strength from thee, and thy palaces shall be spoiled.",
        "12Thus saith theLord; As the shepherd taketh out of the mouth of the lion two legs, or a piece of an ear; so shall the children of Israel be taken out that dwell in Samaria in the corner of a bed, and in Damascusina couch.",
        "13Hear ye, and testify in the house of Jacob, saith the LordGod, the God of hosts,",
        "14That in the day that I shall visit the transgressions of Israel upon him I will also visit the altars ofBeth-el: and the horns of the altar shall be cut off, andfallto the ground.",
        "15And I will smite thewinterhouse with the summer house; and the houses ofivoryshall perish, and the great houses shall have an end, saith theLord."
      ],
      "full_text": "1Hear this word that theLordhath spoken against you, O children of Israel, against the whole family which Ibrought upfrom the land of Egypt, saying, 2Youonlyhave Iknownof all the families of the earth: therefore I willpunishyou for all your iniquities. 3Can two walk together, except they beagreed? 4Will a lion roar in the forest, when he hath no prey? will a young lion cry out of his den, if he have taken nothing? 5Can a bird fall in a snare upon the earth, where noginisfor him? shallonetake up a snare from the earth, and have taken nothing at all? 6Shall a trumpet be blown in the city, and the people not be afraid? shall there beevilin a city, and theLordhath notdoneit? 7Surely the LordGodwill do nothing,butherevealethhissecretunto his servants theprophets. 8The lion hath roared, who will not fear? the LordGodhath spoken, who can butprophesy? 9Â¶Publish in the palaces atAshdod, and in the palaces in the land of Egypt, and say, Assemble yourselves upon the mountains of Samaria, and behold the great tumultsin the midst thereof, and the oppressed in the midst thereof. 10For they know not to do right, saith theLord, who store upviolenceand robbery in their palaces. 11Therefore thus saith the LordGod; An adversarythere shall beeven round about the land; and he shall bring down thy strength from thee, and thy palaces shall be spoiled. 12Thus saith theLord; As the shepherd taketh out of the mouth of the lion two legs, or a piece of an ear; so shall the children of Israel be taken out that dwell in Samaria in the corner of a bed, and in Damascusina couch. 13Hear ye, and testify in the house of Jacob, saith the LordGod, the God of hosts, 14That in the day that I shall visit the transgressions of Israel upon him I will also visit the altars ofBeth-el: and the horns of the altar shall be cut off, andfallto the ground. 15And I will smite thewinterhouse with the summer house; and the houses ofivoryshall perish, and the great houses shall have an end, saith theLord."
    },
    {
      "reference": "Amos 4",
      "title": "Amos 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/4?lang=eng",
      "summary": "The Lord withholds rain, sends famine and pestilence, and destroys gardens and vineyards as judgments upon His people, yet they do not return unto the Lord.",
      "verses": [
        "1Hear this word, yekineof Bashan, thatarein the mountain ofSamaria, which oppress thepoor, which crush the needy, which say to their masters, Bring, and let us drink.",
        "2The LordGodhath sworn by hisholiness, that, lo, the days shall come upon you, that he will take you away with hooks, and your posterity with fishhooks.",
        "3And ye shall go out at thebreaches, everycow at that which isbefore her; and ye shall casttheminto the palace, saith theLord.",
        "4Â¶Come to Beth-el, and transgress; atGilgalmultiply transgression; and bring your sacrifices every morning,andyourtithesafter threeyears:",
        "5And offer a sacrifice ofthanksgivingwithleaven, and proclaimandpublish thefreeofferings: for this liketh you, O ye children of Israel, saith the LordGod.",
        "6Â¶And I also have given youcleannessof teeth in all your cities, and want of bread in all your places: yet have ye notreturnedunto me, saith theLord.",
        "7And also I have withholden therainfrom you, whenthere wereyet three months to the harvest: and I caused it to rain upon one city, and caused it not to rain upon another city: one piece was rained upon, and the piece whereupon it rained not withered.",
        "8So twoorthree cities wandered unto one city, to drink water; but they were not satisfied: yet have ye not returned unto me, saith theLord.",
        "9I have smitten you with blasting and mildew: when your gardens and your vineyards and your fig trees and your olive trees increased, the palmerworm devouredthem:yet have ye not returned unto me, saith theLord.",
        "10I have sent among you the pestilence after the manner of Egypt: youryoungmen have I slain with the sword, and have taken away your horses; and I have made the stink of your camps to come up untoyour nostrils: yet have ye not returned unto me, saith theLord.",
        "11I have overthrownsomeof you, as GodoverthrewSodomand Gomorrah, and ye were as afirebrandplucked out of theburning: yet have ye not returned unto me, saith theLord.",
        "12Therefore thus will I do unto thee, O Israel:andbecause I will do this unto thee, prepare to meet thy God, O Israel.",
        "13For, lo, he thatformeththe mountains, and createth the wind, and declareth unto man whatishisthought, that maketh themorningdarkness, and treadeth upon the high places of the earth, TheLord, The God of hosts,ishis name."
      ],
      "full_text": "1Hear this word, yekineof Bashan, thatarein the mountain ofSamaria, which oppress thepoor, which crush the needy, which say to their masters, Bring, and let us drink. 2The LordGodhath sworn by hisholiness, that, lo, the days shall come upon you, that he will take you away with hooks, and your posterity with fishhooks. 3And ye shall go out at thebreaches, everycow at that which isbefore her; and ye shall casttheminto the palace, saith theLord. 4Â¶Come to Beth-el, and transgress; atGilgalmultiply transgression; and bring your sacrifices every morning,andyourtithesafter threeyears: 5And offer a sacrifice ofthanksgivingwithleaven, and proclaimandpublish thefreeofferings: for this liketh you, O ye children of Israel, saith the LordGod. 6Â¶And I also have given youcleannessof teeth in all your cities, and want of bread in all your places: yet have ye notreturnedunto me, saith theLord. 7And also I have withholden therainfrom you, whenthere wereyet three months to the harvest: and I caused it to rain upon one city, and caused it not to rain upon another city: one piece was rained upon, and the piece whereupon it rained not withered. 8So twoorthree cities wandered unto one city, to drink water; but they were not satisfied: yet have ye not returned unto me, saith theLord. 9I have smitten you with blasting and mildew: when your gardens and your vineyards and your fig trees and your olive trees increased, the palmerworm devouredthem:yet have ye not returned unto me, saith theLord. 10I have sent among you the pestilence after the manner of Egypt: youryoungmen have I slain with the sword, and have taken away your horses; and I have made the stink of your camps to come up untoyour nostrils: yet have ye not returned unto me, saith theLord. 11I have overthrownsomeof you, as GodoverthrewSodomand Gomorrah, and ye were as afirebrandplucked out of theburning: yet have ye not returned unto me, saith theLord. 12Therefore thus will I do unto thee, O Israel:andbecause I will do this unto thee, prepare to meet thy God, O Israel. 13For, lo, he thatformeththe mountains, and createth the wind, and declareth unto man whatishisthought, that maketh themorningdarkness, and treadeth upon the high places of the earth, TheLord, The God of hosts,ishis name."
    },
    {
      "reference": "Amos 5",
      "title": "Amos 5",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/5?lang=eng",
      "summary": "The people of Israel are exhorted to seek the Lord and do good so that they may liveâTheir sacrifices to false gods are abhorrent.",
      "verses": [
        "1Hear ye this word which I take up against you,evena lamentation, O house of Israel.",
        "2The virgin of Israel is fallen; she shall no more rise: she is forsaken upon her land;there isnone to raise her up.",
        "3For thus saith the LordGod; The city that went outbya thousand shall leave an hundred, and that which went forthbyan hundred shall leave ten, to the house of Israel.",
        "4Â¶For thus saith theLordunto the house of Israel,Seekye me, and ye shall live:",
        "5But seek not Beth-el, nor enter into Gilgal, and pass not to Beer-sheba: for Gilgal shall surely go into captivity, andBeth-elshall come to nought.",
        "6SeektheLord, and ye shall live; lest he break out like fire in the house of Joseph, and devourit,andthere benone to quenchitin Beth-el.",
        "7Ye who turn judgment to wormwood, and leave off righteousness in the earth,",
        "8Seek himthat makeththesevenstarsand Orion, and turneth the shadow of death into themorning, and maketh the daydarkwith night: that calleth for thewatersof the sea, and poureth them out upon the face of the earth:TheLordishis name:",
        "9That strengtheneth the spoiled against the strong, so that the spoiled shall come against the fortress.",
        "10They hate him that rebuketh in thegate, and they abhor him that speaketh uprightly.",
        "11Forasmuch therefore as your treadingisupon the poor, and ye take from him burdens of wheat: ye havebuilthouses of hewn stone, but ye shall notdwellin them; ye have planted pleasant vineyards, but ye shall not drink wine of them.",
        "12For I know your manifold transgressions and your mighty sins: they afflict the just, they take abribe, and theyturnaside thepoorin the gatefrom their right.",
        "13Therefore theprudentshall keepsilencein that time; for itisan evil time.",
        "14Seekgood, and notevil, that ye may live: and so theLord, the God of hosts, shall be with you, as ye have spoken.",
        "15Hate the evil, andlovethegood, and establish judgment in the gate: it may be that theLordGod of hosts will be gracious unto the remnant ofJoseph.",
        "16Therefore theLord, the God of hosts, the Lord, saith thus; Wailingshall bein all streets; and they shall say in all the highways, Alas! alas! and they shall call the husbandman to mourning, and such as are skilful of lamentation to wailing.",
        "17And in all vineyardsshall bewailing: for I will pass through thee, saith theLord.",
        "18Woe unto you thatdesirethedayof theLord! to what endisit for you? the day of theLordisdarkness, and not light.",
        "19As if a man did flee from a lion, and a bear met him; or went into the house, and leaned his hand on the wall, and a serpent bit him.",
        "20Shallnot the day of theLordbedarkness, and not light? even very dark, and no brightness in it?",
        "21Â¶I hate, I despise yourfeastdays, andIwill not smell in yoursolemn assemblies.",
        "22Though yeofferme burnt offerings and your meat offerings, I will notacceptthem:neither will I regard the peaceofferingsof your fat beasts.",
        "23Take thou away from me the noise of thy songs; for I will not hear the melody of thy viols.",
        "24But letjudgmentrun down as waters, andrighteousnessas a mighty stream.",
        "25Have ye offered unto me sacrifices and offerings in the wilderness forty years, O house of Israel?",
        "26But ye have borne the tabernacle of yourMolochand Chiun your images, the star of your god, which ye made to yourselves.",
        "27Therefore will I cause you to go into captivity beyond Damascus, saith theLord, whose nameisThe God of hosts."
      ],
      "full_text": "1Hear ye this word which I take up against you,evena lamentation, O house of Israel. 2The virgin of Israel is fallen; she shall no more rise: she is forsaken upon her land;there isnone to raise her up. 3For thus saith the LordGod; The city that went outbya thousand shall leave an hundred, and that which went forthbyan hundred shall leave ten, to the house of Israel. 4Â¶For thus saith theLordunto the house of Israel,Seekye me, and ye shall live: 5But seek not Beth-el, nor enter into Gilgal, and pass not to Beer-sheba: for Gilgal shall surely go into captivity, andBeth-elshall come to nought. 6SeektheLord, and ye shall live; lest he break out like fire in the house of Joseph, and devourit,andthere benone to quenchitin Beth-el. 7Ye who turn judgment to wormwood, and leave off righteousness in the earth, 8Seek himthat makeththesevenstarsand Orion, and turneth the shadow of death into themorning, and maketh the daydarkwith night: that calleth for thewatersof the sea, and poureth them out upon the face of the earth:TheLordishis name: 9That strengtheneth the spoiled against the strong, so that the spoiled shall come against the fortress. 10They hate him that rebuketh in thegate, and they abhor him that speaketh uprightly. 11Forasmuch therefore as your treadingisupon the poor, and ye take from him burdens of wheat: ye havebuilthouses of hewn stone, but ye shall notdwellin them; ye have planted pleasant vineyards, but ye shall not drink wine of them. 12For I know your manifold transgressions and your mighty sins: they afflict the just, they take abribe, and theyturnaside thepoorin the gatefrom their right. 13Therefore theprudentshall keepsilencein that time; for itisan evil time. 14Seekgood, and notevil, that ye may live: and so theLord, the God of hosts, shall be with you, as ye have spoken. 15Hate the evil, andlovethegood, and establish judgment in the gate: it may be that theLordGod of hosts will be gracious unto the remnant ofJoseph. 16Therefore theLord, the God of hosts, the Lord, saith thus; Wailingshall bein all streets; and they shall say in all the highways, Alas! alas! and they shall call the husbandman to mourning, and such as are skilful of lamentation to wailing. 17And in all vineyardsshall bewailing: for I will pass through thee, saith theLord. 18Woe unto you thatdesirethedayof theLord! to what endisit for you? the day of theLordisdarkness, and not light. 19As if a man did flee from a lion, and a bear met him; or went into the house, and leaned his hand on the wall, and a serpent bit him. 20Shallnot the day of theLordbedarkness, and not light? even very dark, and no brightness in it? 21Â¶I hate, I despise yourfeastdays, andIwill not smell in yoursolemn assemblies. 22Though yeofferme burnt offerings and your meat offerings, I will notacceptthem:neither will I regard the peaceofferingsof your fat beasts. 23Take thou away from me the noise of thy songs; for I will not hear the melody of thy viols. 24But letjudgmentrun down as waters, andrighteousnessas a mighty stream. 25Have ye offered unto me sacrifices and offerings in the wilderness forty years, O house of Israel? 26But ye have borne the tabernacle of yourMolochand Chiun your images, the star of your god, which ye made to yourselves. 27Therefore will I cause you to go into captivity beyond Damascus, saith theLord, whose nameisThe God of hosts."
    },
    {
      "reference": "Amos 6",
      "title": "Amos 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/6?lang=eng",
      "summary": "Woe to them who are at ease in ZionâIsrael will be plagued with desolation.",
      "verses": [
        "1Woe to themthat areateasein Zion, and trust in the mountain ofSamaria,which arenamed chief of the nations, to whom the house of Israel came!",
        "2Pass ye unto Calneh, and see; and from thence go ye to Hamath the great: then go down to Gath of the Philistines:be theybetter than these kingdoms? or their border greater than your border?",
        "3Ye that putfaraway the evil day, and cause the seat of violence to come near;",
        "4That lie upon beds of ivory, and stretch themselves upon their couches, and eat the lambs out of the flock, and the calves out of the midst of the stall;",
        "5That chant to the sound of the viol,andinvent to themselvesinstrumentsofmusick, like David;",
        "6That drink wine in bowls, and anoint themselves with the chief ointments: but they are not grieved for the affliction of Joseph.",
        "7Â¶Therefore now shall they gocaptivewith the first that go captive, and thebanquetof them that stretched themselves shall be removed.",
        "8The LordGodhathswornby himself, saith theLordthe God of hosts, I abhor theexcellencyof Jacob, and hate his palaces: therefore will I deliver up the city with all that is therein.",
        "9And it shall come to pass, if there remain tenmenin one house, that they shall die.",
        "10And a manâs uncle shall take him up, and he that burneth him, to bring out the bones out of the house, and shall say unto him thatisby the sides of the house,Is thereyetanywith thee? and he shall say, No. Then shall he say, Hold thy tongue: for we may not make mention of the name of theLord.",
        "11For, behold, theLordcommandeth, and he will smite the great house with breaches, and the little house with clefts.",
        "12Â¶Shall horses run upon the rock? willoneplowtherewith oxen? for ye have turnedjudgmentinto gall, and the fruit of righteousness into hemlock:",
        "13Ye whichrejoicein a thing of nought, which say, Have we not taken to us horns by our own strength?",
        "14But, behold, I will raise up against you a nation, O house of Israel, saith theLordthe God of hosts; and they shall afflict you from the entering in of Hemath unto the river of the wilderness."
      ],
      "full_text": "1Woe to themthat areateasein Zion, and trust in the mountain ofSamaria,which arenamed chief of the nations, to whom the house of Israel came! 2Pass ye unto Calneh, and see; and from thence go ye to Hamath the great: then go down to Gath of the Philistines:be theybetter than these kingdoms? or their border greater than your border? 3Ye that putfaraway the evil day, and cause the seat of violence to come near; 4That lie upon beds of ivory, and stretch themselves upon their couches, and eat the lambs out of the flock, and the calves out of the midst of the stall; 5That chant to the sound of the viol,andinvent to themselvesinstrumentsofmusick, like David; 6That drink wine in bowls, and anoint themselves with the chief ointments: but they are not grieved for the affliction of Joseph. 7Â¶Therefore now shall they gocaptivewith the first that go captive, and thebanquetof them that stretched themselves shall be removed. 8The LordGodhathswornby himself, saith theLordthe God of hosts, I abhor theexcellencyof Jacob, and hate his palaces: therefore will I deliver up the city with all that is therein. 9And it shall come to pass, if there remain tenmenin one house, that they shall die. 10And a manâs uncle shall take him up, and he that burneth him, to bring out the bones out of the house, and shall say unto him thatisby the sides of the house,Is thereyetanywith thee? and he shall say, No. Then shall he say, Hold thy tongue: for we may not make mention of the name of theLord. 11For, behold, theLordcommandeth, and he will smite the great house with breaches, and the little house with clefts. 12Â¶Shall horses run upon the rock? willoneplowtherewith oxen? for ye have turnedjudgmentinto gall, and the fruit of righteousness into hemlock: 13Ye whichrejoicein a thing of nought, which say, Have we not taken to us horns by our own strength? 14But, behold, I will raise up against you a nation, O house of Israel, saith theLordthe God of hosts; and they shall afflict you from the entering in of Hemath unto the river of the wilderness."
    },
    {
      "reference": "Amos 7",
      "title": "Amos 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/7?lang=eng",
      "summary": "Amos relates how he was called of God to be a prophetâHe prophesies the captivity of Israel.",
      "verses": [
        "1Thus hath the LordGodshewed unto me; and, behold, he formed grasshoppers in the beginning of the shooting up of the latter growth; and, lo,it wasthe latter growth after the kingâs mowings.",
        "2And it came to pass,thatwhen they had made an end of eating the grass of the land, then I said, O LordGod, forgive, I beseech thee: by whom shall Jacob arise? for heissmall.",
        "3TheLordrepentedfor this: It shall not be, saith theLord.",
        "4Â¶Thus hath the LordGodshewed unto me: and, behold, the LordGodcalled to contend by fire, and it devoured the great deep, and did eat up a part.",
        "5Then said I, O LordGod, cease, I beseech thee: by whom shall Jacob arise? for heissmall.",
        "6TheLordrepented for this: This also shall not be, saith the LordGod.",
        "7Â¶Thus he shewed me: and, behold, the Lord stood upon a wallmadeby a plumbline, with a plumbline in his hand.",
        "8And theLordsaid unto me, Amos, what seest thou? And I said, A plumbline. Then said the Lord, Behold, I will set a plumbline in the midst of my people Israel: I will not againpassby them any more:",
        "9And the high places of Isaac shall be desolate, and the sanctuaries of Israel shall be laid waste; and I will rise against thehouseof Jeroboam with the sword.",
        "10Â¶Then Amaziah the priest of Beth-el sent toJeroboamking of Israel, saying, Amos hath conspired against thee in the midst of the house of Israel: the land is not able to bear all his words.",
        "11For thus Amos saith, Jeroboam shall die by the sword, and Israel shall surely be led away captive out of their own land.",
        "12Also Amaziah said unto Amos, O thouseer, go, flee thee away into the land of Judah, and there eat bread, and prophesy there:",
        "13But prophesy not again any more at Beth-el: for itisthe kingâschapel, and itisthe kingâs court.",
        "14Â¶Then answered Amos, andsaid to Amaziah, Iwasnoprophet, neitherwasI a prophetâs son; but Iwasan herdman, and a gatherer of sycomore fruit:",
        "15And theLordtook me as I followed the flock, and theLordsaid unto me,Go,prophesyunto my people Israel.",
        "16Â¶Now therefore hear thou the word of theLord: Thou sayest, Prophesy not against Israel, and drop notthy wordagainst the house of Isaac.",
        "17Therefore thus saith theLord; Thy wife shall be an harlot in the city, and thy sons and thy daughters shall fall by the sword, and thy land shall be divided by line; and thou shalt die in a polluted land: andIsraelshall surely go into captivity forth of his land."
      ],
      "full_text": "1Thus hath the LordGodshewed unto me; and, behold, he formed grasshoppers in the beginning of the shooting up of the latter growth; and, lo,it wasthe latter growth after the kingâs mowings. 2And it came to pass,thatwhen they had made an end of eating the grass of the land, then I said, O LordGod, forgive, I beseech thee: by whom shall Jacob arise? for heissmall. 3TheLordrepentedfor this: It shall not be, saith theLord. 4Â¶Thus hath the LordGodshewed unto me: and, behold, the LordGodcalled to contend by fire, and it devoured the great deep, and did eat up a part. 5Then said I, O LordGod, cease, I beseech thee: by whom shall Jacob arise? for heissmall. 6TheLordrepented for this: This also shall not be, saith the LordGod. 7Â¶Thus he shewed me: and, behold, the Lord stood upon a wallmadeby a plumbline, with a plumbline in his hand. 8And theLordsaid unto me, Amos, what seest thou? And I said, A plumbline. Then said the Lord, Behold, I will set a plumbline in the midst of my people Israel: I will not againpassby them any more: 9And the high places of Isaac shall be desolate, and the sanctuaries of Israel shall be laid waste; and I will rise against thehouseof Jeroboam with the sword. 10Â¶Then Amaziah the priest of Beth-el sent toJeroboamking of Israel, saying, Amos hath conspired against thee in the midst of the house of Israel: the land is not able to bear all his words. 11For thus Amos saith, Jeroboam shall die by the sword, and Israel shall surely be led away captive out of their own land. 12Also Amaziah said unto Amos, O thouseer, go, flee thee away into the land of Judah, and there eat bread, and prophesy there: 13But prophesy not again any more at Beth-el: for itisthe kingâschapel, and itisthe kingâs court. 14Â¶Then answered Amos, andsaid to Amaziah, Iwasnoprophet, neitherwasI a prophetâs son; but Iwasan herdman, and a gatherer of sycomore fruit: 15And theLordtook me as I followed the flock, and theLordsaid unto me,Go,prophesyunto my people Israel. 16Â¶Now therefore hear thou the word of theLord: Thou sayest, Prophesy not against Israel, and drop notthy wordagainst the house of Isaac. 17Therefore thus saith theLord; Thy wife shall be an harlot in the city, and thy sons and thy daughters shall fall by the sword, and thy land shall be divided by line; and thou shalt die in a polluted land: andIsraelshall surely go into captivity forth of his land."
    },
    {
      "reference": "Amos 8",
      "title": "Amos 8",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/8?lang=eng",
      "summary": "Amos prophesies the downfall of IsraelâThere will be a famine of hearing the word of the Lord.",
      "verses": [
        "1Thus hath the LordGodshewed unto me: and behold a basket of summer fruit.",
        "2And he said, Amos, what seest thou? And I said, A basket of summer fruit. Then said theLordunto me, Theendis come upon my people of Israel; I will not againpassby them any more.",
        "3And the songs of the temple shall be howlings in that day, saith the LordGod:there shall bemany dead bodies in every place; they shall castthemforth with silence.",
        "4Â¶Hear this, O ye that swallow up the needy, even to make the poor of the land to fail,",
        "5Saying, When will the new moon be gone, that we may sell corn? and thesabbath, that we may set forth wheat, making theephahsmall, and the shekel great, and falsifying thebalancesby deceit?",
        "6That we maybuythe poor for silver, and the needy for a pair of shoes;yea,and sell the refuse of the wheat?",
        "7TheLordhath sworn by theexcellencyof Jacob, Surely I will neverforgetany of their works.",
        "8Shall not the land tremble for this, and every onemournthat dwelleth therein? and it shall rise up wholly as a flood; and it shallbecast out and drowned, asbythe flood of Egypt.",
        "9And it shall come to pass in that day, saith the LordGod, that I will cause thesunto go down at noon, and I willdarkentheearthin the clear day:",
        "10And I will turn your feasts into mourning, and all your songs intolamentation; and I will bring up sackcloth upon all loins, andbaldnessupon every head; and I will make it as the mourning of anonlyson,and the end thereof as a bitter day.",
        "11Â¶Behold, the days come, saith the LordGod, that I will send a famine in the land, not afamineof bread, nor athirstfor water, but of hearing thewordsof theLord:",
        "12And they shall wander from sea to sea, and from the north even to the east, they shallrunto and fro to seek the word of theLord, and shall not findit.",
        "13In that day shall the fair virgins and young men faint for thirst.",
        "14They thatswearby the sin of Samaria, and say, Thy god, ODan, liveth; and, The manner of Beer-sheba liveth; even they shall fall, and never rise up again."
      ],
      "full_text": "1Thus hath the LordGodshewed unto me: and behold a basket of summer fruit. 2And he said, Amos, what seest thou? And I said, A basket of summer fruit. Then said theLordunto me, Theendis come upon my people of Israel; I will not againpassby them any more. 3And the songs of the temple shall be howlings in that day, saith the LordGod:there shall bemany dead bodies in every place; they shall castthemforth with silence. 4Â¶Hear this, O ye that swallow up the needy, even to make the poor of the land to fail, 5Saying, When will the new moon be gone, that we may sell corn? and thesabbath, that we may set forth wheat, making theephahsmall, and the shekel great, and falsifying thebalancesby deceit? 6That we maybuythe poor for silver, and the needy for a pair of shoes;yea,and sell the refuse of the wheat? 7TheLordhath sworn by theexcellencyof Jacob, Surely I will neverforgetany of their works. 8Shall not the land tremble for this, and every onemournthat dwelleth therein? and it shall rise up wholly as a flood; and it shallbecast out and drowned, asbythe flood of Egypt. 9And it shall come to pass in that day, saith the LordGod, that I will cause thesunto go down at noon, and I willdarkentheearthin the clear day: 10And I will turn your feasts into mourning, and all your songs intolamentation; and I will bring up sackcloth upon all loins, andbaldnessupon every head; and I will make it as the mourning of anonlyson,and the end thereof as a bitter day. 11Â¶Behold, the days come, saith the LordGod, that I will send a famine in the land, not afamineof bread, nor athirstfor water, but of hearing thewordsof theLord: 12And they shall wander from sea to sea, and from the north even to the east, they shallrunto and fro to seek the word of theLord, and shall not findit. 13In that day shall the fair virgins and young men faint for thirst. 14They thatswearby the sin of Samaria, and say, Thy god, ODan, liveth; and, The manner of Beer-sheba liveth; even they shall fall, and never rise up again."
    },
    {
      "reference": "Amos 9",
      "title": "Amos 9",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/9?lang=eng",
      "summary": "Israel will be sifted among all nationsâIn the last days, the people of Israel will be gathered again into their own land, and it will become productive.",
      "verses": [
        "1I saw the Lord standing upon the altar: and he said, Smite the lintel of the door, that the posts may shake: and cut them in the head, all of them; and I willslaythe last of them with the sword: he thatfleethof them shall not flee away, and he that escapeth of them shall not be delivered.",
        "2Though they dig intohell, thence shall mine hand take them; though they climb up to heaven, thence will I bring them down:",
        "3And though theyhidethemselves in the top of Carmel, I will search and take them out thence; and though they be hid from my sight in the bottom of the sea, thence will I command the serpent, and he shall bite them:",
        "4And though they go into captivity before their enemies, thence will I command the sword, and it shall slay them: and I will set mine eyes upon them forevil, and not for good.",
        "5And the LordGodof hostsishe that toucheth the land, and it shallmelt, and all that dwell therein shallmourn: and it shall rise up wholly like a flood; and shall be drowned, asbythe flood of Egypt.",
        "6It ishe that buildeth hisstoriesin the heaven, and hath founded his troop in the earth; he that calleth for thewatersof the sea, and poureth them out upon the face of the earth: TheLordishis name.",
        "7Areye not as children of the Ethiopians unto me, O children of Israel? saith theLord. Have not I brought up Israel out of the land of Egypt? and the Philistines from Caphtor, and the Syrians from Kir?",
        "8Behold, theeyesof the LordGodareupon the sinful kingdom, and I willdestroyit from off the face of the earth; saving that I will not utterlydestroythe house of Jacob, saith theLord.",
        "9For, lo, I will command, and I willsiftthe house ofIsraelamong all nations, like ascornis sifted in a sieve, yet shall not the least grainfallupon the earth.",
        "10All the sinners of my people shall die by the sword, which say, The evil shall not overtake norpreventus.",
        "11Â¶In that day will I raise up thetabernacleof David that is fallen, and close up the breaches thereof; and I will raise up his ruins, and I will build it as in the days of old:",
        "12That they maypossessthe remnant ofEdom, and of all theheathen, which are called by my name, saith theLordthat doeth this.",
        "13Behold, the days come, saith theLord, that the plowman shall overtake the reaper, and the treader of grapes him thatsowethseed; and the mountains shall drop sweet wine, and all the hills shallmelt.",
        "14And I will bring again thecaptivityof my people ofIsrael, and they shallbuildthewastecities, and inhabitthem;and they shall plant vineyards, and drink the wine thereof; they shall also make gardens, and eat the fruit of them.",
        "15And I willplantthem upon theirland, and they shallno morebe pulled up out of their land which I have given them, saith theLordthy God."
      ],
      "full_text": "1I saw the Lord standing upon the altar: and he said, Smite the lintel of the door, that the posts may shake: and cut them in the head, all of them; and I willslaythe last of them with the sword: he thatfleethof them shall not flee away, and he that escapeth of them shall not be delivered. 2Though they dig intohell, thence shall mine hand take them; though they climb up to heaven, thence will I bring them down: 3And though theyhidethemselves in the top of Carmel, I will search and take them out thence; and though they be hid from my sight in the bottom of the sea, thence will I command the serpent, and he shall bite them: 4And though they go into captivity before their enemies, thence will I command the sword, and it shall slay them: and I will set mine eyes upon them forevil, and not for good. 5And the LordGodof hostsishe that toucheth the land, and it shallmelt, and all that dwell therein shallmourn: and it shall rise up wholly like a flood; and shall be drowned, asbythe flood of Egypt. 6It ishe that buildeth hisstoriesin the heaven, and hath founded his troop in the earth; he that calleth for thewatersof the sea, and poureth them out upon the face of the earth: TheLordishis name. 7Areye not as children of the Ethiopians unto me, O children of Israel? saith theLord. Have not I brought up Israel out of the land of Egypt? and the Philistines from Caphtor, and the Syrians from Kir? 8Behold, theeyesof the LordGodareupon the sinful kingdom, and I willdestroyit from off the face of the earth; saving that I will not utterlydestroythe house of Jacob, saith theLord. 9For, lo, I will command, and I willsiftthe house ofIsraelamong all nations, like ascornis sifted in a sieve, yet shall not the least grainfallupon the earth. 10All the sinners of my people shall die by the sword, which say, The evil shall not overtake norpreventus. 11Â¶In that day will I raise up thetabernacleof David that is fallen, and close up the breaches thereof; and I will raise up his ruins, and I will build it as in the days of old: 12That they maypossessthe remnant ofEdom, and of all theheathen, which are called by my name, saith theLordthat doeth this. 13Behold, the days come, saith theLord, that the plowman shall overtake the reaper, and the treader of grapes him thatsowethseed; and the mountains shall drop sweet wine, and all the hills shallmelt. 14And I will bring again thecaptivityof my people ofIsrael, and they shallbuildthewastecities, and inhabitthem;and they shall plant vineyards, and drink the wine thereof; they shall also make gardens, and eat the fruit of them. 15And I willplantthem upon theirland, and they shallno morebe pulled up out of their land which I have given them, saith theLordthy God."
    },
    {
      "reference": "Obadiah 1",
      "title": "Obadiah",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/obad/1?lang=eng",
      "summary": "Obadiah prophesies the downfall of EdomâSaviors will stand upon Mount Zion.",
      "verses": [
        "1The vision of Obadiah. Thus saith the LordGodconcerningEdom; We have heard a rumour from theLord, and an ambassador is sent among the heathen, Arise ye, and let us rise up against her in battle.",
        "2Behold, I have made thee small among the heathen: thou art greatly despised.",
        "3Â¶Theprideof thinehearthath deceived thee, thou that dwellest in the clefts of the rock, whose habitationishigh; that saith in his heart, Who shall bring me down to the ground?",
        "4Though thou exaltthyselfas the eagle, and though thou set thy nest among the stars, thence will I bring thee down, saith theLord.",
        "5Ifthievescame to thee, if robbers by night, (how art thou cut off!) would they not have stolen till they had enough? if the grapegatherers came to thee, would they not leavesomegrapes?",
        "6How arethe thingsof Esau searched out!howare his hidden things sought up!",
        "7All the men of thy confederacy have brought theeevento the border: the men that were at peace with thee have deceived thee,andprevailed against thee;they that eatthy bread have laid a wound under thee:there isnone understanding in him.",
        "8Shall I not inthat day, saith theLord, even destroy the wisemenout of Edom, and understanding out of the mount of Esau?",
        "9And thy mightymen,OTeman, shall be dismayed, to the end that every one of the mount of Esau may becut offby slaughter.",
        "10Â¶Forthyviolence against thy brother Jacob shame shall cover thee, and thou shalt be cut off for ever.",
        "11In the day that thou stoodest on the other side, in the day that the strangers carried away captive his forces, and foreigners entered into his gates, and cast lots upon Jerusalem, even thouwastasoneof them.",
        "12But thou shouldest not have looked on the day of thy brother in the day that he became a stranger;neither shouldest thou haverejoicedover the children of Judah in the day of their destruction; neither shouldest thou have spoken proudly in the day of distress.",
        "13Thou shouldest not have entered into the gate of my people in the day of their calamity; yea, thou shouldest not have looked on their affliction in the day of their calamity, nor have laidhandson their substance in the day of their calamity;",
        "14Neither shouldest thou have stood in the crossway, to cut off those of his that did escape; neither shouldest thou have delivered up those of his that did remain in the day of distress.",
        "15For thedayof theLordisnear upon all theheathen: as thou hastdone, it shall be done unto thee: thyrewardshall return upon thine own head.",
        "16For as ye havedrunkupon my holy mountain,soshall all the heathen drink continually, yea, they shall drink, and they shall swallow down, and they shall be as though they had not been.",
        "17Â¶But upon mountZionshall bedeliverance, and there shall be holiness; and the house of Jacob shallpossesstheir possessions.",
        "18And the house of Jacob shall be afire, and the house of Joseph a flame, and the house ofEsaufor stubble, and they shall kindle in them, and devour them; and there shall not beanyremaining of the house of Esau; for theLordhath spokenit.",
        "19Andthey ofthe south shall possess the mount of Esau; andthey ofthe plain thePhilistines: and they shall possess the fields of Ephraim, and the fields of Samaria: and Benjaminshall possessGilead.",
        "20And the captivity of this host of the children of Israelshall possessthat of the Canaanites,evenunto Zarephath; and the captivity of Jerusalem, whichisin Sepharad, shall possess the cities of the south.",
        "21Andsavioursshall come up onmount Ziontojudgethe mount of Esau; and thekingdomshall be theLordâs."
      ],
      "full_text": "1The vision of Obadiah. Thus saith the LordGodconcerningEdom; We have heard a rumour from theLord, and an ambassador is sent among the heathen, Arise ye, and let us rise up against her in battle. 2Behold, I have made thee small among the heathen: thou art greatly despised. 3Â¶Theprideof thinehearthath deceived thee, thou that dwellest in the clefts of the rock, whose habitationishigh; that saith in his heart, Who shall bring me down to the ground? 4Though thou exaltthyselfas the eagle, and though thou set thy nest among the stars, thence will I bring thee down, saith theLord. 5Ifthievescame to thee, if robbers by night, (how art thou cut off!) would they not have stolen till they had enough? if the grapegatherers came to thee, would they not leavesomegrapes? 6How arethe thingsof Esau searched out!howare his hidden things sought up! 7All the men of thy confederacy have brought theeevento the border: the men that were at peace with thee have deceived thee,andprevailed against thee;they that eatthy bread have laid a wound under thee:there isnone understanding in him. 8Shall I not inthat day, saith theLord, even destroy the wisemenout of Edom, and understanding out of the mount of Esau? 9And thy mightymen,OTeman, shall be dismayed, to the end that every one of the mount of Esau may becut offby slaughter. 10Â¶Forthyviolence against thy brother Jacob shame shall cover thee, and thou shalt be cut off for ever. 11In the day that thou stoodest on the other side, in the day that the strangers carried away captive his forces, and foreigners entered into his gates, and cast lots upon Jerusalem, even thouwastasoneof them. 12But thou shouldest not have looked on the day of thy brother in the day that he became a stranger;neither shouldest thou haverejoicedover the children of Judah in the day of their destruction; neither shouldest thou have spoken proudly in the day of distress. 13Thou shouldest not have entered into the gate of my people in the day of their calamity; yea, thou shouldest not have looked on their affliction in the day of their calamity, nor have laidhandson their substance in the day of their calamity; 14Neither shouldest thou have stood in the crossway, to cut off those of his that did escape; neither shouldest thou have delivered up those of his that did remain in the day of distress. 15For thedayof theLordisnear upon all theheathen: as thou hastdone, it shall be done unto thee: thyrewardshall return upon thine own head. 16For as ye havedrunkupon my holy mountain,soshall all the heathen drink continually, yea, they shall drink, and they shall swallow down, and they shall be as though they had not been. 17Â¶But upon mountZionshall bedeliverance, and there shall be holiness; and the house of Jacob shallpossesstheir possessions. 18And the house of Jacob shall be afire, and the house of Joseph a flame, and the house ofEsaufor stubble, and they shall kindle in them, and devour them; and there shall not beanyremaining of the house of Esau; for theLordhath spokenit. 19Andthey ofthe south shall possess the mount of Esau; andthey ofthe plain thePhilistines: and they shall possess the fields of Ephraim, and the fields of Samaria: and Benjaminshall possessGilead. 20And the captivity of this host of the children of Israelshall possessthat of the Canaanites,evenunto Zarephath; and the captivity of Jerusalem, whichisin Sepharad, shall possess the cities of the south. 21Andsavioursshall come up onmount Ziontojudgethe mount of Esau; and thekingdomshall be theLordâs."
    },
    {
      "reference": "Jonah 1",
      "title": "Jonah",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jonah/1?lang=eng",
      "summary": "Jonah is sent to call Nineveh to repentanceâHe flees on a ship, is cast into the sea, and is swallowed by a great fish.",
      "verses": [
        "1Now the word of theLordcame untoJonahthe son of Amittai, saying,",
        "2Arise, go to Nineveh, that great city, andcryagainst it; for theirwickednessis come up before me.",
        "3But Jonah rose up tofleeunto Tarshish from thepresenceof theLord, and went down to Joppa; and he found a ship going to Tarshish: so he paid the fare thereof, and went down into it, to go with them unto Tarshish from the presence of theLord.",
        "4Â¶But theLordsent out a great wind into the sea, and there was a mightytempestin the sea, so that the ship was like to be broken.",
        "5Then the mariners were afraid, and cried every man unto his god, and cast forth the wares thatwerein the ship into the sea, to lightenitof them. But Jonah was gone down into the sides of the ship; and he lay, and was fast asleep.",
        "6So the shipmaster came to him, and said unto him, What meanest thou, O sleeper? arise,callupon thy God, if so be that God will think upon us, that we perish not.",
        "7And they said every one to his fellow, Come, and let us cast lots, that we may know for whose cause this evilisupon us. So they cast lots, and the lot fell upon Jonah.",
        "8Then said they unto him, Tell us, we pray thee, for whose cause this evilisupon us; Whatisthine occupation? and whence comest thou? whatisthy country? and of what peopleartthou?",
        "9And he said unto them, Iaman Hebrew; and I fear theLord, the God of heaven, which hath made the sea and the dryland.",
        "10Then were the men exceedingly afraid, and said unto him, Why hast thou done this? For the men knew that he fled from the presence of theLord, because he had told them.",
        "11Â¶Then said they unto him, What shall we do unto thee, that the sea may be calm unto us? for the sea wrought, and was tempestuous.",
        "12And he said unto them, Take me up, and cast me forth into the sea; so shall the sea be calm unto you: for I know that for my sake this great tempestisupon you.",
        "13Nevertheless the men rowed hard to bringitto the land; but they could not: for the sea wrought, and was tempestuous against them.",
        "14Wherefore they cried unto theLord, and said, We beseech thee, OLord, we beseech thee, let us not perish for this manâs life, and lay not upon us innocent blood: for thou, OLord, hast done as it pleased thee.",
        "15So they took up Jonah, and cast him forth into the sea: and the sea ceased from her raging.",
        "16Then the men feared theLordexceedingly, and offered a sacrifice unto theLord, and made vows.",
        "17Â¶Now theLordhad prepared a great fish to swallow up Jonah. And Jonah was in the belly of the fishthreedays and three nights."
      ],
      "full_text": "1Now the word of theLordcame untoJonahthe son of Amittai, saying, 2Arise, go to Nineveh, that great city, andcryagainst it; for theirwickednessis come up before me. 3But Jonah rose up tofleeunto Tarshish from thepresenceof theLord, and went down to Joppa; and he found a ship going to Tarshish: so he paid the fare thereof, and went down into it, to go with them unto Tarshish from the presence of theLord. 4Â¶But theLordsent out a great wind into the sea, and there was a mightytempestin the sea, so that the ship was like to be broken. 5Then the mariners were afraid, and cried every man unto his god, and cast forth the wares thatwerein the ship into the sea, to lightenitof them. But Jonah was gone down into the sides of the ship; and he lay, and was fast asleep. 6So the shipmaster came to him, and said unto him, What meanest thou, O sleeper? arise,callupon thy God, if so be that God will think upon us, that we perish not. 7And they said every one to his fellow, Come, and let us cast lots, that we may know for whose cause this evilisupon us. So they cast lots, and the lot fell upon Jonah. 8Then said they unto him, Tell us, we pray thee, for whose cause this evilisupon us; Whatisthine occupation? and whence comest thou? whatisthy country? and of what peopleartthou? 9And he said unto them, Iaman Hebrew; and I fear theLord, the God of heaven, which hath made the sea and the dryland. 10Then were the men exceedingly afraid, and said unto him, Why hast thou done this? For the men knew that he fled from the presence of theLord, because he had told them. 11Â¶Then said they unto him, What shall we do unto thee, that the sea may be calm unto us? for the sea wrought, and was tempestuous. 12And he said unto them, Take me up, and cast me forth into the sea; so shall the sea be calm unto you: for I know that for my sake this great tempestisupon you. 13Nevertheless the men rowed hard to bringitto the land; but they could not: for the sea wrought, and was tempestuous against them. 14Wherefore they cried unto theLord, and said, We beseech thee, OLord, we beseech thee, let us not perish for this manâs life, and lay not upon us innocent blood: for thou, OLord, hast done as it pleased thee. 15So they took up Jonah, and cast him forth into the sea: and the sea ceased from her raging. 16Then the men feared theLordexceedingly, and offered a sacrifice unto theLord, and made vows. 17Â¶Now theLordhad prepared a great fish to swallow up Jonah. And Jonah was in the belly of the fishthreedays and three nights."
    },
    {
      "reference": "Jonah 2",
      "title": "Jonah 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jonah/2?lang=eng",
      "summary": "Jonah prays to the Lord, and the fish vomits him out on dry ground.",
      "verses": [
        "1Then Jonah prayed unto theLordhis God out of the fishâs belly,",
        "2And said, I cried by reason of mineafflictionunto theLord, and he heard me; out of the belly ofhellcried I,andthou heardest my voice.",
        "3For thou hadst cast me into the deep, in the midst of the seas; and the floods compassed me about: all thy billows and thy waves passed over me.",
        "4Then I said, I am cast out of thy sight; yet I will look again toward thy holytemple.",
        "5The waters compassed me about,evento the soul: the depth closed me round about, the weeds were wrapped about my head.",
        "6I went down to the bottoms of the mountains; the earth with her barswasabout me for ever: yet hast thoubrought upmy life from corruption, OLordmy God.",
        "7When my soul fainted within me IrememberedtheLord: and myprayercame in unto thee, into thine holytemple.",
        "8They that observelyingvanities forsake their own mercy.",
        "9But I will sacrifice unto thee with the voice of thanksgiving; I will paythatthat I havevowed.Salvationisof theLord.",
        "10Â¶And theLordspake unto the fish, and it vomited out Jonah upon the dryland."
      ],
      "full_text": "1Then Jonah prayed unto theLordhis God out of the fishâs belly, 2And said, I cried by reason of mineafflictionunto theLord, and he heard me; out of the belly ofhellcried I,andthou heardest my voice. 3For thou hadst cast me into the deep, in the midst of the seas; and the floods compassed me about: all thy billows and thy waves passed over me. 4Then I said, I am cast out of thy sight; yet I will look again toward thy holytemple. 5The waters compassed me about,evento the soul: the depth closed me round about, the weeds were wrapped about my head. 6I went down to the bottoms of the mountains; the earth with her barswasabout me for ever: yet hast thoubrought upmy life from corruption, OLordmy God. 7When my soul fainted within me IrememberedtheLord: and myprayercame in unto thee, into thine holytemple. 8They that observelyingvanities forsake their own mercy. 9But I will sacrifice unto thee with the voice of thanksgiving; I will paythatthat I havevowed.Salvationisof theLord. 10Â¶And theLordspake unto the fish, and it vomited out Jonah upon the dryland."
    },
    {
      "reference": "Jonah 3",
      "title": "Jonah 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jonah/3?lang=eng",
      "summary": "Jonah prophesies the downfall of NinevehâThe people repent, and the city is saved.",
      "verses": [
        "1And the word of theLordcame unto Jonah the second time, saying,",
        "2Arise, go unto Nineveh, that great city, andpreachunto it the preaching that I bid thee.",
        "3So Jonah arose, and went unto Nineveh, according to the word of theLord. Now Nineveh was anexceeding great cityof three daysâjourney.",
        "4And Jonah began to enter into the city a dayâs journey, and he cried, and said, Yet forty days, and Nineveh shall be overthrown.",
        "5Â¶Sothe people ofNinevehbelieved God, and proclaimed afast, and put on sackcloth, from the greatest of them even to the least of them.",
        "6For word came unto the king of Nineveh, and he arose from his throne, and he laid his robe from him, and coveredhimwithsackcloth, and sat in ashes.",
        "7And he causeditto be proclaimed and published through Nineveh by the decree of the king and his nobles, saying, Let neither man nor beast, herd nor flock, taste any thing: let them not feed, nor drink water:",
        "8But let man and beast be covered with sackcloth, and cry mightily unto God: yea, let themturnevery one from his evil way, and from the violence thatisin their hands.",
        "9Who can tellifGodwill turn and repent, and turn away from his fierce anger, that we perish not?",
        "10Â¶And Godsawtheir works, that theyturnedfrom theirevilway; and God repented of the evil, that he had said that he would do unto them; and he diditnot."
      ],
      "full_text": "1And the word of theLordcame unto Jonah the second time, saying, 2Arise, go unto Nineveh, that great city, andpreachunto it the preaching that I bid thee. 3So Jonah arose, and went unto Nineveh, according to the word of theLord. Now Nineveh was anexceeding great cityof three daysâjourney. 4And Jonah began to enter into the city a dayâs journey, and he cried, and said, Yet forty days, and Nineveh shall be overthrown. 5Â¶Sothe people ofNinevehbelieved God, and proclaimed afast, and put on sackcloth, from the greatest of them even to the least of them. 6For word came unto the king of Nineveh, and he arose from his throne, and he laid his robe from him, and coveredhimwithsackcloth, and sat in ashes. 7And he causeditto be proclaimed and published through Nineveh by the decree of the king and his nobles, saying, Let neither man nor beast, herd nor flock, taste any thing: let them not feed, nor drink water: 8But let man and beast be covered with sackcloth, and cry mightily unto God: yea, let themturnevery one from his evil way, and from the violence thatisin their hands. 9Who can tellifGodwill turn and repent, and turn away from his fierce anger, that we perish not? 10Â¶And Godsawtheir works, that theyturnedfrom theirevilway; and God repented of the evil, that he had said that he would do unto them; and he diditnot."
    },
    {
      "reference": "Jonah 4",
      "title": "Jonah 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jonah/4?lang=eng",
      "summary": "Jonah is displeased with the Lord for His mercy upon the peopleâThe Lord rebukes him.",
      "verses": [
        "1But it displeased Jonah exceedingly, and he was very angry.",
        "2And he prayed unto theLord, and said, I pray thee, OLord,wasnot this my saying, when I was yet in my country? Therefore I fled before unto Tarshish: for I knew that thouarta gracious God, andmerciful, slow to anger, and of great kindness, andrepentestthee of the evil.",
        "3Therefore now, OLord, take, I beseech thee, my life from me; forit isbetter for me to die than to live.",
        "4Â¶Then said theLord, Doest thou well to be angry?",
        "5So Jonah went out of the city, and sat on the east side of the city, and there made him abooth, and sat under it in the shadow, till he might see what would become of the city.",
        "6And theLordGod prepared agourd, and madeitto come up over Jonah, that it might be a shadow over his head, to deliver him from his grief. So Jonah was exceeding glad of the gourd.",
        "7But God prepared a worm when the morning rose the next day, and it smote the gourd that it withered.",
        "8And it came to pass, when the sun did arise, that God prepared a vehementeast wind; and the sun beat upon the head of Jonah, that he fainted, and wished in himself to die, and said,It isbetter for me to die than to live.",
        "9And God said to Jonah, Doest thou well to beangryfor the gourd? And he said, I do well to be angry,evenunto death.",
        "10Then said theLord, Thou hast had pity on the gourd, for the which thou hast not laboured, neither madest it grow; which came up in a night, and perished in a night:",
        "11And should not IspareNineveh, that great city, wherein are more than sixscore thousandpersonsthat cannotdiscernbetween their right hand and their left hand; andalsomuch cattle?"
      ],
      "full_text": "1But it displeased Jonah exceedingly, and he was very angry. 2And he prayed unto theLord, and said, I pray thee, OLord,wasnot this my saying, when I was yet in my country? Therefore I fled before unto Tarshish: for I knew that thouarta gracious God, andmerciful, slow to anger, and of great kindness, andrepentestthee of the evil. 3Therefore now, OLord, take, I beseech thee, my life from me; forit isbetter for me to die than to live. 4Â¶Then said theLord, Doest thou well to be angry? 5So Jonah went out of the city, and sat on the east side of the city, and there made him abooth, and sat under it in the shadow, till he might see what would become of the city. 6And theLordGod prepared agourd, and madeitto come up over Jonah, that it might be a shadow over his head, to deliver him from his grief. So Jonah was exceeding glad of the gourd. 7But God prepared a worm when the morning rose the next day, and it smote the gourd that it withered. 8And it came to pass, when the sun did arise, that God prepared a vehementeast wind; and the sun beat upon the head of Jonah, that he fainted, and wished in himself to die, and said,It isbetter for me to die than to live. 9And God said to Jonah, Doest thou well to beangryfor the gourd? And he said, I do well to be angry,evenunto death. 10Then said theLord, Thou hast had pity on the gourd, for the which thou hast not laboured, neither madest it grow; which came up in a night, and perished in a night: 11And should not IspareNineveh, that great city, wherein are more than sixscore thousandpersonsthat cannotdiscernbetween their right hand and their left hand; andalsomuch cattle?"
    }
  ],
  "scraped_timestamp": "2025-12-21 22:33:28",
  "metadata": {
    "week_number": 48,
    "title": "Week 48: November 23–29 - Amos; Obadiah; Jonah",
    "date_range": "November 23–29",
    "scraped_at": "2025-12-21T22:33:43.149545",
    "scraper_version": "2.0.0"
  }
}