{
  "week_number": 44,
  "date_range": "October 26–November 1",
  "title": "Week 44: October 26–November 1 - Jeremiah 31–33; 36–38; Lamentations 1; 3",
  "bundle_title": "Week 44: October 26–November 1: \"Week 44: October 26–November 1 - Jeremiah 31–33; 36–38; Lamentations 1; 3\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/44?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/44?lang=eng",
    "title": "Jeremiah 31–33;36–39;Lamentations 1;3",
    "scripture_references": "Jeremiah 31–33; 36–39; Lamentations 1; 3",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“October 26–November 1. ‘I Will Turn Their Mourning into Joy’: Jeremiah 31–33; 36–39; Lamentations 1; 3”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“October 26–November 1. ‘I Will Turn Their Mourning into Joy,’”Come, Follow Me: Old Testament 2026\n\nJeremiah Lamenting the Destruction of Jerusalem, by Rembrandt van Rijn\n\nOctober 26–November 1: “I Will Turn Their Mourning into Joy”\n\nWhen the Lord first called Jeremiah to be a prophet, He told him that his mission would be “to root out, and to pull down” (Jeremiah 1:10)—and in Jerusalem, there was plenty of wickedness to root out and pull down. But this was only part of Jeremiah’s mission—he was also called “to build, and to plant” (Jeremiah 1:10). What could be built or planted in the desolate ruins left by the rebellion of the covenant people? Asked another way, when sin or adversity has left our lives in ruins, how can we rebuild and plant again? The answer lies in “the Branch of righteousness” (Jeremiah 33:15), the promised Messiah. He brings “a new covenant” (Jeremiah 31:31)—one that requires more than the outward appearance of devotion. His law must be “in [our] inward parts,” written “in [our] hearts.” That’s what it means for the Lord to “be [our] God” and for us to “be [His] people” (Jeremiah 31:33). It’s a lifelong process, and we will still make mistakes and have cause to mourn from time to time. But when we do, the Lord promises, “I will turn their mourning into joy” (Jeremiah 31:13).\n\nFor an overview of Lamentations, see “Lamentations, Book of” in the Guide to the Scriptures.",
    "learning_at_home_church": [
      {
        "title": "The Lord will bring His covenant people out of captivity.",
        "content": "InJeremiah 31;33the Lord acknowledged the “lamentation, and bitter weeping” (Jeremiah 31:15) the Israelites would experience in captivity. However, he also offered words of comfort and hope. Look for them as you read these chapters. What promises do you find that apply to you?\n\nJeremiah 31:31–34;32:37–42"
      },
      {
        "title": "“They shall be my people, and I will be their God.”",
        "content": "Although the Israelites had broken their covenants, Jeremiah prophesied that the Lord would again establish a “new” and “everlasting covenant” with them (Jeremiah 31:31;32:40). What is that covenant? Consider looking for insights in Guide to the Scriptures, “New and Everlasting Covenant,” Gospel Library.\n\nAs you readJeremiah 31:31–34;32:37–42, ponder:\n\nWhat it means to you to be part of God’s covenant people.\n\nWhat it means to have His law written in your heart.\n\nWhat the Lord promises when you make covenants with Him.\n\nHow your covenant relationship with the Lord changes you.\n\nWhat promises have you made to God as you have participated in sacred ordinances? How is He fulfilling His promises to you?\n\nSee also David A. Bednar, “Abide in Me, and I in You; Therefore Walk with Me,”Liahona, May 2023, 123–26.\n\nJeremiah 36"
      },
      {
        "title": "The scriptures have power to turn me away from evil.",
        "content": "According toJeremiah 36:2–3, why did the Lord command Jeremiah to record his prophecies? As you readJeremiah 36, note how the following people felt about these prophecies:\n\nThe Lord (seeverses 1–3, 27–31)\n\nJeremiah (seeverses 4–7, 32)\n\nBaruch (seeverses 4, 8–10, 14–18)\n\nJehudi and King Jehoiakim (seeverses 20–26)\n\nElnathan, Delaiah, and Gemariah (seeverse 25)\n\nPonder how you feel about the scriptures. How have they helped you turn away from evil?\n\nJeremiah 37–39"
      },
      {
        "title": "Be firm in following God’s prophets.",
        "content": "InJeremiah 37:1–3, 15–21;38:1–6, 14–28, what evidence do you see that King Zedekiah believed Jeremiah was the Lord’s true prophet? What evidence do you see that Zedekiah did not believe? What do you learn from this comparison? As you readJeremiah 39, ponder the difference it would have made if Zedekiah and his people had followed the prophet and kept the commandments of the Lord. (Compare what happened to Zedekiah with what happened to Lehi’s family in1 Nephi 1–2.)\n\nJeremiah 38:6–13;39:15–18"
      },
      {
        "title": "I can be bold in standing up for what is right.",
        "content": "The king’s officials felt that Jeremiah’s prophecies were making their soldiers less willing to fight, so they threw Jeremiah into a filthy dungeon (seeJeremiah 38:1–4). InJeremiah 38:6–13, what impresses you about the response of Ebed-melech the Ethiopian? Notice also the blessing the Lord gave Ebed-melech inJeremiah 39:15–18.\n\nHow could you follow Ebed-melech’s example?\n\nThe Cry of Jeremiah\n\nLamentations 1;3"
      },
      {
        "title": "The Lord can relieve the sorrow I experience because of sin.",
        "content": "The book of Lamentations is a collection of poems written after the destruction of Jerusalem and its temple. Why do you think it is important they were preserved? Consider what the metaphors inLamentations 1and3help you understand about the great sorrow Israel felt. What messages of hope in Christ do you find? (see especiallyLamentations 3:20–33; see alsoMatthew 5:4;James 4:8–10;Alma 36:17–20).\n\nPresident M. Russell Ballard mentioned several situations that may cause some to lose hope, and he offered counsel about where to find hope:\n\n“Some of us may find our lives laden with frustration, disappointment, and sorrow. Many feel helpless to deal with the chaos that seems to prevail in the world. Others anguish over family members who are being carried downstream in a swift, raging current of weakening values and declining moral standards. … Many have even resigned themselves to accept the wickedness and cruelty of the world as being irreparable. They have given up hope. …\n\n“… Some among us may have lost all hope because of sin and transgression. A person can become so deeply immersed in the ways of the world that he sees no way out and loses all hope. My plea to all who have fallen into this trap of the adversary is to never give up! Regardless of how desperate things may seem or how desperate they may yet become, please believe me, you can always have hope. Always” (“The Joy of Hope Fulfilled,”Ensign, Nov. 1992, 31–32).\n\nSee also “Come, Ye Disconsolate,”Hymns, no. 115.\n\nHelp others take responsibility for their own learning.Sometimes it seems like the easiest way to teach is to just tell learners what we think they should know. However, the easiest way is not always the best way. Elder David A. Bednar taught: “Our intent ought not to be ‘What do I tell them?’ Instead, the questions to ask ourselves are ‘What can I invite them to do? What inspired questions can I ask that, if they are willing to respond, will begin to invite the Holy Ghost into their lives?’” (evening with a General Authority, Feb. 7, 2020, broadcasts.ChurchofJesusChrist.org; see alsoTeaching in the Savior’s Way,25). There are many ways to help learners take responsibility for their learning. For example, in this outline learners are invited to search, ponder, make lists, look at pictures, participate in object lessons, draw, and share and apply what they learn."
      }
    ],
    "teaching_children": [
      {
        "title": "Heavenly Father and Jesus love me “with an everlasting love.”",
        "content": "As you readJeremiah 31:3with your children, they could help you find objects (or pictures of objects) that last a long time, such as a metal coin, and some that do not, such as a piece of fruit. You could talk about what “everlasting” means and share with each other how you have felt Heavenly Father’s “everlasting love.” You could also sing together a song like “God Is Watching Over All” (Children’s Songbook, 229).\n\nJeremiah 31:31–34;32:38–41"
      },
      {
        "title": "God will help me keep my covenants.",
        "content": "Your children might enjoy drawing a heart on a piece of paper and then writing in the heart things they learn fromJeremiah 31:31–34about making covenants with God. You may want to review the covenant they make at baptism (seeMosiah 18:10, 13) and discuss what it means to have these promises written in their hearts.\n\nJeremiah 36:1–4"
      },
      {
        "title": "The scriptures are the word of God.",
        "content": "This week’s activity page could help your children learn about Jeremiah, Baruch, and the king (seeJeremiah 36). They could also do actions that go along with the words inJeremiah 36:4–10, such as writing in a book (seeverse 4) and reading the scriptures to the people (seeverses 8, 10).\n\nYou and your children could look at a children’s book and a copy of the scriptures and talk about how these books are different. What makes the scriptures special? It may be inspiring to share with each other some scripture passages that are special to you.\n\nJeremiah 38:6–13"
      },
      {
        "title": "I can stand up for what is right.",
        "content": "You could use the picture at the end of the outline to help your children visualize the story of Ebed-melech inJeremiah 38:6–13. Maybe you could help them find a verse where Ebed-melech did something brave to help the Lord’s prophet. What can we do to show that we know our prophet today is called of God?\n\nLamentations 1:1–2, 16;3:22–26"
      },
      {
        "title": "The Savior made it possible for me to be forgiven of my sins.",
        "content": "To introduce Lamentations, you may want to explain to your children that because the Israelites had not repented, Jerusalem and the temple were destroyed. You could share with each other how you might have felt if you were living there at that time (seeLamentations 1:1–2, 16). How might the message inLamentations 3:22–26have given you hope?\n\nYou could also tell each other about times you felt sad about a bad choice you made. What do we find inLamentations 3:22–26that helps us understand the forgiveness Jesus Christ offers?\n\nFor more, see this month’s issue of theFriendmagazine.\n\nI Will Surely Deliver Thee (Jeremiah 39:18), by Eva Timothy"
      }
    ],
    "study_helps": [],
    "raw_text": "October 26–November 1. “I Will Turn Their Mourning into Joy”: Jeremiah 31–33; 36–39; Lamentations 1; 3\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nOctober 26–November 1\nJeremiah 31–33; 36–38; Lamentations 1; 3\nNovember 2–8\nEzekiel 1–3; 33–34; 36–37; 47\nNovember 9–15\nDaniel 1–7\nNovember 16–22\nHosea 1–6; 10–14; Joel\nNovember 23–29\nAmos; Obadiah; Jonah\nDecember\nAppendixes\nOctober 26–November 1. “I Will Turn Their Mourning into Joy”: Jeremiah 31–33; 36–39; Lamentations 1; 3\n“October 26–November 1. ‘I Will Turn Their Mourning into Joy’: Jeremiah 31–33; 36–39; Lamentations 1; 3”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“October 26–November 1. ‘I Will Turn Their Mourning into Joy,’”\nCome, Follow Me: Old Testament 2026\nJeremiah Lamenting the Destruction of Jerusalem\n, by Rembrandt van Rijn\nOctober 26–November 1: “I Will Turn Their Mourning into Joy”\nJeremiah 31–33\n;\n36–39\n;\nLamentations 1\n;\n3\nWhen the Lord first called Jeremiah to be a prophet, He told him that his mission would be “to root out, and to pull down” (\nJeremiah 1:10\n)—and in Jerusalem, there was plenty of wickedness to root out and pull down. But this was only part of Jeremiah’s mission—he was also called “to build, and to plant” (\nJeremiah 1:10\n). What could be built or planted in the desolate ruins left by the rebellion of the covenant people? Asked another way, when sin or adversity has left our lives in ruins, how can we rebuild and plant again? The answer lies in “the Branch of righteousness” (\nJeremiah 33:15\n), the promised Messiah. He brings “a new covenant” (\nJeremiah 31:31\n)—one that requires more than the outward appearance of devotion. His law must be “in [our] inward parts,” written “in [our] hearts.” That’s what it means for the Lord to “be [our] God” and for us to “be [His] people” (\nJeremiah 31:33\n). It’s a lifelong process, and we will still make mistakes and have cause to mourn from time to time. But when we do, the Lord promises, “I will turn their mourning into joy” (\nJeremiah 31:13\n).\nFor an overview of Lamentations, see “\nLamentations, Book of\n” in the Guide to the Scriptures.\nIdeas for Learning at Home and at Church\nJeremiah 31\n;\n33\nThe Lord will bring His covenant people out of captivity.\nIn\nJeremiah 31\n;\n33\nthe Lord acknowledged the “lamentation, and bitter weeping” (\nJeremiah 31:15\n) the Israelites would experience in captivity. However, he also offered words of comfort and hope. Look for them as you read these chapters. What promises do you find that apply to you?\nJeremiah 31:31–34\n;\n32:37–42\n“They shall be my people, and I will be their God.”\nAlthough the Israelites had broken their covenants, Jeremiah prophesied that the Lord would again establish a “new” and “everlasting covenant” with them (\nJeremiah 31:31\n;\n32:40\n). What is that covenant? Consider looking for insights in Guide to the Scriptures, “\nNew and Everlasting Covenant\n,” Gospel Library.\nAs you read\nJeremiah 31:31–34\n;\n32:37–42\n, ponder:\nWhat it means to you to be part of God’s covenant people.\nWhat it means to have His law written in your heart.\nWhat the Lord promises when you make covenants with Him.\nHow your covenant relationship with the Lord changes you.\nWhat promises have you made to God as you have participated in sacred ordinances? How is He fulfilling His promises to you?\nSee also David A. Bednar, “\nAbide in Me, and I in You; Therefore Walk with Me\n,”\nLiahona\n, May 2023, 123–26.\nJeremiah 36\nThe scriptures have power to turn me away from evil.\nAccording to\nJeremiah 36:2–3\n, why did the Lord command Jeremiah to record his prophecies? As you read\nJeremiah 36\n, note how the following people felt about these prophecies:\nThe Lord (see\nverses 1–3, 27–31\n)\nJeremiah (see\nverses 4–7, 32\n)\nBaruch (see\nverses 4, 8–10, 14–18\n)\nJehudi and King Jehoiakim (see\nverses 20–26\n)\nElnathan, Delaiah, and Gemariah (see\nverse 25\n)\nPonder how you feel about the scriptures. How have they helped you turn away from evil?\nJeremiah 37–39\nBe firm in following God’s prophets.\nIn\nJeremiah 37:1–3, 15–21\n;\n38:1–6, 14–28\n, what evidence do you see that King Zedekiah believed Jeremiah was the Lord’s true prophet? What evidence do you see that Zedekiah did not believe? What do you learn from this comparison? As you read\nJeremiah 39\n, ponder the difference it would have made if Zedekiah and his people had followed the prophet and kept the commandments of the Lord. (Compare what happened to Zedekiah with what happened to Lehi’s family in\n1 Nephi 1–2\n.)\nJeremiah 38:6–13\n;\n39:15–18\nI can be bold in standing up for what is right.\nThe king’s officials felt that Jeremiah’s prophecies were making their soldiers less willing to fight, so they threw Jeremiah into a filthy dungeon (see\nJeremiah 38:1–4\n). In\nJeremiah 38:6–13\n, what impresses you about the response of Ebed-melech the Ethiopian? Notice also the blessing the Lord gave Ebed-melech in\nJeremiah 39:15–18\n.\nHow could you follow Ebed-melech’s example?\nThe Cry of Jeremiah\nLamentations 1\n;\n3\nThe Lord can relieve the sorrow I experience because of sin.\nThe book of Lamentations is a collection of poems written after the destruction of Jerusalem and its temple. Why do you think it is important they were preserved? Consider what the metaphors in\nLamentations 1\nand\n3\nhelp you understand about the great sorrow Israel felt. What messages of hope in Christ do you find? (see especially\nLamentations 3:20–33\n; see also\nMatthew 5:4\n;\nJames 4:8–10\n;\nAlma 36:17–20\n).\nPresident M. Russell Ballard mentioned several situations that may cause some to lose hope, and he offered counsel about where to find hope:\n“Some of us may find our lives laden with frustration, disappointment, and sorrow. Many feel helpless to deal with the chaos that seems to prevail in the world. Others anguish over family members who are being carried downstream in a swift, raging current of weakening values and declining moral standards. … Many have even resigned themselves to accept the wickedness and cruelty of the world as being irreparable. They have given up hope. …\n“… Some among us may have lost all hope because of sin and transgression. A person can become so deeply immersed in the ways of the world that he sees no way out and loses all hope. My plea to all who have fallen into this trap of the adversary is to never give up! Regardless of how desperate things may seem or how desperate they may yet become, please believe me, you can always have hope. Always” (“\nThe Joy of Hope Fulfilled\n,”\nEnsign\n, Nov. 1992, 31–32).\nSee also “\nCome, Ye Disconsolate\n,”\nHymns\n, no. 115.\nHelp others take responsibility for their own learning.\nSometimes it seems like the easiest way to teach is to just tell learners what we think they should know. However, the easiest way is not always the best way. Elder David A. Bednar taught: “Our intent ought not to be ‘What do I tell them?’ Instead, the questions to ask ourselves are ‘What can I invite them to do? What inspired questions can I ask that, if they are willing to respond, will begin to invite the Holy Ghost into their lives?’” (\nevening with a General Authority\n, Feb. 7, 2020, broadcasts.ChurchofJesusChrist.org; see also\nTeaching in the Savior’s Way\n,\n25\n). There are many ways to help learners take responsibility for their learning. For example, in this outline learners are invited to search, ponder, make lists, look at pictures, participate in object lessons, draw, and share and apply what they learn.\nIdeas for Teaching Children\nJeremiah 31:3\nHeavenly Father and Jesus love me “with an everlasting love.”\nAs you read\nJeremiah 31:3\nwith your children, they could help you find objects (or pictures of objects) that last a long time, such as a metal coin, and some that do not, such as a piece of fruit. You could talk about what “everlasting” means and share with each other how you have felt Heavenly Father’s “everlasting love.” You could also sing together a song like “\nGod Is Watching Over All\n” (\nChildren’s Songbook\n, 229).\nJeremiah 31:31–34\n;\n32:38–41\nGod will help me keep my covenants.\nYour children might enjoy drawing a heart on a piece of paper and then writing in the heart things they learn from\nJeremiah 31:31–34\nabout making covenants with God. You may want to review the covenant they make at baptism (see\nMosiah 18:10, 13\n) and discuss what it means to have these promises written in their hearts.\nJeremiah 36:1–4\nThe scriptures are the word of God.\nThis week’s activity page could help your children learn about Jeremiah, Baruch, and the king (see\nJeremiah 36\n). They could also do actions that go along with the words in\nJeremiah 36:4–10\n, such as writing in a book (see\nverse 4\n) and reading the scriptures to the people (see\nverses 8, 10\n).\nYou and your children could look at a children’s book and a copy of the scriptures and talk about how these books are different. What makes the scriptures special? It may be inspiring to share with each other some scripture passages that are special to you.\nJeremiah 38:6–13\nI can stand up for what is right.\nYou could use the picture at the end of the outline to help your children visualize the story of Ebed-melech in\nJeremiah 38:6–13\n. Maybe you could help them find a verse where Ebed-melech did something brave to help the Lord’s prophet. What can we do to show that we know our prophet today is called of God?\nLamentations 1:1–2, 16\n;\n3:22–26\nThe Savior made it possible for me to be forgiven of my sins.\nTo introduce Lamentations, you may want to explain to your children that because the Israelites had not repented, Jerusalem and the temple were destroyed. You could share with each other how you might have felt if you were living there at that time (see\nLamentations 1:1–2, 16\n). How might the message in\nLamentations 3:22–26\nhave given you hope?\nYou could also tell each other about times you felt sad about a bad choice you made. What do we find in\nLamentations 3:22–26\nthat helps us understand the forgiveness Jesus Christ offers?\nFor more, see this month’s issue of the\nFriend\nmagazine.\nI Will Surely Deliver Thee (Jeremiah 39:18)\n, by Eva Timothy\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Jeremiah 31",
      "title": "Jeremiah 31",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/31?lang=eng",
      "summary": "In the last days, Israel will be gatheredâThe Lord declares that Ephraim has the birthright as the firstbornâThe Lord will make a new covenant with Israel, to be inscribed in the heartâThen all Israel will know the Lord.",
      "verses": [
        "1At the same time, saith theLord, will I be the God of all thefamiliesof Israel, and they shall be my people.",
        "2Thus saith theLord, The peoplewhich wereleft of the sword found grace in the wilderness;evenIsrael, when I went to cause him to rest.",
        "3TheLordhath appearedof oldunto me,saying,Yea, I havelovedthee with an everlastinglove: therefore with lovingkindness have Idrawn thee.",
        "4Again I will build thee, and thou shalt be built, O virgin of Israel: thou shalt again be adorned with thy tabrets, and shalt go forth in the dances of them that make merry.",
        "5Thou shalt yet plant vines upon the mountains of Samaria: the planters shall plant, and shall eatthemas common things.",
        "6For there shall be a day,thatthewatchmenupon the mount Ephraim shall cry, Arise ye, and let us go up toZionunto theLordour God.",
        "7For thus saith theLord; Sing with gladness for Jacob, and shout among the chief of the nations: publish ye, praise ye, and say, OLord,savethy people, the remnant of Israel.",
        "8Behold, I will bring them from thenorthcountry, and gather them from thecoastsof the earth,andwith them the blind and the lame, the woman with child and her that travaileth with child together: a great company shall return thither.",
        "9They shall come withweeping, and with supplications will I lead them: I will cause them to walk by the rivers of waters in a straightway, wherein they shall not stumble: for I am afatherto Israel, andEphraimismyfirstborn.",
        "10Â¶Hear the word of theLord, O ye nations, and declareitin the isles afar off, and say, He that scattered Israel willgatherhim, and keep him, as a shepherddothhis flock.",
        "11For theLordhath redeemed Jacob, andransomedhim from the hand ofhim that wasstronger than he.",
        "12Therefore they shall come and sing in the height of Zion, and shall flow together to the goodness of theLord, for wheat, and for wine, and for oil, and for the young of the flock and of the herd: and their soul shall be as a watered garden; and they shall notsorrowany more at all.",
        "13Then shall the virgin rejoice in the dance, both young men and old together: for I will turn theirmourninginto joy, and will comfort them, and make them rejoice from their sorrow.",
        "14And I will satiate the soul of the priests with fatness, and my people shall be satisfied with mygoodness, saith theLord.",
        "15Â¶Thus saith theLord; A voice was heard inRamah, lamentation,andbitter weeping; Rahel weeping for her children refused to be comforted for her children, because theywerenot.",
        "16Thus saith theLord; Refrain thy voice from weeping, and thine eyes from tears: for thy work shall berewarded, saith theLord; and they shall come again from the land of the enemy.",
        "17And there is hopeinthineend, saith theLord, that thy children shall come again to their own border.",
        "18Â¶I have surely heard Ephraim bemoaning himselfthus;Thou hast chastised me, and I was chastised, as a bullock unaccustomedto the yoke:turnthou me, and I shall be turned; for thouarttheLordmy God.",
        "19Surelyafterthat I was turned, I repented; and after that I was instructed, I smote uponmythigh: I was ashamed, yea, even confounded, because I did bear the reproach of my youth.",
        "20IsEphraim my dear son?is hea pleasant child? for since I spake against him, I do earnestly remember him still: therefore my bowels are troubled for him; I will surely have mercy upon him, saith theLord.",
        "21Set thee up waymarks, make theehigh heaps: set thine heart toward the highway,eventhe waywhichthou wentest: turn again, O virgin of Israel, turn again to these thy cities.",
        "22Â¶How long wilt thou go about, O thoubackslidingdaughter? for theLordhath created a new thing in the earth, A woman shall compass a man.",
        "23Thus saith theLordof hosts, the God of Israel; As yet they shall use this speech in the land of Judah and in the cities thereof, when I shall bring again their captivity; TheLordbless thee, O habitation of justice,andmountain of holiness.",
        "24And there shall dwell in Judah itself, and in all the cities thereof together, husbandmen, and theythatgo forth with flocks.",
        "25For I have satiated the weary soul, and I have replenished every sorrowful soul.",
        "26Upon this I awaked, and beheld; and my sleep was sweet unto me.",
        "27Â¶Behold, the days come, saith theLord, that I will sow the house of Israel and the house of Judahwith the seed of man, and with the seed of beast.",
        "28And it shall come to pass,thatlike as I havewatchedover them, topluckup, and tobreakdown, and to throw down, and to destroy, and to afflict; so will Iwatchover them, to build, and to plant, saith theLord.",
        "29In those days they shall say no more, The fathers have eaten a sourgrape, and the childrenâs teeth are set on edge.",
        "30But every one shalldiefor his owniniquity: every man that eateth the sour grape, his teeth shall be set on edge.",
        "31Â¶Behold, the days come, saith theLord, that I will make anewcovenantwith the house ofIsrael, and with the house of Judah:",
        "32Not according to thecovenantthat I made with their fathers in the daythatI took them by the hand to bring them out of the land of Egypt; which my covenant they brake, although I was an husband unto them, saith theLord:",
        "33But thisshall bethecovenantthat I will make with the house of Israel; After those days, saith theLord, I will put mylawin their inward parts, and write it in theirhearts; and will be their God, and they shall be my people.",
        "34And they shall teach no more every man his neighbour, and every man his brother, saying, Know theLord: for they shall allknowme, from the least of them unto the greatest of them, saith theLord: for I will forgive theiriniquity, and I will remember their sin no more.",
        "35Â¶Thus saith theLord, which giveth thesunfor a light byday,andtheordinancesof the moon and of the stars for a light by night, which divideth the sea when the waves thereof roar; TheLordof hostsishis name:",
        "36If thoseordinancesdepart from before me, saith theLord,thenthe seed of Israel also shall cease from being a nation before me for ever.",
        "37Thus saith theLord; If heaven above can be measured, and the foundations of the earth searched out beneath, I will also cast off all the seed of Israel for all that they have done, saith theLord.",
        "38Â¶Behold, the days come, saith theLord, that the city shall bebuiltto theLordfrom the tower of Hananeel unto the gate of the corner.",
        "39And the measuringlineshall yet go forth over against it upon the hill Gareb, and shall compass about to Goath.",
        "40And the whole valley of the dead bodies, and of the ashes, and all the fields unto the brook of Kidron, unto the corner of the horse gate toward the east,shall beholyunto theLord; it shall not be plucked up, nor thrown down any more for ever."
      ],
      "full_text": "1At the same time, saith theLord, will I be the God of all thefamiliesof Israel, and they shall be my people. 2Thus saith theLord, The peoplewhich wereleft of the sword found grace in the wilderness;evenIsrael, when I went to cause him to rest. 3TheLordhath appearedof oldunto me,saying,Yea, I havelovedthee with an everlastinglove: therefore with lovingkindness have Idrawn thee. 4Again I will build thee, and thou shalt be built, O virgin of Israel: thou shalt again be adorned with thy tabrets, and shalt go forth in the dances of them that make merry. 5Thou shalt yet plant vines upon the mountains of Samaria: the planters shall plant, and shall eatthemas common things. 6For there shall be a day,thatthewatchmenupon the mount Ephraim shall cry, Arise ye, and let us go up toZionunto theLordour God. 7For thus saith theLord; Sing with gladness for Jacob, and shout among the chief of the nations: publish ye, praise ye, and say, OLord,savethy people, the remnant of Israel. 8Behold, I will bring them from thenorthcountry, and gather them from thecoastsof the earth,andwith them the blind and the lame, the woman with child and her that travaileth with child together: a great company shall return thither. 9They shall come withweeping, and with supplications will I lead them: I will cause them to walk by the rivers of waters in a straightway, wherein they shall not stumble: for I am afatherto Israel, andEphraimismyfirstborn. 10Â¶Hear the word of theLord, O ye nations, and declareitin the isles afar off, and say, He that scattered Israel willgatherhim, and keep him, as a shepherddothhis flock. 11For theLordhath redeemed Jacob, andransomedhim from the hand ofhim that wasstronger than he. 12Therefore they shall come and sing in the height of Zion, and shall flow together to the goodness of theLord, for wheat, and for wine, and for oil, and for the young of the flock and of the herd: and their soul shall be as a watered garden; and they shall notsorrowany more at all. 13Then shall the virgin rejoice in the dance, both young men and old together: for I will turn theirmourninginto joy, and will comfort them, and make them rejoice from their sorrow. 14And I will satiate the soul of the priests with fatness, and my people shall be satisfied with mygoodness, saith theLord. 15Â¶Thus saith theLord; A voice was heard inRamah, lamentation,andbitter weeping; Rahel weeping for her children refused to be comforted for her children, because theywerenot. 16Thus saith theLord; Refrain thy voice from weeping, and thine eyes from tears: for thy work shall berewarded, saith theLord; and they shall come again from the land of the enemy. 17And there is hopeinthineend, saith theLord, that thy children shall come again to their own border. 18Â¶I have surely heard Ephraim bemoaning himselfthus;Thou hast chastised me, and I was chastised, as a bullock unaccustomedto the yoke:turnthou me, and I shall be turned; for thouarttheLordmy God. 19Surelyafterthat I was turned, I repented; and after that I was instructed, I smote uponmythigh: I was ashamed, yea, even confounded, because I did bear the reproach of my youth. 20IsEphraim my dear son?is hea pleasant child? for since I spake against him, I do earnestly remember him still: therefore my bowels are troubled for him; I will surely have mercy upon him, saith theLord. 21Set thee up waymarks, make theehigh heaps: set thine heart toward the highway,eventhe waywhichthou wentest: turn again, O virgin of Israel, turn again to these thy cities. 22Â¶How long wilt thou go about, O thoubackslidingdaughter? for theLordhath created a new thing in the earth, A woman shall compass a man. 23Thus saith theLordof hosts, the God of Israel; As yet they shall use this speech in the land of Judah and in the cities thereof, when I shall bring again their captivity; TheLordbless thee, O habitation of justice,andmountain of holiness. 24And there shall dwell in Judah itself, and in all the cities thereof together, husbandmen, and theythatgo forth with flocks. 25For I have satiated the weary soul, and I have replenished every sorrowful soul. 26Upon this I awaked, and beheld; and my sleep was sweet unto me. 27Â¶Behold, the days come, saith theLord, that I will sow the house of Israel and the house of Judahwith the seed of man, and with the seed of beast. 28And it shall come to pass,thatlike as I havewatchedover them, topluckup, and tobreakdown, and to throw down, and to destroy, and to afflict; so will Iwatchover them, to build, and to plant, saith theLord. 29In those days they shall say no more, The fathers have eaten a sourgrape, and the childrenâs teeth are set on edge. 30But every one shalldiefor his owniniquity: every man that eateth the sour grape, his teeth shall be set on edge. 31Â¶Behold, the days come, saith theLord, that I will make anewcovenantwith the house ofIsrael, and with the house of Judah: 32Not according to thecovenantthat I made with their fathers in the daythatI took them by the hand to bring them out of the land of Egypt; which my covenant they brake, although I was an husband unto them, saith theLord: 33But thisshall bethecovenantthat I will make with the house of Israel; After those days, saith theLord, I will put mylawin their inward parts, and write it in theirhearts; and will be their God, and they shall be my people. 34And they shall teach no more every man his neighbour, and every man his brother, saying, Know theLord: for they shall allknowme, from the least of them unto the greatest of them, saith theLord: for I will forgive theiriniquity, and I will remember their sin no more. 35Â¶Thus saith theLord, which giveth thesunfor a light byday,andtheordinancesof the moon and of the stars for a light by night, which divideth the sea when the waves thereof roar; TheLordof hostsishis name: 36If thoseordinancesdepart from before me, saith theLord,thenthe seed of Israel also shall cease from being a nation before me for ever. 37Thus saith theLord; If heaven above can be measured, and the foundations of the earth searched out beneath, I will also cast off all the seed of Israel for all that they have done, saith theLord. 38Â¶Behold, the days come, saith theLord, that the city shall bebuiltto theLordfrom the tower of Hananeel unto the gate of the corner. 39And the measuringlineshall yet go forth over against it upon the hill Gareb, and shall compass about to Goath. 40And the whole valley of the dead bodies, and of the ashes, and all the fields unto the brook of Kidron, unto the corner of the horse gate toward the east,shall beholyunto theLord; it shall not be plucked up, nor thrown down any more for ever."
    },
    {
      "reference": "Jeremiah 32",
      "title": "Jeremiah 32",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/32?lang=eng",
      "summary": "Jeremiah is imprisoned by ZedekiahâThe prophet purchases land to symbolize the return of Israel to their landâThe Lord will gather Israel and make an everlasting covenant with them.",
      "verses": [
        "1The word that came to Jeremiah from theLordin the tenth year of Zedekiah king of Judah, whichwasthe eighteenth year of Nebuchadrezzar.",
        "2For then the king of Babylonâs armybesiegedJerusalem: and Jeremiah the prophet was shut up in the court of the prison, whichwasin the king of Judahâs house.",
        "3For Zedekiah king of Judah had shut him up, saying, Wherefore dost thou prophesy, and say, Thus saith theLord, Behold, I will give this city into the hand of the king of Babylon, and he shall take it;",
        "4And Zedekiah king of Judah shall not escape out of the hand of the Chaldeans, but shall surely be delivered into the hand of the king of Babylon, and shall speak with him mouth to mouth, and his eyes shall behold his eyes;",
        "5And he shall lead Zedekiah toBabylon, and there shall he be until I visit him, saith theLord: though ye fight with the Chaldeans, ye shall not prosper?",
        "6Â¶And Jeremiah said, The word of theLordcame unto me, saying,",
        "7Behold, Hanameel the son of Shallum thine uncle shall come unto thee, saying, Buy thee my field thatisin Anathoth: for the right of redemptionisthine to buyit.",
        "8So Hanameel mine uncleâs son came to me in the court of the prison according to the word of theLord, and said unto me, Buy my field, I pray thee, thatisin Anathoth, whichisin the country of Benjamin: for the right of inheritanceisthine, and the redemptionisthine; buyitfor thyself. Then I knew that thiswasthe word of theLord.",
        "9And I bought the field of Hanameel my uncleâs son, thatwasin Anathoth, andweighedhim the money,evenseventeen shekels of silver.",
        "10And I subscribed the evidence, and sealedit,and took witnesses, and weighedhimthe money in the balances.",
        "11So I took the evidence of the purchase,boththat which was sealedaccordingto the law and custom, and that which was open:",
        "12And I gave the evidence of the purchase untoBaruchthe son of Neriah, the son of Maaseiah, in the sight of Hanameel mine uncleâsson,and in the presence of the witnesses that subscribed thebookof the purchase, before all the Jews that sat in the court of the prison.",
        "13Â¶And I charged Baruch before them, saying,",
        "14Thus saith theLordof hosts, the God of Israel; Take theseevidences, this evidence of the purchase, both which is sealed, and this evidence which is open; and put them in an earthen vessel, that they may continue many days.",
        "15For thus saith theLordof hosts, the God of Israel; Houses and fields and vineyards shall be possessed again in this land.",
        "16Â¶Now when I had delivered the evidence of the purchase unto Baruch the son of Neriah, I prayed unto theLord, saying,",
        "17Ah LordGod! behold, thou hast made the heaven and the earth by thy great power and stretched out arm,andthere is nothing toohardfor thee:",
        "18Thou shewest lovingkindness unto thousands, and recompensest the iniquity of the fathers into the bosom of their children after them: the Great, the Mighty God, theLordof hosts,ishis name,",
        "19Great in counsel, and mighty in work: for thine eyesareopen upon all the ways of the sons of men: togiveevery one according to hisways, and according to the fruit of his doings:",
        "20Which hast set signs and wonders in the land of Egypt,evenunto this day, and in Israel, and amongothermen; and hast made thee a name, as at this day;",
        "21And hast brought forth thy people Israel out of the land of Egypt with signs, and with wonders, and with a strong hand, and with a stretched out arm, and with great terror;",
        "22And hast given them this land, which thou didst swear to their fathers to give them, a land flowing with milk and honey;",
        "23And they came in, and possessed it; but they obeyed not thy voice, neither walked in thy law; they have done nothing of all that thou commandedst them to do: therefore thou hast caused all this evil to come upon them:",
        "24Behold the mounts, they are come unto the city to take it; and the city is given into the hand of the Chaldeans, that fight against it, because of the sword, and of the famine, and of the pestilence: and what thou hast spoken is come to pass; and, behold, thou seestit.",
        "25And thou hast said unto me, O LordGod, Buy thee the field for money, and take witnesses; for the city is given into the hand of the Chaldeans.",
        "26Â¶Then came the word of theLordunto Jeremiah, saying,",
        "27Behold, IamtheLord, the God of all flesh: is there any thing too hard for me?",
        "28Therefore thus saith theLord; Behold, I will give this city into the hand of the Chaldeans, and into the hand of Nebuchadrezzar king of Babylon, and he shall take it:",
        "29And the Chaldeans, that fight against this city, shall come and set fire on this city, and burn it with the houses, upon whoseroofsthey have offered incense unto Baal, and poured out drink offerings unto other gods, to provoke me to anger.",
        "30For the children of Israel and the children of Judah have only done evil before me from their youth: for the children of Israel have only provoked me toangerwith the work of their hands, saith theLord.",
        "31For this city hath been to measa provocation of mine anger and of my fury from the day that they built it even unto this day; that I should remove it from before my face,",
        "32Because of all the evil of the children of Israel and of the children of Judah, which they have done to provoke me to anger, they, their kings, their princes, their priests, and their prophets, and the men of Judah, and the inhabitants of Jerusalem.",
        "33And they have turned unto me theback, and not the face: though I taught them, rising up early and teachingthem,yet they have not hearkened to receive instruction.",
        "34But they set their abominations inthe house, which is called by my name, to defile it.",
        "35And they built the high places of Baal, whicharein the valley of the son of Hinnom, to cause their sons and their daughters to pass throughthefireunto Molech; which I commanded them not, neither came it into my mind, that they should do this abomination, to cause Judah to sin.",
        "36Â¶And now therefore thus saith theLord, the God of Israel, concerning this city, whereof ye say, It shall be delivered into the hand of the king of Babylon by the sword, and by the famine, and by the pestilence;",
        "37Behold, I willgatherthem out of all countries, whither I have driven them in mine anger, and in my fury, and in great wrath; and I willbringthem again unto this place, and I will cause them to dwell safely:",
        "38And they shall be my people, and I will be their God:",
        "39And I will give them oneheart, and one way, that they may fear mefor ever, for thegoodof them, and of their children after them:",
        "40And I will make aneverlastingcovenantwith them, that I will not turn away from them, to do them good; but I will put my fear in their hearts, that they shall not depart from me.",
        "41Yea, I will rejoice over them to do them good, and I will plant them in this land assuredly with my whole heart and with my whole soul.",
        "42For thus saith theLord; Like as I have brought all this great evil upon this people, so will I bring upon them all the good that I have promised them.",
        "43And fields shall be bought in this land, whereof ye say,It isdesolate without man or beast; it is given into the hand of the Chaldeans.",
        "44Men shall buy fields for money, and subscribe evidences, andsealthem,and take witnesses in the land of Benjamin, and in the places about Jerusalem, and in the cities of Judah, and in the cities of the mountains, and in the cities of thevalley, and in the cities of the south: for I will cause theircaptivityto return, saith theLord."
      ],
      "full_text": "1The word that came to Jeremiah from theLordin the tenth year of Zedekiah king of Judah, whichwasthe eighteenth year of Nebuchadrezzar. 2For then the king of Babylonâs armybesiegedJerusalem: and Jeremiah the prophet was shut up in the court of the prison, whichwasin the king of Judahâs house. 3For Zedekiah king of Judah had shut him up, saying, Wherefore dost thou prophesy, and say, Thus saith theLord, Behold, I will give this city into the hand of the king of Babylon, and he shall take it; 4And Zedekiah king of Judah shall not escape out of the hand of the Chaldeans, but shall surely be delivered into the hand of the king of Babylon, and shall speak with him mouth to mouth, and his eyes shall behold his eyes; 5And he shall lead Zedekiah toBabylon, and there shall he be until I visit him, saith theLord: though ye fight with the Chaldeans, ye shall not prosper? 6Â¶And Jeremiah said, The word of theLordcame unto me, saying, 7Behold, Hanameel the son of Shallum thine uncle shall come unto thee, saying, Buy thee my field thatisin Anathoth: for the right of redemptionisthine to buyit. 8So Hanameel mine uncleâs son came to me in the court of the prison according to the word of theLord, and said unto me, Buy my field, I pray thee, thatisin Anathoth, whichisin the country of Benjamin: for the right of inheritanceisthine, and the redemptionisthine; buyitfor thyself. Then I knew that thiswasthe word of theLord. 9And I bought the field of Hanameel my uncleâs son, thatwasin Anathoth, andweighedhim the money,evenseventeen shekels of silver. 10And I subscribed the evidence, and sealedit,and took witnesses, and weighedhimthe money in the balances. 11So I took the evidence of the purchase,boththat which was sealedaccordingto the law and custom, and that which was open: 12And I gave the evidence of the purchase untoBaruchthe son of Neriah, the son of Maaseiah, in the sight of Hanameel mine uncleâsson,and in the presence of the witnesses that subscribed thebookof the purchase, before all the Jews that sat in the court of the prison. 13Â¶And I charged Baruch before them, saying, 14Thus saith theLordof hosts, the God of Israel; Take theseevidences, this evidence of the purchase, both which is sealed, and this evidence which is open; and put them in an earthen vessel, that they may continue many days. 15For thus saith theLordof hosts, the God of Israel; Houses and fields and vineyards shall be possessed again in this land. 16Â¶Now when I had delivered the evidence of the purchase unto Baruch the son of Neriah, I prayed unto theLord, saying, 17Ah LordGod! behold, thou hast made the heaven and the earth by thy great power and stretched out arm,andthere is nothing toohardfor thee: 18Thou shewest lovingkindness unto thousands, and recompensest the iniquity of the fathers into the bosom of their children after them: the Great, the Mighty God, theLordof hosts,ishis name, 19Great in counsel, and mighty in work: for thine eyesareopen upon all the ways of the sons of men: togiveevery one according to hisways, and according to the fruit of his doings: 20Which hast set signs and wonders in the land of Egypt,evenunto this day, and in Israel, and amongothermen; and hast made thee a name, as at this day; 21And hast brought forth thy people Israel out of the land of Egypt with signs, and with wonders, and with a strong hand, and with a stretched out arm, and with great terror; 22And hast given them this land, which thou didst swear to their fathers to give them, a land flowing with milk and honey; 23And they came in, and possessed it; but they obeyed not thy voice, neither walked in thy law; they have done nothing of all that thou commandedst them to do: therefore thou hast caused all this evil to come upon them: 24Behold the mounts, they are come unto the city to take it; and the city is given into the hand of the Chaldeans, that fight against it, because of the sword, and of the famine, and of the pestilence: and what thou hast spoken is come to pass; and, behold, thou seestit. 25And thou hast said unto me, O LordGod, Buy thee the field for money, and take witnesses; for the city is given into the hand of the Chaldeans. 26Â¶Then came the word of theLordunto Jeremiah, saying, 27Behold, IamtheLord, the God of all flesh: is there any thing too hard for me? 28Therefore thus saith theLord; Behold, I will give this city into the hand of the Chaldeans, and into the hand of Nebuchadrezzar king of Babylon, and he shall take it: 29And the Chaldeans, that fight against this city, shall come and set fire on this city, and burn it with the houses, upon whoseroofsthey have offered incense unto Baal, and poured out drink offerings unto other gods, to provoke me to anger. 30For the children of Israel and the children of Judah have only done evil before me from their youth: for the children of Israel have only provoked me toangerwith the work of their hands, saith theLord. 31For this city hath been to measa provocation of mine anger and of my fury from the day that they built it even unto this day; that I should remove it from before my face, 32Because of all the evil of the children of Israel and of the children of Judah, which they have done to provoke me to anger, they, their kings, their princes, their priests, and their prophets, and the men of Judah, and the inhabitants of Jerusalem. 33And they have turned unto me theback, and not the face: though I taught them, rising up early and teachingthem,yet they have not hearkened to receive instruction. 34But they set their abominations inthe house, which is called by my name, to defile it. 35And they built the high places of Baal, whicharein the valley of the son of Hinnom, to cause their sons and their daughters to pass throughthefireunto Molech; which I commanded them not, neither came it into my mind, that they should do this abomination, to cause Judah to sin. 36Â¶And now therefore thus saith theLord, the God of Israel, concerning this city, whereof ye say, It shall be delivered into the hand of the king of Babylon by the sword, and by the famine, and by the pestilence; 37Behold, I willgatherthem out of all countries, whither I have driven them in mine anger, and in my fury, and in great wrath; and I willbringthem again unto this place, and I will cause them to dwell safely: 38And they shall be my people, and I will be their God: 39And I will give them oneheart, and one way, that they may fear mefor ever, for thegoodof them, and of their children after them: 40And I will make aneverlastingcovenantwith them, that I will not turn away from them, to do them good; but I will put my fear in their hearts, that they shall not depart from me. 41Yea, I will rejoice over them to do them good, and I will plant them in this land assuredly with my whole heart and with my whole soul. 42For thus saith theLord; Like as I have brought all this great evil upon this people, so will I bring upon them all the good that I have promised them. 43And fields shall be bought in this land, whereof ye say,It isdesolate without man or beast; it is given into the hand of the Chaldeans. 44Men shall buy fields for money, and subscribe evidences, andsealthem,and take witnesses in the land of Benjamin, and in the places about Jerusalem, and in the cities of Judah, and in the cities of the mountains, and in the cities of thevalley, and in the cities of the south: for I will cause theircaptivityto return, saith theLord."
    },
    {
      "reference": "Jeremiah 33",
      "title": "Jeremiah 33",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/33?lang=eng",
      "summary": "Judah and Israel will be gatheredâThe Branch of Righteousness (the Messiah) is promisedâThe Seed of David (the Messiah) will reign forever.",
      "verses": [
        "1Moreover the word of theLordcame unto Jeremiah the second time, while he was yet shut up in the court of the prison, saying,",
        "2Thus saith theLordthe maker thereof, theLordthat formed it, to establish it; theLordishis name;",
        "3Call unto me, and I will answer thee, andshewthee great and mighty things, which thou knowest not.",
        "4For thus saith theLord, the God of Israel, concerning the houses of this city, and concerning the houses of the kings of Judah, which are thrown down by the mounts, and by the sword;",
        "5They come to fight with the Chaldeans, butit isto fill them with the dead bodies of men, whom I have slain in mine anger and in my fury, and for all whose wickedness I have hid my face from this city.",
        "6Behold, I will bring it health and cure, and I will cure them, and will reveal unto them the abundance of peace and truth.",
        "7And I will cause the captivity of Judah and the captivity of Israel toreturn, and will build them, as at the first.",
        "8And I willcleansethem from all their iniquity, whereby they have sinned against me; and I will pardon all their iniquities, whereby they have sinned, and whereby they have transgressed against me.",
        "9Â¶And it shall be to me a name of joy, apraiseand an honour before all the nations of the earth, which shall hear all the good that I do unto them: and they shall fear and tremble for all the goodness and for all the prosperity that I procure unto it.",
        "10Thus saith theLord; Again there shall be heard in this place, which ye sayshall bedesolate without man and without beast,evenin the cities of Judah, and in the streets of Jerusalem, that are desolate, without man, and without inhabitant, and without beast,",
        "11The voice of joy, and the voice of gladness, the voice of the bridegroom, and the voice of the bride, the voice of them that shall say, Praise theLordof hosts: for theLordisgood; for his mercyendurethfor ever:andof them that shall bring the sacrifice of praise into the house of theLord. For I will cause toreturn the captivity of the land, as at the first, saith theLord.",
        "12Thus saith theLordof hosts; Again in this place, which is desolate without man and without beast, and in all the cities thereof, shall be an habitation of shepherds causingtheirflocks tolie down.",
        "13In the cities of the mountains, in the cities of the vale, and in the cities of the south, and in the land of Benjamin, and in the places about Jerusalem, and in the cities of Judah, shall the flocks pass again under the hands of him thattelleththem,saith theLord.",
        "14Behold, the days come, saith theLord, that I willperformthat good thing which I havepromisedunto the house of Israel and to the house of Judah.",
        "15Â¶In those days, and at that time, will I cause theBranchof righteousness to grow up untoDavid; and he shallexecute judgmentand righteousness in theland.",
        "16In those days shall Judah be saved, and Jerusalem shall dwell safely: and thisis the namewherewith she shall be called, TheLordour righteousness.",
        "17Â¶For thus saith theLord; David shall neverwanta man to sit upon the throne of the house of Israel;",
        "18Neither shall the priests the Levites want a man before me to offer burnt offerings, and to kindle meat offerings, and to do sacrifice continually.",
        "19Â¶And the word of theLordcame unto Jeremiah, saying,",
        "20Thus saith theLord; If ye can break my covenant of the day, and my covenant of the night, and that there should not be day andnightin their season;",
        "21Thenmay also my covenant be broken with David my servant, that he should not have a son to reign upon his throne; and with the Levites the priests, my ministers.",
        "22As the host of heaven cannot be numbered, neither the sand of the sea measured: so will I multiply the seed of David my servant, and the Levites that minister unto me.",
        "23Moreover the word of theLordcame to Jeremiah, saying,",
        "24Considerest thou not what this people have spoken, saying, The two families which theLordhath chosen, he hath even cast them off? thus they have despised my people, that they should be no more a nation before them.",
        "25Thus saith theLord; If my covenantbenot with day and night,and ifI have not appointed the ordinances of heaven and earth;",
        "26Then will I cast away the seed of Jacob, and David my servant,sothat I will not takeanyof his seedto berulers over the seed of Abraham, Isaac, and Jacob: for I will cause their captivity to return, and have mercy on them."
      ],
      "full_text": "1Moreover the word of theLordcame unto Jeremiah the second time, while he was yet shut up in the court of the prison, saying, 2Thus saith theLordthe maker thereof, theLordthat formed it, to establish it; theLordishis name; 3Call unto me, and I will answer thee, andshewthee great and mighty things, which thou knowest not. 4For thus saith theLord, the God of Israel, concerning the houses of this city, and concerning the houses of the kings of Judah, which are thrown down by the mounts, and by the sword; 5They come to fight with the Chaldeans, butit isto fill them with the dead bodies of men, whom I have slain in mine anger and in my fury, and for all whose wickedness I have hid my face from this city. 6Behold, I will bring it health and cure, and I will cure them, and will reveal unto them the abundance of peace and truth. 7And I will cause the captivity of Judah and the captivity of Israel toreturn, and will build them, as at the first. 8And I willcleansethem from all their iniquity, whereby they have sinned against me; and I will pardon all their iniquities, whereby they have sinned, and whereby they have transgressed against me. 9Â¶And it shall be to me a name of joy, apraiseand an honour before all the nations of the earth, which shall hear all the good that I do unto them: and they shall fear and tremble for all the goodness and for all the prosperity that I procure unto it. 10Thus saith theLord; Again there shall be heard in this place, which ye sayshall bedesolate without man and without beast,evenin the cities of Judah, and in the streets of Jerusalem, that are desolate, without man, and without inhabitant, and without beast, 11The voice of joy, and the voice of gladness, the voice of the bridegroom, and the voice of the bride, the voice of them that shall say, Praise theLordof hosts: for theLordisgood; for his mercyendurethfor ever:andof them that shall bring the sacrifice of praise into the house of theLord. For I will cause toreturn the captivity of the land, as at the first, saith theLord. 12Thus saith theLordof hosts; Again in this place, which is desolate without man and without beast, and in all the cities thereof, shall be an habitation of shepherds causingtheirflocks tolie down. 13In the cities of the mountains, in the cities of the vale, and in the cities of the south, and in the land of Benjamin, and in the places about Jerusalem, and in the cities of Judah, shall the flocks pass again under the hands of him thattelleththem,saith theLord. 14Behold, the days come, saith theLord, that I willperformthat good thing which I havepromisedunto the house of Israel and to the house of Judah. 15Â¶In those days, and at that time, will I cause theBranchof righteousness to grow up untoDavid; and he shallexecute judgmentand righteousness in theland. 16In those days shall Judah be saved, and Jerusalem shall dwell safely: and thisis the namewherewith she shall be called, TheLordour righteousness. 17Â¶For thus saith theLord; David shall neverwanta man to sit upon the throne of the house of Israel; 18Neither shall the priests the Levites want a man before me to offer burnt offerings, and to kindle meat offerings, and to do sacrifice continually. 19Â¶And the word of theLordcame unto Jeremiah, saying, 20Thus saith theLord; If ye can break my covenant of the day, and my covenant of the night, and that there should not be day andnightin their season; 21Thenmay also my covenant be broken with David my servant, that he should not have a son to reign upon his throne; and with the Levites the priests, my ministers. 22As the host of heaven cannot be numbered, neither the sand of the sea measured: so will I multiply the seed of David my servant, and the Levites that minister unto me. 23Moreover the word of theLordcame to Jeremiah, saying, 24Considerest thou not what this people have spoken, saying, The two families which theLordhath chosen, he hath even cast them off? thus they have despised my people, that they should be no more a nation before them. 25Thus saith theLord; If my covenantbenot with day and night,and ifI have not appointed the ordinances of heaven and earth; 26Then will I cast away the seed of Jacob, and David my servant,sothat I will not takeanyof his seedto berulers over the seed of Abraham, Isaac, and Jacob: for I will cause their captivity to return, and have mercy on them."
    },
    {
      "reference": "Jeremiah 36",
      "title": "Jeremiah 36",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/36?lang=eng",
      "summary": "Baruch writes the prophecies of Jeremiah and reads them in the house of the LordâJehoiakim, the king, burns the book, and judgment comes upon himâJeremiah dictates the prophecies again and adds many more.",
      "verses": [
        "1And it came to pass in the fourth year of Jehoiakim the son of Josiah king of Judah,thatthis word came unto Jeremiah from theLord, saying,",
        "2Take thee arollof a book, and write therein all the words that I have spoken unto thee against Israel, and against Judah, and against all the nations, from the day I spake unto thee, from the days of Josiah, even unto thisday.",
        "3It may be that the house of Judah will hear all the evil which I purpose to do unto them; that they may return every man from his evil way; that I may forgive their iniquity and their sin.",
        "4Then Jeremiah called Baruch the son of Neriah: andBaruchwrotefrom the mouth of Jeremiah all the words of theLord, which he had spoken unto him, upon a roll of a book.",
        "5And Jeremiah commanded Baruch, saying, Iamshut up; I cannot go into the house of theLord:",
        "6Therefore go thou, and read in the roll, which thou hast written from my mouth, the words of theLordin the ears of the people in theLordâs house upon thefastingday: and also thou shalt read them in the ears of all Judah that come out of their cities.",
        "7It may be they will present their supplication before theLord, and willreturnevery one from his evil way: for greatisthe anger and the fury that theLordhath pronounced against this people.",
        "8And Baruch the son of Neriah did according to all that Jeremiah the prophet commanded him, reading in the book the words of theLordin theLordâs house.",
        "9And it came to pass in the fifth year of Jehoiakim the son of Josiah king of Judah, in the ninth month,thatthey proclaimed a fast before theLordto all the people in Jerusalem, and to all the people that came from the cities of Judah unto Jerusalem.",
        "10Then read Baruch in the book the words of Jeremiah in the house of theLord, in the chamber of Gemariah the son ofShaphanthe scribe, in the higher court, at the entry of the new gate of theLordâs house, in the ears of all the people.",
        "11Â¶When Michaiah the son of Gemariah, the son of Shaphan, had heard out of the book all the words of theLord,",
        "12Then he went down into the kingâs house, into the scribeâs chamber: and, lo, all theprincessat there,evenElishama the scribe, and Delaiah the son of Shemaiah, andElnathanthe son of Achbor, and Gemariah the son of Shaphan, and Zedekiah the son of Hananiah, and all the princes.",
        "13Then Michaiah declared unto them all the words that he had heard, when Baruch read the book in the ears of the people.",
        "14Therefore all the princes sent Jehudi the son of Nethaniah, the son of Shelemiah, the son of Cushi, unto Baruch, saying, Take in thine hand the roll wherein thou hast read in the ears of the people, and come. So Baruch the son of Neriah took the roll in his hand, and came unto them.",
        "15And they said unto him, Sit down now, and read it in our ears. So Baruch readitin their ears.",
        "16Now it came to pass, when they had heard all the words, they wereafraidboth one and other, and said unto Baruch, We will surely tell the king of all these words.",
        "17And they asked Baruch, saying, Tell us now, How didst thou write all these words at his mouth?",
        "18Then Baruch answered them, He pronounced all these words unto me with his mouth, and I wrotethemwith ink in the book.",
        "19Then said the princes unto Baruch, Go, hide thee, thou and Jeremiah; and let no man know where ye be.",
        "20Â¶And they went in to the king into the court, but they laid up the roll in the chamber of Elishama the scribe, and told all the words in the ears of the king.",
        "21So the king sent Jehudi to fetch the roll: and he took it out of Elishama the scribeâs chamber. And Jehudi read it in the ears of the king, and in the ears of all the princes which stood beside the king.",
        "22Now the king sat in thewinterhousein the ninth month: andthere was a fireon the hearth burning before him.",
        "23And it came to pass,thatwhen Jehudi had read three or four leaves, he cut it with the penknife, and castitinto the fire thatwason the hearth, until all the roll was consumed in the fire thatwason the hearth.",
        "24Yet they were not afraid, nor rent their garments,neitherthe king, nor any of his servants that heard all these words.",
        "25Nevertheless Elnathan and Delaiah and Gemariah had made intercession to the king that he would not burn the roll: but he would not hear them.",
        "26But the king commanded Jerahmeel the son ofHammelech, and Seraiah the son of Azriel, and Shelemiah the son of Abdeel, to take Baruch the scribe and Jeremiah the prophet: but theLordhidthem.",
        "27Â¶Then the word of theLordcame to Jeremiah, after that the king had burned the roll, and the words which Baruch wrote at the mouth of Jeremiah, saying,",
        "28Take thee again another roll, andwritein it all the former words that were in the first roll, which Jehoiakim the king of Judah hath burned.",
        "29And thou shalt say to Jehoiakim king of Judah, Thus saith theLord; Thou hast burned this roll, saying, Why hast thou written therein, saying, The king of Babylon shall certainly come and destroy this land, and shall cause to cease from thence man and beast?",
        "30Therefore thus saith theLordof Jehoiakim king of Judah; He shall have none to sit upon the throne of David: and his dead body shallbe cast out in the day to the heat, and in the night to the frost.",
        "31And I will punish him and his seed and his servants for their iniquity; and I will bring upon them, and upon the inhabitants of Jerusalem, and upon the men of Judah, all the evil that I have pronounced against them; but they hearkened not.",
        "32Â¶Then took Jeremiah another roll, and gave it to Baruch thescribe, the son of Neriah; who wrote therein from the mouth of Jeremiah all the words of the book which Jehoiakim king of Judah had burned in the fire: and there wereaddedbesides unto them many like words."
      ],
      "full_text": "1And it came to pass in the fourth year of Jehoiakim the son of Josiah king of Judah,thatthis word came unto Jeremiah from theLord, saying, 2Take thee arollof a book, and write therein all the words that I have spoken unto thee against Israel, and against Judah, and against all the nations, from the day I spake unto thee, from the days of Josiah, even unto thisday. 3It may be that the house of Judah will hear all the evil which I purpose to do unto them; that they may return every man from his evil way; that I may forgive their iniquity and their sin. 4Then Jeremiah called Baruch the son of Neriah: andBaruchwrotefrom the mouth of Jeremiah all the words of theLord, which he had spoken unto him, upon a roll of a book. 5And Jeremiah commanded Baruch, saying, Iamshut up; I cannot go into the house of theLord: 6Therefore go thou, and read in the roll, which thou hast written from my mouth, the words of theLordin the ears of the people in theLordâs house upon thefastingday: and also thou shalt read them in the ears of all Judah that come out of their cities. 7It may be they will present their supplication before theLord, and willreturnevery one from his evil way: for greatisthe anger and the fury that theLordhath pronounced against this people. 8And Baruch the son of Neriah did according to all that Jeremiah the prophet commanded him, reading in the book the words of theLordin theLordâs house. 9And it came to pass in the fifth year of Jehoiakim the son of Josiah king of Judah, in the ninth month,thatthey proclaimed a fast before theLordto all the people in Jerusalem, and to all the people that came from the cities of Judah unto Jerusalem. 10Then read Baruch in the book the words of Jeremiah in the house of theLord, in the chamber of Gemariah the son ofShaphanthe scribe, in the higher court, at the entry of the new gate of theLordâs house, in the ears of all the people. 11Â¶When Michaiah the son of Gemariah, the son of Shaphan, had heard out of the book all the words of theLord, 12Then he went down into the kingâs house, into the scribeâs chamber: and, lo, all theprincessat there,evenElishama the scribe, and Delaiah the son of Shemaiah, andElnathanthe son of Achbor, and Gemariah the son of Shaphan, and Zedekiah the son of Hananiah, and all the princes. 13Then Michaiah declared unto them all the words that he had heard, when Baruch read the book in the ears of the people. 14Therefore all the princes sent Jehudi the son of Nethaniah, the son of Shelemiah, the son of Cushi, unto Baruch, saying, Take in thine hand the roll wherein thou hast read in the ears of the people, and come. So Baruch the son of Neriah took the roll in his hand, and came unto them. 15And they said unto him, Sit down now, and read it in our ears. So Baruch readitin their ears. 16Now it came to pass, when they had heard all the words, they wereafraidboth one and other, and said unto Baruch, We will surely tell the king of all these words. 17And they asked Baruch, saying, Tell us now, How didst thou write all these words at his mouth? 18Then Baruch answered them, He pronounced all these words unto me with his mouth, and I wrotethemwith ink in the book. 19Then said the princes unto Baruch, Go, hide thee, thou and Jeremiah; and let no man know where ye be. 20Â¶And they went in to the king into the court, but they laid up the roll in the chamber of Elishama the scribe, and told all the words in the ears of the king. 21So the king sent Jehudi to fetch the roll: and he took it out of Elishama the scribeâs chamber. And Jehudi read it in the ears of the king, and in the ears of all the princes which stood beside the king. 22Now the king sat in thewinterhousein the ninth month: andthere was a fireon the hearth burning before him. 23And it came to pass,thatwhen Jehudi had read three or four leaves, he cut it with the penknife, and castitinto the fire thatwason the hearth, until all the roll was consumed in the fire thatwason the hearth. 24Yet they were not afraid, nor rent their garments,neitherthe king, nor any of his servants that heard all these words. 25Nevertheless Elnathan and Delaiah and Gemariah had made intercession to the king that he would not burn the roll: but he would not hear them. 26But the king commanded Jerahmeel the son ofHammelech, and Seraiah the son of Azriel, and Shelemiah the son of Abdeel, to take Baruch the scribe and Jeremiah the prophet: but theLordhidthem. 27Â¶Then the word of theLordcame to Jeremiah, after that the king had burned the roll, and the words which Baruch wrote at the mouth of Jeremiah, saying, 28Take thee again another roll, andwritein it all the former words that were in the first roll, which Jehoiakim the king of Judah hath burned. 29And thou shalt say to Jehoiakim king of Judah, Thus saith theLord; Thou hast burned this roll, saying, Why hast thou written therein, saying, The king of Babylon shall certainly come and destroy this land, and shall cause to cease from thence man and beast? 30Therefore thus saith theLordof Jehoiakim king of Judah; He shall have none to sit upon the throne of David: and his dead body shallbe cast out in the day to the heat, and in the night to the frost. 31And I will punish him and his seed and his servants for their iniquity; and I will bring upon them, and upon the inhabitants of Jerusalem, and upon the men of Judah, all the evil that I have pronounced against them; but they hearkened not. 32Â¶Then took Jeremiah another roll, and gave it to Baruch thescribe, the son of Neriah; who wrote therein from the mouth of Jeremiah all the words of the book which Jehoiakim king of Judah had burned in the fire: and there wereaddedbesides unto them many like words."
    },
    {
      "reference": "Jeremiah 37",
      "title": "Jeremiah 37",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/37?lang=eng",
      "summary": "Jeremiah prophesies that Egypt will not save Judah from BabylonâHe is cast into a dungeonâZedekiah transfers him to the court of the prison.",
      "verses": [
        "1AndkingZedekiahthe son of Josiah reigned instead ofConiahthe son ofJehoiakim, whom Nebuchadrezzar king of Babylon made king in the land of Judah.",
        "2But neither he, nor his servants, nor the people of the land, did hearken unto the words of theLord, which he spake by the prophet Jeremiah.",
        "3And Zedekiah the king sent Jehucal the son of Shelemiah and Zephaniah the son of Maaseiah the priest to the prophet Jeremiah, saying, Pray now unto theLordour God for us.",
        "4Now Jeremiah came in and went out among the people: for they had not put him into prison.",
        "5Then Pharaohâs army was come forth out of Egypt: and when the Chaldeans that besieged Jerusalem heard tidings of them, they departed from Jerusalem.",
        "6Â¶Then came the word of theLordunto the prophet Jeremiah, saying,",
        "7Thus saith theLord, the God of Israel; Thus shall ye say to the king of Judah, that sent you unto me to inquire of me; Behold, Pharaohâsarmy, which is come forth to help you, shall return toEgyptinto their own land.",
        "8And the Chaldeans shall come again, and fight against this city, and take it, andburnit with fire.",
        "9Thus saith theLord; Deceive not yourselves, saying, The Chaldeans shall surely depart from us: for they shall not depart.",
        "10For though ye had smitten the whole army of the Chaldeans that fight against you, and there remainedbutwounded men among them,yetshould they rise up every man in his tent, and burn this city with fire.",
        "11Â¶And it came to pass, that when the army of the Chaldeans was broken up from Jerusalem for fear of Pharaohâs army,",
        "12Then Jeremiah went forth out of Jerusalem to go into the land of Benjamin, to separate himself thence in the midst of the people.",
        "13And when he was in the gate of Benjamin, a captain of the wardwasthere, whose namewasIrijah, the son of Shelemiah, the son of Hananiah; and he took Jeremiah the prophet, saying, Thoufallest awayto the Chaldeans.",
        "14Then said Jeremiah,It isfalse; I fall not away to the Chaldeans. But he hearkened not to him: so Irijah took Jeremiah, and brought him to the princes.",
        "15Wherefore the princes were wroth withJeremiah, and smote him, and put him in prison in the house of Jonathan the scribe: for they had made that theprison.",
        "16Â¶When Jeremiah was entered into the dungeon, and into thecabins, and Jeremiah had remained there many days;",
        "17Then Zedekiah the king sent, and took him out: and the king asked him secretly in his house, and said, Is thereanyword from theLord? And Jeremiah said, There is: for, said he, thou shalt be delivered into the hand of the king of Babylon.",
        "18Moreover Jeremiah said unto king Zedekiah, What have I offended against thee, or against thy servants, or against this people, that ye have put me in prison?",
        "19Wherearenow your prophets which prophesied unto you, saying, The king of Babylon shall not come against you, nor against this land?",
        "20Therefore hear now, I pray thee, O my lord the king: let my supplication, I pray thee, be accepted before thee; that thou cause me not to return to the house of Jonathan the scribe, lest I die there.",
        "21Then Zedekiah the king commanded that they should commit Jeremiah into the court of the prison, and that they should give him daily a piece ofbreadout of the bakersâ street, until all the bread in the city were spent. Thus Jeremiah remained in the court of the prison."
      ],
      "full_text": "1AndkingZedekiahthe son of Josiah reigned instead ofConiahthe son ofJehoiakim, whom Nebuchadrezzar king of Babylon made king in the land of Judah. 2But neither he, nor his servants, nor the people of the land, did hearken unto the words of theLord, which he spake by the prophet Jeremiah. 3And Zedekiah the king sent Jehucal the son of Shelemiah and Zephaniah the son of Maaseiah the priest to the prophet Jeremiah, saying, Pray now unto theLordour God for us. 4Now Jeremiah came in and went out among the people: for they had not put him into prison. 5Then Pharaohâs army was come forth out of Egypt: and when the Chaldeans that besieged Jerusalem heard tidings of them, they departed from Jerusalem. 6Â¶Then came the word of theLordunto the prophet Jeremiah, saying, 7Thus saith theLord, the God of Israel; Thus shall ye say to the king of Judah, that sent you unto me to inquire of me; Behold, Pharaohâsarmy, which is come forth to help you, shall return toEgyptinto their own land. 8And the Chaldeans shall come again, and fight against this city, and take it, andburnit with fire. 9Thus saith theLord; Deceive not yourselves, saying, The Chaldeans shall surely depart from us: for they shall not depart. 10For though ye had smitten the whole army of the Chaldeans that fight against you, and there remainedbutwounded men among them,yetshould they rise up every man in his tent, and burn this city with fire. 11Â¶And it came to pass, that when the army of the Chaldeans was broken up from Jerusalem for fear of Pharaohâs army, 12Then Jeremiah went forth out of Jerusalem to go into the land of Benjamin, to separate himself thence in the midst of the people. 13And when he was in the gate of Benjamin, a captain of the wardwasthere, whose namewasIrijah, the son of Shelemiah, the son of Hananiah; and he took Jeremiah the prophet, saying, Thoufallest awayto the Chaldeans. 14Then said Jeremiah,It isfalse; I fall not away to the Chaldeans. But he hearkened not to him: so Irijah took Jeremiah, and brought him to the princes. 15Wherefore the princes were wroth withJeremiah, and smote him, and put him in prison in the house of Jonathan the scribe: for they had made that theprison. 16Â¶When Jeremiah was entered into the dungeon, and into thecabins, and Jeremiah had remained there many days; 17Then Zedekiah the king sent, and took him out: and the king asked him secretly in his house, and said, Is thereanyword from theLord? And Jeremiah said, There is: for, said he, thou shalt be delivered into the hand of the king of Babylon. 18Moreover Jeremiah said unto king Zedekiah, What have I offended against thee, or against thy servants, or against this people, that ye have put me in prison? 19Wherearenow your prophets which prophesied unto you, saying, The king of Babylon shall not come against you, nor against this land? 20Therefore hear now, I pray thee, O my lord the king: let my supplication, I pray thee, be accepted before thee; that thou cause me not to return to the house of Jonathan the scribe, lest I die there. 21Then Zedekiah the king commanded that they should commit Jeremiah into the court of the prison, and that they should give him daily a piece ofbreadout of the bakersâ street, until all the bread in the city were spent. Thus Jeremiah remained in the court of the prison."
    },
    {
      "reference": "Jeremiah 38",
      "title": "Jeremiah 38",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/38?lang=eng",
      "summary": "The rulers cast Jeremiah into a muddy dungeonâHe is freed by Ebed-melech, an Ethiopian, and put in the court of the prisonâJeremiah counsels Zedekiah concerning the war.",
      "verses": [
        "1Then Shephatiah the son of Mattan, and Gedaliah the son ofPashur, and Jucal the son of Shelemiah, andPashurthe son of Malchiah, heard the words that Jeremiah had spoken unto all the people, saying,",
        "2Thus saith theLord, He that remaineth in this city shall die by the sword, by the famine, and by the pestilence: but he that goeth forth to the Chaldeans shall live; for he shall have his life for a prey, and shall live.",
        "3Thus saith theLord, This city shall surely be given into the hand of the king ofBabylonâsarmy, which shall take it.",
        "4Therefore theprincessaid unto the king, We beseech thee, let this man be put to death: for thus he weakeneth the hands of the men of war that remain in this city, and the hands of all the people, in speaking such words unto them: for this man seeketh not thewelfareof this people, but the hurt.",
        "5Then Zedekiah the king said, Behold, heisin your hand: for the kingisnothe thatcan doanything against you.",
        "6Then took they Jeremiah, and cast him into the dungeon of Malchiah the son ofHammelech, thatwasin the court of the prison: and they let down Jeremiah with cords. And in the dungeonthere wasno water, but mire: so Jeremiah sunk in the mire.",
        "7Â¶Now when Ebed-melech the Ethiopian, one of the eunuchs which was in the kingâs house, heard that they had put Jeremiah in the dungeon; the king then sitting in the gate of Benjamin;",
        "8Ebed-melech went forth out of the kingâs house, and spake to the king, saying,",
        "9My lord the king, these men have done evil in all that they have done to Jeremiah the prophet, whom they have cast into the dungeon; and he is like to die for hunger in the place where he is: forthere isno morebreadin the city.",
        "10Then the king commanded Ebed-melech the Ethiopian, saying, Take from hence thirty men withthee, and take up Jeremiah the prophet out of the dungeon, before he die.",
        "11So Ebed-melech took the men with him, and went into the house of the king under the treasury, and took thenceold cast cloutsand old rotten rags, and let them down by cords into the dungeon to Jeremiah.",
        "12And Ebed-melech the Ethiopian said unto Jeremiah, Put nowtheseold cast clouts and rotten rags under thine armholes under the cords. And Jeremiah did so.",
        "13So they drew up Jeremiah with cords, and took him up out of the dungeon: and Jeremiah remained in the court of the prison.",
        "14Â¶Then Zedekiah the king sent, and took Jeremiah the prophet unto him into the third entry thatisin the house of theLord: and the king said unto Jeremiah, I will ask thee a thing; hide nothing from me.",
        "15Then Jeremiah said unto Zedekiah, If I declareitunto thee, wilt thou not surely put me to death? and if I give thee counsel, wilt thou not hearken unto me?",
        "16So Zedekiah the king sware secretly unto Jeremiah, saying,AstheLordliveth, that made us this soul, I will not put thee to death, neither will I give thee into the hand of these men that seek thy life.",
        "17Then said Jeremiah unto Zedekiah, Thus saith theLord, the God of hosts, the God of Israel; If thou wilt assuredly go forth unto the king of Babylonâs princes, then thy soul shall live, and this city shall not be burned with fire; and thou shalt live, and thine house:",
        "18But if thou wilt not go forth to the king of Babylonâs princes, then shall this city be given into the hand of the Chaldeans, and they shall burn it with fire, and thou shalt not escape out of their hand.",
        "19And Zedekiah the king said unto Jeremiah, I am afraid of the Jews thatare fallen tothe Chaldeans, lest they deliver me into their hand, and theymockme.",
        "20But Jeremiah said, They shall not deliverthee.Obey, I beseech thee, the voice of theLord, which I speak unto thee: so it shall be well unto thee, and thy soul shall live.",
        "21But if thou refuse to go forth, thisisthe word that theLordhath shewed me:",
        "22And, behold, all the women that are left in the king of Judahâs houseshall bebrought forth to the king of Babylonâs princes, and thosewomenshall say, Thy friends have set thee on, and have prevailed against thee: thy feet are sunk in the mire,andthey are turned away back.",
        "23So they shall bring out all thy wives and thychildrento the Chaldeans: and thou shalt not escape out of their hand, but shalt be taken by the hand of the king of Babylon: and thou shalt cause this city to be burned with fire.",
        "24Â¶Then said Zedekiah unto Jeremiah, Let no man know of these words, and thou shalt not die.",
        "25But if the princes hear that I have talked with thee, and they come unto thee, and say unto thee, Declare unto us now what thou hast said unto the king, hide it not from us, and we will not put thee to death; also what the king said unto thee:",
        "26Then thou shalt say unto them, I presented my supplication before the king, that he would not cause me to return to Jonathanâs house, to die there.",
        "27Then came all the princes unto Jeremiah, and asked him: and he told them according to all these words that the king had commanded. So they left off speaking with him; for the matter was not perceived.",
        "28So Jeremiah abode in the court of the prison until the day that Jerusalem was taken: and he wastherewhen Jerusalem was taken."
      ],
      "full_text": "1Then Shephatiah the son of Mattan, and Gedaliah the son ofPashur, and Jucal the son of Shelemiah, andPashurthe son of Malchiah, heard the words that Jeremiah had spoken unto all the people, saying, 2Thus saith theLord, He that remaineth in this city shall die by the sword, by the famine, and by the pestilence: but he that goeth forth to the Chaldeans shall live; for he shall have his life for a prey, and shall live. 3Thus saith theLord, This city shall surely be given into the hand of the king ofBabylonâsarmy, which shall take it. 4Therefore theprincessaid unto the king, We beseech thee, let this man be put to death: for thus he weakeneth the hands of the men of war that remain in this city, and the hands of all the people, in speaking such words unto them: for this man seeketh not thewelfareof this people, but the hurt. 5Then Zedekiah the king said, Behold, heisin your hand: for the kingisnothe thatcan doanything against you. 6Then took they Jeremiah, and cast him into the dungeon of Malchiah the son ofHammelech, thatwasin the court of the prison: and they let down Jeremiah with cords. And in the dungeonthere wasno water, but mire: so Jeremiah sunk in the mire. 7Â¶Now when Ebed-melech the Ethiopian, one of the eunuchs which was in the kingâs house, heard that they had put Jeremiah in the dungeon; the king then sitting in the gate of Benjamin; 8Ebed-melech went forth out of the kingâs house, and spake to the king, saying, 9My lord the king, these men have done evil in all that they have done to Jeremiah the prophet, whom they have cast into the dungeon; and he is like to die for hunger in the place where he is: forthere isno morebreadin the city. 10Then the king commanded Ebed-melech the Ethiopian, saying, Take from hence thirty men withthee, and take up Jeremiah the prophet out of the dungeon, before he die. 11So Ebed-melech took the men with him, and went into the house of the king under the treasury, and took thenceold cast cloutsand old rotten rags, and let them down by cords into the dungeon to Jeremiah. 12And Ebed-melech the Ethiopian said unto Jeremiah, Put nowtheseold cast clouts and rotten rags under thine armholes under the cords. And Jeremiah did so. 13So they drew up Jeremiah with cords, and took him up out of the dungeon: and Jeremiah remained in the court of the prison. 14Â¶Then Zedekiah the king sent, and took Jeremiah the prophet unto him into the third entry thatisin the house of theLord: and the king said unto Jeremiah, I will ask thee a thing; hide nothing from me. 15Then Jeremiah said unto Zedekiah, If I declareitunto thee, wilt thou not surely put me to death? and if I give thee counsel, wilt thou not hearken unto me? 16So Zedekiah the king sware secretly unto Jeremiah, saying,AstheLordliveth, that made us this soul, I will not put thee to death, neither will I give thee into the hand of these men that seek thy life. 17Then said Jeremiah unto Zedekiah, Thus saith theLord, the God of hosts, the God of Israel; If thou wilt assuredly go forth unto the king of Babylonâs princes, then thy soul shall live, and this city shall not be burned with fire; and thou shalt live, and thine house: 18But if thou wilt not go forth to the king of Babylonâs princes, then shall this city be given into the hand of the Chaldeans, and they shall burn it with fire, and thou shalt not escape out of their hand. 19And Zedekiah the king said unto Jeremiah, I am afraid of the Jews thatare fallen tothe Chaldeans, lest they deliver me into their hand, and theymockme. 20But Jeremiah said, They shall not deliverthee.Obey, I beseech thee, the voice of theLord, which I speak unto thee: so it shall be well unto thee, and thy soul shall live. 21But if thou refuse to go forth, thisisthe word that theLordhath shewed me: 22And, behold, all the women that are left in the king of Judahâs houseshall bebrought forth to the king of Babylonâs princes, and thosewomenshall say, Thy friends have set thee on, and have prevailed against thee: thy feet are sunk in the mire,andthey are turned away back. 23So they shall bring out all thy wives and thychildrento the Chaldeans: and thou shalt not escape out of their hand, but shalt be taken by the hand of the king of Babylon: and thou shalt cause this city to be burned with fire. 24Â¶Then said Zedekiah unto Jeremiah, Let no man know of these words, and thou shalt not die. 25But if the princes hear that I have talked with thee, and they come unto thee, and say unto thee, Declare unto us now what thou hast said unto the king, hide it not from us, and we will not put thee to death; also what the king said unto thee: 26Then thou shalt say unto them, I presented my supplication before the king, that he would not cause me to return to Jonathanâs house, to die there. 27Then came all the princes unto Jeremiah, and asked him: and he told them according to all these words that the king had commanded. So they left off speaking with him; for the matter was not perceived. 28So Jeremiah abode in the court of the prison until the day that Jerusalem was taken: and he wastherewhen Jerusalem was taken."
    },
    {
      "reference": "Jeremiah 39",
      "title": "Jeremiah 39",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/39?lang=eng",
      "summary": "Jerusalem is taken, and the people are taken captiveâJeremiah and Ebed-melech, the Ethiopian, are preserved.",
      "verses": [
        "1In theninthyear of Zedekiah king of Judah, in the tenth month, came Nebuchadrezzarkingof Babylon and all his army againstJerusalem, and they besieged it.",
        "2Andin the eleventh year of Zedekiah, in the fourth month, the ninthdayof the month, the city was broken up.",
        "3And all the princes of the king of Babylon came in, and sat in the middlegate,evenNergal-sharezer, Samgar-nebo, Sarsechim, Rab-saris, Nergal-sharezer, Rab-mag, with all the residue of the princes of the king of Babylon.",
        "4Â¶And it came to pass,thatwhenZedekiahthe king of Judah saw them, and all the men of war, then they fled, and went forth out of the city by night, by the way of the kingâs garden, by the gate betwixt the two walls: and he went out the way of the plain.",
        "5But the Chaldeansâ army pursued after them, and overtookZedekiahin theplainsof Jericho: and when they had taken him, they brought him up to Nebuchadnezzar king of Babylon to Riblah in the land of Hamath, where hegave judgmentupon him.",
        "6Then the king of Babylonslewthesonsof Zedekiah in Riblah before his eyes: also the king of Babylon slew all the nobles of Judah.",
        "7Moreover he put out Zedekiahâseyes, and boundhimwith chains, to carry him to Babylon.",
        "8Â¶And theChaldeansburnedthe kingâs house, and the houses of the people, with fire, andbrakedown the walls of Jerusalem.",
        "9Then Nebuzar-adan the captain of the guard carried away captive into Babylon the remnant of the people that remained in the city, and those that fell away, thatfell tohim, with the rest of the people that remained.",
        "10ButNebuzar-adanthe captain of the guard left of the poor of the people, which had nothing, in the land of Judah, and gave them vineyards and fields at the same time.",
        "11Â¶Now Nebuchadrezzar king of Babylon gave charge concerning Jeremiah to Nebuzar-adan the captain of the guard, saying,",
        "12Take him, andlook well to him, and do him no harm; but do unto him even as he shall say unto thee.",
        "13So Nebuzar-adan the captain of the guard sent, and Nebushasban, Rab-saris, and Nergal-sharezer, Rab-mag, and all the king of Babylonâs princes;",
        "14Even they sent, and took Jeremiah out of the court of the prison, and committed him untoGedaliahthe son of Ahikam the son of Shaphan, that he should carry him home: so he dwelt among the people.",
        "15Â¶Now the word of theLordcame unto Jeremiah, while he was shut up in the court of the prison, saying,",
        "16Go and speak to Ebed-melech the Ethiopian, saying, Thus saith theLordof hosts, the God of Israel; Behold, I will bring my words upon this city for evil, and not for good; and they shall beaccomplishedin that day before thee.",
        "17But I will deliver thee in that day, saith theLord: and thou shaltnot be given into the hand of the men of whom thouartafraid.",
        "18For I will surely deliver thee, and thou shalt not fall by the sword, but thylifeshall be for a prey unto thee: because thou hast put thy trust in me, saith theLord."
      ],
      "full_text": "1In theninthyear of Zedekiah king of Judah, in the tenth month, came Nebuchadrezzarkingof Babylon and all his army againstJerusalem, and they besieged it. 2Andin the eleventh year of Zedekiah, in the fourth month, the ninthdayof the month, the city was broken up. 3And all the princes of the king of Babylon came in, and sat in the middlegate,evenNergal-sharezer, Samgar-nebo, Sarsechim, Rab-saris, Nergal-sharezer, Rab-mag, with all the residue of the princes of the king of Babylon. 4Â¶And it came to pass,thatwhenZedekiahthe king of Judah saw them, and all the men of war, then they fled, and went forth out of the city by night, by the way of the kingâs garden, by the gate betwixt the two walls: and he went out the way of the plain. 5But the Chaldeansâ army pursued after them, and overtookZedekiahin theplainsof Jericho: and when they had taken him, they brought him up to Nebuchadnezzar king of Babylon to Riblah in the land of Hamath, where hegave judgmentupon him. 6Then the king of Babylonslewthesonsof Zedekiah in Riblah before his eyes: also the king of Babylon slew all the nobles of Judah. 7Moreover he put out Zedekiahâseyes, and boundhimwith chains, to carry him to Babylon. 8Â¶And theChaldeansburnedthe kingâs house, and the houses of the people, with fire, andbrakedown the walls of Jerusalem. 9Then Nebuzar-adan the captain of the guard carried away captive into Babylon the remnant of the people that remained in the city, and those that fell away, thatfell tohim, with the rest of the people that remained. 10ButNebuzar-adanthe captain of the guard left of the poor of the people, which had nothing, in the land of Judah, and gave them vineyards and fields at the same time. 11Â¶Now Nebuchadrezzar king of Babylon gave charge concerning Jeremiah to Nebuzar-adan the captain of the guard, saying, 12Take him, andlook well to him, and do him no harm; but do unto him even as he shall say unto thee. 13So Nebuzar-adan the captain of the guard sent, and Nebushasban, Rab-saris, and Nergal-sharezer, Rab-mag, and all the king of Babylonâs princes; 14Even they sent, and took Jeremiah out of the court of the prison, and committed him untoGedaliahthe son of Ahikam the son of Shaphan, that he should carry him home: so he dwelt among the people. 15Â¶Now the word of theLordcame unto Jeremiah, while he was shut up in the court of the prison, saying, 16Go and speak to Ebed-melech the Ethiopian, saying, Thus saith theLordof hosts, the God of Israel; Behold, I will bring my words upon this city for evil, and not for good; and they shall beaccomplishedin that day before thee. 17But I will deliver thee in that day, saith theLord: and thou shaltnot be given into the hand of the men of whom thouartafraid. 18For I will surely deliver thee, and thou shalt not fall by the sword, but thylifeshall be for a prey unto thee: because thou hast put thy trust in me, saith theLord."
    },
    {
      "reference": "Lamentations 1",
      "title": "TheLamentationsof Jeremiah",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/lam/1?lang=eng",
      "summary": "Jeremiah laments the miserable condition of JerusalemâJerusalem herself complains of her deep sorrow.",
      "verses": [
        "1How doth the city sit solitary,that wasfull of people!howis she become as awidow! shethat wasgreat among the nations,andprincessamong the provinces,howis she become tributary!",
        "2Sheweepeth sore in the night, and her tearsareon her cheeks: among all herloversshe hath none tocomforther:all her friends have dealt treacherously with her, they are become her enemies.",
        "3Judah is gone intocaptivitybecause of affliction, and because of great servitude: she dwelleth among the heathen, she findeth norest: all her persecutors overtook her between the straits.",
        "4The ways of Zion domourn, because none come to thesolemnfeasts: all her gates are desolate: her priests sigh, her virgins are afflicted, and sheisin bitterness.",
        "5Her adversaries are the chief, her enemies prosper; for theLordhathafflictedher for the multitude of hertransgressions: her children are gone into captivity before the enemy.",
        "6And from the daughter of Zion all herbeautyis departed: her princes are become like hartsthatfind no pasture, and they are gone without strength before the pursuer.",
        "7Jerusalem remembered in the days of her affliction and of her miseries all her pleasant things that she had in the days of old, when her people fell into the hand of the enemy, and none did help her: the adversaries saw her,anddidmockat her sabbaths.",
        "8Jerusalemhath grievously sinned; therefore she isremoved: all that honoured her despise her, because they have seen hernakedness: yea, she sigheth, and turneth backward.",
        "9Herfilthinessisin her skirts; she remembereth not her lastend; therefore she came down wonderfully: she had no comforter. OLord, behold my affliction: for the enemy hath magnifiedhimself.",
        "10The adversary hath spread out his hand upon all her pleasant things: for she hath seenthatthe heathen entered into hersanctuary, whom thou didst commandthatthey should not enter into thycongregation.",
        "11All her people sigh, they seekbread; they have given their pleasant things for meat to relieve the soul: see, OLord, and consider; for I am become vile.",
        "12Â¶Is itnothing to you, all ye that pass by? behold, and see if there be any sorrow like unto mysorrow, which is done unto me, wherewith theLordhath afflictedmein the day of his fierceanger.",
        "13From above hath he sent fire into my bones, and it prevaileth against them: he hath spread anetfor my feet, he hath turned me back: he hath made me desolateandfaint all the day.",
        "14The yoke of my transgressions is bound by his hand: they are wreathed,andcome up upon my neck: he hath made my strength to fall, the Lord hath delivered me intotheirhands,from whomI am not able to rise up.",
        "15The Lord hath trodden under foot all my mightymenin the midst of me: he hath called an assembly against me to crush my young men: the Lord hath trodden the virgin, the daughter of Judah,asin a winepress.",
        "16For thesethingsI weep; mine eye, mine eye runneth down with water, because the comforter that should relieve my soul is far from me: my children are desolate, because the enemy prevailed.",
        "17Zionspreadeth forth her hands,and there isnone to comfort her: theLordhath commanded concerning Jacob,thathis adversariesshould beround about him: Jerusalem is as a menstruous woman among them.",
        "18Â¶TheLordis righteous; for I have rebelled against his commandment: hear, I pray you, all people, and behold my sorrow: my virgins and my young men are gone into captivity.",
        "19I called for my lovers,butthey deceived me: my priests and mine elders gave up the ghost in the city, while they sought their meat to relieve their souls.",
        "20Behold, OLord; for Iamin distress: mybowelsare troubled; mine heart is turned within me; for I have grievouslyrebelled: abroad theswordbereaveth, at homethere isas death.",
        "21They have heard that I sigh:there isnone to comfort me: all mine enemies have heard of my trouble; they are glad that thou hast doneit:thou wilt bring the daythatthou hast called, and they shall be like unto me.",
        "22Let all their wickedness come before thee; and do unto them, as thou hast done unto me for all my transgressions: for my sighsaremany, and my heartisfaint."
      ],
      "full_text": "1How doth the city sit solitary,that wasfull of people!howis she become as awidow! shethat wasgreat among the nations,andprincessamong the provinces,howis she become tributary! 2Sheweepeth sore in the night, and her tearsareon her cheeks: among all herloversshe hath none tocomforther:all her friends have dealt treacherously with her, they are become her enemies. 3Judah is gone intocaptivitybecause of affliction, and because of great servitude: she dwelleth among the heathen, she findeth norest: all her persecutors overtook her between the straits. 4The ways of Zion domourn, because none come to thesolemnfeasts: all her gates are desolate: her priests sigh, her virgins are afflicted, and sheisin bitterness. 5Her adversaries are the chief, her enemies prosper; for theLordhathafflictedher for the multitude of hertransgressions: her children are gone into captivity before the enemy. 6And from the daughter of Zion all herbeautyis departed: her princes are become like hartsthatfind no pasture, and they are gone without strength before the pursuer. 7Jerusalem remembered in the days of her affliction and of her miseries all her pleasant things that she had in the days of old, when her people fell into the hand of the enemy, and none did help her: the adversaries saw her,anddidmockat her sabbaths. 8Jerusalemhath grievously sinned; therefore she isremoved: all that honoured her despise her, because they have seen hernakedness: yea, she sigheth, and turneth backward. 9Herfilthinessisin her skirts; she remembereth not her lastend; therefore she came down wonderfully: she had no comforter. OLord, behold my affliction: for the enemy hath magnifiedhimself. 10The adversary hath spread out his hand upon all her pleasant things: for she hath seenthatthe heathen entered into hersanctuary, whom thou didst commandthatthey should not enter into thycongregation. 11All her people sigh, they seekbread; they have given their pleasant things for meat to relieve the soul: see, OLord, and consider; for I am become vile. 12Â¶Is itnothing to you, all ye that pass by? behold, and see if there be any sorrow like unto mysorrow, which is done unto me, wherewith theLordhath afflictedmein the day of his fierceanger. 13From above hath he sent fire into my bones, and it prevaileth against them: he hath spread anetfor my feet, he hath turned me back: he hath made me desolateandfaint all the day. 14The yoke of my transgressions is bound by his hand: they are wreathed,andcome up upon my neck: he hath made my strength to fall, the Lord hath delivered me intotheirhands,from whomI am not able to rise up. 15The Lord hath trodden under foot all my mightymenin the midst of me: he hath called an assembly against me to crush my young men: the Lord hath trodden the virgin, the daughter of Judah,asin a winepress. 16For thesethingsI weep; mine eye, mine eye runneth down with water, because the comforter that should relieve my soul is far from me: my children are desolate, because the enemy prevailed. 17Zionspreadeth forth her hands,and there isnone to comfort her: theLordhath commanded concerning Jacob,thathis adversariesshould beround about him: Jerusalem is as a menstruous woman among them. 18Â¶TheLordis righteous; for I have rebelled against his commandment: hear, I pray you, all people, and behold my sorrow: my virgins and my young men are gone into captivity. 19I called for my lovers,butthey deceived me: my priests and mine elders gave up the ghost in the city, while they sought their meat to relieve their souls. 20Behold, OLord; for Iamin distress: mybowelsare troubled; mine heart is turned within me; for I have grievouslyrebelled: abroad theswordbereaveth, at homethere isas death. 21They have heard that I sigh:there isnone to comfort me: all mine enemies have heard of my trouble; they are glad that thou hast doneit:thou wilt bring the daythatthou hast called, and they shall be like unto me. 22Let all their wickedness come before thee; and do unto them, as thou hast done unto me for all my transgressions: for my sighsaremany, and my heartisfaint."
    },
    {
      "reference": "Lamentations 3",
      "title": "Lamentations 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/lam/3?lang=eng",
      "summary": "Jeremiah, speaking for Judah, laments the calamity but trusts in the Lord and prays for deliverance.",
      "verses": [
        "1Iamthe manthathath seen affliction by the rod of his wrath.",
        "2He hath led me, and broughtme intodarkness, but notintolight.",
        "3Surely against me is he turned; he turneth his handagainst meall the day.",
        "4My flesh and my skin hath he made old; he hath broken my bones.",
        "5He hath builded against me, and compassedmewith gall and travail.",
        "6He hath set me in dark places, asthey that bedead of old.",
        "7He hathhedgedme about, that I cannot get out: he hath made my chain heavy.",
        "8Also when I cry and shout, he shutteth out my prayer.",
        "9He hath inclosed my ways with hewn stone, he hath made my paths crooked.",
        "10Hewasunto measa bear lying in wait,and asa lion in secret places.",
        "11He hath turned aside my ways, and pulled me in pieces: he hath made me desolate.",
        "12He hath bent his bow, and set me as a mark for the arrow.",
        "13He hath caused the arrows of his quiver to enter into my reins.",
        "14I was aderisionto all my people;andtheir song all the day.",
        "15He hath filled me with bitterness, he hath made me drunken with wormwood.",
        "16He hath also broken my teeth with gravel stones, he hath covered me with ashes.",
        "17And thou hast removed my soul far off from peace: I forgat prosperity.",
        "18And I said, My strength and my hope is perished from theLord:",
        "19Remembering mine affliction and my misery, the wormwood and the gall.",
        "20My soul haththemstill in remembrance, and is humbled in me.",
        "21This I recall to my mind, therefore have I hope.",
        "22Â¶It is oftheLordâs mercies that we are not consumed, because his compassions fail not.",
        "23They arenew every morning: greatisthy faithfulness.",
        "24TheLordismyportion, saithmy soul; therefore will I hope in him.",
        "25TheLordisgoodunto them thatwaitfor him, to the soulthatseekethhim.",
        "26It isgood thata manshould bothhopeand quietly wait for the salvation of theLord.",
        "27It isgood for a man that hebearthe yoke in hisyouth.",
        "28He sitteth alone and keepeth silence, because he hath borneitupon him.",
        "29He putteth his mouth in the dust; if so be there may be hope.",
        "30He givethhischeekto him that smiteth him: he is filled full withreproach.",
        "31For the Lord will not cast off for ever:",
        "32But though he cause grief, yet will he havecompassionaccording to the multitude of his mercies.",
        "33For he doth notafflictwillingly nor grieve the children of men.",
        "34To crush under his feet all the prisoners of the earth,",
        "35To turn aside the right of a man before the face of the most High,",
        "36To subvert a man in his cause, the Lord approveth not.",
        "37Â¶Whoishethatsaith, and it cometh to pass,whenthe Lord commandethitnot?",
        "38Out of the mouth of the most High proceedeth not evil and good?",
        "39Wherefore doth a living man complain, a man for the punishment of his sins?",
        "40Let ussearchand try our ways, and turn again to theLord.",
        "41Let uslift upour heart withourhands unto God in the heavens.",
        "42We have transgressed and have rebelled: thou hast not pardoned.",
        "43Thou hast covered with anger, and persecuted us: thou hastslain, thou hast not pitied.",
        "44Thou hast covered thyself with a cloud, thatourprayer should not pass through.",
        "45Thou hast made usasthe offscouring and refuse in the midst of the people.",
        "46All ourenemieshave opened their mouths against us.",
        "47Fear and a snare is come upon us, desolation and destruction.",
        "48Mine eye runneth down withriversof water for thedestructionof the daughter of my people.",
        "49Mine eye trickleth down, and ceaseth not, without any intermission,",
        "50Till theLordlook down, and behold from heaven."
      ],
      "full_text": "1Iamthe manthathath seen affliction by the rod of his wrath. 2He hath led me, and broughtme intodarkness, but notintolight. 3Surely against me is he turned; he turneth his handagainst meall the day. 4My flesh and my skin hath he made old; he hath broken my bones. 5He hath builded against me, and compassedmewith gall and travail. 6He hath set me in dark places, asthey that bedead of old. 7He hathhedgedme about, that I cannot get out: he hath made my chain heavy. 8Also when I cry and shout, he shutteth out my prayer. 9He hath inclosed my ways with hewn stone, he hath made my paths crooked. 10Hewasunto measa bear lying in wait,and asa lion in secret places. 11He hath turned aside my ways, and pulled me in pieces: he hath made me desolate. 12He hath bent his bow, and set me as a mark for the arrow. 13He hath caused the arrows of his quiver to enter into my reins. 14I was aderisionto all my people;andtheir song all the day. 15He hath filled me with bitterness, he hath made me drunken with wormwood. 16He hath also broken my teeth with gravel stones, he hath covered me with ashes. 17And thou hast removed my soul far off from peace: I forgat prosperity. 18And I said, My strength and my hope is perished from theLord: 19Remembering mine affliction and my misery, the wormwood and the gall. 20My soul haththemstill in remembrance, and is humbled in me. 21This I recall to my mind, therefore have I hope. 22Â¶It is oftheLordâs mercies that we are not consumed, because his compassions fail not. 23They arenew every morning: greatisthy faithfulness. 24TheLordismyportion, saithmy soul; therefore will I hope in him. 25TheLordisgoodunto them thatwaitfor him, to the soulthatseekethhim. 26It isgood thata manshould bothhopeand quietly wait for the salvation of theLord. 27It isgood for a man that hebearthe yoke in hisyouth. 28He sitteth alone and keepeth silence, because he hath borneitupon him. 29He putteth his mouth in the dust; if so be there may be hope. 30He givethhischeekto him that smiteth him: he is filled full withreproach. 31For the Lord will not cast off for ever: 32But though he cause grief, yet will he havecompassionaccording to the multitude of his mercies. 33For he doth notafflictwillingly nor grieve the children of men. 34To crush under his feet all the prisoners of the earth, 35To turn aside the right of a man before the face of the most High, 36To subvert a man in his cause, the Lord approveth not. 37Â¶Whoishethatsaith, and it cometh to pass,whenthe Lord commandethitnot? 38Out of the mouth of the most High proceedeth not evil and good? 39Wherefore doth a living man complain, a man for the punishment of his sins? 40Let ussearchand try our ways, and turn again to theLord. 41Let uslift upour heart withourhands unto God in the heavens. 42We have transgressed and have rebelled: thou hast not pardoned. 43Thou hast covered with anger, and persecuted us: thou hastslain, thou hast not pitied. 44Thou hast covered thyself with a cloud, thatourprayer should not pass through. 45Thou hast made usasthe offscouring and refuse in the midst of the people. 46All ourenemieshave opened their mouths against us. 47Fear and a snare is come upon us, desolation and destruction. 48Mine eye runneth down withriversof water for thedestructionof the daughter of my people. 49Mine eye trickleth down, and ceaseth not, without any intermission, 50Till theLordlook down, and behold from heaven. 51Mine eye affecteth mine heart because of all the daughters of my city. 52Mine enemies chased me sore, like a bird, without cause. 53They have cut off my life in the dungeon, and cast a stone upon me. 54Waters flowed over mine head;thenI said, I am cut off. 55Â¶I called upon thy name, OLord, out of the low dungeon. 56Thou hast heard my voice: hide not thine ear at my breathing, at my cry. 57Thoudrewestnear in the daythatI called upon thee: thou saidst, Fear not. 58O Lord, thou hast pleaded the causes of my soul; thou hast redeemed my life. 59OLord, thou hast seen my wrong: judge thou my cause. 60Thou hast seen all their vengeanceandall their imaginations against me. 61Thou hast heard their reproach,OLord,andall their imaginations against me; 62The lips of those that rose up against me, and theirdeviceagainst me all the day. 63Behold their sitting down, and their rising up; Iamtheir musick. 64Â¶Render unto them a recompence, OLord, according to the work of their hands. 65Give them sorrow of heart, thy curse unto them. 66Persecute and destroy them in anger from under the heavens of theLord."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:32:43",
  "metadata": {
    "week_number": 44,
    "title": "Week 44: October 26–November 1 - Jeremiah 31–33; 36–38; Lamentations 1; 3",
    "date_range": "October 26–November 1",
    "scraped_at": "2025-12-21T22:32:54.177020",
    "scraper_version": "2.0.0"
  }
}