{
  "week_number": 29,
  "date_range": "July 13–19",
  "title": "Week 29: July 13–19 - 2 Kings 16–25",
  "bundle_title": "Week 29: July 13–19: \"Week 29: July 13–19 - 2 Kings 16–25\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/29?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/29?lang=eng",
    "title": "2 Kings 16–25",
    "scripture_references": "2 Kings 16–25",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“July 13–19. ‘He Trusted in the Lord God of Israel’: 2 Kings 16–25,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“July 13–19. ‘He Trusted in the Lord God of Israel,’”Come, Follow Me: Old Testament 2026\n\nThe Flight of the Prisoners, by James Jacques Joseph Tissot and others\n\nDespite the prophet Elisha’s powerful ministry, the people of the Northern Kingdom of Israel did not repent. Eventually, the Assyrian Empire conquered and scattered the ten tribes of Israel. Meanwhile, the Southern Kingdom of Judah wasn’t doing much better: idolatry was also widespread there.\n\nAmid all this spiritual decay, the scriptures mention two kings of Judah who, for a time, turned their people back to the Lord. One was Hezekiah. During his reign, the Assyrians conquered much of Judah. But Hezekiah and his people showed faith in the Lord, who saved Jerusalem in a miraculous way. Later, after another period of apostasy, Josiah became king. Inspired in part by a rediscovery of the book of the law of Moses, Josiah brought reforms that revived the religious life of his people.\n\nLike Israel and Judah, we all make both good and bad choices. When we sense that our lives need some reforms, we can take encouragement from these two bright spots in the dark years of Judah’s history. Perhaps the examples of Hezekiah and Josiah can inspire us to “trust in the Lord our God” (2 Kings 18:22).",
    "learning_at_home_church": [
      {
        "title": "I can stay true to the Lord when my faith is challenged.",
        "content": "Most of us have experiences that challenge our faith. For Hezekiah and his people, one of those challenges came when the Assyrian army approached Jerusalem. As you read2 Kings 18–19, imagine that you lived in Jerusalem during this time. How might you have felt, for example, hearing the Assyrians’ taunts in2 Kings 18:28–37;19:10–13? What would you have done? Compare the Assyrians’ reasons for the Israelites not to trust the Lord with the reasons Satan gives for us to doubt our faith today. You could also contrast the Assyrians’ reasons with your reasons why youdotrust the Lord.\n\nWhat do you learn from Hezekiah’s actions in this situation? (see2 Kings 19:1–7, 14–19). How did the Lord respond? (see2 Kings 19:35–37). Why do you think Hezekiah remained faithful? (see2 Kings 18:5–7). Ponder how the Lord has sustained you in challenging times. What do you feel inspired to do to increase your trust in Him?\n\nPresident Jeffrey R. Holland’s message “Fear Not: Believe Only!” (Liahona, May 2022, 34–36) has helpful counsel for times of fear or doubt. A hymn like “Let Us All Press On” (Hymns, no. 243) could also have encouraging messages. What do you find in these resources that helps you?\n\nSee also2 Chronicles 31–32;3 Nephi 3–4; Jörg Klebingat, “Valiant Discipleship in the Latter Days,”Liahona, May 2022, 107–10.\n\nUse scripture study helps.The Church provides many resources to help you understand the scriptures. For example, in the Gospel Library you can find theGuide to the Scriptures,Topics and Questions, andChurch magazines. In addition, as you read the Old Testament, you can find helpful context and insights in the “Thoughts to Keep in Mind” articles inCome, Follow Me. The article titled “Jesus Will Say to All Israel, ‘Come Home’” might help your study of2 Kings 16–25.\n\n2 Kings 19:20–37"
      },
      {
        "title": "All things are in the Lord’s hands.",
        "content": "Sennacherib, the king of Assyria, had good reason to believe that his army would conquer Jerusalem (see2 Kings 17;18:33–34;19:11–13). But the Lord had a message regarding Sennacherib, given through the prophet Isaiah. It’s recorded in2 Kings 19:20–34. What truths do you find in the Lord’s message that help you have faith in Him and His plan?\n\n2 Kings 21–23"
      },
      {
        "title": "The scriptures can turn my heart to the Lord.",
        "content": "Have you ever felt that you were lacking something spiritually? Maybe you felt that your relationship with God could be stronger. What helped you turn back to Him? Ponder these questions as you read2 Kings 21–23, which describes how the Kingdom of Judah fell away from the Lord under King Manasseh (see2 Kings 21) and how King Josiah helped the people turn back to Him (see2 Kings 22–23). How and why did Josiah and his people change? (see2 Kings 22:8–11;23:1–6, 21, 24).\n\nPresident Spencer W. Kimball called the story of King Josiah “one of the finest stories in all of the scriptures” (Teachings of Presidents of the Church: Spencer W. Kimball[2006], 62). Read President Kimball’s words about King Josiah (pages 62–64). Perhaps you can think of an experience when a passage of scripture “work[ed] mightily” in you. What might you do to receive more experiences like that?\n\nSee alsoAlma 31:5; “Josiah and the Book of the Law” (video), Gospel Library.\n\nJosiah and the Book of the Law\n\n2 Kings 23:1–25"
      },
      {
        "title": "A covenant is a whole-souled commitment between me and the Lord.",
        "content": "What impresses you about the covenant Josiah made in2 Kings 23:3? As you continue readingchapter 23, notice what Josiah did to show his commitment to the Lord (see also the picture at the end of this outline). How can you show your commitment to Him?\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "I can trust Heavenly Father and Jesus Christ.",
        "content": "In2 Kings 18:3, 5–6, help your children discover what made Hezekiah a good king. Then as you read together2 Kings 19:14–19, they could discover how he showed that he trusted the Lord. You could look at a picture of Jesus and talk about why we can trust Him. How can we show that we trust the Lord?\n\n2 Kings 22:1–7"
      },
      {
        "title": "Heavenly Father and Jesus Christ can trust me.",
        "content": "In2 Kings 22:1, help your children discover how old Josiah was when he became king. What do we learn about Josiah inverse 2? Consider an activity that could illustrate following the Lord and not turning “aside to the right hand or to the left.”\n\nThe workers described in2 Kings 22:3–7were trusted with the money to rebuild the temple “because they dealt faithfully” (verse 7). After reading these verses, you and your children could talk about things you have been trusted with. How can we be trustworthy like the workers in these verses?\n\nA scribe bringing a scroll of scripture to King Josiah; illustration by Robert T. Barrett\n\n2 Kings 22:8–11;23:2–3"
      },
      {
        "title": "The scriptures teach me to follow Jesus Christ.",
        "content": "To introduce the story of King Josiah in2 Kings 22–23, you could hide a copy of the scriptures somewhere in the room. Invite your children to find it. Then you could share what happened when one of Josiah’s priests found the scriptures in the temple (see2 Kings 22:8–11; see also “King Josiah” inOld Testament Stories, 148–49). What might happen to us if we didn’t have the scriptures? Share with each other why you are glad we have the scriptures today.\n\nKing Josiah\n\nAfter reading2 Kings 23:2–3, you and your children could talk about scriptures that have inspired you to “walk after the Lord” (verse 3). You could also sing a song about the scriptures, such as “Search, Ponder, and Pray” (Children’s Songbook, 109).\n\n2 Kings 23:1–3"
      },
      {
        "title": "I will keep my covenants with God.",
        "content": "When Josiah and his people learned the commandments of God, they made a covenant to live them. Read about this with your children in2 Kings 23:1–3, and help them find words or phrases that show how the people felt about the Lord’s commandments. Maybe your children could stand and talk about what it might mean to “[stand] to the covenant.” Then they could walk in place and talk about what it might mean to “walk after the Lord.” Next, they could place their hands on their hearts and suggest ways we can keep our covenants “with all [our] heart.”\n\nFor more, see this month’s issue of theFriendmagazine.\n\nJosiah’s people removing idols from the city; illustration by William Hole"
      }
    ],
    "study_helps": [],
    "raw_text": "July 13–19. “He Trusted in the Lord God of Israel”: 2 Kings 16–25\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nJune 29–July 5\n1 Kings 12–13; 17–22\nJuly 6–12\n2 Kings 2–7\nThoughts to Keep in Mind\nJesus Will Say to All Israel, “Come Home”\nJuly 13–19\n2 Kings 16–25\nJuly 20–26\n2 Chronicles 14–20; 26; 30\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nJuly 13–19. “He Trusted in the Lord God of Israel”: 2 Kings 16–25\n“July 13–19. ‘He Trusted in the Lord God of Israel’: 2 Kings 16–25,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“July 13–19. ‘He Trusted in the Lord God of Israel,’”\nCome, Follow Me: Old Testament 2026\nThe Flight of the Prisoners\n, by James Jacques Joseph Tissot and others\nJuly 13–19: “He Trusted in the Lord God of Israel”\n2 Kings 16–25\nDespite the prophet Elisha’s powerful ministry, the people of the Northern Kingdom of Israel did not repent. Eventually, the Assyrian Empire conquered and scattered the ten tribes of Israel. Meanwhile, the Southern Kingdom of Judah wasn’t doing much better: idolatry was also widespread there.\nAmid all this spiritual decay, the scriptures mention two kings of Judah who, for a time, turned their people back to the Lord. One was Hezekiah. During his reign, the Assyrians conquered much of Judah. But Hezekiah and his people showed faith in the Lord, who saved Jerusalem in a miraculous way. Later, after another period of apostasy, Josiah became king. Inspired in part by a rediscovery of the book of the law of Moses, Josiah brought reforms that revived the religious life of his people.\nLike Israel and Judah, we all make both good and bad choices. When we sense that our lives need some reforms, we can take encouragement from these two bright spots in the dark years of Judah’s history. Perhaps the examples of Hezekiah and Josiah can inspire us to “trust in the Lord our God” (\n2 Kings 18:22\n).\nIdeas for Learning at Home and at Church\n2 Kings 18–19\nI can stay true to the Lord when my faith is challenged.\nMost of us have experiences that challenge our faith. For Hezekiah and his people, one of those challenges came when the Assyrian army approached Jerusalem. As you read\n2 Kings 18–19\n, imagine that you lived in Jerusalem during this time. How might you have felt, for example, hearing the Assyrians’ taunts in\n2 Kings 18:28–37\n;\n19:10–13\n? What would you have done? Compare the Assyrians’ reasons for the Israelites not to trust the Lord with the reasons Satan gives for us to doubt our faith today. You could also contrast the Assyrians’ reasons with your reasons why you\ndo\ntrust the Lord.\nWhat do you learn from Hezekiah’s actions in this situation? (see\n2 Kings 19:1–7, 14–19\n). How did the Lord respond? (see\n2 Kings 19:35–37\n). Why do you think Hezekiah remained faithful? (see\n2 Kings 18:5–7\n). Ponder how the Lord has sustained you in challenging times. What do you feel inspired to do to increase your trust in Him?\nPresident Jeffrey R. Holland’s message “\nFear Not: Believe Only!\n” (\nLiahona\n, May 2022, 34–36) has helpful counsel for times of fear or doubt. A hymn like “\nLet Us All Press On\n” (\nHymns\n, no. 243) could also have encouraging messages. What do you find in these resources that helps you?\nSee also\n2 Chronicles 31–32\n;\n3 Nephi 3–4\n; Jörg Klebingat, “\nValiant Discipleship in the Latter Days\n,”\nLiahona\n, May 2022, 107–10.\nUse scripture study helps.\nThe Church provides many resources to help you understand the scriptures. For example, in the Gospel Library you can find the\nGuide to the Scriptures\n,\nTopics and Questions\n, and\nChurch magazines\n. In addition, as you read the Old Testament, you can find helpful context and insights in the “Thoughts to Keep in Mind” articles in\nCome, Follow Me\n. The article titled “J\nesus Will Say to All Israel, ‘Come Home’\n” might help your study of\n2 Kings 16–25\n.\n2 Kings 19:20–37\nAll things are in the Lord’s hands.\nSennacherib, the king of Assyria, had good reason to believe that his army would conquer Jerusalem (see\n2 Kings 17\n;\n18:33–34\n;\n19:11–13\n). But the Lord had a message regarding Sennacherib, given through the prophet Isaiah. It’s recorded in\n2 Kings 19:20–34\n. What truths do you find in the Lord’s message that help you have faith in Him and His plan?\n2 Kings 21–23\nThe scriptures can turn my heart to the Lord.\nHave you ever felt that you were lacking something spiritually? Maybe you felt that your relationship with God could be stronger. What helped you turn back to Him? Ponder these questions as you read\n2 Kings 21–23\n, which describes how the Kingdom of Judah fell away from the Lord under King Manasseh (see\n2 Kings 21\n) and how King Josiah helped the people turn back to Him (see\n2 Kings 22–23\n). How and why did Josiah and his people change? (see\n2 Kings 22:8–11\n;\n23:1–6, 21, 24\n).\nPresident Spencer W. Kimball called the story of King Josiah “one of the finest stories in all of the scriptures” (\nTeachings of Presidents of the Church: Spencer W. Kimball\n[2006], 62). Read President Kimball’s words about King Josiah (\npages 62–64\n). Perhaps you can think of an experience when a passage of scripture “work[ed] mightily” in you. What might you do to receive more experiences like that?\nSee also\nAlma 31:5\n; “Josiah and the Book of the Law” (video), Gospel Library.\n12:25\nJosiah and the Book of the Law\n2 Kings 23:1–25\nA covenant is a whole-souled commitment between me and the Lord.\nWhat impresses you about the covenant Josiah made in\n2 Kings 23:3\n? As you continue reading\nchapter 23\n, notice what Josiah did to show his commitment to the Lord (see also the picture at the end of this outline). How can you show your commitment to Him?\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n2 Kings 18:3–6\n;\n19:14–19\nI can trust Heavenly Father and Jesus Christ.\nIn\n2 Kings 18:3, 5–6\n, help your children discover what made Hezekiah a good king. Then as you read together\n2 Kings 19:14–19\n, they could discover how he showed that he trusted the Lord. You could look at a picture of Jesus and talk about why we can trust Him. How can we show that we trust the Lord?\n2 Kings 22:1–7\nHeavenly Father and Jesus Christ can trust me.\nIn\n2 Kings 22:1\n, help your children discover how old Josiah was when he became king. What do we learn about Josiah in\nverse 2\n? Consider an activity that could illustrate following the Lord and not turning “aside to the right hand or to the left.”\nThe workers described in\n2 Kings 22:3–7\nwere trusted with the money to rebuild the temple “because they dealt faithfully” (\nverse 7\n). After reading these verses, you and your children could talk about things you have been trusted with. How can we be trustworthy like the workers in these verses?\nA scribe bringing a scroll of scripture to King Josiah; illustration by Robert T. Barrett\n2 Kings 22:8–11\n;\n23:2–3\nThe scriptures teach me to follow Jesus Christ.\nTo introduce the story of King Josiah in\n2 Kings 22–23\n, you could hide a copy of the scriptures somewhere in the room. Invite your children to find it. Then you could share what happened when one of Josiah’s priests found the scriptures in the temple (see\n2 Kings 22:8–11\n; see also “\nKing Josiah\n” in\nOld Testament Stories\n, 148–49). What might happen to us if we didn’t have the scriptures? Share with each other why you are glad we have the scriptures today.\n1:36\nKing Josiah\nAfter reading\n2 Kings 23:2–3\n, you and your children could talk about scriptures that have inspired you to “walk after the Lord” (\nverse 3\n). You could also sing a song about the scriptures, such as “\nSearch, Ponder, and Pray\n” (\nChildren’s Songbook\n, 109).\n2 Kings 23:1–3\nI will keep my covenants with God.\nWhen Josiah and his people learned the commandments of God, they made a covenant to live them. Read about this with your children in\n2 Kings 23:1–3\n, and help them find words or phrases that show how the people felt about the Lord’s commandments. Maybe your children could stand and talk about what it might mean to “[stand] to the covenant.” Then they could walk in place and talk about what it might mean to “walk after the Lord.” Next, they could place their hands on their hearts and suggest ways we can keep our covenants “with all [our] heart.”\nFor more, see this month’s issue of the\nFriend\nmagazine.\nJosiah’s people removing idols from the city; illustration by William Hole\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "2 Kings 16",
      "title": "2 Kings 16",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/16?lang=eng",
      "summary": "Ahaz reigns in wickedness in JudahâHe offers his son in heathen sacrificeâHe makes a new altar, destroys the brazen sea, and changes the method for sacrificing in the temple.",
      "verses": [
        "1In the seventeenth year of Pekah the son of RemaliahAhazthe son of Jotham king of Judah began to reign.",
        "2Twenty years oldwasAhaz when he began to reign, and reigned sixteen years in Jerusalem, and did notthat which wasright in the sight of theLordhis God, like David his father.",
        "3But he walked in the way of the kings of Israel, yea, and made his son to pass through thefire, according to the abominations of theheathen, whom theLordcast out from before the children of Israel.",
        "4And he sacrificed and burnt incense in thehigh places, and on the hills, and under every green tree.",
        "5Â¶ThenRezinking of Syria and Pekah son of Remaliah king of Israel came up to Jerusalem to war: and they besieged Ahaz, but could not overcomehim.",
        "6At that time Rezin king of Syria recovered Elath to Syria, and drave the Jews from Elath: and the Syrians came to Elath, and dwelt there unto this day.",
        "7So Ahaz sent messengers toTiglath-pileserking ofAssyria, saying, Iamthy servant and thy son: come up, andsaveme out of the hand of the king of Syria, and out of the hand of the king of Israel, which rise up against me.",
        "8And Ahaztookthe silver and gold that was found in the house of theLord, and in the treasures of the kingâs house, and sentit fora present to the king of Assyria.",
        "9And the king of Assyria hearkened unto him: for the king of Assyria went up against Damascus, and took it, and carriedthe people ofit captive to Kir, and slew Rezin.",
        "10Â¶And king Ahaz went to Damascus to meet Tiglath-pileser king of Assyria, and saw an altar thatwasat Damascus: and king Ahaz sent to Urijah the priest the fashion of the altar, and the pattern of it, according to all the workmanship thereof.",
        "11And Urijah the priest built an altar according to all that king Ahaz had sent from Damascus: so Urijah the priest madeitagainst king Ahaz came from Damascus.",
        "12And when the king was come from Damascus, the king saw the altar: and the king approached to the altar, and offered thereon.",
        "13And he burnt his burnt offering and his meat offering, and poured his drink offering, and sprinkled the blood of his peace offerings, upon the altar.",
        "14And he brought also the brasen altar, whichwasbefore theLord, from the forefront of the house, from between the altar and the house of theLord, and put it on the north side of the altar.",
        "15And king Ahaz commanded Urijah the priest, saying, Upon thegreat altar burn the morning burnt offering, and the evening meat offering, and the kingâs burnt sacrifice, and his meat offering, with the burnt offering of all the people of the land, and their meat offering, and their drink offerings; and sprinkle upon it all the blood of the burnt offering, and all the blood of the sacrifice: and the brasen altar shall be for me to inquireby.",
        "16Thus did Urijah the priest, according to all that king Ahaz commanded.",
        "17Â¶And king Ahaz cut off the borders of the bases, and removed the laver from off them; and took down theseafrom off the brasen oxen thatwereunder it, and put it upon a pavement of stones.",
        "18And the covert for the sabbath that they had built in the house, and the kingâs entry without, turned he from thehouseof theLordfor the king of Assyria.",
        "19Â¶Now the rest of the acts of Ahaz which he did,arethey not written in the book of the chronicles of the kings of Judah?",
        "20AndAhazslept with his fathers, and was buried with his fathers in the city of David: and Hezekiah his son reigned in his stead."
      ],
      "full_text": "1In the seventeenth year of Pekah the son of RemaliahAhazthe son of Jotham king of Judah began to reign. 2Twenty years oldwasAhaz when he began to reign, and reigned sixteen years in Jerusalem, and did notthat which wasright in the sight of theLordhis God, like David his father. 3But he walked in the way of the kings of Israel, yea, and made his son to pass through thefire, according to the abominations of theheathen, whom theLordcast out from before the children of Israel. 4And he sacrificed and burnt incense in thehigh places, and on the hills, and under every green tree. 5Â¶ThenRezinking of Syria and Pekah son of Remaliah king of Israel came up to Jerusalem to war: and they besieged Ahaz, but could not overcomehim. 6At that time Rezin king of Syria recovered Elath to Syria, and drave the Jews from Elath: and the Syrians came to Elath, and dwelt there unto this day. 7So Ahaz sent messengers toTiglath-pileserking ofAssyria, saying, Iamthy servant and thy son: come up, andsaveme out of the hand of the king of Syria, and out of the hand of the king of Israel, which rise up against me. 8And Ahaztookthe silver and gold that was found in the house of theLord, and in the treasures of the kingâs house, and sentit fora present to the king of Assyria. 9And the king of Assyria hearkened unto him: for the king of Assyria went up against Damascus, and took it, and carriedthe people ofit captive to Kir, and slew Rezin. 10Â¶And king Ahaz went to Damascus to meet Tiglath-pileser king of Assyria, and saw an altar thatwasat Damascus: and king Ahaz sent to Urijah the priest the fashion of the altar, and the pattern of it, according to all the workmanship thereof. 11And Urijah the priest built an altar according to all that king Ahaz had sent from Damascus: so Urijah the priest madeitagainst king Ahaz came from Damascus. 12And when the king was come from Damascus, the king saw the altar: and the king approached to the altar, and offered thereon. 13And he burnt his burnt offering and his meat offering, and poured his drink offering, and sprinkled the blood of his peace offerings, upon the altar. 14And he brought also the brasen altar, whichwasbefore theLord, from the forefront of the house, from between the altar and the house of theLord, and put it on the north side of the altar. 15And king Ahaz commanded Urijah the priest, saying, Upon thegreat altar burn the morning burnt offering, and the evening meat offering, and the kingâs burnt sacrifice, and his meat offering, with the burnt offering of all the people of the land, and their meat offering, and their drink offerings; and sprinkle upon it all the blood of the burnt offering, and all the blood of the sacrifice: and the brasen altar shall be for me to inquireby. 16Thus did Urijah the priest, according to all that king Ahaz commanded. 17Â¶And king Ahaz cut off the borders of the bases, and removed the laver from off them; and took down theseafrom off the brasen oxen thatwereunder it, and put it upon a pavement of stones. 18And the covert for the sabbath that they had built in the house, and the kingâs entry without, turned he from thehouseof theLordfor the king of Assyria. 19Â¶Now the rest of the acts of Ahaz which he did,arethey not written in the book of the chronicles of the kings of Judah? 20AndAhazslept with his fathers, and was buried with his fathers in the city of David: and Hezekiah his son reigned in his stead."
    },
    {
      "reference": "2 Kings 17",
      "title": "2 Kings 17",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/17?lang=eng",
      "summary": "Hoshea reigns in Israel and is subject to the AssyriansâThe Israelites forsake the Lord, worship idols, serve Baal, and reject all that the Lord has given themâThe ten tribes are carried away captive by the kings of AssyriaâThe land of Israel (Samaria) is repopulated by other peopleâMany forms of false worship are found among the Samaritans.",
      "verses": [
        "1In the twelfth year of Ahaz king of Judah began Hoshea the son of Elah to reign in Samaria over Israel nine years.",
        "2And he didthat which wasevil in the sight of theLord, but not as the kings of Israel that were before him.",
        "3Â¶Against him came upShalmaneserking of Assyria; and Hoshea became his servant, and gave him presents.",
        "4And the king of Assyria foundconspiracyin Hoshea: for he had sent messengers to So king of Egypt, and brought no present to the king of Assyria, ashe had doneyear by year: therefore the king of Assyria shut him up, and bound him in prison.",
        "5Â¶Then the king ofAssyriacame up throughout all the land, and went up to Samaria, and besieged it three years.",
        "6Â¶In the ninth year of Hoshea the king of Assyria tookSamaria, andcarriedIsraelaway intoAssyria, and placed them in Halah and in Haborbythe river of Gozan, and in the cities of the Medes.",
        "7Forsoit was, that the children of Israel hadsinnedagainst theLordtheir God, which had brought them up out of the land of Egypt, from under the hand of Pharaoh king of Egypt, and had feared other gods,",
        "8And walked in the statutes of theheathen, whom theLordcast out from before the children of Israel, and of the kings of Israel, which they had made.",
        "9And the children of Israel did secretlythosethings thatwerenot right against theLordtheir God, and they built them high places in all their cities, from the tower of the watchmen to the fenced city.",
        "10And they set them up images andgrovesin every high hill, and under every green tree:",
        "11And there they burnt incense in all the high places, asdidthe heathen whom theLordcarried away before them; and wrought wickedthings to provoke theLordto anger:",
        "12For they served idols, whereof theLordhad said unto them, Ye shallnotdo this thing.",
        "13Yet theLordtestifiedagainst Israel, and against Judah, by all theprophets,and byall theseers, saying, Turn ye from your evil ways, and keep my commandmentsandmy statutes, according to all the law which I commanded your fathers, and which I sent to you by my servants the prophets.",
        "14Notwithstanding they wouldnot hear, buthardenedtheir necks, like to the neck of their fathers, that did notbelievein theLordtheir God.",
        "15And they rejected his statutes, and his covenant that he made with their fathers, and his testimonies which he testified against them; and they followed vanity, and becamevain, and went after the heathen thatwereround about them,concerningwhom theLordhad charged them, that they should not do like them.",
        "16And they left all the commandments of theLordtheir God, and made them molten images,eventwocalves, and made agrove, and worshipped all thehostof heaven, and servedBaal.",
        "17And they caused their sons and their daughters to pass through thefire, and useddivinationand enchantments, and sold themselves to doevilin the sight of theLord, to provoke him to anger.",
        "18Therefore theLordwas very angry with Israel, andremovedthem out of his sight: there was none left but the tribe ofJudahonly.",
        "19Also Judah kept not the commandments of theLordtheir God, but walked in the statutes of Israel which they made.",
        "20And theLordrejectedall the seed of Israel, and afflicted them, and delivered them into the hand of spoilers, until he had cast them out of his sight.",
        "21For he rent Israel from the house of David; and they made Jeroboam the son of Nebat king: and Jeroboam drave Israel from following theLord, and made them sin a great sin.",
        "22For the children of Israel walked in all the sins of Jeroboam which he did; they departed not from them;",
        "23Until theLordremoved Israel out of his sight, as he had said by all his servants theprophets. So wasIsraelcarried awayout of their ownlandto Assyria unto this day.",
        "24Â¶And the king of Assyriabroughtmenfrom Babylon, and from Cuthah, and from Ava, and from Hamath, and from Sepharvaim, and placedthemin the cities of Samaria instead of the children of Israel: and they possessed Samaria, and dwelt in the cities thereof.",
        "25Andsoit was at the beginning of their dwelling there,thatthey feared not theLord: therefore theLordsent lions among them, which slewsomeof them.",
        "26Wherefore they spake to the king of Assyria, saying, The nations which thou hast removed, and placed in the cities of Samaria, know not the manner of the God of the land: therefore he hath sent lions among them, and, behold, they slaythem, because they know not the manner of the God of the land.",
        "27Then the king of Assyria commanded, saying, Carry thither one of the priests whom ye brought from thence; and let them go and dwell there, and let him teach them the manner of the God of the land.",
        "28Then one of the priests whom they had carried away from Samaria came and dwelt in Beth-el, and taught them how they should fear theLord.",
        "29Howbeit every nation made gods of their own, and putthemin thehousesof the high places which theSamaritanshad made, every nation in their cities wherein they dwelt.",
        "30And the men of Babylon made Succoth-benoth, and the men of Cuth made Nergal, and the men of Hamath made Ashima,",
        "31And the Avites made Nibhaz and Tartak, and the Sepharvites burnt theirchildrenin fire to Adrammelech and Anammelech, the gods of Sepharvaim.",
        "32So they feared theLord, and made unto themselves of the lowest of them priests of the high places, which sacrificed for them in the houses of the high places.",
        "33They feared theLord, and served their own gods, after the manner of the nations whom they carried away from thence.",
        "34Unto this day they do after the former manners: they fear not theLord, neither do they after their statutes, or after their ordinances, or after the law and commandment which theLordcommanded the children of Jacob, whom he namedIsrael;",
        "35With whom theLordhad made a covenant, and charged them, saying, Ye shall notfearothergods, nor bow yourselves to them, nor serve them, nor sacrifice to them:",
        "36But theLord, who brought you up out of the land of Egypt with great power and a stretched out arm, him shall ye fear, and him shall ye worship, and to him shall ye do sacrifice.",
        "37And the statutes, and theordinances, and the law, and the commandment, which he wrote for you, ye shall observe to do for evermore; and ye shall not fear other gods.",
        "38And the covenant that I have made with you ye shall notforget; neither shall ye fear other gods.",
        "39But theLordyour God ye shall fear; and he shalldeliveryou out of the hand of all your enemies.",
        "40Howbeit they did not hearken, but they did after their former manner.",
        "41So these nations feared theLord, and served their graven images, both their children, and their childrenâs children: as did their fathers, so do they unto this day."
      ],
      "full_text": "1In the twelfth year of Ahaz king of Judah began Hoshea the son of Elah to reign in Samaria over Israel nine years. 2And he didthat which wasevil in the sight of theLord, but not as the kings of Israel that were before him. 3Â¶Against him came upShalmaneserking of Assyria; and Hoshea became his servant, and gave him presents. 4And the king of Assyria foundconspiracyin Hoshea: for he had sent messengers to So king of Egypt, and brought no present to the king of Assyria, ashe had doneyear by year: therefore the king of Assyria shut him up, and bound him in prison. 5Â¶Then the king ofAssyriacame up throughout all the land, and went up to Samaria, and besieged it three years. 6Â¶In the ninth year of Hoshea the king of Assyria tookSamaria, andcarriedIsraelaway intoAssyria, and placed them in Halah and in Haborbythe river of Gozan, and in the cities of the Medes. 7Forsoit was, that the children of Israel hadsinnedagainst theLordtheir God, which had brought them up out of the land of Egypt, from under the hand of Pharaoh king of Egypt, and had feared other gods, 8And walked in the statutes of theheathen, whom theLordcast out from before the children of Israel, and of the kings of Israel, which they had made. 9And the children of Israel did secretlythosethings thatwerenot right against theLordtheir God, and they built them high places in all their cities, from the tower of the watchmen to the fenced city. 10And they set them up images andgrovesin every high hill, and under every green tree: 11And there they burnt incense in all the high places, asdidthe heathen whom theLordcarried away before them; and wrought wickedthings to provoke theLordto anger: 12For they served idols, whereof theLordhad said unto them, Ye shallnotdo this thing. 13Yet theLordtestifiedagainst Israel, and against Judah, by all theprophets,and byall theseers, saying, Turn ye from your evil ways, and keep my commandmentsandmy statutes, according to all the law which I commanded your fathers, and which I sent to you by my servants the prophets. 14Notwithstanding they wouldnot hear, buthardenedtheir necks, like to the neck of their fathers, that did notbelievein theLordtheir God. 15And they rejected his statutes, and his covenant that he made with their fathers, and his testimonies which he testified against them; and they followed vanity, and becamevain, and went after the heathen thatwereround about them,concerningwhom theLordhad charged them, that they should not do like them. 16And they left all the commandments of theLordtheir God, and made them molten images,eventwocalves, and made agrove, and worshipped all thehostof heaven, and servedBaal. 17And they caused their sons and their daughters to pass through thefire, and useddivinationand enchantments, and sold themselves to doevilin the sight of theLord, to provoke him to anger. 18Therefore theLordwas very angry with Israel, andremovedthem out of his sight: there was none left but the tribe ofJudahonly. 19Also Judah kept not the commandments of theLordtheir God, but walked in the statutes of Israel which they made. 20And theLordrejectedall the seed of Israel, and afflicted them, and delivered them into the hand of spoilers, until he had cast them out of his sight. 21For he rent Israel from the house of David; and they made Jeroboam the son of Nebat king: and Jeroboam drave Israel from following theLord, and made them sin a great sin. 22For the children of Israel walked in all the sins of Jeroboam which he did; they departed not from them; 23Until theLordremoved Israel out of his sight, as he had said by all his servants theprophets. So wasIsraelcarried awayout of their ownlandto Assyria unto this day. 24Â¶And the king of Assyriabroughtmenfrom Babylon, and from Cuthah, and from Ava, and from Hamath, and from Sepharvaim, and placedthemin the cities of Samaria instead of the children of Israel: and they possessed Samaria, and dwelt in the cities thereof. 25Andsoit was at the beginning of their dwelling there,thatthey feared not theLord: therefore theLordsent lions among them, which slewsomeof them. 26Wherefore they spake to the king of Assyria, saying, The nations which thou hast removed, and placed in the cities of Samaria, know not the manner of the God of the land: therefore he hath sent lions among them, and, behold, they slaythem, because they know not the manner of the God of the land. 27Then the king of Assyria commanded, saying, Carry thither one of the priests whom ye brought from thence; and let them go and dwell there, and let him teach them the manner of the God of the land. 28Then one of the priests whom they had carried away from Samaria came and dwelt in Beth-el, and taught them how they should fear theLord. 29Howbeit every nation made gods of their own, and putthemin thehousesof the high places which theSamaritanshad made, every nation in their cities wherein they dwelt. 30And the men of Babylon made Succoth-benoth, and the men of Cuth made Nergal, and the men of Hamath made Ashima, 31And the Avites made Nibhaz and Tartak, and the Sepharvites burnt theirchildrenin fire to Adrammelech and Anammelech, the gods of Sepharvaim. 32So they feared theLord, and made unto themselves of the lowest of them priests of the high places, which sacrificed for them in the houses of the high places. 33They feared theLord, and served their own gods, after the manner of the nations whom they carried away from thence. 34Unto this day they do after the former manners: they fear not theLord, neither do they after their statutes, or after their ordinances, or after the law and commandment which theLordcommanded the children of Jacob, whom he namedIsrael; 35With whom theLordhad made a covenant, and charged them, saying, Ye shall notfearothergods, nor bow yourselves to them, nor serve them, nor sacrifice to them: 36But theLord, who brought you up out of the land of Egypt with great power and a stretched out arm, him shall ye fear, and him shall ye worship, and to him shall ye do sacrifice. 37And the statutes, and theordinances, and the law, and the commandment, which he wrote for you, ye shall observe to do for evermore; and ye shall not fear other gods. 38And the covenant that I have made with you ye shall notforget; neither shall ye fear other gods. 39But theLordyour God ye shall fear; and he shalldeliveryou out of the hand of all your enemies. 40Howbeit they did not hearken, but they did after their former manner. 41So these nations feared theLord, and served their graven images, both their children, and their childrenâs children: as did their fathers, so do they unto this day."
    },
    {
      "reference": "2 Kings 18",
      "title": "2 Kings 18",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/18?lang=eng",
      "summary": "Hezekiah reigns in righteousness in JudahâHe destroys idolatry and breaks the brazen serpent made by Moses because the children of Israel burn incense to itâSennacherib, king of Assyria, invades JudahâIn a blasphemous speech, Rabshakeh asks Jerusalem to surrender to the Assyrians.",
      "verses": [
        "1Now it came to pass in the third year of Hoshea son of Elah king of Israel,thatHezekiahthe son of Ahaz king of Judah began to reign.",
        "2Twenty and five years old was he when he began toreign; and he reigned twenty and nine years in Jerusalem. His motherâs name alsowasAbi, the daughter of Zachariah.",
        "3And he didthat which wasright in the sight of theLord, according to all that David his father did.",
        "4Â¶He removed thehigh places,and brake theimages, andcutdown the groves, and brake in pieces the brasenserpentthat Moses had made: for unto those days the children of Israel did burn incense to it: and he called it Nehushtan.",
        "5Hetrustedin theLordGod of Israel; so that after him was none like him among all the kings of Judah, noranythat were before him.",
        "6For heclaveto theLord,anddeparted not from following him, but kept his commandments, which theLordcommanded Moses.",
        "7And theLordwas with him;andhe prospered whithersoever he went forth: and he rebelled against the king of Assyria, and served him not.",
        "8He smote the Philistines,evenunto Gaza, and the borders thereof, from the tower of the watchmen to the fenced city.",
        "9Â¶And it came to pass in the fourth year of king Hezekiah, whichwasthe seventh year of Hoshea son of Elah king of Israel,thatShalmaneser king of Assyria came up against Samaria, and besieged it.",
        "10And at the end of three years they took it:evenin the sixth year of Hezekiah, thatisthe ninth year of Hoshea king of Israel, Samaria was taken.",
        "11And the king of Assyria did carry awayIsraelunto Assyria, and put them in Halah and in Haborbythe river of Gozan, and in the cities of the Medes:",
        "12Because theyobeyed notthe voice of theLordtheir God, but transgressed his covenant,andall that Moses the servant of theLordcommanded, and would not hearthem,nor dothem.",
        "13Â¶Now in thefourteenthyear of king Hezekiah did Sennacherib king of Assyria come up against all the fenced cities of Judah, and took them.",
        "14And Hezekiah king of Judah sent to the king of Assyria to Lachish, saying, I have offended; return from me: that which thou puttest on me will I bear. And the king of Assyria appointed unto Hezekiah king of Judah three hundred talents of silver and thirty talents of gold.",
        "15AndHezekiahgavehimall the silver that was found in the house of theLord, and in the treasures of the kingâs house.",
        "16At that time did Hezekiah cut offthe gold fromthe doors of the temple of theLord, andfromthe pillars which Hezekiah king of Judah had overlaid, and gave it to the king of Assyria.",
        "17Â¶And the king of AssyriasentTartanand Rabsaris and Rab-shakeh from Lachish to king Hezekiah with a great host against Jerusalem. And they went up and came to Jerusalem. And when they were come up, they came and stood by theconduitof the upper pool, whichisin the highway of the fullerâs field.",
        "18And when they had called to the king, there came out to themEliakimthe son of Hilkiah, whichwasover the household, and Shebna the scribe, and Joah the son of Asaph the recorder.",
        "19And Rab-shakeh said unto them, Speak ye now to Hezekiah, Thus saith the great king, the king of Assyria, What confidenceisthis wherein thou trustest?",
        "20Thou sayest, (butthey are butvain words,)I havecounsel and strength for the war. Now on whom dost thou trust, that thou rebellest against me?",
        "21Now, behold, thou trustest upon the staff of this bruisedreed,evenupon Egypt, on which if a man lean, it will go into his hand, and pierce it: soisPharaoh king of Egypt unto all that trust on him.",
        "22But if ye say unto me, We trustin theLordour God:isnot that he, whose high places and whose altars Hezekiah hath taken away, and hath said to Judah and Jerusalem, Ye shall worship before this altar in Jerusalem?",
        "23Now therefore, I pray thee, give pledges to my lord the king of Assyria, and I will deliver thee two thousand horses, if thou be able on thy part to set riders upon them.",
        "24How then wilt thou turn away the face of one captain of the least of my masterâs servants, and put thy trust on Egypt for chariots and for horsemen?",
        "25Am I now come up without theLordagainst this place to destroy it? TheLordsaid to me, Go up against this land, and destroy it.",
        "26Then said Eliakim the son of Hilkiah, and Shebna, and Joah, unto Rab-shakeh, Speak, I pray thee, to thy servants in the Syrian language; for we understandit:and talk not with us in the Jewsâ language in the ears of the people thatareon the wall.",
        "27But Rab-shakeh said unto them, Hath my master sent me to thy master, and to thee, to speak these words?hath henotsent meto the men which sit on the wall, that they may eat their own dung, and drink their own piss with you?",
        "28Then Rab-shakeh stood and cried with a loud voice in the Jewsâlanguage, and spake, saying, Hear the word of the great king, the king of Assyria:",
        "29Thus saith the king, Let not Hezekiah deceive you: for he shall not be able to deliver you out of his hand:",
        "30Neither let Hezekiah make you trust in theLord, saying, TheLordwill surely deliver us, and this city shall not be delivered into the hand of the king of Assyria.",
        "31Hearken not to Hezekiah: for thus saith the king of Assyria, Makean agreementwith me by a present, and come out to me, andtheneat ye every man of his own vine, and every one of his fig tree, and drink ye every one the waters of his cistern:",
        "32Until I come and take you away to a land like your own land, a land of corn and wine, a land of bread and vineyards, a land of oil olive and of honey, that ye may live, and not die: and hearken not unto Hezekiah, when he persuadeth you, saying, TheLordwill deliver us.",
        "33Hath any of the gods of the nations delivered at all his land out of the hand of the king of Assyria?",
        "34Wherearethe gods of Hamath, and of Arpad? wherearethe gods of Sepharvaim, Hena, and Ivah? have they delivered Samaria out of mine hand?",
        "35Whoarethey among all the gods of the countries, that have delivered their country out of mine hand, that theLordshould deliver Jerusalem out of mine hand?",
        "36But the people held their peace, and answered him not a word: for the kingâs commandment was, saying, Answer him not.",
        "37Then came Eliakim the son of Hilkiah, whichwasover the household, and Shebna the scribe, and Joah the son of Asaph the recorder, to Hezekiah withtheirclothes rent, and told him the words of Rab-shakeh."
      ],
      "full_text": "1Now it came to pass in the third year of Hoshea son of Elah king of Israel,thatHezekiahthe son of Ahaz king of Judah began to reign. 2Twenty and five years old was he when he began toreign; and he reigned twenty and nine years in Jerusalem. His motherâs name alsowasAbi, the daughter of Zachariah. 3And he didthat which wasright in the sight of theLord, according to all that David his father did. 4Â¶He removed thehigh places,and brake theimages, andcutdown the groves, and brake in pieces the brasenserpentthat Moses had made: for unto those days the children of Israel did burn incense to it: and he called it Nehushtan. 5Hetrustedin theLordGod of Israel; so that after him was none like him among all the kings of Judah, noranythat were before him. 6For heclaveto theLord,anddeparted not from following him, but kept his commandments, which theLordcommanded Moses. 7And theLordwas with him;andhe prospered whithersoever he went forth: and he rebelled against the king of Assyria, and served him not. 8He smote the Philistines,evenunto Gaza, and the borders thereof, from the tower of the watchmen to the fenced city. 9Â¶And it came to pass in the fourth year of king Hezekiah, whichwasthe seventh year of Hoshea son of Elah king of Israel,thatShalmaneser king of Assyria came up against Samaria, and besieged it. 10And at the end of three years they took it:evenin the sixth year of Hezekiah, thatisthe ninth year of Hoshea king of Israel, Samaria was taken. 11And the king of Assyria did carry awayIsraelunto Assyria, and put them in Halah and in Haborbythe river of Gozan, and in the cities of the Medes: 12Because theyobeyed notthe voice of theLordtheir God, but transgressed his covenant,andall that Moses the servant of theLordcommanded, and would not hearthem,nor dothem. 13Â¶Now in thefourteenthyear of king Hezekiah did Sennacherib king of Assyria come up against all the fenced cities of Judah, and took them. 14And Hezekiah king of Judah sent to the king of Assyria to Lachish, saying, I have offended; return from me: that which thou puttest on me will I bear. And the king of Assyria appointed unto Hezekiah king of Judah three hundred talents of silver and thirty talents of gold. 15AndHezekiahgavehimall the silver that was found in the house of theLord, and in the treasures of the kingâs house. 16At that time did Hezekiah cut offthe gold fromthe doors of the temple of theLord, andfromthe pillars which Hezekiah king of Judah had overlaid, and gave it to the king of Assyria. 17Â¶And the king of AssyriasentTartanand Rabsaris and Rab-shakeh from Lachish to king Hezekiah with a great host against Jerusalem. And they went up and came to Jerusalem. And when they were come up, they came and stood by theconduitof the upper pool, whichisin the highway of the fullerâs field. 18And when they had called to the king, there came out to themEliakimthe son of Hilkiah, whichwasover the household, and Shebna the scribe, and Joah the son of Asaph the recorder. 19And Rab-shakeh said unto them, Speak ye now to Hezekiah, Thus saith the great king, the king of Assyria, What confidenceisthis wherein thou trustest? 20Thou sayest, (butthey are butvain words,)I havecounsel and strength for the war. Now on whom dost thou trust, that thou rebellest against me? 21Now, behold, thou trustest upon the staff of this bruisedreed,evenupon Egypt, on which if a man lean, it will go into his hand, and pierce it: soisPharaoh king of Egypt unto all that trust on him. 22But if ye say unto me, We trustin theLordour God:isnot that he, whose high places and whose altars Hezekiah hath taken away, and hath said to Judah and Jerusalem, Ye shall worship before this altar in Jerusalem? 23Now therefore, I pray thee, give pledges to my lord the king of Assyria, and I will deliver thee two thousand horses, if thou be able on thy part to set riders upon them. 24How then wilt thou turn away the face of one captain of the least of my masterâs servants, and put thy trust on Egypt for chariots and for horsemen? 25Am I now come up without theLordagainst this place to destroy it? TheLordsaid to me, Go up against this land, and destroy it. 26Then said Eliakim the son of Hilkiah, and Shebna, and Joah, unto Rab-shakeh, Speak, I pray thee, to thy servants in the Syrian language; for we understandit:and talk not with us in the Jewsâ language in the ears of the people thatareon the wall. 27But Rab-shakeh said unto them, Hath my master sent me to thy master, and to thee, to speak these words?hath henotsent meto the men which sit on the wall, that they may eat their own dung, and drink their own piss with you? 28Then Rab-shakeh stood and cried with a loud voice in the Jewsâlanguage, and spake, saying, Hear the word of the great king, the king of Assyria: 29Thus saith the king, Let not Hezekiah deceive you: for he shall not be able to deliver you out of his hand: 30Neither let Hezekiah make you trust in theLord, saying, TheLordwill surely deliver us, and this city shall not be delivered into the hand of the king of Assyria. 31Hearken not to Hezekiah: for thus saith the king of Assyria, Makean agreementwith me by a present, and come out to me, andtheneat ye every man of his own vine, and every one of his fig tree, and drink ye every one the waters of his cistern: 32Until I come and take you away to a land like your own land, a land of corn and wine, a land of bread and vineyards, a land of oil olive and of honey, that ye may live, and not die: and hearken not unto Hezekiah, when he persuadeth you, saying, TheLordwill deliver us. 33Hath any of the gods of the nations delivered at all his land out of the hand of the king of Assyria? 34Wherearethe gods of Hamath, and of Arpad? wherearethe gods of Sepharvaim, Hena, and Ivah? have they delivered Samaria out of mine hand? 35Whoarethey among all the gods of the countries, that have delivered their country out of mine hand, that theLordshould deliver Jerusalem out of mine hand? 36But the people held their peace, and answered him not a word: for the kingâs commandment was, saying, Answer him not. 37Then came Eliakim the son of Hilkiah, whichwasover the household, and Shebna the scribe, and Joah the son of Asaph the recorder, to Hezekiah withtheirclothes rent, and told him the words of Rab-shakeh."
    },
    {
      "reference": "2 Kings 19",
      "title": "2 Kings 19",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/19?lang=eng",
      "summary": "Hezekiah seeks counsel from Isaiah to save JerusalemâIsaiah prophesies the defeat of the Assyrians and the death of SennacheribâHezekiah prays for deliveranceâSennacherib sends a blasphemous letterâIsaiah prophesies that the Assyrians will be destroyed and that a remnant of Judah will flourishâAn angel slays 185,000 AssyriansâSennacherib is slain by his sons.",
      "verses": [
        "1And it came to pass, when king Hezekiah heardit,that he rent his clothes, and covered himself with sackcloth, and went into thehouseof theLord.",
        "2And he sent Eliakim, whichwasover the household, and Shebna thescribe, and the elders of the priests, covered with sackcloth, to Isaiah the prophet the son of Amoz.",
        "3And they said unto him, Thus saith Hezekiah, This dayisa day of trouble, and of rebuke, and blasphemy: for the children are come to the birth, andthere isnot strength to bring forth.",
        "4It may be theLordthy God will hear all the words of Rab-shakeh, whom the king of Assyria his master hath sent to reproach the living God; and will reprove the words which theLordthy God hath heard: wherefore lift upthyprayerfor theremnantthat are left.",
        "5So the servants of king Hezekiah came to Isaiah.",
        "6Â¶AndIsaiahsaid unto them, Thus shall ye say to your master, Thus saith theLord, Be not afraid of the words which thou hast heard, with which the servants of the king of Assyria have blasphemed me.",
        "7Behold, I will send a blast upon him, and he shall hear a rumour, and shall return to his own land; and I will cause him to fall by the sword in his own land.",
        "8Â¶So Rab-shakeh returned, and found the king of Assyria warring against Libnah: for he had heard that he was departed from Lachish.",
        "9And when he heard say of Tirhakah king of Ethiopia, Behold, he is come out to fight against thee: he sent messengers again unto Hezekiah, saying,",
        "10Thus shall ye speak to Hezekiah king of Judah, saying, Let not thy God in whom thou trustestdeceivethee, saying, Jerusalem shall not be delivered into the hand of the king of Assyria.",
        "11Behold, thou hast heard what the kings of Assyria have done to all lands, by destroying them utterly: and shalt thou be delivered?",
        "12Have the gods of the nations delivered them which my fathers have destroyed;asGozan, and Haran, and Rezeph, and the children of Eden whichwerein Thelasar?",
        "13Whereisthe king of Hamath, and the king of Arpad, and the king of the city of Sepharvaim, of Hena, and Ivah?",
        "14Â¶And Hezekiah received the letter of the hand of the messengers, and read it: and Hezekiah went up into the house of theLord, and spread it before theLord.",
        "15And Hezekiah prayed before theLord, and said, OLordGod of Israel, which dwellestbetweenthecherubims, thou art theGod,eventhou alone, of all the kingdoms of the earth; thou hastmadeheaven and earth.",
        "16Lord, bow down thine ear, and hear: open,Lord, thine eyes, and see: and hear the words of Sennacherib, which hath sent him to reproach the living God.",
        "17Of a truth,Lord, the kings of Assyria have destroyed the nations and their lands,",
        "18And have cast their gods into the fire: for theywereno gods, but the work of menâs hands, wood and stone: therefore they have destroyed them.",
        "19Now therefore, OLordour God, I beseech thee, save thou us out of his hand, that all the kingdoms of the earth may know that thouarttheLordGod,eventhou only.",
        "20Â¶Then Isaiah the son of Amoz sent to Hezekiah, saying, Thus saith theLordGod of Israel,Thatwhich thou hastprayedto me against Sennacherib king of Assyria I have heard.",
        "21Thisisthe word that theLordhath spoken concerning him; Thevirginthe daughter of Zion hath despised thee,andlaughedthee to scorn; the daughter of Jerusalem hath shaken her head at thee.",
        "22Whom hast thou reproachedand blasphemed? and against whom hast thou exaltedthyvoice, and lifted up thine eyes on high?evenagainst the HolyOneof Israel.",
        "23By thy messengers thou hast reproached the Lord, and hast said, With themultitudeof my chariots I am come up to the height of the mountains, to the sides of Lebanon, and will cut down the tall cedar trees thereof,andthe choice fir trees thereof: and I will enter into the lodgings of his borders,and intothe forest of his Carmel.",
        "24I have digged and drunk strange waters, and with the sole of my feet have I dried up all the rivers of besieged places.",
        "25Hast thou not heard long agohowI have done it,andof ancient times that I have formed it? now have I brought it to pass, that thou shouldest be to lay waste fenced citiesintoruinous heaps.",
        "26Therefore their inhabitants were of small power, they were dismayed and confounded; they wereasthegrassof the field, andasthe green herb,asthe grass on the housetops, andas cornblasted before it be grown up.",
        "27But I know thy abode, and thy going out, and thy coming in, and thy rage against me.",
        "28Because thy rage against me and thy tumult is come up into mine ears, therefore I will put my hook in thy nose, and my bridle in thy lips, and I will turn thee back by the way by which thou camest.",
        "29And thisshall bea sign unto thee, Ye shall eat this year such things as grow of themselves, and in the second year that which springeth of the same; and in the third year sow ye, and reap, and plant vineyards, and eat the fruits thereof.",
        "30And theremnantthat is escaped of the house of Judah shall yet again take root downward, and bear fruit upward.",
        "31For out of Jerusalem shall go forth a remnant, and they that escape out of mount Zion: thezealof theLordof hostsshall do this.",
        "32Therefore thus saith theLordconcerning the king of Assyria, He shall not come into this city, nor shoot an arrow there, nor come before it with shield, nor cast a bank against it.",
        "33By the way that he came, by the same shall he return, and shall not come into this city, saith theLord.",
        "34For I willdefendthis city, to save it, for mine own sake, and for my servant Davidâs sake.",
        "35Â¶And it came to pass that night, that theangelof theLordwent out, andsmotein the camp of theAssyriansan hundred fourscore and five thousand: and when they arose early in the morning, behold, theywereall dead corpses.",
        "36So Sennacherib king of Assyria departed, and went and returned, and dwelt at Nineveh.",
        "37And it came to pass, as he was worshipping in the house of Nisroch his god, that Adrammelech and Sharezer his sons smote him with the sword: and they escaped into the land of Armenia. And Esarhaddon his son reigned in his stead."
      ],
      "full_text": "1And it came to pass, when king Hezekiah heardit,that he rent his clothes, and covered himself with sackcloth, and went into thehouseof theLord. 2And he sent Eliakim, whichwasover the household, and Shebna thescribe, and the elders of the priests, covered with sackcloth, to Isaiah the prophet the son of Amoz. 3And they said unto him, Thus saith Hezekiah, This dayisa day of trouble, and of rebuke, and blasphemy: for the children are come to the birth, andthere isnot strength to bring forth. 4It may be theLordthy God will hear all the words of Rab-shakeh, whom the king of Assyria his master hath sent to reproach the living God; and will reprove the words which theLordthy God hath heard: wherefore lift upthyprayerfor theremnantthat are left. 5So the servants of king Hezekiah came to Isaiah. 6Â¶AndIsaiahsaid unto them, Thus shall ye say to your master, Thus saith theLord, Be not afraid of the words which thou hast heard, with which the servants of the king of Assyria have blasphemed me. 7Behold, I will send a blast upon him, and he shall hear a rumour, and shall return to his own land; and I will cause him to fall by the sword in his own land. 8Â¶So Rab-shakeh returned, and found the king of Assyria warring against Libnah: for he had heard that he was departed from Lachish. 9And when he heard say of Tirhakah king of Ethiopia, Behold, he is come out to fight against thee: he sent messengers again unto Hezekiah, saying, 10Thus shall ye speak to Hezekiah king of Judah, saying, Let not thy God in whom thou trustestdeceivethee, saying, Jerusalem shall not be delivered into the hand of the king of Assyria. 11Behold, thou hast heard what the kings of Assyria have done to all lands, by destroying them utterly: and shalt thou be delivered? 12Have the gods of the nations delivered them which my fathers have destroyed;asGozan, and Haran, and Rezeph, and the children of Eden whichwerein Thelasar? 13Whereisthe king of Hamath, and the king of Arpad, and the king of the city of Sepharvaim, of Hena, and Ivah? 14Â¶And Hezekiah received the letter of the hand of the messengers, and read it: and Hezekiah went up into the house of theLord, and spread it before theLord. 15And Hezekiah prayed before theLord, and said, OLordGod of Israel, which dwellestbetweenthecherubims, thou art theGod,eventhou alone, of all the kingdoms of the earth; thou hastmadeheaven and earth. 16Lord, bow down thine ear, and hear: open,Lord, thine eyes, and see: and hear the words of Sennacherib, which hath sent him to reproach the living God. 17Of a truth,Lord, the kings of Assyria have destroyed the nations and their lands, 18And have cast their gods into the fire: for theywereno gods, but the work of menâs hands, wood and stone: therefore they have destroyed them. 19Now therefore, OLordour God, I beseech thee, save thou us out of his hand, that all the kingdoms of the earth may know that thouarttheLordGod,eventhou only. 20Â¶Then Isaiah the son of Amoz sent to Hezekiah, saying, Thus saith theLordGod of Israel,Thatwhich thou hastprayedto me against Sennacherib king of Assyria I have heard. 21Thisisthe word that theLordhath spoken concerning him; Thevirginthe daughter of Zion hath despised thee,andlaughedthee to scorn; the daughter of Jerusalem hath shaken her head at thee. 22Whom hast thou reproachedand blasphemed? and against whom hast thou exaltedthyvoice, and lifted up thine eyes on high?evenagainst the HolyOneof Israel. 23By thy messengers thou hast reproached the Lord, and hast said, With themultitudeof my chariots I am come up to the height of the mountains, to the sides of Lebanon, and will cut down the tall cedar trees thereof,andthe choice fir trees thereof: and I will enter into the lodgings of his borders,and intothe forest of his Carmel. 24I have digged and drunk strange waters, and with the sole of my feet have I dried up all the rivers of besieged places. 25Hast thou not heard long agohowI have done it,andof ancient times that I have formed it? now have I brought it to pass, that thou shouldest be to lay waste fenced citiesintoruinous heaps. 26Therefore their inhabitants were of small power, they were dismayed and confounded; they wereasthegrassof the field, andasthe green herb,asthe grass on the housetops, andas cornblasted before it be grown up. 27But I know thy abode, and thy going out, and thy coming in, and thy rage against me. 28Because thy rage against me and thy tumult is come up into mine ears, therefore I will put my hook in thy nose, and my bridle in thy lips, and I will turn thee back by the way by which thou camest. 29And thisshall bea sign unto thee, Ye shall eat this year such things as grow of themselves, and in the second year that which springeth of the same; and in the third year sow ye, and reap, and plant vineyards, and eat the fruits thereof. 30And theremnantthat is escaped of the house of Judah shall yet again take root downward, and bear fruit upward. 31For out of Jerusalem shall go forth a remnant, and they that escape out of mount Zion: thezealof theLordof hostsshall do this. 32Therefore thus saith theLordconcerning the king of Assyria, He shall not come into this city, nor shoot an arrow there, nor come before it with shield, nor cast a bank against it. 33By the way that he came, by the same shall he return, and shall not come into this city, saith theLord. 34For I willdefendthis city, to save it, for mine own sake, and for my servant Davidâs sake. 35Â¶And it came to pass that night, that theangelof theLordwent out, andsmotein the camp of theAssyriansan hundred fourscore and five thousand: and when they arose early in the morning, behold, theywereall dead corpses. 36So Sennacherib king of Assyria departed, and went and returned, and dwelt at Nineveh. 37And it came to pass, as he was worshipping in the house of Nisroch his god, that Adrammelech and Sharezer his sons smote him with the sword: and they escaped into the land of Armenia. And Esarhaddon his son reigned in his stead."
    },
    {
      "reference": "2 Kings 20",
      "title": "2 Kings 20",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/20?lang=eng",
      "summary": "Hezekiah is told he will die and pleads with the Lord; his life is lengthened fifteen yearsâThe shadow goes back ten degrees on the sundial of AhazâIsaiah prophesies the Babylonian captivity of Judah.",
      "verses": [
        "1In those days wasHezekiahsick unto death. And the prophet Isaiah the son of Amoz came to him, and said unto him, Thus saith theLord, Set thine house in order; for thou shaltdie, and not live.",
        "2Then he turned his face to the wall, and prayed unto theLord, saying,",
        "3I beseech thee, OLord, remember now how I have walked before thee in truth and with a perfect heart, and have donethat which isgood in thy sight. And Hezekiah wept sore.",
        "4And it came to pass, afore Isaiah was gone out into the middle court, that the word of theLordcame to him, saying,",
        "5Turn again, and tell Hezekiah the captain of my people, Thus saith theLord, the God of David thy father, I have heard thy prayer, I have seen thy tears: behold, I willhealthee: on the third day thou shalt go up unto the house of theLord.",
        "6And I will add unto thydaysfifteen years; and I will deliver thee and this city out of the hand of the king of Assyria; and I will defend this city for mine own sake, and for my servant Davidâs sake.",
        "7And Isaiah said, Take a lump of figs. And they took and laiditon the boil, and he recovered.",
        "8Â¶And Hezekiah said unto Isaiah, Whatshall bethesignthat theLordwill heal me, and that I shall go up into the house of theLordthe third day?",
        "9And Isaiah said, This sign shalt thou have of theLord, that theLordwill do the thing that he hath spoken: shall theshadowgo forward ten degrees, or go back ten degrees?",
        "10And Hezekiah answered, It is a light thing for theshadowto go down ten degrees: nay, but let the shadow return backward ten degrees.",
        "11And Isaiah the prophet cried unto theLord: and he brought the shadow ten degreesbackward, by which it had gone down in the dial of Ahaz.",
        "12Â¶At that timeBerodach-baladan, the son of Baladan, king of Babylon, sent letters and a present unto Hezekiah: for he had heard that Hezekiah had been sick.",
        "13And Hezekiah hearkened unto them, and shewed them all the house of his precious things, the silver, and the gold, and the spices, and the precious ointment, andallthe house of his armour, and all that was found in histreasures: there was nothing in his house, nor in all his dominion, that Hezekiah shewed them not.",
        "14Â¶Then came Isaiah the prophet unto king Hezekiah, and said unto him, What said these men? and from whence came they unto thee? And Hezekiah said, They are come from a far country,evenfrom Babylon.",
        "15And he said, What have they seen in thine house? And Hezekiah answered, Allthe thingsthatarein mine house have they seen: there is nothing among my treasures that I have not shewed them.",
        "16And Isaiah said unto Hezekiah, Hear the word of theLord.",
        "17Behold, the days come, that all thatisin thine house, and that which thy fathers have laid up in store unto this day, shall becarriedinto Babylon: nothing shall be left, saith theLord.",
        "18And of thysonsthat shall issue from thee, which thou shalt beget, shall they take away; and they shall beeunuchsin the palace of the king of Babylon.",
        "19Then said Hezekiah unto Isaiah, Goodisthe word of theLordwhich thou hast spoken. And he said,Is itnotgood,if peace and truth be in my days?",
        "20Â¶And the rest of the acts of Hezekiah, and all his might, and how he made apool, and a conduit, and brought water into the city,arethey not written in the book of the chronicles of the kings of Judah?",
        "21And Hezekiah slept with his fathers: and Manasseh his son reigned in his stead."
      ],
      "full_text": "1In those days wasHezekiahsick unto death. And the prophet Isaiah the son of Amoz came to him, and said unto him, Thus saith theLord, Set thine house in order; for thou shaltdie, and not live. 2Then he turned his face to the wall, and prayed unto theLord, saying, 3I beseech thee, OLord, remember now how I have walked before thee in truth and with a perfect heart, and have donethat which isgood in thy sight. And Hezekiah wept sore. 4And it came to pass, afore Isaiah was gone out into the middle court, that the word of theLordcame to him, saying, 5Turn again, and tell Hezekiah the captain of my people, Thus saith theLord, the God of David thy father, I have heard thy prayer, I have seen thy tears: behold, I willhealthee: on the third day thou shalt go up unto the house of theLord. 6And I will add unto thydaysfifteen years; and I will deliver thee and this city out of the hand of the king of Assyria; and I will defend this city for mine own sake, and for my servant Davidâs sake. 7And Isaiah said, Take a lump of figs. And they took and laiditon the boil, and he recovered. 8Â¶And Hezekiah said unto Isaiah, Whatshall bethesignthat theLordwill heal me, and that I shall go up into the house of theLordthe third day? 9And Isaiah said, This sign shalt thou have of theLord, that theLordwill do the thing that he hath spoken: shall theshadowgo forward ten degrees, or go back ten degrees? 10And Hezekiah answered, It is a light thing for theshadowto go down ten degrees: nay, but let the shadow return backward ten degrees. 11And Isaiah the prophet cried unto theLord: and he brought the shadow ten degreesbackward, by which it had gone down in the dial of Ahaz. 12Â¶At that timeBerodach-baladan, the son of Baladan, king of Babylon, sent letters and a present unto Hezekiah: for he had heard that Hezekiah had been sick. 13And Hezekiah hearkened unto them, and shewed them all the house of his precious things, the silver, and the gold, and the spices, and the precious ointment, andallthe house of his armour, and all that was found in histreasures: there was nothing in his house, nor in all his dominion, that Hezekiah shewed them not. 14Â¶Then came Isaiah the prophet unto king Hezekiah, and said unto him, What said these men? and from whence came they unto thee? And Hezekiah said, They are come from a far country,evenfrom Babylon. 15And he said, What have they seen in thine house? And Hezekiah answered, Allthe thingsthatarein mine house have they seen: there is nothing among my treasures that I have not shewed them. 16And Isaiah said unto Hezekiah, Hear the word of theLord. 17Behold, the days come, that all thatisin thine house, and that which thy fathers have laid up in store unto this day, shall becarriedinto Babylon: nothing shall be left, saith theLord. 18And of thysonsthat shall issue from thee, which thou shalt beget, shall they take away; and they shall beeunuchsin the palace of the king of Babylon. 19Then said Hezekiah unto Isaiah, Goodisthe word of theLordwhich thou hast spoken. And he said,Is itnotgood,if peace and truth be in my days? 20Â¶And the rest of the acts of Hezekiah, and all his might, and how he made apool, and a conduit, and brought water into the city,arethey not written in the book of the chronicles of the kings of Judah? 21And Hezekiah slept with his fathers: and Manasseh his son reigned in his stead."
    },
    {
      "reference": "2 Kings 21",
      "title": "2 Kings 21",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/21?lang=eng",
      "summary": "Manasseh turns Judah to idolatry, even sacrificing a son to a heathen godâProphets foretell the destruction of Judah and JerusalemâWickedness continues under Amon.",
      "verses": [
        "1Manassehwastwelve years old when he began to reign, and reigned fifty and five years in Jerusalem. And his motherâs namewasHephzi-bah.",
        "2And he didthat which wasevilin the sight of theLord, after theabominationsof the heathen, whom theLordcast out before the children of Israel.",
        "3For he built up again thehigh placeswhich Hezekiah his father had destroyed; and he reared up altars for Baal, and made agrove, as did Ahab king of Israel; and worshipped all thehostof heaven, and served them.",
        "4And he builtaltarsin thehouseof theLord, of which theLordsaid, In Jerusalem will I put myname.",
        "5And he built altars for all the host of heaven in the twocourtsof the house of theLord.",
        "6And he made his son pass through thefire, and observed times, and usedenchantments, and dealt withfamiliar spiritsand wizards: he wrought much wickedness in the sight of theLord, to provokehimto anger.",
        "7And he set a gravenimageof the grove that he had made in the house, of which theLordsaid to David, and to Solomon his son, In this house, and in Jerusalem, which I have chosen out of all tribes of Israel, will I put my name for ever:",
        "8Neither will I make the feet of Israel move any more out of the land which I gave their fathers; only if they will observe to do according to all that I have commanded them, and according to all the law that my servant Moses commanded them.",
        "9But they hearkened not: and Manasseh seduced them to do moreevilthan did the nations whom theLorddestroyed before the children of Israel.",
        "10Â¶And theLordspake by his servants the prophets, saying,",
        "11BecauseManassehking of Judah hath done theseabominations,andhath donewickedlyabove all that the Amorites did, whichwerebefore him, and hath made Judah also to sin with his idols:",
        "12Therefore thus saith theLordGod of Israel, Behold, Iambringingsuchevil upon Jerusalem and Judah, that whosoever heareth of it, both his ears shalltingle.",
        "13And I will stretch over Jerusalem the line of Samaria, and the plummet of the house of Ahab: and I will wipe Jerusalem asa manwipeth a dish, wipingit,and turningitupside down.",
        "14And I will forsake the remnant of mine inheritance, anddeliverthem into the hand of their enemies; and they shall become a prey and a spoil to all their enemies;",
        "15Because they have donethat which wasevil in my sight, and have provoked me to anger, since the day their fathers came forth out of Egypt, even unto this day.",
        "16Moreover Manassehshedinnocentbloodvery much, till he had filled Jerusalem from one end to another; beside his sin wherewith hemade Judah to sin, in doingthat which wasevil in the sight of theLord.",
        "17Â¶Now the rest of the acts ofManasseh, and all that he did, and his sin that he sinned,arethey not written in the book of the chronicles of the kings of Judah?",
        "18And Manasseh slept with his fathers, and was buried in the garden of his own house, in the garden of Uzza: and Amon his son reigned in his stead.",
        "19Â¶Amonwastwenty and two years old when he began to reign, and he reigned two years in Jerusalem. And his motherâs namewasMeshullemeth, the daughter of Haruz of Jotbah.",
        "20And he didthat which wasevil in the sight of theLord, as his father Manasseh did.",
        "21And he walked in all the way that his father walked in, and served the idols that his father served, and worshipped them:",
        "22And he forsook theLordGod of his fathers, and walked not in the way of theLord.",
        "23Â¶And the servants of Amon conspired against him, and slew the king in his own house.",
        "24And the people of the land slew all them that had conspired against king Amon; and the people of the land madeJosiahhis son king in his stead.",
        "25Now the rest of the acts of Amon which he did,arethey not written in the book of the chronicles of the kings of Judah?",
        "26And he was buried in his sepulchre in the garden of Uzza: and Josiah his son reigned in his stead."
      ],
      "full_text": "1Manassehwastwelve years old when he began to reign, and reigned fifty and five years in Jerusalem. And his motherâs namewasHephzi-bah. 2And he didthat which wasevilin the sight of theLord, after theabominationsof the heathen, whom theLordcast out before the children of Israel. 3For he built up again thehigh placeswhich Hezekiah his father had destroyed; and he reared up altars for Baal, and made agrove, as did Ahab king of Israel; and worshipped all thehostof heaven, and served them. 4And he builtaltarsin thehouseof theLord, of which theLordsaid, In Jerusalem will I put myname. 5And he built altars for all the host of heaven in the twocourtsof the house of theLord. 6And he made his son pass through thefire, and observed times, and usedenchantments, and dealt withfamiliar spiritsand wizards: he wrought much wickedness in the sight of theLord, to provokehimto anger. 7And he set a gravenimageof the grove that he had made in the house, of which theLordsaid to David, and to Solomon his son, In this house, and in Jerusalem, which I have chosen out of all tribes of Israel, will I put my name for ever: 8Neither will I make the feet of Israel move any more out of the land which I gave their fathers; only if they will observe to do according to all that I have commanded them, and according to all the law that my servant Moses commanded them. 9But they hearkened not: and Manasseh seduced them to do moreevilthan did the nations whom theLorddestroyed before the children of Israel. 10Â¶And theLordspake by his servants the prophets, saying, 11BecauseManassehking of Judah hath done theseabominations,andhath donewickedlyabove all that the Amorites did, whichwerebefore him, and hath made Judah also to sin with his idols: 12Therefore thus saith theLordGod of Israel, Behold, Iambringingsuchevil upon Jerusalem and Judah, that whosoever heareth of it, both his ears shalltingle. 13And I will stretch over Jerusalem the line of Samaria, and the plummet of the house of Ahab: and I will wipe Jerusalem asa manwipeth a dish, wipingit,and turningitupside down. 14And I will forsake the remnant of mine inheritance, anddeliverthem into the hand of their enemies; and they shall become a prey and a spoil to all their enemies; 15Because they have donethat which wasevil in my sight, and have provoked me to anger, since the day their fathers came forth out of Egypt, even unto this day. 16Moreover Manassehshedinnocentbloodvery much, till he had filled Jerusalem from one end to another; beside his sin wherewith hemade Judah to sin, in doingthat which wasevil in the sight of theLord. 17Â¶Now the rest of the acts ofManasseh, and all that he did, and his sin that he sinned,arethey not written in the book of the chronicles of the kings of Judah? 18And Manasseh slept with his fathers, and was buried in the garden of his own house, in the garden of Uzza: and Amon his son reigned in his stead. 19Â¶Amonwastwenty and two years old when he began to reign, and he reigned two years in Jerusalem. And his motherâs namewasMeshullemeth, the daughter of Haruz of Jotbah. 20And he didthat which wasevil in the sight of theLord, as his father Manasseh did. 21And he walked in all the way that his father walked in, and served the idols that his father served, and worshipped them: 22And he forsook theLordGod of his fathers, and walked not in the way of theLord. 23Â¶And the servants of Amon conspired against him, and slew the king in his own house. 24And the people of the land slew all them that had conspired against king Amon; and the people of the land madeJosiahhis son king in his stead. 25Now the rest of the acts of Amon which he did,arethey not written in the book of the chronicles of the kings of Judah? 26And he was buried in his sepulchre in the garden of Uzza: and Josiah his son reigned in his stead."
    },
    {
      "reference": "2 Kings 22",
      "title": "2 Kings 22",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/22?lang=eng",
      "summary": "Josiah reigns in righteousness in JudahâHilkiah repairs the temple and finds the book of the lawâJosiah sorrows because of the wickedness of his fathersâHuldah prophesies wrath upon the people but blessings upon Josiah.",
      "verses": [
        "1Josiahwaseight years old when he began to reign, and he reigned thirty and one years in Jerusalem. And his motherâs namewasJedidah, the daughter of Adaiah of Boscath.",
        "2And he didthat which wasright in the sight of theLord, and walked in all the way of David his father, and turned not aside to the right hand or to the left.",
        "3Â¶And it came to pass in the eighteenth year of king Josiah,thatthe king sent Shaphan the son of Azaliah, the son of Meshullam, the scribe, to the house of theLord, saying,",
        "4Go up toHilkiahthe high priest, that he may sum thesilverwhich is brought into the house of theLord, which the keepers of the door have gathered of the people:",
        "5And let them deliver it into the hand of the doers of the work, that have the oversight of the house of theLord: and let them give it to the doers of the work whichisin the house of theLord, to repair thebreachesof the house,",
        "6Unto carpenters, and builders, and masons, and to buy timber and hewn stone to repair the house.",
        "7Howbeit there was noreckoningmade with them of the money that was delivered into their hand, because they dealt faithfully.",
        "8Â¶And Hilkiah the high priest said unto Shaphan the scribe, I have found thebookof the law in the house of theLord. And Hilkiah gave the book to Shaphan, and he read it.",
        "9And Shaphan the scribe came to the king, and brought the king word again, and said, Thy servants have gathered the money that was found in the house, and have delivered it into the hand of them that do the work, that have the oversight of the house of theLord.",
        "10And Shaphan the scribe shewed the king, saying, Hilkiah the priest hath delivered me a book. And Shaphan read it before the king.",
        "11And it came to pass, when the king had heard thewordsof the book of the law, that he rent his clothes.",
        "12And the king commanded Hilkiah the priest, andAhikamthe son of Shaphan, and Achbor the son of Michaiah, and Shaphan the scribe, and Asahiah a servant of the kingâs, saying,",
        "13Go ye, inquire of theLordfor me, and for the people, and for all Judah, concerning the words of this book that is found: for greatisthewrathof theLordthat is kindled against us, because our fathers have not hearkened unto the words of this book, todoaccording unto all that which is written concerning us.",
        "14So Hilkiah the priest, and Ahikam, and Achbor, and Shaphan, and Asahiah, went unto Huldah the prophetess, the wife of Shallum the son of Tikvah, the son of Harhas, keeper of the wardrobe; (now she dwelt in Jerusalem in thecollege;) and they communed with her.",
        "15Â¶And she said unto them, Thus saith theLordGod of Israel, Tell the man that sent you to me,",
        "16Thus saith theLord, Behold, I will bring evil upon this place, and upon the inhabitants thereof,evenall the words of thebookwhich the king of Judah hath read:",
        "17Because they have forsaken me, and have burned incense unto other gods, that they mightprovokeme to anger with all the works of their hands; therefore my wrath shall be kindled against this place, and shall not be quenched.",
        "18But to the king of Judah which sent you to inquire of theLord, thus shall ye say to him, Thus saith theLordGod of Israel,As touchingthe words which thou hast heard;",
        "19Because thine heart was tender, and thou hasthumbledthyself before theLord, when thou heardest what I spake against this place, and against the inhabitants thereof, that they should become adesolationand acurse, and hast rent thy clothes, and wept before me; I also have heardthee,saith theLord.",
        "20Behold therefore, I will gather thee unto thy fathers, and thou shalt be gathered into thy grave inpeace; and thine eyes shall not see all the evil which I will bring upon this place. And they brought the king word again."
      ],
      "full_text": "1Josiahwaseight years old when he began to reign, and he reigned thirty and one years in Jerusalem. And his motherâs namewasJedidah, the daughter of Adaiah of Boscath. 2And he didthat which wasright in the sight of theLord, and walked in all the way of David his father, and turned not aside to the right hand or to the left. 3Â¶And it came to pass in the eighteenth year of king Josiah,thatthe king sent Shaphan the son of Azaliah, the son of Meshullam, the scribe, to the house of theLord, saying, 4Go up toHilkiahthe high priest, that he may sum thesilverwhich is brought into the house of theLord, which the keepers of the door have gathered of the people: 5And let them deliver it into the hand of the doers of the work, that have the oversight of the house of theLord: and let them give it to the doers of the work whichisin the house of theLord, to repair thebreachesof the house, 6Unto carpenters, and builders, and masons, and to buy timber and hewn stone to repair the house. 7Howbeit there was noreckoningmade with them of the money that was delivered into their hand, because they dealt faithfully. 8Â¶And Hilkiah the high priest said unto Shaphan the scribe, I have found thebookof the law in the house of theLord. And Hilkiah gave the book to Shaphan, and he read it. 9And Shaphan the scribe came to the king, and brought the king word again, and said, Thy servants have gathered the money that was found in the house, and have delivered it into the hand of them that do the work, that have the oversight of the house of theLord. 10And Shaphan the scribe shewed the king, saying, Hilkiah the priest hath delivered me a book. And Shaphan read it before the king. 11And it came to pass, when the king had heard thewordsof the book of the law, that he rent his clothes. 12And the king commanded Hilkiah the priest, andAhikamthe son of Shaphan, and Achbor the son of Michaiah, and Shaphan the scribe, and Asahiah a servant of the kingâs, saying, 13Go ye, inquire of theLordfor me, and for the people, and for all Judah, concerning the words of this book that is found: for greatisthewrathof theLordthat is kindled against us, because our fathers have not hearkened unto the words of this book, todoaccording unto all that which is written concerning us. 14So Hilkiah the priest, and Ahikam, and Achbor, and Shaphan, and Asahiah, went unto Huldah the prophetess, the wife of Shallum the son of Tikvah, the son of Harhas, keeper of the wardrobe; (now she dwelt in Jerusalem in thecollege;) and they communed with her. 15Â¶And she said unto them, Thus saith theLordGod of Israel, Tell the man that sent you to me, 16Thus saith theLord, Behold, I will bring evil upon this place, and upon the inhabitants thereof,evenall the words of thebookwhich the king of Judah hath read: 17Because they have forsaken me, and have burned incense unto other gods, that they mightprovokeme to anger with all the works of their hands; therefore my wrath shall be kindled against this place, and shall not be quenched. 18But to the king of Judah which sent you to inquire of theLord, thus shall ye say to him, Thus saith theLordGod of Israel,As touchingthe words which thou hast heard; 19Because thine heart was tender, and thou hasthumbledthyself before theLord, when thou heardest what I spake against this place, and against the inhabitants thereof, that they should become adesolationand acurse, and hast rent thy clothes, and wept before me; I also have heardthee,saith theLord. 20Behold therefore, I will gather thee unto thy fathers, and thou shalt be gathered into thy grave inpeace; and thine eyes shall not see all the evil which I will bring upon this place. And they brought the king word again."
    },
    {
      "reference": "2 Kings 23",
      "title": "2 Kings 23",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/23?lang=eng",
      "summary": "Josiah reads the book of the covenant to the peopleâThey covenant to keep the commandmentsâJosiah overturns the worship of false gods, removes the sodomites, and puts down idolatryâIdolatrous priests are slainâJudah holds a solemn PassoverâEgypt subjects the land of Judah.",
      "verses": [
        "1And the king sent, and they gathered unto him all the elders of Judah and of Jerusalem.",
        "2And the king went up into the house of theLord, and all the men of Judah and all the inhabitants of Jerusalem with him, and the priests, and the prophets, and all the people, both small and great: and hereadin their ears all the words of the book of the covenant which was found in the house of theLord.",
        "3Â¶And the king stood by apillar, and made acovenantbefore theLord, towalkafter theLord, and to keep his commandments and his testimonies and his statutes with alltheirheart and alltheirsoul, to perform the words of this covenant that were written in this book. And all the people stood to the covenant.",
        "4And the king commanded Hilkiah the high priest, and thepriestsof the second order, and thekeepersof the door, to bring forth out of the temple of theLordall the vessels that were made for Baal, and for the grove, and for all the host of heaven: and he burned them without Jerusalem in the fields of Kidron, and carried the ashes of them unto Beth-el.",
        "5And he put down the idolatrouspriests, whom the kings of Judah had ordained to burn incense in the high places in the cities of Judah, and in the places round about Jerusalem; them also that burned incense unto Baal, to the sun, and to the moon, and to the planets, and to all the host of heaven.",
        "6And he brought out thegrovefrom the house of theLord, without Jerusalem, unto the brook Kidron, and burned it at the brook Kidron, and stampeditsmall to powder, and cast the powder thereof upon the graves of the children of the people.",
        "7And he brake down the houses of thesodomites, thatwereby the house of theLord, where the women wove hangings for the grove.",
        "8And he brought all the priests out of the cities of Judah, and defiled the high places where the priests had burned incense, from Geba to Beer-sheba, and brake down the high places of the gates thatwerein the entering in of the gate of Joshua the governor of the city, whichwereon a manâs left hand at the gate of the city.",
        "9Nevertheless the priests of the high placescamenot up to the altar of theLordin Jerusalem, but they did eat of theunleavenedbread among their brethren.",
        "10And he defiledTopheth, whichisin the valley of the children ofHinnom, that no man might make his son or his daughter to pass through the fire toMolech.",
        "11And he took away the horses that the kings of Judah had given to the sun, at the entering in of the house of theLord, by the chamber of Nathan-melech the chamberlain, whichwasin the suburbs, and burned the chariots of the sun with fire.",
        "12And the altars thatwereon the top of theupperchamber of Ahaz, which the kings of Judah had made, and the altars which Manasseh had made in the two courts of the house of theLord, did the king beat down, and brakethemdown from thence, and cast the dust of them into the brook Kidron.",
        "13And thehigh placesthatwerebefore Jerusalem, whichwereon the right hand of the mount of corruption, which Solomon the king of Israel had builded for Ashtoreth the abomination of the Zidonians, and for Chemosh the abomination of the Moabites, and for Milcom the abomination of the children of Ammon, did the king defile.",
        "14And he brake in pieces the images, andcutdown the groves, and filled their places with the bones of men.",
        "15Â¶Moreover the altar thatwasat Beth-el,andthe high place which Jeroboam the son of Nebat, whomadeIsrael to sin, had made, both thataltarand the high place hebrakedown, and burned the high place,andstampeditsmall to powder, and burned the grove.",
        "16And as Josiah turned himself, he spied the sepulchres thatwerethere in the mount, and sent, and took the bones out of the sepulchres, and burnedthemupon the altar, andpolluted it, according to the word of theLordwhich the man of God proclaimed, who proclaimed these words.",
        "17Then he said, What titleisthat that I see? And the men of the city told him,It isthesepulchreof the man of God, which came from Judah, and proclaimed these things that thou hast done against the altar of Beth-el.",
        "18And he said, Let him alone; let no man move his bones. So they let his bones alone, with the bones of the prophet that came out of Samaria.",
        "19And all the houses also of the high places thatwerein the cities of Samaria, which the kings of Israel had made to provoketheLordto anger, Josiah took away, and did to them according to all the acts that he had done in Beth-el.",
        "20And he slew all the priests of thehigh placesthatwerethere upon the altars, andburnedmenâs bones upon them, and returned to Jerusalem.",
        "21Â¶And the king commanded all the people, saying, Keep thepassoverunto theLordyour God, asit iswritten in the book of this covenant.",
        "22Surely there was not holden such apassoverfrom the days of the judges that judged Israel, nor in all the days of the kings of Israel, nor of the kings of Judah;",
        "23But in the eighteenth year of king Josiah,whereinthis passover was holden to theLordin Jerusalem.",
        "24Â¶Moreover theworkerswithfamiliar spirits, and the wizards, and the images, and the idols, and all the abominations that were spied in the land of Judah and in Jerusalem, did Josiah put away, that he might perform the words of the law which were written in the book that Hilkiah the priest found in the house of theLord.",
        "25And like unto him was there nokingbefore him, thatturnedto theLordwith all his heart, and with all his soul, and with all his might, according to all the law of Moses; neither after him arose thereanylike him.",
        "26Â¶Notwithstanding theLordturned not from the fierceness of his great wrath, wherewith his anger was kindled against Judah, because of all the provocations that Manasseh hadprovokedhim withal.",
        "27And theLordsaid, I willremoveJudah also out of my sight, as I haveremovedIsrael, and will cast off this cityJerusalemwhich I have chosen, and the house of which I said, My name shall be there.",
        "28Now the rest of the acts of Josiah, and all that he did,arethey not written in the book of the chronicles of the kings of Judah?",
        "29Â¶In his daysPharaoh-nechohking of Egypt went up against the king of Assyria to the river Euphrates: and kingJosiahwent against him; and he slew him at Megiddo, when he had seen him.",
        "30And his servants carried him in a chariot dead from Megiddo, and brought him to Jerusalem, and buried him in his own sepulchre. And the people of the land tookJehoahazthe son of Josiah, and anointed him, and made him king in his fatherâs stead.",
        "31Â¶Jehoahazwastwenty and three years old when he began to reign; and he reigned three months in Jerusalem. And his motherâs namewasHamutal, the daughter of Jeremiah of Libnah.",
        "32And he didthat which wasevil in the sight of theLord, according to all that his fathers had done.",
        "33And Pharaoh-nechoh put him inbandsat Riblah in the land of Hamath, that he might not reign in Jerusalem; and put the land to a tribute of an hundred talents of silver, and a talent of gold.",
        "34And Pharaoh-nechoh made Eliakim the son of Josiah king in the room of Josiah his father, and turned his name toJehoiakim, and took Jehoahaz away: and he came to Egypt, and died there.",
        "35And Jehoiakim gave the silver and the gold to Pharaoh; but he taxed the land to give the money according to the commandment of Pharaoh: he exacted the silver and the gold of the people of the land, of every one according to his taxation, to giveitunto Pharaoh-nechoh.",
        "36Â¶Jehoiakimwastwenty and five years old when he began to reign; and he reigned eleven years in Jerusalem. And his motherâs namewasZebudah, the daughter of Pedaiah of Rumah.",
        "37And he didthat which wasevilin the sight of theLord, according to all that his fathers had done."
      ],
      "full_text": "1And the king sent, and they gathered unto him all the elders of Judah and of Jerusalem. 2And the king went up into the house of theLord, and all the men of Judah and all the inhabitants of Jerusalem with him, and the priests, and the prophets, and all the people, both small and great: and hereadin their ears all the words of the book of the covenant which was found in the house of theLord. 3Â¶And the king stood by apillar, and made acovenantbefore theLord, towalkafter theLord, and to keep his commandments and his testimonies and his statutes with alltheirheart and alltheirsoul, to perform the words of this covenant that were written in this book. And all the people stood to the covenant. 4And the king commanded Hilkiah the high priest, and thepriestsof the second order, and thekeepersof the door, to bring forth out of the temple of theLordall the vessels that were made for Baal, and for the grove, and for all the host of heaven: and he burned them without Jerusalem in the fields of Kidron, and carried the ashes of them unto Beth-el. 5And he put down the idolatrouspriests, whom the kings of Judah had ordained to burn incense in the high places in the cities of Judah, and in the places round about Jerusalem; them also that burned incense unto Baal, to the sun, and to the moon, and to the planets, and to all the host of heaven. 6And he brought out thegrovefrom the house of theLord, without Jerusalem, unto the brook Kidron, and burned it at the brook Kidron, and stampeditsmall to powder, and cast the powder thereof upon the graves of the children of the people. 7And he brake down the houses of thesodomites, thatwereby the house of theLord, where the women wove hangings for the grove. 8And he brought all the priests out of the cities of Judah, and defiled the high places where the priests had burned incense, from Geba to Beer-sheba, and brake down the high places of the gates thatwerein the entering in of the gate of Joshua the governor of the city, whichwereon a manâs left hand at the gate of the city. 9Nevertheless the priests of the high placescamenot up to the altar of theLordin Jerusalem, but they did eat of theunleavenedbread among their brethren. 10And he defiledTopheth, whichisin the valley of the children ofHinnom, that no man might make his son or his daughter to pass through the fire toMolech. 11And he took away the horses that the kings of Judah had given to the sun, at the entering in of the house of theLord, by the chamber of Nathan-melech the chamberlain, whichwasin the suburbs, and burned the chariots of the sun with fire. 12And the altars thatwereon the top of theupperchamber of Ahaz, which the kings of Judah had made, and the altars which Manasseh had made in the two courts of the house of theLord, did the king beat down, and brakethemdown from thence, and cast the dust of them into the brook Kidron. 13And thehigh placesthatwerebefore Jerusalem, whichwereon the right hand of the mount of corruption, which Solomon the king of Israel had builded for Ashtoreth the abomination of the Zidonians, and for Chemosh the abomination of the Moabites, and for Milcom the abomination of the children of Ammon, did the king defile. 14And he brake in pieces the images, andcutdown the groves, and filled their places with the bones of men. 15Â¶Moreover the altar thatwasat Beth-el,andthe high place which Jeroboam the son of Nebat, whomadeIsrael to sin, had made, both thataltarand the high place hebrakedown, and burned the high place,andstampeditsmall to powder, and burned the grove. 16And as Josiah turned himself, he spied the sepulchres thatwerethere in the mount, and sent, and took the bones out of the sepulchres, and burnedthemupon the altar, andpolluted it, according to the word of theLordwhich the man of God proclaimed, who proclaimed these words. 17Then he said, What titleisthat that I see? And the men of the city told him,It isthesepulchreof the man of God, which came from Judah, and proclaimed these things that thou hast done against the altar of Beth-el. 18And he said, Let him alone; let no man move his bones. So they let his bones alone, with the bones of the prophet that came out of Samaria. 19And all the houses also of the high places thatwerein the cities of Samaria, which the kings of Israel had made to provoketheLordto anger, Josiah took away, and did to them according to all the acts that he had done in Beth-el. 20And he slew all the priests of thehigh placesthatwerethere upon the altars, andburnedmenâs bones upon them, and returned to Jerusalem. 21Â¶And the king commanded all the people, saying, Keep thepassoverunto theLordyour God, asit iswritten in the book of this covenant. 22Surely there was not holden such apassoverfrom the days of the judges that judged Israel, nor in all the days of the kings of Israel, nor of the kings of Judah; 23But in the eighteenth year of king Josiah,whereinthis passover was holden to theLordin Jerusalem. 24Â¶Moreover theworkerswithfamiliar spirits, and the wizards, and the images, and the idols, and all the abominations that were spied in the land of Judah and in Jerusalem, did Josiah put away, that he might perform the words of the law which were written in the book that Hilkiah the priest found in the house of theLord. 25And like unto him was there nokingbefore him, thatturnedto theLordwith all his heart, and with all his soul, and with all his might, according to all the law of Moses; neither after him arose thereanylike him. 26Â¶Notwithstanding theLordturned not from the fierceness of his great wrath, wherewith his anger was kindled against Judah, because of all the provocations that Manasseh hadprovokedhim withal. 27And theLordsaid, I willremoveJudah also out of my sight, as I haveremovedIsrael, and will cast off this cityJerusalemwhich I have chosen, and the house of which I said, My name shall be there. 28Now the rest of the acts of Josiah, and all that he did,arethey not written in the book of the chronicles of the kings of Judah? 29Â¶In his daysPharaoh-nechohking of Egypt went up against the king of Assyria to the river Euphrates: and kingJosiahwent against him; and he slew him at Megiddo, when he had seen him. 30And his servants carried him in a chariot dead from Megiddo, and brought him to Jerusalem, and buried him in his own sepulchre. And the people of the land tookJehoahazthe son of Josiah, and anointed him, and made him king in his fatherâs stead. 31Â¶Jehoahazwastwenty and three years old when he began to reign; and he reigned three months in Jerusalem. And his motherâs namewasHamutal, the daughter of Jeremiah of Libnah. 32And he didthat which wasevil in the sight of theLord, according to all that his fathers had done. 33And Pharaoh-nechoh put him inbandsat Riblah in the land of Hamath, that he might not reign in Jerusalem; and put the land to a tribute of an hundred talents of silver, and a talent of gold. 34And Pharaoh-nechoh made Eliakim the son of Josiah king in the room of Josiah his father, and turned his name toJehoiakim, and took Jehoahaz away: and he came to Egypt, and died there. 35And Jehoiakim gave the silver and the gold to Pharaoh; but he taxed the land to give the money according to the commandment of Pharaoh: he exacted the silver and the gold of the people of the land, of every one according to his taxation, to giveitunto Pharaoh-nechoh. 36Â¶Jehoiakimwastwenty and five years old when he began to reign; and he reigned eleven years in Jerusalem. And his motherâs namewasZebudah, the daughter of Pedaiah of Rumah. 37And he didthat which wasevilin the sight of theLord, according to all that his fathers had done."
    },
    {
      "reference": "2 Kings 24",
      "title": "2 Kings 24",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/24?lang=eng",
      "summary": "Jerusalem is besieged and taken by NebuchadnezzarâMany of the people of Judah are carried captive into BabylonâZedekiah becomes king in JerusalemâHe rebels against Babylon.",
      "verses": [
        "1In his daysNebuchadnezzarking of Babylon came up, and Jehoiakim became his servant three years: then he turned and rebelled against him.",
        "2And theLordsentagainsthim bands of theChaldees, and bands of the Syrians, and bands of the Moabites, and bands of the children of Ammon, and sent them against Judah todestroyit, according to thewordof theLord, which he spake by his servants the prophets.",
        "3Surely at the commandment of theLordcamethisupon Judah, to removethemout of his sight, for thesinsofManasseh, according to all that he did;",
        "4And also for the innocent blood that heshed: for he filled Jerusalem with innocent blood; which theLordwould not pardon.",
        "5Â¶Now the rest of the acts ofJehoiakim, and all that he did,arethey not written in the book of the chronicles of the kings of Judah?",
        "6SoJehoiakimslept with his fathers: and Jehoiachin his son reigned in his stead.",
        "7And the king of Egypt came not again any more out of his land: for the king of Babylon had taken from the river of Egypt unto the river Euphrates all that pertained to the king of Egypt.",
        "8Â¶Jehoiachinwaseighteenyears old when he began to reign, and he reigned in Jerusalem three months. And his motherâs namewasNehushta, the daughter of Elnathan of Jerusalem.",
        "9And he didthat which wasevil in the sight of theLord, according to all that his father had done.",
        "10Â¶At that time the servants of Nebuchadnezzar king of Babylon came up against Jerusalem, and the city wasbesieged.",
        "11AndNebuchadnezzarking of Babylon came against the city, and his servants did besiege it.",
        "12AndJehoiachinthe king of Judah went out to the king ofBabylon, he, and his mother, and his servants, and his princes, and his officers: and the king of Babylon took him in the eighth year of his reign.",
        "13And hecarriedout thence all thetreasuresof the house of theLord, and the treasures of the kingâs house, and cut in pieces all thevesselsof gold whichSolomonking of Israel had made in the temple of theLord, as theLordhad said.",
        "14And hecarried awayall Jerusalem, and all the princes, and all the mighty men of valour,eventen thousand captives, and all the craftsmen andsmiths: none remained, save the poorest sort of the people of the land.",
        "15And he carried awayJehoiachinto Babylon, and the kingâs mother, and the kingâs wives, and his officers, and themightyof the land,thosecarried he intocaptivityfrom Jerusalem toBabylon.",
        "16And all the men of might,evenseven thousand, and craftsmen and smiths a thousand, allthat werestrongandapt for war, even them the king of Babylon brought captive to Babylon.",
        "17Â¶And the king of Babylon madeMattaniahhis fatherâs brother king in his stead, and changed his name toZedekiah.",
        "18Zedekiahwastwenty and one years old when he began to reign, and he reigned eleven years in Jerusalem. And his motherâs namewasHamutal, the daughter of Jeremiah of Libnah.",
        "19And he didthat which wasevilin the sight of theLord, according to all that Jehoiakim had done.",
        "20For through the anger of theLordit came to pass in Jerusalem and Judah, until he had cast them out from his presence, thatZedekiahrebelledagainst the king of Babylon."
      ],
      "full_text": "1In his daysNebuchadnezzarking of Babylon came up, and Jehoiakim became his servant three years: then he turned and rebelled against him. 2And theLordsentagainsthim bands of theChaldees, and bands of the Syrians, and bands of the Moabites, and bands of the children of Ammon, and sent them against Judah todestroyit, according to thewordof theLord, which he spake by his servants the prophets. 3Surely at the commandment of theLordcamethisupon Judah, to removethemout of his sight, for thesinsofManasseh, according to all that he did; 4And also for the innocent blood that heshed: for he filled Jerusalem with innocent blood; which theLordwould not pardon. 5Â¶Now the rest of the acts ofJehoiakim, and all that he did,arethey not written in the book of the chronicles of the kings of Judah? 6SoJehoiakimslept with his fathers: and Jehoiachin his son reigned in his stead. 7And the king of Egypt came not again any more out of his land: for the king of Babylon had taken from the river of Egypt unto the river Euphrates all that pertained to the king of Egypt. 8Â¶Jehoiachinwaseighteenyears old when he began to reign, and he reigned in Jerusalem three months. And his motherâs namewasNehushta, the daughter of Elnathan of Jerusalem. 9And he didthat which wasevil in the sight of theLord, according to all that his father had done. 10Â¶At that time the servants of Nebuchadnezzar king of Babylon came up against Jerusalem, and the city wasbesieged. 11AndNebuchadnezzarking of Babylon came against the city, and his servants did besiege it. 12AndJehoiachinthe king of Judah went out to the king ofBabylon, he, and his mother, and his servants, and his princes, and his officers: and the king of Babylon took him in the eighth year of his reign. 13And hecarriedout thence all thetreasuresof the house of theLord, and the treasures of the kingâs house, and cut in pieces all thevesselsof gold whichSolomonking of Israel had made in the temple of theLord, as theLordhad said. 14And hecarried awayall Jerusalem, and all the princes, and all the mighty men of valour,eventen thousand captives, and all the craftsmen andsmiths: none remained, save the poorest sort of the people of the land. 15And he carried awayJehoiachinto Babylon, and the kingâs mother, and the kingâs wives, and his officers, and themightyof the land,thosecarried he intocaptivityfrom Jerusalem toBabylon. 16And all the men of might,evenseven thousand, and craftsmen and smiths a thousand, allthat werestrongandapt for war, even them the king of Babylon brought captive to Babylon. 17Â¶And the king of Babylon madeMattaniahhis fatherâs brother king in his stead, and changed his name toZedekiah. 18Zedekiahwastwenty and one years old when he began to reign, and he reigned eleven years in Jerusalem. And his motherâs namewasHamutal, the daughter of Jeremiah of Libnah. 19And he didthat which wasevilin the sight of theLord, according to all that Jehoiakim had done. 20For through the anger of theLordit came to pass in Jerusalem and Judah, until he had cast them out from his presence, thatZedekiahrebelledagainst the king of Babylon."
    },
    {
      "reference": "2 Kings 25",
      "title": "2 Kings 25",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/2-kgs/25?lang=eng",
      "summary": "Nebuchadnezzar again besieges JerusalemâZedekiah is captured, Jerusalem and the temple are destroyed, and most of the people of Judah are carried into BabylonâGedaliah, left to govern the remnant, is slainâThe remnant flee to EgyptâJehoiachin is shown favor in Babylon.",
      "verses": [
        "1And it came to pass in theninthyear of his reign, in the tenth month, in the tenthdayof the month,thatNebuchadnezzarking of Babylon came, he, and all his host, against Jerusalem, and pitched against it; and theybuiltforts against it round about.",
        "2And the city was besieged unto the eleventh year of king Zedekiah.",
        "3And on the ninthdayof thefourthmonth the famine prevailed in the city, and there was no bread for the people of the land.",
        "4Â¶And thecitywasbroken up, and all the men of warfledby night by the way of the gate between two walls, whichisby the kingâs garden: (now the Chaldeeswereagainst the city round about:) andthe kingwent the way toward the plain.",
        "5And the army of the Chaldeespursuedafter the king, and overtook him in the plains of Jericho: and all his army werescatteredfrom him.",
        "6So they took theking, and brought him up to the king ofBabylonto Riblah; and they gavejudgmentupon him.",
        "7And they slew thesonsof Zedekiah before his eyes, and put out the eyes of Zedekiah, and bound himwith fetters of brass, andcarriedhim toBabylon.",
        "8Â¶And in the fifth month, on the seventhdayof the month, whichisthe nineteenth year of king Nebuchadnezzar king of Babylon, cameNebuzar-adan, captain of the guard, a servant of the king of Babylon, unto Jerusalem:",
        "9And heburntthehouseof theLord, and the kingâs house, and all the houses of Jerusalem, and every greatmanâshouseburnthe with fire.",
        "10And all the army of the Chaldees, thatwere withthe captain of the guard, brake down the walls of Jerusalem round about.",
        "11Now the rest of the peoplethat wereleft in the city, and the fugitives that fell away to the king of Babylon, with the remnant of the multitude, did Nebuzar-adan the captain of the guardcarryaway.",
        "12But the captain of the guard left of thepoorof the landto bevinedressers and husbandmen.",
        "13And thepillarsof brass thatwerein the house of theLord, and thebases, and the brasenseathatwasin the house of theLord, did the Chaldees break in pieces, and carried the brass of them toBabylon.",
        "14And thepots, and the shovels, and thesnuffers, and the spoons, and all the vessels of brass wherewith they ministered, took they away.",
        "15And the firepans, and the bowls,andsuch things aswereof gold,ingold, and of silver,insilver, the captain of the guard took away.",
        "16The two pillars, one sea, and the bases which Solomon had made for the house of theLord; the brass of all thesevesselswas without weight.",
        "17The height of the one pillarwaseighteen cubits, and the chapiter upon itwasbrass: and the height of the chapiter three cubits; and the wreathen work, and pomegranates upon the chapiter round about, all of brass: and like unto these had the second pillar with wreathen work.",
        "18Â¶And the captain of the guard tookSeraiahthe chief priest, and Zephaniah the second priest, and thethreekeepers of the door:",
        "19And out of the city he took an officer that was set over themenof war, and five men of them that were in the kingâs presence, which were found in the city, and the principal scribe of the host, which mustered the people of the land, and threescore men of the people of the landthat werefound in the city:",
        "20And Nebuzar-adan captain of the guard took these, and brought them to the king of Babylon to Riblah:",
        "21And the king of Babylon smote them, andslewthem at Riblah in the land of Hamath. So Judah was carried away out of their land.",
        "22Â¶Andas forthe people that remained in the land of Judah, whom Nebuchadnezzar king of Babylon had left, even over them he madeGedaliahthe son of Ahikam, the son of Shaphan, ruler.",
        "23And when all the captains of the armies, they and their men, heard that the king of Babylon had made Gedaliah governor, there came to Gedaliah to Mizpah, even Ishmael the son of Nethaniah, and Johanan the son of Careah, and Seraiah the son of Tanhumeth the Netophathite, and Jaazaniah the son of a Maachathite, they and their men.",
        "24And Gedaliah sware to them, and to their men, and said untothem, Fear not to be the servants of the Chaldees: dwell in the land, and serve the king of Babylon; and it shall be well with you.",
        "25But it came to pass in the seventh month, that Ishmael the son of Nethaniah, the son of Elishama, of the seed royal, came, and ten men with him, and smote Gedaliah, that he died, and the Jews and the Chaldees that were with him at Mizpah.",
        "26And all the people, both small and great, and the captains of the armies, arose, and came to Egypt: for they were afraid of the Chaldees.",
        "27Â¶And it came to pass in the seven and thirtieth year of the captivity of Jehoiachin king of Judah, in the twelfth month, on the seven and twentiethdayof the month,thatEvil-merodach king of Babylon in the year that he began to reign did lift up the head of Jehoiachin king of Judah out of prison;",
        "28And he spakekindlyto him, and set his throne above the throne of the kings thatwerewith him in Babylon;",
        "29And changed his prison garments: and he did eat bread continually before him all the days of his life.",
        "30And his allowancewasa continual allowance given him of the king, a daily rate for every day, all the days of his life."
      ],
      "full_text": "1And it came to pass in theninthyear of his reign, in the tenth month, in the tenthdayof the month,thatNebuchadnezzarking of Babylon came, he, and all his host, against Jerusalem, and pitched against it; and theybuiltforts against it round about. 2And the city was besieged unto the eleventh year of king Zedekiah. 3And on the ninthdayof thefourthmonth the famine prevailed in the city, and there was no bread for the people of the land. 4Â¶And thecitywasbroken up, and all the men of warfledby night by the way of the gate between two walls, whichisby the kingâs garden: (now the Chaldeeswereagainst the city round about:) andthe kingwent the way toward the plain. 5And the army of the Chaldeespursuedafter the king, and overtook him in the plains of Jericho: and all his army werescatteredfrom him. 6So they took theking, and brought him up to the king ofBabylonto Riblah; and they gavejudgmentupon him. 7And they slew thesonsof Zedekiah before his eyes, and put out the eyes of Zedekiah, and bound himwith fetters of brass, andcarriedhim toBabylon. 8Â¶And in the fifth month, on the seventhdayof the month, whichisthe nineteenth year of king Nebuchadnezzar king of Babylon, cameNebuzar-adan, captain of the guard, a servant of the king of Babylon, unto Jerusalem: 9And heburntthehouseof theLord, and the kingâs house, and all the houses of Jerusalem, and every greatmanâshouseburnthe with fire. 10And all the army of the Chaldees, thatwere withthe captain of the guard, brake down the walls of Jerusalem round about. 11Now the rest of the peoplethat wereleft in the city, and the fugitives that fell away to the king of Babylon, with the remnant of the multitude, did Nebuzar-adan the captain of the guardcarryaway. 12But the captain of the guard left of thepoorof the landto bevinedressers and husbandmen. 13And thepillarsof brass thatwerein the house of theLord, and thebases, and the brasenseathatwasin the house of theLord, did the Chaldees break in pieces, and carried the brass of them toBabylon. 14And thepots, and the shovels, and thesnuffers, and the spoons, and all the vessels of brass wherewith they ministered, took they away. 15And the firepans, and the bowls,andsuch things aswereof gold,ingold, and of silver,insilver, the captain of the guard took away. 16The two pillars, one sea, and the bases which Solomon had made for the house of theLord; the brass of all thesevesselswas without weight. 17The height of the one pillarwaseighteen cubits, and the chapiter upon itwasbrass: and the height of the chapiter three cubits; and the wreathen work, and pomegranates upon the chapiter round about, all of brass: and like unto these had the second pillar with wreathen work. 18Â¶And the captain of the guard tookSeraiahthe chief priest, and Zephaniah the second priest, and thethreekeepers of the door: 19And out of the city he took an officer that was set over themenof war, and five men of them that were in the kingâs presence, which were found in the city, and the principal scribe of the host, which mustered the people of the land, and threescore men of the people of the landthat werefound in the city: 20And Nebuzar-adan captain of the guard took these, and brought them to the king of Babylon to Riblah: 21And the king of Babylon smote them, andslewthem at Riblah in the land of Hamath. So Judah was carried away out of their land. 22Â¶Andas forthe people that remained in the land of Judah, whom Nebuchadnezzar king of Babylon had left, even over them he madeGedaliahthe son of Ahikam, the son of Shaphan, ruler. 23And when all the captains of the armies, they and their men, heard that the king of Babylon had made Gedaliah governor, there came to Gedaliah to Mizpah, even Ishmael the son of Nethaniah, and Johanan the son of Careah, and Seraiah the son of Tanhumeth the Netophathite, and Jaazaniah the son of a Maachathite, they and their men. 24And Gedaliah sware to them, and to their men, and said untothem, Fear not to be the servants of the Chaldees: dwell in the land, and serve the king of Babylon; and it shall be well with you. 25But it came to pass in the seventh month, that Ishmael the son of Nethaniah, the son of Elishama, of the seed royal, came, and ten men with him, and smote Gedaliah, that he died, and the Jews and the Chaldees that were with him at Mizpah. 26And all the people, both small and great, and the captains of the armies, arose, and came to Egypt: for they were afraid of the Chaldees. 27Â¶And it came to pass in the seven and thirtieth year of the captivity of Jehoiachin king of Judah, in the twelfth month, on the seven and twentiethdayof the month,thatEvil-merodach king of Babylon in the year that he began to reign did lift up the head of Jehoiachin king of Judah out of prison; 28And he spakekindlyto him, and set his throne above the throne of the kings thatwerewith him in Babylon; 29And changed his prison garments: and he did eat bread continually before him all the days of his life. 30And his allowancewasa continual allowance given him of the king, a daily rate for every day, all the days of his life."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:29:50",
  "metadata": {
    "week_number": 29,
    "title": "Week 29: July 13–19 - 2 Kings 16–25",
    "date_range": "July 13–19",
    "scraped_at": "2025-12-21T22:29:57.470437",
    "scraper_version": "2.0.0"
  }
}