{
  "week_number": 22,
  "date_range": "May 25–31",
  "title": "Week 22: May 25–31 - Judges 2–4; 6–8; 13–16",
  "bundle_title": "Week 22: May 25–31: \"Week 22: May 25–31 - Judges 2–4; 6–8; 13–16\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/22?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/22?lang=eng",
    "title": "Judges 2–4;6–8;13–16",
    "scripture_references": "Judges 2–4; 6–8; 13–16",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“May 25–31. ‘The Lord Raised Up a Deliverer: Judges 2–4; 6–8; 13–16,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“May 25–31. ‘The Lord Raised Up a Deliverer,’”Come, Follow Me: Old Testament 2026\n\n“I Will Surely Go with Thee”—Deborah the Prophetess, by Des Leavitt\n\nWe all know what it’s like to sin, feel bad about it, and then repent and resolve to change our ways. But too often we forget our earlier resolve, and, when temptation comes, we find ourselves committing the same sin. This pattern appears frequently in the book of Judges. Influenced by the beliefs and worship practices of the Canaanites—whom they were supposed to drive out of the land—the Israelites broke their covenants with the Lord and turned away from worshipping Him. As a result, they lost His protection and fell into captivity. And yet each time this happened, the Lord gave His covenant people the chance to repent and raised up a deliverer, a military leader called a “judge.” Not all of the judges in the book of Judges were righteous, but some of them exercised great faith in delivering the children of Israel and restoring them to their covenant relationship with the Lord. These stories remind us that no matter what has led us away from Jesus Christ, He is the Redeemer of Israel and is always willing to deliver us and welcome us back as we return to Him.\n\nFor an overview of the book of Judges, see “Judges, book of” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "The Lord forgives as often as I repent.",
        "content": "The book of Judges can be both a warning and an encouragement. Look for this warning and encouragement as you readJudges 2:1–19;3:5–12. How do you feel the warning and encouragement apply to you?\n\nFor example, ifJudges 2:19were about you and your temptations rather than about the ancient Israelites, what might it say? IfJudges 3:9were about what the Lord had done to deliver you, what might it say?\n\nConsider reading the question and answer onpage 9ofFor the Strength of Youth: A Guide for Making Choices. How do you feel this applies to the Israelites’ experience in the book of Judges? What does this teach you about Jesus Christ?\n\nJudges 4:1–15"
      },
      {
        "title": "I can inspire others to have faith in the Lord.",
        "content": "Sometimes the faith of one person can inspire faith in many others. InJudges 4, that one person was Deborah. Read about her inJudges 4:1–15, and note the influence she had on people around her. Here are some questions to help you consider how her experience might apply to your life:\n\nHow would you describe the conditions the Israelites were in at the time? (seeverses 1–3). What similarities do you see to conditions today—in individuals and society?\n\nWhat words or actions of Deborah show you that she had faith in the Lord? How did her faith influence others? What else impresses you about her?\n\nWhat do you think Deborah meant by her question inverse 14: “Is not the Lord gone out before thee?” How does the Lord “go out before” you? (seeDoctrine and Covenants 84:87–88).\n\nPonder how your faith in Jesus Christ could bless others the way Deborah’s faith blessed Barak and the other Israelites. To help you think about this, you might study Elder Neil L. Andersen’s message “We Talk of Christ” (EnsignorLiahona, Nov. 2020, 88–91). Search the message for (1) reasons to speak more openly about the Savior and (2) ways to do it.\n\nThen you might make a list of things you know about Jesus Christ—from the scriptures, from words of living prophets, and from your personal experience. Who needs to know this? How will you share it?\n\nSee alsoMatthew 5:14–16;1 Peter 3:15; “Each Life That Touches Ours for Good,”Hymns, no. 293.\n\nInvite sharing.If you are a teacher—at home or at church—“give learners opportunities to share with each other what they are learning about the Savior and His gospel. Doing this will help them internalize the truths they are taught and express them” (Teaching in the Savior’s Way,26). For example, when studyingJudges 4together, you could give each learner something specific to look for in the chapter and then invite them to share with each other what they find.\n\nJudges 6–8"
      },
      {
        "title": "The Lord can work miracles when I trust in His ways.",
        "content": "As you readJudges 6–8, make note of instances where the Lord asked Gideon to believe something that might have seemed unlikely. Has He ever asked something similar of you?\n\nWhat do you feel the Lord is trying to teach you with this account? How have you seen the Lord do His work in ways that seemed unlikely?\n\nJudges 13–16"
      },
      {
        "title": "God strengthens me as I am faithful to my covenants.",
        "content": "Samson lost both his physical strength and his spiritual strength because he violated his covenants with God, including those that applied specifically to Nazarites (for information about the Nazarites, seeNumbers 6:1–6;Judges 13:7). As you read about Samson inJudges 13–16, note verses that show that the Lord was with Samson, as well as verses showing that Samson was not fully committed to the Lord.\n\nYou might also ponder the covenants you have made with the Lord. How have these covenants brought His power into your life? What do you learn from Samson’s experiences that inspires you to stay true to your covenants with God?\n\nSister Ann M. Dibb taught: “Samson was born with great potential. His mother was promised, ‘He shall begin to deliver Israel out of the hand of the Philistines’ [Judges 13:5]. But as Samson grew, he looked more to the world’s temptations than to God’s direction. He made choices because they ‘pleaseth [him] well’ [Judges 14:3] rather than because those choices were right. Repeatedly, the scriptures use the phrase ‘and he went down’ [Judges 14:7] as they tell of Samson’s journeys, actions, and choices. Instead of arising and shining forth to fulfill his great potential, Samson was overcome by the world, lost his God-given power, and died a tragic, early death” (“Arise and Shine Forth,”EnsignorLiahona, May 2012, 118).\n\nSee also Dallin H. Oaks, “Covenants and Responsibilities,”Liahona, May 2024, 93–96; Ulisses Soares, “Covenant Confidence through Jesus Christ,”Liahona, May 2024, 17–21."
      }
    ],
    "teaching_children": [
      {
        "title": "Jesus Christ is my Deliverer.",
        "content": "Judges 3describes a pattern that teaches about the Savior’s power to deliver us from sin. To help your children identify this pattern, you could write down these phrases: “did evil,” “cried unto the Lord,” and “raised up a deliverer.” Then your children could look for these phrases inJudges 3:7–9andJudges 3:12–15. What do we learn about the Lord from this pattern?\n\nTo emphasize that Jesus Christ is our Deliverer, you could gather several pictures of people, including a picture of Jesus, and place them face down. Let your children take turns flipping over the pictures. When they find the picture of Jesus, sing a song about Him, such as “He Sent His Son” (Children’s Songbook, 34–35), and tell your children about how He has delivered you.\n\nJudges 4:1–15"
      },
      {
        "title": "I can inspire others to have faith in the Lord.",
        "content": "You can use “Deborah the Prophetess” inOld Testament Stories, 92–95, to tell your children the story inJudges 4. Share with each other what you admire about Deborah. How did her faith in the Lord bless the people around her? What can we do to help others have more faith in Jesus Christ?\n\nDeborah the Prophetess\n\nJudges 7:1–21"
      },
      {
        "title": "The Lord can use small things to do great work.",
        "content": "UseJudges 7:4–7, this week’s activity page, or “The Army of Gideon” inOld Testament Stories, 96–99, to teach your children about how the Lord made Israel’s army smaller. Why did the Lord want Gideon’s army to be so small? (seeJudges 7:2).\n\nThe Army of Gideon\n\nYour children could draw pictures of a sword, shield, trumpet, lamp, and pitcher and talk about which of these objects they would want in a battle. Then they could readJudges 7:16to learn what the Lord told Gideon’s army to use. As you read about the battle inJudges 7:19–21, share with each other what you learn about the Lord from this story.\n\nSamson Puts Down the Pillars, by James Tissot and others\n\nJudges 13:5"
      },
      {
        "title": "Keeping covenants gives me strength.",
        "content": "Samson’s covenants with the Lord gave him physical strength, just as our covenants give us spiritual strength. Your children might enjoy doing some physical exercises and discussing how those exercises can help make our bodies strong. How does keeping our covenants make our spirits strong? (seeMosiah 18:8–10;Doctrine and Covenants 20:77, 79).\n\nFor more, see this month’s issue of theFriendmagazine.\n\nGideon’s Army, by Daniel A. Lewis"
      }
    ],
    "study_helps": [],
    "raw_text": "May 25–31. “The Lord Raised Up a Deliverer”: Judges 2–4; 6–8; 13–16\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nThoughts to Keep in Mind\nThe Tabernacle and Sacrifice\nApril 27–May 3\nExodus 35–40; Leviticus 1; 4; 16; 19\nMay 4–10\nNumbers 11–14; 20–24; 27\nMay 11–17\nDeuteronomy 6–8; 15; 18; 29–30; 34\nThoughts to Keep in Mind\nThe Historical Books in the Old Testament\nMay 18–24\nJoshua 1–8; 23–24\nMay 25–31\nJudges 2–4; 6–8; 13–16\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nMay 25–31. “The Lord Raised Up a Deliverer”: Judges 2–4; 6–8; 13–16\n“May 25–31. ‘The Lord Raised Up a Deliverer: Judges 2–4; 6–8; 13–16,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“May 25–31. ‘The Lord Raised Up a Deliverer,’”\nCome, Follow Me: Old Testament 2026\n“I Will Surely Go with Thee”—Deborah the Prophetess\n, by Des Leavitt\nMay 25–31: “The Lord Raised Up a Deliverer”\nJudges 2–4\n;\n6–8\n;\n13–16\nWe all know what it’s like to sin, feel bad about it, and then repent and resolve to change our ways. But too often we forget our earlier resolve, and, when temptation comes, we find ourselves committing the same sin. This pattern appears frequently in the book of Judges. Influenced by the beliefs and worship practices of the Canaanites—whom they were supposed to drive out of the land—the Israelites broke their covenants with the Lord and turned away from worshipping Him. As a result, they lost His protection and fell into captivity. And yet each time this happened, the Lord gave His covenant people the chance to repent and raised up a deliverer, a military leader called a “judge.” Not all of the judges in the book of Judges were righteous, but some of them exercised great faith in delivering the children of Israel and restoring them to their covenant relationship with the Lord. These stories remind us that no matter what has led us away from Jesus Christ, He is the Redeemer of Israel and is always willing to deliver us and welcome us back as we return to Him.\nFor an overview of the book of Judges, see “\nJudges, book of\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nJudges 2:1–19\n;\n3:5–12\nThe Lord forgives as often as I repent.\nThe book of Judges can be both a warning and an encouragement. Look for this warning and encouragement as you read\nJudges 2:1–19\n;\n3:5–12\n. How do you feel the warning and encouragement apply to you?\nFor example, if\nJudges 2:19\nwere about you and your temptations rather than about the ancient Israelites, what might it say? If\nJudges 3:9\nwere about what the Lord had done to deliver you, what might it say?\nConsider reading the question and answer on\npage 9\nof\nFor the Strength of Youth: A Guide for Making Choices\n. How do you feel this applies to the Israelites’ experience in the book of Judges? What does this teach you about Jesus Christ?\nJudges 4:1–15\nI can inspire others to have faith in the Lord.\nSometimes the faith of one person can inspire faith in many others. In\nJudges 4\n, that one person was Deborah. Read about her in\nJudges 4:1–15\n, and note the influence she had on people around her. Here are some questions to help you consider how her experience might apply to your life:\nHow would you describe the conditions the Israelites were in at the time? (see\nverses 1–3\n). What similarities do you see to conditions today—in individuals and society?\nWhat words or actions of Deborah show you that she had faith in the Lord? How did her faith influence others? What else impresses you about her?\nWhat do you think Deborah meant by her question in\nverse 14\n: “Is not the Lord gone out before thee?” How does the Lord “go out before” you? (see\nDoctrine and Covenants 84:87–88\n).\nPonder how your faith in Jesus Christ could bless others the way Deborah’s faith blessed Barak and the other Israelites. To help you think about this, you might study Elder Neil L. Andersen’s message “\nWe Talk of Christ\n” (\nEnsign\nor\nLiahona\n, Nov. 2020, 88–91). Search the message for (1) reasons to speak more openly about the Savior and (2) ways to do it.\nThen you might make a list of things you know about Jesus Christ—from the scriptures, from words of living prophets, and from your personal experience. Who needs to know this? How will you share it?\nSee also\nMatthew 5:14–16\n;\n1 Peter 3:15\n; “\nEach Life That Touches Ours for Good\n,”\nHymns\n, no. 293.\nInvite sharing.\nIf you are a teacher—at home or at church—“give learners opportunities to share with each other what they are learning about the Savior and His gospel. Doing this will help them internalize the truths they are taught and express them” (\nTeaching in the Savior’s Way\n,\n26\n). For example, when studying\nJudges 4\ntogether, you could give each learner something specific to look for in the chapter and then invite them to share with each other what they find.\nJudges 6–8\nThe Lord can work miracles when I trust in His ways.\nAs you read\nJudges 6–8\n, make note of instances where the Lord asked Gideon to believe something that might have seemed unlikely. Has He ever asked something similar of you?\nWhat do you feel the Lord is trying to teach you with this account? How have you seen the Lord do His work in ways that seemed unlikely?\nJudges 13–16\nGod strengthens me as I am faithful to my covenants.\nSamson lost both his physical strength and his spiritual strength because he violated his covenants with God, including those that applied specifically to Nazarites (for information about the Nazarites, see\nNumbers 6:1–6\n;\nJudges 13:7\n). As you read about Samson in\nJudges 13–16\n, note verses that show that the Lord was with Samson, as well as verses showing that Samson was not fully committed to the Lord.\nYou might also ponder the covenants you have made with the Lord. How have these covenants brought His power into your life? What do you learn from Samson’s experiences that inspires you to stay true to your covenants with God?\nSister Ann M. Dibb taught: “Samson was born with great potential. His mother was promised, ‘He shall begin to deliver Israel out of the hand of the Philistines’ [\nJudges 13:5\n]. But as Samson grew, he looked more to the world’s temptations than to God’s direction. He made choices because they ‘pleaseth [him] well’ [\nJudges 14:3\n] rather than because those choices were right. Repeatedly, the scriptures use the phrase ‘and he went down’ [\nJudges 14:7\n] as they tell of Samson’s journeys, actions, and choices. Instead of arising and shining forth to fulfill his great potential, Samson was overcome by the world, lost his God-given power, and died a tragic, early death” (“\nArise and Shine Forth\n,”\nEnsign\nor\nLiahona\n, May 2012, 118).\nSee also Dallin H. Oaks, “\nCovenants and Responsibilities\n,”\nLiahona\n, May 2024, 93–96; Ulisses Soares, “\nCovenant Confidence through Jesus Christ\n,”\nLiahona\n, May 2024, 17–21.\nStudy Helps\nWhat were some of the false gods of the Canaanites?\nWhat does it mean that Deborah was a prophetess?\nWas it appropriate for Gideon to ask God for a sign?\nClick to see more.\nIdeas for Teaching Children\nBecause this Sunday is the first Sunday of the month, Primary teachers are encouraged to use learning activities in “Appendix B: Preparing Children for a Lifetime on God’s Covenant Path.”\nJudges 3:7–9, 12–15\nJesus Christ is my Deliverer.\nJudges 3\ndescribes a pattern that teaches about the Savior’s power to deliver us from sin. To help your children identify this pattern, you could write down these phrases: “did evil,” “cried unto the Lord,” and “raised up a deliverer.” Then your children could look for these phrases in\nJudges 3:7–9\nand\nJudges 3:12–15\n. What do we learn about the Lord from this pattern?\nTo emphasize that Jesus Christ is our Deliverer, you could gather several pictures of people, including a picture of Jesus, and place them face down. Let your children take turns flipping over the pictures. When they find the picture of Jesus, sing a song about Him, such as “\nHe Sent His Son\n” (\nChildren’s Songbook\n, 34–35), and tell your children about how He has delivered you.\nJudges 4:1–15\nI can inspire others to have faith in the Lord.\nYou can use “\nDeborah the Prophetess\n” in\nOld Testament Stories\n, 92–95, to tell your children the story in\nJudges 4\n. Share with each other what you admire about Deborah. How did her faith in the Lord bless the people around her? What can we do to help others have more faith in Jesus Christ?\n2:9\nDeborah the Prophetess\nJudges 7:1–21\nThe Lord can use small things to do great work.\nUse\nJudges 7:4–7\n, this week’s activity page, or “\nThe Army of Gideon\n” in\nOld Testament Stories\n, 96–99, to teach your children about how the Lord made Israel’s army smaller. Why did the Lord want Gideon’s army to be so small? (see\nJudges 7:2\n).\n2:37\nThe Army of Gideon\nYour children could draw pictures of a sword, shield, trumpet, lamp, and pitcher and talk about which of these objects they would want in a battle. Then they could read\nJudges 7:16\nto learn what the Lord told Gideon’s army to use. As you read about the battle in\nJudges 7:19–21\n, share with each other what you learn about the Lord from this story.\nSamson Puts Down the Pillars\n, by James Tissot and others\nJudges 13:5\nKeeping covenants gives me strength.\nSamson’s covenants with the Lord gave him physical strength, just as our covenants give us spiritual strength. Your children might enjoy doing some physical exercises and discussing how those exercises can help make our bodies strong. How does keeping our covenants make our spirits strong? (see\nMosiah 18:8–10\n;\nDoctrine and Covenants 20:77, 79\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\nGideon’s Army\n, by Daniel A. Lewis"
  },
  "scripture_content": [
    {
      "reference": "Judges 2",
      "title": "Judges 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/2?lang=eng",
      "summary": "An angel rebukes Israel for not serving the LordâAs a pattern of future events, a new generation arises that forsakes the Lord and serves Baal and AshtarothâThe Lord is angry with the children of Israel and ceases to preserve themâHe raises up judges to guide and lead themâThe Canaanites are left in the land to test Israel.",
      "verses": [
        "1And an angel of theLordcame up from Gilgal to Bochim, and said, I made you to go up out of Egypt, and have brought you unto the land which I sware unto your fathers; and I said, I will neverbreakmycovenantwith you.",
        "2And ye shall make noleaguewith the inhabitants of this land; ye shall throw down their altars: but ye have notobeyedmy voice: why have ye done this?",
        "3Wherefore I also said, I will not drive them out from before you; but they shall beas thornsin your sides, and their gods shall be asnareunto you.",
        "4And it came to pass, when the angel of theLordspake these words unto all the children of Israel, that the people lifted up their voice, and wept.",
        "5And they called the name of that place Bochim: and they sacrificed there unto theLord.",
        "6Â¶And when Joshua had let the people go, the children of Israel went every man unto his inheritance to possess the land.",
        "7And the peopleservedtheLordall the days of Joshua, and all the days of the elders that outlived Joshua, who had seen all the great works of theLord, that he did for Israel.",
        "8And Joshua the son ofNun, the servant of theLord, died,beingan hundred and ten years old.",
        "9And they buried him in the border of his inheritance in Timnath-heres, in the mount of Ephraim, on the north side of the hill Gaash.",
        "10And also all that generation were gathered unto their fathers: and there arose another generation after them, whichknew nottheLord, nor yet the works which he had done for Israel.",
        "11Â¶And the children of Israel did evil in the sight of theLord, and served Baalim:",
        "12And they forsook theLordGod of their fathers, which brought them out of the land of Egypt, and followed other gods, of the gods of the people thatwereround about them, and bowed themselves unto them, and provoked theLordtoanger.",
        "13And they forsook theLord, and servedBaaland Ashtaroth.",
        "14Â¶And theangerof theLordwas hot against Israel, and he delivered them into the hands ofspoilersthat spoiled them, and he sold them into the hands of their enemies round about, so that they could not any longer stand before their enemies.",
        "15Whithersoever they went out, thehandof theLordwas against them for evil, as theLordhad said, and as theLordhad sworn unto them: and they were greatly distressed.",
        "16Â¶Nevertheless theLordraised upjudges, whichdeliveredthem out of the hand of those that spoiled them.",
        "17And yet they would not hearken unto their judges, but they went awhoringafter othergods, and bowed themselves unto them: they turnedquicklyout of the way which their fathers walked in, obeying the commandments of theLord;butthey did not so.",
        "18And when theLordraised them up judges, then theLordwas with the judge, and delivered them out of the hand of their enemies all the days of the judge:for it repentedtheLordbecause of their groanings by reason of them that oppressed them andvexedthem.",
        "19And it came to pass, when the judge was dead,thatthey returned, and corruptedthemselvesmore than theirfathers, in following other gods to serve them, and to bow down unto them; they ceased not from their own doings, nor from theirstubbornway.",
        "20Â¶And the anger of theLordwas hot against Israel; and he said, Because that this people hath transgressed my covenant which I commanded their fathers, and have not hearkened unto my voice;",
        "21I also will not henceforth drive out any from before them of the nations which Joshua left when he died:",
        "22That through them I mayproveIsrael, whether they will keep the way of theLordtowalktherein, as their fathers did keepit,or not.",
        "23Therefore theLordleft those nations, without driving them out hastily; neither delivered he them into the hand of Joshua."
      ],
      "full_text": "1And an angel of theLordcame up from Gilgal to Bochim, and said, I made you to go up out of Egypt, and have brought you unto the land which I sware unto your fathers; and I said, I will neverbreakmycovenantwith you. 2And ye shall make noleaguewith the inhabitants of this land; ye shall throw down their altars: but ye have notobeyedmy voice: why have ye done this? 3Wherefore I also said, I will not drive them out from before you; but they shall beas thornsin your sides, and their gods shall be asnareunto you. 4And it came to pass, when the angel of theLordspake these words unto all the children of Israel, that the people lifted up their voice, and wept. 5And they called the name of that place Bochim: and they sacrificed there unto theLord. 6Â¶And when Joshua had let the people go, the children of Israel went every man unto his inheritance to possess the land. 7And the peopleservedtheLordall the days of Joshua, and all the days of the elders that outlived Joshua, who had seen all the great works of theLord, that he did for Israel. 8And Joshua the son ofNun, the servant of theLord, died,beingan hundred and ten years old. 9And they buried him in the border of his inheritance in Timnath-heres, in the mount of Ephraim, on the north side of the hill Gaash. 10And also all that generation were gathered unto their fathers: and there arose another generation after them, whichknew nottheLord, nor yet the works which he had done for Israel. 11Â¶And the children of Israel did evil in the sight of theLord, and served Baalim: 12And they forsook theLordGod of their fathers, which brought them out of the land of Egypt, and followed other gods, of the gods of the people thatwereround about them, and bowed themselves unto them, and provoked theLordtoanger. 13And they forsook theLord, and servedBaaland Ashtaroth. 14Â¶And theangerof theLordwas hot against Israel, and he delivered them into the hands ofspoilersthat spoiled them, and he sold them into the hands of their enemies round about, so that they could not any longer stand before their enemies. 15Whithersoever they went out, thehandof theLordwas against them for evil, as theLordhad said, and as theLordhad sworn unto them: and they were greatly distressed. 16Â¶Nevertheless theLordraised upjudges, whichdeliveredthem out of the hand of those that spoiled them. 17And yet they would not hearken unto their judges, but they went awhoringafter othergods, and bowed themselves unto them: they turnedquicklyout of the way which their fathers walked in, obeying the commandments of theLord;butthey did not so. 18And when theLordraised them up judges, then theLordwas with the judge, and delivered them out of the hand of their enemies all the days of the judge:for it repentedtheLordbecause of their groanings by reason of them that oppressed them andvexedthem. 19And it came to pass, when the judge was dead,thatthey returned, and corruptedthemselvesmore than theirfathers, in following other gods to serve them, and to bow down unto them; they ceased not from their own doings, nor from theirstubbornway. 20Â¶And the anger of theLordwas hot against Israel; and he said, Because that this people hath transgressed my covenant which I commanded their fathers, and have not hearkened unto my voice; 21I also will not henceforth drive out any from before them of the nations which Joshua left when he died: 22That through them I mayproveIsrael, whether they will keep the way of theLordtowalktherein, as their fathers did keepit,or not. 23Therefore theLordleft those nations, without driving them out hastily; neither delivered he them into the hand of Joshua."
    },
    {
      "reference": "Judges 3",
      "title": "Judges 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/3?lang=eng",
      "summary": "The children of Israel intermarry with the Canaanites, worship false gods, and are cursedâOthniel judges the IsraelitesâThey serve Moab and are delivered by Ehud, who slays Eglon.",
      "verses": [
        "1Now thesearethe nations which theLordleft, to prove Israel by them,evenas manyof Israelas had not known all the wars of Canaan;",
        "2Only that the generations of the children of Israel might know, to teach them war, at the least such as before knew nothing thereof;",
        "3Namely,fivelords of the Philistines, and all the Canaanites, and the Sidonians, and the Hivites that dwelt in mount Lebanon, frommount Baal-hermon unto the entering in of Hamath.",
        "4And they were to prove Israel by them, to know whether they would hearken unto the commandments of theLord, which he commanded their fathers by the hand of Moses.",
        "5Â¶And the children of Israeldweltamong the Canaanites, Hittites, and Amorites, and Perizzites, and Hivites, and Jebusites:",
        "6And they took their daughters to be their wives, andgavetheir daughters to their sons, and served their gods.",
        "7And the children of Israel didevilin the sight of theLord, and forgat theLordtheir God, andservedBaalimand thegroves.",
        "8Â¶Therefore the anger of theLordwas hot against Israel, and he sold them into the hand of Chushan-rishathaim king of Mesopotamia: and the children of Israel served Chushan-rishathaim eight years.",
        "9And when the children of Israel cried unto theLord, theLordraised up adelivererto the children of Israel, who delivered them,evenOthniel the son of Kenaz, Calebâs younger brother.",
        "10And theSpiritof theLordcame upon him, and he judged Israel, and went out to war: and theLorddelivered Chushan-rishathaim king of Mesopotamia into his hand; and his hand prevailed againstChushan-rishathaim.",
        "11And the land had rest forty years. And Othniel the son of Kenaz died.",
        "12Â¶And the children of Israel did evil again in the sight of theLord: and theLordstrengthened Eglon the king of Moab against Israel, because they had done evil in the sight of theLord.",
        "13And he gathered unto him the children of Ammon and Amalek, and went and smote Israel, and possessed the city of palm trees.",
        "14So the children of Israel served Eglon the king of Moab eighteen years.",
        "15But when the children of Israel cried unto theLord, theLordraised them up a deliverer, Ehud the son of Gera, a Benjamite, a man lefthanded: and by him the children of Israel sent a present unto Eglon the king of Moab.",
        "16But Ehud made him a dagger which had two edges, of a cubit length; and he did gird it under his raiment upon his right thigh.",
        "17And he brought the present unto Eglon king of Moab: and Eglonwasa very fat man.",
        "18And when he had made an end to offer the present, he sent away the people that bare the present.",
        "19But he himself turned again from the quarries thatwereby Gilgal, and said, I have a secreterrandunto thee, O king: who said, Keep silence. And all that stood by him went out from him.",
        "20And Ehud came unto him; and he was sitting in a summer parlour, which he had for himself alone. And Ehud said, I have a message from God unto thee. And he arose out ofhisseat.",
        "21And Ehud put forth his left hand, and took the dagger from his right thigh, and thrust it into his belly:",
        "22And thehaftalso went in after the blade; and the fat closed upon the blade, so that he could not draw the dagger out of his belly; and the dirt came out.",
        "23Then Ehud went forth through the porch, and shut the doors of theparlourupon him, and locked them.",
        "24When he was gone out, his servants came; and when they saw that, behold, the doors of the parlourwerelocked, they said, Surely he covereth his feet in his summer chamber.",
        "25And they tarried till they were ashamed: and, behold, he opened not the doors of the parlour; therefore they took a key, and openedthem:and, behold, their lordwasfallen down dead on the earth.",
        "26And Ehud escaped while they tarried, and passed beyond the quarries, and escaped unto Seirath.",
        "27And it came to pass, when he was come, that he blew a trumpet in the mountain of Ephraim, and the children of Israel went down with him from the mount, and he before them.",
        "28And he said unto them, Follow after me: for theLordhath delivered your enemies the Moabites into your hand. And they went down after him, and took the fords of Jordan toward Moab, and suffered not a man to pass over.",
        "29And they slew of Moab at that time about ten thousand men, alllusty, and all men of valour; and there escaped not a man.",
        "30SoMoabwassubduedthat day under the hand of Israel. And the land had restfourscoreyears.",
        "31Â¶And after him was Shamgar the son of Anath, which slew of the Philistines six hundred men with an ox goad: and he also delivered Israel."
      ],
      "full_text": "1Now thesearethe nations which theLordleft, to prove Israel by them,evenas manyof Israelas had not known all the wars of Canaan; 2Only that the generations of the children of Israel might know, to teach them war, at the least such as before knew nothing thereof; 3Namely,fivelords of the Philistines, and all the Canaanites, and the Sidonians, and the Hivites that dwelt in mount Lebanon, frommount Baal-hermon unto the entering in of Hamath. 4And they were to prove Israel by them, to know whether they would hearken unto the commandments of theLord, which he commanded their fathers by the hand of Moses. 5Â¶And the children of Israeldweltamong the Canaanites, Hittites, and Amorites, and Perizzites, and Hivites, and Jebusites: 6And they took their daughters to be their wives, andgavetheir daughters to their sons, and served their gods. 7And the children of Israel didevilin the sight of theLord, and forgat theLordtheir God, andservedBaalimand thegroves. 8Â¶Therefore the anger of theLordwas hot against Israel, and he sold them into the hand of Chushan-rishathaim king of Mesopotamia: and the children of Israel served Chushan-rishathaim eight years. 9And when the children of Israel cried unto theLord, theLordraised up adelivererto the children of Israel, who delivered them,evenOthniel the son of Kenaz, Calebâs younger brother. 10And theSpiritof theLordcame upon him, and he judged Israel, and went out to war: and theLorddelivered Chushan-rishathaim king of Mesopotamia into his hand; and his hand prevailed againstChushan-rishathaim. 11And the land had rest forty years. And Othniel the son of Kenaz died. 12Â¶And the children of Israel did evil again in the sight of theLord: and theLordstrengthened Eglon the king of Moab against Israel, because they had done evil in the sight of theLord. 13And he gathered unto him the children of Ammon and Amalek, and went and smote Israel, and possessed the city of palm trees. 14So the children of Israel served Eglon the king of Moab eighteen years. 15But when the children of Israel cried unto theLord, theLordraised them up a deliverer, Ehud the son of Gera, a Benjamite, a man lefthanded: and by him the children of Israel sent a present unto Eglon the king of Moab. 16But Ehud made him a dagger which had two edges, of a cubit length; and he did gird it under his raiment upon his right thigh. 17And he brought the present unto Eglon king of Moab: and Eglonwasa very fat man. 18And when he had made an end to offer the present, he sent away the people that bare the present. 19But he himself turned again from the quarries thatwereby Gilgal, and said, I have a secreterrandunto thee, O king: who said, Keep silence. And all that stood by him went out from him. 20And Ehud came unto him; and he was sitting in a summer parlour, which he had for himself alone. And Ehud said, I have a message from God unto thee. And he arose out ofhisseat. 21And Ehud put forth his left hand, and took the dagger from his right thigh, and thrust it into his belly: 22And thehaftalso went in after the blade; and the fat closed upon the blade, so that he could not draw the dagger out of his belly; and the dirt came out. 23Then Ehud went forth through the porch, and shut the doors of theparlourupon him, and locked them. 24When he was gone out, his servants came; and when they saw that, behold, the doors of the parlourwerelocked, they said, Surely he covereth his feet in his summer chamber. 25And they tarried till they were ashamed: and, behold, he opened not the doors of the parlour; therefore they took a key, and openedthem:and, behold, their lordwasfallen down dead on the earth. 26And Ehud escaped while they tarried, and passed beyond the quarries, and escaped unto Seirath. 27And it came to pass, when he was come, that he blew a trumpet in the mountain of Ephraim, and the children of Israel went down with him from the mount, and he before them. 28And he said unto them, Follow after me: for theLordhath delivered your enemies the Moabites into your hand. And they went down after him, and took the fords of Jordan toward Moab, and suffered not a man to pass over. 29And they slew of Moab at that time about ten thousand men, alllusty, and all men of valour; and there escaped not a man. 30SoMoabwassubduedthat day under the hand of Israel. And the land had restfourscoreyears. 31Â¶And after him was Shamgar the son of Anath, which slew of the Philistines six hundred men with an ox goad: and he also delivered Israel."
    },
    {
      "reference": "Judges 4",
      "title": "Judges 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/4?lang=eng",
      "summary": "Deborah, a prophetess, judges IsraelâShe and Barak deliver Israel from the CanaanitesâJael, a woman, slays Sisera, the Canaanite.",
      "verses": [
        "1And the children of Israel again didevilin the sight of theLord, when Ehud was dead.",
        "2And theLordsoldthem into the hand of Jabin king of Canaan, that reigned in Hazor; the captain of whose hostwasSisera, which dwelt in Harosheth of the Gentiles.",
        "3And the children of Israel cried unto theLord: for he had nine hundredchariotsof iron; and twenty years hemightilyoppressedthe children of Israel.",
        "4Â¶And Deborah, aprophetess, the wife of Lapidoth, she judged Israel at that time.",
        "5And shedweltunder the palm tree of Deborah between Ramah and Beth-el in mount Ephraim: and the children of Israel came up to her for judgment.",
        "6And she sent and calledBarakthe son of Abinoam out of Kedesh-naphtali, and said unto him, Hath not theLordGod of Israel commanded,saying,Go and draw toward mount Tabor, and take with thee ten thousand men of the children of Naphtali and of the children of Zebulun?",
        "7And I will draw unto thee to the river Kishon Sisera, the captain of Jabinâs army, with his chariots and his multitude; and I will deliver him into thine hand.",
        "8And Barak said unto her, If thou wilt go with me, then I will go: but if thou wilt not go with me,thenI will not go.",
        "9And she said, I will surely go with thee: notwithstanding the journey that thou takest shall not be for thine honour; for theLordshall sell Sisera into the hand of a woman. And Deborah arose, and went with Barak to Kedesh.",
        "10Â¶And Barak called Zebulun and Naphtali to Kedesh; and he went up with ten thousand men at his feet: and Deborah went up with him.",
        "11Now Heber the Kenite,which wasof the children of Hobab the father in law of Moses, had severed himself from the Kenites, and pitchedhis tent unto the plain of Zaanaim, whichisby Kedesh.",
        "12And they shewed Sisera that Barak the son of Abinoam was gone up to mount Tabor.",
        "13And Sisera gathered together all his chariots,evennine hundred chariots of iron, and all the people thatwerewith him, from Harosheth of the Gentiles unto the river of Kishon.",
        "14And Deborah said unto Barak, Up; for thisisthe day in which theLordhath delivered Sisera into thine hand: is not theLordgone outbeforethee? So Barak went down from mount Tabor, and ten thousand men after him.",
        "15And theLorddiscomfitedSisera, and allhischariots, and allhishost, with the edge of the sword before Barak; so that Sisera lighted down offhischariot, and fled away on his feet.",
        "16But Barak pursued after the chariots, and after the host, unto Harosheth of the Gentiles: and all the host of Sisera fell upon the edge of the sword;andthere was not a man left.",
        "17Howbeit Sisera fled away on his feet to the tent of Jael the wife of Heber the Kenite: forthere waspeace between Jabin the king of Hazor and the house of Heber the Kenite.",
        "18Â¶And Jael went out to meet Sisera, and said unto him, Turn in, my lord, turn in to me; fear not. And when he had turned in unto her into the tent, she covered him with amantle.",
        "19And he said unto her, Give me, I pray thee, a little water to drink; for I am thirsty. And she opened a bottle of milk, and gave him drink, and covered him.",
        "20Again he said unto her, Stand in the door of the tent, and it shall be, when any man doth come and inquire of thee, and say, Is there any man here? that thou shalt say, No.",
        "21Then Jael Heberâs wife took a nail of the tent, and took an hammer in her hand, and went softly unto him, and smote thenailinto histemples, and fastened it into the ground: for he was fast asleep and weary. So he died.",
        "22And, behold, as Barak pursued Sisera, Jael came out to meet him, and said unto him, Come, and I will shew thee the man whom thou seekest. And when he came into hertent,behold, Sisera lay dead, and the nailwasin his temples.",
        "23So God subdued on that day Jabin the king of Canaan before the children of Israel.",
        "24And the hand of the children of Israel prospered, and prevailed against Jabin the king of Canaan, until they had destroyed Jabin king of Canaan."
      ],
      "full_text": "1And the children of Israel again didevilin the sight of theLord, when Ehud was dead. 2And theLordsoldthem into the hand of Jabin king of Canaan, that reigned in Hazor; the captain of whose hostwasSisera, which dwelt in Harosheth of the Gentiles. 3And the children of Israel cried unto theLord: for he had nine hundredchariotsof iron; and twenty years hemightilyoppressedthe children of Israel. 4Â¶And Deborah, aprophetess, the wife of Lapidoth, she judged Israel at that time. 5And shedweltunder the palm tree of Deborah between Ramah and Beth-el in mount Ephraim: and the children of Israel came up to her for judgment. 6And she sent and calledBarakthe son of Abinoam out of Kedesh-naphtali, and said unto him, Hath not theLordGod of Israel commanded,saying,Go and draw toward mount Tabor, and take with thee ten thousand men of the children of Naphtali and of the children of Zebulun? 7And I will draw unto thee to the river Kishon Sisera, the captain of Jabinâs army, with his chariots and his multitude; and I will deliver him into thine hand. 8And Barak said unto her, If thou wilt go with me, then I will go: but if thou wilt not go with me,thenI will not go. 9And she said, I will surely go with thee: notwithstanding the journey that thou takest shall not be for thine honour; for theLordshall sell Sisera into the hand of a woman. And Deborah arose, and went with Barak to Kedesh. 10Â¶And Barak called Zebulun and Naphtali to Kedesh; and he went up with ten thousand men at his feet: and Deborah went up with him. 11Now Heber the Kenite,which wasof the children of Hobab the father in law of Moses, had severed himself from the Kenites, and pitchedhis tent unto the plain of Zaanaim, whichisby Kedesh. 12And they shewed Sisera that Barak the son of Abinoam was gone up to mount Tabor. 13And Sisera gathered together all his chariots,evennine hundred chariots of iron, and all the people thatwerewith him, from Harosheth of the Gentiles unto the river of Kishon. 14And Deborah said unto Barak, Up; for thisisthe day in which theLordhath delivered Sisera into thine hand: is not theLordgone outbeforethee? So Barak went down from mount Tabor, and ten thousand men after him. 15And theLorddiscomfitedSisera, and allhischariots, and allhishost, with the edge of the sword before Barak; so that Sisera lighted down offhischariot, and fled away on his feet. 16But Barak pursued after the chariots, and after the host, unto Harosheth of the Gentiles: and all the host of Sisera fell upon the edge of the sword;andthere was not a man left. 17Howbeit Sisera fled away on his feet to the tent of Jael the wife of Heber the Kenite: forthere waspeace between Jabin the king of Hazor and the house of Heber the Kenite. 18Â¶And Jael went out to meet Sisera, and said unto him, Turn in, my lord, turn in to me; fear not. And when he had turned in unto her into the tent, she covered him with amantle. 19And he said unto her, Give me, I pray thee, a little water to drink; for I am thirsty. And she opened a bottle of milk, and gave him drink, and covered him. 20Again he said unto her, Stand in the door of the tent, and it shall be, when any man doth come and inquire of thee, and say, Is there any man here? that thou shalt say, No. 21Then Jael Heberâs wife took a nail of the tent, and took an hammer in her hand, and went softly unto him, and smote thenailinto histemples, and fastened it into the ground: for he was fast asleep and weary. So he died. 22And, behold, as Barak pursued Sisera, Jael came out to meet him, and said unto him, Come, and I will shew thee the man whom thou seekest. And when he came into hertent,behold, Sisera lay dead, and the nailwasin his temples. 23So God subdued on that day Jabin the king of Canaan before the children of Israel. 24And the hand of the children of Israel prospered, and prevailed against Jabin the king of Canaan, until they had destroyed Jabin king of Canaan."
    },
    {
      "reference": "Judges 6",
      "title": "Judges 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/6?lang=eng",
      "summary": "Israel is in bondage to the MidianitesâAn angel appears to Gideon and calls him to deliver IsraelâHe overthrows the altar of Baal, the Spirit of the Lord rests upon him, and the Lord gives him a sign to show he is called to deliver Israel.",
      "verses": [
        "1And the children of Israel did evil in the sight of theLord: and theLorddelivered them into the hand of Midian seven years.",
        "2And the hand of Midian prevailed against Israel:andbecause of the Midianites the children of Israel made them the dens whicharein the mountains, and caves, and strong holds.",
        "3Andsoit was, when Israel had sown, that the Midianites came up, and the Amalekites, and the children of theeast, even they came up against them;",
        "4And they encamped against them, and destroyed theincreaseof the earth, till thou come unto Gaza, and left no sustenance for Israel, neither sheep, nor ox, nor ass.",
        "5For they came up with their cattle and their tents, and they came as grasshoppers for multitude;forboth they and their camels were without number: and they entered into the land to destroy it.",
        "6And Israel was greatly impoverished because of the Midianites; and the children of Israel cried unto theLord.",
        "7Â¶And it came to pass, when the children of Israel cried unto theLordbecause of the Midianites,",
        "8That theLordsent a prophet unto the children of Israel, which said unto them, Thus saith theLordGod of Israel, I brought you up from Egypt, and brought you forth out of the house of bondage;",
        "9And I delivered you out of the hand of the Egyptians, and out of the hand of all that oppressed you, and drave them out from before you, and gave you their land;",
        "10And I said unto you, IamtheLordyour God;fear notthe gods of the Amorites, in whose land ye dwell: but ye have notobeyedmy voice.",
        "11Â¶And there came an angel of theLord, and sat under an oak whichwasin Ophrah, thatpertainedunto Joash the Abi-ezrite: and his son Gideon threshed wheatby the winepress, to hideitfrom the Midianites.",
        "12And the angel of theLordappeared unto him, and said unto him, TheLordiswith thee, thou mighty man of valour.",
        "13And Gideon said unto him, Oh my Lord, if theLordbe with us, why then is all this befallen us? and wherebeall hismiracleswhich our fathers told us of, saying, Did not theLordbring us up from Egypt? but now theLordhath forsaken us, and delivered us into the hands of the Midianites.",
        "14And theLordlooked upon him, and said, Go in this thymight, and thou shalt save Israel from the hand of the Midianites: have not I sent thee?",
        "15And he said unto him, Oh my Lord, wherewith shall I save Israel? behold, my familyispoor in Manasseh, and Iamtheleastin my fatherâs house.",
        "16And theLordsaid unto him, Surely I will bewith thee, and thou shalt smite the Midianites as one man.",
        "17And he said unto him, If now I have foundgracein thy sight, then shew me asignthat thou talkest with me.",
        "18Depart not hence, I pray thee, until I come unto thee, and bring forth my present, and setitbefore thee. And he said, I will tarry until thou come again.",
        "19Â¶And Gideon went in, and made ready a kid, and unleavened cakes of an ephah of flour: the flesh he put in a basket, and he put the broth in a pot, and broughtitout unto him under the oak, and presentedit.",
        "20And the angel of God said unto him, Take the flesh and the unleavened cakes, and laythemupon this rock, and pour out the broth. And he did so.",
        "21Â¶Then the angel of theLordput forth the end of the staff thatwasin his hand, and touched the flesh and the unleavened cakes; and there rose upfireout of the rock, and consumed the flesh and the unleavened cakes. Then the angel of theLorddeparted out of his sight.",
        "22And when Gideon perceived that hewasan angel of theLord, Gideon said, Alas, O LordGod! for because I have seen anangelof theLordface toface.",
        "23And theLordsaid unto him, Peacebeunto thee; fear not: thou shalt not die.",
        "24Then Gideon built an altar there unto theLord, and called itJehovah-shalom: unto this day itisyet in Ophrah of the Abi-ezrites.",
        "25Â¶And it came to pass the same night, that theLordsaid unto him, Take thy fatherâs young bullock, even the second bullock of seven years old, and throw down the altar ofBaalthat thy father hath, and cut down thegrovethatisby it:",
        "26And build an altar unto theLordthy God upon the top of thisrock, in the ordered place, and take the second bullock, and offer a burnt sacrifice with the wood of the grove which thou shalt cut down.",
        "27Then Gideon took ten men of his servants, and did as theLordhad said unto him: andsoit was, because he feared his fatherâs household, and the men of the city, that he could not doitby day, that he diditby night.",
        "28Â¶And when the men of the city arose early in the morning, behold, the altar of Baal was cast down, and the grove was cut down thatwasby it, and the second bullock was offered upon the altarthat wasbuilt.",
        "29And they said one to another, Who hath done this thing? And when they inquired and asked, theysaid, Gideon the son of Joash hath done this thing.",
        "30Then the men of the city said unto Joash, Bring out thy son, that he may die: because he hath cast down the altar of Baal, and because he hath cut down the grove thatwasby it.",
        "31And Joash said unto all that stood against him, Will ye plead for Baal? will ye save him? he that will plead for him, let him be put to deathwhilstit is yetmorning: if hebea god, let him plead for himself, becauseonehath cast down his altar.",
        "32Therefore on that day he called himJerubbaal, saying, Let Baal plead against him, because he hath thrown down his altar.",
        "33Â¶Then all the Midianites and the Amalekites and the children of the east were gathered together, and went over, and pitched in the valley of Jezreel.",
        "34But the Spirit of theLordcame upon Gideon, and he blew a trumpet; and Abi-ezer was gathered after him.",
        "35And he sent messengers throughout all Manasseh; who also was gathered after him: and he sent messengers unto Asher, and unto Zebulun, and unto Naphtali; and they came up to meet them.",
        "36Â¶And Gideon said unto God, If thou wilt save Israel by mine hand, as thou hast said,",
        "37Behold, I will put a fleece of wool in the floor;andif the dew be on the fleece only, andit bedry upon all the earthbeside,then shall I know that thou wilt save Israel by mine hand, as thou hast said.",
        "38And it was so: for he rose up early on the morrow, and thrust the fleece together, and wringed the dew out of the fleece, a bowl full of water.",
        "39And Gideon said unto God, Let not thineangerbe hot against me, and I will speak but this once: let meprove, I pray thee, but this once with the fleece; let it now be dry only upon the fleece, and upon all the ground let there be dew.",
        "40And God did so that night: for it was dry upon the fleece only, and there was dew on all the ground."
      ],
      "full_text": "1And the children of Israel did evil in the sight of theLord: and theLorddelivered them into the hand of Midian seven years. 2And the hand of Midian prevailed against Israel:andbecause of the Midianites the children of Israel made them the dens whicharein the mountains, and caves, and strong holds. 3Andsoit was, when Israel had sown, that the Midianites came up, and the Amalekites, and the children of theeast, even they came up against them; 4And they encamped against them, and destroyed theincreaseof the earth, till thou come unto Gaza, and left no sustenance for Israel, neither sheep, nor ox, nor ass. 5For they came up with their cattle and their tents, and they came as grasshoppers for multitude;forboth they and their camels were without number: and they entered into the land to destroy it. 6And Israel was greatly impoverished because of the Midianites; and the children of Israel cried unto theLord. 7Â¶And it came to pass, when the children of Israel cried unto theLordbecause of the Midianites, 8That theLordsent a prophet unto the children of Israel, which said unto them, Thus saith theLordGod of Israel, I brought you up from Egypt, and brought you forth out of the house of bondage; 9And I delivered you out of the hand of the Egyptians, and out of the hand of all that oppressed you, and drave them out from before you, and gave you their land; 10And I said unto you, IamtheLordyour God;fear notthe gods of the Amorites, in whose land ye dwell: but ye have notobeyedmy voice. 11Â¶And there came an angel of theLord, and sat under an oak whichwasin Ophrah, thatpertainedunto Joash the Abi-ezrite: and his son Gideon threshed wheatby the winepress, to hideitfrom the Midianites. 12And the angel of theLordappeared unto him, and said unto him, TheLordiswith thee, thou mighty man of valour. 13And Gideon said unto him, Oh my Lord, if theLordbe with us, why then is all this befallen us? and wherebeall hismiracleswhich our fathers told us of, saying, Did not theLordbring us up from Egypt? but now theLordhath forsaken us, and delivered us into the hands of the Midianites. 14And theLordlooked upon him, and said, Go in this thymight, and thou shalt save Israel from the hand of the Midianites: have not I sent thee? 15And he said unto him, Oh my Lord, wherewith shall I save Israel? behold, my familyispoor in Manasseh, and Iamtheleastin my fatherâs house. 16And theLordsaid unto him, Surely I will bewith thee, and thou shalt smite the Midianites as one man. 17And he said unto him, If now I have foundgracein thy sight, then shew me asignthat thou talkest with me. 18Depart not hence, I pray thee, until I come unto thee, and bring forth my present, and setitbefore thee. And he said, I will tarry until thou come again. 19Â¶And Gideon went in, and made ready a kid, and unleavened cakes of an ephah of flour: the flesh he put in a basket, and he put the broth in a pot, and broughtitout unto him under the oak, and presentedit. 20And the angel of God said unto him, Take the flesh and the unleavened cakes, and laythemupon this rock, and pour out the broth. And he did so. 21Â¶Then the angel of theLordput forth the end of the staff thatwasin his hand, and touched the flesh and the unleavened cakes; and there rose upfireout of the rock, and consumed the flesh and the unleavened cakes. Then the angel of theLorddeparted out of his sight. 22And when Gideon perceived that hewasan angel of theLord, Gideon said, Alas, O LordGod! for because I have seen anangelof theLordface toface. 23And theLordsaid unto him, Peacebeunto thee; fear not: thou shalt not die. 24Then Gideon built an altar there unto theLord, and called itJehovah-shalom: unto this day itisyet in Ophrah of the Abi-ezrites. 25Â¶And it came to pass the same night, that theLordsaid unto him, Take thy fatherâs young bullock, even the second bullock of seven years old, and throw down the altar ofBaalthat thy father hath, and cut down thegrovethatisby it: 26And build an altar unto theLordthy God upon the top of thisrock, in the ordered place, and take the second bullock, and offer a burnt sacrifice with the wood of the grove which thou shalt cut down. 27Then Gideon took ten men of his servants, and did as theLordhad said unto him: andsoit was, because he feared his fatherâs household, and the men of the city, that he could not doitby day, that he diditby night. 28Â¶And when the men of the city arose early in the morning, behold, the altar of Baal was cast down, and the grove was cut down thatwasby it, and the second bullock was offered upon the altarthat wasbuilt. 29And they said one to another, Who hath done this thing? And when they inquired and asked, theysaid, Gideon the son of Joash hath done this thing. 30Then the men of the city said unto Joash, Bring out thy son, that he may die: because he hath cast down the altar of Baal, and because he hath cut down the grove thatwasby it. 31And Joash said unto all that stood against him, Will ye plead for Baal? will ye save him? he that will plead for him, let him be put to deathwhilstit is yetmorning: if hebea god, let him plead for himself, becauseonehath cast down his altar. 32Therefore on that day he called himJerubbaal, saying, Let Baal plead against him, because he hath thrown down his altar. 33Â¶Then all the Midianites and the Amalekites and the children of the east were gathered together, and went over, and pitched in the valley of Jezreel. 34But the Spirit of theLordcame upon Gideon, and he blew a trumpet; and Abi-ezer was gathered after him. 35And he sent messengers throughout all Manasseh; who also was gathered after him: and he sent messengers unto Asher, and unto Zebulun, and unto Naphtali; and they came up to meet them. 36Â¶And Gideon said unto God, If thou wilt save Israel by mine hand, as thou hast said, 37Behold, I will put a fleece of wool in the floor;andif the dew be on the fleece only, andit bedry upon all the earthbeside,then shall I know that thou wilt save Israel by mine hand, as thou hast said. 38And it was so: for he rose up early on the morrow, and thrust the fleece together, and wringed the dew out of the fleece, a bowl full of water. 39And Gideon said unto God, Let not thineangerbe hot against me, and I will speak but this once: let meprove, I pray thee, but this once with the fleece; let it now be dry only upon the fleece, and upon all the ground let there be dew. 40And God did so that night: for it was dry upon the fleece only, and there was dew on all the ground."
    },
    {
      "reference": "Judges 7",
      "title": "Judges 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/7?lang=eng",
      "summary": "Gideonâs army is reduced to 300âThey frighten the Midianite armies with trumpets and lightsâThe Midianites fight among themselves, flee, and are defeated by Israel.",
      "verses": [
        "1Then Jerubbaal, whoisGideon, and all the people thatwerewith him, rose up early, and pitched beside the well of Harod: so that the host of the Midianites were on the north side of them, by the hill of Moreh, in the valley.",
        "2And theLordsaid unto Gideon, The people thatarewith theearetoo many for me to give the Midianites into their hands, lest Israel vaunt themselves against me, saying, Mine own hand hath saved me.",
        "3Now therefore go to, proclaim in the ears of the people, saying, Whosoeverisfearfuland afraid, let him return and depart early frommount Gilead. And there returned of the people twenty and two thousand; and there remained ten thousand.",
        "4And theLordsaid unto Gideon, The peopleareyettoomany; bring them down unto the water, and I willtrythem for thee there: and it shall be,thatof whom I say unto thee, This shall go with thee, the same shall go with thee; and of whomsoever I say unto thee, This shall not go with thee, the same shall not go.",
        "5So he brought down the people unto the water: and theLordsaid unto Gideon, Every one that lappeth of the water with his tongue, as a dog lappeth, him shalt thou set by himself; likewise every one that boweth down upon his knees to drink.",
        "6And the number of them thatlapped,puttingtheir hand to their mouth, were three hundred men: but all the rest of the people bowed down upon their knees to drink water.",
        "7And theLordsaid unto Gideon, By the three hundred men that lapped will I save you, and deliver the Midianites into thine hand: and let all theotherpeople go every man unto his place.",
        "8So the people tookvictualsin their hand, and their trumpets: and he sent allthe rest ofIsrael every man unto his tent, and retained those three hundred men: and the host of Midian was beneath him in the valley.",
        "9Â¶And it came to pass the same night, that theLordsaid unto him, Arise, get thee down unto the host; for I have delivered it into thine hand.",
        "10But if thou fear to go down, go thou with Phurah thy servant down to the host:",
        "11And thou shalt hear what they say; and afterward shall thine hands be strengthened to go down unto the host. Then went he down with Phurah his servant unto the outside of the armed men thatwerein the host.",
        "12And the Midianites and the Amalekites and all the children of the east lay along in the valley like grasshoppers for multitude; and their camelswerewithout number, as the sand by the sea side for multitude.",
        "13And when Gideon was come, behold,there wasa man that told a dream unto his fellow, and said, Behold, I dreamed adream, and, lo, a cake of barley bread tumbled into thehostof Midian, and came unto a tent, and smote it that it fell, and overturned it, thatthe tent lay along.",
        "14And his fellow answered and said, Thisisnothing else save the sword of Gideon the son of Joash, a man of Israel:forinto his hand hath God delivered Midian, and all the host.",
        "15Â¶And it wasso,when Gideon heard the telling of the dream, and the interpretation thereof, that he worshipped, and returned into the host of Israel, and said, Arise; for theLordhath delivered into your hand the host of Midian.",
        "16And he divided the three hundred menintothree companies, and he put a trumpet in every manâs hand, with empty pitchers, and lamps within the pitchers.",
        "17And he said unto them, Look on me, and do likewise: and, behold, when I come to the outside of the camp, it shall bethat,as I do, so shall ye do.",
        "18When I blow with a trumpet, I and all thatarewith me, then blow ye the trumpets also on every side of all the camp, and say,The swordof theLord, and of Gideon.",
        "19Â¶So Gideon, and the hundred men thatwerewith him, came unto the outside of the camp in the beginning of the middle watch; and they had but newly set the watch: and they blew the trumpets, and brake the pitchers thatwerein their hands.",
        "20And the three companies blew the trumpets, and brake the pitchers, and held the lamps in their left hands, and the trumpets in their right hands to blowwithal:and they cried, The sword of theLord, and of Gideon.",
        "21And they stood every man in his place round about the camp: and all the host ran, and cried, and fled.",
        "22And the three hundred blew the trumpets, and theLordset every manâs sword against hisfellow, even throughout all the host: and the host fled to Beth-shittah in Zererath,andto the border of Abel-meholah, unto Tabbath.",
        "23And the men of Israel gathered themselves together out of Naphtali, and out of Asher, and out of allManasseh, and pursued after theMidianites.",
        "24Â¶And Gideon sent messengers throughout all mount Ephraim, saying, Come down against the Midianites, and take before them the waters unto Beth-barah and Jordan. Then all the men of Ephraim gathered themselves together, and took the waters unto Beth-barah and Jordan.",
        "25And they took two princes of the Midianites, Oreb and Zeeb; and they slewOrebupon the rock Oreb, and Zeeb they slew at the winepress of Zeeb, and pursued Midian, and brought the heads of Oreb and Zeeb to Gideon on the other side Jordan."
      ],
      "full_text": "1Then Jerubbaal, whoisGideon, and all the people thatwerewith him, rose up early, and pitched beside the well of Harod: so that the host of the Midianites were on the north side of them, by the hill of Moreh, in the valley. 2And theLordsaid unto Gideon, The people thatarewith theearetoo many for me to give the Midianites into their hands, lest Israel vaunt themselves against me, saying, Mine own hand hath saved me. 3Now therefore go to, proclaim in the ears of the people, saying, Whosoeverisfearfuland afraid, let him return and depart early frommount Gilead. And there returned of the people twenty and two thousand; and there remained ten thousand. 4And theLordsaid unto Gideon, The peopleareyettoomany; bring them down unto the water, and I willtrythem for thee there: and it shall be,thatof whom I say unto thee, This shall go with thee, the same shall go with thee; and of whomsoever I say unto thee, This shall not go with thee, the same shall not go. 5So he brought down the people unto the water: and theLordsaid unto Gideon, Every one that lappeth of the water with his tongue, as a dog lappeth, him shalt thou set by himself; likewise every one that boweth down upon his knees to drink. 6And the number of them thatlapped,puttingtheir hand to their mouth, were three hundred men: but all the rest of the people bowed down upon their knees to drink water. 7And theLordsaid unto Gideon, By the three hundred men that lapped will I save you, and deliver the Midianites into thine hand: and let all theotherpeople go every man unto his place. 8So the people tookvictualsin their hand, and their trumpets: and he sent allthe rest ofIsrael every man unto his tent, and retained those three hundred men: and the host of Midian was beneath him in the valley. 9Â¶And it came to pass the same night, that theLordsaid unto him, Arise, get thee down unto the host; for I have delivered it into thine hand. 10But if thou fear to go down, go thou with Phurah thy servant down to the host: 11And thou shalt hear what they say; and afterward shall thine hands be strengthened to go down unto the host. Then went he down with Phurah his servant unto the outside of the armed men thatwerein the host. 12And the Midianites and the Amalekites and all the children of the east lay along in the valley like grasshoppers for multitude; and their camelswerewithout number, as the sand by the sea side for multitude. 13And when Gideon was come, behold,there wasa man that told a dream unto his fellow, and said, Behold, I dreamed adream, and, lo, a cake of barley bread tumbled into thehostof Midian, and came unto a tent, and smote it that it fell, and overturned it, thatthe tent lay along. 14And his fellow answered and said, Thisisnothing else save the sword of Gideon the son of Joash, a man of Israel:forinto his hand hath God delivered Midian, and all the host. 15Â¶And it wasso,when Gideon heard the telling of the dream, and the interpretation thereof, that he worshipped, and returned into the host of Israel, and said, Arise; for theLordhath delivered into your hand the host of Midian. 16And he divided the three hundred menintothree companies, and he put a trumpet in every manâs hand, with empty pitchers, and lamps within the pitchers. 17And he said unto them, Look on me, and do likewise: and, behold, when I come to the outside of the camp, it shall bethat,as I do, so shall ye do. 18When I blow with a trumpet, I and all thatarewith me, then blow ye the trumpets also on every side of all the camp, and say,The swordof theLord, and of Gideon. 19Â¶So Gideon, and the hundred men thatwerewith him, came unto the outside of the camp in the beginning of the middle watch; and they had but newly set the watch: and they blew the trumpets, and brake the pitchers thatwerein their hands. 20And the three companies blew the trumpets, and brake the pitchers, and held the lamps in their left hands, and the trumpets in their right hands to blowwithal:and they cried, The sword of theLord, and of Gideon. 21And they stood every man in his place round about the camp: and all the host ran, and cried, and fled. 22And the three hundred blew the trumpets, and theLordset every manâs sword against hisfellow, even throughout all the host: and the host fled to Beth-shittah in Zererath,andto the border of Abel-meholah, unto Tabbath. 23And the men of Israel gathered themselves together out of Naphtali, and out of Asher, and out of allManasseh, and pursued after theMidianites. 24Â¶And Gideon sent messengers throughout all mount Ephraim, saying, Come down against the Midianites, and take before them the waters unto Beth-barah and Jordan. Then all the men of Ephraim gathered themselves together, and took the waters unto Beth-barah and Jordan. 25And they took two princes of the Midianites, Oreb and Zeeb; and they slewOrebupon the rock Oreb, and Zeeb they slew at the winepress of Zeeb, and pursued Midian, and brought the heads of Oreb and Zeeb to Gideon on the other side Jordan."
    },
    {
      "reference": "Judges 8",
      "title": "Judges 8",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/8?lang=eng",
      "summary": "Gideon pursues and destroys the MidianitesâHe frees the children of Israel but refuses their invitation to reign as king over themâGideon dies, and Israel returns to idolatry.",
      "verses": [
        "1And the men of Ephraim said unto him, Why hast thou served us thus, that thou calledst us not, when thou wentest to fight with the Midianites? And they did chide with him sharply.",
        "2And he said unto them, What have I done now in comparison of you?Isnot the gleaning of the grapes of Ephraim better than the vintage of Abi-ezer?",
        "3God hath delivered into your hands the princes of Midian, Oreb and Zeeb: and what was I able to do in comparison of you? Then their anger was abated toward him, when he had said that.",
        "4Â¶And Gideon came to Jordan,andpassed over, he, and the three hundred men thatwerewith him, faint, yet pursuingthem.",
        "5And he said unto the men of Succoth, Give, I pray you, loaves of bread unto the people that follow me; for theybefaint, and I am pursuing afterZebahand Zalmunna, kings of Midian.",
        "6Â¶And the princes of Succoth said,Arethe hands of Zebah and Zalmunna now in thine hand, that we should give bread unto thine army?",
        "7And Gideon said, Therefore when theLordhath delivered Zebah and Zalmunna into mine hand, then I will tear your flesh with the thorns of the wilderness and with briers.",
        "8Â¶And he went up thence to Penuel, and spake unto them likewise: and the men of Penuel answered him as the men of Succoth had answeredhim.",
        "9And he spake also unto the men of Penuel, saying, When I come again in peace, I will break down this tower.",
        "10Â¶Now Zebah and Zalmunnawerein Karkor, and their hosts with them, about fifteen thousandmen,all that were left of all the hosts of the children of the east: for there fell an hundred and twenty thousand men that drew sword.",
        "11Â¶And Gideon went up by the way of them that dwelt in tents on the east of Nobah and Jogbehah, and smote the host: for the host wassecure.",
        "12And when Zebah and Zalmunna fled, he pursued after them, and took the two kings of Midian, Zebah and Zalmunna, and discomfited all the host.",
        "13Â¶And Gideon the son of Joash returned from battle before the sunwas up,",
        "14And caught a young man of the men of Succoth, and inquired of him: and he described unto him the princes of Succoth, and the elders thereof,eventhreescore and seventeen men.",
        "15And he came unto the men of Succoth, and said, Behold Zebah and Zalmunna, with whom ye did upbraid me, saying,Arethe hands of Zebah and Zalmunna now in thine hand, that we should give bread unto thy menthat areweary?",
        "16And he took the elders of the city, and thorns of the wilderness and briers, and with them he taught the men of Succoth.",
        "17And he beat down the tower of Penuel, and slew the men of the city.",
        "18Â¶Then said he unto Zebah and Zalmunna, What manner of menwere theywhom ye slew at Tabor? And they answered, As thouart,sowerethey; each one resembled the children of a king.",
        "19And he said, Theyweremy brethren,eventhe sons of my mother:astheLordliveth, if ye had saved them alive, I would not slay you.",
        "20And he said unto Jether his firstborn, Up,andslay them. But the youth drew not his sword: for he feared, because hewasyet a youth.",
        "21Then Zebah and Zalmunna said, Rise thou, and fall upon us: for as the manis, so ishis strength. And Gideon arose, and slew Zebah and Zalmunna, and took away the ornaments thatwereon their camelsâ necks.",
        "22Â¶Then the men of Israel said unto Gideon, Rule thou over us, both thou, and thy son, and thy sonâs son also: for thou hast delivered us from the hand of Midian.",
        "23And Gideon said unto them, I will notruleover you, neither shall my son rule over you: theLordshallruleover you.",
        "24Â¶And Gideon said unto them, I would desire a request of you, that ye would give me every man the earrings of his prey. (For they had golden earrings, because theywereIshmaelites.)",
        "25And they answered, We will willingly givethem.And they spread a garment, and did cast therein every man the earrings of his prey.",
        "26And the weight of thegoldenearrings that he requested was a thousand and seven hundredshekelsof gold; besideornaments, and collars, and purple raiment thatwason the kings of Midian, and beside the chains thatwereabout their camelsâ necks.",
        "27And Gideon made anephodthereof, and put it in his city,evenin Ophrah: and all Israel went thither a whoring after it: which thing became asnareunto Gideon, and to his house.",
        "28Â¶Thus was Midian subdued before the children of Israel, so that they lifted up their heads no more. And the country was in quietness forty years in the days of Gideon.",
        "29Â¶And Jerubbaal the son of Joash went and dwelt in his own house.",
        "30And Gideon had threescore and ten sons of his body begotten: for he had many wives.",
        "31And his concubine thatwasin Shechem, she also bare him a son, whose name he called Abimelech.",
        "32Â¶And Gideon the son of Joash died in a good old age, and was buried in the sepulchre of Joash his father, in Ophrah of the Abi-ezrites.",
        "33And it came to pass, as soon as Gideon was dead, that the children of Israel turned again, and went a whoring after Baalim, and made Baal-berith their god.",
        "34And the children of Israel remembered not theLordtheir God, who had delivered them out of the hands of all their enemies on every side:",
        "35Neither shewed they kindness to the house of Jerubbaal,namely,Gideon, according to all the goodness which he had shewed unto Israel."
      ],
      "full_text": "1And the men of Ephraim said unto him, Why hast thou served us thus, that thou calledst us not, when thou wentest to fight with the Midianites? And they did chide with him sharply. 2And he said unto them, What have I done now in comparison of you?Isnot the gleaning of the grapes of Ephraim better than the vintage of Abi-ezer? 3God hath delivered into your hands the princes of Midian, Oreb and Zeeb: and what was I able to do in comparison of you? Then their anger was abated toward him, when he had said that. 4Â¶And Gideon came to Jordan,andpassed over, he, and the three hundred men thatwerewith him, faint, yet pursuingthem. 5And he said unto the men of Succoth, Give, I pray you, loaves of bread unto the people that follow me; for theybefaint, and I am pursuing afterZebahand Zalmunna, kings of Midian. 6Â¶And the princes of Succoth said,Arethe hands of Zebah and Zalmunna now in thine hand, that we should give bread unto thine army? 7And Gideon said, Therefore when theLordhath delivered Zebah and Zalmunna into mine hand, then I will tear your flesh with the thorns of the wilderness and with briers. 8Â¶And he went up thence to Penuel, and spake unto them likewise: and the men of Penuel answered him as the men of Succoth had answeredhim. 9And he spake also unto the men of Penuel, saying, When I come again in peace, I will break down this tower. 10Â¶Now Zebah and Zalmunnawerein Karkor, and their hosts with them, about fifteen thousandmen,all that were left of all the hosts of the children of the east: for there fell an hundred and twenty thousand men that drew sword. 11Â¶And Gideon went up by the way of them that dwelt in tents on the east of Nobah and Jogbehah, and smote the host: for the host wassecure. 12And when Zebah and Zalmunna fled, he pursued after them, and took the two kings of Midian, Zebah and Zalmunna, and discomfited all the host. 13Â¶And Gideon the son of Joash returned from battle before the sunwas up, 14And caught a young man of the men of Succoth, and inquired of him: and he described unto him the princes of Succoth, and the elders thereof,eventhreescore and seventeen men. 15And he came unto the men of Succoth, and said, Behold Zebah and Zalmunna, with whom ye did upbraid me, saying,Arethe hands of Zebah and Zalmunna now in thine hand, that we should give bread unto thy menthat areweary? 16And he took the elders of the city, and thorns of the wilderness and briers, and with them he taught the men of Succoth. 17And he beat down the tower of Penuel, and slew the men of the city. 18Â¶Then said he unto Zebah and Zalmunna, What manner of menwere theywhom ye slew at Tabor? And they answered, As thouart,sowerethey; each one resembled the children of a king. 19And he said, Theyweremy brethren,eventhe sons of my mother:astheLordliveth, if ye had saved them alive, I would not slay you. 20And he said unto Jether his firstborn, Up,andslay them. But the youth drew not his sword: for he feared, because hewasyet a youth. 21Then Zebah and Zalmunna said, Rise thou, and fall upon us: for as the manis, so ishis strength. And Gideon arose, and slew Zebah and Zalmunna, and took away the ornaments thatwereon their camelsâ necks. 22Â¶Then the men of Israel said unto Gideon, Rule thou over us, both thou, and thy son, and thy sonâs son also: for thou hast delivered us from the hand of Midian. 23And Gideon said unto them, I will notruleover you, neither shall my son rule over you: theLordshallruleover you. 24Â¶And Gideon said unto them, I would desire a request of you, that ye would give me every man the earrings of his prey. (For they had golden earrings, because theywereIshmaelites.) 25And they answered, We will willingly givethem.And they spread a garment, and did cast therein every man the earrings of his prey. 26And the weight of thegoldenearrings that he requested was a thousand and seven hundredshekelsof gold; besideornaments, and collars, and purple raiment thatwason the kings of Midian, and beside the chains thatwereabout their camelsâ necks. 27And Gideon made anephodthereof, and put it in his city,evenin Ophrah: and all Israel went thither a whoring after it: which thing became asnareunto Gideon, and to his house. 28Â¶Thus was Midian subdued before the children of Israel, so that they lifted up their heads no more. And the country was in quietness forty years in the days of Gideon. 29Â¶And Jerubbaal the son of Joash went and dwelt in his own house. 30And Gideon had threescore and ten sons of his body begotten: for he had many wives. 31And his concubine thatwasin Shechem, she also bare him a son, whose name he called Abimelech. 32Â¶And Gideon the son of Joash died in a good old age, and was buried in the sepulchre of Joash his father, in Ophrah of the Abi-ezrites. 33And it came to pass, as soon as Gideon was dead, that the children of Israel turned again, and went a whoring after Baalim, and made Baal-berith their god. 34And the children of Israel remembered not theLordtheir God, who had delivered them out of the hands of all their enemies on every side: 35Neither shewed they kindness to the house of Jerubbaal,namely,Gideon, according to all the goodness which he had shewed unto Israel."
    },
    {
      "reference": "Judges 13",
      "title": "Judges 13",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/13?lang=eng",
      "summary": "Israel is in Philistine bondage for forty yearsâAn angel comes to Manoahâs wife and promises a son who will begin to deliver IsraelâThe angel comes again; he ascends in a flame from the altarâSamson is born, and the Spirit of the Lord moves upon him.",
      "verses": [
        "1And the children of Israel didevilagain in the sight of theLord; and theLorddelivered them into thehandof the Philistines forty years.",
        "2Â¶And there was a certain man of Zorah, of the family of the Danites, whose namewasManoah; and his wifewasbarren, and bare not.",
        "3And theangelof theLordappeared unto the woman, and said unto her, Behold now, thouartbarren, and bearest not: but thou shalt conceive, and bear a son.",
        "4Now therefore beware, I pray thee, anddrinknot wine nor strong drink, and eat not anyuncleanthing:",
        "5For, lo, thou shalt conceive, and bear a son; and norazorshall come on his head: for the child shall be a Nazarite unto God from the womb: and he shall begin todeliverIsrael out of the hand of the Philistines.",
        "6Â¶Then the woman came and told her husband, saying, A man of God came unto me, and his countenancewaslike the countenance of anangelof God, very terrible: but I asked him not whence hewas,neither told he me his name:",
        "7But he said unto me, Behold,thou shalt conceive, and bear a son; and now drink no wine nor strong drink, neither eat any uncleanthing:for the child shall be a Nazarite to God from the womb to the day of his death.",
        "8Â¶Then Manoah entreated theLord, and said, O my Lord, let the man of God which thou didst send come again unto us, and teach us what we shall do unto the child that shall be born.",
        "9And God hearkened to the voice of Manoah; and the angel of God came again unto the woman as she sat in the field: but Manoah her husbandwasnot with her.",
        "10And the woman made haste, and ran, and shewed her husband, and said unto him, Behold, the man hath appeared unto me, that came unto me theotherday.",
        "11And Manoah arose, and went after his wife, and came to the man, and said unto him,Artthou the man that spakest unto the woman? And he said, Iam.",
        "12And Manoah said, Now let thy words come to pass. How shall we order the child, andhowshall we do unto him?",
        "13And the angel of theLordsaid unto Manoah, Of all that I said unto the woman let her beware.",
        "14She may not eat of anythingthat cometh of the vine, neither let her drink wine or strong drink, nor eat any uncleanthing:all that I commanded her let her observe.",
        "15Â¶And Manoah said unto the angel of theLord, I pray thee, let us detain thee, until we shall have made ready a kid for thee.",
        "16And the angel of theLordsaid unto Manoah, Though thou detain me, I will not eat of thy bread: and if thou wilt offer a burnt offering, thou must offer it unto theLord. For Manoah knew not that hewasan angel of theLord.",
        "17And Manoah said unto the angel of theLord, Whatisthy name, that when thy sayings come to pass we may do thee honour?",
        "18And the angel of theLordsaid unto him, Why askest thou thus after my name, seeing itissecret?",
        "19So Manoah took a kid with ameatoffering, and offereditupon a rock unto theLord: andthe angeldid wondrously; and Manoah and his wife looked on.",
        "20For it came to pass, when the flame went up toward heaven from off the altar, that the angel of theLordascended in the flame of the altar. And Manoah and his wife looked onit,and fell on their faces to the ground.",
        "21But the angel of theLorddid no more appear to Manoah and to his wife. Then Manoah knew that hewasan angel of theLord.",
        "22And Manoah said unto his wife, We shall surely die, because we haveseenGod.",
        "23But his wife said unto him, If theLordwere pleased to kill us, he would not have received a burnt offering and a meat offering at our hands, neither would he have shewed us all thesethings,nor would as at this time have told ussuch thingsas these.",
        "24Â¶And the woman bare a son, and called his name Samson: and the child grew, and theLordblessed him.",
        "25And the Spirit of theLordbegan to move him at times in the camp of Dan between Zorah and Eshtaol."
      ],
      "full_text": "1And the children of Israel didevilagain in the sight of theLord; and theLorddelivered them into thehandof the Philistines forty years. 2Â¶And there was a certain man of Zorah, of the family of the Danites, whose namewasManoah; and his wifewasbarren, and bare not. 3And theangelof theLordappeared unto the woman, and said unto her, Behold now, thouartbarren, and bearest not: but thou shalt conceive, and bear a son. 4Now therefore beware, I pray thee, anddrinknot wine nor strong drink, and eat not anyuncleanthing: 5For, lo, thou shalt conceive, and bear a son; and norazorshall come on his head: for the child shall be a Nazarite unto God from the womb: and he shall begin todeliverIsrael out of the hand of the Philistines. 6Â¶Then the woman came and told her husband, saying, A man of God came unto me, and his countenancewaslike the countenance of anangelof God, very terrible: but I asked him not whence hewas,neither told he me his name: 7But he said unto me, Behold,thou shalt conceive, and bear a son; and now drink no wine nor strong drink, neither eat any uncleanthing:for the child shall be a Nazarite to God from the womb to the day of his death. 8Â¶Then Manoah entreated theLord, and said, O my Lord, let the man of God which thou didst send come again unto us, and teach us what we shall do unto the child that shall be born. 9And God hearkened to the voice of Manoah; and the angel of God came again unto the woman as she sat in the field: but Manoah her husbandwasnot with her. 10And the woman made haste, and ran, and shewed her husband, and said unto him, Behold, the man hath appeared unto me, that came unto me theotherday. 11And Manoah arose, and went after his wife, and came to the man, and said unto him,Artthou the man that spakest unto the woman? And he said, Iam. 12And Manoah said, Now let thy words come to pass. How shall we order the child, andhowshall we do unto him? 13And the angel of theLordsaid unto Manoah, Of all that I said unto the woman let her beware. 14She may not eat of anythingthat cometh of the vine, neither let her drink wine or strong drink, nor eat any uncleanthing:all that I commanded her let her observe. 15Â¶And Manoah said unto the angel of theLord, I pray thee, let us detain thee, until we shall have made ready a kid for thee. 16And the angel of theLordsaid unto Manoah, Though thou detain me, I will not eat of thy bread: and if thou wilt offer a burnt offering, thou must offer it unto theLord. For Manoah knew not that hewasan angel of theLord. 17And Manoah said unto the angel of theLord, Whatisthy name, that when thy sayings come to pass we may do thee honour? 18And the angel of theLordsaid unto him, Why askest thou thus after my name, seeing itissecret? 19So Manoah took a kid with ameatoffering, and offereditupon a rock unto theLord: andthe angeldid wondrously; and Manoah and his wife looked on. 20For it came to pass, when the flame went up toward heaven from off the altar, that the angel of theLordascended in the flame of the altar. And Manoah and his wife looked onit,and fell on their faces to the ground. 21But the angel of theLorddid no more appear to Manoah and to his wife. Then Manoah knew that hewasan angel of theLord. 22And Manoah said unto his wife, We shall surely die, because we haveseenGod. 23But his wife said unto him, If theLordwere pleased to kill us, he would not have received a burnt offering and a meat offering at our hands, neither would he have shewed us all thesethings,nor would as at this time have told ussuch thingsas these. 24Â¶And the woman bare a son, and called his name Samson: and the child grew, and theLordblessed him. 25And the Spirit of theLordbegan to move him at times in the camp of Dan between Zorah and Eshtaol."
    },
    {
      "reference": "Judges 14",
      "title": "Judges 14",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/14?lang=eng",
      "summary": "Samson slays a young lion with his bare handsâHe marries a Philistine wife, propounds a riddle, is deceived by his wife, and slays thirty Philistines.",
      "verses": [
        "1And Samson went down to Timnath, and saw a woman in Timnath of the daughters of the Philistines.",
        "2And he came up, and told his father and his mother, and said, Ihave seen a woman in Timnath of the daughters of the Philistines: now therefore get her for me to wife.",
        "3Then his father and his mother said unto him,Is therenever a woman among the daughters of thy brethren, or among all my people, that thou goest to take awifeof theuncircumcisedPhilistines? And Samson said unto his father, Get her for me; for she pleaseth me well.",
        "4But his father and his mother knew not that itwasof theLord, that he sought an occasion against the Philistines: for at that time the Philistines haddominionover Israel.",
        "5Â¶Then went Samson down, and his father and his mother, to Timnath, and came to the vineyards of Timnath: and, behold, a young lion roared against him.",
        "6And theSpiritof theLordcame mightily upon him, and he rent him as he would have rent a kid, andhe hadnothing in his hand: but he told not his father or his mother what he had done.",
        "7And he went down, and talked with the woman; and she pleased Samson well.",
        "8Â¶And after a time he returned to take her, and he turned aside to see the carcase of the lion: and, behold,there wasa swarm of bees and honey in the carcase of the lion.",
        "9And he took thereof in his hands, and went on eating, and came to his father and mother, and he gave them, and they did eat: but he told not them that he had taken the honey out of the carcase of the lion.",
        "10Â¶So his father went down unto the woman: and Samson made there afeast; for so used the young men to do.",
        "11And it came to pass, when they saw him, that they brought thirty companions to be with him.",
        "12Â¶And Samson said unto them, I will now put forth a riddle unto you: if ye can certainly declare it me within the seven days of the feast, and finditout, then I will give you thirtysheetsand thirty change of garments:",
        "13But if ye cannot declareitme, then shall ye give me thirty sheets and thirty change of garments. And they said unto him, Put forth thy riddle, that we may hear it.",
        "14And he said unto them, Out of the eater came forth meat, and out of the strong came forth sweetness. And they could not in three days expound the riddle.",
        "15And it came to pass on the seventh day, that they said unto Samsonâs wife,Enticethy husband, that he may declare unto us the riddle, lest weburnthee and thy fatherâs house with fire: have ye called us to take that we have?is itnotso?",
        "16And Samsonâs wife wept before him, and said, Thou dost but hate me, and lovest me not: thou hast put forth ariddleunto the children of my people, and hast not tolditme. And he said unto her, Behold, I have not tolditmy father nor my mother, and shall I tellitthee?",
        "17And she wept before him the seven days, while their feast lasted: and it came to pass on the seventh day, that he told her, because shelay sore upon him: and she told the riddle to the children of her people.",
        "18And the men of the city said unto him on the seventh day before the sun went down, Whatissweeter than honey? and whatisstronger than a lion? And he said unto them, If ye had not plowed with my heifer, ye had not found out my riddle.",
        "19Â¶And the Spirit of theLordcame upon him, and he went down to Ashkelon, and slew thirty men of them, and took their spoil, and gave change of garments unto them whichexpounded the riddle. And his anger was kindled, and he went up to his fatherâs house.",
        "20But Samsonâs wife wasgivento his companion, whom he had used as his friend."
      ],
      "full_text": "1And Samson went down to Timnath, and saw a woman in Timnath of the daughters of the Philistines. 2And he came up, and told his father and his mother, and said, Ihave seen a woman in Timnath of the daughters of the Philistines: now therefore get her for me to wife. 3Then his father and his mother said unto him,Is therenever a woman among the daughters of thy brethren, or among all my people, that thou goest to take awifeof theuncircumcisedPhilistines? And Samson said unto his father, Get her for me; for she pleaseth me well. 4But his father and his mother knew not that itwasof theLord, that he sought an occasion against the Philistines: for at that time the Philistines haddominionover Israel. 5Â¶Then went Samson down, and his father and his mother, to Timnath, and came to the vineyards of Timnath: and, behold, a young lion roared against him. 6And theSpiritof theLordcame mightily upon him, and he rent him as he would have rent a kid, andhe hadnothing in his hand: but he told not his father or his mother what he had done. 7And he went down, and talked with the woman; and she pleased Samson well. 8Â¶And after a time he returned to take her, and he turned aside to see the carcase of the lion: and, behold,there wasa swarm of bees and honey in the carcase of the lion. 9And he took thereof in his hands, and went on eating, and came to his father and mother, and he gave them, and they did eat: but he told not them that he had taken the honey out of the carcase of the lion. 10Â¶So his father went down unto the woman: and Samson made there afeast; for so used the young men to do. 11And it came to pass, when they saw him, that they brought thirty companions to be with him. 12Â¶And Samson said unto them, I will now put forth a riddle unto you: if ye can certainly declare it me within the seven days of the feast, and finditout, then I will give you thirtysheetsand thirty change of garments: 13But if ye cannot declareitme, then shall ye give me thirty sheets and thirty change of garments. And they said unto him, Put forth thy riddle, that we may hear it. 14And he said unto them, Out of the eater came forth meat, and out of the strong came forth sweetness. And they could not in three days expound the riddle. 15And it came to pass on the seventh day, that they said unto Samsonâs wife,Enticethy husband, that he may declare unto us the riddle, lest weburnthee and thy fatherâs house with fire: have ye called us to take that we have?is itnotso? 16And Samsonâs wife wept before him, and said, Thou dost but hate me, and lovest me not: thou hast put forth ariddleunto the children of my people, and hast not tolditme. And he said unto her, Behold, I have not tolditmy father nor my mother, and shall I tellitthee? 17And she wept before him the seven days, while their feast lasted: and it came to pass on the seventh day, that he told her, because shelay sore upon him: and she told the riddle to the children of her people. 18And the men of the city said unto him on the seventh day before the sun went down, Whatissweeter than honey? and whatisstronger than a lion? And he said unto them, If ye had not plowed with my heifer, ye had not found out my riddle. 19Â¶And the Spirit of theLordcame upon him, and he went down to Ashkelon, and slew thirty men of them, and took their spoil, and gave change of garments unto them whichexpounded the riddle. And his anger was kindled, and he went up to his fatherâs house. 20But Samsonâs wife wasgivento his companion, whom he had used as his friend."
    },
    {
      "reference": "Judges 15",
      "title": "Judges 15",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/15?lang=eng",
      "summary": "Samson burns the grain of the PhilistinesâThey burn his wife and father-in-lawâSamson slays a thousand Philistines at Lehi with the jawbone of an ass.",
      "verses": [
        "1But it came to pass within a while after, in the time of wheat harvest, that Samson visited his wife with a kid; and he said, I will go in to my wife into the chamber. But her father would not suffer him to go in.",
        "2And her father said, I verily thought that thou hadst utterly hated her; therefore I gave her to thy companion:isnot her younger sister fairer than she? take her, I pray thee, instead of her.",
        "3Â¶And Samson said concerning them, Now shall I be more blameless than the Philistines, though I do them a displeasure.",
        "4And Samson went and caught three hundred foxes, and took firebrands, and turned tail to tail, and put a firebrand in the midst between two tails.",
        "5And when he had set the brands on fire, he letthemgo into the standing corn of the Philistines, andburntup both the shocks, and also the standingcorn, with the vineyardsandolives.",
        "6Â¶Then the Philistines said, Who hath done this? And they answered, Samson, the son in law of the Timnite, because he had taken his wife, and given her to his companion. And the Philistines came up, andburnther andher fatherwith fire.",
        "7Â¶And Samson said unto them,Thoughye have done this, yet will I be avenged of you, and after that I will cease.",
        "8And he smote them hip and thigh with a great slaughter: and he went down and dwelt in the top of the rock Etam.",
        "9Â¶Then the Philistines went up, and pitched in Judah, and spread themselves in Lehi.",
        "10And the men of Judah said, Why are ye come up against us? And they answered, To bind Samson are we come up, to do to him as he hath done to us.",
        "11Then three thousand men of Judah went to the top of the rock Etam, and said to Samson, Knowest thou not that the Philistinesarerulersover us? whatisthisthatthou hast done unto us? And he said unto them, As they did unto me, so have I done unto them.",
        "12And they said unto him, We are come down to bind thee, that we may deliver thee into the hand of the Philistines. And Samson said unto them, Swear unto me, that ye will not fall upon me yourselves.",
        "13And they spake unto him, saying, No; but we will bind thee fast, and deliver thee into their hand: but surely we will not kill thee. And they bound him with two new cords, and brought him up from the rock.",
        "14Â¶Andwhen he came unto Lehi, the Philistines shouted against him: and the Spirit of theLordcame mightily upon him, and the cords thatwereupon his arms became as flax that was burnt with fire, and his bandsloosedfrom off his hands.",
        "15And he found a new jawbone of an ass, and put forth his hand, and took it, and slew a thousand men therewith.",
        "16And Samson said, With the jawbone of an ass, heaps upon heaps, with the jaw of an ass have I slain a thousand men.",
        "17And it came to pass, when he had made an end of speaking, that he cast away the jawbone out of his hand, and called that place Ramath-lehi.",
        "18Â¶And he wassore athirst, and called on theLord, and said, Thou hast given this great deliverance into the hand of thy servant: and now shall I die for thirst, and fall into the hand of the uncircumcised?",
        "19ButGod clave an hollow place thatwasin the jaw, and there came water thereout; and when he had drunk, his spirit came again, and he revived: wherefore he called the name thereofEn-hakkore, whichisin Lehi unto this day.",
        "20And he judged Israel in the days of the Philistines twenty years."
      ],
      "full_text": "1But it came to pass within a while after, in the time of wheat harvest, that Samson visited his wife with a kid; and he said, I will go in to my wife into the chamber. But her father would not suffer him to go in. 2And her father said, I verily thought that thou hadst utterly hated her; therefore I gave her to thy companion:isnot her younger sister fairer than she? take her, I pray thee, instead of her. 3Â¶And Samson said concerning them, Now shall I be more blameless than the Philistines, though I do them a displeasure. 4And Samson went and caught three hundred foxes, and took firebrands, and turned tail to tail, and put a firebrand in the midst between two tails. 5And when he had set the brands on fire, he letthemgo into the standing corn of the Philistines, andburntup both the shocks, and also the standingcorn, with the vineyardsandolives. 6Â¶Then the Philistines said, Who hath done this? And they answered, Samson, the son in law of the Timnite, because he had taken his wife, and given her to his companion. And the Philistines came up, andburnther andher fatherwith fire. 7Â¶And Samson said unto them,Thoughye have done this, yet will I be avenged of you, and after that I will cease. 8And he smote them hip and thigh with a great slaughter: and he went down and dwelt in the top of the rock Etam. 9Â¶Then the Philistines went up, and pitched in Judah, and spread themselves in Lehi. 10And the men of Judah said, Why are ye come up against us? And they answered, To bind Samson are we come up, to do to him as he hath done to us. 11Then three thousand men of Judah went to the top of the rock Etam, and said to Samson, Knowest thou not that the Philistinesarerulersover us? whatisthisthatthou hast done unto us? And he said unto them, As they did unto me, so have I done unto them. 12And they said unto him, We are come down to bind thee, that we may deliver thee into the hand of the Philistines. And Samson said unto them, Swear unto me, that ye will not fall upon me yourselves. 13And they spake unto him, saying, No; but we will bind thee fast, and deliver thee into their hand: but surely we will not kill thee. And they bound him with two new cords, and brought him up from the rock. 14Â¶Andwhen he came unto Lehi, the Philistines shouted against him: and the Spirit of theLordcame mightily upon him, and the cords thatwereupon his arms became as flax that was burnt with fire, and his bandsloosedfrom off his hands. 15And he found a new jawbone of an ass, and put forth his hand, and took it, and slew a thousand men therewith. 16And Samson said, With the jawbone of an ass, heaps upon heaps, with the jaw of an ass have I slain a thousand men. 17And it came to pass, when he had made an end of speaking, that he cast away the jawbone out of his hand, and called that place Ramath-lehi. 18Â¶And he wassore athirst, and called on theLord, and said, Thou hast given this great deliverance into the hand of thy servant: and now shall I die for thirst, and fall into the hand of the uncircumcised? 19ButGod clave an hollow place thatwasin the jaw, and there came water thereout; and when he had drunk, his spirit came again, and he revived: wherefore he called the name thereofEn-hakkore, whichisin Lehi unto this day. 20And he judged Israel in the days of the Philistines twenty years."
    },
    {
      "reference": "Judges 16",
      "title": "Judges 16",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/judg/16?lang=eng",
      "summary": "Samson carries away the doors of the gate of GazaâHe loves Delilah, who delivers him to the PhilistinesâHe destroys a building, killing himself and 3,000 others.",
      "verses": [
        "1Then went Samson to Gaza, and saw there an harlot, and went in unto her.",
        "2And it was toldthe Gazites, saying, Samson is come hither. And theycompassedhimin, and laid wait for him all night in the gate of the city, and were quiet all the night, saying, In the morning, when it is day, we shall kill him.",
        "3And Samson lay till midnight, and arose at midnight, and took the doors of the gate of the city, and the two posts, and went away with them, bar and all, and putthemupon his shoulders, and carried them up to the top of an hill thatisbefore Hebron.",
        "4Â¶And it came to pass afterward, that he loved a woman in the valley of Sorek, whose namewasDelilah.",
        "5And the lords of the Philistines came up unto her, and said unto her,Enticehim, and see wherein his great strengthlieth,and by whatmeanswe may prevail against him, that we may bind him to afflict him: and we will give thee every one of uselevenhundredpiecesof silver.",
        "6Â¶And Delilah said to Samson, Tell me, I pray thee, wherein thy great strengthlieth,and wherewith thou mightest be bound to afflict thee.",
        "7And Samson said unto her, If they bind me with sevengreen withsthat were never dried, then shall I be weak, and be as another man.",
        "8Then the lords of the Philistines brought up to her seven green withs which had not been dried, and she bound him with them.",
        "9Nowthere weremen lying in wait, abiding with her in the chamber. And she said unto him, The Philistinesbeupon thee, Samson. And he brake the withs, as a thread of tow is broken when it toucheth the fire. So his strength was not known.",
        "10And Delilah said unto Samson, Behold, thou hastmockedme, and told me lies: now tell me, I pray thee, wherewith thou mightest be bound.",
        "11And he said unto her, If they bind me fast with new ropes that never were occupied, then shall I be weak, and be as another man.",
        "12Delilah therefore took new ropes, and bound him therewith, and said unto him, The Philistinesbeupon thee, Samson. Andthere wereliersin wait abiding in the chamber. And he brake them from off his arms like a thread.",
        "13And Delilah said unto Samson, Hitherto thou hast mocked me, and told me lies: tell me wherewith thou mightest be bound. And he said unto her, If thou weavest the seven locks of my head with theweb.",
        "14And she fasteneditwith the pin, and said unto him, The Philistinesbeupon thee, Samson. And he awaked out of his sleep, and went away with the pin of the beam, and with the web.",
        "15Â¶And she said unto him, How canst thou say, I love thee, when thine heartisnot with me? thou hastmockedme these three times, and hast not told me wherein thy great strengthlieth.",
        "16And it came to pass, when she pressed himdailywith her words, and urged him,sothat his soul wasvexedunto death;",
        "17That he told her all his heart, and said unto her, There hath not come arazorupon mine head; for Ihave beena Nazarite unto God from my motherâs womb: if I be shaven, then my strength will go from me, and I shall become weak, and be like anyotherman.",
        "18And when Delilah saw that he had told her all his heart, she sent and called for the lords of the Philistines, saying, Come up this once, for he hath shewed me all his heart. Then the lords of the Philistines came up unto her, and broughtmoneyin their hand.",
        "19And she made him sleep upon her knees; and she called for a man, and she caused him to shave off the seven locks of his head; and she began to afflict him, and his strength went from him.",
        "20And she said, The Philistinesbeupon thee, Samson. And he awoke out of his sleep, and said, I will go out as at other times before, and shake myself. And hewistnot that theLordwas departed from him.",
        "21Â¶But the Philistines took him, and put out his eyes, and brought him down to Gaza, and bound him with fetters of brass; and he did grind in the prison house.",
        "22Howbeit the hair of his head began to grow again after he was shaven.",
        "23Then the lords of the Philistines gathered them together for to offer a great sacrifice untoDagontheir god, and to rejoice: for they said, Our god hath delivered Samson our enemy into our hand.",
        "24And when the people saw him, they praised their god: for they said, Our god hath delivered into our hands our enemy, and the destroyer of our country, which slew many of us.",
        "25And it came to pass, when their hearts were merry, that they said, Call for Samson, that he may make us sport. And they called for Samson out of the prison house; and he made them sport: and they set him between the pillars.",
        "26And Samson said unto the lad that held him by the hand, Suffer me that I may feel the pillars whereupon the house standeth, that I may lean upon them.",
        "27Now the house was full of men and women; and all the lords of the Philistineswerethere; andthere wereupon the roof about three thousand men and women, that beheld while Samson made sport.",
        "28And Samson called unto theLord, and said, O LordGod, remember me, I pray thee, and strengthen me, I pray thee, only this once, O God, that I may be at once avenged of the Philistines for my two eyes.",
        "29And Samson took hold of the two middle pillars upon which the house stood, and on which it was borne up, of the one with his right hand, and of the other with his left.",
        "30And Samson said, Let me die with the Philistines. And he bowed himself withall hismight; and the house fell upon the lords, and upon all the people thatweretherein. So the dead which he slew at his death were more thantheywhich he slew in his life.",
        "31Then his brethren and all the house of his father came down, and took him, and broughthimup, and buried him between Zorah and Eshtaol in the buryingplace of Manoah his father. And he judged Israel twenty years."
      ],
      "full_text": "1Then went Samson to Gaza, and saw there an harlot, and went in unto her. 2And it was toldthe Gazites, saying, Samson is come hither. And theycompassedhimin, and laid wait for him all night in the gate of the city, and were quiet all the night, saying, In the morning, when it is day, we shall kill him. 3And Samson lay till midnight, and arose at midnight, and took the doors of the gate of the city, and the two posts, and went away with them, bar and all, and putthemupon his shoulders, and carried them up to the top of an hill thatisbefore Hebron. 4Â¶And it came to pass afterward, that he loved a woman in the valley of Sorek, whose namewasDelilah. 5And the lords of the Philistines came up unto her, and said unto her,Enticehim, and see wherein his great strengthlieth,and by whatmeanswe may prevail against him, that we may bind him to afflict him: and we will give thee every one of uselevenhundredpiecesof silver. 6Â¶And Delilah said to Samson, Tell me, I pray thee, wherein thy great strengthlieth,and wherewith thou mightest be bound to afflict thee. 7And Samson said unto her, If they bind me with sevengreen withsthat were never dried, then shall I be weak, and be as another man. 8Then the lords of the Philistines brought up to her seven green withs which had not been dried, and she bound him with them. 9Nowthere weremen lying in wait, abiding with her in the chamber. And she said unto him, The Philistinesbeupon thee, Samson. And he brake the withs, as a thread of tow is broken when it toucheth the fire. So his strength was not known. 10And Delilah said unto Samson, Behold, thou hastmockedme, and told me lies: now tell me, I pray thee, wherewith thou mightest be bound. 11And he said unto her, If they bind me fast with new ropes that never were occupied, then shall I be weak, and be as another man. 12Delilah therefore took new ropes, and bound him therewith, and said unto him, The Philistinesbeupon thee, Samson. Andthere wereliersin wait abiding in the chamber. And he brake them from off his arms like a thread. 13And Delilah said unto Samson, Hitherto thou hast mocked me, and told me lies: tell me wherewith thou mightest be bound. And he said unto her, If thou weavest the seven locks of my head with theweb. 14And she fasteneditwith the pin, and said unto him, The Philistinesbeupon thee, Samson. And he awaked out of his sleep, and went away with the pin of the beam, and with the web. 15Â¶And she said unto him, How canst thou say, I love thee, when thine heartisnot with me? thou hastmockedme these three times, and hast not told me wherein thy great strengthlieth. 16And it came to pass, when she pressed himdailywith her words, and urged him,sothat his soul wasvexedunto death; 17That he told her all his heart, and said unto her, There hath not come arazorupon mine head; for Ihave beena Nazarite unto God from my motherâs womb: if I be shaven, then my strength will go from me, and I shall become weak, and be like anyotherman. 18And when Delilah saw that he had told her all his heart, she sent and called for the lords of the Philistines, saying, Come up this once, for he hath shewed me all his heart. Then the lords of the Philistines came up unto her, and broughtmoneyin their hand. 19And she made him sleep upon her knees; and she called for a man, and she caused him to shave off the seven locks of his head; and she began to afflict him, and his strength went from him. 20And she said, The Philistinesbeupon thee, Samson. And he awoke out of his sleep, and said, I will go out as at other times before, and shake myself. And hewistnot that theLordwas departed from him. 21Â¶But the Philistines took him, and put out his eyes, and brought him down to Gaza, and bound him with fetters of brass; and he did grind in the prison house. 22Howbeit the hair of his head began to grow again after he was shaven. 23Then the lords of the Philistines gathered them together for to offer a great sacrifice untoDagontheir god, and to rejoice: for they said, Our god hath delivered Samson our enemy into our hand. 24And when the people saw him, they praised their god: for they said, Our god hath delivered into our hands our enemy, and the destroyer of our country, which slew many of us. 25And it came to pass, when their hearts were merry, that they said, Call for Samson, that he may make us sport. And they called for Samson out of the prison house; and he made them sport: and they set him between the pillars. 26And Samson said unto the lad that held him by the hand, Suffer me that I may feel the pillars whereupon the house standeth, that I may lean upon them. 27Now the house was full of men and women; and all the lords of the Philistineswerethere; andthere wereupon the roof about three thousand men and women, that beheld while Samson made sport. 28And Samson called unto theLord, and said, O LordGod, remember me, I pray thee, and strengthen me, I pray thee, only this once, O God, that I may be at once avenged of the Philistines for my two eyes. 29And Samson took hold of the two middle pillars upon which the house stood, and on which it was borne up, of the one with his right hand, and of the other with his left. 30And Samson said, Let me die with the Philistines. And he bowed himself withall hismight; and the house fell upon the lords, and upon all the people thatweretherein. So the dead which he slew at his death were more thantheywhich he slew in his life. 31Then his brethren and all the house of his father came down, and took him, and broughthimup, and buried him between Zorah and Eshtaol in the buryingplace of Manoah his father. And he judged Israel twenty years."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:28:50",
  "metadata": {
    "week_number": 22,
    "title": "Week 22: May 25–31 - Judges 2–4; 6–8; 13–16",
    "date_range": "May 25–31",
    "scraped_at": "2025-12-21T22:29:00.253216",
    "scraper_version": "2.0.0"
  }
}