{
  "week_number": 27,
  "date_range": "June 29–July 5",
  "title": "Week 27: June 29–July 5 - 1 Kings 12–13; 17–22",
  "bundle_title": "Week 27: June 29–July 5: \"Week 27: June 29–July 5 - 1 Kings 12–13; 17–22\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/27?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/27?lang=eng",
    "title": "1 Kings 12–13;17–22",
    "scripture_references": "1 Kings 12–13; 17–22",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“June 29–July 5. ‘If the Lord Be God, Follow Him’: 1 Kings 12–13; 17–22,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“June 29–July 5. ‘If the Lord Be God, Follow Him,’”Come, Follow Me: Old Testament 2026\n\nElijah Contends against the Priests of Baal, by Jerry Harston\n\nThe house of Israel was in disarray. The kingdom had divided, with ten tribes forming the Northern Kingdom of Israel and two tribes forming the Southern Kingdom of Judah. But worse than their separation from each other was both kingdoms’ separation from their covenants. Wicked kings led the people away from the Lord, and many people wavered in their faith.\n\nIn this setting, the Lord called Elijah to be a prophet. His life shows that a person can have great faith in the Lord even in bad circumstances. Sometimes the Lord responds to such faith with impressive, public miracles, like fire falling from heaven. But He also works quiet, private miracles, like feeding a faithful widow and her son. And most often the Lord’s miracles are so individual that they are known only to one person—for example, when the Lord reveals Himself to you through “a still small voice” (1 Kings 19:12).\n\nFor more about Elijah, see “Elijah” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "Christlike leaders serve the people they lead.",
        "content": "How would you describe the mistake King Rehoboam, the son of Solomon, made in1 Kings 12:1–14? What Christlike attributes could have helped Rehoboam save his kingdom? (seeverse 7;Matthew 20:25–28;Mosiah 2:10–21). How can you use these attributes as a leader—whether in a Church calling or as a leader of your own life?\n\n1 Kings 17:8–16;19:19–21"
      },
      {
        "title": "An invitation to sacrifice is an opportunity to exercise my faith in Jesus Christ.",
        "content": "The prophet Elijah asked a widow to give him food and water before feeding herself and her starving son. Why would he do that? Elijah’s request could be seen as a blessing for this small family. They needed the Lord’s blessings, and sacrifice brings blessings—including the blessing of stronger faith.\n\nAs you read1 Kings 17:8–16, imagine you were this widow. What impresses you about her? You could also make a list of choices that require faith in Jesus Christ (for examples, seeFor the Strength of Youth: A Guide to Making Choices[2022]). What do you learn from this widow about exercising faith?\n\nHow are Elisha’s actions in1 Kings 19:19–21similar to the widow’s actions?\n\nThink about sacrifices you’ve made to follow the Savior. What does1 Kings 17:8–16;19:19–21teach you about these sacrifices? How does your knowledge of the Savior help you when He asks you to make sacrifices? How has He blessed you?\n\nSee alsoMatthew 4:18–22;6:25–33;Luke 4:24–26; “Elijah and the Widow of Zarephath” (video), Gospel Library; “When Faith Endures,”Hymns, no. 128.\n\nElijah and the Widow of Zarephath\n\n1 Kings 18"
      },
      {
        "title": "“If the Lord be God, follow him.”",
        "content": "The Israelites might have felt they had good reasons to worship Baal, who was known as the god of storms and rain. After three years of drought, they desperately needed rain. And worshipping Baal was socially accepted and promoted by the king and queen. As you read1 Kings 18, think about why someone in our day might be indecisive about following the Lord. In this chapter, what do you think the Lord was trying to teach about Himself? What experiences have helped you commit to following the Savior?\n\nSee also D. Todd Christofferson, “Choice and Commitment” (worldwide devotional for young adults, Jan. 12, 2020), Gospel Library.\n\nIllustration of Elijah, by Wilson Ong\n\n1 Kings 19:1–18"
      },
      {
        "title": "The Lord often speaks in quiet, simple ways.",
        "content": "Sadly, the miracle on Mount Carmel didn’t make Elijah’s mission any easier. In fact, his life was in danger, and he had to hide in a cave in the wilderness. There, struggling with loneliness and discouragement, he had an experience with the Lord that was very different from the experience on Mount Carmel. What does Elijah’s experience in1 Kings 19:1–18teach you about how the Lord communicates with you in your times of need?\n\nPonder times when you feel the Lord has spoken to you. How would you describe the way He communicates with you? Why are the words “still” and “small” good ways to describe the voice of the Spirit? What other words do you find inHelaman 5:30;Doctrine and Covenants 6:22–23;11:12–14? What do you need to do to receive the Lord’s guidance more often?\n\nSee alsoPsalm 46:10.\n\nUse multiple senses to enhance learning.We all learn about the world through our five senses. Using those senses can also enhance gospel learning. For example, think of images or sounds you could use to illustrate the words “still” and “small” as you learn or teach about the Lord’s voice in1 Kings 19.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "The Lord blesses me as I have faith in Him.",
        "content": "To help your children learn the stories of faith in1 Kings 17, you could show them pictures or objects to illustrate the stories, such as birds, bread, or a boy. As you tell your children these stories, invite them to find the picture or object that goes with each story. “Elijah the Prophet” (inOld Testament Stories, 121–24) can help you tell these stories. What does each story teach us about showing faith in Jesus Christ?\n\nElijah the Prophet\n\nHelp your children think of ways they can show their faith in Jesus Christ. Sing with them a song about faith, such as “I Have Faith in the Lord, Jesus Christ” (Gospel Library), and share with each other what you learn about faith from the song.\n\nIllustration of Elijah and the healing of the widow’s son, by Charles Edmund Brock\n\n1 Kings 17:8–16"
      },
      {
        "title": "When the Lord asks me to sacrifice, I can obey in faith.",
        "content": "Perhaps your children could draw a picture of what the Lord asked the widow to give Elijah (see1 Kings 17:12–13) and what the widow received in return (see1 Kings 17:15–16). (See also this week’s activity page.) They could also look for pictures of other people who gave up something they wanted for something better. Invite your children to find pictures in theGospel Art BookorCome, Follow Me. What does the Lord ask us to sacrifice? How does He bless us?\n\n1 Kings 18:17–39"
      },
      {
        "title": "I can choose to follow Jesus Christ.",
        "content": "As you read1 Kings 18:17–39together, your children could pick a verse and draw a picture of what it describes. They could use their pictures to tell the story in their own words. (See also “Elijah and the Priests of Baal,” inOld Testament Stories, 125–28.)\n\nElijah and the Priests of Baal\n\nHelp your children think of situations when they might need to decide whether or not to follow Jesus Christ. Maybe they could draw pictures of themselves making the right choice. Share with each other why you choose to follow Jesus.\n\n1 Kings 19:9–12"
      },
      {
        "title": "The Lord speaks to me through the still, small voice of the Holy Ghost.",
        "content": "As you summarize1 Kings 19:9–12, invite your children to do actions to represent the strong wind, the earthquake, and the fire. Then invite them to sit still as you say together, in a quiet voice, “after the fire a still small voice” (verse 12). (See also “The Lord Speaks to Elijah,” inOld Testament Stories, 129–31.) Tell your children about times when you have experienced the still, small voice of the Holy Ghost.\n\nThe Lord Speaks to Elijah\n\nQuietly sing a song about the Spirit, such as “The Still Small Voice” (Children’s Songbook, 106–7). What can distract us from recognizing the Spirit? What can help us hear Him?\n\nFor more, see this month’s issue of theFriendmagazine.\n\nWidow of Zarephath, by Rose Datoc Dall"
      }
    ],
    "study_helps": [],
    "raw_text": "June 29–July 5.  “If the Lord Be God, Follow Him”: 1 Kings 12–13; 17–22\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nJune 29–July 5\n1 Kings 12–13; 17–22\nJuly 6–12\n2 Kings 2–7\nThoughts to Keep in Mind\nJesus Will Say to All Israel, “Come Home”\nJuly 13–19\n2 Kings 16–25\nJuly 20–26\n2 Chronicles 14–20; 26; 30\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nJune 29–July 5.  “If the Lord Be God, Follow Him”: 1 Kings 12–13; 17–22\n“June 29–July 5. ‘If the Lord Be God, Follow Him’: 1 Kings 12–13; 17–22,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“June 29–July 5. ‘If the Lord Be God, Follow Him,’”\nCome, Follow Me: Old Testament 2026\nElijah Contends against the Priests of Baal\n, by Jerry Harston\nJune 29–July 5: “If the Lord Be God, Follow Him”\n1 Kings 12–13\n;\n17–22\nThe house of Israel was in disarray. The kingdom had divided, with ten tribes forming the Northern Kingdom of Israel and two tribes forming the Southern Kingdom of Judah. But worse than their separation from each other was both kingdoms’ separation from their covenants. Wicked kings led the people away from the Lord, and many people wavered in their faith.\nIn this setting, the Lord called Elijah to be a prophet. His life shows that a person can have great faith in the Lord even in bad circumstances. Sometimes the Lord responds to such faith with impressive, public miracles, like fire falling from heaven. But He also works quiet, private miracles, like feeding a faithful widow and her son. And most often the Lord’s miracles are so individual that they are known only to one person—for example, when the Lord reveals Himself to you through “a still small voice” (\n1 Kings 19:12\n).\nFor more about Elijah, see “\nElijah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\n1 Kings 12:1–20\nChristlike leaders serve the people they lead.\nHow would you describe the mistake King Rehoboam, the son of Solomon, made in\n1 Kings 12:1–14\n? What Christlike attributes could have helped Rehoboam save his kingdom? (see\nverse 7\n;\nMatthew 20:25–28\n;\nMosiah 2:10–21\n). How can you use these attributes as a leader—whether in a Church calling or as a leader of your own life?\n1 Kings 17:8–16\n;\n19:19–21\nAn invitation to sacrifice is an opportunity to exercise my faith in Jesus Christ.\nThe prophet Elijah asked a widow to give him food and water before feeding herself and her starving son. Why would he do that? Elijah’s request could be seen as a blessing for this small family. They needed the Lord’s blessings, and sacrifice brings blessings—including the blessing of stronger faith.\nAs you read\n1 Kings 17:8–16\n, imagine you were this widow. What impresses you about her? You could also make a list of choices that require faith in Jesus Christ (for examples, see\nFor the Strength of Youth: A Guide to Making Choices\n[2022]). What do you learn from this widow about exercising faith?\nHow are Elisha’s actions in\n1 Kings 19:19–21\nsimilar to the widow’s actions?\nThink about sacrifices you’ve made to follow the Savior. What does\n1 Kings 17:8–16\n;\n19:19–21\nteach you about these sacrifices? How does your knowledge of the Savior help you when He asks you to make sacrifices? How has He blessed you?\nSee also\nMatthew 4:18–22\n;\n6:25–33\n;\nLuke 4:24–26\n; “Elijah and the Widow of Zarephath” (video), Gospel Library; “\nWhen Faith Endures\n,”\nHymns\n, no. 128.\n10:13\nElijah and the Widow of Zarephath\n1 Kings 18\n“If the Lord be God, follow him.”\nThe Israelites might have felt they had good reasons to worship Baal, who was known as the god of storms and rain. After three years of drought, they desperately needed rain. And worshipping Baal was socially accepted and promoted by the king and queen. As you read\n1 Kings 18\n, think about why someone in our day might be indecisive about following the Lord. In this chapter, what do you think the Lord was trying to teach about Himself? What experiences have helped you commit to following the Savior?\nSee also D. Todd Christofferson, “\nChoice and Commitment\n” (worldwide devotional for young adults, Jan. 12, 2020), Gospel Library.\nIllustration of Elijah, by Wilson Ong\n1 Kings 19:1–18\nThe Lord often speaks in quiet, simple ways.\nSadly, the miracle on Mount Carmel didn’t make Elijah’s mission any easier. In fact, his life was in danger, and he had to hide in a cave in the wilderness. There, struggling with loneliness and discouragement, he had an experience with the Lord that was very different from the experience on Mount Carmel. What does Elijah’s experience in\n1 Kings 19:1–18\nteach you about how the Lord communicates with you in your times of need?\nPonder times when you feel the Lord has spoken to you. How would you describe the way He communicates with you? Why are the words “still” and “small” good ways to describe the voice of the Spirit? What other words do you find in\nHelaman 5:30\n;\nDoctrine and Covenants 6:22–23\n;\n11:12–14\n? What do you need to do to receive the Lord’s guidance more often?\nSee also\nPsalm 46:10\n.\nUse multiple senses to enhance learning.\nWe all learn about the world through our five senses. Using those senses can also enhance gospel learning. For example, think of images or sounds you could use to illustrate the words “still” and “small” as you learn or teach about the Lord’s voice in\n1 Kings 19\n.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\n1 Kings 17\nThe Lord blesses me as I have faith in Him.\nTo help your children learn the stories of faith in\n1 Kings 17\n, you could show them pictures or objects to illustrate the stories, such as birds, bread, or a boy. As you tell your children these stories, invite them to find the picture or object that goes with each story. “\nElijah the Prophet\n” (in\nOld Testament Stories\n, 121–24) can help you tell these stories. What does each story teach us about showing faith in Jesus Christ?\n1:58\nElijah the Prophet\nHelp your children think of ways they can show their faith in Jesus Christ. Sing with them a song about faith, such as “I Have Faith in the Lord, Jesus Christ” (Gospel Library), and share with each other what you learn about faith from the song.\nIllustration of Elijah and the healing of the widow’s son, by Charles Edmund Brock\n1 Kings 17:8–16\nWhen the Lord asks me to sacrifice, I can obey in faith.\nPerhaps your children could draw a picture of what the Lord asked the widow to give Elijah (see\n1 Kings 17:12–13\n) and what the widow received in return (see\n1 Kings 17:15–16\n). (See also this week’s activity page.) They could also look for pictures of other people who gave up something they wanted for something better. Invite your children to find pictures in the\nGospel Art Book\nor\nCome, Follow Me\n. What does the Lord ask us to sacrifice? How does He bless us?\n1 Kings 18:17–39\nI can choose to follow Jesus Christ.\nAs you read\n1 Kings 18:17–39\ntogether, your children could pick a verse and draw a picture of what it describes. They could use their pictures to tell the story in their own words. (See also “\nElijah and the Priests of Baal\n,” in\nOld Testament Stories\n, 125–28.)\n2:17\nElijah and the Priests of Baal\nHelp your children think of situations when they might need to decide whether or not to follow Jesus Christ. Maybe they could draw pictures of themselves making the right choice. Share with each other why you choose to follow Jesus.\n1 Kings 19:9–12\nThe Lord speaks to me through the still, small voice of the Holy Ghost.\nAs you summarize\n1 Kings 19:9–12\n, invite your children to do actions to represent the strong wind, the earthquake, and the fire. Then invite them to sit still as you say together, in a quiet voice, “after the fire a still small voice” (\nverse 12\n). (See also “\nThe Lord Speaks to Elijah\n,” in\nOld Testament Stories\n, 129–31.) Tell your children about times when you have experienced the still, small voice of the Holy Ghost.\n1:48\nThe Lord Speaks to Elijah\nQuietly sing a song about the Spirit, such as “\nThe Still Small Voice\n” (\nChildren’s Songbook\n, 106–7). What can distract us from recognizing the Spirit? What can help us hear Him?\nFor more, see this month’s issue of the\nFriend\nmagazine.\nWidow of Zarephath\n, by Rose Datoc Dall\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "1 Kings 12",
      "title": "1 Kings 12",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-kgs/12?lang=eng",
      "summary": "Rehoboam seeks to impose greater burdens upon the peopleâThe ten tribes revolt and turn to JeroboamâJeroboam turns to idolatry and worships false gods.",
      "verses": [
        "1AndRehoboamwent to Shechem: for all Israel were come to Shechem to make him king.",
        "2And it came to pass, when Jeroboam the son of Nebat, who was yet in Egypt, heardof it,(for he was fled from the presence of king Solomon, and Jeroboam dwelt in Egypt;)",
        "3That they sent and called him. And Jeroboam and all the congregation of Israel came, and spake unto Rehoboam, saying,",
        "4Thy father made ouryokegrievous: now therefore make thou thegrievous service of thy father, and his heavy yoke which he put upon us, lighter, and we will serve thee.",
        "5And he said unto them, Depart yetforthree days, then come again to me. And the people departed.",
        "6Â¶And king Rehoboam consulted with theold men, that stood before Solomon his father while he yet lived, and said, How do ye advise that I may answer this people?",
        "7And they spake unto him, saying, If thou wilt be aservantunto this people this day, and wilt serve them, and answer them, and speak good words to them, then they will be thy servants for ever.",
        "8But he forsook the counsel of theoldmen, which they had given him, and consulted with the young men that were grown up with him,andwhich stood before him:",
        "9And he said unto them, What counsel give ye that we may answer this people, who have spoken to me, saying, Make the yoke which thy father did put upon us lighter?",
        "10And the young men that were grown up with him spake unto him, saying, Thus shalt thou speak unto this people that spake unto thee, saying, Thy father made our yoke heavy, but make thouitlighter unto us; thus shalt thou say unto them, My littlefingershall be thicker than my fatherâs loins.",
        "11And now whereas my father did lade you with a heavyyoke, I will add to your yoke: my father hath chastised you with whips, but I will chastise you withscorpions.",
        "12Â¶So Jeroboam and all the people came to Rehoboam the third day, as the king had appointed, saying, Come to me again the third day.",
        "13And the king answered the people roughly, and forsook theold menâscounsel that they gave him;",
        "14And spake to them after the counsel of the young men, saying, My father made your yoke heavy, and I will add to your yoke: my fatheralsochastised you with whips, but I will chastise you with scorpions.",
        "15Wherefore the king hearkened not unto the people; for thecausewas from theLord, that he might perform his saying, which theLordspake byAhijahthe Shilonite unto Jeroboam the son of Nebat.",
        "16Â¶So when all Israel saw that the king hearkened not unto them, the people answered the king, saying, What portion have we in David? neitherhave weinheritance in the son of Jesse: to your tents, O Israel: now see to thine own house, David. So Israeldepartedunto their tents.",
        "17Butas forthe children of Israel which dwelt in the cities ofJudah, Rehoboam reigned over them.",
        "18Then king Rehoboam sentAdoram, whowasover the tribute; and all Israel stoned him with stones, that he died. Therefore king Rehoboam made speed to get him up to his chariot, to flee to Jerusalem.",
        "19SoIsraelrebelledagainst the house of David unto this day.",
        "20And it came to pass, when all Israel heard that Jeroboam was come again, that they sent and called him unto the congregation, and made him king over all Israel: there was none thatfollowedthe house of David, but the tribe ofJudahonly.",
        "21Â¶And whenRehoboamwas come to Jerusalem, he assembled all the house of Judah, with the tribe of Benjamin, an hundred and fourscore thousand chosen men, which were warriors, to fight against the house of Israel, to bring the kingdom again to Rehoboam the son of Solomon.",
        "22But the word of God came untoShemaiahthe man of God, saying,",
        "23Speak unto Rehoboam, the son of Solomon, king of Judah, and unto all the house of Judah and Benjamin, and to the remnant of the people, saying,",
        "24Thus saith theLord, Ye shall not go up, nor fight against yourbrethrenthe children of Israel: return every man to his house; for this thing is from me. They hearkened therefore to the word of theLord, and returned to depart, according to the word of theLord.",
        "25Â¶Then Jeroboam built Shechem in mount Ephraim, and dwelt therein; and went out from thence, and built Penuel.",
        "26And Jeroboam said in his heart, Now shall the kingdom return to the house of David:",
        "27If this peoplegoup to do sacrifice in the house of theLordat Jerusalem, then shall the heart of this people turn again unto their lord,evenunto Rehoboam king of Judah, and they shall kill me, and go again to Rehoboam king of Judah.",
        "28Whereupon the king took counsel, andmadetwocalvesofgold, and said unto them, It is too much for you to go up to Jerusalem: behold thygods, O Israel, which brought thee up out of the land of Egypt.",
        "29And he set the one in Beth-el, and the other put he inDan.",
        "30And this thing became a sin: for the people wentto worshipbefore the one,evenunto Dan.",
        "31And he made anhouseof high places, and madepriestsof the lowest of the people, which were not of the sons of Levi.",
        "32And Jeroboam ordained a feast in the eighth month, on the fifteenth day of the month, like unto thefeastthatisin Judah, and he offered upon the altar. So did he in Beth-el, sacrificing unto the calves that he had made: and he placed in Beth-el thepriestsof the high places which he had made.",
        "33So he offered upon the altar which he had made in Beth-el the fifteenth day of the eighth month,evenin the month which he had devised of his own heart; and ordained a feast unto the children of Israel: and he offered upon the altar, and burnt incense."
      ],
      "full_text": "1AndRehoboamwent to Shechem: for all Israel were come to Shechem to make him king. 2And it came to pass, when Jeroboam the son of Nebat, who was yet in Egypt, heardof it,(for he was fled from the presence of king Solomon, and Jeroboam dwelt in Egypt;) 3That they sent and called him. And Jeroboam and all the congregation of Israel came, and spake unto Rehoboam, saying, 4Thy father made ouryokegrievous: now therefore make thou thegrievous service of thy father, and his heavy yoke which he put upon us, lighter, and we will serve thee. 5And he said unto them, Depart yetforthree days, then come again to me. And the people departed. 6Â¶And king Rehoboam consulted with theold men, that stood before Solomon his father while he yet lived, and said, How do ye advise that I may answer this people? 7And they spake unto him, saying, If thou wilt be aservantunto this people this day, and wilt serve them, and answer them, and speak good words to them, then they will be thy servants for ever. 8But he forsook the counsel of theoldmen, which they had given him, and consulted with the young men that were grown up with him,andwhich stood before him: 9And he said unto them, What counsel give ye that we may answer this people, who have spoken to me, saying, Make the yoke which thy father did put upon us lighter? 10And the young men that were grown up with him spake unto him, saying, Thus shalt thou speak unto this people that spake unto thee, saying, Thy father made our yoke heavy, but make thouitlighter unto us; thus shalt thou say unto them, My littlefingershall be thicker than my fatherâs loins. 11And now whereas my father did lade you with a heavyyoke, I will add to your yoke: my father hath chastised you with whips, but I will chastise you withscorpions. 12Â¶So Jeroboam and all the people came to Rehoboam the third day, as the king had appointed, saying, Come to me again the third day. 13And the king answered the people roughly, and forsook theold menâscounsel that they gave him; 14And spake to them after the counsel of the young men, saying, My father made your yoke heavy, and I will add to your yoke: my fatheralsochastised you with whips, but I will chastise you with scorpions. 15Wherefore the king hearkened not unto the people; for thecausewas from theLord, that he might perform his saying, which theLordspake byAhijahthe Shilonite unto Jeroboam the son of Nebat. 16Â¶So when all Israel saw that the king hearkened not unto them, the people answered the king, saying, What portion have we in David? neitherhave weinheritance in the son of Jesse: to your tents, O Israel: now see to thine own house, David. So Israeldepartedunto their tents. 17Butas forthe children of Israel which dwelt in the cities ofJudah, Rehoboam reigned over them. 18Then king Rehoboam sentAdoram, whowasover the tribute; and all Israel stoned him with stones, that he died. Therefore king Rehoboam made speed to get him up to his chariot, to flee to Jerusalem. 19SoIsraelrebelledagainst the house of David unto this day. 20And it came to pass, when all Israel heard that Jeroboam was come again, that they sent and called him unto the congregation, and made him king over all Israel: there was none thatfollowedthe house of David, but the tribe ofJudahonly. 21Â¶And whenRehoboamwas come to Jerusalem, he assembled all the house of Judah, with the tribe of Benjamin, an hundred and fourscore thousand chosen men, which were warriors, to fight against the house of Israel, to bring the kingdom again to Rehoboam the son of Solomon. 22But the word of God came untoShemaiahthe man of God, saying, 23Speak unto Rehoboam, the son of Solomon, king of Judah, and unto all the house of Judah and Benjamin, and to the remnant of the people, saying, 24Thus saith theLord, Ye shall not go up, nor fight against yourbrethrenthe children of Israel: return every man to his house; for this thing is from me. They hearkened therefore to the word of theLord, and returned to depart, according to the word of theLord. 25Â¶Then Jeroboam built Shechem in mount Ephraim, and dwelt therein; and went out from thence, and built Penuel. 26And Jeroboam said in his heart, Now shall the kingdom return to the house of David: 27If this peoplegoup to do sacrifice in the house of theLordat Jerusalem, then shall the heart of this people turn again unto their lord,evenunto Rehoboam king of Judah, and they shall kill me, and go again to Rehoboam king of Judah. 28Whereupon the king took counsel, andmadetwocalvesofgold, and said unto them, It is too much for you to go up to Jerusalem: behold thygods, O Israel, which brought thee up out of the land of Egypt. 29And he set the one in Beth-el, and the other put he inDan. 30And this thing became a sin: for the people wentto worshipbefore the one,evenunto Dan. 31And he made anhouseof high places, and madepriestsof the lowest of the people, which were not of the sons of Levi. 32And Jeroboam ordained a feast in the eighth month, on the fifteenth day of the month, like unto thefeastthatisin Judah, and he offered upon the altar. So did he in Beth-el, sacrificing unto the calves that he had made: and he placed in Beth-el thepriestsof the high places which he had made. 33So he offered upon the altar which he had made in Beth-el the fifteenth day of the eighth month,evenin the month which he had devised of his own heart; and ordained a feast unto the children of Israel: and he offered upon the altar, and burnt incense."
    },
    {
      "reference": "1 Kings 13",
      "title": "1 Kings 13",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-kgs/13?lang=eng",
      "summary": "Jeroboam is smitten and then healed by a prophet from JudahâThe prophet delivers his message, is led astray by a prophet from Bethel, and is slain by a lion for his disobedienceâJeroboam continues false worship in Israel.",
      "verses": [
        "1And, behold, there came a man of God out of Judah by the word of theLordunto Beth-el: and Jeroboam stood by the altar to burn incense.",
        "2And he cried against the altar in the word of theLord, and said, O altar, altar, thus saith theLord; Behold, a child shall be born unto the house of David, Josiah by name; and upon thee shall he offer the priests of thehigh placesthat burn incense upon thee, and menâs bones shall beburntupon thee.",
        "3And he gave a sign the same day, saying, Thisisthe sign which theLordhath spoken; Behold, the altar shall berent, and the ashes thatareupon it shall be poured out.",
        "4And it came to pass, when king Jeroboam heard the saying of the man of God, which had cried against the altar in Beth-el, that he put forth his hand from the altar, saying, Lay hold on him. And his hand, which he put forth against him,dried up, so that he could not pull it in again to him.",
        "5The altar also was rent, and the ashes poured out from the altar, according to the sign which the man of God had given by the word of theLord.",
        "6And the king answered and said unto the man of God, Entreat now the face of theLordthy God, and pray for me, that my hand may be restored me again. And the man of God besought theLord, and the kingâs hand was restored him again, and became asit wasbefore.",
        "7And the king said unto the man of God, Come home with me, and refresh thyself, and I will give thee a reward.",
        "8And the man of God said unto the king, If thou wilt give me half thine house, I will not go in with thee, neither will I eat bread nor drink water in this place:",
        "9For so was it charged me by the word of theLord, saying, Eat no bread, nor drink water, nor turn again by the same way that thou camest.",
        "10So he went another way, and returned not by the way that he came to Beth-el.",
        "11Â¶Now there dwelt an old prophet in Beth-el; and his sons came and told him all the works that the man of God had done that day in Beth-el: the words which he had spoken unto the king, them they told also to their father.",
        "12And their father said unto them, What way went he? For his sons had seen what way the man of God went, which came from Judah.",
        "13And he said unto his sons, Saddle me the ass. So they saddled him the ass: and he rode thereon,",
        "14And went after the man of God, and found him sitting under an oak: and he said unto him,Artthou the man of God that camest from Judah? And he said, Iam.",
        "15Then he said unto him, Come home with me, and eat bread.",
        "16And he said, I may not return with thee, nor go in with thee: neither will I eat bread nor drink water with thee in this place:",
        "17For it was said to me by the word of theLord, Thou shalt eat no bread nor drink water there, nor turn again to go by the way that thou camest.",
        "18He said unto him, Iama prophet also as thouart;and anangelspake unto me by the word of theLord, saying, Bring him back with thee into thine house, that he may eat bread anddrinkwater.Buthe lied unto him.",
        "19So he went back with him, and did eat bread in his house, and drank water.",
        "20Â¶And it came to pass, as they sat at the table, that the word of theLordcame unto the prophet that brought him back:",
        "21And he cried unto the man of God that came from Judah, saying, Thus saith theLord, Forasmuch as thou hastdisobeyedthe mouth of theLord, and hast not kept the commandment which theLordthy God commanded thee,",
        "22But camest back, and hast eaten bread and drunk water in the place, of the whichtheLorddid say to thee, Eat no bread, and drink no water; thy carcase shall not come unto the sepulchre of thy fathers.",
        "23Â¶And it came to pass, after he had eaten bread, and after he had drunk, that he saddled for him the ass,to wit,for the prophet whom he had brought back.",
        "24And when he was gone, a lion met him by the way, and slew him: and his carcase was cast in the way, and the ass stood by it, the lion also stood by the carcase.",
        "25And, behold, men passed by, and saw the carcase cast in the way, and the lion standing by the carcase: and they came and tolditin the city where the old prophet dwelt.",
        "26And when the prophet that brought him back from the wayheardthereof,he said, Itisthe man of God, who was disobedient unto the word of theLord: therefore theLordhath delivered him unto the lion, which hath torn him, and slain him, according to the word of theLord, which he spake unto him.",
        "27And he spake to his sons, saying, Saddle me the ass. And they saddledhim.",
        "28And he went and found his carcase cast in the way, and the ass and the lion standing by the carcase: the lion had not eaten the carcase, nor torn the ass.",
        "29And the prophet took up the carcase of the man of God, and laid it upon the ass, and brought it back: and the old prophet came to the city, to mourn and to bury him.",
        "30And he laid his carcase in his owngrave; and they mourned over him,saying,Alas, my brother!",
        "31And it came to pass, after he had buried him, that he spake to his sons, saying, When I am dead, then bury me in the sepulchre wherein the man of Godisburied; lay my bones beside his bones:",
        "32For the saying which he cried by the word of theLordagainst the altar in Beth-el, and against all the houses of the high places whicharein the cities of Samaria, shall surely come to pass.",
        "33Â¶After this thing Jeroboam returned not from his evil way, but made again of the lowest of the people priests of the high places: whosoever would, he consecrated him, and he becameoneof the priests of the high places.",
        "34And this thing becamesinunto the house of Jeroboam, even to cutitoff, and to destroyitfrom off the face of the earth."
      ],
      "full_text": "1And, behold, there came a man of God out of Judah by the word of theLordunto Beth-el: and Jeroboam stood by the altar to burn incense. 2And he cried against the altar in the word of theLord, and said, O altar, altar, thus saith theLord; Behold, a child shall be born unto the house of David, Josiah by name; and upon thee shall he offer the priests of thehigh placesthat burn incense upon thee, and menâs bones shall beburntupon thee. 3And he gave a sign the same day, saying, Thisisthe sign which theLordhath spoken; Behold, the altar shall berent, and the ashes thatareupon it shall be poured out. 4And it came to pass, when king Jeroboam heard the saying of the man of God, which had cried against the altar in Beth-el, that he put forth his hand from the altar, saying, Lay hold on him. And his hand, which he put forth against him,dried up, so that he could not pull it in again to him. 5The altar also was rent, and the ashes poured out from the altar, according to the sign which the man of God had given by the word of theLord. 6And the king answered and said unto the man of God, Entreat now the face of theLordthy God, and pray for me, that my hand may be restored me again. And the man of God besought theLord, and the kingâs hand was restored him again, and became asit wasbefore. 7And the king said unto the man of God, Come home with me, and refresh thyself, and I will give thee a reward. 8And the man of God said unto the king, If thou wilt give me half thine house, I will not go in with thee, neither will I eat bread nor drink water in this place: 9For so was it charged me by the word of theLord, saying, Eat no bread, nor drink water, nor turn again by the same way that thou camest. 10So he went another way, and returned not by the way that he came to Beth-el. 11Â¶Now there dwelt an old prophet in Beth-el; and his sons came and told him all the works that the man of God had done that day in Beth-el: the words which he had spoken unto the king, them they told also to their father. 12And their father said unto them, What way went he? For his sons had seen what way the man of God went, which came from Judah. 13And he said unto his sons, Saddle me the ass. So they saddled him the ass: and he rode thereon, 14And went after the man of God, and found him sitting under an oak: and he said unto him,Artthou the man of God that camest from Judah? And he said, Iam. 15Then he said unto him, Come home with me, and eat bread. 16And he said, I may not return with thee, nor go in with thee: neither will I eat bread nor drink water with thee in this place: 17For it was said to me by the word of theLord, Thou shalt eat no bread nor drink water there, nor turn again to go by the way that thou camest. 18He said unto him, Iama prophet also as thouart;and anangelspake unto me by the word of theLord, saying, Bring him back with thee into thine house, that he may eat bread anddrinkwater.Buthe lied unto him. 19So he went back with him, and did eat bread in his house, and drank water. 20Â¶And it came to pass, as they sat at the table, that the word of theLordcame unto the prophet that brought him back: 21And he cried unto the man of God that came from Judah, saying, Thus saith theLord, Forasmuch as thou hastdisobeyedthe mouth of theLord, and hast not kept the commandment which theLordthy God commanded thee, 22But camest back, and hast eaten bread and drunk water in the place, of the whichtheLorddid say to thee, Eat no bread, and drink no water; thy carcase shall not come unto the sepulchre of thy fathers. 23Â¶And it came to pass, after he had eaten bread, and after he had drunk, that he saddled for him the ass,to wit,for the prophet whom he had brought back. 24And when he was gone, a lion met him by the way, and slew him: and his carcase was cast in the way, and the ass stood by it, the lion also stood by the carcase. 25And, behold, men passed by, and saw the carcase cast in the way, and the lion standing by the carcase: and they came and tolditin the city where the old prophet dwelt. 26And when the prophet that brought him back from the wayheardthereof,he said, Itisthe man of God, who was disobedient unto the word of theLord: therefore theLordhath delivered him unto the lion, which hath torn him, and slain him, according to the word of theLord, which he spake unto him. 27And he spake to his sons, saying, Saddle me the ass. And they saddledhim. 28And he went and found his carcase cast in the way, and the ass and the lion standing by the carcase: the lion had not eaten the carcase, nor torn the ass. 29And the prophet took up the carcase of the man of God, and laid it upon the ass, and brought it back: and the old prophet came to the city, to mourn and to bury him. 30And he laid his carcase in his owngrave; and they mourned over him,saying,Alas, my brother! 31And it came to pass, after he had buried him, that he spake to his sons, saying, When I am dead, then bury me in the sepulchre wherein the man of Godisburied; lay my bones beside his bones: 32For the saying which he cried by the word of theLordagainst the altar in Beth-el, and against all the houses of the high places whicharein the cities of Samaria, shall surely come to pass. 33Â¶After this thing Jeroboam returned not from his evil way, but made again of the lowest of the people priests of the high places: whosoever would, he consecrated him, and he becameoneof the priests of the high places. 34And this thing becamesinunto the house of Jeroboam, even to cutitoff, and to destroyitfrom off the face of the earth."
    },
    {
      "reference": "1 Kings 17",
      "title": "1 Kings 17",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-kgs/17?lang=eng",
      "summary": "Elijah seals the heavens and is fed by the ravensâAt his command the barrel of flour and the jar of oil of the widow of Zarephath never become emptyâHe raises her son from death.",
      "verses": [
        "1AndElijahthe Tishbite,who wasofthe inhabitants of Gilead, said unto Ahab,AstheLordGod of Israel liveth, before whom I stand, there shall not be dew norrainthese years, but according to myword.",
        "2And the word of theLordcame unto him, saying,",
        "3Get thee hence, and turn theeeastward, andhidethyself by the brook Cherith, thatisbeforeJordan.",
        "4And it shall be,thatthou shalt drink of the brook; and I have commanded the ravens to feed thee there.",
        "5So he went and did according unto the word of theLord: for he went and dwelt by the brook Cherith, thatisbefore Jordan.",
        "6And the ravens brought him bread and flesh in the morning, and bread and flesh in the evening; and he drank of the brook.",
        "7And it came to pass after a while, that the brook dried up, because there had been no rain in the land.",
        "8Â¶And the word of theLordcame unto him, saying,",
        "9Arise, get thee to Zarephath, whichbelongethto Zidon, and dwell there: behold, I have commanded awidowwoman there to sustain thee.",
        "10So he arose and went to Zarephath. And when he came to the gate of the city, behold, the widow womanwasthere gathering of sticks: and he called to her, and said, Fetch me, I pray thee, a little water in a vessel, that I may drink.",
        "11And as she was going to fetchit,he called to her, and said, Bring me, I pray thee, a morsel ofbreadin thine hand.",
        "12And she said,AstheLordthy God liveth, I have not a cake, but an handful of meal in a barrel, and a little oil in a cruse: and, behold, Iamgathering two sticks, that I may go in and dress it for me and my son, that we may eat it, and die.",
        "13And Elijah said unto her, Fear not; goanddo as thou hast said: but make me thereof a little cake first, and bringitunto me, and after make for thee and for thy son.",
        "14For thus saith theLordGod of Israel, The barrel of meal shall not waste, neither shall the cruse of oil fail, until the daythattheLordsendeth rain upon the earth.",
        "15And shewentand did according to the saying of Elijah: and she, and he, and her house, did eatmanydays.",
        "16Andthe barrel of meal wasted not, neither did the cruse of oil fail, according to the word of theLord, which he spake by Elijah.",
        "17Â¶And it came to pass after these things,thatthe son of the woman, the mistress of the house, fell sick; and hissicknesswas so sore, that there was no breath left in him.",
        "18And she said unto Elijah, What have I to do with thee, O thou man of God? art thou come unto me to call mysinto remembrance, and to slay my son?",
        "19And he said unto her, Give me thy son. And he took him out of her bosom, and carried him up into a loft, where he abode, and laid him upon his own bed.",
        "20And he cried unto theLord, and said, OLordmy God, hast thou also brought evil upon the widow with whom I sojourn, by slaying her son?",
        "21And hestretchedhimself upon the child three times, and cried unto theLord, and said, OLordmy God, I pray thee, let this childâssoulcome into him again.",
        "22And theLordheard the voice of Elijah; and the soul of the child came into him again, and herevived.",
        "23And Elijah took the child, and brought him down out of the chamber into the house, and delivered him unto his mother: and Elijah said, See, thysonliveth.",
        "24Â¶And the woman said to Elijah, Now by this I know that thouarta man of God,andthat the word of theLordin thy mouthistruth."
      ],
      "full_text": "1AndElijahthe Tishbite,who wasofthe inhabitants of Gilead, said unto Ahab,AstheLordGod of Israel liveth, before whom I stand, there shall not be dew norrainthese years, but according to myword. 2And the word of theLordcame unto him, saying, 3Get thee hence, and turn theeeastward, andhidethyself by the brook Cherith, thatisbeforeJordan. 4And it shall be,thatthou shalt drink of the brook; and I have commanded the ravens to feed thee there. 5So he went and did according unto the word of theLord: for he went and dwelt by the brook Cherith, thatisbefore Jordan. 6And the ravens brought him bread and flesh in the morning, and bread and flesh in the evening; and he drank of the brook. 7And it came to pass after a while, that the brook dried up, because there had been no rain in the land. 8Â¶And the word of theLordcame unto him, saying, 9Arise, get thee to Zarephath, whichbelongethto Zidon, and dwell there: behold, I have commanded awidowwoman there to sustain thee. 10So he arose and went to Zarephath. And when he came to the gate of the city, behold, the widow womanwasthere gathering of sticks: and he called to her, and said, Fetch me, I pray thee, a little water in a vessel, that I may drink. 11And as she was going to fetchit,he called to her, and said, Bring me, I pray thee, a morsel ofbreadin thine hand. 12And she said,AstheLordthy God liveth, I have not a cake, but an handful of meal in a barrel, and a little oil in a cruse: and, behold, Iamgathering two sticks, that I may go in and dress it for me and my son, that we may eat it, and die. 13And Elijah said unto her, Fear not; goanddo as thou hast said: but make me thereof a little cake first, and bringitunto me, and after make for thee and for thy son. 14For thus saith theLordGod of Israel, The barrel of meal shall not waste, neither shall the cruse of oil fail, until the daythattheLordsendeth rain upon the earth. 15And shewentand did according to the saying of Elijah: and she, and he, and her house, did eatmanydays. 16Andthe barrel of meal wasted not, neither did the cruse of oil fail, according to the word of theLord, which he spake by Elijah. 17Â¶And it came to pass after these things,thatthe son of the woman, the mistress of the house, fell sick; and hissicknesswas so sore, that there was no breath left in him. 18And she said unto Elijah, What have I to do with thee, O thou man of God? art thou come unto me to call mysinto remembrance, and to slay my son? 19And he said unto her, Give me thy son. And he took him out of her bosom, and carried him up into a loft, where he abode, and laid him upon his own bed. 20And he cried unto theLord, and said, OLordmy God, hast thou also brought evil upon the widow with whom I sojourn, by slaying her son? 21And hestretchedhimself upon the child three times, and cried unto theLord, and said, OLordmy God, I pray thee, let this childâssoulcome into him again. 22And theLordheard the voice of Elijah; and the soul of the child came into him again, and herevived. 23And Elijah took the child, and brought him down out of the chamber into the house, and delivered him unto his mother: and Elijah said, See, thysonliveth. 24Â¶And the woman said to Elijah, Now by this I know that thouarta man of God,andthat the word of theLordin thy mouthistruth."
    },
    {
      "reference": "1 Kings 18",
      "title": "1 Kings 18",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-kgs/18?lang=eng",
      "summary": "Elijah is sent to meet AhabâObadiah saves a hundred prophets and meets ElijahâElijah challenges the prophets of Baal to call down fire from heavenâThey failâHe calls down fire, slays the prophets of Baal, and opens the heavens for rain.",
      "verses": [
        "1And it came to passaftermany days, that the word of theLordcame to Elijah in the third year, saying, Go, shew thyself unto Ahab; and I will send rain upon the earth.",
        "2And Elijah went to shew himself unto Ahab. Andthere wasa sore famine in Samaria.",
        "3And Ahab called Obadiah, whichwasthe governor ofhishouse. (Now ObadiahfearedtheLordgreatly:",
        "4For it wasso,whenJezebelcut offthe prophets of theLord, that Obadiah took an hundred prophets, and hid them by fifty in a cave, and fed them with bread and water.)",
        "5And Ahab said unto Obadiah, Go into the land, unto all fountains of water, and unto all brooks: peradventure we may find grass to save the horses and mules alive, that we lose not all the beasts.",
        "6So they divided the land between them to pass throughout it: Ahab went one way by himself, and Obadiah went another way by himself.",
        "7Â¶And as Obadiah was in the way, behold, Elijah met him: and he knew him, and fell on his face, and said,Artthou that my lord Elijah?",
        "8And he answered him, Iam:go, tell thy lord, Behold, Elijahis here.",
        "9And he said, What have I sinned, that thou wouldest deliver thy servant into the hand of Ahab, to slay me?",
        "10AstheLordthy God liveth, there is no nation or kingdom, whither my lord hath not sent to seek thee: and when they said,He isnotthere;he took an oath of the kingdom and nation, that they found thee not.",
        "11And now thou sayest, Go, tell thy lord, Behold, Elijahis here.",
        "12And it shall come to pass,as soon asI am gone from thee, that the Spirit of theLordshallcarrythee whither I know not; andsowhen I come and tell Ahab, and he cannot find thee, he shall slay me: but I thy servant fear theLordfrom my youth.",
        "13Was it not told my lord what I did when Jezebelslewthe prophets of theLord, how I hid an hundred men of theLordâs prophets by fifty in a cave, and fed them with bread and water?",
        "14And now thou sayest, Go, tell thy lord, Behold, Elijahis here:and he shall slay me.",
        "15And Elijah said,AstheLordof hosts liveth, before whom I stand, I will surely shew myself unto him to day.",
        "16So Obadiah went to meet Ahab, and told him: and Ahab went to meet Elijah.",
        "17Â¶And it came to pass, when Ahab saw Elijah, thatAhabsaid unto him,Artthou he that troubleth Israel?",
        "18And he answered, I have not troubled Israel; but thou, and thy fatherâs house, in that ye haveforsakenthe commandments of theLord, and thou hast followed Baalim.",
        "19Now therefore send,andgather to me all Israel unto mount Carmel, and theprophetsof Baal four hundred and fifty, and the prophets of the groves four hundred, which eat at Jezebelâs table.",
        "20So Ahab sent unto all the children of Israel, and gathered theprophetstogether unto mount Carmel.",
        "21And Elijah came unto all the people, and said, How long halt ye betweentwoopinions? if theLordbeGod,followhim: but if Baal,thenfollow him. And the people answered him not a word.",
        "22Then said Elijah unto the people, I,evenI only, remain a prophet of theLord; but Baalâs prophetsarefour hundred and fifty men.",
        "23Let them therefore give us two bullocks; and let them choose one bullock for themselves, and cut it in pieces, and layiton wood, and put no fireunder:and I will dress the other bullock, and layiton wood, and put no fireunder:",
        "24And call ye on the name of your gods, and I will call on the name of theLord: and the God that answereth by fire, let him be God. And all the people answered and said, It is well spoken.",
        "25And Elijah said unto the prophets of Baal, Choose you one bullock for yourselves, and dressitfirst; for yearemany; and call on the name of yourgods, but put no fireunder.",
        "26And they took the bullock which was given them, and they dressedit,and called on the name of Baal from morning even until noon, saying, O Baal, hear us. Butthere wasno voice, nor any that answered. And they leaped upon the altar which was made.",
        "27And it came to pass at noon, that Elijah mocked them, and said, Cry aloud: for heisa god; either he is talking, or he ispursuing, or he is in a journey,orperadventure he sleepeth, and must be awaked.",
        "28And they cried aloud, andcutthemselves after their manner with knives and lancets, till the blood gushed out upon them.",
        "29And it came to pass, when midday was past, and they prophesied until thetimeof the offering of theeveningsacrifice, thatthere wasneither voice, nor any to answer, nor any that regarded.",
        "30And Elijah said unto all the people, Come near unto me. And all the people came near unto him. And he repaired the altar of theLordthat wasbroken down.",
        "31And Elijah tooktwelvestones, according to the number of the tribes of the sons of Jacob, unto whom the word of theLordcame, saying,Israelshall be thy name:",
        "32And with the stones he built an altar in the name of theLord: and he made a trench about the altar, as great as would contain two measures of seed.",
        "33And he put the wood in order, and cut the bullock in pieces, and laidhimon the wood, and said, Fill fourbarrelswith water, and pouriton the burnt sacrifice, and on the wood.",
        "34And he said, Doitthe second time. And they diditthe second time. And he said, Doitthe third time. And they diditthe third time.",
        "35And the water ran round about the altar; and he filled the trench also with water.",
        "36And it came to pass atthe time ofthe offering of theeveningsacrifice, that Elijah the prophet came near, and said,LordGod of Abraham, Isaac, and of Israel, let it be known this day that thouartGod in Israel, andthatIamthy servant, andthatI have done all these things at thy word.",
        "37Hear me, OLord, hear me, that this people may knowthatthouarttheLordGod, andthatthou hast turned theirheartback again.",
        "38Then thefireof theLordfell, and consumed the burnt sacrifice, and the wood, and the stones, and the dust, and licked up the water thatwasin the trench.",
        "39And when all the people sawit,they fell on their faces: and they said, TheLord, heisthe God; theLord, heisthe God.",
        "40And Elijah said unto them, Take the prophets of Baal; let not one of them escape. And they took them: and Elijah brought them down to the brook Kishon, and slew them there.",
        "41Â¶And Elijah said unto Ahab, Get thee up, eat and drink; forthere isa sound of abundance of rain.",
        "42So Ahab went up to eat and to drink. And Elijah went up to the top of Carmel; and he cast himself down upon the earth, and put his face between his knees,",
        "43And said to his servant, Go up now, look toward the sea. And he went up, and looked, and said,There isnothing. And he said, Go again seven times.",
        "44And it came to pass at the seventh time, that he said, Behold, there ariseth a little cloud out of the sea, like a manâs hand. And he said, Go up, say unto Ahab, Preparethy chariot,and get thee down, that the rain stop thee not.",
        "45And it came to pass in the mean while, that the heaven was black with clouds and wind, and there was a great rain. And Ahab rode, and went to Jezreel.",
        "46And thehandof theLordwas on Elijah; and hegirdedup his loins, and ran before Ahab to the entrance of Jezreel."
      ],
      "full_text": "1And it came to passaftermany days, that the word of theLordcame to Elijah in the third year, saying, Go, shew thyself unto Ahab; and I will send rain upon the earth. 2And Elijah went to shew himself unto Ahab. Andthere wasa sore famine in Samaria. 3And Ahab called Obadiah, whichwasthe governor ofhishouse. (Now ObadiahfearedtheLordgreatly: 4For it wasso,whenJezebelcut offthe prophets of theLord, that Obadiah took an hundred prophets, and hid them by fifty in a cave, and fed them with bread and water.) 5And Ahab said unto Obadiah, Go into the land, unto all fountains of water, and unto all brooks: peradventure we may find grass to save the horses and mules alive, that we lose not all the beasts. 6So they divided the land between them to pass throughout it: Ahab went one way by himself, and Obadiah went another way by himself. 7Â¶And as Obadiah was in the way, behold, Elijah met him: and he knew him, and fell on his face, and said,Artthou that my lord Elijah? 8And he answered him, Iam:go, tell thy lord, Behold, Elijahis here. 9And he said, What have I sinned, that thou wouldest deliver thy servant into the hand of Ahab, to slay me? 10AstheLordthy God liveth, there is no nation or kingdom, whither my lord hath not sent to seek thee: and when they said,He isnotthere;he took an oath of the kingdom and nation, that they found thee not. 11And now thou sayest, Go, tell thy lord, Behold, Elijahis here. 12And it shall come to pass,as soon asI am gone from thee, that the Spirit of theLordshallcarrythee whither I know not; andsowhen I come and tell Ahab, and he cannot find thee, he shall slay me: but I thy servant fear theLordfrom my youth. 13Was it not told my lord what I did when Jezebelslewthe prophets of theLord, how I hid an hundred men of theLordâs prophets by fifty in a cave, and fed them with bread and water? 14And now thou sayest, Go, tell thy lord, Behold, Elijahis here:and he shall slay me. 15And Elijah said,AstheLordof hosts liveth, before whom I stand, I will surely shew myself unto him to day. 16So Obadiah went to meet Ahab, and told him: and Ahab went to meet Elijah. 17Â¶And it came to pass, when Ahab saw Elijah, thatAhabsaid unto him,Artthou he that troubleth Israel? 18And he answered, I have not troubled Israel; but thou, and thy fatherâs house, in that ye haveforsakenthe commandments of theLord, and thou hast followed Baalim. 19Now therefore send,andgather to me all Israel unto mount Carmel, and theprophetsof Baal four hundred and fifty, and the prophets of the groves four hundred, which eat at Jezebelâs table. 20So Ahab sent unto all the children of Israel, and gathered theprophetstogether unto mount Carmel. 21And Elijah came unto all the people, and said, How long halt ye betweentwoopinions? if theLordbeGod,followhim: but if Baal,thenfollow him. And the people answered him not a word. 22Then said Elijah unto the people, I,evenI only, remain a prophet of theLord; but Baalâs prophetsarefour hundred and fifty men. 23Let them therefore give us two bullocks; and let them choose one bullock for themselves, and cut it in pieces, and layiton wood, and put no fireunder:and I will dress the other bullock, and layiton wood, and put no fireunder: 24And call ye on the name of your gods, and I will call on the name of theLord: and the God that answereth by fire, let him be God. And all the people answered and said, It is well spoken. 25And Elijah said unto the prophets of Baal, Choose you one bullock for yourselves, and dressitfirst; for yearemany; and call on the name of yourgods, but put no fireunder. 26And they took the bullock which was given them, and they dressedit,and called on the name of Baal from morning even until noon, saying, O Baal, hear us. Butthere wasno voice, nor any that answered. And they leaped upon the altar which was made. 27And it came to pass at noon, that Elijah mocked them, and said, Cry aloud: for heisa god; either he is talking, or he ispursuing, or he is in a journey,orperadventure he sleepeth, and must be awaked. 28And they cried aloud, andcutthemselves after their manner with knives and lancets, till the blood gushed out upon them. 29And it came to pass, when midday was past, and they prophesied until thetimeof the offering of theeveningsacrifice, thatthere wasneither voice, nor any to answer, nor any that regarded. 30And Elijah said unto all the people, Come near unto me. And all the people came near unto him. And he repaired the altar of theLordthat wasbroken down. 31And Elijah tooktwelvestones, according to the number of the tribes of the sons of Jacob, unto whom the word of theLordcame, saying,Israelshall be thy name: 32And with the stones he built an altar in the name of theLord: and he made a trench about the altar, as great as would contain two measures of seed. 33And he put the wood in order, and cut the bullock in pieces, and laidhimon the wood, and said, Fill fourbarrelswith water, and pouriton the burnt sacrifice, and on the wood. 34And he said, Doitthe second time. And they diditthe second time. And he said, Doitthe third time. And they diditthe third time. 35And the water ran round about the altar; and he filled the trench also with water. 36And it came to pass atthe time ofthe offering of theeveningsacrifice, that Elijah the prophet came near, and said,LordGod of Abraham, Isaac, and of Israel, let it be known this day that thouartGod in Israel, andthatIamthy servant, andthatI have done all these things at thy word. 37Hear me, OLord, hear me, that this people may knowthatthouarttheLordGod, andthatthou hast turned theirheartback again. 38Then thefireof theLordfell, and consumed the burnt sacrifice, and the wood, and the stones, and the dust, and licked up the water thatwasin the trench. 39And when all the people sawit,they fell on their faces: and they said, TheLord, heisthe God; theLord, heisthe God. 40And Elijah said unto them, Take the prophets of Baal; let not one of them escape. And they took them: and Elijah brought them down to the brook Kishon, and slew them there. 41Â¶And Elijah said unto Ahab, Get thee up, eat and drink; forthere isa sound of abundance of rain. 42So Ahab went up to eat and to drink. And Elijah went up to the top of Carmel; and he cast himself down upon the earth, and put his face between his knees, 43And said to his servant, Go up now, look toward the sea. And he went up, and looked, and said,There isnothing. And he said, Go again seven times. 44And it came to pass at the seventh time, that he said, Behold, there ariseth a little cloud out of the sea, like a manâs hand. And he said, Go up, say unto Ahab, Preparethy chariot,and get thee down, that the rain stop thee not. 45And it came to pass in the mean while, that the heaven was black with clouds and wind, and there was a great rain. And Ahab rode, and went to Jezreel. 46And thehandof theLordwas on Elijah; and hegirdedup his loins, and ran before Ahab to the entrance of Jezreel."
    },
    {
      "reference": "1 Kings 19",
      "title": "1 Kings 19",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-kgs/19?lang=eng",
      "summary": "Jezebel seeks the life of ElijahâAn angel sends him to HorebâThe Lord speaks to Elijah, not in the wind nor the earthquake nor the fire, but in a still, small voiceâElisha joins Elijah.",
      "verses": [
        "1And Ahab told Jezebel all that Elijah had done, and withal how he had slain all the prophets with the sword.",
        "2Then Jezebel sent a messenger unto Elijah, saying, So let thegodsdoto me,and more also, if I make not thy life as the life of one of them by to morrow about this time.",
        "3And when he sawthat,he arose, and went for his life, and came to Beer-sheba, whichbelongethto Judah, and left his servant there.",
        "4Â¶But he himself went a dayâs journey into the wilderness, and came and sat down under ajuniper tree: and he requested for himself that he might die; and said, It is enough; now, OLord, take away my life; for Iamnot better than my fathers.",
        "5And as he lay and slept under a juniper tree, behold, then anangeltouched him, and said unto him, Ariseandeat.",
        "6And he looked, and, behold,there wasa cake baken on the coals, and a cruse of water at his head. And he did eat and drink, and laid him down again.",
        "7And the angel of theLordcame again the second time, and touched him, and said, Ariseandeat; because the journeyistoo great for thee.",
        "8And he arose, and did eat and drink, and went in the strength of thatmeatfortydays and forty nights untoHorebthemount of God.",
        "9Â¶And he came thither unto a cave, and lodged there; and, behold, the word of theLordcameto him, and he said unto him, What doest thou here, Elijah?",
        "10And he said, I have been very jealous for theLordGod of hosts: for the children of Israel have forsaken thy covenant, thrown down thine altars, and slain thy prophets with the sword; and I,evenI only, am left; and theyseekmy life, to take it away.",
        "11And he said, Go forth, and stand upon the mount before theLord. And, behold, theLordpassed by, and a great and strong wind rentthe mountains, and brake in pieces the rocks before theLord;buttheLordwasnot in the wind: and after the wind an earthquake;buttheLordwasnot in the earthquake:",
        "12And after the earthquake a fire;buttheLordwasnot in the fire: and after the fire astillsmallvoice.",
        "13And it wasso,when Elijah heardit,that he wrapped his face in his mantle, and went out, and stood in the entering in of the cave. And, behold,there camea voice unto him, and said, What doest thou here, Elijah?",
        "14And he said, I have been veryjealousfor theLordGod of hosts: because the children of Israel have forsaken thy covenant, thrown down thine altars, and slain thy prophets with the sword; and I,evenI only, amleft; and they seek my life, to take it away.",
        "15And theLordsaid unto him, Go, return on thy way to the wilderness of Damascus: and when thou comest, anoint Hazaelto bekingover Syria:",
        "16And Jehu the son of Nimshi shalt thouanointto beking over Israel: andElishathe son of Shaphat of Abel-meholah shalt thouanointto beprophet in thy room.",
        "17And it shall come to pass,thathim that escapeth the sword of Hazael shall Jehu slay: and him that escapeth from the sword of Jehu shall Elisha slay.",
        "18Yet I have leftmeseven thousand in Israel, all the knees which have not bowed unto Baal, and every mouth which hath not kissed him.",
        "19Â¶So he departed thence, and found Elisha the son of Shaphat, whowasplowingwithtwelve yokeof oxenbefore him, and he with the twelfth: and Elijah passed by him, and cast hismantleupon him.",
        "20And he left the oxen, and ran after Elijah, and said, Let me, I pray thee, kiss my father and my mother, andthenI willfollowthee. And he said unto him, Go back again: for what have I done to thee?",
        "21And he returned back from him, and took a yoke of oxen, and slew them, and boiled their flesh with the instruments of the oxen, and gave unto the people, and they did eat. Then he arose, and went after Elijah, and ministered unto him."
      ],
      "full_text": "1And Ahab told Jezebel all that Elijah had done, and withal how he had slain all the prophets with the sword. 2Then Jezebel sent a messenger unto Elijah, saying, So let thegodsdoto me,and more also, if I make not thy life as the life of one of them by to morrow about this time. 3And when he sawthat,he arose, and went for his life, and came to Beer-sheba, whichbelongethto Judah, and left his servant there. 4Â¶But he himself went a dayâs journey into the wilderness, and came and sat down under ajuniper tree: and he requested for himself that he might die; and said, It is enough; now, OLord, take away my life; for Iamnot better than my fathers. 5And as he lay and slept under a juniper tree, behold, then anangeltouched him, and said unto him, Ariseandeat. 6And he looked, and, behold,there wasa cake baken on the coals, and a cruse of water at his head. And he did eat and drink, and laid him down again. 7And the angel of theLordcame again the second time, and touched him, and said, Ariseandeat; because the journeyistoo great for thee. 8And he arose, and did eat and drink, and went in the strength of thatmeatfortydays and forty nights untoHorebthemount of God. 9Â¶And he came thither unto a cave, and lodged there; and, behold, the word of theLordcameto him, and he said unto him, What doest thou here, Elijah? 10And he said, I have been very jealous for theLordGod of hosts: for the children of Israel have forsaken thy covenant, thrown down thine altars, and slain thy prophets with the sword; and I,evenI only, am left; and theyseekmy life, to take it away. 11And he said, Go forth, and stand upon the mount before theLord. And, behold, theLordpassed by, and a great and strong wind rentthe mountains, and brake in pieces the rocks before theLord;buttheLordwasnot in the wind: and after the wind an earthquake;buttheLordwasnot in the earthquake: 12And after the earthquake a fire;buttheLordwasnot in the fire: and after the fire astillsmallvoice. 13And it wasso,when Elijah heardit,that he wrapped his face in his mantle, and went out, and stood in the entering in of the cave. And, behold,there camea voice unto him, and said, What doest thou here, Elijah? 14And he said, I have been veryjealousfor theLordGod of hosts: because the children of Israel have forsaken thy covenant, thrown down thine altars, and slain thy prophets with the sword; and I,evenI only, amleft; and they seek my life, to take it away. 15And theLordsaid unto him, Go, return on thy way to the wilderness of Damascus: and when thou comest, anoint Hazaelto bekingover Syria: 16And Jehu the son of Nimshi shalt thouanointto beking over Israel: andElishathe son of Shaphat of Abel-meholah shalt thouanointto beprophet in thy room. 17And it shall come to pass,thathim that escapeth the sword of Hazael shall Jehu slay: and him that escapeth from the sword of Jehu shall Elisha slay. 18Yet I have leftmeseven thousand in Israel, all the knees which have not bowed unto Baal, and every mouth which hath not kissed him. 19Â¶So he departed thence, and found Elisha the son of Shaphat, whowasplowingwithtwelve yokeof oxenbefore him, and he with the twelfth: and Elijah passed by him, and cast hismantleupon him. 20And he left the oxen, and ran after Elijah, and said, Let me, I pray thee, kiss my father and my mother, andthenI willfollowthee. And he said unto him, Go back again: for what have I done to thee? 21And he returned back from him, and took a yoke of oxen, and slew them, and boiled their flesh with the instruments of the oxen, and gave unto the people, and they did eat. Then he arose, and went after Elijah, and ministered unto him."
    },
    {
      "reference": "1 Kings 20",
      "title": "1 Kings 20",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-kgs/20?lang=eng",
      "summary": "Benhadad of Syria makes war with IsraelâThe Syrians are defeated twiceâAhab lets Benhadad go free, contrary to the will of the Lord.",
      "verses": [
        "1And Ben-hadad the king of Syria gathered all his host together: andthere werethirty and two kings with him, and horses, and chariots: and he went up and besieged Samaria, and warred against it.",
        "2And he sent messengers to Ahab king of Israel into the city, and said unto him, Thus saithBen-hadad,",
        "3Thysilverand thy goldismine; thy wives also and thy children,eventhe goodliest,aremine.",
        "4And the king of Israel answered and said, My lord, O king, according to thy saying, Iamthine, and all that I have.",
        "5And the messengers came again, and said, Thus speaketh Ben-hadad, saying, Although I have sent unto thee, saying, Thou shalt deliver me thy silver, and thy gold, and thy wives, and thy children;",
        "6Yet I will send my servants unto thee to morrow about this time, and they shall search thine house, and the houses of thy servants; and it shall be,thatwhatsoever is pleasant inthineeyes, they shall putitin their hand, and takeitaway.",
        "7Then the king of Israel called all the elders of the land, and said, Mark, I pray you, and see how thismanseekethmischief: for he sent unto me for my wives, and for my children, and for my silver, and for my gold; and I denied him not.",
        "8And all the elders and all the people said unto him, Hearken notunto him,nor consent.",
        "9Wherefore he said unto the messengers of Ben-hadad, Tell my lord the king, All that thou didst send for to thy servant at the first I will do: but this thing I may not do. And the messengers departed, and brought him word again.",
        "10And Ben-hadad sent unto him, and said, Thegodsdo so unto me, and more also, if the dust of Samaria shall suffice for handfuls for all the people that follow me.",
        "11And the king of Israel answered and said, Tellhim,Let not him that girdeth onhisharnessboasthimself as he that putteth it off.",
        "12And it came to pass, whenBen-hadadheard this message, as hewasdrinking, he and the kings in thepavilions, that he said unto his servants, Setyourselves in array.And they setthemselves in arrayagainst the city.",
        "13Â¶And, behold, there came a prophet unto Ahab king of Israel, saying, Thus saith theLord, Hast thou seen all this great multitude? behold, I will deliver it into thine hand this day; and thou shalt know that IamtheLord.",
        "14And Ahab said, By whom? And he said, Thus saith theLord,Evenby theyoungmen of the princes of theprovinces. Then he said, Who shall order the battle? And he answered, Thou.",
        "15Then henumberedthe young men of the princes of the provinces, and they were two hundred and thirty two: and after them he numbered all the people,evenall the children of Israel,beingseven thousand.",
        "16And they went out at noon. But Ben-hadadwasdrinking himself drunk in thepavilions, he and the kings, the thirty and two kings that helped him.",
        "17And the young men of the princes of the provinces went out first; and Ben-hadad sent out, and they told him, saying, There are men come out of Samaria.",
        "18And he said, Whether they be come out for peace, take them alive; or whether they be come out for war, take them alive.",
        "19So these young men of the princes of the provinces came out of the city, and the army which followed them.",
        "20And they slew every one his man: and the Syrians fled; and Israel pursued them: and Ben-hadad the king of Syria escaped on an horse with the horsemen.",
        "21And the king of Israel went out, and smote the horses and chariots, and slew the Syrians with a great slaughter.",
        "22Â¶And the prophet came to the king of Israel, and said unto him, Go, strengthen thyself, and mark, and see whatthou doest: for at the return of the year the king of Syria will come up against thee.",
        "23And the servants of the king of Syria said unto him, Their godsaregods of the hills; therefore they were stronger than we; but let us fight against them in the plain, and surely we shall be stronger than they.",
        "24And do this thing, Take the kings away, every man out of his place, and put captains in their rooms:",
        "25And number thee an army, like the army that thou hast lost, horse for horse, and chariot for chariot: and we will fight against them in theplain,andsurely we shall be stronger than they. And he hearkened unto their voice, and did so.",
        "26And it came to pass at the return of the year, that Ben-hadad numbered the Syrians, and went up to Aphek, to fight against Israel.",
        "27And the children of Israel were numbered, andwere all present, and went against them: and the children of Israel pitched before them like two little flocks of kids; but the Syrians filled the country.",
        "28Â¶And there came a man of God, and spake unto the king of Israel, and said, Thus saith theLord, Because the Syrians have said, TheLordisGod of the hills, but heisnot God of the valleys, therefore will I deliver all this great multitude into thine hand, and ye shall know that IamtheLord.",
        "29And they pitched one over against the other seven days. Andsoit was, that in the seventh day the battle was joined: and the children of Israel slew of the Syrians an hundred thousand footmen in one day.",
        "30But the rest fled to Aphek, into the city; andtherea wall fell upon twenty and seven thousand of the menthat wereleft. And Ben-hadad fled, and came into the city, into an inner chamber.",
        "31Â¶And his servants said unto him, Behold now, we have heard that the kings of the house of Israelaremerciful kings: let us, I pray thee, put sackcloth on our loins, and ropes upon our heads, and go out to the king of Israel: peradventure he will save thy life.",
        "32So they girded sackcloth on their loins, andputropes on their heads, and came to the king of Israel, and said, Thy servant Ben-hadad saith, I pray thee, let me live. And he said,Ishe yet alive? heismy brother.",
        "33Now the men did diligently observe whetherany thing would comefrom him, and did hastily catchit:and they said, Thy brother Ben-hadad. Then he said, Go ye, bring him. Then Ben-hadad came forth to him; and he caused him to come up into the chariot.",
        "34AndBen-hadadsaid unto him, The cities, which my father took from thy father, I will restore; and thou shalt makestreetsfor thee in Damascus, as my father made in Samaria. Thensaid Ahab,I will send thee away with this covenant. So he made a covenant with him, and sent him away.",
        "35Â¶And a certain man of thesonsof the prophets said unto his neighbour in the word of theLord, Smite me, I pray thee. And the man refused to smite him.",
        "36Then said he unto him, Because thou hast not obeyed the voice of theLord, behold, as soon as thou art departed from me, a lion shall slay thee. And as soon as he was departed from him, a lion found him, and slew him.",
        "37Then he found another man, and said, Smite me, I pray thee. And the man smote him, so that in smiting he woundedhim.",
        "38So the prophet departed, and waited for the king by the way, and disguised himself withashes upon his face.",
        "39And as the king passed by, he cried unto the king: and he said, Thy servant went out into the midst of the battle; and, behold, a man turned aside, and brought a man unto me, and said, Keep this man: if by any means he be missing, then shall thy life be for his life, or else thou shalt pay a talent of silver.",
        "40And as thy servant was busy here and there, he was gone. And the king of Israel said unto him, Soshallthy judgmentbe;thyself hast decidedit.",
        "41And he hasted, and took the ashes away from his face; and the king of Israel discerned him that hewasof the prophets.",
        "42And he said unto him, Thus saith theLord, Because thou hast let go out ofthyhand a man whom I appointed to utter destruction, therefore thylifeshall go for his life, and thy people for his people.",
        "43And the king of Israel went to his house heavy and displeased, and came to Samaria."
      ],
      "full_text": "1And Ben-hadad the king of Syria gathered all his host together: andthere werethirty and two kings with him, and horses, and chariots: and he went up and besieged Samaria, and warred against it. 2And he sent messengers to Ahab king of Israel into the city, and said unto him, Thus saithBen-hadad, 3Thysilverand thy goldismine; thy wives also and thy children,eventhe goodliest,aremine. 4And the king of Israel answered and said, My lord, O king, according to thy saying, Iamthine, and all that I have. 5And the messengers came again, and said, Thus speaketh Ben-hadad, saying, Although I have sent unto thee, saying, Thou shalt deliver me thy silver, and thy gold, and thy wives, and thy children; 6Yet I will send my servants unto thee to morrow about this time, and they shall search thine house, and the houses of thy servants; and it shall be,thatwhatsoever is pleasant inthineeyes, they shall putitin their hand, and takeitaway. 7Then the king of Israel called all the elders of the land, and said, Mark, I pray you, and see how thismanseekethmischief: for he sent unto me for my wives, and for my children, and for my silver, and for my gold; and I denied him not. 8And all the elders and all the people said unto him, Hearken notunto him,nor consent. 9Wherefore he said unto the messengers of Ben-hadad, Tell my lord the king, All that thou didst send for to thy servant at the first I will do: but this thing I may not do. And the messengers departed, and brought him word again. 10And Ben-hadad sent unto him, and said, Thegodsdo so unto me, and more also, if the dust of Samaria shall suffice for handfuls for all the people that follow me. 11And the king of Israel answered and said, Tellhim,Let not him that girdeth onhisharnessboasthimself as he that putteth it off. 12And it came to pass, whenBen-hadadheard this message, as hewasdrinking, he and the kings in thepavilions, that he said unto his servants, Setyourselves in array.And they setthemselves in arrayagainst the city. 13Â¶And, behold, there came a prophet unto Ahab king of Israel, saying, Thus saith theLord, Hast thou seen all this great multitude? behold, I will deliver it into thine hand this day; and thou shalt know that IamtheLord. 14And Ahab said, By whom? And he said, Thus saith theLord,Evenby theyoungmen of the princes of theprovinces. Then he said, Who shall order the battle? And he answered, Thou. 15Then henumberedthe young men of the princes of the provinces, and they were two hundred and thirty two: and after them he numbered all the people,evenall the children of Israel,beingseven thousand. 16And they went out at noon. But Ben-hadadwasdrinking himself drunk in thepavilions, he and the kings, the thirty and two kings that helped him. 17And the young men of the princes of the provinces went out first; and Ben-hadad sent out, and they told him, saying, There are men come out of Samaria. 18And he said, Whether they be come out for peace, take them alive; or whether they be come out for war, take them alive. 19So these young men of the princes of the provinces came out of the city, and the army which followed them. 20And they slew every one his man: and the Syrians fled; and Israel pursued them: and Ben-hadad the king of Syria escaped on an horse with the horsemen. 21And the king of Israel went out, and smote the horses and chariots, and slew the Syrians with a great slaughter. 22Â¶And the prophet came to the king of Israel, and said unto him, Go, strengthen thyself, and mark, and see whatthou doest: for at the return of the year the king of Syria will come up against thee. 23And the servants of the king of Syria said unto him, Their godsaregods of the hills; therefore they were stronger than we; but let us fight against them in the plain, and surely we shall be stronger than they. 24And do this thing, Take the kings away, every man out of his place, and put captains in their rooms: 25And number thee an army, like the army that thou hast lost, horse for horse, and chariot for chariot: and we will fight against them in theplain,andsurely we shall be stronger than they. And he hearkened unto their voice, and did so. 26And it came to pass at the return of the year, that Ben-hadad numbered the Syrians, and went up to Aphek, to fight against Israel. 27And the children of Israel were numbered, andwere all present, and went against them: and the children of Israel pitched before them like two little flocks of kids; but the Syrians filled the country. 28Â¶And there came a man of God, and spake unto the king of Israel, and said, Thus saith theLord, Because the Syrians have said, TheLordisGod of the hills, but heisnot God of the valleys, therefore will I deliver all this great multitude into thine hand, and ye shall know that IamtheLord. 29And they pitched one over against the other seven days. Andsoit was, that in the seventh day the battle was joined: and the children of Israel slew of the Syrians an hundred thousand footmen in one day. 30But the rest fled to Aphek, into the city; andtherea wall fell upon twenty and seven thousand of the menthat wereleft. And Ben-hadad fled, and came into the city, into an inner chamber. 31Â¶And his servants said unto him, Behold now, we have heard that the kings of the house of Israelaremerciful kings: let us, I pray thee, put sackcloth on our loins, and ropes upon our heads, and go out to the king of Israel: peradventure he will save thy life. 32So they girded sackcloth on their loins, andputropes on their heads, and came to the king of Israel, and said, Thy servant Ben-hadad saith, I pray thee, let me live. And he said,Ishe yet alive? heismy brother. 33Now the men did diligently observe whetherany thing would comefrom him, and did hastily catchit:and they said, Thy brother Ben-hadad. Then he said, Go ye, bring him. Then Ben-hadad came forth to him; and he caused him to come up into the chariot. 34AndBen-hadadsaid unto him, The cities, which my father took from thy father, I will restore; and thou shalt makestreetsfor thee in Damascus, as my father made in Samaria. Thensaid Ahab,I will send thee away with this covenant. So he made a covenant with him, and sent him away. 35Â¶And a certain man of thesonsof the prophets said unto his neighbour in the word of theLord, Smite me, I pray thee. And the man refused to smite him. 36Then said he unto him, Because thou hast not obeyed the voice of theLord, behold, as soon as thou art departed from me, a lion shall slay thee. And as soon as he was departed from him, a lion found him, and slew him. 37Then he found another man, and said, Smite me, I pray thee. And the man smote him, so that in smiting he woundedhim. 38So the prophet departed, and waited for the king by the way, and disguised himself withashes upon his face. 39And as the king passed by, he cried unto the king: and he said, Thy servant went out into the midst of the battle; and, behold, a man turned aside, and brought a man unto me, and said, Keep this man: if by any means he be missing, then shall thy life be for his life, or else thou shalt pay a talent of silver. 40And as thy servant was busy here and there, he was gone. And the king of Israel said unto him, Soshallthy judgmentbe;thyself hast decidedit. 41And he hasted, and took the ashes away from his face; and the king of Israel discerned him that hewasof the prophets. 42And he said unto him, Thus saith theLord, Because thou hast let go out ofthyhand a man whom I appointed to utter destruction, therefore thylifeshall go for his life, and thy people for his people. 43And the king of Israel went to his house heavy and displeased, and came to Samaria."
    },
    {
      "reference": "1 Kings 21",
      "title": "1 Kings 21",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-kgs/21?lang=eng",
      "summary": "Ahab desires the vineyard of NabothâJezebel arranges for false witnesses, and Naboth is stoned for blasphemyâElijah prophesies that Ahab and Jezebel and their house will be destroyed.",
      "verses": [
        "1And it came to pass after these things,thatNaboth the Jezreelite had a vineyard, whichwasin Jezreel, hard by the palace of Ahab king of Samaria.",
        "2And Ahab spake unto Naboth, saying, Give me thy vineyard, that I may have it for a garden of herbs, because itisnear unto my house: and I will give thee for it a better vineyard than it;or,if it seem good to thee, I will give thee the worth of it in money.",
        "3And Naboth said to Ahab, TheLordforbid it me, that I should give theinheritanceof my fathers unto thee.",
        "4And Ahab came into his house heavy and displeased because of the word which Naboth the Jezreelite had spoken to him: for he had said, I will not give thee the inheritance of my fathers. And he laid him down upon his bed, and turned away his face, and would eat no bread.",
        "5Â¶But Jezebel his wife came to him, and said unto him, Why is thy spirit so sad, that thou eatest no bread?",
        "6And he said unto her, Because I spake unto Naboth the Jezreelite, and said unto him, Give me thy vineyard for money; or else, if it please thee, I will give theeanothervineyard for it: and he answered, I will not give thee my vineyard.",
        "7And Jezebel his wife said unto him, Dost thou now govern the kingdom of Israel? arise,andeat bread, and let thine heart be merry: I will give thee the vineyard of Naboth the Jezreelite.",
        "8So she wrote letters in Ahabâs name, and sealedthemwith hisseal, and sent the letters unto the elders and to the nobles thatwerein his city, dwelling with Naboth.",
        "9And she wrote in the letters, saying, Proclaim afast, and set Naboth on high among the people:",
        "10And set two men, sons of Belial, before him, to bear witnessagainsthim, saying, Thou didstblasphemeGod and the king. Andthencarry him out, and stone him, that he may die.",
        "11And the men of his city,eventhe elders and the nobles who were the inhabitants in his city, did as Jezebel had sent unto them,andas itwaswritten in the letters which she had sent unto them.",
        "12They proclaimed a fast, and set Naboth on high among the people.",
        "13And there came in two men, children of Belial, and sat before him: and the men of Belial witnessed against him,evenagainst Naboth, in the presence of the people, saying, Naboth did blaspheme God and the king. Then they carried him forth out of the city, and stoned him with stones, that he died.",
        "14Then they sent to Jezebel, saying, Naboth is stoned, and is dead.",
        "15Â¶And it came to pass, when Jezebel heard that Naboth was stoned, and was dead, that Jezebel said to Ahab, Arise, takepossessionof the vineyard of Naboth the Jezreelite, which he refused to give thee for money: for Naboth is not alive, but dead.",
        "16And it came to pass, when Ahab heard that Naboth was dead, that Ahab rose up to go down to the vineyard of Naboth the Jezreelite, to take possession of it.",
        "17Â¶And the word of theLordcame to Elijah the Tishbite, saying,",
        "18Arise, go down to meet Ahab king of Israel, whichisin Samaria: behold,he isin the vineyard of Naboth, whither he is gone down to possess it.",
        "19And thou shalt speak unto him, saying, Thus saith theLord, Hast thou killed, and also taken possession? And thou shalt speak unto him, saying, Thus saith theLord, In the place where dogs licked the blood of Naboth shall dogs lick thy blood, even thine.",
        "20And Ahab said to Elijah, Hast thou found me, O mine enemy? And he answered, I have foundthee:because thou hast sold thyself to work evil in the sight of theLord.",
        "21Behold, I will bring evil upon thee, and will take away thyposterity, and will cut off from Ahab him that pisseth against the wall, and him that is shut up and left in Israel,",
        "22And will make thine house like the house of Jeroboam the son of Nebat, and like the house of Baasha the son of Ahijah, for the provocation wherewith thou hast provokedmeto anger, and made Israel to sin.",
        "23And of Jezebel also spake theLord, saying, Thedogsshall eat Jezebel by the wall of Jezreel.",
        "24Him that dieth of Ahab in the city the dogs shall eat; and him that dieth in the field shall the fowls of the air eat.",
        "25Â¶But there was none like unto Ahab, which did sell himself to work wickedness in the sight of theLord, whom Jezebel his wife stirred up.",
        "26And he did veryabominablyin following idols, according to allthingsas did the Amorites, whom theLordcast out before the children of Israel.",
        "27And it came to pass, when Ahab heard those words, that herenthis clothes, and put sackcloth upon his flesh, and fasted, and lay in sackcloth, and wentsoftly.",
        "28And the word of theLordcame to Elijah the Tishbite, saying,",
        "29Seest thou how Ahab humbleth himself before me? because he humbleth himself before me, I will not bring the evil in his days:butin his sonâs days will I bring the evil upon his house."
      ],
      "full_text": "1And it came to pass after these things,thatNaboth the Jezreelite had a vineyard, whichwasin Jezreel, hard by the palace of Ahab king of Samaria. 2And Ahab spake unto Naboth, saying, Give me thy vineyard, that I may have it for a garden of herbs, because itisnear unto my house: and I will give thee for it a better vineyard than it;or,if it seem good to thee, I will give thee the worth of it in money. 3And Naboth said to Ahab, TheLordforbid it me, that I should give theinheritanceof my fathers unto thee. 4And Ahab came into his house heavy and displeased because of the word which Naboth the Jezreelite had spoken to him: for he had said, I will not give thee the inheritance of my fathers. And he laid him down upon his bed, and turned away his face, and would eat no bread. 5Â¶But Jezebel his wife came to him, and said unto him, Why is thy spirit so sad, that thou eatest no bread? 6And he said unto her, Because I spake unto Naboth the Jezreelite, and said unto him, Give me thy vineyard for money; or else, if it please thee, I will give theeanothervineyard for it: and he answered, I will not give thee my vineyard. 7And Jezebel his wife said unto him, Dost thou now govern the kingdom of Israel? arise,andeat bread, and let thine heart be merry: I will give thee the vineyard of Naboth the Jezreelite. 8So she wrote letters in Ahabâs name, and sealedthemwith hisseal, and sent the letters unto the elders and to the nobles thatwerein his city, dwelling with Naboth. 9And she wrote in the letters, saying, Proclaim afast, and set Naboth on high among the people: 10And set two men, sons of Belial, before him, to bear witnessagainsthim, saying, Thou didstblasphemeGod and the king. Andthencarry him out, and stone him, that he may die. 11And the men of his city,eventhe elders and the nobles who were the inhabitants in his city, did as Jezebel had sent unto them,andas itwaswritten in the letters which she had sent unto them. 12They proclaimed a fast, and set Naboth on high among the people. 13And there came in two men, children of Belial, and sat before him: and the men of Belial witnessed against him,evenagainst Naboth, in the presence of the people, saying, Naboth did blaspheme God and the king. Then they carried him forth out of the city, and stoned him with stones, that he died. 14Then they sent to Jezebel, saying, Naboth is stoned, and is dead. 15Â¶And it came to pass, when Jezebel heard that Naboth was stoned, and was dead, that Jezebel said to Ahab, Arise, takepossessionof the vineyard of Naboth the Jezreelite, which he refused to give thee for money: for Naboth is not alive, but dead. 16And it came to pass, when Ahab heard that Naboth was dead, that Ahab rose up to go down to the vineyard of Naboth the Jezreelite, to take possession of it. 17Â¶And the word of theLordcame to Elijah the Tishbite, saying, 18Arise, go down to meet Ahab king of Israel, whichisin Samaria: behold,he isin the vineyard of Naboth, whither he is gone down to possess it. 19And thou shalt speak unto him, saying, Thus saith theLord, Hast thou killed, and also taken possession? And thou shalt speak unto him, saying, Thus saith theLord, In the place where dogs licked the blood of Naboth shall dogs lick thy blood, even thine. 20And Ahab said to Elijah, Hast thou found me, O mine enemy? And he answered, I have foundthee:because thou hast sold thyself to work evil in the sight of theLord. 21Behold, I will bring evil upon thee, and will take away thyposterity, and will cut off from Ahab him that pisseth against the wall, and him that is shut up and left in Israel, 22And will make thine house like the house of Jeroboam the son of Nebat, and like the house of Baasha the son of Ahijah, for the provocation wherewith thou hast provokedmeto anger, and made Israel to sin. 23And of Jezebel also spake theLord, saying, Thedogsshall eat Jezebel by the wall of Jezreel. 24Him that dieth of Ahab in the city the dogs shall eat; and him that dieth in the field shall the fowls of the air eat. 25Â¶But there was none like unto Ahab, which did sell himself to work wickedness in the sight of theLord, whom Jezebel his wife stirred up. 26And he did veryabominablyin following idols, according to allthingsas did the Amorites, whom theLordcast out before the children of Israel. 27And it came to pass, when Ahab heard those words, that herenthis clothes, and put sackcloth upon his flesh, and fasted, and lay in sackcloth, and wentsoftly. 28And the word of theLordcame to Elijah the Tishbite, saying, 29Seest thou how Ahab humbleth himself before me? because he humbleth himself before me, I will not bring the evil in his days:butin his sonâs days will I bring the evil upon his house."
    },
    {
      "reference": "1 Kings 22",
      "title": "1 Kings 22",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-kgs/22?lang=eng",
      "summary": "Jehoshaphat of Judah and Ahab of Israel join forces against SyriaâAhabâs prophets foretell successâMicaiah foretells the defeat and death of AhabâAhab is slain and dogs lick up his bloodâJehoshaphat reigns in righteousness in JudahâAhaziah reigns in Israel and serves Baal.",
      "verses": [
        "1And they continued three years without war between Syria and Israel.",
        "2And it came to pass in the third year, that Jehoshaphat the king of Judah came down to the king of Israel.",
        "3And the king of Israel said unto his servants, Know ye that Ramoth in Gileadisours, and webestill,andtake it not out of the hand of the king of Syria?",
        "4And he said unto Jehoshaphat, Wilt thou go with me to battle to Ramoth-gilead? And Jehoshaphat said to the king of Israel,Iamas thouart,my people as thy people, my horses as thy horses.",
        "5And Jehoshaphat said unto the king of Israel, Inquire, I pray thee, at the word of theLordto day.",
        "6Then the king of Israel gathered theprophetstogether, about four hundred men, and said unto them, Shall I go against Ramoth-gilead to battle, or shall I forbear? And they said, Go up; for the Lord shall deliveritinto the hand of the king.",
        "7And Jehoshaphat said,Is therenot here a prophet of theLordbesides, that we might inquire of him?",
        "8And the king of Israel said unto Jehoshaphat,There isyet one man, Micaiah the son of Imlah, by whom we may inquire of theLord: but Ihatehim; for he doth not prophesy good concerning me, but evil. And Jehoshaphat said, Let not the king say so.",
        "9Then the king of Israel called an officer, and said, HastenhitherMicaiah the son of Imlah.",
        "10And the king of Israel and Jehoshaphat the king of Judah sat each on his throne, having put on their robes, in avoid placein the entrance of the gate of Samaria; and all the prophets prophesied before them.",
        "11And Zedekiah the son of Chenaanah made him horns of iron: and he said, Thus saith theLord, With these shalt thou push the Syrians, until thou have consumed them.",
        "12And all the prophets prophesied so, saying, Go up to Ramoth-gilead, and prosper: for theLordshall deliveritinto the kingâs hand.",
        "13And the messenger that was gone to call Micaiah spake unto him, saying, Behold now, the words of the prophetsdeclaregood unto the king with one mouth: let thy word, I pray thee, be like the word of one of them, and speakthat which isgood.",
        "14And Micaiah said,AstheLordliveth, what theLordsaith unto me, that will I speak.",
        "15Â¶So he came to the king. And the king said unto him, Micaiah, shall we go against Ramoth-gilead to battle, or shall we forbear? And he answered him, Go, and prosper: for theLordshall deliveritinto the hand of the king.",
        "16And the king said unto him, How many times shall I adjure thee that thou tell me nothing butthat which istrue in the name of theLord?",
        "17And he said, I saw all Israelscatteredupon the hills, assheepthat have not a shepherd: and theLordsaid, These have no master: let them return every man to his house in peace.",
        "18And the king of Israel said unto Jehoshaphat, Did I not tell thee that he would prophesy no good concerning me, but evil?",
        "19And he said, Hear thou therefore the word of theLord: I saw theLordsitting on his throne, and all the host of heaven standing by him on his right hand and on his left.",
        "20And theLordsaid, Who shall persuade Ahab, that he may go up and fall at Ramoth-gilead? And one said on this manner, and another said on that manner.",
        "21And there came forth a spirit, and stood before theLord, and said, I will persuade him.",
        "22And theLordsaid unto him, Wherewith? And he said, I will go forth, and I will be alyingspirit in the mouth of all his prophets. And he said, Thou shalt persuadehim,and prevail also: go forth, and do so.",
        "23Now therefore, behold, theLordhath put alyingspirit in the mouth of all these thy prophets, and theLordhath spoken evil concerning thee.",
        "24But Zedekiah the son of Chenaanah went near, and smote Micaiah on the cheek, and said, Which way went the Spirit of theLordfrom me to speak unto thee?",
        "25And Micaiah said, Behold, thou shalt see in that day, when thou shalt go into an inner chamber to hide thyself.",
        "26And the king of Israel said, Take Micaiah, and carry him back unto Amon the governor of the city, and to Joash the kingâs son;",
        "27And say, Thus saith the king, Put thisfellowin the prison, and feed him with bread of affliction and with water of affliction, until I come in peace.",
        "28And Micaiah said, If thou return at all in peace, theLordhath not spoken by me. And he said, Hearken, O people, every one of you.",
        "29So the king of Israel and Jehoshaphat the king of Judah went up to Ramoth-gilead.",
        "30And the king of Israel said unto Jehoshaphat, I will disguise myself, and enter into the battle; but put thou on thy robes. And the king of Israel disguised himself, and went into the battle.",
        "31But the king of Syria commanded his thirty and two captains that had rule over his chariots, saying, Fight neither with small nor great, save only with the king of Israel.",
        "32And it came to pass, when the captains of the chariots saw Jehoshaphat, that they said, Surely itisthe king of Israel. And they turned aside to fight against him: and Jehoshaphat cried out.",
        "33And it came to pass, when the captains of the chariots perceived that itwasnot the king of Israel, that they turned back from pursuing him.",
        "34And acertainman drew a bow at a venture, and smote the king of Israelbetweenthe joints of the harness: wherefore he said unto the driver of his chariot, Turn thine hand, and carry me out of the host; for I am wounded.",
        "35And the battle increased that day: and the king wasstayed upin his chariot against the Syrians, and died at even: and the blood ran out of the wound into the midst of the chariot.",
        "36And there went a proclamation throughout the host about the going down of the sun, saying, Every man to his city, and every man to his own country.",
        "37Â¶So the kingdied, and was brought to Samaria; and they buried the king in Samaria.",
        "38Andonewashed the chariot in the pool of Samaria; and the dogs licked up his blood; and they washed his armour; according unto the word of theLordwhich he spake.",
        "39Now the rest of the acts of Ahab, and all that he did, and theivoryhouse which he made, and all the cities that he built,arethey not written in the book of the chronicles of the kings of Israel?",
        "40So Ahab slept with his fathers; and Ahaziah his son reigned in his stead.",
        "41Â¶And Jehoshaphat the son of Asa began to reign over Judah in the fourth year of Ahab king of Israel.",
        "42Jehoshaphatwasthirty and five years old when he began to reign; and he reigned twenty and five years in Jerusalem. And his motherâs namewasAzubah the daughter of Shilhi.",
        "43And he walked in all the ways of Asa his father; he turned not aside from it, doingthat which wasright in the eyes of theLord: nevertheless the high places were not taken away;forthe people offered and burnt incense yet in the high places.",
        "44And Jehoshaphat made peace with the king of Israel.",
        "45Now the rest of the acts of Jehoshaphat, and his might that he shewed, and how he warred,arethey not written in the book of the chronicles of the kings of Judah?",
        "46And the remnant of thesodomites, which remained in the days of his father Asa, he took out of the land.",
        "47There wasthen nokingin Edom: a deputywasking.",
        "48Jehoshaphat made ships of Tharshish to go to Ophir for gold: but they went not; for the ships were broken atEzion-geber.",
        "49Then said Ahaziah the son of Ahab unto Jehoshaphat, Let my servants go with thy servants in the ships. But Jehoshaphat would not.",
        "50Â¶And Jehoshaphat slept with his fathers, and was buried with his fathers in the city of David hisfather: and Jehoram his son reigned in his stead."
      ],
      "full_text": "1And they continued three years without war between Syria and Israel. 2And it came to pass in the third year, that Jehoshaphat the king of Judah came down to the king of Israel. 3And the king of Israel said unto his servants, Know ye that Ramoth in Gileadisours, and webestill,andtake it not out of the hand of the king of Syria? 4And he said unto Jehoshaphat, Wilt thou go with me to battle to Ramoth-gilead? And Jehoshaphat said to the king of Israel,Iamas thouart,my people as thy people, my horses as thy horses. 5And Jehoshaphat said unto the king of Israel, Inquire, I pray thee, at the word of theLordto day. 6Then the king of Israel gathered theprophetstogether, about four hundred men, and said unto them, Shall I go against Ramoth-gilead to battle, or shall I forbear? And they said, Go up; for the Lord shall deliveritinto the hand of the king. 7And Jehoshaphat said,Is therenot here a prophet of theLordbesides, that we might inquire of him? 8And the king of Israel said unto Jehoshaphat,There isyet one man, Micaiah the son of Imlah, by whom we may inquire of theLord: but Ihatehim; for he doth not prophesy good concerning me, but evil. And Jehoshaphat said, Let not the king say so. 9Then the king of Israel called an officer, and said, HastenhitherMicaiah the son of Imlah. 10And the king of Israel and Jehoshaphat the king of Judah sat each on his throne, having put on their robes, in avoid placein the entrance of the gate of Samaria; and all the prophets prophesied before them. 11And Zedekiah the son of Chenaanah made him horns of iron: and he said, Thus saith theLord, With these shalt thou push the Syrians, until thou have consumed them. 12And all the prophets prophesied so, saying, Go up to Ramoth-gilead, and prosper: for theLordshall deliveritinto the kingâs hand. 13And the messenger that was gone to call Micaiah spake unto him, saying, Behold now, the words of the prophetsdeclaregood unto the king with one mouth: let thy word, I pray thee, be like the word of one of them, and speakthat which isgood. 14And Micaiah said,AstheLordliveth, what theLordsaith unto me, that will I speak. 15Â¶So he came to the king. And the king said unto him, Micaiah, shall we go against Ramoth-gilead to battle, or shall we forbear? And he answered him, Go, and prosper: for theLordshall deliveritinto the hand of the king. 16And the king said unto him, How many times shall I adjure thee that thou tell me nothing butthat which istrue in the name of theLord? 17And he said, I saw all Israelscatteredupon the hills, assheepthat have not a shepherd: and theLordsaid, These have no master: let them return every man to his house in peace. 18And the king of Israel said unto Jehoshaphat, Did I not tell thee that he would prophesy no good concerning me, but evil? 19And he said, Hear thou therefore the word of theLord: I saw theLordsitting on his throne, and all the host of heaven standing by him on his right hand and on his left. 20And theLordsaid, Who shall persuade Ahab, that he may go up and fall at Ramoth-gilead? And one said on this manner, and another said on that manner. 21And there came forth a spirit, and stood before theLord, and said, I will persuade him. 22And theLordsaid unto him, Wherewith? And he said, I will go forth, and I will be alyingspirit in the mouth of all his prophets. And he said, Thou shalt persuadehim,and prevail also: go forth, and do so. 23Now therefore, behold, theLordhath put alyingspirit in the mouth of all these thy prophets, and theLordhath spoken evil concerning thee. 24But Zedekiah the son of Chenaanah went near, and smote Micaiah on the cheek, and said, Which way went the Spirit of theLordfrom me to speak unto thee? 25And Micaiah said, Behold, thou shalt see in that day, when thou shalt go into an inner chamber to hide thyself. 26And the king of Israel said, Take Micaiah, and carry him back unto Amon the governor of the city, and to Joash the kingâs son; 27And say, Thus saith the king, Put thisfellowin the prison, and feed him with bread of affliction and with water of affliction, until I come in peace. 28And Micaiah said, If thou return at all in peace, theLordhath not spoken by me. And he said, Hearken, O people, every one of you. 29So the king of Israel and Jehoshaphat the king of Judah went up to Ramoth-gilead. 30And the king of Israel said unto Jehoshaphat, I will disguise myself, and enter into the battle; but put thou on thy robes. And the king of Israel disguised himself, and went into the battle. 31But the king of Syria commanded his thirty and two captains that had rule over his chariots, saying, Fight neither with small nor great, save only with the king of Israel. 32And it came to pass, when the captains of the chariots saw Jehoshaphat, that they said, Surely itisthe king of Israel. And they turned aside to fight against him: and Jehoshaphat cried out. 33And it came to pass, when the captains of the chariots perceived that itwasnot the king of Israel, that they turned back from pursuing him. 34And acertainman drew a bow at a venture, and smote the king of Israelbetweenthe joints of the harness: wherefore he said unto the driver of his chariot, Turn thine hand, and carry me out of the host; for I am wounded. 35And the battle increased that day: and the king wasstayed upin his chariot against the Syrians, and died at even: and the blood ran out of the wound into the midst of the chariot. 36And there went a proclamation throughout the host about the going down of the sun, saying, Every man to his city, and every man to his own country. 37Â¶So the kingdied, and was brought to Samaria; and they buried the king in Samaria. 38Andonewashed the chariot in the pool of Samaria; and the dogs licked up his blood; and they washed his armour; according unto the word of theLordwhich he spake. 39Now the rest of the acts of Ahab, and all that he did, and theivoryhouse which he made, and all the cities that he built,arethey not written in the book of the chronicles of the kings of Israel? 40So Ahab slept with his fathers; and Ahaziah his son reigned in his stead. 41Â¶And Jehoshaphat the son of Asa began to reign over Judah in the fourth year of Ahab king of Israel. 42Jehoshaphatwasthirty and five years old when he began to reign; and he reigned twenty and five years in Jerusalem. And his motherâs namewasAzubah the daughter of Shilhi. 43And he walked in all the ways of Asa his father; he turned not aside from it, doingthat which wasright in the eyes of theLord: nevertheless the high places were not taken away;forthe people offered and burnt incense yet in the high places. 44And Jehoshaphat made peace with the king of Israel. 45Now the rest of the acts of Jehoshaphat, and his might that he shewed, and how he warred,arethey not written in the book of the chronicles of the kings of Judah? 46And the remnant of thesodomites, which remained in the days of his father Asa, he took out of the land. 47There wasthen nokingin Edom: a deputywasking. 48Jehoshaphat made ships of Tharshish to go to Ophir for gold: but they went not; for the ships were broken atEzion-geber. 49Then said Ahaziah the son of Ahab unto Jehoshaphat, Let my servants go with thy servants in the ships. But Jehoshaphat would not. 50Â¶And Jehoshaphat slept with his fathers, and was buried with his fathers in the city of David hisfather: and Jehoram his son reigned in his stead. 51Â¶Ahaziah the son of Ahab began to reign over Israel in Samaria the seventeenth year of Jehoshaphat king of Judah, and reigned two years over Israel. 52And he did evil in the sight of theLord, and walked in the way of his father, and in the way of his mother, and in the way of Jeroboam the son of Nebat, who made Israel to sin: 53For he served Baal, and worshipped him, and provoked to anger theLordGod of Israel, according to all that his father had done."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:29:38",
  "metadata": {
    "week_number": 27,
    "title": "Week 27: June 29–July 5 - 1 Kings 12–13; 17–22",
    "date_range": "June 29–July 5",
    "scraped_at": "2025-12-21T22:29:44.378742",
    "scraper_version": "2.0.0"
  }
}