{
  "week_number": 46,
  "date_range": "November 9–15",
  "title": "Week 46: November 9–15 - Daniel 1–7",
  "bundle_title": "Week 46: November 9–15: \"Week 46: November 9–15 - Daniel 1–7\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/46?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/46?lang=eng",
    "title": "Daniel 1–7",
    "scripture_references": "Daniel 1–7",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“November 9–15. “There Is No Other God That Can Deliver”: Daniel 1–7,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“November 9–15. ‘There Is No Other God That Can Deliver,’”Come, Follow Me: Old Testament 2026\n\nDaniel Interprets Nebuchadnezzar’s Dream, by Grant Romney Clawson\n\nNovember 9–15: “There Is No Other God That Can Deliver”\n\nMost likely no one will threaten to throw you into a fiery furnace or a den of lions because of your faith in Jesus Christ. But none of us get through this life without a trial of faith. So we can all benefit from the examples of people like Daniel, Shadrach, Meshach, and Abed-nego, who were taken captive as young men by the mighty Babylonian Empire (see2 Kings 24:10–16). Surrounded by an unfamiliar culture with different values, they faced great temptations to abandon their beliefs and righteous traditions. Yet they remained true to their covenants. How did they do it? By doing those small and simple things God asks of all of us—praying, fasting, choosing good friends, trusting in Him, and being a light to others. Like Joseph in Egypt and Esther in Persia, Daniel and his friends in Babylon kept their faith in God, and God worked miracles that still inspire believers to this day.\n\nFor an overview of the book of Daniel, see “Daniel” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "I can trust in the Lord when my faith is tried.",
        "content": "In a sense, we all live in Babylon. We often face temptations to compromise our standards and turn away from faith in Christ. As you readDaniel 1,3, and6, note the ways in which Daniel, Shadrach, Meshach, and Abed-nego were pressured to do things they knew were wrong. How did they respond to these situations? (seeDaniel 1:10–13;3:15–18;6:10). What were the results of their faith? What do you learn from these experiences that can help you trust in the Lord when you face opposition? Also consider the following questions:\n\nWhen have you felt pressured to do something you knew was wrong? How has the Lord blessed you for keeping His commandments?\n\nWhat if your faith doesn’t lead to the miracles you seek? (for an example, seeAlma 14:8–13). Based on what you read inDaniel 3:13–18, how do you think Shadrach, Meshach, and Abed-nego would have answered this question? How can their example affect how you approach your trials?\n\nHow can your righteous choices lead others to greater faith in the Lord? (seeDaniel 2:47;3:28–29). Ponder the effects that your choices may be having on others.\n\nSee also Dieter F. Uchtdorf, “Be Not Afraid, Only Believe,”EnsignorLiahona, Nov. 2015, 76–79.\n\nTry to involve everyone.The Savior “inviteth … all to come unto him and partake of his goodness” (2 Nephi 26:33). If you are teaching your family or a class, ponder ways you can give everyone an opportunity to participate in some way. For example, you could give each person a passage of scripture, a section of a conference message, or a verse from a hymn to ponder and comment on. Don’t pressure anyone to participate, but give them opportunities.\n\nShadrach, Meshach, and Abednego in the Fiery Furnace, by William Maughan\n\nDaniel 2"
      },
      {
        "title": "The Church of Jesus Christ of Latter-day Saints is the kingdom of God on earth.",
        "content": "Through revelation, Daniel saw that Nebuchadnezzar’s dream foretold future worldly kingdoms, as well as the future kingdom of God, which “shall never be destroyed” (Daniel 2:44). “The Church is that prophesied latter-day kingdom,” Elder D. Todd Christofferson taught, “not created by man but set up by the God of heaven and rolling forth as a stone ‘cut out of the mountain without hands’ to fill the earth” (“Why the Church,”EnsignorLiahona, Nov. 2015, 111). Think about God’s latter-day kingdom as you read the descriptions of the stone inDaniel 2:34–35, 44–45. What is your role in helping this prophecy come to pass?\n\nSee also “Hark, All Ye Nations!,”Hymns, no. 264; “God Gave Them Knowledge” (video),ChurchofJesusChrist.org.\n\nGod Gave Them Knowledge\n\nDaniel 2:1–30"
      },
      {
        "title": "Receiving revelation requires spiritual preparation.",
        "content": "As you reviewDaniel 2:1–15, consider how you would feel if you found yourself in Daniel’s position. What did Daniel do? (seeDaniel 2:16–18). What can you learn fromDaniel 1:17about how God prepared Daniel? What can you learn from Daniel’s words and actions after he received the Lord’s help? (seeDaniel 2:19–30).\n\nDaniel 7:13–14"
      },
      {
        "title": "Jesus Christ is the Son of the Eternal Father.",
        "content": "During the Savior’s earthly ministry, many Jews considered the title “Son of man” fromDaniel 7:13to refer to the coming Messiah. What do you learn about the Messiah fromDaniel 7:13–14? (see alsoMoses 6:57).\n\nThe Savior often referred to himself as “the Son of man.” Consider reviewing some examples:Matthew 25:31;Mark 9:31;10:45. What is He teaching about Himself in these verses? InMark 14:61–64, Jesus used this title on the last day of His mortal life. Note the reaction from the people who heard His declaration. How does Daniel’s prophecy about the Son of Man affect your feelings about what happened to Him inMark 15?\n\nJust as Jesus was hated for declaring that He was “the Son of man,” you might also face persecution for declaring the truth. Compare the prophecy inDaniel 7:13–14with the promises inDoctrine and Covenants 121:29, 46.\n\nSee alsoDoctrine and Covenants 49:6; Guide to the Scriptures, “Son of Man,” Gospel Library."
      }
    ],
    "teaching_children": [
      {
        "title": "Jesus will help me do what is right even when it’s hard.",
        "content": "To help your children learn from the inspiring stories in the book of Daniel, you could find pictures of the events inDaniel 1,3, and6(see this week’s activity page or theGospel Art Book,nos. 23,25,26). Then you could place the pictures face down and invite a child to turn one over and talk about the story it represents. (For help, see “Daniel and His Friends,” “Shadrach, Meshach, and Abed-nego,” and “Daniel and the Lions’ Den” inOld Testament Stories, 154–56, 160–62, 163–65.)\n\nDaniel and His Friends\n\nShadrach, Meshach, and Abed-nego\n\nDaniel and the Lions’ Den\n\nHelp your children think of situations when they might be pressured to make a wrong choice, like Daniel and his friends were inDaniel 1,3, and6. Share with each other how you have been blessed for making the right choice even when it was hard. You could also sing together a song related to this topic, such as “Choose the Right” (Hymns, no. 239).\n\nTrusting the Wisdom of the Word\n\nDaniel 1:1–17"
      },
      {
        "title": "Heavenly Father wants me to take care of my body.",
        "content": "Reading the story about Daniel and his friends refusing the king’s meat and wine may inspire a conversation about the law of health Heavenly Father has given us today (seeDoctrine and Covenants 89). Maybe you could look for the blessings Daniel and his friends received and compare them to the blessings promised in the Word of Wisdom (seeDaniel 1:15–17andDoctrine and Covenants 89:18–21).\n\nDaniel 2"
      },
      {
        "title": "The Church of Jesus Christ of Latter-day Saints is the kingdom of God on earth.",
        "content": "As you readDaniel 2:31–35, 44–45with your children, you could invite them to draw a picture of Nebuchadnezzar’s dream. Help them understand the stone in the dream represents The Church of Jesus Christ of Latter-day Saints. What do we learn about the Church from this dream? Your children could name some things Heavenly Father did to set up His Church in the latter days. If they need help, you could show pictures of events from the Restoration of the Church (seeGospel Art Book,nos. 90–95).\n\nDaniel 6"
      },
      {
        "title": "Heavenly Father wants me to pray often.",
        "content": "Why was praying to Heavenly Father so important to Daniel? Perhaps you and your children could talk about that question as you readDaniel 6together. Then you could tell each other why praying is important to you. Your children might enjoy drawing pictures of themselves praying in various situations. They could use their drawings to teach each other that we can pray to Heavenly Father no matter where we are or what we need.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nDaniel in the Lions’ Den, by Briton Rivière"
      }
    ],
    "study_helps": [],
    "raw_text": "November 9–15. “There Is No Other God That Can Deliver”: Daniel 1–7\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nOctober 26–November 1\nJeremiah 31–33; 36–38; Lamentations 1; 3\nNovember 2–8\nEzekiel 1–3; 33–34; 36–37; 47\nNovember 9–15\nDaniel 1–7\nNovember 16–22\nHosea 1–6; 10–14; Joel\nNovember 23–29\nAmos; Obadiah; Jonah\nDecember\nAppendixes\nNovember 9–15. “There Is No Other God That Can Deliver”: Daniel 1–7\n“November 9–15. “There Is No Other God That Can Deliver”: Daniel 1–7,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“November 9–15. ‘There Is No Other God That Can Deliver,’”\nCome, Follow Me: Old Testament 2026\nDaniel Interprets Nebuchadnezzar’s Dream\n, by Grant Romney Clawson\nNovember 9–15: “There Is No Other God That Can Deliver”\nDaniel 1–7\nMost likely no one will threaten to throw you into a fiery furnace or a den of lions because of your faith in Jesus Christ. But none of us get through this life without a trial of faith. So we can all benefit from the examples of people like Daniel, Shadrach, Meshach, and Abed-nego, who were taken captive as young men by the mighty Babylonian Empire (see\n2 Kings 24:10–16\n). Surrounded by an unfamiliar culture with different values, they faced great temptations to abandon their beliefs and righteous traditions. Yet they remained true to their covenants. How did they do it? By doing those small and simple things God asks of all of us—praying, fasting, choosing good friends, trusting in Him, and being a light to others. Like Joseph in Egypt and Esther in Persia, Daniel and his friends in Babylon kept their faith in God, and God worked miracles that still inspire believers to this day.\nFor an overview of the book of Daniel, see “\nDaniel\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nDaniel 1\n;\n3\n;\n6\nI can trust in the Lord when my faith is tried.\nIn a sense, we all live in Babylon. We often face temptations to compromise our standards and turn away from faith in Christ. As you read\nDaniel 1\n,\n3\n, and\n6\n, note the ways in which Daniel, Shadrach, Meshach, and Abed-nego were pressured to do things they knew were wrong. How did they respond to these situations? (see\nDaniel 1:10–13\n;\n3:15–18\n;\n6:10\n). What were the results of their faith? What do you learn from these experiences that can help you trust in the Lord when you face opposition? Also consider the following questions:\nWhen have you felt pressured to do something you knew was wrong? How has the Lord blessed you for keeping His commandments?\nWhat if your faith doesn’t lead to the miracles you seek? (for an example, see\nAlma 14:8–13\n). Based on what you read in\nDaniel 3:13–18\n, how do you think Shadrach, Meshach, and Abed-nego would have answered this question? How can their example affect how you approach your trials?\nHow can your righteous choices lead others to greater faith in the Lord? (see\nDaniel 2:47\n;\n3:28–29\n). Ponder the effects that your choices may be having on others.\nSee also Dieter F. Uchtdorf, “\nBe Not Afraid, Only Believe\n,”\nEnsign\nor\nLiahona\n, Nov. 2015, 76–79.\nTry to involve everyone.\nThe Savior “inviteth … all to come unto him and partake of his goodness” (\n2 Nephi 26:33\n). If you are teaching your family or a class, ponder ways you can give everyone an opportunity to participate in some way. For example, you could give each person a passage of scripture, a section of a conference message, or a verse from a hymn to ponder and comment on. Don’t pressure anyone to participate, but give them opportunities.\nShadrach, Meshach, and Abednego in the Fiery Furnace\n, by William Maughan\nDaniel 2\nThe Church of Jesus Christ of Latter-day Saints is the kingdom of God on earth.\nThrough revelation, Daniel saw that Nebuchadnezzar’s dream foretold future worldly kingdoms, as well as the future kingdom of God, which “shall never be destroyed” (\nDaniel 2:44\n). “The Church is that prophesied latter-day kingdom,” Elder D. Todd Christofferson taught, “not created by man but set up by the God of heaven and rolling forth as a stone ‘cut out of the mountain without hands’ to fill the earth” (“\nWhy the Church\n,”\nEnsign\nor\nLiahona\n, Nov. 2015, 111). Think about God’s latter-day kingdom as you read the descriptions of the stone in\nDaniel 2:34–35, 44–45\n. What is your role in helping this prophecy come to pass?\nSee also “\nHark, All Ye Nations!\n,”\nHymns\n, no. 264; “God Gave Them Knowledge” (video),\nChurchofJesusChrist.org\n.\n13:49\nGod Gave Them Knowledge\nDaniel 2:1–30\nReceiving revelation requires spiritual preparation.\nAs you review\nDaniel 2:1–15\n, consider how you would feel if you found yourself in Daniel’s position. What did Daniel do? (see\nDaniel 2:16–18\n). What can you learn from\nDaniel 1:17\nabout how God prepared Daniel? What can you learn from Daniel’s words and actions after he received the Lord’s help? (see\nDaniel 2:19–30\n).\nDaniel 7:13–14\nJesus Christ is the Son of the Eternal Father.\nDuring the Savior’s earthly ministry, many Jews considered the title “Son of man” from\nDaniel 7:13\nto refer to the coming Messiah. What do you learn about the Messiah from\nDaniel 7:13–14\n? (see also\nMoses 6:57\n).\nThe Savior often referred to himself as “the Son of man.” Consider reviewing some examples:\nMatthew 25:31\n;\nMark 9:31\n;\n10:45\n. What is He teaching about Himself in these verses? In\nMark 14:61–64\n, Jesus used this title on the last day of His mortal life. Note the reaction from the people who heard His declaration. How does Daniel’s prophecy about the Son of Man affect your feelings about what happened to Him in\nMark 15\n?\nJust as Jesus was hated for declaring that He was “the Son of man,” you might also face persecution for declaring the truth. Compare the prophecy in\nDaniel 7:13–14\nwith the promises in\nDoctrine and Covenants 121:29, 46\n.\nSee also\nDoctrine and Covenants 49:6\n; Guide to the Scriptures, “\nSon of Man\n,” Gospel Library.\nIdeas for Teaching Children\nDaniel 1\n;\n3\n;\n6\nJesus will help me do what is right even when it’s hard.\nTo help your children learn from the inspiring stories in the book of Daniel, you could find pictures of the events in\nDaniel 1\n,\n3\n, and\n6\n(see this week’s activity page or the\nGospel Art Book\n,\nnos. 23\n,\n25\n,\n26\n). Then you could place the pictures face down and invite a child to turn one over and talk about the story it represents. (For help, see “\nDaniel and His Friends\n,” “\nShadrach, Meshach, and Abed-nego\n,” and “\nDaniel and the Lions’ Den\n” in\nOld Testament Stories\n, 154–56, 160–62, 163–65.)\n1:39\nDaniel and His Friends\n1:39\nShadrach, Meshach, and Abed-nego\n1:45\nDaniel and the Lions’ Den\nHelp your children think of situations when they might be pressured to make a wrong choice, like Daniel and his friends were in\nDaniel 1\n,\n3\n, and\n6\n. Share with each other how you have been blessed for making the right choice even when it was hard. You could also sing together a song related to this topic, such as “\nChoose the Right\n” (\nHymns\n, no. 239).\nTrusting the Wisdom of the Word\nDaniel 1:1–17\nHeavenly Father wants me to take care of my body.\nReading the story about Daniel and his friends refusing the king’s meat and wine may inspire a conversation about the law of health Heavenly Father has given us today (see\nDoctrine and Covenants 89\n). Maybe you could look for the blessings Daniel and his friends received and compare them to the blessings promised in the Word of Wisdom (see\nDaniel 1:15–17\nand\nDoctrine and Covenants 89:18–21\n).\nDaniel 2\nThe Church of Jesus Christ of Latter-day Saints is the kingdom of God on earth.\nAs you read\nDaniel 2:31–35, 44–45\nwith your children, you could invite them to draw a picture of Nebuchadnezzar’s dream. Help them understand the stone in the dream represents The Church of Jesus Christ of Latter-day Saints. What do we learn about the Church from this dream? Your children could name some things Heavenly Father did to set up His Church in the latter days. If they need help, you could show pictures of events from the Restoration of the Church (see\nGospel Art Book\n,\nnos. 90–95\n).\nDaniel 6\nHeavenly Father wants me to pray often.\nWhy was praying to Heavenly Father so important to Daniel? Perhaps you and your children could talk about that question as you read\nDaniel 6\ntogether. Then you could tell each other why praying is important to you. Your children might enjoy drawing pictures of themselves praying in various situations. They could use their drawings to teach each other that we can pray to Heavenly Father no matter where we are or what we need.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nDaniel in the Lions’ Den\n, by Briton Rivière\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Daniel 1",
      "title": "The Book ofDaniel",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/dan/1?lang=eng",
      "summary": "Daniel and certain Hebrews are trained in the court of NebuchadnezzarâThey eat plain food and drink no wineâGod gives them knowledge and wisdom beyond all others.",
      "verses": [
        "1In the third year of the reign ofJehoiakimking of Judah cameNebuchadnezzarking of Babylon unto Jerusalem, and besieged it.",
        "2And the Lord gave Jehoiakim king of Judah into his hand, withpart of thevesselsof the house of God: which he carried into the land ofShinarto the house of his god; and he brought thevesselsinto the treasure house of his god.",
        "3Â¶And the king spake unto Ashpenazthemaster of his eunuchs, that he should bringcertainof the children of Israel, and of the kingâsseed, and of the princes;",
        "4Children in whomwasno blemish, butwell favoured, and skilful in all wisdom, and cunning in knowledge, and understanding science, and such ashadability in them to stand in the kingâs palace, and whom they might teach the learning and the tongue of the Chaldeans.",
        "5And the king appointed them a dailyprovisionof the kingâsmeat, and of the wine which he drank: so nourishing them three years, that at the end thereof they mightstandbefore the king.",
        "6Now among these were of the children of Judah,Daniel,Hananiah, Mishael, and Azariah:",
        "7Unto whom the prince of the eunuchs gavenames: for he gave unto Danielthenameof Belteshazzar; and to Hananiah, of Shadrach; and to Mishael, of Meshach; and to Azariah, of Abed-nego.",
        "8Â¶But Danielpurposedin his heart that he would notdefilehimself with the portion of the kingâs meat, nor with thewinewhich he drank: therefore he requested of the prince of the eunuchs that he might not defile himself.",
        "9Now God had brought Daniel intofavourandtender lovewith the prince of the eunuchs.",
        "10And the prince of the eunuchs said unto Daniel, Ifearmy lord the king, who hath appointed your meat and your drink: for why should he see your facesworse likingthan the children whichareof yoursort? then shall ye makemeendanger my head to the king.",
        "11Then said Daniel toMelzar, whom the prince of the eunuchs had set over Daniel, Hananiah, Mishael, and Azariah,",
        "12Prove thy servants, I beseech thee, ten days; and let them give uspulseto eat, and water to drink.",
        "13Then let ourcountenancesbe looked upon before thee, and the countenance of the children that eat of the portion of the kingâs meat: and as thou seest, deal with thy servants.",
        "14So he consented to them in this matter, and proved them ten days.",
        "15And at the end of ten days their countenances appeared fairer and fatter in flesh than all the children which did eat the portion of the kingâs meat.",
        "16Thus Melzar took away the portion of their meat, and the wine that they should drink; and gave them pulse.",
        "17Â¶As for these four children, God gave themknowledgeand skill in alllearningand wisdom: and Daniel hadunderstandingin allvisionsand dreams.",
        "18Now at the end of the days that the king had said he should bring them in, then the prince of the eunuchs brought them in before Nebuchadnezzar.",
        "19And the king communed withthem; and among them all was found none like Daniel, Hananiah, Mishael, and Azariah: therefore stood they before the king.",
        "20And in all matters of wisdomandunderstanding, that the king inquired of them, he found them ten times better than all themagiciansandastrologers thatwerein all his realm.",
        "21And Daniel continuedevenunto the first year of king Cyrus."
      ],
      "full_text": "1In the third year of the reign ofJehoiakimking of Judah cameNebuchadnezzarking of Babylon unto Jerusalem, and besieged it. 2And the Lord gave Jehoiakim king of Judah into his hand, withpart of thevesselsof the house of God: which he carried into the land ofShinarto the house of his god; and he brought thevesselsinto the treasure house of his god. 3Â¶And the king spake unto Ashpenazthemaster of his eunuchs, that he should bringcertainof the children of Israel, and of the kingâsseed, and of the princes; 4Children in whomwasno blemish, butwell favoured, and skilful in all wisdom, and cunning in knowledge, and understanding science, and such ashadability in them to stand in the kingâs palace, and whom they might teach the learning and the tongue of the Chaldeans. 5And the king appointed them a dailyprovisionof the kingâsmeat, and of the wine which he drank: so nourishing them three years, that at the end thereof they mightstandbefore the king. 6Now among these were of the children of Judah,Daniel,Hananiah, Mishael, and Azariah: 7Unto whom the prince of the eunuchs gavenames: for he gave unto Danielthenameof Belteshazzar; and to Hananiah, of Shadrach; and to Mishael, of Meshach; and to Azariah, of Abed-nego. 8Â¶But Danielpurposedin his heart that he would notdefilehimself with the portion of the kingâs meat, nor with thewinewhich he drank: therefore he requested of the prince of the eunuchs that he might not defile himself. 9Now God had brought Daniel intofavourandtender lovewith the prince of the eunuchs. 10And the prince of the eunuchs said unto Daniel, Ifearmy lord the king, who hath appointed your meat and your drink: for why should he see your facesworse likingthan the children whichareof yoursort? then shall ye makemeendanger my head to the king. 11Then said Daniel toMelzar, whom the prince of the eunuchs had set over Daniel, Hananiah, Mishael, and Azariah, 12Prove thy servants, I beseech thee, ten days; and let them give uspulseto eat, and water to drink. 13Then let ourcountenancesbe looked upon before thee, and the countenance of the children that eat of the portion of the kingâs meat: and as thou seest, deal with thy servants. 14So he consented to them in this matter, and proved them ten days. 15And at the end of ten days their countenances appeared fairer and fatter in flesh than all the children which did eat the portion of the kingâs meat. 16Thus Melzar took away the portion of their meat, and the wine that they should drink; and gave them pulse. 17Â¶As for these four children, God gave themknowledgeand skill in alllearningand wisdom: and Daniel hadunderstandingin allvisionsand dreams. 18Now at the end of the days that the king had said he should bring them in, then the prince of the eunuchs brought them in before Nebuchadnezzar. 19And the king communed withthem; and among them all was found none like Daniel, Hananiah, Mishael, and Azariah: therefore stood they before the king. 20And in all matters of wisdomandunderstanding, that the king inquired of them, he found them ten times better than all themagiciansandastrologers thatwerein all his realm. 21And Daniel continuedevenunto the first year of king Cyrus."
    },
    {
      "reference": "Daniel 2",
      "title": "Daniel 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/dan/2?lang=eng",
      "summary": "Nebuchadnezzarâs dream is revealed to DanielâThe king saw a great image, a stone cut from the mountain without hands destroyed the image, and the stone grew and filled the whole earthâThe stone is the latter-day kingdom of God.",
      "verses": [
        "1And in the second year of the reign of Nebuchadnezzar Nebuchadnezzar dreameddreams, wherewith his spirit wastroubled, and his sleep brake from him.",
        "2Then the king commanded to call themagicians, and the astrologers, and the sorcerers, and the Chaldeans, for to shew the king his dreams. So they came and stood before the king.",
        "3And the king said unto them, I have dreamed a dream, and my spirit was troubled to know the dream.",
        "4Then spake the Chaldeans to the king inSyriack, O king, live for ever: tell thy servants the dream, and we willshewthe interpretation.",
        "5The king answered and said to the Chaldeans, The thing isgone from me: if ye will not make known unto me the dream, with the interpretation thereof, ye shall becutin pieces, and your houses shall be made a dunghill.",
        "6But if ye shew the dream, and the interpretation thereof, ye shall receive of me gifts and rewards and great honour: therefore shew me the dream, and the interpretation thereof.",
        "7They answered again and said, Let the king tell his servants the dream, and we will shew the interpretation of it.",
        "8The king answered and said, I know of certainty that ye would gain the time, because ye see the thing is gone from me.",
        "9But if ye will not make known unto me the dream,there is butone decree for you: for ye have prepared lying and corrupt words to speak before me,tillthe time be changed: therefore tell me the dream, and I shall know that ye can shew me the interpretation thereof.",
        "10Â¶The Chaldeans answered before the king, and said, There is not a man upon the earth that can shew the kingâs matter: thereforethere isno king, lord, nor ruler,thatasked such things at any magician, or astrologer, or Chaldean.",
        "11Andit isa rare thing that the king requireth, and there is none other that can shew it before the king, except thegods, whose dwelling is not with flesh.",
        "12For this cause the king was angry and very furious, and commanded to destroy all the wisemenof Babylon.",
        "13And the decree went forth that the wisemenshould be slain; and they sought Daniel and his fellows to be slain.",
        "14Â¶Then Daniel answered with counsel and wisdom to Arioch the captain of the kingâs guard, which was gone forth to slay the wisemenof Babylon:",
        "15He answered and said to Arioch the kingâs captain, Whyisthe decreesohastyfrom the king? ThenArioch made the thing known to Daniel.",
        "16Then Daniel went in, and desired of the king that he would give him time, and that he would shew the king the interpretation.",
        "17Then Daniel went to his house, and made the thing known toHananiah, Mishael, and Azariah, his companions:",
        "18That they would desire mercies of the God of heaven concerning this secret; that Daniel and his fellows should not perish with the rest of the wisemenof Babylon.",
        "19Â¶Then was thesecretrevealed unto Daniel in a nightvision. Then Daniel blessed the God of heaven.",
        "20Daniel answered and said, Blessed be the name of God for ever and ever: forwisdomand might are his:",
        "21And he changeth thetimesand theseasons: heremovethkings, and setteth up kings: he givethwisdomunto the wise, andknowledgeto them that know understanding:",
        "22Herevealeththe deep and secret things: heknowethwhatisin the darkness, and thelightdwelleth with him.",
        "23I thank thee, and praise thee, O thou God of my fathers, who hast given me wisdom and might, and hast made known unto me now what we desired of thee: for thou hastnowmade known unto us the kingâs matter.",
        "24Â¶Therefore Daniel went in unto Arioch, whom the king had ordained to destroy the wisemenof Babylon: he went and said thus unto him; Destroy not the wisemenof Babylon: bring me in before the king, and I will shew unto the king the interpretation.",
        "25Then Arioch brought in Daniel before the king in haste, and said thus unto him, I have found a man of the captives of Judah, that will make known unto the king the interpretation.",
        "26The king answered and said to Daniel, whosenamewasBelteshazzar, Art thou able to makeknownunto me the dream which I have seen, and the interpretation thereof?",
        "27Daniel answered in the presence of the king, and said, The secret which the king hath demanded cannot the wisemen,theastrologers, the magicians, the soothsayers, shew unto the king;",
        "28But there is a God in heaven thatrevealethsecrets, and maketh known to the king Nebuchadnezzar what shall be in the latter days. Thydream, and the visions of thy head upon thy bed, are these;",
        "29As for thee, O king, thy thoughts cameinto thy mindupon thy bed, what should come to pass hereafter: and he thatrevealethsecrets maketh known to thee what shall come to pass.",
        "30But as for me, this secret is not revealed to me foranywisdomthat I have more than any living, butfortheirsakes that shall make known the interpretation to the king, and that thou mightest know the thoughts of thy heart.",
        "31Â¶Thou, O king, sawest, and behold a greatimage. This great image, whose brightnesswasexcellent,stood before thee; andtheform thereofwasterrible.",
        "32This imageâs headwasof fine gold, his breast and his arms of silver, his belly and his thighs of brass,",
        "33His legs of iron, his feet part of iron and part of clay.",
        "34Thou sawest till that astonewas cut outwithouthands, which smote the image upon his feetthat wereof iron and clay, and brake them to pieces.",
        "35Then was the iron, the clay, the brass, the silver, and the gold, broken to pieces together, and became like the chaff of the summer threshingfloors; and the wind carried them away, that noplacewas found for them: and thestonethat smote the image became a great mountain, and filled the whole earth.",
        "36Â¶Thisisthe dream; and we will tell the interpretation thereof before the king.",
        "37Thou, O king,arta king of kings: for the God of heaven hath given thee akingdom, power, and strength, and glory.",
        "38And wheresoever the children of men dwell, the beasts of the field and the fowls of the heaven hath he given into thine hand, and hath made thee ruler over them all. Thouartthisheadof gold.",
        "39And after thee shall arise anotherkingdominferior to thee, and another third kingdom of brass, which shall bearruleover all the earth.",
        "40And the fourthkingdomshall be strong as iron: forasmuch as iron breaketh in pieces and subdueth allthings:and as iron that breaketh all these, shall it break in pieces and bruise.",
        "41And whereas thou sawest the feet and toes, part of pottersâ clay, and part of iron, the kingdom shall be divided; but there shall be in it of the strength of theiron, forasmuch as thou sawest the iron mixed with miry clay.",
        "42Andasthe toes of the feetwerepart of iron, and part of clay,sothe kingdom shall be partly strong, and partly broken.",
        "43And whereas thou sawest iron mixed with miry clay, they shall mingle themselves with the seed of men: but they shall not cleave one to another, even as iron is not mixed with clay.",
        "44And in thedaysof thesekingsshall the God of heavensetup akingdom, which shall never bedestroyed: and thekingdomshall not be left to other people,butit shallbreakin pieces andconsumeall thesekingdoms, and it shall stand for ever.",
        "45Forasmuch as thou sawest that thestonewas cut out of the mountain without hands, and that it brake in pieces the iron, the brass, the clay, the silver, and the gold; the great God hath madeknownto the king what shall come to pass hereafter: and the dreamiscertain, and the interpretation thereof sure.",
        "46Â¶Then the king Nebuchadnezzar fell upon his face, andworshippedDaniel, and commanded that they should offer an oblation and sweet odours unto him.",
        "47The king answered unto Daniel, and said, Of a truthit is,that yourGodisaGodof gods, and aLordofkings, and a revealer of secrets, seeing thou couldest reveal this secret.",
        "48Then the king made Daniel agreatman, and gave him many great gifts, and made him ruler over the whole province of Babylon, and chief of the governors over all the wisemenof Babylon.",
        "49Then Daniel requested of the king, and hesetShadrach, Meshach, and Abed-nego, over the affairs of the province of Babylon: but Danielsatin the gate of the king."
      ],
      "full_text": "1And in the second year of the reign of Nebuchadnezzar Nebuchadnezzar dreameddreams, wherewith his spirit wastroubled, and his sleep brake from him. 2Then the king commanded to call themagicians, and the astrologers, and the sorcerers, and the Chaldeans, for to shew the king his dreams. So they came and stood before the king. 3And the king said unto them, I have dreamed a dream, and my spirit was troubled to know the dream. 4Then spake the Chaldeans to the king inSyriack, O king, live for ever: tell thy servants the dream, and we willshewthe interpretation. 5The king answered and said to the Chaldeans, The thing isgone from me: if ye will not make known unto me the dream, with the interpretation thereof, ye shall becutin pieces, and your houses shall be made a dunghill. 6But if ye shew the dream, and the interpretation thereof, ye shall receive of me gifts and rewards and great honour: therefore shew me the dream, and the interpretation thereof. 7They answered again and said, Let the king tell his servants the dream, and we will shew the interpretation of it. 8The king answered and said, I know of certainty that ye would gain the time, because ye see the thing is gone from me. 9But if ye will not make known unto me the dream,there is butone decree for you: for ye have prepared lying and corrupt words to speak before me,tillthe time be changed: therefore tell me the dream, and I shall know that ye can shew me the interpretation thereof. 10Â¶The Chaldeans answered before the king, and said, There is not a man upon the earth that can shew the kingâs matter: thereforethere isno king, lord, nor ruler,thatasked such things at any magician, or astrologer, or Chaldean. 11Andit isa rare thing that the king requireth, and there is none other that can shew it before the king, except thegods, whose dwelling is not with flesh. 12For this cause the king was angry and very furious, and commanded to destroy all the wisemenof Babylon. 13And the decree went forth that the wisemenshould be slain; and they sought Daniel and his fellows to be slain. 14Â¶Then Daniel answered with counsel and wisdom to Arioch the captain of the kingâs guard, which was gone forth to slay the wisemenof Babylon: 15He answered and said to Arioch the kingâs captain, Whyisthe decreesohastyfrom the king? ThenArioch made the thing known to Daniel. 16Then Daniel went in, and desired of the king that he would give him time, and that he would shew the king the interpretation. 17Then Daniel went to his house, and made the thing known toHananiah, Mishael, and Azariah, his companions: 18That they would desire mercies of the God of heaven concerning this secret; that Daniel and his fellows should not perish with the rest of the wisemenof Babylon. 19Â¶Then was thesecretrevealed unto Daniel in a nightvision. Then Daniel blessed the God of heaven. 20Daniel answered and said, Blessed be the name of God for ever and ever: forwisdomand might are his: 21And he changeth thetimesand theseasons: heremovethkings, and setteth up kings: he givethwisdomunto the wise, andknowledgeto them that know understanding: 22Herevealeththe deep and secret things: heknowethwhatisin the darkness, and thelightdwelleth with him. 23I thank thee, and praise thee, O thou God of my fathers, who hast given me wisdom and might, and hast made known unto me now what we desired of thee: for thou hastnowmade known unto us the kingâs matter. 24Â¶Therefore Daniel went in unto Arioch, whom the king had ordained to destroy the wisemenof Babylon: he went and said thus unto him; Destroy not the wisemenof Babylon: bring me in before the king, and I will shew unto the king the interpretation. 25Then Arioch brought in Daniel before the king in haste, and said thus unto him, I have found a man of the captives of Judah, that will make known unto the king the interpretation. 26The king answered and said to Daniel, whosenamewasBelteshazzar, Art thou able to makeknownunto me the dream which I have seen, and the interpretation thereof? 27Daniel answered in the presence of the king, and said, The secret which the king hath demanded cannot the wisemen,theastrologers, the magicians, the soothsayers, shew unto the king; 28But there is a God in heaven thatrevealethsecrets, and maketh known to the king Nebuchadnezzar what shall be in the latter days. Thydream, and the visions of thy head upon thy bed, are these; 29As for thee, O king, thy thoughts cameinto thy mindupon thy bed, what should come to pass hereafter: and he thatrevealethsecrets maketh known to thee what shall come to pass. 30But as for me, this secret is not revealed to me foranywisdomthat I have more than any living, butfortheirsakes that shall make known the interpretation to the king, and that thou mightest know the thoughts of thy heart. 31Â¶Thou, O king, sawest, and behold a greatimage. This great image, whose brightnesswasexcellent,stood before thee; andtheform thereofwasterrible. 32This imageâs headwasof fine gold, his breast and his arms of silver, his belly and his thighs of brass, 33His legs of iron, his feet part of iron and part of clay. 34Thou sawest till that astonewas cut outwithouthands, which smote the image upon his feetthat wereof iron and clay, and brake them to pieces. 35Then was the iron, the clay, the brass, the silver, and the gold, broken to pieces together, and became like the chaff of the summer threshingfloors; and the wind carried them away, that noplacewas found for them: and thestonethat smote the image became a great mountain, and filled the whole earth. 36Â¶Thisisthe dream; and we will tell the interpretation thereof before the king. 37Thou, O king,arta king of kings: for the God of heaven hath given thee akingdom, power, and strength, and glory. 38And wheresoever the children of men dwell, the beasts of the field and the fowls of the heaven hath he given into thine hand, and hath made thee ruler over them all. Thouartthisheadof gold. 39And after thee shall arise anotherkingdominferior to thee, and another third kingdom of brass, which shall bearruleover all the earth. 40And the fourthkingdomshall be strong as iron: forasmuch as iron breaketh in pieces and subdueth allthings:and as iron that breaketh all these, shall it break in pieces and bruise. 41And whereas thou sawest the feet and toes, part of pottersâ clay, and part of iron, the kingdom shall be divided; but there shall be in it of the strength of theiron, forasmuch as thou sawest the iron mixed with miry clay. 42Andasthe toes of the feetwerepart of iron, and part of clay,sothe kingdom shall be partly strong, and partly broken. 43And whereas thou sawest iron mixed with miry clay, they shall mingle themselves with the seed of men: but they shall not cleave one to another, even as iron is not mixed with clay. 44And in thedaysof thesekingsshall the God of heavensetup akingdom, which shall never bedestroyed: and thekingdomshall not be left to other people,butit shallbreakin pieces andconsumeall thesekingdoms, and it shall stand for ever. 45Forasmuch as thou sawest that thestonewas cut out of the mountain without hands, and that it brake in pieces the iron, the brass, the clay, the silver, and the gold; the great God hath madeknownto the king what shall come to pass hereafter: and the dreamiscertain, and the interpretation thereof sure. 46Â¶Then the king Nebuchadnezzar fell upon his face, andworshippedDaniel, and commanded that they should offer an oblation and sweet odours unto him. 47The king answered unto Daniel, and said, Of a truthit is,that yourGodisaGodof gods, and aLordofkings, and a revealer of secrets, seeing thou couldest reveal this secret. 48Then the king made Daniel agreatman, and gave him many great gifts, and made him ruler over the whole province of Babylon, and chief of the governors over all the wisemenof Babylon. 49Then Daniel requested of the king, and hesetShadrach, Meshach, and Abed-nego, over the affairs of the province of Babylon: but Danielsatin the gate of the king."
    },
    {
      "reference": "Daniel 3",
      "title": "Daniel 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/dan/3?lang=eng",
      "summary": "Nebuchadnezzar creates a golden image and commands all men to worship itâShadrach, Meshach, and Abed-nego refuse and are cast into the fiery furnaceâThey are preserved and come out unharmed.",
      "verses": [
        "1Nebuchadnezzar the king made an image of gold, whose heightwasthreescore cubits,andthe breadth thereof six cubits: he set it up in the plain of Dura, in the province of Babylon.",
        "2Then Nebuchadnezzar the king sent to gather together the princes, the governors, and the captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, to come to the dedication of the image which Nebuchadnezzar the king had set up.",
        "3Then the princes, the governors, and captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, were gathered together unto the dedication of the image that Nebuchadnezzar the king had set up; and they stood before the image that Nebuchadnezzar had set up.",
        "4Then an herald cried aloud, To you it is commanded, O people, nations, andlanguages,",
        "5Thatat what time ye hear the sound of the cornet, flute,harp,sackbut, psaltery,dulcimer, and all kinds of musick, ye fall down and worship the golden image that Nebuchadnezzar the king hath set up:",
        "6And whoso falleth not down and worshippeth shall the same hour becastinto the midst of aburningfiery furnace.",
        "7Therefore at that time, when all the people heard the sound of the cornet, flute, harp, sackbut, psaltery, and all kinds of musick, all the people, the nations, and the languages, fell downandworshipped the golden image that Nebuchadnezzar the king had set up.",
        "8Â¶Wherefore at that time certain Chaldeans came near, and accused the Jews.",
        "9They spake and said to the king Nebuchadnezzar, O king, live for ever.",
        "10Thou, O king, hast made a decree, that every man that shall hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, shall fall down and worship the golden image:",
        "11And whoso falleth not down and worshippeth,thathe should be cast into the midst of a burning fiery furnace.",
        "12There are certain Jews whom thou hastsetover the affairs of the province of Babylon, Shadrach, Meshach, and Abed-nego; these men, O king, have not regarded thee: they serve not thy gods, nor worship the golden image which thou hast set up.",
        "13Â¶Then Nebuchadnezzar inhisrage and fury commanded to bring Shadrach, Meshach, and Abed-nego. Then they brought these men before the king.",
        "14Nebuchadnezzar spake and said unto them,Is ittrue, O Shadrach, Meshach, and Abed-nego, do not yeserve my gods, nor worship the golden image which I have set up?",
        "15Now if ye be ready that at what time ye hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, ye fall down and worship the image which I have made;well:but if ye worship not, ye shall be cast the same hour into the midst of a burning fiery furnace; and whoisthat God that shall deliver you out of my hands?",
        "16Shadrach, Meshach, and Abed-nego, answered and said to the king, O Nebuchadnezzar, wearenotcarefulto answer thee in this matter.",
        "17If it beso,our God whom we serve is able todeliverus from the burning fiery furnace, and he will deliverusout of thine hand, O king.",
        "18But if not, be it known unto thee, O king, that we will notservethy gods, nor worship the golden image which thou hast set up.",
        "19Â¶Then was Nebuchadnezzar full of fury, and theform of his visagewas changed against Shadrach, Meshach, and Abed-nego:thereforehe spake, and commanded that they should heat the furnace one seven times more than it was wont to be heated.",
        "20And he commanded the most mighty men thatwerein his army to bind Shadrach, Meshach, and Abed-nego,andto casttheminto the burning fiery furnace.",
        "21Then these men were bound in their coats, their hosen, and their hats, and theirothergarments, and were cast into the midst of the burning fiery furnace.",
        "22Therefore because the kingâs commandment was urgent, and the furnace exceeding hot, the flame of the fire slew those men that took up Shadrach, Meshach, and Abed-nego.",
        "23And these three men, Shadrach, Meshach, and Abed-nego, fell down bound into the midst of the burning fiery furnace.",
        "24Then Nebuchadnezzar the king was astonied, and rose up in haste,andspake, and said unto his counsellors, Did not we cast three men bound into the midst of the fire? They answered and said unto the king, True, O king.",
        "25He answered and said, Lo, I see four men loose, walking in the midst of the fire, and they have nohurt; and the form of the fourth is like the Son of God.",
        "26Â¶Then Nebuchadnezzar came near to the mouth of the burning fiery furnace,andspake, and said, Shadrach, Meshach, and Abed-nego, ye servants of the most high God, come forth, and comehither.Then Shadrach, Meshach, and Abed-nego, came forth of the midst of the fire.",
        "27And the princes, governors, and captains, and the kingâs counsellors, being gathered together, saw these men, upon whose bodies thefirehad no power, nor was an hair of their head singed, neither were their coatschanged, nor the smell of fire had passed on them.",
        "28ThenNebuchadnezzar spake, and said, Blessedbethe God of Shadrach, Meshach, and Abed-nego, who hath sent hisangel, and delivered his servants thattrustedin him, andhavechanged the kingâs word, and yielded their bodies, that they might not serve nor worship any god, except their own God.",
        "29Therefore I make a decree, That every people, nation, and language, which speak any thing amiss against the God of Shadrach, Meshach, and Abed-nego, shall becutin pieces, and their houses shall be made a dunghill: because there is no other God that candeliverafter this sort.",
        "30Then the kingpromotedShadrach, Meshach, and Abed-nego, in the province of Babylon."
      ],
      "full_text": "1Nebuchadnezzar the king made an image of gold, whose heightwasthreescore cubits,andthe breadth thereof six cubits: he set it up in the plain of Dura, in the province of Babylon. 2Then Nebuchadnezzar the king sent to gather together the princes, the governors, and the captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, to come to the dedication of the image which Nebuchadnezzar the king had set up. 3Then the princes, the governors, and captains, the judges, the treasurers, the counsellors, the sheriffs, and all the rulers of the provinces, were gathered together unto the dedication of the image that Nebuchadnezzar the king had set up; and they stood before the image that Nebuchadnezzar had set up. 4Then an herald cried aloud, To you it is commanded, O people, nations, andlanguages, 5Thatat what time ye hear the sound of the cornet, flute,harp,sackbut, psaltery,dulcimer, and all kinds of musick, ye fall down and worship the golden image that Nebuchadnezzar the king hath set up: 6And whoso falleth not down and worshippeth shall the same hour becastinto the midst of aburningfiery furnace. 7Therefore at that time, when all the people heard the sound of the cornet, flute, harp, sackbut, psaltery, and all kinds of musick, all the people, the nations, and the languages, fell downandworshipped the golden image that Nebuchadnezzar the king had set up. 8Â¶Wherefore at that time certain Chaldeans came near, and accused the Jews. 9They spake and said to the king Nebuchadnezzar, O king, live for ever. 10Thou, O king, hast made a decree, that every man that shall hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, shall fall down and worship the golden image: 11And whoso falleth not down and worshippeth,thathe should be cast into the midst of a burning fiery furnace. 12There are certain Jews whom thou hastsetover the affairs of the province of Babylon, Shadrach, Meshach, and Abed-nego; these men, O king, have not regarded thee: they serve not thy gods, nor worship the golden image which thou hast set up. 13Â¶Then Nebuchadnezzar inhisrage and fury commanded to bring Shadrach, Meshach, and Abed-nego. Then they brought these men before the king. 14Nebuchadnezzar spake and said unto them,Is ittrue, O Shadrach, Meshach, and Abed-nego, do not yeserve my gods, nor worship the golden image which I have set up? 15Now if ye be ready that at what time ye hear the sound of the cornet, flute, harp, sackbut, psaltery, and dulcimer, and all kinds of musick, ye fall down and worship the image which I have made;well:but if ye worship not, ye shall be cast the same hour into the midst of a burning fiery furnace; and whoisthat God that shall deliver you out of my hands? 16Shadrach, Meshach, and Abed-nego, answered and said to the king, O Nebuchadnezzar, wearenotcarefulto answer thee in this matter. 17If it beso,our God whom we serve is able todeliverus from the burning fiery furnace, and he will deliverusout of thine hand, O king. 18But if not, be it known unto thee, O king, that we will notservethy gods, nor worship the golden image which thou hast set up. 19Â¶Then was Nebuchadnezzar full of fury, and theform of his visagewas changed against Shadrach, Meshach, and Abed-nego:thereforehe spake, and commanded that they should heat the furnace one seven times more than it was wont to be heated. 20And he commanded the most mighty men thatwerein his army to bind Shadrach, Meshach, and Abed-nego,andto casttheminto the burning fiery furnace. 21Then these men were bound in their coats, their hosen, and their hats, and theirothergarments, and were cast into the midst of the burning fiery furnace. 22Therefore because the kingâs commandment was urgent, and the furnace exceeding hot, the flame of the fire slew those men that took up Shadrach, Meshach, and Abed-nego. 23And these three men, Shadrach, Meshach, and Abed-nego, fell down bound into the midst of the burning fiery furnace. 24Then Nebuchadnezzar the king was astonied, and rose up in haste,andspake, and said unto his counsellors, Did not we cast three men bound into the midst of the fire? They answered and said unto the king, True, O king. 25He answered and said, Lo, I see four men loose, walking in the midst of the fire, and they have nohurt; and the form of the fourth is like the Son of God. 26Â¶Then Nebuchadnezzar came near to the mouth of the burning fiery furnace,andspake, and said, Shadrach, Meshach, and Abed-nego, ye servants of the most high God, come forth, and comehither.Then Shadrach, Meshach, and Abed-nego, came forth of the midst of the fire. 27And the princes, governors, and captains, and the kingâs counsellors, being gathered together, saw these men, upon whose bodies thefirehad no power, nor was an hair of their head singed, neither were their coatschanged, nor the smell of fire had passed on them. 28ThenNebuchadnezzar spake, and said, Blessedbethe God of Shadrach, Meshach, and Abed-nego, who hath sent hisangel, and delivered his servants thattrustedin him, andhavechanged the kingâs word, and yielded their bodies, that they might not serve nor worship any god, except their own God. 29Therefore I make a decree, That every people, nation, and language, which speak any thing amiss against the God of Shadrach, Meshach, and Abed-nego, shall becutin pieces, and their houses shall be made a dunghill: because there is no other God that candeliverafter this sort. 30Then the kingpromotedShadrach, Meshach, and Abed-nego, in the province of Babylon."
    },
    {
      "reference": "Daniel 4",
      "title": "Daniel 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/dan/4?lang=eng",
      "summary": "Daniel interprets Nebuchadnezzarâs dream of the great tree, describing the kingâs fall and madnessâThe king learns that the Most High rules and sets the basest of men over earthly kingdoms.",
      "verses": [
        "1Nebuchadnezzar the king, unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.",
        "2I thought it good to shew the signs and wonders that the high God hath wrought toward me.",
        "3How greatarehis signs! and how mightyarehis wonders! hiskingdomisan everlasting kingdom, and his dominionisfrom generation to generation.",
        "4Â¶I Nebuchadnezzar was at rest in mine house, andflourishingin my palace:",
        "5I saw a dream which made me afraid, and the thoughts upon my bed and the visions of my head troubled me.",
        "6Therefore made I a decree to bring in all thewisemenof Babylon before me, that they might make known unto me the interpretation of the dream.",
        "7Then came in themagicians, the astrologers, the Chaldeans, and the soothsayers: and I told the dream before them; but they did not make known unto me the interpretation thereof.",
        "8Â¶But at the last Daniel came in before me, whose namewasBelteshazzar, according to the name of my god, and in whomisthe spirit of the holygods: and before him I told the dream,saying,",
        "9O Belteshazzar, master of the magicians, because I know that the spirit of the holy godsisin thee, and no secret troubleth thee, tell me the visions of my dream that I have seen, and the interpretation thereof.",
        "10Thuswerethe visions of mine head in my bed; I saw, and behold a tree in the midst of the earth, and the height thereofwasgreat.",
        "11The tree grew, and was strong, and the height thereof reached unto heaven, and the sight thereof to the end of all the earth:",
        "12The leaves thereofwerefair, and the fruit thereof much, and in itwasmeat for all: the beasts of the field had shadow under it, and the fowls of the heaven dwelt in the boughs thereof, and all flesh was fed of it.",
        "13I saw in the visions of my head upon my bed, and, behold, a watcher and an holy one came down from heaven;",
        "14He cried aloud, and said thus, Hew down the tree, and cut off his branches, shake off his leaves, and scatter his fruit: let the beasts get away from under it, and the fowls from his branches:",
        "15Nevertheless leave the stump of his roots in the earth, even with a band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts in the grass of the earth:",
        "16Let his heart be changed from manâs, and let a beastâs heart be given unto him; and let seventimespass over him.",
        "17This matterisby the decree of the watchers, and the demand by the word of the holy ones: to the intent that the living may know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will, and setteth up over it thebasestof men.",
        "18This dream I king Nebuchadnezzar have seen. Now thou, O Belteshazzar, declare the interpretation thereof, forasmuch as all the wisemenof my kingdom are not able to make known unto me theinterpretation: but thouartable; for thespiritof theholygodsisin thee.",
        "19Â¶Then Daniel, whose namewasBelteshazzar, was astonied for one hour, and his thoughts troubled him. The king spake, and said, Belteshazzar, let not the dream, or the interpretation thereof, trouble thee. Belteshazzar answered and said, My lord, the dreambeto them that hate thee, and the interpretation thereof to thine enemies.",
        "20The tree that thou sawest, which grew, and was strong, whose height reached unto the heaven, and the sight thereof to all the earth;",
        "21Whose leaveswerefair, and the fruit thereof much, and in itwasmeat for all; under which the beasts of the field dwelt, and upon whose branches the fowls of the heaven had their habitation:",
        "22Itisthou, O king, that art grown and become strong: for thy greatness is grown, and reacheth unto heaven, and thydominionto the end of the earth.",
        "23And whereas the king saw a watcher and an holy one coming down from heaven, and saying, Hew the tree down, and destroy it; yet leave the stump of the roots thereof in the earth, even with a band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts of the field, till seven times pass over him;",
        "24Thisisthe interpretation, O king, and thisisthe decree of the most High, which is come upon my lord the king:",
        "25That they shall drive thee from men, and thy dwelling shall be with the beasts of the field, and they shall make thee to eat grass as oxen, and they shall wet thee with the dew of heaven, and seven times shall pass over thee, till thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.",
        "26And whereas they commanded to leave the stump of the tree roots; thy kingdom shall be sure unto thee, after that thou shalt have known that the heavens do rule.",
        "27Wherefore, O king, let my counsel be acceptable unto thee, and break off thy sins by righteousness, and thine iniquities by shewingmercyto the poor;ifit may be a lengthening of thy tranquillity.",
        "28Â¶All this came upon the king Nebuchadnezzar.",
        "29At the end of twelve months he walked in the palace of the kingdom of Babylon.",
        "30The king spake, and said, Is not this great Babylon, that I have builtforthe house of the kingdom by the might of my power, and for the honour of my majesty?",
        "31While the wordwasin the kingâs mouth, there fell a voice from heaven,saying,O king Nebuchadnezzar, to thee it is spoken; The kingdom isdepartedfrom thee.",
        "32And they shall drive thee from men, and thy dwellingshall bewith the beasts of the field: they shall make thee to eat grass as oxen, and seven times shall pass over thee, until thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.",
        "33The same hour was the thing fulfilled upon Nebuchadnezzar: and he was driven from men, and did eat grass as oxen, and his body was wet with the dew of heaven, till his hairs were grown like eaglesâfeathers,and his nails like birdsâclaws.",
        "34And at the end ofthe daysI Nebuchadnezzar lifted up mine eyes unto heaven, and mine understanding returned unto me, and I blessed the most High, and I praised and honoured him that liveth for ever, whose dominionisan everlasting dominion, and hiskingdomisfrom generation to generation:",
        "35And all the inhabitants of the eartharereputed asnothing: and he doeth according to hiswillin the army of heaven, andamongthe inhabitants of the earth: and none canstayhis hand, or say unto him, What doest thou?",
        "36At the same time my reason returned unto me; and for the glory of my kingdom, mine honour and brightness returned unto me; and my counsellors and my lords sought unto me; and I was established in my kingdom, and excellent majesty was added unto me.",
        "37Now I Nebuchadnezzar praise and extol and honour the King of heaven, all whose worksaretruth, and his waysjudgment: and those thatwalkin pride he is able toabase."
      ],
      "full_text": "1Nebuchadnezzar the king, unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you. 2I thought it good to shew the signs and wonders that the high God hath wrought toward me. 3How greatarehis signs! and how mightyarehis wonders! hiskingdomisan everlasting kingdom, and his dominionisfrom generation to generation. 4Â¶I Nebuchadnezzar was at rest in mine house, andflourishingin my palace: 5I saw a dream which made me afraid, and the thoughts upon my bed and the visions of my head troubled me. 6Therefore made I a decree to bring in all thewisemenof Babylon before me, that they might make known unto me the interpretation of the dream. 7Then came in themagicians, the astrologers, the Chaldeans, and the soothsayers: and I told the dream before them; but they did not make known unto me the interpretation thereof. 8Â¶But at the last Daniel came in before me, whose namewasBelteshazzar, according to the name of my god, and in whomisthe spirit of the holygods: and before him I told the dream,saying, 9O Belteshazzar, master of the magicians, because I know that the spirit of the holy godsisin thee, and no secret troubleth thee, tell me the visions of my dream that I have seen, and the interpretation thereof. 10Thuswerethe visions of mine head in my bed; I saw, and behold a tree in the midst of the earth, and the height thereofwasgreat. 11The tree grew, and was strong, and the height thereof reached unto heaven, and the sight thereof to the end of all the earth: 12The leaves thereofwerefair, and the fruit thereof much, and in itwasmeat for all: the beasts of the field had shadow under it, and the fowls of the heaven dwelt in the boughs thereof, and all flesh was fed of it. 13I saw in the visions of my head upon my bed, and, behold, a watcher and an holy one came down from heaven; 14He cried aloud, and said thus, Hew down the tree, and cut off his branches, shake off his leaves, and scatter his fruit: let the beasts get away from under it, and the fowls from his branches: 15Nevertheless leave the stump of his roots in the earth, even with a band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts in the grass of the earth: 16Let his heart be changed from manâs, and let a beastâs heart be given unto him; and let seventimespass over him. 17This matterisby the decree of the watchers, and the demand by the word of the holy ones: to the intent that the living may know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will, and setteth up over it thebasestof men. 18This dream I king Nebuchadnezzar have seen. Now thou, O Belteshazzar, declare the interpretation thereof, forasmuch as all the wisemenof my kingdom are not able to make known unto me theinterpretation: but thouartable; for thespiritof theholygodsisin thee. 19Â¶Then Daniel, whose namewasBelteshazzar, was astonied for one hour, and his thoughts troubled him. The king spake, and said, Belteshazzar, let not the dream, or the interpretation thereof, trouble thee. Belteshazzar answered and said, My lord, the dreambeto them that hate thee, and the interpretation thereof to thine enemies. 20The tree that thou sawest, which grew, and was strong, whose height reached unto the heaven, and the sight thereof to all the earth; 21Whose leaveswerefair, and the fruit thereof much, and in itwasmeat for all; under which the beasts of the field dwelt, and upon whose branches the fowls of the heaven had their habitation: 22Itisthou, O king, that art grown and become strong: for thy greatness is grown, and reacheth unto heaven, and thydominionto the end of the earth. 23And whereas the king saw a watcher and an holy one coming down from heaven, and saying, Hew the tree down, and destroy it; yet leave the stump of the roots thereof in the earth, even with a band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, andlethis portionbewith the beasts of the field, till seven times pass over him; 24Thisisthe interpretation, O king, and thisisthe decree of the most High, which is come upon my lord the king: 25That they shall drive thee from men, and thy dwelling shall be with the beasts of the field, and they shall make thee to eat grass as oxen, and they shall wet thee with the dew of heaven, and seven times shall pass over thee, till thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will. 26And whereas they commanded to leave the stump of the tree roots; thy kingdom shall be sure unto thee, after that thou shalt have known that the heavens do rule. 27Wherefore, O king, let my counsel be acceptable unto thee, and break off thy sins by righteousness, and thine iniquities by shewingmercyto the poor;ifit may be a lengthening of thy tranquillity. 28Â¶All this came upon the king Nebuchadnezzar. 29At the end of twelve months he walked in the palace of the kingdom of Babylon. 30The king spake, and said, Is not this great Babylon, that I have builtforthe house of the kingdom by the might of my power, and for the honour of my majesty? 31While the wordwasin the kingâs mouth, there fell a voice from heaven,saying,O king Nebuchadnezzar, to thee it is spoken; The kingdom isdepartedfrom thee. 32And they shall drive thee from men, and thy dwellingshall bewith the beasts of the field: they shall make thee to eat grass as oxen, and seven times shall pass over thee, until thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will. 33The same hour was the thing fulfilled upon Nebuchadnezzar: and he was driven from men, and did eat grass as oxen, and his body was wet with the dew of heaven, till his hairs were grown like eaglesâfeathers,and his nails like birdsâclaws. 34And at the end ofthe daysI Nebuchadnezzar lifted up mine eyes unto heaven, and mine understanding returned unto me, and I blessed the most High, and I praised and honoured him that liveth for ever, whose dominionisan everlasting dominion, and hiskingdomisfrom generation to generation: 35And all the inhabitants of the eartharereputed asnothing: and he doeth according to hiswillin the army of heaven, andamongthe inhabitants of the earth: and none canstayhis hand, or say unto him, What doest thou? 36At the same time my reason returned unto me; and for the glory of my kingdom, mine honour and brightness returned unto me; and my counsellors and my lords sought unto me; and I was established in my kingdom, and excellent majesty was added unto me. 37Now I Nebuchadnezzar praise and extol and honour the King of heaven, all whose worksaretruth, and his waysjudgment: and those thatwalkin pride he is able toabase."
    },
    {
      "reference": "Daniel 5",
      "title": "Daniel 5",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/dan/5?lang=eng",
      "summary": "Belshazzar and his revelers drink from the vessels of the templeâA hand writes upon the wall, telling of Belshazzarâs downfallâDaniel interprets the words and reproves the king for pride and idolatryâThat night Babylon is conquered.",
      "verses": [
        "1Belshazzar the king made a great feast to a thousand of his lords, and drank wine before the thousand.",
        "2Belshazzar, whiles he tasted the wine, commanded to bring the golden and silvervesselswhich his father Nebuchadnezzar had taken out of the temple whichwasin Jerusalem; that the king, and his princes, his wives, and his concubines, might drink therein.",
        "3Then they brought the golden vessels that were taken out of the temple of the house of God whichwasat Jerusalem; and the king, and his princes, his wives, and his concubines, drank in them.",
        "4They drank wine, and praised the gods of gold, and of silver, of brass, of iron, of wood, and of stone.",
        "5Â¶In the same hour came forth fingers of a manâs hand, and wroteover against the candlestickupon the plaster of the wall of the kingâs palace: and the king saw the part of thehandthat wrote.",
        "6Then the kingâscountenancewas changed, and his thoughtstroubledhim, so thatthe jointsof his loins were loosed, and his knees smote one against another.",
        "7The king cried aloud to bring in theastrologers, the Chaldeans, and the soothsayers.Andthe king spake, and said to the wisemenof Babylon, Whosoever shall read this writing, and shew me the interpretation thereof, shall be clothed with scarlet, andhavea chain of gold about his neck, and shall be the third ruler in the kingdom.",
        "8Then came in all the kingâs wisemen:but they could not read the writing, nor make known to the king the interpretation thereof.",
        "9Then was king Belshazzar greatly troubled, and his countenance was changed in him, and his lords were astonied.",
        "10Â¶Nowthe queen, by reason of the words of the king and his lords, came into the banquet house:andthe queen spake and said, O king, live for ever: let not thy thoughts trouble thee, nor let thy countenance be changed:",
        "11There is a man in thy kingdom, in whomisthespiritof the holy gods; and in the days of thy father light and understanding and wisdom, like the wisdom of the gods, was found in him; whom the king Nebuchadnezzar thy father, the king,I say,thy father, made master of the magicians, astrologers, Chaldeans,andsoothsayers;",
        "12Forasmuch as an excellent spirit, and knowledge, and understanding, interpreting of dreams, and shewing of hard sentences, and dissolving of doubts, were found in the same Daniel, whom the kingnamedBelteshazzar: now let Daniel be called, and he will shew the interpretation.",
        "13Then was Daniel brought in before the king.Andthe king spake and said unto Daniel,Artthou that Daniel, whichartof the children of the captivity of Judah, whom the king my father brought out of Jewry?",
        "14I have even heard of thee, that the spirit of thegodsisin thee, andthatlight and understanding and excellent wisdom is found in thee.",
        "15And now the wisemen,theastrologers, have been brought in before me, that they should read this writing, and make known unto me the interpretation thereof: but they could not shew the interpretation of the thing:",
        "16And I have heard of thee, that thou canst make interpretations, and dissolve doubts: now if thou canst read thewriting, and makeknownto me the interpretation thereof, thou shalt be clothed with scarlet, andhavea chain of gold about thy neck, and shalt be the third ruler in the kingdom.",
        "17Â¶Then Daniel answered and said before the king, Let thygiftsbe to thyself, and give thy rewards to another; yet I will read the writing unto the king, and make known to him the interpretation.",
        "18O thou king, the most high God gave Nebuchadnezzar thy father a kingdom, and majesty, and glory, and honour:",
        "19And for the majesty that he gave him, all people, nations, and languages, trembled and feared before him: whom he would he slew; and whom he would he kept alive; and whom he would he set up; and whom he would he put down.",
        "20But when hisheartwas lifted up, and hismindhardened in pride, he wasdeposedfrom his kingly throne, and they took his glory from him:",
        "21And he was drivenfromthe sons of men; and his heart was made like the beasts, and his dwellingwaswith the wild asses: they fed him with grass like oxen, and his body was wet with the dew of heaven; till he knew that the most high God ruled in the kingdom of men, andthathe appointeth over it whomsoever he will.",
        "22And thou his son, O Belshazzar, hast not humbled thine heart, though thou knewest all this;",
        "23But hast lifted up thyself against the Lord of heaven; and they have brought the vessels of his house before thee, and thou, and thy lords, thy wives, and thy concubines, have drunk wine in them; and thou hast praised thegodsof silver, and gold, of brass, iron, wood, and stone, which see not, nor hear, nor know: and the God in whose hand thy breathis,and whoseareall thy ways, hast thou not glorified:",
        "24Then was the part of the hand sent from him; and this writing was written.",
        "25Â¶And thisisthe writing that was written,Mene, Mene, Tekel, Upharsin.",
        "26Thisisthe interpretation of the thing:Mene; God hathnumberedthy kingdom, and finished it.",
        "27Tekel; Thou artweighedin the balances, and art found wanting.",
        "28Peres; Thy kingdom is divided, and given to the Medes andPersians.",
        "29Then commanded Belshazzar, and theyclothedDaniel with scarlet, andputa chain of gold about his neck, and made a proclamation concerning him, that he should be the third ruler in the kingdom.",
        "30Â¶In that night was Belshazzar the king of theChaldeansslain.",
        "31AndDariusthe Median took the kingdom,beingabout threescore and two years old."
      ],
      "full_text": "1Belshazzar the king made a great feast to a thousand of his lords, and drank wine before the thousand. 2Belshazzar, whiles he tasted the wine, commanded to bring the golden and silvervesselswhich his father Nebuchadnezzar had taken out of the temple whichwasin Jerusalem; that the king, and his princes, his wives, and his concubines, might drink therein. 3Then they brought the golden vessels that were taken out of the temple of the house of God whichwasat Jerusalem; and the king, and his princes, his wives, and his concubines, drank in them. 4They drank wine, and praised the gods of gold, and of silver, of brass, of iron, of wood, and of stone. 5Â¶In the same hour came forth fingers of a manâs hand, and wroteover against the candlestickupon the plaster of the wall of the kingâs palace: and the king saw the part of thehandthat wrote. 6Then the kingâscountenancewas changed, and his thoughtstroubledhim, so thatthe jointsof his loins were loosed, and his knees smote one against another. 7The king cried aloud to bring in theastrologers, the Chaldeans, and the soothsayers.Andthe king spake, and said to the wisemenof Babylon, Whosoever shall read this writing, and shew me the interpretation thereof, shall be clothed with scarlet, andhavea chain of gold about his neck, and shall be the third ruler in the kingdom. 8Then came in all the kingâs wisemen:but they could not read the writing, nor make known to the king the interpretation thereof. 9Then was king Belshazzar greatly troubled, and his countenance was changed in him, and his lords were astonied. 10Â¶Nowthe queen, by reason of the words of the king and his lords, came into the banquet house:andthe queen spake and said, O king, live for ever: let not thy thoughts trouble thee, nor let thy countenance be changed: 11There is a man in thy kingdom, in whomisthespiritof the holy gods; and in the days of thy father light and understanding and wisdom, like the wisdom of the gods, was found in him; whom the king Nebuchadnezzar thy father, the king,I say,thy father, made master of the magicians, astrologers, Chaldeans,andsoothsayers; 12Forasmuch as an excellent spirit, and knowledge, and understanding, interpreting of dreams, and shewing of hard sentences, and dissolving of doubts, were found in the same Daniel, whom the kingnamedBelteshazzar: now let Daniel be called, and he will shew the interpretation. 13Then was Daniel brought in before the king.Andthe king spake and said unto Daniel,Artthou that Daniel, whichartof the children of the captivity of Judah, whom the king my father brought out of Jewry? 14I have even heard of thee, that the spirit of thegodsisin thee, andthatlight and understanding and excellent wisdom is found in thee. 15And now the wisemen,theastrologers, have been brought in before me, that they should read this writing, and make known unto me the interpretation thereof: but they could not shew the interpretation of the thing: 16And I have heard of thee, that thou canst make interpretations, and dissolve doubts: now if thou canst read thewriting, and makeknownto me the interpretation thereof, thou shalt be clothed with scarlet, andhavea chain of gold about thy neck, and shalt be the third ruler in the kingdom. 17Â¶Then Daniel answered and said before the king, Let thygiftsbe to thyself, and give thy rewards to another; yet I will read the writing unto the king, and make known to him the interpretation. 18O thou king, the most high God gave Nebuchadnezzar thy father a kingdom, and majesty, and glory, and honour: 19And for the majesty that he gave him, all people, nations, and languages, trembled and feared before him: whom he would he slew; and whom he would he kept alive; and whom he would he set up; and whom he would he put down. 20But when hisheartwas lifted up, and hismindhardened in pride, he wasdeposedfrom his kingly throne, and they took his glory from him: 21And he was drivenfromthe sons of men; and his heart was made like the beasts, and his dwellingwaswith the wild asses: they fed him with grass like oxen, and his body was wet with the dew of heaven; till he knew that the most high God ruled in the kingdom of men, andthathe appointeth over it whomsoever he will. 22And thou his son, O Belshazzar, hast not humbled thine heart, though thou knewest all this; 23But hast lifted up thyself against the Lord of heaven; and they have brought the vessels of his house before thee, and thou, and thy lords, thy wives, and thy concubines, have drunk wine in them; and thou hast praised thegodsof silver, and gold, of brass, iron, wood, and stone, which see not, nor hear, nor know: and the God in whose hand thy breathis,and whoseareall thy ways, hast thou not glorified: 24Then was the part of the hand sent from him; and this writing was written. 25Â¶And thisisthe writing that was written,Mene, Mene, Tekel, Upharsin. 26Thisisthe interpretation of the thing:Mene; God hathnumberedthy kingdom, and finished it. 27Tekel; Thou artweighedin the balances, and art found wanting. 28Peres; Thy kingdom is divided, and given to the Medes andPersians. 29Then commanded Belshazzar, and theyclothedDaniel with scarlet, andputa chain of gold about his neck, and made a proclamation concerning him, that he should be the third ruler in the kingdom. 30Â¶In that night was Belshazzar the king of theChaldeansslain. 31AndDariusthe Median took the kingdom,beingabout threescore and two years old."
    },
    {
      "reference": "Daniel 6",
      "title": "Daniel 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/dan/6?lang=eng",
      "summary": "Darius makes Daniel the first of his presidentsâDaniel worships the Lord in defiance of a decree of DariusâHe is cast into the den of lionsâHis faith saves him, and Darius decrees that all people are to revere the God of Daniel.",
      "verses": [
        "1It pleased Darius to set over the kingdom an hundred and twenty princes, which should be over the whole kingdom;",
        "2And over these three presidents; of whom Danielwasfirst: that the princes might give accounts unto them, and the king should have no damage.",
        "3Then this Daniel was preferred above the presidents and princes, because an excellentspiritwasin him; and the king thought to set himoverthe whole realm.",
        "4Â¶Then the presidents and princes sought to findoccasionagainst Daniel concerning the kingdom; but they could find none occasion nor fault; forasmuch as hewasfaithful, neither was there any error or fault found in him.",
        "5Then said these men, We shall not find any occasion against this Daniel, except we finditagainst him concerning the law of his God.",
        "6Then these presidents and princes assembled together to the king, and said thus unto him, King Darius, live for ever.",
        "7All the presidents of the kingdom, the governors, and the princes, the counsellors, and the captains, have consulted together to establish a royal statute, and to make a firm decree, that whosoever shall ask a petition of any God or man for thirty days, save of thee, O king, he shall becastinto the den of lions.",
        "8Now, O king, establish the decree, and sign the writing, that it be not changed, according to the law of the Medes and Persians, whichaltereth not.",
        "9Wherefore king Darius signed the writing and the decree.",
        "10Â¶Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber towardJerusalem, he kneeled upon his kneesthreetimes a day, andprayed, and gavethanksbefore his God, as he did aforetime.",
        "11Then these men assembled, and found Daniel praying and making supplication before his God.",
        "12Then they came near, and spake before the king concerning the kingâs decree; Hast thou not signed a decree, that every man that shall aska petitionof any God or man within thirty days, save of thee, O king, shall be cast into the den of lions? The king answered and said, The thingistrue, according to the law of the Medes and Persians, which altereth not.",
        "13Then answered they and said before the king, ThatDaniel, whichisof the children of the captivity of Judah, regardeth not thee, O king, nor the decree that thou hast signed, but maketh his petition three times a day.",
        "14Then the king, when he heardthesewords, was sore displeased with himself, and sethisheart onDaniel to deliver him: and he laboured till the going down of the sun to deliver him.",
        "15Then these men assembled unto the king, and said unto the king, Know, O king, that the law of the Medes and Persiansis,That no decree nor statute which the king establisheth may be changed.",
        "16Then the king commanded, and they brought Daniel, and casthiminto the den of lions.Nowthe king spake and said unto Daniel, Thy God whom thou servest continually, he will deliver thee.",
        "17And a stone was brought, and laid upon the mouth of the den; and the kingsealedit with his own signet, and with the signet of his lords; that the purpose might not be changed concerning Daniel.",
        "18Â¶Then the king went to his palace, and passed the night fasting: neither were instruments of musick brought before him: and his sleep went from him.",
        "19Then the king arose very early in the morning, and went in haste unto the den of lions.",
        "20And when he came to the den, he cried with a lamentable voice unto Daniel:andthe king spake and said to Daniel, O Daniel,servantof the living God, is thy God, whom thou servest continually, able to deliver thee from the lions?",
        "21Then said Daniel unto the king, O king, live for ever.",
        "22My God hath sent hisangel, and hath shut thelionsâmouths, that they have not hurt me: forasmuch as before him innocency was found in me; and also before thee, O king, have I done no hurt.",
        "23Then was the king exceeding glad for him, and commanded that they should take Daniel up out of the den. So Daniel was taken up out of the den, and no manner of hurt was found upon him, because hebelievedin his God.",
        "24Â¶And the king commanded, and they brought those men which had accused Daniel, and they casttheminto the den of lions, them, their children, and their wives; and the lionshadthe mastery of them, and brake all their bones in pieces or ever they came at the bottom of the den.",
        "25Â¶Then king Darius wrote unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.",
        "26I make a decree, That in every dominion of my kingdom men tremble and fear before the God of Daniel: for heistheliving God, andsteadfastfor ever, and his kingdomthatwhich shall not bedestroyed, and his dominionshall be evenunto the end.",
        "27Hedeliverethand rescueth, and he worketh signs and wonders in heaven and in earth, who hathdeliveredDaniel from the power of the lions.",
        "28So this Daniel prospered in the reign ofDarius, and in the reign ofCyrusthe Persian."
      ],
      "full_text": "1It pleased Darius to set over the kingdom an hundred and twenty princes, which should be over the whole kingdom; 2And over these three presidents; of whom Danielwasfirst: that the princes might give accounts unto them, and the king should have no damage. 3Then this Daniel was preferred above the presidents and princes, because an excellentspiritwasin him; and the king thought to set himoverthe whole realm. 4Â¶Then the presidents and princes sought to findoccasionagainst Daniel concerning the kingdom; but they could find none occasion nor fault; forasmuch as hewasfaithful, neither was there any error or fault found in him. 5Then said these men, We shall not find any occasion against this Daniel, except we finditagainst him concerning the law of his God. 6Then these presidents and princes assembled together to the king, and said thus unto him, King Darius, live for ever. 7All the presidents of the kingdom, the governors, and the princes, the counsellors, and the captains, have consulted together to establish a royal statute, and to make a firm decree, that whosoever shall ask a petition of any God or man for thirty days, save of thee, O king, he shall becastinto the den of lions. 8Now, O king, establish the decree, and sign the writing, that it be not changed, according to the law of the Medes and Persians, whichaltereth not. 9Wherefore king Darius signed the writing and the decree. 10Â¶Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber towardJerusalem, he kneeled upon his kneesthreetimes a day, andprayed, and gavethanksbefore his God, as he did aforetime. 11Then these men assembled, and found Daniel praying and making supplication before his God. 12Then they came near, and spake before the king concerning the kingâs decree; Hast thou not signed a decree, that every man that shall aska petitionof any God or man within thirty days, save of thee, O king, shall be cast into the den of lions? The king answered and said, The thingistrue, according to the law of the Medes and Persians, which altereth not. 13Then answered they and said before the king, ThatDaniel, whichisof the children of the captivity of Judah, regardeth not thee, O king, nor the decree that thou hast signed, but maketh his petition three times a day. 14Then the king, when he heardthesewords, was sore displeased with himself, and sethisheart onDaniel to deliver him: and he laboured till the going down of the sun to deliver him. 15Then these men assembled unto the king, and said unto the king, Know, O king, that the law of the Medes and Persiansis,That no decree nor statute which the king establisheth may be changed. 16Then the king commanded, and they brought Daniel, and casthiminto the den of lions.Nowthe king spake and said unto Daniel, Thy God whom thou servest continually, he will deliver thee. 17And a stone was brought, and laid upon the mouth of the den; and the kingsealedit with his own signet, and with the signet of his lords; that the purpose might not be changed concerning Daniel. 18Â¶Then the king went to his palace, and passed the night fasting: neither were instruments of musick brought before him: and his sleep went from him. 19Then the king arose very early in the morning, and went in haste unto the den of lions. 20And when he came to the den, he cried with a lamentable voice unto Daniel:andthe king spake and said to Daniel, O Daniel,servantof the living God, is thy God, whom thou servest continually, able to deliver thee from the lions? 21Then said Daniel unto the king, O king, live for ever. 22My God hath sent hisangel, and hath shut thelionsâmouths, that they have not hurt me: forasmuch as before him innocency was found in me; and also before thee, O king, have I done no hurt. 23Then was the king exceeding glad for him, and commanded that they should take Daniel up out of the den. So Daniel was taken up out of the den, and no manner of hurt was found upon him, because hebelievedin his God. 24Â¶And the king commanded, and they brought those men which had accused Daniel, and they casttheminto the den of lions, them, their children, and their wives; and the lionshadthe mastery of them, and brake all their bones in pieces or ever they came at the bottom of the den. 25Â¶Then king Darius wrote unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you. 26I make a decree, That in every dominion of my kingdom men tremble and fear before the God of Daniel: for heistheliving God, andsteadfastfor ever, and his kingdomthatwhich shall not bedestroyed, and his dominionshall be evenunto the end. 27Hedeliverethand rescueth, and he worketh signs and wonders in heaven and in earth, who hathdeliveredDaniel from the power of the lions. 28So this Daniel prospered in the reign ofDarius, and in the reign ofCyrusthe Persian."
    },
    {
      "reference": "Daniel 7",
      "title": "Daniel 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/dan/7?lang=eng",
      "summary": "Daniel sees four beasts representing the kingdoms of menâHe sees the ancient of days (Adam) to whom the Son of Man (Christ) will comeâThe kingdom will be given to the Saints forever.",
      "verses": [
        "1In the first year of Belshazzar king of Babylon Daniel had adreamand visions of his head upon his bed: then he wrote the dream,andtold the sum of the matters.",
        "2Daniel spake and said, I saw in my vision by night, and, behold, the four winds of the heaven strove upon the great sea.",
        "3And four greatbeastscame upfrom thesea, diverse one from another.",
        "4Thefirstwaslike a lion, and had eagleâs wings: I beheld till the wings thereof were plucked, and it was lifted up from the earth, and made stand upon the feet as a man, and a manâs heart was given to it.",
        "5And behold anotherbeast, a second, like to a bear, and it raised up itself on one side, andit hadthree ribs in the mouth of it between the teeth of it: and they said thus unto it, Arise, devour much flesh.",
        "6After this I beheld, and lo another, like a leopard, which had upon the back of it four wings of a fowl; the beast had also fourheads; and dominion was given to it.",
        "7After this I saw in the night visions, and behold a fourthbeast, dreadful and terrible, and strong exceedingly; and it had greatironteeth: it devoured and brake in pieces, and stamped the residue with the feet of it: and itwasdiverse from all the beasts thatwerebefore it; and it hadtenhorns.",
        "8I considered the horns, and, behold, there came up among them another littlehorn, before whom there were three of the first horns plucked up by the roots: and, behold, in this hornwereeyes like the eyes of man, and amouthspeaking great things.",
        "9Â¶I beheld till thethroneswerecast down, and theAncient of daysdid sit, whosegarmentwaswhite as snow, and the hair of his head like the pure wool: his thronewas likethe fiery flame,andhiswheelsasburning fire.",
        "10A fiery stream issued and came forth from before him:thousandthousands ministered unto him, and ten thousand times ten thousand stood before him: thejudgmentwas set, and thebookswere opened.",
        "11I beheld then because of the voice of the great words which the horn spake: I beheldeventill thebeastwas slain, and his body destroyed, and given to the burningflame.",
        "12As concerning the rest of the beasts, they had their dominion taken away: yet their lives were prolonged for a season and time.",
        "13I saw in the night visions, and, behold,onelike theSon of mancame with thecloudsof heaven, and came to the Ancient of days, and they brought him near before him.",
        "14And there was given himdominion, and glory, and akingdom, that all people, nations, and languages, should serve him: his dominionisaneverlastingdominion, which shall not pass away, and his kingdomthatwhich shall not be destroyed.",
        "15Â¶I Daniel was grieved in my spirit in the midst ofmybody, and the visions of my head troubled me.",
        "16I came near unto one of them that stood by, and asked him the truth of all this. So he told me, and made me know the interpretation of the things.",
        "17These great beasts, which are four,arefourkings,whichshall arise out of the earth.",
        "18But thesaintsof the most High shall take the kingdom, and possessthe kingdom for ever, even for ever and ever.",
        "19Then I would know the truth of the fourth beast, which was diverse from all the others, exceeding dreadful, whose teethwere ofiron, and his nailsofbrass;whichdevoured, brake in pieces, and stamped the residue with his feet;",
        "20And of the ten horns thatwerein his head, andofthe other which came up, and before whom three fell; evenofthat horn that had eyes, and a mouth that spake very great things, whose lookwasmore stout than his fellows.",
        "21I beheld, and the same horn madewarwith the saints, and prevailed against them;",
        "22Until theAncient of dayscame, andjudgmentwas given to thesaintsof the most High; and the time came that the saints possessed the kingdom.",
        "23Thus he said, The fourth beast shall be the fourth kingdom upon earth, which shall be diverse from all kingdoms, and shall devour the whole earth, and shall tread it down, and break it in pieces.",
        "24And the tenhornsout of this kingdomaretenkingsthatshall arise: and another shall rise after them; and he shall be diverse from the first, and he shall subdue three kings.",
        "25And he shall speakgreatwords against the most High, and shallwearout the saints of the most High, and think to change times and laws: and they shall be given into his hand until a time and times and the dividing of time.",
        "26But thejudgmentshall sit, and they shall take away his dominion, to consume and to destroyitunto the end.",
        "27And thekingdomand dominion, and the greatness of the kingdom under the whole heaven, shall begivento the people of the saints of the most High, whose kingdomisaneverlastingkingdom, and all dominions shall serve and obey him.",
        "28Hithertoisthe end of the matter. As for me Daniel, mycogitationsmuch troubled me, and my countenance changed in me: but I kept the matter in my heart."
      ],
      "full_text": "1In the first year of Belshazzar king of Babylon Daniel had adreamand visions of his head upon his bed: then he wrote the dream,andtold the sum of the matters. 2Daniel spake and said, I saw in my vision by night, and, behold, the four winds of the heaven strove upon the great sea. 3And four greatbeastscame upfrom thesea, diverse one from another. 4Thefirstwaslike a lion, and had eagleâs wings: I beheld till the wings thereof were plucked, and it was lifted up from the earth, and made stand upon the feet as a man, and a manâs heart was given to it. 5And behold anotherbeast, a second, like to a bear, and it raised up itself on one side, andit hadthree ribs in the mouth of it between the teeth of it: and they said thus unto it, Arise, devour much flesh. 6After this I beheld, and lo another, like a leopard, which had upon the back of it four wings of a fowl; the beast had also fourheads; and dominion was given to it. 7After this I saw in the night visions, and behold a fourthbeast, dreadful and terrible, and strong exceedingly; and it had greatironteeth: it devoured and brake in pieces, and stamped the residue with the feet of it: and itwasdiverse from all the beasts thatwerebefore it; and it hadtenhorns. 8I considered the horns, and, behold, there came up among them another littlehorn, before whom there were three of the first horns plucked up by the roots: and, behold, in this hornwereeyes like the eyes of man, and amouthspeaking great things. 9Â¶I beheld till thethroneswerecast down, and theAncient of daysdid sit, whosegarmentwaswhite as snow, and the hair of his head like the pure wool: his thronewas likethe fiery flame,andhiswheelsasburning fire. 10A fiery stream issued and came forth from before him:thousandthousands ministered unto him, and ten thousand times ten thousand stood before him: thejudgmentwas set, and thebookswere opened. 11I beheld then because of the voice of the great words which the horn spake: I beheldeventill thebeastwas slain, and his body destroyed, and given to the burningflame. 12As concerning the rest of the beasts, they had their dominion taken away: yet their lives were prolonged for a season and time. 13I saw in the night visions, and, behold,onelike theSon of mancame with thecloudsof heaven, and came to the Ancient of days, and they brought him near before him. 14And there was given himdominion, and glory, and akingdom, that all people, nations, and languages, should serve him: his dominionisaneverlastingdominion, which shall not pass away, and his kingdomthatwhich shall not be destroyed. 15Â¶I Daniel was grieved in my spirit in the midst ofmybody, and the visions of my head troubled me. 16I came near unto one of them that stood by, and asked him the truth of all this. So he told me, and made me know the interpretation of the things. 17These great beasts, which are four,arefourkings,whichshall arise out of the earth. 18But thesaintsof the most High shall take the kingdom, and possessthe kingdom for ever, even for ever and ever. 19Then I would know the truth of the fourth beast, which was diverse from all the others, exceeding dreadful, whose teethwere ofiron, and his nailsofbrass;whichdevoured, brake in pieces, and stamped the residue with his feet; 20And of the ten horns thatwerein his head, andofthe other which came up, and before whom three fell; evenofthat horn that had eyes, and a mouth that spake very great things, whose lookwasmore stout than his fellows. 21I beheld, and the same horn madewarwith the saints, and prevailed against them; 22Until theAncient of dayscame, andjudgmentwas given to thesaintsof the most High; and the time came that the saints possessed the kingdom. 23Thus he said, The fourth beast shall be the fourth kingdom upon earth, which shall be diverse from all kingdoms, and shall devour the whole earth, and shall tread it down, and break it in pieces. 24And the tenhornsout of this kingdomaretenkingsthatshall arise: and another shall rise after them; and he shall be diverse from the first, and he shall subdue three kings. 25And he shall speakgreatwords against the most High, and shallwearout the saints of the most High, and think to change times and laws: and they shall be given into his hand until a time and times and the dividing of time. 26But thejudgmentshall sit, and they shall take away his dominion, to consume and to destroyitunto the end. 27And thekingdomand dominion, and the greatness of the kingdom under the whole heaven, shall begivento the people of the saints of the most High, whose kingdomisaneverlastingkingdom, and all dominions shall serve and obey him. 28Hithertoisthe end of the matter. As for me Daniel, mycogitationsmuch troubled me, and my countenance changed in me: but I kept the matter in my heart."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:33:04",
  "metadata": {
    "week_number": 46,
    "title": "Week 46: November 9–15 - Daniel 1–7",
    "date_range": "November 9–15",
    "scraped_at": "2025-12-21T22:33:11.412874",
    "scraper_version": "2.0.0"
  }
}