{
  "week_number": 43,
  "date_range": "October 19–25",
  "title": "Week 43: October 19–25 - Jeremiah 1–3; 7; 16–18; 20",
  "bundle_title": "Week 43: October 19–25: \"Week 43: October 19–25 - Jeremiah 1–3; 7; 16–18; 20\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/43?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/43?lang=eng",
    "title": "Jeremiah 1–3;7;16–18;20",
    "scripture_references": "Jeremiah 1–3; 7; 16–18; 20",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“October 19–25. ‘Before I Formed Thee in the Belly I Knew Thee’: Jeremiah 1–3; 7; 16–18; 20,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“October 19–25. ‘Before I Formed Thee in the Belly I Knew Thee,’”Come, Follow Me: Old Testament 2026\n\nOctober 19–25: “Before I Formed Thee in the Belly I Knew Thee”\n\nAt first, Jeremiah didn’t think he would make a good prophet. “Behold, I cannot speak,” he protested (Jeremiah 1:6). But the Lord reassured him, “I have put my words in thy mouth” (verse 9). Jeremiah felt that he was an inexperienced “child” (verse 6), but the Lord explained that he was actually more prepared than he realized—he had been ordained to this calling even before he was born (seeverse 5). So Jeremiah set aside his fears and accepted the call. He warned Jerusalem’s kings and priests that their pretended holiness would not save them. The “child” who thought he could not speak came to feel God’s word “in [his] heart as a burning fire” and could not be silent (Jeremiah 20:9).\n\nJeremiah’s story is also your story. God knew you, too, before you were born and prepared you for your mission in life. Among other things, that mission includes something Jeremiah foresaw: gathering God’s people, one by one, to “bring [them] to Zion” (Jeremiah 3:14). And even if you don’t know exactly what to do or say, you can “be not afraid … ; for I am with thee, saith the Lord” (Jeremiah 1:8, 19).\n\nFor an overview of the book of Jeremiah, see “Jeremiah” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "Prophets are called to speak God’s word.",
        "content": "Imagine you’re talking to a friend who has never heard of prophets, and you decide to explain the concept using Jeremiah’s call to be a prophet inJeremiah 1:4–19. What do you find in these verses that teaches something about prophets of God? You could also look inJeremiah 7:1–7;20:8–9and a hymn like “We Listen to a Prophet’s Voice” (Hymns, no. 22).\n\nYou might also want to teach your friend about today’s living prophet. Is there anything in these verses that might help? For example, what do prophets in our day “root out” or “pull down”? What do they “build” and “plant”? (Jeremiah 1:10). How have you come to know that our living prophet is called of God?\n\nSee alsoArticles of Faith 1:6, 9; “Why Do We Have Prophets?” (video),ChurchofJesusChrist.org.\n\nWhy Do We Have Prophets?\n\nJeremiah 1:5"
      },
      {
        "title": "God knew me before I was born.",
        "content": "What did Jeremiah learn about himself inJeremiah 1:5? As a newly called prophet, why would that information be important for him to know?\n\nMuch of what Jeremiah learned about himself inJeremiah 1:5is also true about you. God also knew you before you were born and prepared you for specific responsibilities. To learn more about your life before you were born, readAlma 13:1–4;Doctrine and Covenants 138:53–56; andAbraham 3:22–23. You might make a list of truths you discover. Why is this information important for you to know?\n\nTo learn about how these truths affected the life of Elder Ahmad S. Corbitt, study his message “You Can Gather Israel!” (Liahona, May 2021, 61–63). How does knowing about your premortal life affect the way you live your mortal life?\n\nHere is what President Russell M. Nelson said about your premortal life:\n\n“Your Heavenly Father has known you for a very long time. You, as His son or daughter, were chosen by Him to come to earth at this precise time, to be a leader in His great work on earth. You were chosennotfor your bodily characteristics but for yourspiritualattributes, such as bravery, courage, integrity of heart, a thirst for truth, a hunger for wisdom, and a desire to serve others.\n\n“You developed some of these attributes premortally. Others you can develop here on earth as you persistently seek them” (“Decisions for Eternity,”EnsignorLiahona, Nov. 2013, 107).\n\nThink of some situations you might face in which it would be important to remember these truths about your premortal life. What can you do to remind yourself of these truths?\n\nSee also Russell M. Nelson, “Decisions for Eternity,”EnsignorLiahona, Nov. 2013, 106–9; Topics and Questions, “Foreordination,” “Premortal Life,” Gospel Library.\n\nInJeremiah 2:13, the Lord compared the people’s spiritual state to “broken cisterns” and compared Himself to the “fountain of living waters.”\n\nJeremiah 2;7"
      },
      {
        "title": "“They have forsaken me the fountain of living waters.”",
        "content": "In the dry region where the Israelites lived, people stored precious water in underground reservoirs called cisterns. What do you think the “broken cisterns” mentioned inJeremiah 2:13might symbolize? Why would receiving water from a fountain be better than relying on a cistern? What does it mean to forsake “the fountain of living waters”? As you readJeremiah 2and7, notice how the people were forsaking the Lord’s living waters (see, for example,Jeremiah 2:26–28;7:2–11). Why is “living water” a good symbol for what the Savior gives you? Think about how you are receiving living water.\n\nJeremiah 7is addressed to people who were entering “the Lord’s house … to worship the Lord,” but their actions didn’t match their outward devotion (seeverses 2–11). What messages do you feel the Lord might have for you inverses 21–23?\n\nUse object lessons.The Lord’s prophets often compare spiritual truths to familiar objects. Consider doing the same as you learn and teach the gospel. For example, to visualizeJeremiah 2:13, you could put water in a cracked or broken container or drink from a drinking fountain. How is Jesus like a “fountain of living waters”? (Jeremiah 2:13). How do we drink from His living water?\n\nJeremiah 3:14–18;16:14–21"
      },
      {
        "title": "The Lord will gather His people.",
        "content": "InJeremiah 16:14–15, Jeremiah compared the gathering of Israel in the latter days with the Exodus of Israel from Egypt. In your opinion, why would the gathering be even more important to God’s people than the Exodus?\n\nWhat doJeremiah 3:14–18;16:14–21suggest about how the gathering happens?\n\nIn his message “Hope of Israel,” President Russell M. Nelson, like Jeremiah, taught that the gathering of Israel “is the most important thing taking place on earth today” (worldwide youth devotional, June 3, 2018, Gospel Library). Read or listen to his message, and see if you can discover (a) how President Nelson defines the gathering of Israel, (b) how he describes its importance, and (c) how you can be part of the gathering.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "Heavenly Father knew me before I was born.",
        "content": "To introduce the important truth taught inJeremiah 1:5, you could show your children a picture of a baby (or, if possible, you could look at pictures of your children when they were babies). Ask your children if they know where they lived before they were born. You could also sing together a song that teaches about our premortal life, such as “I Lived in Heaven” (Children’s Songbook, 4).\n\nIf your children would like to learn more, you could help them find “Premortal Life” in the Guide to the Scriptures. They could look for answers to “who,” “when,” and “what” questions about the premortal life.\n\nJeremiah 1:4–19"
      },
      {
        "title": "Prophets are called to speak the words of the Lord.",
        "content": "Consider showing pictures of the living prophet or prophets from the scriptures (you can find some inChurch magazines, theGospel Art Book, andCome, Follow Me). Ask your children what they know about these prophets.\n\nTo teach about what prophets do, you might select some helpful verses fromJeremiah 1, such asverses 5, 7, 10, and19. Your children could each pick one of the verses, read it, and share something they learn about prophets.\n\nJeremiah 16:14–16"
      },
      {
        "title": "I can help Heavenly Father’s children come back to Him.",
        "content": "While you readJeremiah 16:16, your children could pretend to “fish” or “hunt” for objects around the room. President Russell M. Nelson has compared the fishers and hunters in this verse to missionaries (see “The Gathering of Scattered Israel,”EnsignorLiahona, Nov. 2006, 81). What do missionaries do? How can we help “fish” and “hunt” for scattered Israel? (see “A Message for Children from President Russell M. Nelson” [video],ChurchofJesusChrist.org).\n\nVideo: A Message for Children from President Russell M. Nelson\n\nJeremiah 18:1–6"
      },
      {
        "title": "I can let the Lord guide my life, like a potter shapes clay.",
        "content": "To explore these verses, you might discuss or show how pottery is made (see the picture at the end of this outline). What message does the Lord have for us inJeremiah 18:1–6? What does it mean to be clay in the Lord’s hands? (see alsoIsaiah 64:8). For another story that compares us to potter’s clay, see Elder Richard J. Maynes’s message “The Joy of Living a Christ-Centered Life” (EnsignorLiahona, Nov. 2015, 27–30).\n\nFor more, see this month’s issue of theFriendmagazine.\n\n“Behold, as the clay is in the potter’s hand, so are ye in mine hand, O house of Israel” (Jeremiah 18:6)."
      }
    ],
    "study_helps": [],
    "raw_text": "October 19–25. “Before I Formed Thee in the Belly I Knew Thee”: Jeremiah 1–3; 7; 16–18; 20\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nSeptember 28–October 4\nIsaiah 40–49\nOctober 5–11\nIsaiah 50–57\nOctober 12–18\nIsaiah 58–66\nOctober 19–25\nJeremiah 1–3; 7; 16–18; 20\nNovember\nDecember\nAppendixes\nOctober 19–25. “Before I Formed Thee in the Belly I Knew Thee”: Jeremiah 1–3; 7; 16–18; 20\n“October 19–25. ‘Before I Formed Thee in the Belly I Knew Thee’: Jeremiah 1–3; 7; 16–18; 20,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“October 19–25. ‘Before I Formed Thee in the Belly I Knew Thee,’”\nCome, Follow Me: Old Testament 2026\nJeremiah\n, by Walter Rane\nOctober 19–25: “Before I Formed Thee in the Belly I Knew Thee”\nJeremiah 1–3\n;\n7\n;\n16–18\n;\n20\nAt first, Jeremiah didn’t think he would make a good prophet. “Behold, I cannot speak,” he protested (\nJeremiah 1:6\n). But the Lord reassured him, “I have put my words in thy mouth” (\nverse 9\n). Jeremiah felt that he was an inexperienced “child” (\nverse 6\n), but the Lord explained that he was actually more prepared than he realized—he had been ordained to this calling even before he was born (see\nverse 5\n). So Jeremiah set aside his fears and accepted the call. He warned Jerusalem’s kings and priests that their pretended holiness would not save them. The “child” who thought he could not speak came to feel God’s word “in [his] heart as a burning fire” and could not be silent (\nJeremiah 20:9\n).\nJeremiah’s story is also your story. God knew you, too, before you were born and prepared you for your mission in life. Among other things, that mission includes something Jeremiah foresaw: gathering God’s people, one by one, to “bring [them] to Zion” (\nJeremiah 3:14\n). And even if you don’t know exactly what to do or say, you can “be not afraid … ; for I am with thee, saith the Lord” (\nJeremiah 1:8, 19\n).\nFor an overview of the book of Jeremiah, see “\nJeremiah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nJeremiah 1:4–19\n;\n7:1–7\n;\n20:8–9\nProphets are called to speak God’s word.\nImagine you’re talking to a friend who has never heard of prophets, and you decide to explain the concept using Jeremiah’s call to be a prophet in\nJeremiah 1:4–19\n. What do you find in these verses that teaches something about prophets of God? You could also look in\nJeremiah 7:1–7\n;\n20:8–9\nand a hymn like “\nWe Listen to a Prophet’s Voice\n” (\nHymns\n, no. 22).\nYou might also want to teach your friend about today’s living prophet. Is there anything in these verses that might help? For example, what do prophets in our day “root out” or “pull down”? What do they “build” and “plant”? (\nJeremiah 1:10\n). How have you come to know that our living prophet is called of God?\nSee also\nArticles of Faith 1:6, 9\n; “Why Do We Have Prophets?” (video),\nChurchofJesusChrist.org\n.\n1:37\nWhy Do We Have Prophets?\nJeremiah 1:5\nGod knew me before I was born.\nWhat did Jeremiah learn about himself in\nJeremiah 1:5\n? As a newly called prophet, why would that information be important for him to know?\nMuch of what Jeremiah learned about himself in\nJeremiah 1:5\nis also true about you. God also knew you before you were born and prepared you for specific responsibilities. To learn more about your life before you were born, read\nAlma 13:1–4\n;\nDoctrine and Covenants 138:53–56\n; and\nAbraham 3:22–23\n. You might make a list of truths you discover. Why is this information important for you to know?\nTo learn about how these truths affected the life of Elder Ahmad S. Corbitt, study his message “\nYou Can Gather Israel!\n” (\nLiahona\n, May 2021, 61–63). How does knowing about your premortal life affect the way you live your mortal life?\nHere is what President Russell M. Nelson said about your premortal life:\n“Your Heavenly Father has known you for a very long time. You, as His son or daughter, were chosen by Him to come to earth at this precise time, to be a leader in His great work on earth. You were chosen\nnot\nfor your bodily characteristics but for your\nspiritual\nattributes, such as bravery, courage, integrity of heart, a thirst for truth, a hunger for wisdom, and a desire to serve others.\n“You developed some of these attributes premortally. Others you can develop here on earth as you persistently seek them” (“\nDecisions for Eternity\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 107).\nThink of some situations you might face in which it would be important to remember these truths about your premortal life. What can you do to remind yourself of these truths?\nSee also Russell M. Nelson, “\nDecisions for Eternity\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 106–9; Topics and Questions, “\nForeordination\n,” “\nPremortal Life\n,” Gospel Library.\nIn\nJeremiah 2:13\n, the Lord compared the people’s spiritual state to “broken cisterns” and compared Himself to the “fountain of living waters.”\nJeremiah 2\n;\n7\n“They have forsaken me the fountain of living waters.”\nIn the dry region where the Israelites lived, people stored precious water in underground reservoirs called cisterns. What do you think the “broken cisterns” mentioned in\nJeremiah 2:13\nmight symbolize? Why would receiving water from a fountain be better than relying on a cistern? What does it mean to forsake “the fountain of living waters”? As you read\nJeremiah 2\nand\n7\n, notice how the people were forsaking the Lord’s living waters (see, for example,\nJeremiah 2:26–28\n;\n7:2–11\n). Why is “living water” a good symbol for what the Savior gives you? Think about how you are receiving living water.\nJeremiah 7\nis addressed to people who were entering “the Lord’s house … to worship the Lord,” but their actions didn’t match their outward devotion (see\nverses 2–11\n). What messages do you feel the Lord might have for you in\nverses 21–23\n?\nUse object lessons.\nThe Lord’s prophets often compare spiritual truths to familiar objects. Consider doing the same as you learn and teach the gospel. For example, to visualize\nJeremiah 2:13\n, you could put water in a cracked or broken container or drink from a drinking fountain. How is Jesus like a “fountain of living waters”? (\nJeremiah 2:13\n). How do we drink from His living water?\nJeremiah 3:14–18\n;\n16:14–21\nThe Lord will gather His people.\nIn\nJeremiah 16:14–15\n, Jeremiah compared the gathering of Israel in the latter days with the Exodus of Israel from Egypt. In your opinion, why would the gathering be even more important to God’s people than the Exodus?\nWhat do\nJeremiah 3:14–18\n;\n16:14–21\nsuggest about how the gathering happens?\nIn his message “\nHope of Israel\n,” President Russell M. Nelson, like Jeremiah, taught that the gathering of Israel “is the most important thing taking place on earth today” (worldwide youth devotional, June 3, 2018, Gospel Library). Read or listen to his message, and see if you can discover (a) how President Nelson defines the gathering of Israel, (b) how he describes its importance, and (c) how you can be part of the gathering.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nJeremiah 1:5\nHeavenly Father knew me before I was born.\nTo introduce the important truth taught in\nJeremiah 1:5\n, you could show your children a picture of a baby (or, if possible, you could look at pictures of your children when they were babies). Ask your children if they know where they lived before they were born. You could also sing together a song that teaches about our premortal life, such as “\nI Lived in Heaven\n” (\nChildren’s Songbook\n, 4).\nIf your children would like to learn more, you could help them find “\nPremortal Life\n” in the Guide to the Scriptures. They could look for answers to “who,” “when,” and “what” questions about the premortal life.\nJeremiah 1:4–19\nProphets are called to speak the words of the Lord.\nConsider showing pictures of the living prophet or prophets from the scriptures (you can find some in\nChurch magazines\n, the\nGospel Art Book\n, and\nCome, Follow Me\n). Ask your children what they know about these prophets.\nTo teach about what prophets do, you might select some helpful verses from\nJeremiah 1\n, such as\nverses 5, 7, 10\n, and\n19\n. Your children could each pick one of the verses, read it, and share something they learn about prophets.\nJeremiah 16:14–16\nI can help Heavenly Father’s children come back to Him.\nWhile you read\nJeremiah 16:16\n, your children could pretend to “fish” or “hunt” for objects around the room. President Russell M. Nelson has compared the fishers and hunters in this verse to missionaries (see “\nThe Gathering of Scattered Israel\n,”\nEnsign\nor\nLiahona\n, Nov. 2006, 81). What do missionaries do? How can we help “fish” and “hunt” for scattered Israel? (see “A Message for Children from President Russell M. Nelson” [video],\nChurchofJesusChrist.org\n).\n3:30\nVideo: A Message for Children from President Russell M. Nelson\nJeremiah 18:1–6\nI can let the Lord guide my life, like a potter shapes clay.\nTo explore these verses, you might discuss or show how pottery is made (see the picture at the end of this outline). What message does the Lord have for us in\nJeremiah 18:1–6\n? What does it mean to be clay in the Lord’s hands? (see also\nIsaiah 64:8\n). For another story that compares us to potter’s clay, see Elder Richard J. Maynes’s message “\nThe Joy of Living a Christ-Centered Life\n” (\nEnsign\nor\nLiahona\n, Nov. 2015, 27–30).\nFor more, see this month’s issue of the\nFriend\nmagazine.\n“Behold, as the clay is in the potter’s hand, so are ye in mine hand, O house of Israel” (\nJeremiah 18:6\n).\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Jeremiah 1",
      "title": "The Book of the ProphetJeremiah",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/1?lang=eng",
      "summary": "Jeremiah was foreordained to be a prophet unto the nationsâHe is called as a mortal to declare the word of the Lord.",
      "verses": [
        "1The words of Jeremiah the son of Hilkiah, of the priests thatwereinAnathothin the land of Benjamin:",
        "2To whom the word of theLordcame in the days of Josiah the son of Amon king of Judah, in the thirteenthyearof his reign.",
        "3It came also in the days of Jehoiakim the son of Josiah king of Judah, unto the end of the eleventh year of Zedekiah the son of Josiah king of Judah, unto thecarryingaway of Jerusalem captive in the fifth month.",
        "4Then the word of theLordcame unto me, saying,",
        "5Before Iformedthee in the belly Iknewthee; and before thou camest forth out of the womb Isanctifiedthee,andIordainedthee a prophet unto thenations.",
        "6Then said I, Ah, LordGod! behold, I cannotspeak: for Iamachild.",
        "7Â¶But theLordsaid unto me, Say not, Iama child: for thou shalt go to all that I shallsendthee, and whatsoever Icommandthee thou shaltspeak.",
        "8Be notafraidof their faces: for Iamwith thee to deliver thee, saith theLord.",
        "9Then theLordput forth his hand, and touched mymouth. And theLordsaid unto me, Behold, I have put mywordsin thymouth.",
        "10See, I have this daysetthee over the nations and over the kingdoms, to root out, and topulldown, and to destroy, and tothrowdown, tobuild, and to plant.",
        "11Â¶Moreover the word of theLordcame unto me, saying, Jeremiah, whatseestthou? And I said, I see a rod of an almond tree.",
        "12Then said theLordunto me, Thou hast well seen: for I will hasten my word to perform it.",
        "13And the word of theLordcame unto me the second time, saying, What seest thou? And I said, I see aseethingpot; and the face thereofistoward the north.",
        "14Then theLordsaid unto me, Out of thenorthan evil shall break forth upon all the inhabitants of the land.",
        "15For, lo, I will call all the families of the kingdoms of the north, saith theLord; and they shall come, andthey shall set every one his throne at the entering of thegatesof Jerusalem, and against all the walls thereof round about, and against all the cities of Judah.",
        "16And I will utter my judgments against them touching all their wickedness, who haveforsakenme, and have burned incense unto othergods, and worshipped the works of their own hands.",
        "17Â¶Thou therefore gird up thy loins, and arise, and speak unto them all that I command thee: be not dismayed at their faces, lest I confound thee before them.",
        "18For, behold, I have made thee this day a defenced city, and an iron pillar, and brasen walls against the whole land, against the kings of Judah, against theprincesthereof, against the priests thereof, and against the people of the land.",
        "19And they shallfightagainst thee; but they shall notprevailagainst thee; for Iamwith thee, saith theLord, to deliver thee."
      ],
      "full_text": "1The words of Jeremiah the son of Hilkiah, of the priests thatwereinAnathothin the land of Benjamin: 2To whom the word of theLordcame in the days of Josiah the son of Amon king of Judah, in the thirteenthyearof his reign. 3It came also in the days of Jehoiakim the son of Josiah king of Judah, unto the end of the eleventh year of Zedekiah the son of Josiah king of Judah, unto thecarryingaway of Jerusalem captive in the fifth month. 4Then the word of theLordcame unto me, saying, 5Before Iformedthee in the belly Iknewthee; and before thou camest forth out of the womb Isanctifiedthee,andIordainedthee a prophet unto thenations. 6Then said I, Ah, LordGod! behold, I cannotspeak: for Iamachild. 7Â¶But theLordsaid unto me, Say not, Iama child: for thou shalt go to all that I shallsendthee, and whatsoever Icommandthee thou shaltspeak. 8Be notafraidof their faces: for Iamwith thee to deliver thee, saith theLord. 9Then theLordput forth his hand, and touched mymouth. And theLordsaid unto me, Behold, I have put mywordsin thymouth. 10See, I have this daysetthee over the nations and over the kingdoms, to root out, and topulldown, and to destroy, and tothrowdown, tobuild, and to plant. 11Â¶Moreover the word of theLordcame unto me, saying, Jeremiah, whatseestthou? And I said, I see a rod of an almond tree. 12Then said theLordunto me, Thou hast well seen: for I will hasten my word to perform it. 13And the word of theLordcame unto me the second time, saying, What seest thou? And I said, I see aseethingpot; and the face thereofistoward the north. 14Then theLordsaid unto me, Out of thenorthan evil shall break forth upon all the inhabitants of the land. 15For, lo, I will call all the families of the kingdoms of the north, saith theLord; and they shall come, andthey shall set every one his throne at the entering of thegatesof Jerusalem, and against all the walls thereof round about, and against all the cities of Judah. 16And I will utter my judgments against them touching all their wickedness, who haveforsakenme, and have burned incense unto othergods, and worshipped the works of their own hands. 17Â¶Thou therefore gird up thy loins, and arise, and speak unto them all that I command thee: be not dismayed at their faces, lest I confound thee before them. 18For, behold, I have made thee this day a defenced city, and an iron pillar, and brasen walls against the whole land, against the kings of Judah, against theprincesthereof, against the priests thereof, and against the people of the land. 19And they shallfightagainst thee; but they shall notprevailagainst thee; for Iamwith thee, saith theLord, to deliver thee."
    },
    {
      "reference": "Jeremiah 2",
      "title": "Jeremiah 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/2?lang=eng",
      "summary": "The people of Judah forsook the Lord, the fountain of living watersâThey worshipped idols and rejected the prophets.",
      "verses": [
        "1Moreover the word of theLordcame to me, saying,",
        "2Go and cry in the ears of Jerusalem, saying, Thus saith theLord; I remember thee, the kindness of thy youth, the love of thine espousals,whenthou wentest after me in the wilderness, in a landthat wasnot sown.",
        "3Israelwasholinessunto theLord,andthe firstfruits of his increase: all that devour him shall offend; evil shall come upon them, saith theLord.",
        "4Hear ye the word of theLord, O house of Jacob, and all the families of the house of Israel:",
        "5Â¶Thus saith theLord, What iniquity have your fathers found in me, that they are gone far from me, and have walked after vanity, and are become vain?",
        "6Neither said they, WhereistheLordthat brought us up out of the land of Egypt, thatledus through the wilderness, through a land of deserts and of pits, through a land of drought, and of the shadow of death, through a land that no man passed through, and where no man dwelt?",
        "7And I brought you into a plentiful country, to eat the fruit thereof and the goodness thereof; but when ye entered, yedefiledmyland, and made mine heritage an abomination.",
        "8The priests said not, WhereistheLord? and they that handle the law knew me not: thepastorsalso transgressed against me, and theprophetsprophesied by Baal, and walked afterthings thatdo not profit.",
        "9Â¶Wherefore I will yet plead with you, saith theLord, and with your childrenâs children will I plead.",
        "10For passoverthe isles of Chittim, and see; and send unto Kedar, and consider diligently, and see if there be such a thing.",
        "11Hath a nation changedtheirgods, whichareyet no gods? but my people have changed their glory forthat whichdoth not profit.",
        "12Be astonished, O ye heavens, at this, and be horribly afraid, be ye very desolate, saith theLord.",
        "13For my people have committed twoevils; they have forsaken me the fountain ofliving waters,andhewed them out cisterns, broken cisterns, that can hold no water.",
        "14Â¶IsIsrael aservant?ishe a homebornslave?why is he spoiled?",
        "15The young lions roared upon him,andyelled, and they made his land waste: his cities are burned without inhabitant.",
        "16Also the children of Noph andTahapaneshave broken the crown of thy head.",
        "17Hast thou not procured this unto thyself, in that thou hastforsakentheLordthy God, when he led thee by the way?",
        "18And now what hast thou to do in the way ofEgypt, to drink the waters of Sihor? or what hast thou to do in the way of Assyria, to drink the waters ofthe river?",
        "19Thine own wickedness shall correct thee, and thy backslidings shallreprovethee: know therefore and see thatit isan evilthingand bitter, that thou hast forsaken theLordthy God, and that my fearisnot in thee, saith the LordGodof hosts.",
        "20Â¶For of old time I have broken thy yoke,andburst thy bands; and thou saidst, I will not transgress; when upon every high hill and under every green tree thou wanderest, playing theharlot.",
        "21Yet I had planted thee a noblevine, wholly a right seed: how then art thou turned into the degenerate plant of a strange vine unto me?",
        "22For though thouwashthee withnitre, and take thee much soap,yetthine iniquity is marked before me, saith the LordGod.",
        "23How canst thou say, I am not polluted, I have not gone after Baalim? see thy way in the valley, know what thou hast done:thou arta swift dromedary traversing her ways;",
        "24A wild ass used to the wilderness,thatsnuffeth up the wind at her pleasure; in her occasion who can turn her away? all they that seek her will not weary themselves; in her month theyshall find her.",
        "25Withhold thy foot from being unshod, and thy throat from thirst: but thou saidst, There is nohope: no; for I have loved strangers, and after them will I go.",
        "26As the thief isashamedwhen he is found, so is the house of Israel ashamed; they, their kings, their princes, and their priests, and their prophets,",
        "27Saying toa stock, Thouartmy father; and to a stone, Thou hast brought me forth: for they have turnedtheirbackunto me, and nottheirface: but in thetimeof their trouble they will say, Arise, and save us.",
        "28But wherearethygodsthat thou hast made thee? let them arise, if they can save thee in the time of thy trouble: foraccording tothe number of thy cities are thy gods, O Judah.",
        "29Wherefore will yepleadwith me? ye all have transgressed against me, saith theLord.",
        "30In vain have I smitten your children; they received nocorrection: your own sword hath devoured your prophets, like a destroying lion.",
        "31Â¶O generation, see ye the word of theLord. Have I been a wilderness unto Israel? a land of darkness? wherefore say my people, We are lords; we will come no more unto thee?",
        "32Can a maid forget her ornaments,ora bride her attire? yet my people haveforgottenme days without number.",
        "33Why trimmest thou thy way toseek love? therefore hast thou also taught the wickedonesthy ways.",
        "34Also in thy skirts is found thebloodof the souls of the poor innocents: I have not found it by secret search, but upon allthese.",
        "35Yet thou sayest, Because I aminnocent, surely his anger shall turn from me. Behold, I will plead with thee, because thou sayest, I have not sinned.",
        "36Why gaddest thou about so much to change thy way? thou also shalt beashamedof Egypt, as thou wast ashamed of Assyria.",
        "37Yea, thou shalt go forth from him, and thine hands upon thine head: for theLordhath rejected thy confidences, and thou shalt not prosper in them."
      ],
      "full_text": "1Moreover the word of theLordcame to me, saying, 2Go and cry in the ears of Jerusalem, saying, Thus saith theLord; I remember thee, the kindness of thy youth, the love of thine espousals,whenthou wentest after me in the wilderness, in a landthat wasnot sown. 3Israelwasholinessunto theLord,andthe firstfruits of his increase: all that devour him shall offend; evil shall come upon them, saith theLord. 4Hear ye the word of theLord, O house of Jacob, and all the families of the house of Israel: 5Â¶Thus saith theLord, What iniquity have your fathers found in me, that they are gone far from me, and have walked after vanity, and are become vain? 6Neither said they, WhereistheLordthat brought us up out of the land of Egypt, thatledus through the wilderness, through a land of deserts and of pits, through a land of drought, and of the shadow of death, through a land that no man passed through, and where no man dwelt? 7And I brought you into a plentiful country, to eat the fruit thereof and the goodness thereof; but when ye entered, yedefiledmyland, and made mine heritage an abomination. 8The priests said not, WhereistheLord? and they that handle the law knew me not: thepastorsalso transgressed against me, and theprophetsprophesied by Baal, and walked afterthings thatdo not profit. 9Â¶Wherefore I will yet plead with you, saith theLord, and with your childrenâs children will I plead. 10For passoverthe isles of Chittim, and see; and send unto Kedar, and consider diligently, and see if there be such a thing. 11Hath a nation changedtheirgods, whichareyet no gods? but my people have changed their glory forthat whichdoth not profit. 12Be astonished, O ye heavens, at this, and be horribly afraid, be ye very desolate, saith theLord. 13For my people have committed twoevils; they have forsaken me the fountain ofliving waters,andhewed them out cisterns, broken cisterns, that can hold no water. 14Â¶IsIsrael aservant?ishe a homebornslave?why is he spoiled? 15The young lions roared upon him,andyelled, and they made his land waste: his cities are burned without inhabitant. 16Also the children of Noph andTahapaneshave broken the crown of thy head. 17Hast thou not procured this unto thyself, in that thou hastforsakentheLordthy God, when he led thee by the way? 18And now what hast thou to do in the way ofEgypt, to drink the waters of Sihor? or what hast thou to do in the way of Assyria, to drink the waters ofthe river? 19Thine own wickedness shall correct thee, and thy backslidings shallreprovethee: know therefore and see thatit isan evilthingand bitter, that thou hast forsaken theLordthy God, and that my fearisnot in thee, saith the LordGodof hosts. 20Â¶For of old time I have broken thy yoke,andburst thy bands; and thou saidst, I will not transgress; when upon every high hill and under every green tree thou wanderest, playing theharlot. 21Yet I had planted thee a noblevine, wholly a right seed: how then art thou turned into the degenerate plant of a strange vine unto me? 22For though thouwashthee withnitre, and take thee much soap,yetthine iniquity is marked before me, saith the LordGod. 23How canst thou say, I am not polluted, I have not gone after Baalim? see thy way in the valley, know what thou hast done:thou arta swift dromedary traversing her ways; 24A wild ass used to the wilderness,thatsnuffeth up the wind at her pleasure; in her occasion who can turn her away? all they that seek her will not weary themselves; in her month theyshall find her. 25Withhold thy foot from being unshod, and thy throat from thirst: but thou saidst, There is nohope: no; for I have loved strangers, and after them will I go. 26As the thief isashamedwhen he is found, so is the house of Israel ashamed; they, their kings, their princes, and their priests, and their prophets, 27Saying toa stock, Thouartmy father; and to a stone, Thou hast brought me forth: for they have turnedtheirbackunto me, and nottheirface: but in thetimeof their trouble they will say, Arise, and save us. 28But wherearethygodsthat thou hast made thee? let them arise, if they can save thee in the time of thy trouble: foraccording tothe number of thy cities are thy gods, O Judah. 29Wherefore will yepleadwith me? ye all have transgressed against me, saith theLord. 30In vain have I smitten your children; they received nocorrection: your own sword hath devoured your prophets, like a destroying lion. 31Â¶O generation, see ye the word of theLord. Have I been a wilderness unto Israel? a land of darkness? wherefore say my people, We are lords; we will come no more unto thee? 32Can a maid forget her ornaments,ora bride her attire? yet my people haveforgottenme days without number. 33Why trimmest thou thy way toseek love? therefore hast thou also taught the wickedonesthy ways. 34Also in thy skirts is found thebloodof the souls of the poor innocents: I have not found it by secret search, but upon allthese. 35Yet thou sayest, Because I aminnocent, surely his anger shall turn from me. Behold, I will plead with thee, because thou sayest, I have not sinned. 36Why gaddest thou about so much to change thy way? thou also shalt beashamedof Egypt, as thou wast ashamed of Assyria. 37Yea, thou shalt go forth from him, and thine hands upon thine head: for theLordhath rejected thy confidences, and thou shalt not prosper in them."
    },
    {
      "reference": "Jeremiah 3",
      "title": "Jeremiah 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/3?lang=eng",
      "summary": "Israel and Judah defiled and polluted the land through wickednessâIn the last days, the Lord will gather the people of Israel, one from a city and two from a family, and bring them to Zion.",
      "verses": [
        "1They say, If a manput awayhis wife, and she go from him, and become another manâs, shall he return unto her again? shall not that land be greatlypolluted? but thou hast played the harlot with many lovers; yet return again to me, saith theLord.",
        "2Lift up thine eyes unto the high places, and see where thou hast not been lien with. In the ways hast thou sat for them, as the Arabian in the wilderness; and thou hast polluted the land with thywhoredomsand with thy wickedness.",
        "3Therefore theshowershave been withholden, and there hath been nolatterrain; and thou hadst a whoreâs forehead, thou refusedst to be ashamed.",
        "4Wilt thou not from this time cry unto me, My father, thouartthe guide of my youth?",
        "5Will he reservehisangerfor ever? will he keepitto the end? Behold, thou hast spoken and done evil things as thou couldest.",
        "6Â¶TheLordsaid also unto me in the days of Josiah the king, Hast thou seenthatwhich backsliding Israel hath done? she is gone up upon every high mountain and under every green tree, and there hath played the harlot.",
        "7And I said after she had done all thesethings,Turn thou unto me. But she returned not. And her treacheroussisterJudah sawit.",
        "8And I saw, when for all the causes whereby backsliding Israel committedadulteryI had put her away, and given her a bill ofdivorce; yet her treacherous sister Judah feared not, but went and played the harlot also.",
        "9And it came to pass through the lightness of her whoredom, that she defiled the land, andcommittedadultery withstonesand withstocks.",
        "10And yet for all this her treacherous sister Judah hath not turned unto me with her whole heart, butfeignedly, saith theLord.",
        "11And theLordsaid unto me, The backsliding Israel hathjustifiedherself more than treacherous Judah.",
        "12Â¶Go andproclaimthese words toward thenorth, and say,Return, thou backsliding Israel, saith theLord;andI will not cause mine anger to fall upon you: for Iammerciful, saith theLord,andI will not keepangerfor ever.",
        "13Only acknowledge thine iniquity, that thou hast transgressed against theLordthy God, and hast scattered thy ways to the strangers under every green tree, and ye have notobeyedmy voice, saith theLord.",
        "14Turn, O backsliding children, saith theLord; for I ammarriedunto you: and I will take you one of a city, and two of a family, and I willbringyou toZion:",
        "15And I will give youpastorsaccording to mine heart, which shall feed you withknowledgeand understanding.",
        "16And it shall come to pass, when ye be multiplied and increased in the land, in those days, saith theLord, they shall say no more, Thearkof the covenant of theLord: neither shall it come to mind: neither shall they remember it; neither shall they visitit;neither shallthatbe done any more.",
        "17At that time they shall callJerusalemthe throne of theLord; and all thenationsshall begatheredunto it, to the name of theLord, to Jerusalem: neither shall they walk any more after theimaginationof their evil heart.",
        "18In those days thehouseof Judah shall walk with the house of Israel, and they shall come together out of thelandof thenorthto the land that I have given for an inheritance unto your fathers.",
        "19But I said, How shall I put thee among the children, and give thee a pleasant land, a goodly heritage of the hosts of nations? and I said, Thou shalt call me, My father; and shalt not turn away from me.",
        "20Â¶Surelyasa wife treacherouslydepartethfrom her husband, so have ye dealt treacherously with me, O house of Israel, saith theLord.",
        "21A voice was heard upon the high places, weepingandsupplications of the children of Israel: for they have perverted their way,andthey have forgotten theLordtheir God.",
        "22Return, ye backsliding children,andI willhealyour backslidings. Behold, we come unto thee; for thouarttheLordour God.",
        "23Truly in vainis salvation hoped forfrom the hills,and fromthe multitude of mountains: truly in theLordour Godisthe salvation of Israel.",
        "24For shame hath devoured the labour of our fathers from our youth; their flocks and their herds, their sons and their daughters.",
        "25We lie down in ourshame, and our confusion covereth us: for we havesinnedagainst theLordour God, we and our fathers, from our youth even unto this day, and have not obeyed the voice of theLordour God."
      ],
      "full_text": "1They say, If a manput awayhis wife, and she go from him, and become another manâs, shall he return unto her again? shall not that land be greatlypolluted? but thou hast played the harlot with many lovers; yet return again to me, saith theLord. 2Lift up thine eyes unto the high places, and see where thou hast not been lien with. In the ways hast thou sat for them, as the Arabian in the wilderness; and thou hast polluted the land with thywhoredomsand with thy wickedness. 3Therefore theshowershave been withholden, and there hath been nolatterrain; and thou hadst a whoreâs forehead, thou refusedst to be ashamed. 4Wilt thou not from this time cry unto me, My father, thouartthe guide of my youth? 5Will he reservehisangerfor ever? will he keepitto the end? Behold, thou hast spoken and done evil things as thou couldest. 6Â¶TheLordsaid also unto me in the days of Josiah the king, Hast thou seenthatwhich backsliding Israel hath done? she is gone up upon every high mountain and under every green tree, and there hath played the harlot. 7And I said after she had done all thesethings,Turn thou unto me. But she returned not. And her treacheroussisterJudah sawit. 8And I saw, when for all the causes whereby backsliding Israel committedadulteryI had put her away, and given her a bill ofdivorce; yet her treacherous sister Judah feared not, but went and played the harlot also. 9And it came to pass through the lightness of her whoredom, that she defiled the land, andcommittedadultery withstonesand withstocks. 10And yet for all this her treacherous sister Judah hath not turned unto me with her whole heart, butfeignedly, saith theLord. 11And theLordsaid unto me, The backsliding Israel hathjustifiedherself more than treacherous Judah. 12Â¶Go andproclaimthese words toward thenorth, and say,Return, thou backsliding Israel, saith theLord;andI will not cause mine anger to fall upon you: for Iammerciful, saith theLord,andI will not keepangerfor ever. 13Only acknowledge thine iniquity, that thou hast transgressed against theLordthy God, and hast scattered thy ways to the strangers under every green tree, and ye have notobeyedmy voice, saith theLord. 14Turn, O backsliding children, saith theLord; for I ammarriedunto you: and I will take you one of a city, and two of a family, and I willbringyou toZion: 15And I will give youpastorsaccording to mine heart, which shall feed you withknowledgeand understanding. 16And it shall come to pass, when ye be multiplied and increased in the land, in those days, saith theLord, they shall say no more, Thearkof the covenant of theLord: neither shall it come to mind: neither shall they remember it; neither shall they visitit;neither shallthatbe done any more. 17At that time they shall callJerusalemthe throne of theLord; and all thenationsshall begatheredunto it, to the name of theLord, to Jerusalem: neither shall they walk any more after theimaginationof their evil heart. 18In those days thehouseof Judah shall walk with the house of Israel, and they shall come together out of thelandof thenorthto the land that I have given for an inheritance unto your fathers. 19But I said, How shall I put thee among the children, and give thee a pleasant land, a goodly heritage of the hosts of nations? and I said, Thou shalt call me, My father; and shalt not turn away from me. 20Â¶Surelyasa wife treacherouslydepartethfrom her husband, so have ye dealt treacherously with me, O house of Israel, saith theLord. 21A voice was heard upon the high places, weepingandsupplications of the children of Israel: for they have perverted their way,andthey have forgotten theLordtheir God. 22Return, ye backsliding children,andI willhealyour backslidings. Behold, we come unto thee; for thouarttheLordour God. 23Truly in vainis salvation hoped forfrom the hills,and fromthe multitude of mountains: truly in theLordour Godisthe salvation of Israel. 24For shame hath devoured the labour of our fathers from our youth; their flocks and their herds, their sons and their daughters. 25We lie down in ourshame, and our confusion covereth us: for we havesinnedagainst theLordour God, we and our fathers, from our youth even unto this day, and have not obeyed the voice of theLordour God."
    },
    {
      "reference": "Jeremiah 7",
      "title": "Jeremiah 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/7?lang=eng",
      "summary": "If the people of Judah repent, they will be preservedâThe temple has become a den of robbersâThe Lord rejects that generation of the people of Judah for their idolatriesâThey offer their children as sacrifices.",
      "verses": [
        "1The word that came to Jeremiah from theLord, saying,",
        "2Stand in the gate of theLordâs house, and proclaim there this word, and say, Hear the word of theLord, allye ofJudah, that enter in at these gates to worship theLord.",
        "3Thus saith theLordof hosts, the God of Israel,Amendyour ways and your doings, and I will cause you to dwell in this place.",
        "4Trust ye not in lying words, saying, The temple of theLord, The temple of theLord, The temple of theLord,arethese.",
        "5For if yethroughlyamend your ways and your doings; if ye throughly execute judgment between a man and his neighbour;",
        "6Ifye oppress not thestranger, thefatherless, and the widow, and shed not innocent blood in this place, neither walk after other gods to your hurt:",
        "7Then will I cause you to dwell in this place, in the land that I gave to your fathers, for ever and ever.",
        "8Â¶Behold, yetrustinlyingwords, that cannot profit.",
        "9Will ye steal,murder, and commit adultery, and swear falsely, and burn incense unto Baal, andwalkafter other gods whom ye know not;",
        "10And come andstandbefore me in this house, which is called by my name, and say, We are delivered to do all these abominations?",
        "11Is thishouse, which is called by my name, become adenofrobbersin your eyes? Behold, even I have seenit,saith theLord.",
        "12But go ye now unto my place whichwasinShiloh, where I set my name at the first, and see what I did to it for the wickedness of my people Israel.",
        "13And now, because ye have done all these works, saith theLord, and I spake unto you, rising up early and speaking, but ye heard not; and I called you, but yeanswerednot;",
        "14Therefore will I do untothishouse, which is called by my name, wherein ye trust, and unto the place which I gave to you and to your fathers, as I have done to Shiloh.",
        "15And I will cast you out of my sight, as I have cast out all your brethren,eventhe whole seed of Ephraim.",
        "16Therefore pray not thou for this people, neither lift up cry nor prayer for them, neither make intercession to me: for I will nothearthee.",
        "17Â¶Seest thou not what they do in the cities of Judah and in the streets of Jerusalem?",
        "18The children gather wood, and the fathers kindle the fire, and the women kneadtheirdough, to make cakes tothe queen of heaven, and to pour out drink offerings unto other gods, that they may provoke me to anger.",
        "19Do they provoke me to anger? saith theLord:do theynotprovokethemselvesto the confusionof their own faces?",
        "20Therefore thus saith the LordGod; Behold, mineangerand my fury shall be poured out upon this place, upon man, and upon beast, and upon the trees of the field, and upon the fruit of the ground; and it shall burn, and shall not be quenched.",
        "21Â¶Thus saith theLordof hosts, the God of Israel; Put your burnt offerings unto your sacrifices, and eat flesh.",
        "22For I spake not unto your fathers, nor commanded them in the day that I brought them out of the land of Egypt, concerning burnt offerings or sacrifices:",
        "23But this thing commanded I them, saying,Obeymyvoice, and I will be your God, and ye shall be my people: and walk ye in all the ways that I have commanded you, that it may be well unto you.",
        "24But they hearkened not, nor inclined their ear, but walked in the counselsandin theimaginationof their evil heart, and wentbackward, and not forward.",
        "25Since the day that your fathers came forth out of the land of Egypt unto this day I have evensentunto you all my servants theprophets, daily rising up early and sendingthem:",
        "26Yet they hearkened not unto me, nor inclined their ear, buthardenedtheir neck: they didworsethan their fathers.",
        "27Therefore thou shalt speak all these words unto them; but they will not hearken to thee: thou shalt also call unto them; but they will not answer thee.",
        "28But thou shalt say unto them, Thisisa nation thatobeyeth notthe voice of theLordtheir God, nor receiveth correction: truth isperished, and is cut off from their mouth.",
        "29Â¶Cut off thine hair,O Jerusalem,and castitaway, and take up alamentationon high places; for theLordhath rejected and forsaken the generation of his wrath.",
        "30For the children of Judah have done evil in my sight, saith theLord: they have set theirabominationsin the house which is called by my name, topolluteit.",
        "31And they have built the high places ofTophet, whichisin the valley of the son ofHinnom, toburntheir sons and their daughters in thefire; which I commandedthemnot, neither came it into my heart.",
        "32Â¶Therefore, behold, the days come, saith theLord, that it shall no more be called Tophet, nor the valley of the son of Hinnom, but the valley of slaughter: for they shall bury in Tophet, till there be no place.",
        "33And thecarcasesof this people shall be meat for the fowls of the heaven, and for the beasts of the earth; and none shall fraythemaway.",
        "34Then will I cause to cease from the cities of Judah, and from the streets of Jerusalem, the voice ofmirth, and thevoiceof gladness, the voice of the bridegroom, and the voice of the bride: for the land shall bedesolate."
      ],
      "full_text": "1The word that came to Jeremiah from theLord, saying, 2Stand in the gate of theLordâs house, and proclaim there this word, and say, Hear the word of theLord, allye ofJudah, that enter in at these gates to worship theLord. 3Thus saith theLordof hosts, the God of Israel,Amendyour ways and your doings, and I will cause you to dwell in this place. 4Trust ye not in lying words, saying, The temple of theLord, The temple of theLord, The temple of theLord,arethese. 5For if yethroughlyamend your ways and your doings; if ye throughly execute judgment between a man and his neighbour; 6Ifye oppress not thestranger, thefatherless, and the widow, and shed not innocent blood in this place, neither walk after other gods to your hurt: 7Then will I cause you to dwell in this place, in the land that I gave to your fathers, for ever and ever. 8Â¶Behold, yetrustinlyingwords, that cannot profit. 9Will ye steal,murder, and commit adultery, and swear falsely, and burn incense unto Baal, andwalkafter other gods whom ye know not; 10And come andstandbefore me in this house, which is called by my name, and say, We are delivered to do all these abominations? 11Is thishouse, which is called by my name, become adenofrobbersin your eyes? Behold, even I have seenit,saith theLord. 12But go ye now unto my place whichwasinShiloh, where I set my name at the first, and see what I did to it for the wickedness of my people Israel. 13And now, because ye have done all these works, saith theLord, and I spake unto you, rising up early and speaking, but ye heard not; and I called you, but yeanswerednot; 14Therefore will I do untothishouse, which is called by my name, wherein ye trust, and unto the place which I gave to you and to your fathers, as I have done to Shiloh. 15And I will cast you out of my sight, as I have cast out all your brethren,eventhe whole seed of Ephraim. 16Therefore pray not thou for this people, neither lift up cry nor prayer for them, neither make intercession to me: for I will nothearthee. 17Â¶Seest thou not what they do in the cities of Judah and in the streets of Jerusalem? 18The children gather wood, and the fathers kindle the fire, and the women kneadtheirdough, to make cakes tothe queen of heaven, and to pour out drink offerings unto other gods, that they may provoke me to anger. 19Do they provoke me to anger? saith theLord:do theynotprovokethemselvesto the confusionof their own faces? 20Therefore thus saith the LordGod; Behold, mineangerand my fury shall be poured out upon this place, upon man, and upon beast, and upon the trees of the field, and upon the fruit of the ground; and it shall burn, and shall not be quenched. 21Â¶Thus saith theLordof hosts, the God of Israel; Put your burnt offerings unto your sacrifices, and eat flesh. 22For I spake not unto your fathers, nor commanded them in the day that I brought them out of the land of Egypt, concerning burnt offerings or sacrifices: 23But this thing commanded I them, saying,Obeymyvoice, and I will be your God, and ye shall be my people: and walk ye in all the ways that I have commanded you, that it may be well unto you. 24But they hearkened not, nor inclined their ear, but walked in the counselsandin theimaginationof their evil heart, and wentbackward, and not forward. 25Since the day that your fathers came forth out of the land of Egypt unto this day I have evensentunto you all my servants theprophets, daily rising up early and sendingthem: 26Yet they hearkened not unto me, nor inclined their ear, buthardenedtheir neck: they didworsethan their fathers. 27Therefore thou shalt speak all these words unto them; but they will not hearken to thee: thou shalt also call unto them; but they will not answer thee. 28But thou shalt say unto them, Thisisa nation thatobeyeth notthe voice of theLordtheir God, nor receiveth correction: truth isperished, and is cut off from their mouth. 29Â¶Cut off thine hair,O Jerusalem,and castitaway, and take up alamentationon high places; for theLordhath rejected and forsaken the generation of his wrath. 30For the children of Judah have done evil in my sight, saith theLord: they have set theirabominationsin the house which is called by my name, topolluteit. 31And they have built the high places ofTophet, whichisin the valley of the son ofHinnom, toburntheir sons and their daughters in thefire; which I commandedthemnot, neither came it into my heart. 32Â¶Therefore, behold, the days come, saith theLord, that it shall no more be called Tophet, nor the valley of the son of Hinnom, but the valley of slaughter: for they shall bury in Tophet, till there be no place. 33And thecarcasesof this people shall be meat for the fowls of the heaven, and for the beasts of the earth; and none shall fraythemaway. 34Then will I cause to cease from the cities of Judah, and from the streets of Jerusalem, the voice ofmirth, and thevoiceof gladness, the voice of the bridegroom, and the voice of the bride: for the land shall bedesolate."
    },
    {
      "reference": "Jeremiah 16",
      "title": "Jeremiah 16",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/16?lang=eng",
      "summary": "The utter ruin of Judah is foreseenâIsrael is rejected and scattered for serving false godsâFishers and hunters will gather Israel again, and the people will serve the LordâThe gospel is to be restored.",
      "verses": [
        "1The word of theLordcame also unto me, saying,",
        "2Thou shalt not take thee a wife, neither shalt thou have sons or daughters in this place.",
        "3For thus saith theLordconcerning the sons and concerning the daughters that are born in this place, and concerning their mothers that bare them, and concerning their fathers that begat them in this land;",
        "4They shall die of grievous deaths; they shall not belamented; neither shall they be buried;butthey shall be as dung upon the face of the earth: and they shall beconsumedby the sword, and by famine; and theircarcasesshall be meat for the fowls of heaven, and for the beasts of the earth.",
        "5For thus saith theLord, Enter not into the house ofmourning, neither go to lament nor bemoan them: for I have taken away my peace from this people, saith theLord,evenlovingkindness and mercies.",
        "6Both the great and the small shall die in this land: they shall not be buried, neither shallmenlament for them,norcut themselves, nor make themselves bald for them:",
        "7Neither shallmentearthemselvesfor them in mourning, to comfort them for the dead; neither shallmengive them the cup of consolation to drink for their father or for their mother.",
        "8Thou shalt not also go into the house of feasting, to sit with them to eat and to drink.",
        "9For thus saith theLordof hosts, the God of Israel; Behold, I will cause to cease out of this place in your eyes, and in your days, the voice ofmirth, and the voice of gladness, the voice of the bridegroom, and the voice of the bride.",
        "10Â¶And it shall come to pass, when thou shalt shew this people all these words, and they shall say unto thee,Whereforehath theLordpronounced all this great evil against us? or whatisour iniquity? or whatisour sin that we have committed against theLordour God?",
        "11Then shalt thou say unto them, Because your fathers have forsaken me, saith theLord, and have walked after other gods, and have served them, and have worshipped them, and have forsaken me, and have not kept my law;",
        "12And ye have doneworsethan yourfathers; for, behold, ye walk every one after theimaginationof his evil heart, that they may not hearken unto me:",
        "13Therefore will Icastyou out of thislandinto a land that ye know not,neitherye nor your fathers; and there shall ye serve othergodsday and night; where I will notshew you favour.",
        "14Â¶Therefore, behold, the days come, saith theLord, that it shall no more be said, TheLordliveth, that brought up the children of Israel out of the land of Egypt;",
        "15But, TheLordliveth, thatbrought upthe children of Israel from the land of thenorth, and from all thelandswhither he had driven them: and I willbringthem again into theirlandthat I gave unto their fathers.",
        "16Â¶Behold, I will send for manyfishers, saith theLord, and they shall fish them; and after will I send for many hunters, and they shall hunt them from every mountain, and from every hill, and out of the holes of the rocks.",
        "17For mine eyesareupon all their ways: they are not hid from my face, neither is theiriniquityhid from mine eyes.",
        "18And first I willrecompensetheir iniquity and their sindouble; because they havedefiledmy land, they have filled mine inheritance with the carcases of their detestable and abominable things.",
        "19OLord, my strength, and my fortress, and my refuge in the day of affliction, theGentilesshall come unto thee from the ends of the earth, and shall say, Surely our fathers haveinheritedlies, vanity, andthingswhereinthere isno profit.",
        "20Shall a man makegodsunto himself, and theyarenogods?",
        "21Therefore, behold, I will this once cause them to know, I will cause them to know mine hand and my might; and they shallknowthat mynameisTheLord."
      ],
      "full_text": "1The word of theLordcame also unto me, saying, 2Thou shalt not take thee a wife, neither shalt thou have sons or daughters in this place. 3For thus saith theLordconcerning the sons and concerning the daughters that are born in this place, and concerning their mothers that bare them, and concerning their fathers that begat them in this land; 4They shall die of grievous deaths; they shall not belamented; neither shall they be buried;butthey shall be as dung upon the face of the earth: and they shall beconsumedby the sword, and by famine; and theircarcasesshall be meat for the fowls of heaven, and for the beasts of the earth. 5For thus saith theLord, Enter not into the house ofmourning, neither go to lament nor bemoan them: for I have taken away my peace from this people, saith theLord,evenlovingkindness and mercies. 6Both the great and the small shall die in this land: they shall not be buried, neither shallmenlament for them,norcut themselves, nor make themselves bald for them: 7Neither shallmentearthemselvesfor them in mourning, to comfort them for the dead; neither shallmengive them the cup of consolation to drink for their father or for their mother. 8Thou shalt not also go into the house of feasting, to sit with them to eat and to drink. 9For thus saith theLordof hosts, the God of Israel; Behold, I will cause to cease out of this place in your eyes, and in your days, the voice ofmirth, and the voice of gladness, the voice of the bridegroom, and the voice of the bride. 10Â¶And it shall come to pass, when thou shalt shew this people all these words, and they shall say unto thee,Whereforehath theLordpronounced all this great evil against us? or whatisour iniquity? or whatisour sin that we have committed against theLordour God? 11Then shalt thou say unto them, Because your fathers have forsaken me, saith theLord, and have walked after other gods, and have served them, and have worshipped them, and have forsaken me, and have not kept my law; 12And ye have doneworsethan yourfathers; for, behold, ye walk every one after theimaginationof his evil heart, that they may not hearken unto me: 13Therefore will Icastyou out of thislandinto a land that ye know not,neitherye nor your fathers; and there shall ye serve othergodsday and night; where I will notshew you favour. 14Â¶Therefore, behold, the days come, saith theLord, that it shall no more be said, TheLordliveth, that brought up the children of Israel out of the land of Egypt; 15But, TheLordliveth, thatbrought upthe children of Israel from the land of thenorth, and from all thelandswhither he had driven them: and I willbringthem again into theirlandthat I gave unto their fathers. 16Â¶Behold, I will send for manyfishers, saith theLord, and they shall fish them; and after will I send for many hunters, and they shall hunt them from every mountain, and from every hill, and out of the holes of the rocks. 17For mine eyesareupon all their ways: they are not hid from my face, neither is theiriniquityhid from mine eyes. 18And first I willrecompensetheir iniquity and their sindouble; because they havedefiledmy land, they have filled mine inheritance with the carcases of their detestable and abominable things. 19OLord, my strength, and my fortress, and my refuge in the day of affliction, theGentilesshall come unto thee from the ends of the earth, and shall say, Surely our fathers haveinheritedlies, vanity, andthingswhereinthere isno profit. 20Shall a man makegodsunto himself, and theyarenogods? 21Therefore, behold, I will this once cause them to know, I will cause them to know mine hand and my might; and they shallknowthat mynameisTheLord."
    },
    {
      "reference": "Jeremiah 17",
      "title": "Jeremiah 17",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/17?lang=eng",
      "summary": "The captivity of Judah comes because of sin and forsaking the LordâHallow the Sabbath day; doing so will save the people; otherwise they will be destroyed.",
      "verses": [
        "1The sin of Judahiswritten with a pen of iron,andwith the point of a diamond:it isgravenupon the table of their heart, and upon thehornsof your altars;",
        "2Whilst their children remember theiraltarsand theirgrovesby the green trees upon the high hills.",
        "3O mymountainin the field, I will give thy substanceandall thy treasures to the spoil,andthy high places for sin, throughout all thy borders.",
        "4And thou, even thyself, shalt discontinue from thine heritage that I gave thee; and I will cause thee toservethine enemies in thelandwhich thou knowest not: for ye have kindled a fire in mine anger,whichshall burn for ever.",
        "5Â¶Thus saith theLord;Cursedbethe man thattrustethin man, and makethfleshhis arm, and whose heartdepartethfrom theLord.",
        "6For he shall be like theheathin the desert, and shall not see when good cometh; but shall inhabit the parched places in the wilderness,inasaltland and not inhabited.",
        "7Blessedisthe man thattrustethin theLord, and whosehopetheLordis.",
        "8For he shall be as atreeplanted by the waters, andthatspreadeth out her roots by the river, and shall notseewhen heat cometh, but her leaf shall be green; and shall not be careful in the year ofdrought, neither shall cease from yielding fruit.",
        "9Â¶The heartisdeceitful above allthings,and desperately wicked: who can know it?",
        "10I theLordsearchtheheart,Itry thereins, even to give every man according to hisways,andaccording to the fruit of his doings.",
        "11Asthe partridge sittethon eggs,and hatcheththemnot;sohe that gettethriches, and not by right, shall leave them in the midst of his days, and at his end shall be a fool.",
        "12Â¶A glorious high throne from the beginningisthe place of our sanctuary.",
        "13OLord, the hope of Israel, all thatforsakethee shall be ashamed,andthey that depart from me shall be written in the earth, because they have forsaken theLord, the fountain of living waters.",
        "14Healme, OLord, and I shall be healed; save me, and I shall be saved: for thouartmypraise.",
        "15Â¶Behold, they say unto me, Whereisthe word of theLord? let itcomenow.",
        "16As for me, I have not hastened frombeinga pastor to follow thee: neither have I desired the woeful day; thou knowest: that which came out of my lips wasrightbefore thee.",
        "17Be not a terror unto me: thouartmyhopein the day of evil.",
        "18Let them beconfoundedthat persecute me, but let not me beconfounded: let them be dismayed, but let not me be dismayed: bring upon them the day of evil, and destroy them withdoubledestruction.",
        "19Â¶Thus said theLordunto me; Go and stand in the gate of the children of the people, whereby the kings of Judah come in, and by the which they go out, and in all the gates of Jerusalem;",
        "20And say unto them, Hear ye the word of theLord, ye kings of Judah, and all Judah, and all the inhabitants of Jerusalem, that enter in by these gates:",
        "21Thus saith theLord; Take heed to yourselves, and bear no burden on thesabbathday, nor bringitin by the gates of Jerusalem;",
        "22Neither carry forth a burden out of your houses on the sabbath day, neither do ye any work, but hallow ye the sabbath day, as I commanded your fathers.",
        "23But they obeyed not, neither inclined their ear, but made their neckstiff, that they might not hear, nor receive instruction.",
        "24And it shall come to pass, if ye diligently hearken unto me, saith theLord, to bring in no burden through the gates of this city on the sabbath day, but hallow the sabbath day, to do no work therein;",
        "25Then shall there enter into the gates of this citykingsand princes sitting upon the throne of David, riding in chariots and on horses, they, and their princes, the men of Judah, and the inhabitants of Jerusalem: and this city shall remain for ever.",
        "26And they shall come from the cities of Judah, and from the places about Jerusalem, and from the land of Benjamin, and from the plain, and from the mountains, and from the south, bringing burnt offerings, and sacrifices, and meat offerings, and incense, and bringing sacrifices of praise, unto the house of theLord.",
        "27But if ye will not hearken unto me to hallow thesabbathday, and not to bear a burden, even entering in at the gates of Jerusalem on the sabbath day; then will I kindle a fire in the gates thereof, and it shall devour thepalacesof Jerusalem, and it shall not be quenched."
      ],
      "full_text": "1The sin of Judahiswritten with a pen of iron,andwith the point of a diamond:it isgravenupon the table of their heart, and upon thehornsof your altars; 2Whilst their children remember theiraltarsand theirgrovesby the green trees upon the high hills. 3O mymountainin the field, I will give thy substanceandall thy treasures to the spoil,andthy high places for sin, throughout all thy borders. 4And thou, even thyself, shalt discontinue from thine heritage that I gave thee; and I will cause thee toservethine enemies in thelandwhich thou knowest not: for ye have kindled a fire in mine anger,whichshall burn for ever. 5Â¶Thus saith theLord;Cursedbethe man thattrustethin man, and makethfleshhis arm, and whose heartdepartethfrom theLord. 6For he shall be like theheathin the desert, and shall not see when good cometh; but shall inhabit the parched places in the wilderness,inasaltland and not inhabited. 7Blessedisthe man thattrustethin theLord, and whosehopetheLordis. 8For he shall be as atreeplanted by the waters, andthatspreadeth out her roots by the river, and shall notseewhen heat cometh, but her leaf shall be green; and shall not be careful in the year ofdrought, neither shall cease from yielding fruit. 9Â¶The heartisdeceitful above allthings,and desperately wicked: who can know it? 10I theLordsearchtheheart,Itry thereins, even to give every man according to hisways,andaccording to the fruit of his doings. 11Asthe partridge sittethon eggs,and hatcheththemnot;sohe that gettethriches, and not by right, shall leave them in the midst of his days, and at his end shall be a fool. 12Â¶A glorious high throne from the beginningisthe place of our sanctuary. 13OLord, the hope of Israel, all thatforsakethee shall be ashamed,andthey that depart from me shall be written in the earth, because they have forsaken theLord, the fountain of living waters. 14Healme, OLord, and I shall be healed; save me, and I shall be saved: for thouartmypraise. 15Â¶Behold, they say unto me, Whereisthe word of theLord? let itcomenow. 16As for me, I have not hastened frombeinga pastor to follow thee: neither have I desired the woeful day; thou knowest: that which came out of my lips wasrightbefore thee. 17Be not a terror unto me: thouartmyhopein the day of evil. 18Let them beconfoundedthat persecute me, but let not me beconfounded: let them be dismayed, but let not me be dismayed: bring upon them the day of evil, and destroy them withdoubledestruction. 19Â¶Thus said theLordunto me; Go and stand in the gate of the children of the people, whereby the kings of Judah come in, and by the which they go out, and in all the gates of Jerusalem; 20And say unto them, Hear ye the word of theLord, ye kings of Judah, and all Judah, and all the inhabitants of Jerusalem, that enter in by these gates: 21Thus saith theLord; Take heed to yourselves, and bear no burden on thesabbathday, nor bringitin by the gates of Jerusalem; 22Neither carry forth a burden out of your houses on the sabbath day, neither do ye any work, but hallow ye the sabbath day, as I commanded your fathers. 23But they obeyed not, neither inclined their ear, but made their neckstiff, that they might not hear, nor receive instruction. 24And it shall come to pass, if ye diligently hearken unto me, saith theLord, to bring in no burden through the gates of this city on the sabbath day, but hallow the sabbath day, to do no work therein; 25Then shall there enter into the gates of this citykingsand princes sitting upon the throne of David, riding in chariots and on horses, they, and their princes, the men of Judah, and the inhabitants of Jerusalem: and this city shall remain for ever. 26And they shall come from the cities of Judah, and from the places about Jerusalem, and from the land of Benjamin, and from the plain, and from the mountains, and from the south, bringing burnt offerings, and sacrifices, and meat offerings, and incense, and bringing sacrifices of praise, unto the house of theLord. 27But if ye will not hearken unto me to hallow thesabbathday, and not to bear a burden, even entering in at the gates of Jerusalem on the sabbath day; then will I kindle a fire in the gates thereof, and it shall devour thepalacesof Jerusalem, and it shall not be quenched."
    },
    {
      "reference": "Jeremiah 18",
      "title": "Jeremiah 18",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/18?lang=eng",
      "summary": "Israel is as potterâs clay in the hands of the LordâIf nations repent, the Lord withholds the evil decreed against themâThe people of Judah will be scattered.",
      "verses": [
        "1The word which came to Jeremiah from theLord, saying,",
        "2Arise, and go down to thepotterâshouse, and there I will cause thee to hear my words.",
        "3Then I went down to the potterâs house, and, behold, he wrought a work on the wheels.",
        "4And the vessel that he made of clay was marred in the hand of the potter: so he made it again another vessel, as seemed good to the potter to makeit.",
        "5Then the word of theLordcame to me, saying,",
        "6O house of Israel, cannot I do with you as thispotter? saith theLord. Behold, as the clayisin the potterâs hand, soareye in mine hand, O house of Israel.",
        "7At whatinstant I shall speak concerning a nation, and concerning a kingdom, to pluck up, and topulldown, and to destroyit;",
        "8If that nation, against whom I have pronounced,turnfrom their evil, I willrepent of the evilthat I thought to do unto them.",
        "9Andat whatinstant I shall speak concerning a nation, and concerning a kingdom, to build and to plantit;",
        "10If it doevilin my sight, that itobey notmy voice, then I willrepentof thegood, wherewith I said I would benefit them.",
        "11Â¶Now therefore go to, speak to the men of Judah, and to the inhabitants of Jerusalem, saying, Thus saith theLord; Behold, I frame evil against you, and devise a device against you: return ye now every one from his evil way, and make your ways and your doings good.",
        "12And they said, There is nohope: but we willwalkafter our own devices, and we will every one do the imagination of his evil heart.",
        "13Therefore thus saith theLord; Ask ye now among the heathen, who hath heard such things: the virgin of Israel hath done a very horrible thing.",
        "14Willa manleave the snow of Lebanonwhich comethfrom the rock of the field?orshall the cold flowing waters that come from another place be forsaken?",
        "15Because my people hathforgottenme, they have burned incense tovanity, and they have caused them to stumble in their waysfromthe ancient paths, to walk inpaths,ina way not cast up;",
        "16To make their landdesolate,anda perpetual hissing; every one that passeth thereby shall be astonished, andwaghis head.",
        "17I will scatter them as with aneast windbefore the enemy; I will shew them theback, and nottheface, in the day of their calamity.",
        "18Â¶Then said they, Come, and let usdevisedevices against Jeremiah; for the law shall not perish from the priest, nor counsel from the wise, nor the word from the prophet. Come, and let us smite him with the tongue, and let us not give heed to any of his words.",
        "19Give heed to me, OLord, and hearken to the voice of them that contend with me.",
        "20Shall evil be recompensed for good? for they have digged a pit for my soul. Remember that I stood before thee to speak good for them,andto turn away thy wrath from them.",
        "21Therefore deliver up their children to the famine, and pour out theirbloodby the force of the sword; and let their wives be bereaved of their children, andbewidows; and let their men be put to death;lettheir young menbeslain by the sword in battle.",
        "22Let a cry be heard from their houses, when thou shalt bring a troop suddenly upon them: for they have digged a pit to take me, and hid snares for my feet.",
        "23Yet,Lord, thou knowest all their counsel against me to slayme:forgive not their iniquity, neither blot out their sin from thy sight, but let them be overthrown before thee; dealthuswith them in the time of thine anger."
      ],
      "full_text": "1The word which came to Jeremiah from theLord, saying, 2Arise, and go down to thepotterâshouse, and there I will cause thee to hear my words. 3Then I went down to the potterâs house, and, behold, he wrought a work on the wheels. 4And the vessel that he made of clay was marred in the hand of the potter: so he made it again another vessel, as seemed good to the potter to makeit. 5Then the word of theLordcame to me, saying, 6O house of Israel, cannot I do with you as thispotter? saith theLord. Behold, as the clayisin the potterâs hand, soareye in mine hand, O house of Israel. 7At whatinstant I shall speak concerning a nation, and concerning a kingdom, to pluck up, and topulldown, and to destroyit; 8If that nation, against whom I have pronounced,turnfrom their evil, I willrepent of the evilthat I thought to do unto them. 9Andat whatinstant I shall speak concerning a nation, and concerning a kingdom, to build and to plantit; 10If it doevilin my sight, that itobey notmy voice, then I willrepentof thegood, wherewith I said I would benefit them. 11Â¶Now therefore go to, speak to the men of Judah, and to the inhabitants of Jerusalem, saying, Thus saith theLord; Behold, I frame evil against you, and devise a device against you: return ye now every one from his evil way, and make your ways and your doings good. 12And they said, There is nohope: but we willwalkafter our own devices, and we will every one do the imagination of his evil heart. 13Therefore thus saith theLord; Ask ye now among the heathen, who hath heard such things: the virgin of Israel hath done a very horrible thing. 14Willa manleave the snow of Lebanonwhich comethfrom the rock of the field?orshall the cold flowing waters that come from another place be forsaken? 15Because my people hathforgottenme, they have burned incense tovanity, and they have caused them to stumble in their waysfromthe ancient paths, to walk inpaths,ina way not cast up; 16To make their landdesolate,anda perpetual hissing; every one that passeth thereby shall be astonished, andwaghis head. 17I will scatter them as with aneast windbefore the enemy; I will shew them theback, and nottheface, in the day of their calamity. 18Â¶Then said they, Come, and let usdevisedevices against Jeremiah; for the law shall not perish from the priest, nor counsel from the wise, nor the word from the prophet. Come, and let us smite him with the tongue, and let us not give heed to any of his words. 19Give heed to me, OLord, and hearken to the voice of them that contend with me. 20Shall evil be recompensed for good? for they have digged a pit for my soul. Remember that I stood before thee to speak good for them,andto turn away thy wrath from them. 21Therefore deliver up their children to the famine, and pour out theirbloodby the force of the sword; and let their wives be bereaved of their children, andbewidows; and let their men be put to death;lettheir young menbeslain by the sword in battle. 22Let a cry be heard from their houses, when thou shalt bring a troop suddenly upon them: for they have digged a pit to take me, and hid snares for my feet. 23Yet,Lord, thou knowest all their counsel against me to slayme:forgive not their iniquity, neither blot out their sin from thy sight, but let them be overthrown before thee; dealthuswith them in the time of thine anger."
    },
    {
      "reference": "Jeremiah 20",
      "title": "Jeremiah 20",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/jer/20?lang=eng",
      "summary": "Jeremiah is smitten and put in the stocksâHe prophesies that all Judah will be taken captive by Babylon.",
      "verses": [
        "1NowPashurthe son ofImmerthe priest, whowasalsochief governorin the house of theLord, heard that Jeremiah prophesied these things.",
        "2Then PashursmoteJeremiah the prophet, and put him in the stocks thatwerein the high gate of Benjamin, whichwasby the house of theLord.",
        "3And it came to pass on the morrow, that Pashur brought forth Jeremiah out of the stocks. Thensaid Jeremiah unto him, TheLordhath not called thy name Pashur, butMagor-missabib.",
        "4For thus saith theLord, Behold, I will make thee a terror to thyself, and to all thy friends: and they shall fall by the sword of their enemies, and thine eyes shall beholdit:and I will give all Judah into the hand of the king of Babylon, and he shall carry themcaptiveinto Babylon, and shall slay them with the sword.",
        "5Moreover I will deliver all thestrengthof this city, and all the labours thereof, and all thepreciousthings thereof, and all the treasures of the kings of Judah will I give into the hand of their enemies, which shall spoil them, and take them, and carry them toBabylon.",
        "6And thou, Pashur, and all that dwell in thine house shall go into captivity: and thou shalt come to Babylon, and there thou shalt die, and shalt be buried there, thou, and all thy friends, to whom thou hast prophesiedlies.",
        "7Â¶OLord, thou hastdeceivedme, and I was deceived: thou art stronger than I, and hast prevailed: I am inderisiondaily, every one mocketh me.",
        "8For since I spake, I cried out, I criedviolenceand spoil; because the word of theLordwas made a reproach unto me, and a derision, daily.",
        "9Then I said, I will not make mention of him, nor speak any more in his name. Buthis wordwas in mine heart as aburningfire shut up in my bones, and I was weary with forbearing, and I could notstay.",
        "10Â¶For I heard thedefamingof many, fear on every side. Report,say they,and we will report it. All myfamiliarswatched for my halting,saying,Peradventure he will be enticed, and we shall prevail against him, and we shall take our revenge on him.",
        "11But theLordiswith me as a mighty terrible one: therefore my persecutors shall stumble, and they shall notprevail: they shall be greatly ashamed; for they shall not prosper:theireverlastingconfusionshall never be forgotten.",
        "12But, OLordof hosts, thattriestthe righteous,andseest thereinsand the heart, let me see thy vengeance on them: for unto thee have I opened my cause.",
        "13Sing unto theLord, praise ye theLord: for he hath delivered the soul of the poor from the hand of evildoers.",
        "14Â¶Cursedbethe day wherein I was born: let not the day wherein my mother bare me be blessed.",
        "15Cursedbethe man who brought tidings to my father, saying, A man child is born unto thee; making him very glad.",
        "16And let that man be as the cities which theLordoverthrew, and repented not: and let him hear the cry in the morning, and the shouting at noontide;",
        "17Because he slew me not from the womb; or that my mother might have been my grave, and her wombto bealways greatwith me.",
        "18Wherefore came I forth out of the womb to see labour andsorrow, that my days should be consumed with shame?"
      ],
      "full_text": "1NowPashurthe son ofImmerthe priest, whowasalsochief governorin the house of theLord, heard that Jeremiah prophesied these things. 2Then PashursmoteJeremiah the prophet, and put him in the stocks thatwerein the high gate of Benjamin, whichwasby the house of theLord. 3And it came to pass on the morrow, that Pashur brought forth Jeremiah out of the stocks. Thensaid Jeremiah unto him, TheLordhath not called thy name Pashur, butMagor-missabib. 4For thus saith theLord, Behold, I will make thee a terror to thyself, and to all thy friends: and they shall fall by the sword of their enemies, and thine eyes shall beholdit:and I will give all Judah into the hand of the king of Babylon, and he shall carry themcaptiveinto Babylon, and shall slay them with the sword. 5Moreover I will deliver all thestrengthof this city, and all the labours thereof, and all thepreciousthings thereof, and all the treasures of the kings of Judah will I give into the hand of their enemies, which shall spoil them, and take them, and carry them toBabylon. 6And thou, Pashur, and all that dwell in thine house shall go into captivity: and thou shalt come to Babylon, and there thou shalt die, and shalt be buried there, thou, and all thy friends, to whom thou hast prophesiedlies. 7Â¶OLord, thou hastdeceivedme, and I was deceived: thou art stronger than I, and hast prevailed: I am inderisiondaily, every one mocketh me. 8For since I spake, I cried out, I criedviolenceand spoil; because the word of theLordwas made a reproach unto me, and a derision, daily. 9Then I said, I will not make mention of him, nor speak any more in his name. Buthis wordwas in mine heart as aburningfire shut up in my bones, and I was weary with forbearing, and I could notstay. 10Â¶For I heard thedefamingof many, fear on every side. Report,say they,and we will report it. All myfamiliarswatched for my halting,saying,Peradventure he will be enticed, and we shall prevail against him, and we shall take our revenge on him. 11But theLordiswith me as a mighty terrible one: therefore my persecutors shall stumble, and they shall notprevail: they shall be greatly ashamed; for they shall not prosper:theireverlastingconfusionshall never be forgotten. 12But, OLordof hosts, thattriestthe righteous,andseest thereinsand the heart, let me see thy vengeance on them: for unto thee have I opened my cause. 13Sing unto theLord, praise ye theLord: for he hath delivered the soul of the poor from the hand of evildoers. 14Â¶Cursedbethe day wherein I was born: let not the day wherein my mother bare me be blessed. 15Cursedbethe man who brought tidings to my father, saying, A man child is born unto thee; making him very glad. 16And let that man be as the cities which theLordoverthrew, and repented not: and let him hear the cry in the morning, and the shouting at noontide; 17Because he slew me not from the womb; or that my mother might have been my grave, and her wombto bealways greatwith me. 18Wherefore came I forth out of the womb to see labour andsorrow, that my days should be consumed with shame?"
    }
  ],
  "scraped_timestamp": "2025-12-21 22:32:34",
  "metadata": {
    "week_number": 43,
    "title": "Week 43: October 19–25 - Jeremiah 1–3; 7; 16–18; 20",
    "date_range": "October 19–25",
    "scraped_at": "2025-12-21T22:32:42.355285",
    "scraper_version": "2.0.0"
  }
}