{
  "week_number": 49,
  "date_range": "November 30–December 6",
  "title": "Week 49: November 30–December 6 - Micah; Nahum; Habakkuk; Zephaniah",
  "bundle_title": "Week 49: November 30–December 6: \"Week 49: November 30–December 6 - Micah; Nahum; Habakkuk; Zephaniah\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/49?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/49?lang=eng",
    "title": "Micah;Nahum;Habakkuk;Zephaniah",
    "scripture_references": "Micah; Nahum; Habakkuk; Zephaniah",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\nReading the Old Testament often means reading prophecies about destruction. The Lord frequently called prophets to warn the wicked about His judgments. The ministries of Micah, Nahum, Habakkuk, and Zephaniah are good examples. In dreadful detail, these prophets foretold the downfall of cities that, at the time, seemed strong and powerful: Nineveh, Babylon, and Jerusalem. But that was thousands of years ago. Why is it valuable to read these prophecies today?\n\nEven though those prideful, wicked cities were destroyed, prideful wickedness persists. We may even detect traces of it in our own hearts. Old Testament prophets reveal how we can turn away from these evils. Perhaps that’s one reason we still read their words today. They weren’t just prophets of doom—they were prophets of deliverance. The descriptions of destruction are tempered by invitations to come unto Christ and receive His forgiveness. As Micah put it, the Lord does not delight in condemning us, but “he delighteth in mercy” (Micah 7:18). This was the Lord’s way anciently, and it is His way today. “His ways are everlasting” (Habakkuk 3:6).\n\nFor overviews of these books, see “Micah,” “Nahum,” “Habakkuk,” and “Zephaniah” in the Bible Dictionary.",
    "learning_at_home_church": [
      {
        "title": "“What doth the Lord require of thee?”",
        "content": "Micah invites us to imagine what it might be like to “come before the Lord, and bow … before the high God” (Micah 6:6). What doverses 6–8suggest to you about what is important to the Lord as He evaluates your life?\n\nSee also Dale G. Renlund, “Do Justly, Love Mercy, and Walk Humbly with God,”EnsignorLiahona, Nov. 2020, 109–12.\n\n“The Lord is good, a strong hold in the day of trouble” (Nahum 1:7).\n\nNahum 1"
      },
      {
        "title": "The Lord is both powerful and merciful.",
        "content": "Nahum’s mission was to foretell the destruction of Nineveh—the capital of the violent empire Assyria, which had scattered Israel and brutalized Judah. Nahum began by describing God’s wrath and matchless power, but He also spoke about God’s mercy and goodness. Look for verses inchapter 1that help you understand each of these attributes—and other attributes of God that you notice. Why do you think it is important to know each of these things about the Lord?\n\nHabakkuk"
      },
      {
        "title": "I can trust the Lord’s will and His timing.",
        "content": "Even prophets sometimes have questions about the Lord’s ways. Habakkuk, who lived at a time of widespread wickedness in Judah, began his record with questions to the Lord (seeHabakkuk 1:1–4). How would you summarize Habakkuk’s concerns? What similar questions do people ask about God today? Have you ever had similar feelings? You could also compare his questions with others in the scriptures, such as those found inMark 4:37–38andDoctrine and Covenants 121:1–6.\n\nThe Lord responded to Habakkuk’s questions by saying that He would send the Chaldeans (the Babylonians) to punish Judah (seeHabakkuk 1:5–11). But Habakkuk was still troubled, for it seemed unfair for the Lord to stand by “when the wicked [Babylon] devoureth the man that is more righteous [Judah]” (seeverses 12–17). What do you find inHabakkuk 2:1–4that inspires you to trust the Lord when you have unanswered questions? (see alsoMark 4:39–40;Doctrine and Covenants 121:7–8; “God Will Lift Us Up” [video], Gospel Library).\n\nGod Will Lift Us Up\n\nChapter 3is Habakkuk’s prayer of praise and faith. How is Habakkuk’s tone inchapter 3different fromchapter 1? Here’s an idea to help you ponderverses 17–19: Make a list of temporal and spiritual blessings God has given you. Then imagine that you lost the temporal blessings. How might that make you feel about the other blessings? Why might it be hard to “rejoice in the Lord” (verse 18) during hardships like those described inverse 17? Ponder how you can develop greater faith in God, even when life seems unfair.\n\nSee also Gerrit W. Gong, “All Things for Our Good,”Liahona, May 2024, 41–44; “Lead, Kindly Light,”Hymns, no. 97; Topics and Questions, “Seeking Answers to Questions,” Gospel Library.\n\nBe patient.Sometimes we want answers to our questions right away, but spiritual insights take time and cannot be forced. As the Lord told Habakkuk, “Wait for it; because it will surely come” (Habakkuk 2:3).\n\nZephaniah"
      },
      {
        "title": "“Seek ye the Lord, all ye meek of the earth.”",
        "content": "As you read Zephaniah’s prophecies, notice the attitudes and behaviors that led to destruction—see especiallyZephaniah 1:4–6, 12;2:8, 10, 15;3:1–4. Then look for the characteristics of the people God would preserve—seeZephaniah 2:1–3;3:12–13, 18–19. What message do you feel the Lord has for you in these verses?\n\nZephaniah 3:14–20"
      },
      {
        "title": "The Lord will rejoice with His people in Zion.",
        "content": "After readingZephaniah 3:14–20, see how many ways you can complete this sentence:“Be glad and rejoice with all the heart” because …Why is it important to you to know about these reasons to rejoice? You might compare these verses to the experiences described in3 Nephi 17and ponder how Jesus Christ feels about His people—including you.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "Jesus Christ was born in Bethlehem.",
        "content": "Your children may not know that it was a prophecy by Micah that helped the Wise Men find the baby Jesus in Bethlehem. UsingMicah 5:2andMatthew 2:1–6, perhaps your children could reenact their experience. Then you could talk about why Jesus’s birth was so important that prophets knew about it many years before He was born.\n\nThe Holy Child Is Born, by Dana Wood\n\nNahum 1:7"
      },
      {
        "title": "“The Lord is good, a strong hold in the day of trouble.”",
        "content": "After readingNahum 1:7, your children could build or draw a simple “strong hold” or fortress (there’s a picture of one in this outline). What are some reasons people might need a fortress? What makes our day a “day of trouble”? How is Jesus Christ like a stronghold for us?\n\nHabakkuk 2:3"
      },
      {
        "title": "God will always fulfill His promises.",
        "content": "To introduceHabakkuk 2:3, you and your children could talk about things that are good but only after we wait—like fruit that needs to ripen or dough that needs to bake. What would happen if we tried to eat the fruit or the dough before it was ready? Then you could talk about the prophet Habakkuk, who wanted to know when the Lord would stop the wickedness in the world. Read the Lord’s answer inHabakkuk 2:3. You could help your children think of things that God has promised. With each example, you could say together, “Wait for it; because it will surely come.”\n\nHabakkuk 2:14"
      },
      {
        "title": "I can help fill the earth with knowledge of Jesus Christ.",
        "content": "To illustrateHabakkuk 2:14, you and your children could fill a jar or other container with pictures or words representing things Jesus did or taught. How can we help fill the world with knowledge of the Lord?\n\nYou could also show your children a map of the world (see Church History Maps, no. 7, “Map of the World”). Help them find the place where they live and places where missionaries they know have served. You could sing together a song about sharing the gospel, such as “We’ll Bring the World His Truth” (Children’s Songbook, 172–73). What can we tell others about Jesus Christ?\n\nZephaniah 3:14–20"
      },
      {
        "title": "Jesus Christ rejoices with those who follow Him.",
        "content": "InZephaniah 3:14–20, your children could look for something that makes them want to “sing, … be glad and rejoice with all the heart.” Perhaps you could sing some joyful hymns or songs together and talk about the joy you find in the gospel of Jesus Christ.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nAnd He Took Their Little Children One by One, by Casey Childs"
      }
    ],
    "study_helps": [],
    "raw_text": "November 30–December 6. “He Delighteth in Mercy”: Micah; Nahum; Habakkuk; Zephaniah\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nNovember 30–December 6\nMicah; Nahum; Habakkuk; Zephaniah\nDecember 7–13\nHaggai 1–2; Zechariah 1–4; 7–14\nDecember 14–20\nMalachi\nDecember 21–27\nChristmas\nAppendixes\nNovember 30–December 6. “He Delighteth in Mercy”: Micah; Nahum; Habakkuk; Zephaniah\n“November 30–December 6. ‘He Delighteth in Mercy’: Micah; Nahum; Habakkuk; Zephaniah,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“November 30–December 6. ‘He Delighteth in Mercy,’”\nCome, Follow Me: Old Testament 2026\nIn the Beginning Was the Word\n, by Eva Timothy\nNovember 30–December 6: “He Delighteth in Mercy”\nMicah\n;\nNahum\n;\nHabakkuk\n;\nZephaniah\nReading the Old Testament often means reading prophecies about destruction. The Lord frequently called prophets to warn the wicked about His judgments. The ministries of Micah, Nahum, Habakkuk, and Zephaniah are good examples. In dreadful detail, these prophets foretold the downfall of cities that, at the time, seemed strong and powerful: Nineveh, Babylon, and Jerusalem. But that was thousands of years ago. Why is it valuable to read these prophecies today?\nEven though those prideful, wicked cities were destroyed, prideful wickedness persists. We may even detect traces of it in our own hearts. Old Testament prophets reveal how we can turn away from these evils. Perhaps that’s one reason we still read their words today. They weren’t just prophets of doom—they were prophets of deliverance. The descriptions of destruction are tempered by invitations to come unto Christ and receive His forgiveness. As Micah put it, the Lord does not delight in condemning us, but “he delighteth in mercy” (\nMicah 7:18\n). This was the Lord’s way anciently, and it is His way today. “His ways are everlasting” (\nHabakkuk 3:6\n).\nFor overviews of these books, see “\nMicah\n,” “\nNahum\n,” “\nHabakkuk\n,” and “\nZephaniah\n” in the Bible Dictionary.\nIdeas for Learning at Home and at Church\nMicah 6:1–8\n“What doth the Lord require of thee?”\nMicah invites us to imagine what it might be like to “come before the Lord, and bow … before the high God” (\nMicah 6:6\n). What do\nverses 6–8\nsuggest to you about what is important to the Lord as He evaluates your life?\nSee also Dale G. Renlund, “\nDo Justly, Love Mercy, and Walk Humbly with God\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 109–12.\n“The Lord is good, a strong hold in the day of trouble” (\nNahum 1:7\n).\nNahum 1\nThe Lord is both powerful and merciful.\nNahum’s mission was to foretell the destruction of Nineveh—the capital of the violent empire Assyria, which had scattered Israel and brutalized Judah. Nahum began by describing God’s wrath and matchless power, but He also spoke about God’s mercy and goodness. Look for verses in\nchapter 1\nthat help you understand each of these attributes—and other attributes of God that you notice. Why do you think it is important to know each of these things about the Lord?\nHabakkuk\nI can trust the Lord’s will and His timing.\nEven prophets sometimes have questions about the Lord’s ways. Habakkuk, who lived at a time of widespread wickedness in Judah, began his record with questions to the Lord (see\nHabakkuk 1:1–4\n). How would you summarize Habakkuk’s concerns? What similar questions do people ask about God today? Have you ever had similar feelings? You could also compare his questions with others in the scriptures, such as those found in\nMark 4:37–38\nand\nDoctrine and Covenants 121:1–6\n.\nThe Lord responded to Habakkuk’s questions by saying that He would send the Chaldeans (the Babylonians) to punish Judah (see\nHabakkuk 1:5–11\n). But Habakkuk was still troubled, for it seemed unfair for the Lord to stand by “when the wicked [Babylon] devoureth the man that is more righteous [Judah]” (see\nverses 12–17\n). What do you find in\nHabakkuk 2:1–4\nthat inspires you to trust the Lord when you have unanswered questions? (see also\nMark 4:39–40\n;\nDoctrine and Covenants 121:7–8\n; “God Will Lift Us Up” [video], Gospel Library).\n4:59\nGod Will Lift Us Up\nChapter 3\nis Habakkuk’s prayer of praise and faith. How is Habakkuk’s tone in\nchapter 3\ndifferent from\nchapter 1\n? Here’s an idea to help you ponder\nverses 17–19\n: Make a list of temporal and spiritual blessings God has given you. Then imagine that you lost the temporal blessings. How might that make you feel about the other blessings? Why might it be hard to “rejoice in the Lord” (\nverse 18\n) during hardships like those described in\nverse 17\n? Ponder how you can develop greater faith in God, even when life seems unfair.\nSee also Gerrit W. Gong, “\nAll Things for Our Good\n,”\nLiahona\n, May 2024, 41–44; “\nLead, Kindly Light\n,”\nHymns\n, no. 97; Topics and Questions, “\nSeeking Answers to Questions\n,” Gospel Library.\nBe patient.\nSometimes we want answers to our questions right away, but spiritual insights take time and cannot be forced. As the Lord told Habakkuk, “Wait for it; because it will surely come” (\nHabakkuk 2:3\n).\nZephaniah\n“Seek ye the Lord, all ye meek of the earth.”\nAs you read Zephaniah’s prophecies, notice the attitudes and behaviors that led to destruction—see especially\nZephaniah 1:4–6, 12\n;\n2:8, 10, 15\n;\n3:1–4\n. Then look for the characteristics of the people God would preserve—see\nZephaniah 2:1–3\n;\n3:12–13, 18–19\n. What message do you feel the Lord has for you in these verses?\nZephaniah 3:14–20\nThe Lord will rejoice with His people in Zion.\nAfter reading\nZephaniah 3:14–20\n, see how many ways you can complete this sentence:\n“Be glad and rejoice with all the heart” because …\nWhy is it important to you to know about these reasons to rejoice? You might compare these verses to the experiences described in\n3 Nephi 17\nand ponder how Jesus Christ feels about His people—including you.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nMicah 5:2\nJesus Christ was born in Bethlehem.\nYour children may not know that it was a prophecy by Micah that helped the Wise Men find the baby Jesus in Bethlehem. Using\nMicah 5:2\nand\nMatthew 2:1–6\n, perhaps your children could reenact their experience. Then you could talk about why Jesus’s birth was so important that prophets knew about it many years before He was born.\nThe Holy Child Is Born\n, by Dana Wood\nNahum 1:7\n“The Lord is good, a strong hold in the day of trouble.”\nAfter reading\nNahum 1:7\n, your children could build or draw a simple “strong hold” or fortress (there’s a picture of one in this outline). What are some reasons people might need a fortress? What makes our day a “day of trouble”? How is Jesus Christ like a stronghold for us?\nHabakkuk 2:3\nGod will always fulfill His promises.\nTo introduce\nHabakkuk 2:3\n, you and your children could talk about things that are good but only after we wait—like fruit that needs to ripen or dough that needs to bake. What would happen if we tried to eat the fruit or the dough before it was ready? Then you could talk about the prophet Habakkuk, who wanted to know when the Lord would stop the wickedness in the world. Read the Lord’s answer in\nHabakkuk 2:3\n. You could help your children think of things that God has promised. With each example, you could say together, “Wait for it; because it will surely come.”\nHabakkuk 2:14\nI can help fill the earth with knowledge of Jesus Christ.\nTo illustrate\nHabakkuk 2:14\n, you and your children could fill a jar or other container with pictures or words representing things Jesus did or taught. How can we help fill the world with knowledge of the Lord?\nYou could also show your children a map of the world (see Church History Maps, no. 7, “\nMap of the World\n”). Help them find the place where they live and places where missionaries they know have served. You could sing together a song about sharing the gospel, such as “\nWe’ll Bring the World His Truth\n” (\nChildren’s Songbook\n, 172–73). What can we tell others about Jesus Christ?\nZephaniah 3:14–20\nJesus Christ rejoices with those who follow Him.\nIn\nZephaniah 3:14–20\n, your children could look for something that makes them want to “sing, … be glad and rejoice with all the heart.” Perhaps you could sing some joyful hymns or songs together and talk about the joy you find in the gospel of Jesus Christ.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nAnd He Took Their Little Children One by One\n, by Casey Childs\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Micah 1",
      "title": "Micah",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/micah/1?lang=eng",
      "summary": "Micah prophesies the downfall of Samaria and Jerusalem.",
      "verses": [
        "1The word of theLordthat came toMicahthe Morasthite in the days ofJotham,Ahaz,andHezekiah, kings of Judah, which he saw concerning Samaria and Jerusalem.",
        "2Hear, all ye people; hearken, O earth, and all that therein is: and let the LordGodbe witness against you, the Lord from his holy temple.",
        "3For, behold, theLordcomethforth out of his place, and will come down, and tread upon the high places of the earth.",
        "4And themountainsshall be molten under him, and the valleys shall be cleft, aswaxbefore the fire,andas the watersthat arepoured down a steep place.",
        "5For thetransgressionof Jacobisall this, and for the sins of the house of Israel. Whatisthe transgression of Jacob?is itnot Samaria? and whatarethe high places of Judah?are theynot Jerusalem?",
        "6Therefore I will makeSamariaas an heap of the field,andas plantings of a vineyard: and I will pour down the stones thereof into the valley, and I willdiscoverthe foundations thereof.",
        "7And all the graven images thereofshall be beaten to pieces, and all the hires thereof shall be burned with the fire, and all the idols thereof will I lay desolate: for she gathereditof the hire of an harlot, and they shall return to the hire of an harlot.",
        "8Therefore I will wail and howl, I will go stripped and naked: I will make a wailing like the dragons, and mourning as the owls.",
        "9For her woundisincurable; for it is come unto Judah; he is come unto the gate of my people,evento Jerusalem.",
        "10Â¶Declare yeitnot atGath, weep ye not at all: in the house ofAphrahroll thyself in the dust.",
        "11Pass ye away, thou inhabitant of Saphir, having thy shame naked: the inhabitant of Zaanan came not forth in the mourning of Beth-ezel; he shall receive of you his standing.",
        "12For the inhabitant of Maroth waited carefully for good: but evil came down from theLordunto the gate of Jerusalem.",
        "13O thou inhabitant of Lachish, bind the chariot to the swift beast: sheisthe beginning of the sin to the daughter of Zion: for the transgressions of Israel were found in thee.",
        "14Therefore shalt thou give presents to Moresheth-gath: the houses of Achzibshall bea lie to the kings of Israel.",
        "15Yet will I bring an heir unto thee, O inhabitant of Mareshah: he shall come unto Adullam the glory of Israel.",
        "16Make thee bald, andpoll theefor thy delicate children; enlarge thy baldness as the eagle; for they are gone into captivity from thee."
      ],
      "full_text": "1The word of theLordthat came toMicahthe Morasthite in the days ofJotham,Ahaz,andHezekiah, kings of Judah, which he saw concerning Samaria and Jerusalem. 2Hear, all ye people; hearken, O earth, and all that therein is: and let the LordGodbe witness against you, the Lord from his holy temple. 3For, behold, theLordcomethforth out of his place, and will come down, and tread upon the high places of the earth. 4And themountainsshall be molten under him, and the valleys shall be cleft, aswaxbefore the fire,andas the watersthat arepoured down a steep place. 5For thetransgressionof Jacobisall this, and for the sins of the house of Israel. Whatisthe transgression of Jacob?is itnot Samaria? and whatarethe high places of Judah?are theynot Jerusalem? 6Therefore I will makeSamariaas an heap of the field,andas plantings of a vineyard: and I will pour down the stones thereof into the valley, and I willdiscoverthe foundations thereof. 7And all the graven images thereofshall be beaten to pieces, and all the hires thereof shall be burned with the fire, and all the idols thereof will I lay desolate: for she gathereditof the hire of an harlot, and they shall return to the hire of an harlot. 8Therefore I will wail and howl, I will go stripped and naked: I will make a wailing like the dragons, and mourning as the owls. 9For her woundisincurable; for it is come unto Judah; he is come unto the gate of my people,evento Jerusalem. 10Â¶Declare yeitnot atGath, weep ye not at all: in the house ofAphrahroll thyself in the dust. 11Pass ye away, thou inhabitant of Saphir, having thy shame naked: the inhabitant of Zaanan came not forth in the mourning of Beth-ezel; he shall receive of you his standing. 12For the inhabitant of Maroth waited carefully for good: but evil came down from theLordunto the gate of Jerusalem. 13O thou inhabitant of Lachish, bind the chariot to the swift beast: sheisthe beginning of the sin to the daughter of Zion: for the transgressions of Israel were found in thee. 14Therefore shalt thou give presents to Moresheth-gath: the houses of Achzibshall bea lie to the kings of Israel. 15Yet will I bring an heir unto thee, O inhabitant of Mareshah: he shall come unto Adullam the glory of Israel. 16Make thee bald, andpoll theefor thy delicate children; enlarge thy baldness as the eagle; for they are gone into captivity from thee."
    },
    {
      "reference": "Micah 2",
      "title": "Micah 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/micah/2?lang=eng",
      "summary": "The destruction of Israel is lamentedâThe Lord will gather the remnant of Israel.",
      "verses": [
        "1Woe to them that devise iniquity, and work evil upon their beds! when the morning is light, they practise it, because it is in the power of their hand.",
        "2And theycovetfields, and takethemby violence; and houses, and takethemaway: so they oppress a man and his house, even a man and his heritage.",
        "3Therefore thus saith theLord; Behold, against this family do I devise an evil, from which ye shall not remove your necks; neither shall ye go haughtily: for this timeisevil.",
        "4Â¶In that day shallonetake up a parable against you, and lament with a doleful lamentation,andsay, We be utterly spoiled: he hath changed the portion of my people: how hath he removeditfrom me! turning away he hath divided our fields.",
        "5Therefore thou shalt have none that shall cast a cord by lot in the congregation of theLord.",
        "6Prophesy ye not,say they to them thatprophesy: they shall not prophesy to them,thatthey shall not take shame.",
        "7Â¶Othou that artnamed the house of Jacob, is the spirit of theLordstraitened?arethese his doings? do not mywordsdo good to him that walketh uprightly?",
        "8Even of late my people is risen up as an enemy: ye pull off the robe with the garment from them that pass by securely as menaversefrom war.",
        "9The women of my people have ye cast out from their pleasant houses; from their children have ye taken away mygloryfor ever.",
        "10Arise ye, and depart; for thisisnotyourrest: because it is polluted, it shall destroyyou,even with a sore destruction.",
        "11If a man walking in the spiritandfalsehooddo lie,saying,I will prophesy unto thee of wine and of strong drink; he shall even be theprophetof this people.",
        "12Â¶I will surely assemble, O Jacob, all of thee; I will surelygathertheremnantof Israel; I will put them together as the sheep ofBozrah, as the flock in the midst of their fold: they shall make great noise by reason ofthe multitude ofmen.",
        "13The breaker is come up before them: they have broken up, and have passed through the gate, and are gone out by it: and theirkingshall pass before them, and theLordon the head of them."
      ],
      "full_text": "1Woe to them that devise iniquity, and work evil upon their beds! when the morning is light, they practise it, because it is in the power of their hand. 2And theycovetfields, and takethemby violence; and houses, and takethemaway: so they oppress a man and his house, even a man and his heritage. 3Therefore thus saith theLord; Behold, against this family do I devise an evil, from which ye shall not remove your necks; neither shall ye go haughtily: for this timeisevil. 4Â¶In that day shallonetake up a parable against you, and lament with a doleful lamentation,andsay, We be utterly spoiled: he hath changed the portion of my people: how hath he removeditfrom me! turning away he hath divided our fields. 5Therefore thou shalt have none that shall cast a cord by lot in the congregation of theLord. 6Prophesy ye not,say they to them thatprophesy: they shall not prophesy to them,thatthey shall not take shame. 7Â¶Othou that artnamed the house of Jacob, is the spirit of theLordstraitened?arethese his doings? do not mywordsdo good to him that walketh uprightly? 8Even of late my people is risen up as an enemy: ye pull off the robe with the garment from them that pass by securely as menaversefrom war. 9The women of my people have ye cast out from their pleasant houses; from their children have ye taken away mygloryfor ever. 10Arise ye, and depart; for thisisnotyourrest: because it is polluted, it shall destroyyou,even with a sore destruction. 11If a man walking in the spiritandfalsehooddo lie,saying,I will prophesy unto thee of wine and of strong drink; he shall even be theprophetof this people. 12Â¶I will surely assemble, O Jacob, all of thee; I will surelygathertheremnantof Israel; I will put them together as the sheep ofBozrah, as the flock in the midst of their fold: they shall make great noise by reason ofthe multitude ofmen. 13The breaker is come up before them: they have broken up, and have passed through the gate, and are gone out by it: and theirkingshall pass before them, and theLordon the head of them."
    },
    {
      "reference": "Micah 3",
      "title": "Micah 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/micah/3?lang=eng",
      "summary": "Priests who teach for hire and prophets who divine for money bring a curse upon the people.",
      "verses": [
        "1And I said, Hear, I pray you, O heads of Jacob, and ye princes of the house of Israel;Is itnot for you to know judgment?",
        "2Who hate the good, and love the evil; who pluck off their skin from off them, and their flesh from off their bones;",
        "3Who also eat the flesh of my people, and flay their skin from off them; and they break their bones, and chop them in pieces, as for the pot, and as flesh within the caldron.",
        "4Then shall theycryunto theLord, but he will not hear them: he will even hide his face from them at that time, as they have behaved themselves ill in their doings.",
        "5Â¶Thus saith theLordconcerning theprophetsthat make my people err, that bite with their teeth, and cry,Peace; and he that putteth not into their mouths, they even preparewaragainst him.",
        "6Thereforenightshall beunto you, that ye shall not have a vision; and it shall be dark unto you, that ye shall notdivine; and thesunshall go down over theprophets, and the day shall be dark over them.",
        "7Then shall the seers beashamed, and thedivinersconfounded: yea, they shall all cover their lips; forthere isnoanswer of God.",
        "8Â¶But truly I am full ofpowerby thespiritof theLord, and of judgment, and of might, to declare unto Jacob histransgression, and to Israel his sin.",
        "9Hear this, I pray you, ye heads of the house of Jacob, and princes of the house of Israel, that abhor judgment, and pervert all equity.",
        "10They build up Zion with blood, and Jerusalem with iniquity.",
        "11The heads thereof judge for reward, and the priests thereof teach for hire, and theprophetsthereof divine formoney: yet will they lean upon theLord, and say,Isnot theLordamong us? none evil can come upon us.",
        "12Therefore shall Zion for yoursakebeplowedasa field, andJerusalemshall becomeheaps, and the mountain ofthe houseas the high places of the forest."
      ],
      "full_text": "1And I said, Hear, I pray you, O heads of Jacob, and ye princes of the house of Israel;Is itnot for you to know judgment? 2Who hate the good, and love the evil; who pluck off their skin from off them, and their flesh from off their bones; 3Who also eat the flesh of my people, and flay their skin from off them; and they break their bones, and chop them in pieces, as for the pot, and as flesh within the caldron. 4Then shall theycryunto theLord, but he will not hear them: he will even hide his face from them at that time, as they have behaved themselves ill in their doings. 5Â¶Thus saith theLordconcerning theprophetsthat make my people err, that bite with their teeth, and cry,Peace; and he that putteth not into their mouths, they even preparewaragainst him. 6Thereforenightshall beunto you, that ye shall not have a vision; and it shall be dark unto you, that ye shall notdivine; and thesunshall go down over theprophets, and the day shall be dark over them. 7Then shall the seers beashamed, and thedivinersconfounded: yea, they shall all cover their lips; forthere isnoanswer of God. 8Â¶But truly I am full ofpowerby thespiritof theLord, and of judgment, and of might, to declare unto Jacob histransgression, and to Israel his sin. 9Hear this, I pray you, ye heads of the house of Jacob, and princes of the house of Israel, that abhor judgment, and pervert all equity. 10They build up Zion with blood, and Jerusalem with iniquity. 11The heads thereof judge for reward, and the priests thereof teach for hire, and theprophetsthereof divine formoney: yet will they lean upon theLord, and say,Isnot theLordamong us? none evil can come upon us. 12Therefore shall Zion for yoursakebeplowedasa field, andJerusalemshall becomeheaps, and the mountain ofthe houseas the high places of the forest."
    },
    {
      "reference": "Micah 4",
      "title": "Micah 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/micah/4?lang=eng",
      "summary": "In the last days, the temple will be built, Israel will gather to it, the millennial era will commence, and the Lord will reign in Zion.",
      "verses": [
        "1But in the last days it shall come to pass,thatthemountainof the house of theLordshall beestablishedin the top of the mountains, and it shall be exalted above the hills; and people shall flow unto it.",
        "2And many nations shall come, and say, Come, and let us go up to themountainof theLord, and to the house of the God of Jacob; and he will teach us of his ways, and we willwalkin his paths: for thelawshall go forth ofZion, and the word of theLordfromJerusalem.",
        "3Â¶And he shall judge among many people, and rebuke strong nations afar off; and they shall beat theirswordsinto plowshares, and their spears into pruninghooks: nation shall not lift up a sword against nation, neither shall they learnwarany more.",
        "4But they shall sit every man under hisvineand under his fig tree; and none shall makethemafraid: for the mouth of theLordof hosts hath spokenit.",
        "5For all people will walk every one in thenameof his god, and we will walk in thenameof theLordour God for ever and ever.",
        "6In that day, saith theLord, will I assemble her thathalteth, and I willgatherher that is driven out, and her that I have afflicted;",
        "7And I will make her that halted a remnant, and her that was cast far off a strong nation: and theLordshallreignover them in mountZionfrom henceforth, even for ever.",
        "8Â¶And thou, O tower of the flock, the strong hold of the daughter of Zion, unto thee shall it come, even the first dominion; the kingdom shall come to the daughter of Jerusalem.",
        "9Now why dost thou cry out aloud?is thereno king in thee? is thy counsellor perished? for pangs have taken thee as a woman in travail.",
        "10Be in pain, and labour to bring forth, O daughter of Zion, like a woman intravail: for now shalt thou go forth out of the city, and thou shalt dwell in the field, and thou shalt goeventoBabylon; there shalt thou be delivered; there theLordshall redeem thee from the hand of thineenemies.",
        "11Â¶Now also many nations aregatheredagainst thee, that say, Let her be defiled, and let our eye look upon Zion.",
        "12But they know not the thoughts of theLord, neither understand they his counsel: for he shall gather them as the sheaves into the floor.",
        "13Arise and thresh, O daughter of Zion: for I will make thine horn iron, and I will make thy hoofs brass: and thou shaltbeatin pieces many people: and I willconsecratetheir gain unto theLord, and their substance unto the Lord of the whole earth."
      ],
      "full_text": "1But in the last days it shall come to pass,thatthemountainof the house of theLordshall beestablishedin the top of the mountains, and it shall be exalted above the hills; and people shall flow unto it. 2And many nations shall come, and say, Come, and let us go up to themountainof theLord, and to the house of the God of Jacob; and he will teach us of his ways, and we willwalkin his paths: for thelawshall go forth ofZion, and the word of theLordfromJerusalem. 3Â¶And he shall judge among many people, and rebuke strong nations afar off; and they shall beat theirswordsinto plowshares, and their spears into pruninghooks: nation shall not lift up a sword against nation, neither shall they learnwarany more. 4But they shall sit every man under hisvineand under his fig tree; and none shall makethemafraid: for the mouth of theLordof hosts hath spokenit. 5For all people will walk every one in thenameof his god, and we will walk in thenameof theLordour God for ever and ever. 6In that day, saith theLord, will I assemble her thathalteth, and I willgatherher that is driven out, and her that I have afflicted; 7And I will make her that halted a remnant, and her that was cast far off a strong nation: and theLordshallreignover them in mountZionfrom henceforth, even for ever. 8Â¶And thou, O tower of the flock, the strong hold of the daughter of Zion, unto thee shall it come, even the first dominion; the kingdom shall come to the daughter of Jerusalem. 9Now why dost thou cry out aloud?is thereno king in thee? is thy counsellor perished? for pangs have taken thee as a woman in travail. 10Be in pain, and labour to bring forth, O daughter of Zion, like a woman intravail: for now shalt thou go forth out of the city, and thou shalt dwell in the field, and thou shalt goeventoBabylon; there shalt thou be delivered; there theLordshall redeem thee from the hand of thineenemies. 11Â¶Now also many nations aregatheredagainst thee, that say, Let her be defiled, and let our eye look upon Zion. 12But they know not the thoughts of theLord, neither understand they his counsel: for he shall gather them as the sheaves into the floor. 13Arise and thresh, O daughter of Zion: for I will make thine horn iron, and I will make thy hoofs brass: and thou shaltbeatin pieces many people: and I willconsecratetheir gain unto theLord, and their substance unto the Lord of the whole earth."
    },
    {
      "reference": "Micah 5",
      "title": "Micah 5",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/micah/5?lang=eng",
      "summary": "The Messiah will be born in BethlehemâIn the last days, the remnant of Jacob will triumph gloriously over the Gentiles.",
      "verses": [
        "1Now gather thyself in troops, O daughter of troops: he hath laid siege against us: they shall smite the judge of Israel with a rod upon the cheek.",
        "2But thou,Beth-lehemEphratah,thoughthou be little among the thousands ofJudah,yetout of thee shall he come forth unto methat isto berulerin Israel; whose goings forthhave beenfrom of old, fromeverlasting.",
        "3Therefore will he give them up, until the timethatshe which travaileth hath brought forth: then theremnantof his brethren shall return unto the children of Israel.",
        "4Â¶And he shall stand andfeedin thestrengthof theLord, in the majesty of the name of theLordhis God; and they shall abide: for now shall he be great unto the ends of the earth.",
        "5And thismanshall be thepeace, when the Assyrian shall come into our land: and when he shall tread in our palaces, then shall we raise against him seven shepherds, and eight principal men.",
        "6And they shall waste the land of Assyria with the sword, and the land ofNimrodin the entrances thereof: thus shall he deliverusfrom the Assyrian, when he cometh into our land, and when he treadeth within our borders.",
        "7And the remnant of Jacob shall be in the midst of many people as a dew from theLord, as the showers upon the grass, that tarrieth not for man, nor waiteth for the sons of men.",
        "8Â¶And theremnantof Jacob shall be among the Gentiles in the midst of many people as alionamong the beasts of the forest, as a younglionamong the flocks ofsheep: who, if he go through, both treadeth down, and teareth in pieces, and none can deliver.",
        "9Thine hand shall be lifted up upon thine adversaries, and all thine enemies shall be cut off.",
        "10And it shall come to pass in that day, saith theLord, that I will cut off thyhorsesout of the midst of thee, and I will destroy thy chariots:",
        "11And I will cut off the cities of thy land, and throw down all thy strong holds:",
        "12And I will cut off witchcrafts out of thine hand; and thou shalt have nomoresoothsayers:",
        "13Thy graven images also will I cut off, and thy standing images out of the midst of thee; and thou shalt no more worship the work of thine hands.",
        "14And I will pluck up thygrovesout of the midst of thee: so will I destroy thy cities.",
        "15And I will execute vengeance in anger and fury upon the heathen, such as they have not heard."
      ],
      "full_text": "1Now gather thyself in troops, O daughter of troops: he hath laid siege against us: they shall smite the judge of Israel with a rod upon the cheek. 2But thou,Beth-lehemEphratah,thoughthou be little among the thousands ofJudah,yetout of thee shall he come forth unto methat isto berulerin Israel; whose goings forthhave beenfrom of old, fromeverlasting. 3Therefore will he give them up, until the timethatshe which travaileth hath brought forth: then theremnantof his brethren shall return unto the children of Israel. 4Â¶And he shall stand andfeedin thestrengthof theLord, in the majesty of the name of theLordhis God; and they shall abide: for now shall he be great unto the ends of the earth. 5And thismanshall be thepeace, when the Assyrian shall come into our land: and when he shall tread in our palaces, then shall we raise against him seven shepherds, and eight principal men. 6And they shall waste the land of Assyria with the sword, and the land ofNimrodin the entrances thereof: thus shall he deliverusfrom the Assyrian, when he cometh into our land, and when he treadeth within our borders. 7And the remnant of Jacob shall be in the midst of many people as a dew from theLord, as the showers upon the grass, that tarrieth not for man, nor waiteth for the sons of men. 8Â¶And theremnantof Jacob shall be among the Gentiles in the midst of many people as alionamong the beasts of the forest, as a younglionamong the flocks ofsheep: who, if he go through, both treadeth down, and teareth in pieces, and none can deliver. 9Thine hand shall be lifted up upon thine adversaries, and all thine enemies shall be cut off. 10And it shall come to pass in that day, saith theLord, that I will cut off thyhorsesout of the midst of thee, and I will destroy thy chariots: 11And I will cut off the cities of thy land, and throw down all thy strong holds: 12And I will cut off witchcrafts out of thine hand; and thou shalt have nomoresoothsayers: 13Thy graven images also will I cut off, and thy standing images out of the midst of thee; and thou shalt no more worship the work of thine hands. 14And I will pluck up thygrovesout of the midst of thee: so will I destroy thy cities. 15And I will execute vengeance in anger and fury upon the heathen, such as they have not heard."
    },
    {
      "reference": "Micah 6",
      "title": "Micah 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/micah/6?lang=eng",
      "summary": "In spite of all His goodness to them, the people have not served the Lord in spirit and in truthâThey must act righteously, love mercy, and walk humbly before Him.",
      "verses": [
        "1Hear ye now what theLordsaith; Arise, contend thou before the mountains, and let the hills hear thy voice.",
        "2Hear ye, O mountains, theLordâscontroversy, and ye strong foundations of the earth: for theLordhath a controversy with his people, and he willpleadwith Israel.",
        "3O my people, what have I done unto thee? and wherein have I wearied thee? testify against me.",
        "4For I brought thee up out of the land of Egypt, andredeemedthee out of the house of servants; and I sent before thee Moses, Aaron, and Miriam.",
        "5O my people, remember nowwhatBalakking of Moab consulted, and what Balaam the son of Beor answered him from Shittim unto Gilgal; that ye may know the righteousness of theLord.",
        "6Â¶Wherewith shall I come before theLord,andbow myself before the high God? shall I come before him with burnt offerings, with calves of a year old?",
        "7Will theLordbe pleased with thousands oframs,orwith ten thousands of rivers of oil? shall I give myfirstbornformytransgression, the fruit of my bodyforthe sin of my soul?",
        "8He hath shewed thee, O man, whatisgood; and what doth theLordrequireof thee, but to dojustly, and to lovemercy, and towalkhumblywith thy God?",
        "9TheLordâs voice crieth unto the city, andthe man ofwisdom shall see thy name: hear ye the rod, and who hath appointed it.",
        "10Â¶Are there yet thetreasuresof wickedness in the house of the wicked, and the scant measurethat isabominable?",
        "11Shall I countthempurewith the wickedbalances, and with the bag of deceitful weights?",
        "12For the rich men thereof are full ofviolence, and the inhabitants thereof have spoken lies, and their tongueisdeceitful in their mouth.",
        "13Therefore also will I maketheesick in smiting thee, in makingtheedesolate because of thy sins.",
        "14Thou shalt eat, but not besatisfied; andthycasting downshall bein the midst of thee; and thou shalt take hold, but shalt not deliver; andthatwhich thou deliverest will I give up to the sword.",
        "15Thou shaltsow, but thou shalt not reap; thou shalt tread the olives, but thou shalt not anoint thee with oil; and sweet wine, but shalt not drink wine.",
        "16Â¶For the statutes ofOmriare kept, and all the works of the house of Ahab, and ye walk in their counsels; that I should make thee adesolation, and the inhabitants thereof an hissing: therefore ye shall bear thereproachof my people."
      ],
      "full_text": "1Hear ye now what theLordsaith; Arise, contend thou before the mountains, and let the hills hear thy voice. 2Hear ye, O mountains, theLordâscontroversy, and ye strong foundations of the earth: for theLordhath a controversy with his people, and he willpleadwith Israel. 3O my people, what have I done unto thee? and wherein have I wearied thee? testify against me. 4For I brought thee up out of the land of Egypt, andredeemedthee out of the house of servants; and I sent before thee Moses, Aaron, and Miriam. 5O my people, remember nowwhatBalakking of Moab consulted, and what Balaam the son of Beor answered him from Shittim unto Gilgal; that ye may know the righteousness of theLord. 6Â¶Wherewith shall I come before theLord,andbow myself before the high God? shall I come before him with burnt offerings, with calves of a year old? 7Will theLordbe pleased with thousands oframs,orwith ten thousands of rivers of oil? shall I give myfirstbornformytransgression, the fruit of my bodyforthe sin of my soul? 8He hath shewed thee, O man, whatisgood; and what doth theLordrequireof thee, but to dojustly, and to lovemercy, and towalkhumblywith thy God? 9TheLordâs voice crieth unto the city, andthe man ofwisdom shall see thy name: hear ye the rod, and who hath appointed it. 10Â¶Are there yet thetreasuresof wickedness in the house of the wicked, and the scant measurethat isabominable? 11Shall I countthempurewith the wickedbalances, and with the bag of deceitful weights? 12For the rich men thereof are full ofviolence, and the inhabitants thereof have spoken lies, and their tongueisdeceitful in their mouth. 13Therefore also will I maketheesick in smiting thee, in makingtheedesolate because of thy sins. 14Thou shalt eat, but not besatisfied; andthycasting downshall bein the midst of thee; and thou shalt take hold, but shalt not deliver; andthatwhich thou deliverest will I give up to the sword. 15Thou shaltsow, but thou shalt not reap; thou shalt tread the olives, but thou shalt not anoint thee with oil; and sweet wine, but shalt not drink wine. 16Â¶For the statutes ofOmriare kept, and all the works of the house of Ahab, and ye walk in their counsels; that I should make thee adesolation, and the inhabitants thereof an hissing: therefore ye shall bear thereproachof my people."
    },
    {
      "reference": "Micah 7",
      "title": "Micah 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/micah/7?lang=eng",
      "summary": "Though the people of Israel have rebelled, yet in the last days the Lord will have mercy on themâHe will have compassion and pardon their iniquities.",
      "verses": [
        "1Woe is me! for I am as when they have gathered the summer fruits, as the grapegleanings of the vintage:there isno cluster to eat: my soul desired the firstripe fruit.",
        "2The goodmanis perished out of the earth: andthere isnone upright among men: they all lie in wait for blood; they hunt every man hisbrotherwith a net.",
        "3Â¶That they may do evil with both hands earnestly, the prince asketh, and the judgeaskethfor a reward; and the greatman,he uttereth his mischievous desire: so they wrap it up.",
        "4The best of themisas a brier: the most uprightis sharperthan a thorn hedge: the day of thy watchmenandthyvisitationcometh; now shall be their perplexity.",
        "5Â¶Trustye not in a friend, put ye not confidence in a guide: keep the doors of thy mouth from her that lieth in thy bosom.",
        "6For the son dishonoureth thefather, the daughter riseth up against her mother, the daughter in law against her mother in law; a manâsenemiesarethe men of his ownhouse.",
        "7Therefore I will look unto theLord; I will wait for the God of my salvation: my God willhearme.",
        "8Â¶Rejoice not against me, O mine enemy: when I fall, I shall arise; when I sit indarkness, theLordshall bealightunto me.",
        "9I willbearthe indignation of theLord, because I have sinned against him, until he plead my cause, and execute judgment for me: he will bring me forth to thelight,andI shall behold his righteousness.",
        "10Thenshe that ismine enemy shall seeit,and shame shall cover her which said unto me, Where is theLordthy God? mine eyes shall behold her: now shall she betroddendown as the mire of the streets.",
        "11Inthe day that thy walls are to be built,inthat day shall the decree be far removed.",
        "12Inthat dayalsohe shallcomeeven to thee from Assyria, andfromthe fortified cities, and from the fortress even to the river, and from sea to sea, andfrommountain to mountain.",
        "13Notwithstanding the land shall be desolate because of them that dwell therein, for the fruit of their doings.",
        "14Â¶Feed thy people with thy rod, the flock of thine heritage, which dwell solitarilyinthe wood, in the midst of Carmel: let them feedinBashan and Gilead, as in the days of old.",
        "15According to the days of thy coming out of the land of Egypt will I shew unto him marvellousthings.",
        "16Â¶The nations shall see and be confounded at all their might: they shall laytheirhand upontheirmouth, their ears shall be deaf.",
        "17They shall lick the dust like a serpent, they shall move out of their holes like worms of the earth: they shall be afraid of theLordour God, and shall fear because of thee.",
        "18Whoisa God like unto thee, thatpardonethiniquity, and passeth by the transgression of the remnant of his heritage? he retaineth not hisangerfor ever, because hedelightethinmercy.",
        "19He will turn again, he will havecompassionupon us; he will subdue our iniquities; and thou wilt cast all their sins into the depths of the sea.",
        "20Thou wilt perform the truth to Jacob,andthe mercy toAbraham, which thou hastswornunto our fathers from the days of old."
      ],
      "full_text": "1Woe is me! for I am as when they have gathered the summer fruits, as the grapegleanings of the vintage:there isno cluster to eat: my soul desired the firstripe fruit. 2The goodmanis perished out of the earth: andthere isnone upright among men: they all lie in wait for blood; they hunt every man hisbrotherwith a net. 3Â¶That they may do evil with both hands earnestly, the prince asketh, and the judgeaskethfor a reward; and the greatman,he uttereth his mischievous desire: so they wrap it up. 4The best of themisas a brier: the most uprightis sharperthan a thorn hedge: the day of thy watchmenandthyvisitationcometh; now shall be their perplexity. 5Â¶Trustye not in a friend, put ye not confidence in a guide: keep the doors of thy mouth from her that lieth in thy bosom. 6For the son dishonoureth thefather, the daughter riseth up against her mother, the daughter in law against her mother in law; a manâsenemiesarethe men of his ownhouse. 7Therefore I will look unto theLord; I will wait for the God of my salvation: my God willhearme. 8Â¶Rejoice not against me, O mine enemy: when I fall, I shall arise; when I sit indarkness, theLordshall bealightunto me. 9I willbearthe indignation of theLord, because I have sinned against him, until he plead my cause, and execute judgment for me: he will bring me forth to thelight,andI shall behold his righteousness. 10Thenshe that ismine enemy shall seeit,and shame shall cover her which said unto me, Where is theLordthy God? mine eyes shall behold her: now shall she betroddendown as the mire of the streets. 11Inthe day that thy walls are to be built,inthat day shall the decree be far removed. 12Inthat dayalsohe shallcomeeven to thee from Assyria, andfromthe fortified cities, and from the fortress even to the river, and from sea to sea, andfrommountain to mountain. 13Notwithstanding the land shall be desolate because of them that dwell therein, for the fruit of their doings. 14Â¶Feed thy people with thy rod, the flock of thine heritage, which dwell solitarilyinthe wood, in the midst of Carmel: let them feedinBashan and Gilead, as in the days of old. 15According to the days of thy coming out of the land of Egypt will I shew unto him marvellousthings. 16Â¶The nations shall see and be confounded at all their might: they shall laytheirhand upontheirmouth, their ears shall be deaf. 17They shall lick the dust like a serpent, they shall move out of their holes like worms of the earth: they shall be afraid of theLordour God, and shall fear because of thee. 18Whoisa God like unto thee, thatpardonethiniquity, and passeth by the transgression of the remnant of his heritage? he retaineth not hisangerfor ever, because hedelightethinmercy. 19He will turn again, he will havecompassionupon us; he will subdue our iniquities; and thou wilt cast all their sins into the depths of the sea. 20Thou wilt perform the truth to Jacob,andthe mercy toAbraham, which thou hastswornunto our fathers from the days of old."
    },
    {
      "reference": "Nahum 1",
      "title": "Nahum",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/nahum/1?lang=eng",
      "summary": "Nahum speaks of the burning of the earth at the Second Coming and of the mercy and power of the Lord.",
      "verses": [
        "1The burden of Nineveh. The book of the vision of Nahum the Elkoshite.",
        "2Godisjealous, and theLordrevengeth; theLordrevengeth, andisfurious; theLordwill take vengeance on his adversaries, and he reservethwrathfor his enemies.",
        "3TheLordisslow to anger, and great in power, and will not at all acquitthewicked:theLordhathhis way in the whirlwind and in the storm, and the cloudsarethe dust of his feet.",
        "4He rebuketh the sea, and maketh it dry, and drieth up all the rivers: Bashan languisheth, and Carmel, and the flower of Lebanon languisheth.",
        "5The mountains quake at him, and the hillsmelt, and the earth isburnedat hispresence, yea, the world, and all that dwell therein.",
        "6Who can stand before hisindignation? and who can abide in the fierceness of his anger? his fury is poured out like fire, and the rocks are thrown down by him.",
        "7TheLordisgood, a strong hold in the day of trouble; and he knoweth them thattrustin him.",
        "8But with an overrunning flood he will make an utter end of the place thereof, and darkness shall pursue his enemies.",
        "9What do ye imagine against theLord? he will make an utter end: affliction shall not rise up the second time.",
        "10For whilethey befolden togetherasthorns, and while they are drunkenasdrunkards, they shall be devoured asstubblefully dry.",
        "11There isonecome out of thee, that imagineth evil against theLord, a wicked counsellor.",
        "12Thus saith theLord; Thoughthey bequiet, and likewise many, yet thus shall they be cut down, when he shall pass through. Though I have afflicted thee, I will afflict thee no more.",
        "13For now will I break hisyokefrom off thee, and will burst thy bonds in sunder.",
        "14And theLordhath given a commandment concerning thee,thatno more of thy name be sown: out of the house of thy gods will I cut off the graven image and the molten image: I will make thy grave; for thou art vile.",
        "15Behold upon the mountains thefeetof him that bringeth good tidings, that publisheth peace! O Judah, keep thy solemn feasts, perform thy vows: for the wicked shall no more pass through thee; he is utterly cut off."
      ],
      "full_text": "1The burden of Nineveh. The book of the vision of Nahum the Elkoshite. 2Godisjealous, and theLordrevengeth; theLordrevengeth, andisfurious; theLordwill take vengeance on his adversaries, and he reservethwrathfor his enemies. 3TheLordisslow to anger, and great in power, and will not at all acquitthewicked:theLordhathhis way in the whirlwind and in the storm, and the cloudsarethe dust of his feet. 4He rebuketh the sea, and maketh it dry, and drieth up all the rivers: Bashan languisheth, and Carmel, and the flower of Lebanon languisheth. 5The mountains quake at him, and the hillsmelt, and the earth isburnedat hispresence, yea, the world, and all that dwell therein. 6Who can stand before hisindignation? and who can abide in the fierceness of his anger? his fury is poured out like fire, and the rocks are thrown down by him. 7TheLordisgood, a strong hold in the day of trouble; and he knoweth them thattrustin him. 8But with an overrunning flood he will make an utter end of the place thereof, and darkness shall pursue his enemies. 9What do ye imagine against theLord? he will make an utter end: affliction shall not rise up the second time. 10For whilethey befolden togetherasthorns, and while they are drunkenasdrunkards, they shall be devoured asstubblefully dry. 11There isonecome out of thee, that imagineth evil against theLord, a wicked counsellor. 12Thus saith theLord; Thoughthey bequiet, and likewise many, yet thus shall they be cut down, when he shall pass through. Though I have afflicted thee, I will afflict thee no more. 13For now will I break hisyokefrom off thee, and will burst thy bonds in sunder. 14And theLordhath given a commandment concerning thee,thatno more of thy name be sown: out of the house of thy gods will I cut off the graven image and the molten image: I will make thy grave; for thou art vile. 15Behold upon the mountains thefeetof him that bringeth good tidings, that publisheth peace! O Judah, keep thy solemn feasts, perform thy vows: for the wicked shall no more pass through thee; he is utterly cut off."
    },
    {
      "reference": "Nahum 2",
      "title": "Nahum 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/nahum/2?lang=eng",
      "summary": "Nineveh will be destroyed, which is a symbol of what will be in the latter days.",
      "verses": [
        "1He that dasheth in pieces is come up before thy face: keep the munition,watchthe way, makethyloins strong, fortifythypower mightily.",
        "2For theLordhath turned away the excellency of Jacob, as the excellency of Israel: for the emptiers have emptied them out, and marred their vine branches.",
        "3The shield of his mighty men is made red, the valiant menarein scarlet: the chariotsshall bewith flaming torches in the day of his preparation, and thefir treesshall be terribly shaken.",
        "4The chariots shall rage in the streets, they shall justle one against another in the broad ways: they shall seem like torches, they shall run like the lightnings.",
        "5He shall recount hisworthies: they shall stumble in their walk; they shall make haste to the wall thereof, and the defence shall be prepared.",
        "6The gates of the rivers shall be opened, and the palace shall be dissolved.",
        "7AndHuzzabshall be led away captive, she shall be brought up, and her maids shall leadheras with the voice of doves, tabering upon their breasts.",
        "8But Ninevehisof old like a pool of water: yet they shall flee away. Stand, stand,shall they cry;but none shall look back.",
        "9Take ye the spoil of silver, take the spoil of gold: forthere isnone end of the storeandglory out of all the pleasant furniture.",
        "10She is empty, and void, and waste: and the heart melteth, and the knees smite together, and much painisin all loins, and the faces of them all gatherblackness.",
        "11Whereisthe dwelling of the lions, and the feedingplace of the young lions, where the lion,eventhe old lion, walked,andthe lionâs whelp, and none madethemafraid?",
        "12The lion did tear in pieces enough for his whelps, and strangled for his lionesses, and filled his holes with prey, and his dens withravin.",
        "13Behold, Iamagainst thee, saith theLordof hosts, and I will burn her chariots in the smoke, and the sword shall devour thy young lions: and I will cut off thy prey from the earth, and the voice of thy messengers shall no more be heard."
      ],
      "full_text": "1He that dasheth in pieces is come up before thy face: keep the munition,watchthe way, makethyloins strong, fortifythypower mightily. 2For theLordhath turned away the excellency of Jacob, as the excellency of Israel: for the emptiers have emptied them out, and marred their vine branches. 3The shield of his mighty men is made red, the valiant menarein scarlet: the chariotsshall bewith flaming torches in the day of his preparation, and thefir treesshall be terribly shaken. 4The chariots shall rage in the streets, they shall justle one against another in the broad ways: they shall seem like torches, they shall run like the lightnings. 5He shall recount hisworthies: they shall stumble in their walk; they shall make haste to the wall thereof, and the defence shall be prepared. 6The gates of the rivers shall be opened, and the palace shall be dissolved. 7AndHuzzabshall be led away captive, she shall be brought up, and her maids shall leadheras with the voice of doves, tabering upon their breasts. 8But Ninevehisof old like a pool of water: yet they shall flee away. Stand, stand,shall they cry;but none shall look back. 9Take ye the spoil of silver, take the spoil of gold: forthere isnone end of the storeandglory out of all the pleasant furniture. 10She is empty, and void, and waste: and the heart melteth, and the knees smite together, and much painisin all loins, and the faces of them all gatherblackness. 11Whereisthe dwelling of the lions, and the feedingplace of the young lions, where the lion,eventhe old lion, walked,andthe lionâs whelp, and none madethemafraid? 12The lion did tear in pieces enough for his whelps, and strangled for his lionesses, and filled his holes with prey, and his dens withravin. 13Behold, Iamagainst thee, saith theLordof hosts, and I will burn her chariots in the smoke, and the sword shall devour thy young lions: and I will cut off thy prey from the earth, and the voice of thy messengers shall no more be heard."
    },
    {
      "reference": "Nahum 3",
      "title": "Nahum 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/nahum/3?lang=eng",
      "summary": "The miserable downfall of Nineveh is foretold.",
      "verses": [
        "1Woe to the bloody city! itisall full of liesandrobbery; the prey departeth not;",
        "2The noise of a whip, and the noise of the rattling of the wheels, and of the pransing horses, and of the jumping chariots.",
        "3The horseman lifteth up both the bright sword and the glittering spear: andthere isa multitude of slain, and a great number of carcases; andthere isnone end oftheircorpses; they stumble upon their corpses:",
        "4Because of the multitude of the whoredoms of the wellfavoured harlot, the mistress of witchcrafts, that selleth nations through her whoredoms, and families through her witchcrafts.",
        "5Behold, Iamagainst thee, saith theLordof hosts; and I will discover thy skirts upon thy face, and I will shew the nations thy nakedness, and the kingdoms thy shame.",
        "6And I will cast abominable filth upon thee, and make thee vile, and will set thee as a gazingstock.",
        "7And it shall come to pass,thatall they that look upon thee shall flee from thee, and say, Nineveh is laid waste: who will bemoan her? whence shall I seek comforters for thee?",
        "8Art thou better thanpopulous No, that was situate among the rivers,that hadthe waters round about it, whose rampartwasthe sea,andherwallwasfrom the sea?",
        "9Ethiopia and Egyptwereher strength, andit wasinfinite;PutandLubimwere thy helpers.",
        "10Yetwasshe carried away, she went into captivity: her youngchildrenalso were dashed in pieces at the top of all the streets: and they cast lots for her honourable men, and all her great men were bound in chains.",
        "11Thou also shalt be drunken: thou shalt be hid, thou also shalt seek strength because of the enemy.",
        "12All thy strong holdsshall be likefig trees with the firstripe figs: if they be shaken, they shall even fall into the mouth of the eater.",
        "13Behold, thy people in the midst of theearewomen: the gates of thy land shall be set wide open untothine enemies: the fire shall devour thy bars.",
        "14Draw thee waters for the siege, fortify thy strong holds: go into clay, and tread the mortar, make strong the brickkiln.",
        "15There shall the fire devour thee; the sword shall cut thee off, it shall eat thee up like the cankerworm: make thyself many as the cankerworm, make thyself many as the locusts.",
        "16Thou hast multiplied thy merchants above the stars of heaven: the cankerworm spoileth, and flieth away.",
        "17Thy crownedareas the locusts, and thy captains as the great grasshoppers, which camp in the hedges in the cold day,butwhen the sun ariseth they flee away, and their place is not known where theyare.",
        "18Thy shepherds slumber, O king of Assyria: thy nobles shall dwellin the dust:thy people is scattered upon the mountains, and no man gathereththem.",
        "19There isno healing of thy bruise; thy wound is grievous: all that hear thebruitof thee shall clap the hands over thee: for upon whom hath not thy wickedness passed continually?"
      ],
      "full_text": "1Woe to the bloody city! itisall full of liesandrobbery; the prey departeth not; 2The noise of a whip, and the noise of the rattling of the wheels, and of the pransing horses, and of the jumping chariots. 3The horseman lifteth up both the bright sword and the glittering spear: andthere isa multitude of slain, and a great number of carcases; andthere isnone end oftheircorpses; they stumble upon their corpses: 4Because of the multitude of the whoredoms of the wellfavoured harlot, the mistress of witchcrafts, that selleth nations through her whoredoms, and families through her witchcrafts. 5Behold, Iamagainst thee, saith theLordof hosts; and I will discover thy skirts upon thy face, and I will shew the nations thy nakedness, and the kingdoms thy shame. 6And I will cast abominable filth upon thee, and make thee vile, and will set thee as a gazingstock. 7And it shall come to pass,thatall they that look upon thee shall flee from thee, and say, Nineveh is laid waste: who will bemoan her? whence shall I seek comforters for thee? 8Art thou better thanpopulous No, that was situate among the rivers,that hadthe waters round about it, whose rampartwasthe sea,andherwallwasfrom the sea? 9Ethiopia and Egyptwereher strength, andit wasinfinite;PutandLubimwere thy helpers. 10Yetwasshe carried away, she went into captivity: her youngchildrenalso were dashed in pieces at the top of all the streets: and they cast lots for her honourable men, and all her great men were bound in chains. 11Thou also shalt be drunken: thou shalt be hid, thou also shalt seek strength because of the enemy. 12All thy strong holdsshall be likefig trees with the firstripe figs: if they be shaken, they shall even fall into the mouth of the eater. 13Behold, thy people in the midst of theearewomen: the gates of thy land shall be set wide open untothine enemies: the fire shall devour thy bars. 14Draw thee waters for the siege, fortify thy strong holds: go into clay, and tread the mortar, make strong the brickkiln. 15There shall the fire devour thee; the sword shall cut thee off, it shall eat thee up like the cankerworm: make thyself many as the cankerworm, make thyself many as the locusts. 16Thou hast multiplied thy merchants above the stars of heaven: the cankerworm spoileth, and flieth away. 17Thy crownedareas the locusts, and thy captains as the great grasshoppers, which camp in the hedges in the cold day,butwhen the sun ariseth they flee away, and their place is not known where theyare. 18Thy shepherds slumber, O king of Assyria: thy nobles shall dwellin the dust:thy people is scattered upon the mountains, and no man gathereththem. 19There isno healing of thy bruise; thy wound is grievous: all that hear thebruitof thee shall clap the hands over thee: for upon whom hath not thy wickedness passed continually?"
    },
    {
      "reference": "Habakkuk 1",
      "title": "Habakkuk",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/hab/1?lang=eng",
      "summary": "When Habakkuk learns that the Lord will raise up the Chaldeans to overrun the land of Israel, he is troubled that the wicked can be thus employed.",
      "verses": [
        "1The burden which Habakkuk the prophet did see.",
        "2OLord,howlong shall I cry, and thou wilt not hear!evencry out unto theeofviolence, and thou wilt not save!",
        "3Why dost thou shew me iniquity, and causemeto behold grievance? for spoiling and violencearebefore me: and there arethatraise upstrifeand contention.",
        "4Therefore the lawis slacked, and judgment doth never go forth: for the wicked doth compass about the righteous; therefore wrong judgment proceedeth.",
        "5Â¶Behold ye among the heathen, and regard, and wonder marvellously: forIwill work aworkin your days,whichye will not believe, though it be toldyou.",
        "6For, lo, I raise up the Chaldeans,thatbitter and hasty nation, which shall march through the breadth of the land, to possess the dwellingplacesthat arenot theirs.",
        "7Theyareterrible and dreadful: their judgment and their dignityshall proceed of themselves.",
        "8Their horses also are swifter than the leopards, and are more fierce than the evening wolves: and their horsemen shall spread themselves, and their horsemen shall come from far; they shall fly as the eaglethathasteth to eat.",
        "9They shall come all for violence: their faces shall sup upasthe east wind, and they shall gatherthe captivityas the sand.",
        "10And they shall scoff at the kings, and the princes shall be a scorn unto them: they shall deride every stronghold; for they shall heap dust, and take it.",
        "11Then shallhismindchange, and he shall pass over, and offend,imputingthis his power unto his god.",
        "12Â¶Artthou not from everlasting, OLordmy God, mine Holy One? we shall not die. OLord, thou hast ordained them for judgment; and, O mighty God, thou hast established them for correction.",
        "13Thou artof purer eyes than to behold evil, and canst not look on iniquity: wherefore lookest thou upon them that deal treacherously,andholdest thy tongue when the wicked devoureththe man that ismore righteous than he?",
        "14And makest men as the fishes of the sea, as the creeping things,that haveno ruler over them?",
        "15They take up all of them with theangle, they catch them in their net, and gather them in theirdrag: therefore they rejoice and are glad.",
        "16Therefore they sacrifice unto their net, and burn incense unto their drag; because by them their portionisfat, and their meat plenteous.",
        "17Shall they therefore empty their net, and not spare continually to slay the nations?"
      ],
      "full_text": "1The burden which Habakkuk the prophet did see. 2OLord,howlong shall I cry, and thou wilt not hear!evencry out unto theeofviolence, and thou wilt not save! 3Why dost thou shew me iniquity, and causemeto behold grievance? for spoiling and violencearebefore me: and there arethatraise upstrifeand contention. 4Therefore the lawis slacked, and judgment doth never go forth: for the wicked doth compass about the righteous; therefore wrong judgment proceedeth. 5Â¶Behold ye among the heathen, and regard, and wonder marvellously: forIwill work aworkin your days,whichye will not believe, though it be toldyou. 6For, lo, I raise up the Chaldeans,thatbitter and hasty nation, which shall march through the breadth of the land, to possess the dwellingplacesthat arenot theirs. 7Theyareterrible and dreadful: their judgment and their dignityshall proceed of themselves. 8Their horses also are swifter than the leopards, and are more fierce than the evening wolves: and their horsemen shall spread themselves, and their horsemen shall come from far; they shall fly as the eaglethathasteth to eat. 9They shall come all for violence: their faces shall sup upasthe east wind, and they shall gatherthe captivityas the sand. 10And they shall scoff at the kings, and the princes shall be a scorn unto them: they shall deride every stronghold; for they shall heap dust, and take it. 11Then shallhismindchange, and he shall pass over, and offend,imputingthis his power unto his god. 12Â¶Artthou not from everlasting, OLordmy God, mine Holy One? we shall not die. OLord, thou hast ordained them for judgment; and, O mighty God, thou hast established them for correction. 13Thou artof purer eyes than to behold evil, and canst not look on iniquity: wherefore lookest thou upon them that deal treacherously,andholdest thy tongue when the wicked devoureththe man that ismore righteous than he? 14And makest men as the fishes of the sea, as the creeping things,that haveno ruler over them? 15They take up all of them with theangle, they catch them in their net, and gather them in theirdrag: therefore they rejoice and are glad. 16Therefore they sacrifice unto their net, and burn incense unto their drag; because by them their portionisfat, and their meat plenteous. 17Shall they therefore empty their net, and not spare continually to slay the nations?"
    },
    {
      "reference": "Habakkuk 2",
      "title": "Habakkuk 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/hab/2?lang=eng",
      "summary": "The Lord admonishes patience and promises that the just will live by faithâThe earth will be filled with knowledge about GodâIdols have no power.",
      "verses": [
        "1I will stand upon my watch, and set me upon the tower, and will watch to see what he will say unto me, and what I shall answer when I am reproved.",
        "2And theLordanswered me, and said,Writethe vision, and makeitplain upon tables, that he may run that readeth it.",
        "3For the visionisyet for an appointed time, but at the end it shall speak, and not lie: though it tarry, wait for it; because it will surelycome, it will not tarry.",
        "4Behold, his soulwhichis lifted up is not upright in him: but the just shall live by hisfaith.",
        "5Â¶Yea also, because he transgresseth by wine,he isa proud man, neither keepeth at home, who enlargeth his desire as hell, andisas death, and cannot be satisfied, but gathereth unto him all nations, and heapeth unto him all people:",
        "6Shall not all these take up a parable against him, and a taunting proverb against him, and say, Woe to him that increaseththat which isnot his! how long? and to him that ladeth himself with thick clay!",
        "7Shall they not rise up suddenly that shall bite thee, and awake that shall vex thee, and thou shalt be forbootiesunto them?",
        "8Because thou hastspoiledmany nations, all the remnant of the people shall spoil thee; because of menâs blood, andforthe violence of the land, of the city, and of all that dwell therein.",
        "9Â¶Woe to him thatcovetethan evil covetousness to his house, that he may set his nest on high, that he may be delivered from the power of evil!",
        "10Thou hastconsultedshame to thy house by cutting off many people, and hast sinnedagainstthy soul.",
        "11For the stone shall cry out of the wall, andthebeam out of the timber shall answer it.",
        "12Â¶Woe to him that buildeth a town withblood, and stablisheth a city by iniquity!",
        "13Behold,is itnot of theLordof hosts that the people shall labour inthe very fire, and the people shall weary themselves for veryvanity?",
        "14For theearthshall be filled with theknowledgeof the glory of theLord, as the waters cover the sea.",
        "15Â¶Woe unto him that giveth his neighbour drink, that puttest thy bottle tohim,and makesthimdrunkenalso, that thou mayest look on their nakedness!",
        "16Thou art filledwith shame for glory: drink thou also, and let thy foreskin be uncovered: the cup of theLordâs right hand shall be turned unto thee, and shameful spewingshall beon thy glory.",
        "17For the violence of Lebanon shall cover thee, and the spoil of beasts,whichmade them afraid, because of menâs blood, and for the violence of the land, of the city, and of all that dwell therein.",
        "18Â¶What profiteth the gravenimagethat the maker thereof hath graven it; the molten image, and a teacher of lies, that the maker of his work trusteth therein, to make dumb idols?",
        "19Woe unto him that saith to the wood, Awake; to the dumb stone, Arise, it shall teach! Behold, itislaid over with gold and silver, andthere isno breath at all in the midst of it.",
        "20But theLordisin his holy temple: let all the earth keepsilencebefore him."
      ],
      "full_text": "1I will stand upon my watch, and set me upon the tower, and will watch to see what he will say unto me, and what I shall answer when I am reproved. 2And theLordanswered me, and said,Writethe vision, and makeitplain upon tables, that he may run that readeth it. 3For the visionisyet for an appointed time, but at the end it shall speak, and not lie: though it tarry, wait for it; because it will surelycome, it will not tarry. 4Behold, his soulwhichis lifted up is not upright in him: but the just shall live by hisfaith. 5Â¶Yea also, because he transgresseth by wine,he isa proud man, neither keepeth at home, who enlargeth his desire as hell, andisas death, and cannot be satisfied, but gathereth unto him all nations, and heapeth unto him all people: 6Shall not all these take up a parable against him, and a taunting proverb against him, and say, Woe to him that increaseththat which isnot his! how long? and to him that ladeth himself with thick clay! 7Shall they not rise up suddenly that shall bite thee, and awake that shall vex thee, and thou shalt be forbootiesunto them? 8Because thou hastspoiledmany nations, all the remnant of the people shall spoil thee; because of menâs blood, andforthe violence of the land, of the city, and of all that dwell therein. 9Â¶Woe to him thatcovetethan evil covetousness to his house, that he may set his nest on high, that he may be delivered from the power of evil! 10Thou hastconsultedshame to thy house by cutting off many people, and hast sinnedagainstthy soul. 11For the stone shall cry out of the wall, andthebeam out of the timber shall answer it. 12Â¶Woe to him that buildeth a town withblood, and stablisheth a city by iniquity! 13Behold,is itnot of theLordof hosts that the people shall labour inthe very fire, and the people shall weary themselves for veryvanity? 14For theearthshall be filled with theknowledgeof the glory of theLord, as the waters cover the sea. 15Â¶Woe unto him that giveth his neighbour drink, that puttest thy bottle tohim,and makesthimdrunkenalso, that thou mayest look on their nakedness! 16Thou art filledwith shame for glory: drink thou also, and let thy foreskin be uncovered: the cup of theLordâs right hand shall be turned unto thee, and shameful spewingshall beon thy glory. 17For the violence of Lebanon shall cover thee, and the spoil of beasts,whichmade them afraid, because of menâs blood, and for the violence of the land, of the city, and of all that dwell therein. 18Â¶What profiteth the gravenimagethat the maker thereof hath graven it; the molten image, and a teacher of lies, that the maker of his work trusteth therein, to make dumb idols? 19Woe unto him that saith to the wood, Awake; to the dumb stone, Arise, it shall teach! Behold, itislaid over with gold and silver, andthere isno breath at all in the midst of it. 20But theLordisin his holy temple: let all the earth keepsilencebefore him."
    },
    {
      "reference": "Habakkuk 3",
      "title": "Habakkuk 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/hab/3?lang=eng",
      "summary": "In his prayer Habakkuk trembles at the majesty of God.",
      "verses": [
        "1A prayer of Habakkuk the prophet uponShigionoth.",
        "2OLord, I have heard thy speech,andwas afraid: OLord, revive thy work in the midst of the years, in the midst of the years make known; in wrath remember mercy.",
        "3God came from Teman, and the Holy One from mountParan.Selah. His glory covered the heavens, and the earth was full of his praise.",
        "4Andhisbrightness was as the light;hehad hornscomingout of his hand: and therewasthe hiding of his power.",
        "5Before him went the pestilence, andburning coalswent forth at his feet.",
        "6He stood, and measured the earth: he beheld, and drove asunder the nations; and the everlasting mountains were scattered, the perpetualhillsdid bow: his waysareeverlasting.",
        "7I saw the tents ofCushanin affliction:andthe curtains of the land ofMidiandid tremble.",
        "8Was theLorddispleased against the rivers?wasthine anger against the rivers?wasthy wrath against the sea, that thou didst ride upon thine horsesandthy chariots of salvation?",
        "9Thy bow was made quite naked,accordingto the oaths of the tribes,even thyword.Selah. Thou didst cleave the earth with rivers.",
        "10Themountainssaw thee,andthey trembled: the overflowing of the water passed by: the deep uttered his voice,andlifted up his hands on high.",
        "11Thesunandmoon stood still in their habitation: at the light of thine arrows they went,andat the shining of thy glittering spear.",
        "12Thou didst march through the land in indignation, thou didst thresh the heathen in anger.",
        "13Thou wentest forth for thesalvationof thy people,evenfor salvation with thine anointed; thouwoundedstthe head out of the house of the wicked, by discovering the foundation unto the neck.Selah.",
        "14Thou didst strike through with his staves the head of his villages: they came out as a whirlwind to scatter me: their rejoicingwasas to devour the poor secretly.",
        "15Thou didst walk through the sea with thine horses,throughtheheapof great waters.",
        "16When I heard, my belly trembled; my lips quivered at the voice: rottenness entered into my bones, and I trembled in myself, that I might rest in the day of trouble: when he cometh up unto the people, he will invade them with his troops.",
        "17Â¶Although the fig tree shall not blossom, neithershallfruitbein the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, andthere shall beno herd in the stalls:",
        "18Yet I will rejoice in theLord, I will joy in the God of my salvation.",
        "19TheLordGodismystrength, and he will make my feet like hindsâfeet,and he will make me to walk upon minehigh places. To the chief singer on my stringed instruments."
      ],
      "full_text": "1A prayer of Habakkuk the prophet uponShigionoth. 2OLord, I have heard thy speech,andwas afraid: OLord, revive thy work in the midst of the years, in the midst of the years make known; in wrath remember mercy. 3God came from Teman, and the Holy One from mountParan.Selah. His glory covered the heavens, and the earth was full of his praise. 4Andhisbrightness was as the light;hehad hornscomingout of his hand: and therewasthe hiding of his power. 5Before him went the pestilence, andburning coalswent forth at his feet. 6He stood, and measured the earth: he beheld, and drove asunder the nations; and the everlasting mountains were scattered, the perpetualhillsdid bow: his waysareeverlasting. 7I saw the tents ofCushanin affliction:andthe curtains of the land ofMidiandid tremble. 8Was theLorddispleased against the rivers?wasthine anger against the rivers?wasthy wrath against the sea, that thou didst ride upon thine horsesandthy chariots of salvation? 9Thy bow was made quite naked,accordingto the oaths of the tribes,even thyword.Selah. Thou didst cleave the earth with rivers. 10Themountainssaw thee,andthey trembled: the overflowing of the water passed by: the deep uttered his voice,andlifted up his hands on high. 11Thesunandmoon stood still in their habitation: at the light of thine arrows they went,andat the shining of thy glittering spear. 12Thou didst march through the land in indignation, thou didst thresh the heathen in anger. 13Thou wentest forth for thesalvationof thy people,evenfor salvation with thine anointed; thouwoundedstthe head out of the house of the wicked, by discovering the foundation unto the neck.Selah. 14Thou didst strike through with his staves the head of his villages: they came out as a whirlwind to scatter me: their rejoicingwasas to devour the poor secretly. 15Thou didst walk through the sea with thine horses,throughtheheapof great waters. 16When I heard, my belly trembled; my lips quivered at the voice: rottenness entered into my bones, and I trembled in myself, that I might rest in the day of trouble: when he cometh up unto the people, he will invade them with his troops. 17Â¶Although the fig tree shall not blossom, neithershallfruitbein the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, andthere shall beno herd in the stalls: 18Yet I will rejoice in theLord, I will joy in the God of my salvation. 19TheLordGodismystrength, and he will make my feet like hindsâfeet,and he will make me to walk upon minehigh places. To the chief singer on my stringed instruments."
    },
    {
      "reference": "Zephaniah 1",
      "title": "Zephaniah",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zeph/1?lang=eng",
      "summary": "The destruction of Judah is symbolic of the Second ComingâIt is the day of the Lordâs sacrifice, a day of wrath and trouble.",
      "verses": [
        "1The word of theLordwhich came unto Zephaniah the son of Cushi, the son of Gedaliah, the son of Amariah, the son of Hizkiah, in the days ofJosiahthe son of Amon, king of Judah.",
        "2I will utterlyconsumeallthingsfrom off the land, saith theLord.",
        "3I will consume man and beast; I will consume the fowls of the heaven, and the fishes of the sea, and thestumblingblockswith the wicked; and I will cut off man from off the land, saith theLord.",
        "4I will alsostretchout mine hand upon Judah, and upon all the inhabitants of Jerusalem; and I will cut off the remnant of Baal from this place,andthe name of theChemarimswith the priests;",
        "5And them that worship the host of heaven upon thehousetops; and them that worshipandthat swear by theLord, and that swear byMalcham;",
        "6And them that areturnedback from theLord; andthosethat have not sought theLord, nor inquired for him.",
        "7Holdthy peace at the presence of the LordGod: for thedayof theLordisat hand: for theLordhath prepared a sacrifice, he hath bid his guests.",
        "8And it shall come to pass in the day of theLordâs sacrifice, that I will punish the princes, and the kingâs children, and all such as are clothed with strangeapparel.",
        "9In the same day also will I punish all those that leaponthe threshold, which fill their mastersâ houses with violence and deceit.",
        "10And it shall come to pass in that day, saith theLord,that there shall bethe noise of a cry from the fishgate, and an howling fromthe second, and a great crashing from the hills.",
        "11Howl, ye inhabitants ofMaktesh, for all the merchant people are cut down; all they that bear silver are cut off.",
        "12And it shall come to pass at that time,thatI will search Jerusalem with candles, and punish the men that aresettledon theirlees: that say in their heart, TheLordwillnotdo good, neither will he do evil.",
        "13Therefore their goods shall become a booty, and their houses a desolation: they shall alsobuildhouses, but not inhabitthem;and they shallplantvineyards, but not drink the wine thereof.",
        "14Thegreat dayof theLordisnear,it isnear, and hasteth greatly,eventhe voice of the day of theLord: the mighty man shall cry there bitterly.",
        "15That dayisa day of wrath, a day of trouble and distress, a day of wasteness anddesolation, a day of darkness and gloominess, a day of clouds and thick darkness,",
        "16A day of thetrumpetand alarm against thefenced cities, and against the high towers.",
        "17And I will bring distress upon men, that they shall walk like blind men, because they have sinned against theLord: and their blood shall be poured out as dust, and their flesh as the dung.",
        "18Neither their silver nor their gold shall be able to deliver them in the day of theLordâs wrath; but the whole land shall be devoured by thefireof his jealousy: for he shall make even a speedy riddance of all them that dwell in the land."
      ],
      "full_text": "1The word of theLordwhich came unto Zephaniah the son of Cushi, the son of Gedaliah, the son of Amariah, the son of Hizkiah, in the days ofJosiahthe son of Amon, king of Judah. 2I will utterlyconsumeallthingsfrom off the land, saith theLord. 3I will consume man and beast; I will consume the fowls of the heaven, and the fishes of the sea, and thestumblingblockswith the wicked; and I will cut off man from off the land, saith theLord. 4I will alsostretchout mine hand upon Judah, and upon all the inhabitants of Jerusalem; and I will cut off the remnant of Baal from this place,andthe name of theChemarimswith the priests; 5And them that worship the host of heaven upon thehousetops; and them that worshipandthat swear by theLord, and that swear byMalcham; 6And them that areturnedback from theLord; andthosethat have not sought theLord, nor inquired for him. 7Holdthy peace at the presence of the LordGod: for thedayof theLordisat hand: for theLordhath prepared a sacrifice, he hath bid his guests. 8And it shall come to pass in the day of theLordâs sacrifice, that I will punish the princes, and the kingâs children, and all such as are clothed with strangeapparel. 9In the same day also will I punish all those that leaponthe threshold, which fill their mastersâ houses with violence and deceit. 10And it shall come to pass in that day, saith theLord,that there shall bethe noise of a cry from the fishgate, and an howling fromthe second, and a great crashing from the hills. 11Howl, ye inhabitants ofMaktesh, for all the merchant people are cut down; all they that bear silver are cut off. 12And it shall come to pass at that time,thatI will search Jerusalem with candles, and punish the men that aresettledon theirlees: that say in their heart, TheLordwillnotdo good, neither will he do evil. 13Therefore their goods shall become a booty, and their houses a desolation: they shall alsobuildhouses, but not inhabitthem;and they shallplantvineyards, but not drink the wine thereof. 14Thegreat dayof theLordisnear,it isnear, and hasteth greatly,eventhe voice of the day of theLord: the mighty man shall cry there bitterly. 15That dayisa day of wrath, a day of trouble and distress, a day of wasteness anddesolation, a day of darkness and gloominess, a day of clouds and thick darkness, 16A day of thetrumpetand alarm against thefenced cities, and against the high towers. 17And I will bring distress upon men, that they shall walk like blind men, because they have sinned against theLord: and their blood shall be poured out as dust, and their flesh as the dung. 18Neither their silver nor their gold shall be able to deliver them in the day of theLordâs wrath; but the whole land shall be devoured by thefireof his jealousy: for he shall make even a speedy riddance of all them that dwell in the land."
    },
    {
      "reference": "Zephaniah 2",
      "title": "Zephaniah 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zeph/2?lang=eng",
      "summary": "Seek righteousness; seek meeknessâJudgment will come upon the Philistines, the Moabites, the children of Ammon, the Ethiopians, and the Assyrians.",
      "verses": [
        "1Gather yourselves together, yea, gather together, O nation not desired;",
        "2Before the decree bring forth,beforethe day pass as the chaff, before the fierce anger of theLordcome upon you, before the day of theLordâs anger come upon you.",
        "3Seek ye theLord, all yemeekof the earth, which have wrought his judgment; seekrighteousness, seek meekness: it may be ye shall be hid in thedayof theLordâs anger.",
        "4Â¶For Gaza shall be forsaken, andAshkelona desolation: they shall drive out Ashdod at the noon day, and Ekron shall be rooted up.",
        "5Woe unto the inhabitants of theseacoast, the nation of the Cherethites! the word of theLordisagainst you; O Canaan, the land of thePhilistines, I will even destroy thee, that there shall be no inhabitant.",
        "6And the sea coast shall bedwellingsandcottagesfor shepherds, and folds for flocks.",
        "7And the coast shall be for the remnant of the house of Judah; they shall feed thereupon: in the houses of Ashkelon shall they lie down in the evening: for theLordtheir God shall visit them, and turn away theircaptivity.",
        "8Â¶I have heard the reproach of Moab, and therevilingsof the children of Ammon, whereby they have reproached my people, andmagnifiedthemselvesagainst their border.",
        "9ThereforeasI live, saith theLordof hosts, the God of Israel, Surely Moab shall be asSodom, and the children of Ammon as Gomorrah,eventhebreeding of nettles, and saltpits, and a perpetual desolation: the residue of my people shall spoil them, and the remnant of my people shall possess them.",
        "10This shall they have for their pride, because they have reproached and magnifiedthemselvesagainst the people of theLordof hosts.",
        "11TheLordwill beterribleunto them: for he will famish all the gods of the earth; andmenshallworshiphim, every one from his place,evenall the isles of theheathen.",
        "12Â¶YeEthiopiansalso, yeshall beslain by my sword.",
        "13And he will stretch out his hand against the north, and destroyAssyria; and will make Nineveh a desolation,anddry like a wilderness.",
        "14And flocks shall lie down in the midst of her, all the beasts of the nations: both thecormorantand the bittern shall lodge in the upper lintels of it;theirvoice shall sing in the windows; desolationshall bein the thresholds: for he shall uncover the cedar work.",
        "15Thisisthe rejoicing city that dwelt carelessly, that said in her heart, Iam,andthere isnone beside me: how is she become a desolation, a place for beasts to lie down in! every one that passeth by her shall hiss,andwaghis hand."
      ],
      "full_text": "1Gather yourselves together, yea, gather together, O nation not desired; 2Before the decree bring forth,beforethe day pass as the chaff, before the fierce anger of theLordcome upon you, before the day of theLordâs anger come upon you. 3Seek ye theLord, all yemeekof the earth, which have wrought his judgment; seekrighteousness, seek meekness: it may be ye shall be hid in thedayof theLordâs anger. 4Â¶For Gaza shall be forsaken, andAshkelona desolation: they shall drive out Ashdod at the noon day, and Ekron shall be rooted up. 5Woe unto the inhabitants of theseacoast, the nation of the Cherethites! the word of theLordisagainst you; O Canaan, the land of thePhilistines, I will even destroy thee, that there shall be no inhabitant. 6And the sea coast shall bedwellingsandcottagesfor shepherds, and folds for flocks. 7And the coast shall be for the remnant of the house of Judah; they shall feed thereupon: in the houses of Ashkelon shall they lie down in the evening: for theLordtheir God shall visit them, and turn away theircaptivity. 8Â¶I have heard the reproach of Moab, and therevilingsof the children of Ammon, whereby they have reproached my people, andmagnifiedthemselvesagainst their border. 9ThereforeasI live, saith theLordof hosts, the God of Israel, Surely Moab shall be asSodom, and the children of Ammon as Gomorrah,eventhebreeding of nettles, and saltpits, and a perpetual desolation: the residue of my people shall spoil them, and the remnant of my people shall possess them. 10This shall they have for their pride, because they have reproached and magnifiedthemselvesagainst the people of theLordof hosts. 11TheLordwill beterribleunto them: for he will famish all the gods of the earth; andmenshallworshiphim, every one from his place,evenall the isles of theheathen. 12Â¶YeEthiopiansalso, yeshall beslain by my sword. 13And he will stretch out his hand against the north, and destroyAssyria; and will make Nineveh a desolation,anddry like a wilderness. 14And flocks shall lie down in the midst of her, all the beasts of the nations: both thecormorantand the bittern shall lodge in the upper lintels of it;theirvoice shall sing in the windows; desolationshall bein the thresholds: for he shall uncover the cedar work. 15Thisisthe rejoicing city that dwelt carelessly, that said in her heart, Iam,andthere isnone beside me: how is she become a desolation, a place for beasts to lie down in! every one that passeth by her shall hiss,andwaghis hand."
    },
    {
      "reference": "Zephaniah 3",
      "title": "Zephaniah 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/zeph/3?lang=eng",
      "summary": "At the Second Coming, all nations will assemble to battleâMen will have a pure languageâThe Lord will reign in their midst.",
      "verses": [
        "1Woe to her that isfilthyand polluted, to the oppressing city!",
        "2Sheobeyed notthe voice; she received not correction; she trusted not in theLord; she drew not near to her God.",
        "3Her princes within herareroaring lions; her judgesareeveningwolves; they gnaw not the bones till the morrow.",
        "4Her prophetsarelightandtreacherous persons: her priests havepollutedthe sanctuary, they have done violence to thelaw.",
        "5The justLordisin the midst thereof; he will not do iniquity: every morning doth he bring his judgment to light, he faileth not; but the unjust knoweth no shame.",
        "6I have cut off the nations: their towers are desolate; I made their streets waste, that none passeth by: their cities are destroyed, so that there is no man, that there is none inhabitant.",
        "7I said, Surely thou wilt fear me, thou wilt receive instruction; so their dwelling should not be cut off, howsoever I punished them: but they rose early,andcorrupted all their doings.",
        "8Â¶Therefore wait ye upon me, saith theLord, until the day that I rise up to the prey: for mydeterminationistogather thenations, that I may assemble the kingdoms, to pour upon them mine indignation,evenall my fierce anger: for all theearthshall be devoured with the fire of my jealousy.",
        "9For then will I turn to the people a purelanguage, that they may all call upon the name of theLord, to serve him with oneconsent.",
        "10Frombeyondthe rivers of Ethiopia my suppliants,eventhe daughter of my dispersed, shall bring mine offering.",
        "11In that day shalt thou not be ashamed for all thy doings, wherein thou hast transgressed against me: for then I will take away out of the midst of thee them that rejoice in thy pride, and thou shalt no more behaughtybecause ofmy holy mountain.",
        "12I will also leave in the midst of thee an afflicted and poor people, and they shall trust in the name of theLord.",
        "13The remnant of Israel shall not do iniquity, nor speaklies; neither shall a deceitful tongue be found in their mouth: for they shall feed and lie down, and none shall makethemafraid.",
        "14Â¶Sing, O daughter of Zion; shout, O Israel; be glad and rejoice with all the heart, O daughter of Jerusalem.",
        "15TheLordhath taken away thy judgments, he hath cast out thine enemy: the king of Israel,eventheLord,isin themidstof thee: thou shalt not see evil any more.",
        "16In that day it shall be said to Jerusalem, Fear thou not:and toZion, Let not thine hands be slack.",
        "17TheLordthy God in the midst of theeismighty; he will save, he will rejoice over thee with joy; he will rest in his love, he will joy over thee with singing.",
        "18I will gatherthem that aresorrowful for the solemn assembly,whoare of thee,to whomthe reproach of itwasa burden.",
        "19Behold, at that time I will undo all that afflict thee: and I will save her thathalteth, andgatherher that was driven out; and I will get them praise and fame in every land where they have been put to shame.",
        "20At that time will I bring youagain,even in the time that Igatheryou: for I will make you a name and apraiseamong all people of the earth, when I turn back yourcaptivitybefore your eyes, saith theLord."
      ],
      "full_text": "1Woe to her that isfilthyand polluted, to the oppressing city! 2Sheobeyed notthe voice; she received not correction; she trusted not in theLord; she drew not near to her God. 3Her princes within herareroaring lions; her judgesareeveningwolves; they gnaw not the bones till the morrow. 4Her prophetsarelightandtreacherous persons: her priests havepollutedthe sanctuary, they have done violence to thelaw. 5The justLordisin the midst thereof; he will not do iniquity: every morning doth he bring his judgment to light, he faileth not; but the unjust knoweth no shame. 6I have cut off the nations: their towers are desolate; I made their streets waste, that none passeth by: their cities are destroyed, so that there is no man, that there is none inhabitant. 7I said, Surely thou wilt fear me, thou wilt receive instruction; so their dwelling should not be cut off, howsoever I punished them: but they rose early,andcorrupted all their doings. 8Â¶Therefore wait ye upon me, saith theLord, until the day that I rise up to the prey: for mydeterminationistogather thenations, that I may assemble the kingdoms, to pour upon them mine indignation,evenall my fierce anger: for all theearthshall be devoured with the fire of my jealousy. 9For then will I turn to the people a purelanguage, that they may all call upon the name of theLord, to serve him with oneconsent. 10Frombeyondthe rivers of Ethiopia my suppliants,eventhe daughter of my dispersed, shall bring mine offering. 11In that day shalt thou not be ashamed for all thy doings, wherein thou hast transgressed against me: for then I will take away out of the midst of thee them that rejoice in thy pride, and thou shalt no more behaughtybecause ofmy holy mountain. 12I will also leave in the midst of thee an afflicted and poor people, and they shall trust in the name of theLord. 13The remnant of Israel shall not do iniquity, nor speaklies; neither shall a deceitful tongue be found in their mouth: for they shall feed and lie down, and none shall makethemafraid. 14Â¶Sing, O daughter of Zion; shout, O Israel; be glad and rejoice with all the heart, O daughter of Jerusalem. 15TheLordhath taken away thy judgments, he hath cast out thine enemy: the king of Israel,eventheLord,isin themidstof thee: thou shalt not see evil any more. 16In that day it shall be said to Jerusalem, Fear thou not:and toZion, Let not thine hands be slack. 17TheLordthy God in the midst of theeismighty; he will save, he will rejoice over thee with joy; he will rest in his love, he will joy over thee with singing. 18I will gatherthem that aresorrowful for the solemn assembly,whoare of thee,to whomthe reproach of itwasa burden. 19Behold, at that time I will undo all that afflict thee: and I will save her thathalteth, andgatherher that was driven out; and I will get them praise and fame in every land where they have been put to shame. 20At that time will I bring youagain,even in the time that Igatheryou: for I will make you a name and apraiseamong all people of the earth, when I turn back yourcaptivitybefore your eyes, saith theLord."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:33:44",
  "metadata": {
    "week_number": 49,
    "title": "Week 49: November 30–December 6 - Micah; Nahum; Habakkuk; Zephaniah",
    "date_range": "November 30–December 6",
    "scraped_at": "2025-12-21T22:33:58.260644",
    "scraper_version": "2.0.0"
  }
}