{
  "week_number": 17,
  "date_range": "April 20–26",
  "title": "Week 17: April 20–26 - Exodus 19–20; 24; 31–34",
  "bundle_title": "Week 17: April 20–26: \"Week 17: April 20–26 - Exodus 19–20; 24; 31–34\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/17?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/17?lang=eng",
    "title": "Exodus 19–20;24;31–34",
    "scripture_references": "Exodus 19–20; 24; 31–34",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“April 20–26. ‘All That the Lord Hath Spoken We Will Do’: Exodus 19–20; 24; 31–34,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“April 20–26. ‘All That the Lord Hath Spoken We Will Do,’”Come, Follow Me: Old Testament 2026\n\nApril 20–26: “All That the Lord Hath Spoken We Will Do”\n\nAlthough the children of Israel had murmured and wavered in the past, when Moses read the law at the foot of Mount Sinai, they made this covenant: “All that the Lord hath said will we do, and be obedient” (Exodus 24:7). God then called Moses onto the mountain, telling him to build a tabernacle so “that I may dwell among them” (Exodus 25:8).\n\nBut while Moses was at the top of the mountain learning how the Israelites could have God’s presence among them, the Israelites were at the bottom of the mountain making a golden idol to worship instead. Soon after promising to “have no other gods,” they “turned aside quickly” from their promise (Exodus 20:3;32:8; see alsoExodus 24:3). It was a surprising turn, but we know from experience that faith and commitment can sometimes be overcome by impatience, fear, or doubt. As we seek the Lord’s presence in our lives, it is encouraging to know the Lord did not give up on ancient Israel and He will not give up on us and the people we love—for He is “merciful and gracious, longsuffering, and abundant in goodness and truth” (Exodus 34:6).",
    "learning_at_home_church": [
      {
        "title": "The Lord’s covenant people are a treasure to Him.",
        "content": "President Russell M. Nelson taught: “In the Old Testament, the Hebrew term from whichpeculiarwas translated issegullah, which means ‘valued property,’ or ‘treasure.’ … For us to be identified by servants of the Lord as hispeculiarpeople is a compliment of the highest order” (“Children of the Covenant,”Ensign, May 1995, 34). How do President Nelson’s words affect the way you understandExodus 19:3–6? How has the Lord shown you that He treasures you?\n\nExodus 19:10–11, 17"
      },
      {
        "title": "Sacred experiences require preparation.",
        "content": "The Lord told Moses that the children of Israel needed to be prepared before they could “meet with God” (Exodus 19:10–11, 17) and keep a covenant with Him (seeExodus 19:5). How do you prepare for spiritual experiences, including the sacrament and temple ordinances? How can you help others prepare? What do you learn about preparation fromLuke 6:12–13;Enos 1:2–6;Alma 17:2–3?\n\nThis mountain in Egypt is traditionally believed to be Mount Sinai.\n\nExodus 20:1–17"
      },
      {
        "title": "Obedience to God’s commandments brings blessings.",
        "content": "While the Israelites were gathered at the base of Mount Sinai, they heard the voice of God give the Ten Commandments (seeDeuteronomy 4:12–13). These, of course, aren’t God’s only commandments—there are many others in the scriptures. So as you readExodus 20:1–17, ask yourself why God emphasized these ten in particular. Here’s a sample table you could use as you ponder the importance of the Ten Commandments in your life:\n\nCommandment\n\nIn other words, the Lord is asking me to …\n\nBlessings that come from living this commandment\n\nHow does keeping these ten commandments help you keep the two great commandments Jesus gave inMatthew 22:34–40?\n\nWhat are things that you may be tempted to put before God? What blessings have you seen from putting God first?\n\nHow would you respond to someone who says the Ten Commandments were given a long time ago and do not apply today? What examples from your life would you share as part of your response? How might the hymn “How Gentle God’s Commands” (Hymns, no. 125) affect the way you explain God’s commandments to others?\n\nHow has the Lord fulfilled the promise inExodus 20:6in your life?\n\nSee also “The Great Commandment—Love the Lord,” inTeachings of Presidents of the Church: Ezra Taft Benson(2014), 37–45; Dallin H. Oaks, “No Other Gods,”EnsignorLiahona, Nov. 2013, 72–75; Topics and Questions, “Commandments,” Gospel Library.\n\nExodus 24:1–11"
      },
      {
        "title": "Making covenants shows my willingness to obey God’s law.",
        "content": "As you readExodus 24:3–8, consider the covenants you have made with God. While Israel’s covenant included rituals that are different from what God requires today, you may notice some similarities. For example,verses 4, 5, and 8mention an altar, animal sacrifices, and blood. What could these things represent, and how do they relate to your covenants?\n\nExodus 32–34"
      },
      {
        "title": "Sin is turning away from God; repentance is turning toward Him and away from evil.",
        "content": "Try to put yourself in the Israelites’ place—you’re in the wilderness, Moses has been gone for 40 days, and a confrontation with the Canaanites over the promised land is in your future (seeExodus 32:1–8). Why do you think the Israelites wanted a golden idol? What inspires you about Moses’s plea to the Lord inExodus 33:11–17?\n\nWhile the Israelites’ sin was serious, this story also includes a message of God’s mercy and forgiveness. What doesExodus 34:1–10teach you about the Savior? (seeExodus 32:30–32;Mosiah 14:4–8;15:9;Doctrine and Covenants 45:3–5).\n\nExodus 31:13–16"
      },
      {
        "title": "The Sabbath is a sign.",
        "content": "President Russell M. Nelson explained: “In my much younger years, I studied the work of others who had compiled lists of things to do and thingsnotto do on the Sabbath. It wasn’t until later that I learned from the scriptures that my conduct and my attitude on the Sabbath constituted asignbetween me and my Heavenly Father [seeExodus 31:13;Ezekiel 20:12, 20]. With that understanding, I no longer needed lists of dos and don’ts. When I had to make a decision whether or not an activity was appropriate for the Sabbath, I simply asked myself, ‘Whatsigndo I want to give to God?’ That question made my choices about the Sabbath day crystal clear” (“The Sabbath Is a Delight,”EnsignorLiahona, May 2015, 130). Ponder what sign you want to give God with your observance of the Sabbath.\n\nExodus 34:1–4"
      },
      {
        "title": "What was the difference between the two sets of stone tables Moses made?",
        "content": "When Moses came down from the mountain, he brought the law written on stone tables. After finding that the Israelites had broken their covenant, Moses broke the tables (seeExodus 31:18;32:19). Later, God commanded Moses to make another set of stone tables and take them back to the mountain (seeExodus 34:1–4). TheJoseph Smith Translation of Exodus 34:1–2(in the Bible appendix) clarifies that the first set of stone tables included the ordinances of God’s “holy order,” or the Melchizedek Priesthood. The second set included “the law of a carnal commandment.” This was a lesser law administered by the “lesser priesthood” (seeDoctrine and Covenants 84:17–27), which was meant to prepare the Israelites for the higher law and higher priesthood so they could enter into God’s presence.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "God gives me commandments because He wants me to be happy.",
        "content": "How can you make learning about the Ten Commandments fun for your children? As you readExodus 20:3–17together, let your children help you find or draw a picture to represent each of the Ten Commandments. Then your children could take turns choosing a picture and talking about how they can live that commandment. Share with each other how living that commandment brings you happiness.\n\nYou could also sing a song like “Keep the Commandments” (Children’s Songbook, 146–47). Help your children find words in the song that teach them why God wants us to keep His commandments.\n\nWhen children share spiritual experiences, their testimony grows.The questions you ask can encourage your children to share how they feel about the Savior and how living the gospel has blessed them (seeTeaching in the Savior’s Way,32). When they do this, they are bearing testimony. Consider how you can do this as you discuss the blessings that come from living the Ten Commandments.\n\nExodus 20:12"
      },
      {
        "title": "The Lord wants me to honor my parents.",
        "content": "Help your children learn the phrase “Honour thy father and thy mother” (Exodus 20:12). You may want to explain that to “honor” someone can mean to show respect for them or to bring them happiness. What did Jesus do to honor His mortal mother and His Heavenly Father? (seeLuke 2:48–51;John 19:26–27). Perhaps your children could take turns acting out things they can do to honor their parents, while the other children guess what they are doing.\n\nExodus 31:13, 16–17"
      },
      {
        "title": "Honoring the Sabbath is a sign of my love for the Lord.",
        "content": "Your children might enjoy looking at examples of signs—such as road signs or signs on a building. What are the purposes of signs? Your children could then find the word “sign” inExodus 31:13, 16–17. What did the Lord say is a sign between us and Him? Share with each other some of the ways you and your family try to show your love for the Lord on the Sabbath.\n\nIllustration of Moses holding the Ten Commandments, by Sam Lawlor (detail)\n\nExodus 32:1–8, 19–24;34:6–7"
      },
      {
        "title": "I will not “turn aside” from God’s ways.",
        "content": "Consider using “Moses on Mount Sinai” (inOld Testament Stories, 77–82) to help your children learn the story inExodus 32:1–8, 19–24. Why was it wrong for the Israelites to worship a statue instead of God?\n\nMoses on Mount Sinai\n\nIt might be fun to create a path on the floor (or find one near your home) to illustrate these words fromExodus 32:8: “They have turned aside quickly out of the way.” While walking on the path, your children could talk about temptations we face to turn away from God. What helps us remain on God’s path—and return to it if we have strayed? (seeExodus 34:6–7).\n\nFor more, see this month’s issue of theFriendmagazine.\n\nWorship of the Calf, by W. C. Simmonds"
      }
    ],
    "study_helps": [],
    "raw_text": "April 20–26. “All That the Lord Hath Spoken We Will Do”: Exodus 19–20; 24; 31–34\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMarch 30–April 5\nEaster\nApril 6–12\nExodus 7–13\nApril 13–19\nExodus 14–18\nApril 20–26\nExodus 19–20; 24; 31–34\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nApril 20–26. “All That the Lord Hath Spoken We Will Do”: Exodus 19–20; 24; 31–34\n“April 20–26. ‘All That the Lord Hath Spoken We Will Do’: Exodus 19–20; 24; 31–34,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“April 20–26. ‘All That the Lord Hath Spoken We Will Do,’”\nCome, Follow Me: Old Testament 2026\nMoses and the Tablets\n, by Jerry Harston (detail)\nApril 20–26: “All That the Lord Hath Spoken We Will Do”\nExodus 19–20\n;\n24\n;\n31–34\nAlthough the children of Israel had murmured and wavered in the past, when Moses read the law at the foot of Mount Sinai, they made this covenant: “All that the Lord hath said will we do, and be obedient” (\nExodus 24:7\n). God then called Moses onto the mountain, telling him to build a tabernacle so “that I may dwell among them” (\nExodus 25:8\n).\nBut while Moses was at the top of the mountain learning how the Israelites could have God’s presence among them, the Israelites were at the bottom of the mountain making a golden idol to worship instead. Soon after promising to “have no other gods,” they “turned aside quickly” from their promise (\nExodus 20:3\n;\n32:8\n; see also\nExodus 24:3\n). It was a surprising turn, but we know from experience that faith and commitment can sometimes be overcome by impatience, fear, or doubt. As we seek the Lord’s presence in our lives, it is encouraging to know the Lord did not give up on ancient Israel and He will not give up on us and the people we love—for He is “merciful and gracious, longsuffering, and abundant in goodness and truth” (\nExodus 34:6\n).\nIdeas for Learning at Home and at Church\nExodus 19:3–6\nThe Lord’s covenant people are a treasure to Him.\nPresident Russell M. Nelson taught: “In the Old Testament, the Hebrew term from which\npeculiar\nwas translated is\nsegullah\n, which means ‘valued property,’ or ‘treasure.’ … For us to be identified by servants of the Lord as his\npeculiar\npeople is a compliment of the highest order” (“\nChildren of the Covenant\n,”\nEnsign\n, May 1995, 34). How do President Nelson’s words affect the way you understand\nExodus 19:3–6\n? How has the Lord shown you that He treasures you?\nExodus 19:10–11, 17\nSacred experiences require preparation.\nThe Lord told Moses that the children of Israel needed to be prepared before they could “meet with God” (\nExodus 19:10–11, 17\n) and keep a covenant with Him (see\nExodus 19:5\n). How do you prepare for spiritual experiences, including the sacrament and temple ordinances? How can you help others prepare? What do you learn about preparation from\nLuke 6:12–13\n;\nEnos 1:2–6\n;\nAlma 17:2–3\n?\nThis mountain in Egypt is traditionally believed to be Mount Sinai.\nExodus 20:1–17\nObedience to God’s commandments brings blessings.\nWhile the Israelites were gathered at the base of Mount Sinai, they heard the voice of God give the Ten Commandments (see\nDeuteronomy 4:12–13\n). These, of course, aren’t God’s only commandments—there are many others in the scriptures. So as you read\nExodus 20:1–17\n, ask yourself why God emphasized these ten in particular. Here’s a sample table you could use as you ponder the importance of the Ten Commandments in your life:\nCommandment\nIn other words, the Lord is asking me to …\nBlessings that come from living this commandment\nHow does keeping these ten commandments help you keep the two great commandments Jesus gave in\nMatthew 22:34–40\n?\nWhat are things that you may be tempted to put before God? What blessings have you seen from putting God first?\nHow would you respond to someone who says the Ten Commandments were given a long time ago and do not apply today? What examples from your life would you share as part of your response? How might the hymn “\nHow Gentle God’s Commands\n” (\nHymns\n, no. 125) affect the way you explain God’s commandments to others?\nHow has the Lord fulfilled the promise in\nExodus 20:6\nin your life?\nSee also “\nThe Great Commandment—Love the Lord\n,” in\nTeachings of Presidents of the Church: Ezra Taft Benson\n(2014), 37–45; Dallin H. Oaks, “\nNo Other Gods\n,”\nEnsign\nor\nLiahona\n, Nov. 2013, 72–75; Topics and Questions, “\nCommandments\n,” Gospel Library.\nExodus 24:1–11\nMaking covenants shows my willingness to obey God’s law.\nAs you read\nExodus 24:3–8\n, consider the covenants you have made with God. While Israel’s covenant included rituals that are different from what God requires today, you may notice some similarities. For example,\nverses 4, 5, and 8\nmention an altar, animal sacrifices, and blood. What could these things represent, and how do they relate to your covenants?\nExodus 32–34\nSin is turning away from God; repentance is turning toward Him and away from evil.\nTry to put yourself in the Israelites’ place—you’re in the wilderness, Moses has been gone for 40 days, and a confrontation with the Canaanites over the promised land is in your future (see\nExodus 32:1–8\n). Why do you think the Israelites wanted a golden idol? What inspires you about Moses’s plea to the Lord in\nExodus 33:11–17\n?\nWhile the Israelites’ sin was serious, this story also includes a message of God’s mercy and forgiveness. What does\nExodus 34:1–10\nteach you about the Savior? (see\nExodus 32:30–32\n;\nMosiah 14:4–8\n;\n15:9\n;\nDoctrine and Covenants 45:3–5\n).\nExodus 31:13–16\nThe Sabbath is a sign.\nPresident Russell M. Nelson explained: “In my much younger years, I studied the work of others who had compiled lists of things to do and things\nnot\nto do on the Sabbath. It wasn’t until later that I learned from the scriptures that my conduct and my attitude on the Sabbath constituted a\nsign\nbetween me and my Heavenly Father [see\nExodus 31:13\n;\nEzekiel 20:12, 20\n]. With that understanding, I no longer needed lists of dos and don’ts. When I had to make a decision whether or not an activity was appropriate for the Sabbath, I simply asked myself, ‘What\nsign\ndo I want to give to God?’ That question made my choices about the Sabbath day crystal clear” (“\nThe Sabbath Is a Delight\n,”\nEnsign\nor\nLiahona\n, May 2015, 130). Ponder what sign you want to give God with your observance of the Sabbath.\nExodus 34:1–4\nWhat was the difference between the two sets of stone tables Moses made?\nWhen Moses came down from the mountain, he brought the law written on stone tables. After finding that the Israelites had broken their covenant, Moses broke the tables (see\nExodus 31:18\n;\n32:19\n). Later, God commanded Moses to make another set of stone tables and take them back to the mountain (see\nExodus 34:1–4\n). The\nJoseph Smith Translation of Exodus 34:1–2\n(in the Bible appendix) clarifies that the first set of stone tables included the ordinances of God’s “holy order,” or the Melchizedek Priesthood. The second set included “the law of a carnal commandment.” This was a lesser law administered by the “lesser priesthood” (see\nDoctrine and Covenants 84:17–27\n), which was meant to prepare the Israelites for the higher law and higher priesthood so they could enter into God’s presence.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat was significant about the Israelites’ unwillingness to have God speak directly to them?\nWhy did the Israelites create a golden calf to worship?\nWho can see God’s face and live?\nClick to see more.\nIdeas for Teaching Children\nExodus 20:3–17\nGod gives me commandments because He wants me to be happy.\nHow can you make learning about the Ten Commandments fun for your children? As you read\nExodus 20:3–17\ntogether, let your children help you find or draw a picture to represent each of the Ten Commandments. Then your children could take turns choosing a picture and talking about how they can live that commandment. Share with each other how living that commandment brings you happiness.\nYou could also sing a song like “\nKeep the Commandments\n” (\nChildren’s Songbook\n, 146–47). Help your children find words in the song that teach them why God wants us to keep His commandments.\nWhen children share spiritual experiences, their testimony grows.\nThe questions you ask can encourage your children to share how they feel about the Savior and how living the gospel has blessed them (see\nTeaching in the Savior’s Way\n,\n32\n). When they do this, they are bearing testimony. Consider how you can do this as you discuss the blessings that come from living the Ten Commandments.\nExodus 20:12\nThe Lord wants me to honor my parents.\nHelp your children learn the phrase “Honour thy father and thy mother” (\nExodus 20:12\n). You may want to explain that to “honor” someone can mean to show respect for them or to bring them happiness. What did Jesus do to honor His mortal mother and His Heavenly Father? (see\nLuke 2:48–51\n;\nJohn 19:26–27\n). Perhaps your children could take turns acting out things they can do to honor their parents, while the other children guess what they are doing.\nExodus 31:13, 16–17\nHonoring the Sabbath is a sign of my love for the Lord.\nYour children might enjoy looking at examples of signs—such as road signs or signs on a building. What are the purposes of signs? Your children could then find the word “sign” in\nExodus 31:13, 16–17\n. What did the Lord say is a sign between us and Him? Share with each other some of the ways you and your family try to show your love for the Lord on the Sabbath.\nIllustration of Moses holding the Ten Commandments, by Sam Lawlor (detail)\nExodus 32:1–8, 19–24\n;\n34:6–7\nI will not “turn aside” from God’s ways.\nConsider using “\nMoses on Mount Sinai\n” (in\nOld Testament Stories\n, 77–82) to help your children learn the story in\nExodus 32:1–8, 19–24\n. Why was it wrong for the Israelites to worship a statue instead of God?\n2:55\nMoses on Mount Sinai\nIt might be fun to create a path on the floor (or find one near your home) to illustrate these words from\nExodus 32:8\n: “They have turned aside quickly out of the way.” While walking on the path, your children could talk about temptations we face to turn away from God. What helps us remain on God’s path—and return to it if we have strayed? (see\nExodus 34:6–7\n).\nFor more, see this month’s issue of the\nFriend\nmagazine.\nWorship of the Calf\n, by W. C. Simmonds"
  },
  "scripture_content": [
    {
      "reference": "Exodus 19",
      "title": "Exodus 19",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/19?lang=eng",
      "summary": "The Lord covenants to make Israel a peculiar treasure, a kingdom of priests, and a holy nationâThe people sanctify themselvesâThe Lord appears on Sinai amid fire, smoke, and earthquakes.",
      "verses": [
        "1In the third month, when the children of Israel were gone forth out of the land of Egypt, the same day came theyintothewildernessof Sinai.",
        "2For they were departed from Rephidim, and were cometothe desert of Sinai, and hadpitchedin the wilderness; and there Israel camped before the mount.",
        "3And Moses went up unto God, and theLordcalledunto him out of themountain, saying, Thus shalt thou say to the house of Jacob, and tell the children of Israel;",
        "4Ye have seen what I did unto the Egyptians, andhowI bare you oneaglesâwings, and brought you unto myself.",
        "5Now therefore, if ye willobeymy voice indeed, and keep mycovenant, then ye shall be apeculiartreasureunto me above all people: for all the earthismine:",
        "6And ye shall be unto me akingdomofpriests, and anholynation. Thesearethe words which thou shalt speak unto the children of Israel.",
        "7Â¶And Moses came and called for the elders of the people, and laid before their faces all these words which theLordcommandedhim.",
        "8And all the people answered together, and said, All that theLordhath spoken we willdo. And Moses returned the words of the people unto theLord.",
        "9And theLordsaid unto Moses, Lo, I come unto thee in a thickcloud, that the people mayhearwhen I speak with thee, and believe thee for ever. And Moses told the words of the people unto theLord.",
        "10Â¶And theLordsaid unto Moses, Go unto the people, andsanctifythem to day and to morrow, and let themwashtheir clothes,",
        "11And be ready against the third day: for the third day theLordwill come down in thesightof all the people upon mount Sinai.",
        "12And thou shalt setboundsunto the people round about, saying, Take heed to yourselves,that yegonotup into themount, or touch the border of it: whosoever toucheth the mount shall be surely put to death:",
        "13There shall not an hand touch it, but he shall surely be stoned, or shot through; whetherit bebeast or man, it shall not live: when the trumpet soundeth long, they shall come up to the mount.",
        "14Â¶And Moses went down from the mount unto the people, and sanctified the people; and they washed their clothes.",
        "15And he said unto the people, Be ready against the third day:comenot atyourwives.",
        "16Â¶And it came to pass on the third day in the morning, that there were thunders and lightnings, and a thick cloud upon the mount, and the voice of the trumpet exceeding loud; so that all the people thatwasin the camp trembled.",
        "17And Moses brought forth the people out of the camp tomeetwith God; and they stood at thenether part ofthe mount.",
        "18And mountSinaiwasaltogetheron asmoke, because theLorddescendedupon it infire: and the smoke thereof ascended as the smoke of a furnace, and the wholemountquaked greatly.",
        "19And when the voice of thetrumpetsounded long, and waxed louder and louder, Moses spake, and God answered him by avoice.",
        "20And theLordcame down upon mount Sinai, on the top of the mount: and theLordcalled Mosesupto thetopof the mount; and Moses went up.",
        "21And theLordsaid unto Moses, Go down, charge the people, lest they break through unto theLordtogaze, and many of themperish.",
        "22And let the priests also, which come near to theLord, sanctifythemselves, lest theLordbreak forth upon them.",
        "23And Moses said unto theLord, The people cannot come up to mount Sinai: for thou chargedst us, saying, Set bounds about the mount, and sanctify it.",
        "24And theLordsaid unto him, Away, get thee down, and thou shalt come up, thou, and Aaron with thee: but let not the priests and the people break through to come up unto theLord, lest he break forth upon them.",
        "25So Moses went down unto the people, and spake unto them."
      ],
      "full_text": "1In the third month, when the children of Israel were gone forth out of the land of Egypt, the same day came theyintothewildernessof Sinai. 2For they were departed from Rephidim, and were cometothe desert of Sinai, and hadpitchedin the wilderness; and there Israel camped before the mount. 3And Moses went up unto God, and theLordcalledunto him out of themountain, saying, Thus shalt thou say to the house of Jacob, and tell the children of Israel; 4Ye have seen what I did unto the Egyptians, andhowI bare you oneaglesâwings, and brought you unto myself. 5Now therefore, if ye willobeymy voice indeed, and keep mycovenant, then ye shall be apeculiartreasureunto me above all people: for all the earthismine: 6And ye shall be unto me akingdomofpriests, and anholynation. Thesearethe words which thou shalt speak unto the children of Israel. 7Â¶And Moses came and called for the elders of the people, and laid before their faces all these words which theLordcommandedhim. 8And all the people answered together, and said, All that theLordhath spoken we willdo. And Moses returned the words of the people unto theLord. 9And theLordsaid unto Moses, Lo, I come unto thee in a thickcloud, that the people mayhearwhen I speak with thee, and believe thee for ever. And Moses told the words of the people unto theLord. 10Â¶And theLordsaid unto Moses, Go unto the people, andsanctifythem to day and to morrow, and let themwashtheir clothes, 11And be ready against the third day: for the third day theLordwill come down in thesightof all the people upon mount Sinai. 12And thou shalt setboundsunto the people round about, saying, Take heed to yourselves,that yegonotup into themount, or touch the border of it: whosoever toucheth the mount shall be surely put to death: 13There shall not an hand touch it, but he shall surely be stoned, or shot through; whetherit bebeast or man, it shall not live: when the trumpet soundeth long, they shall come up to the mount. 14Â¶And Moses went down from the mount unto the people, and sanctified the people; and they washed their clothes. 15And he said unto the people, Be ready against the third day:comenot atyourwives. 16Â¶And it came to pass on the third day in the morning, that there were thunders and lightnings, and a thick cloud upon the mount, and the voice of the trumpet exceeding loud; so that all the people thatwasin the camp trembled. 17And Moses brought forth the people out of the camp tomeetwith God; and they stood at thenether part ofthe mount. 18And mountSinaiwasaltogetheron asmoke, because theLorddescendedupon it infire: and the smoke thereof ascended as the smoke of a furnace, and the wholemountquaked greatly. 19And when the voice of thetrumpetsounded long, and waxed louder and louder, Moses spake, and God answered him by avoice. 20And theLordcame down upon mount Sinai, on the top of the mount: and theLordcalled Mosesupto thetopof the mount; and Moses went up. 21And theLordsaid unto Moses, Go down, charge the people, lest they break through unto theLordtogaze, and many of themperish. 22And let the priests also, which come near to theLord, sanctifythemselves, lest theLordbreak forth upon them. 23And Moses said unto theLord, The people cannot come up to mount Sinai: for thou chargedst us, saying, Set bounds about the mount, and sanctify it. 24And theLordsaid unto him, Away, get thee down, and thou shalt come up, thou, and Aaron with thee: but let not the priests and the people break through to come up unto theLord, lest he break forth upon them. 25So Moses went down unto the people, and spake unto them."
    },
    {
      "reference": "Exodus 20",
      "title": "Exodus 20",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/20?lang=eng",
      "summary": "The Lord reveals the Ten CommandmentsâIsrael is to bear witness that the Lord has spoken from heavenâThe children of Israel are forbidden to make gods of silver or goldâThey are to make altars of unhewn stones and sacrifice to the Lord thereon.",
      "verses": [
        "1And Godspakeall thesewords, saying,",
        "2IamtheLordthyGod, which have brought thee out of the land ofEgypt, out of the house ofbondage.",
        "3Thou shalt havenoothergodsbefore me.",
        "4Thou shaltnotmake unto thee anygravenimage, or any likenessof any thingthatisin heaven above, or thatisin the earth beneath, or thatisin the water under the earth:",
        "5Thou shalt notbowdown thyself to them, nor serve them: for I theLordthy GodamajealousGod,visitingtheiniquityof thefathersupon thechildrenunto the third and fourthgenerationof them thathateme;",
        "6And shewingmercyunto thousands of them that love me, and keep mycommandments.",
        "7Thou shalt not take thenameof theLordthy God invain; for theLordwill not hold himguiltlessthattakethhis name in vain.",
        "8Remember thesabbathday, to keep itholy.",
        "9Sixdays shalt thoulabour, and do all thy work:",
        "10But the seventh dayisthe sabbath of theLordthy God:in itthou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thystrangerthatiswithin thy gates:",
        "11Forinsixdays theLordmade heaven and earth, the sea, and all that in themis,and rested the seventh day: wherefore theLordblessedthe sabbath day, andhallowedit.",
        "12Â¶Honourthyfatherand thymother: that thydaysmay belongupon thelandwhich theLordthy God giveth thee.",
        "13Thou shalt notkill.",
        "14Thou shalt not commitadultery.",
        "15Thou shalt notsteal.",
        "16Thou shalt not bearfalse witnessagainst thyneighbour.",
        "17Thou shalt notcovetthy neighbourâs house, thou shalt not covet thy neighbourâswife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing thatisthy neighbourâs.",
        "18Â¶And all the peoplesawthe thunderings, and the lightnings, and the noise of the trumpet, and the mountain smoking: and when the peoplesawit,theyremoved, and stood afar off.",
        "19And they said unto Moses, Speak thou with us, and we will hear: but let not Godspeakwith us, lest we die.",
        "20And Moses said unto the people,Fear not: forGodiscometoproveyou, andthathis fear may be before your faces, that ye sin not.",
        "21And the people stood afar off, and Moses drew near unto the thick darkness where Godwas.",
        "22Â¶And theLordsaid unto Moses, Thus thou shalt say unto the children of Israel, Ye have seen that I havetalkedwith you from heaven.",
        "23Ye shall not makewith megodsof silver, neither shall ye make unto you gods of gold.",
        "24Â¶An altar of earth thou shalt make unto me, and shaltsacrificethereon thy burnt offerings, and thy peace offerings, thy sheep, and thine oxen: in all places where I record my name I will come unto thee, and I will bless thee.",
        "25And if thou wilt make me an altar of stone, thou shalt not build it of hewnstone: for if thou lift up thytoolupon it, thou hast polluted it.",
        "26Neither shalt thou go up bystepsunto mine altar, that thy nakedness be notdiscoveredthereon."
      ],
      "full_text": "1And Godspakeall thesewords, saying, 2IamtheLordthyGod, which have brought thee out of the land ofEgypt, out of the house ofbondage. 3Thou shalt havenoothergodsbefore me. 4Thou shaltnotmake unto thee anygravenimage, or any likenessof any thingthatisin heaven above, or thatisin the earth beneath, or thatisin the water under the earth: 5Thou shalt notbowdown thyself to them, nor serve them: for I theLordthy GodamajealousGod,visitingtheiniquityof thefathersupon thechildrenunto the third and fourthgenerationof them thathateme; 6And shewingmercyunto thousands of them that love me, and keep mycommandments. 7Thou shalt not take thenameof theLordthy God invain; for theLordwill not hold himguiltlessthattakethhis name in vain. 8Remember thesabbathday, to keep itholy. 9Sixdays shalt thoulabour, and do all thy work: 10But the seventh dayisthe sabbath of theLordthy God:in itthou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thystrangerthatiswithin thy gates: 11Forinsixdays theLordmade heaven and earth, the sea, and all that in themis,and rested the seventh day: wherefore theLordblessedthe sabbath day, andhallowedit. 12Â¶Honourthyfatherand thymother: that thydaysmay belongupon thelandwhich theLordthy God giveth thee. 13Thou shalt notkill. 14Thou shalt not commitadultery. 15Thou shalt notsteal. 16Thou shalt not bearfalse witnessagainst thyneighbour. 17Thou shalt notcovetthy neighbourâs house, thou shalt not covet thy neighbourâswife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing thatisthy neighbourâs. 18Â¶And all the peoplesawthe thunderings, and the lightnings, and the noise of the trumpet, and the mountain smoking: and when the peoplesawit,theyremoved, and stood afar off. 19And they said unto Moses, Speak thou with us, and we will hear: but let not Godspeakwith us, lest we die. 20And Moses said unto the people,Fear not: forGodiscometoproveyou, andthathis fear may be before your faces, that ye sin not. 21And the people stood afar off, and Moses drew near unto the thick darkness where Godwas. 22Â¶And theLordsaid unto Moses, Thus thou shalt say unto the children of Israel, Ye have seen that I havetalkedwith you from heaven. 23Ye shall not makewith megodsof silver, neither shall ye make unto you gods of gold. 24Â¶An altar of earth thou shalt make unto me, and shaltsacrificethereon thy burnt offerings, and thy peace offerings, thy sheep, and thine oxen: in all places where I record my name I will come unto thee, and I will bless thee. 25And if thou wilt make me an altar of stone, thou shalt not build it of hewnstone: for if thou lift up thytoolupon it, thou hast polluted it. 26Neither shalt thou go up bystepsunto mine altar, that thy nakedness be notdiscoveredthereon."
    },
    {
      "reference": "Exodus 24",
      "title": "Exodus 24",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/24?lang=eng",
      "summary": "Israel accepts the word of the Lord by covenantâMoses sprinkles the blood of the covenantâHe, Aaron, Nadab, Abihu, and seventy of the elders of Israel see GodâThe Lord calls Moses on to the mount to receive the tables of stone and commandments.",
      "verses": [
        "1And he said unto Moses, Come up unto theLord, thou, and Aaron,Nadab, and Abihu, andseventyof the elders of Israel; and worship ye afar off.",
        "2And Moses alone shall come near theLord: but they shall not come nigh; neither shall the people go up with him.",
        "3Â¶And Moses came and told the people all the words of theLord, and all thejudgments: and all the people answered with onevoice, and said, All the words which theLordhath said will we do.",
        "4And Moseswroteall the words of theLord, and rose up early in the morning, and builded analtarunder the hill, and twelvepillars, according to the twelve tribes of Israel.",
        "5And he sent young men of the children of Israel, which offered burnt offerings, and sacrificedpeace offeringsof oxen unto theLord.",
        "6And Moses took half of theblood, and putitin basins; and half of the blood he sprinkled on the altar.",
        "7And he took the book of thecovenant, andreadin the audience of the people: and they said, All that theLordhath said will we do, and beobedient.",
        "8And Moses took theblood, andsprinklediton the people, and said, Behold thebloodof thecovenant, which theLordhath made with you concerning all these words.",
        "9Â¶Then went up Moses, and Aaron, Nadab, and Abihu, andseventyof theeldersof Israel:",
        "10And theysawthe God of Israel: andthere wasunder hisfeetas it were a paved work of a sapphire stone, and asitwere the body of heaven inhisclearness.",
        "11And upon the nobles of the children of Israel he laid not his hand: also theysawGod, and did eat and drink.",
        "12Â¶And theLordsaid unto Moses, Come up to me into the mount, and be there: and I will give theetablesof stone, and alaw, and commandments which I havewritten; that thou mayest teach them.",
        "13And Moses rose up, and his ministerJoshua: and Moses went up into themount of God.",
        "14And he said unto the elders, Tarry ye here for us, until we come again unto you: and, behold, Aaron and Hurarewith you: if any man have any matters to do, let him come unto them.",
        "15And Moses went up into the mount, and acloudcovered the mount.",
        "16And thegloryof theLordabode upon mount Sinai, and the cloud covered it six days: and the seventh day he called unto Moses out of the midst of the cloud.",
        "17And thesightof thegloryof theLordwaslike devouring fire on the top of the mount in the eyes of the children of Israel.",
        "18And Moses went into the midst of the cloud, and gat him up into the mount: and Moses was in the mountfortydays and forty nights."
      ],
      "full_text": "1And he said unto Moses, Come up unto theLord, thou, and Aaron,Nadab, and Abihu, andseventyof the elders of Israel; and worship ye afar off. 2And Moses alone shall come near theLord: but they shall not come nigh; neither shall the people go up with him. 3Â¶And Moses came and told the people all the words of theLord, and all thejudgments: and all the people answered with onevoice, and said, All the words which theLordhath said will we do. 4And Moseswroteall the words of theLord, and rose up early in the morning, and builded analtarunder the hill, and twelvepillars, according to the twelve tribes of Israel. 5And he sent young men of the children of Israel, which offered burnt offerings, and sacrificedpeace offeringsof oxen unto theLord. 6And Moses took half of theblood, and putitin basins; and half of the blood he sprinkled on the altar. 7And he took the book of thecovenant, andreadin the audience of the people: and they said, All that theLordhath said will we do, and beobedient. 8And Moses took theblood, andsprinklediton the people, and said, Behold thebloodof thecovenant, which theLordhath made with you concerning all these words. 9Â¶Then went up Moses, and Aaron, Nadab, and Abihu, andseventyof theeldersof Israel: 10And theysawthe God of Israel: andthere wasunder hisfeetas it were a paved work of a sapphire stone, and asitwere the body of heaven inhisclearness. 11And upon the nobles of the children of Israel he laid not his hand: also theysawGod, and did eat and drink. 12Â¶And theLordsaid unto Moses, Come up to me into the mount, and be there: and I will give theetablesof stone, and alaw, and commandments which I havewritten; that thou mayest teach them. 13And Moses rose up, and his ministerJoshua: and Moses went up into themount of God. 14And he said unto the elders, Tarry ye here for us, until we come again unto you: and, behold, Aaron and Hurarewith you: if any man have any matters to do, let him come unto them. 15And Moses went up into the mount, and acloudcovered the mount. 16And thegloryof theLordabode upon mount Sinai, and the cloud covered it six days: and the seventh day he called unto Moses out of the midst of the cloud. 17And thesightof thegloryof theLordwaslike devouring fire on the top of the mount in the eyes of the children of Israel. 18And Moses went into the midst of the cloud, and gat him up into the mount: and Moses was in the mountfortydays and forty nights."
    },
    {
      "reference": "Exodus 31",
      "title": "Exodus 31",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/31?lang=eng",
      "summary": "Artisans are inspired in building and furnishing the tabernacleâIsrael is commanded to keep the Lordâs SabbathsâThe death penalty is decreed for Sabbath desecrationâMoses receives the stone tablets.",
      "verses": [
        "1And theLordspake unto Moses, saying,",
        "2See, I have called by nameBezaleelthe son of Uri, the son of Hur, of the tribe of Judah:",
        "3And I have filled him with thespiritof God, inwisdom, and in understanding, and inknowledge,and in all manner ofworkmanship,",
        "4To devisecunning works, to work ingold, and in silver, and in brass,",
        "5And incuttingof stones, to setthem,and in carving of timber, to work in all manner of workmanship.",
        "6And I, behold, I have given with him Aholiab, the son of Ahisamach, of the tribe of Dan: and in the hearts of all that arewisehearted I have putwisdom, that they may make all that I have commanded thee;",
        "7Thetabernacle of the congregation, and the ark of the testimony, and the mercy seat thatisthereupon, and all the furniture of the tabernacle,",
        "8And the table andhis furniture, and the pure candlestick with all his furniture, and the altar of incense,",
        "9And the altar of burnt offering with all his furniture, and the laver and his foot,",
        "10And thecloths of service, and the holy garments for Aaron the priest, and the garments of his sons, to minister in the priestâs office,",
        "11And theanointing oil, and sweetincensefor the holyplace:according to all that I have commanded thee shall they do.",
        "12Â¶And theLordspake unto Moses, saying,",
        "13Speak thou also unto the children of Israel, saying, Verily mysabbathsye shall keep: for itisa sign between me and you throughout your generations; thatyemay know that IamtheLordthat doth sanctify you.",
        "14Ye shall keep the sabbath therefore; for itisholyunto you: every one that defileth it shall surely be put todeath: for whosoever doethanywork therein, that soul shall be cut off from among his people.",
        "15Six days may work be done; but in the seventhisthe sabbath ofrest, holy to theLord: whosoever doethanyworkin the sabbath day, he shall surely be put to death.",
        "16Wherefore the children of Israel shall keep the sabbath, to observe the sabbath throughout their generations,fora perpetualcovenant.",
        "17Itisa sign between me and the children of Israel for ever: forinsixdays theLordmadeheaven and earth, and on theseventh dayherested, and wasrefreshed.",
        "18Â¶And he gave unto Moses, when he had made an end of communing with him upon mount Sinai, twotablesoftestimony, tables of stone,writtenwith the finger of God."
      ],
      "full_text": "1And theLordspake unto Moses, saying, 2See, I have called by nameBezaleelthe son of Uri, the son of Hur, of the tribe of Judah: 3And I have filled him with thespiritof God, inwisdom, and in understanding, and inknowledge,and in all manner ofworkmanship, 4To devisecunning works, to work ingold, and in silver, and in brass, 5And incuttingof stones, to setthem,and in carving of timber, to work in all manner of workmanship. 6And I, behold, I have given with him Aholiab, the son of Ahisamach, of the tribe of Dan: and in the hearts of all that arewisehearted I have putwisdom, that they may make all that I have commanded thee; 7Thetabernacle of the congregation, and the ark of the testimony, and the mercy seat thatisthereupon, and all the furniture of the tabernacle, 8And the table andhis furniture, and the pure candlestick with all his furniture, and the altar of incense, 9And the altar of burnt offering with all his furniture, and the laver and his foot, 10And thecloths of service, and the holy garments for Aaron the priest, and the garments of his sons, to minister in the priestâs office, 11And theanointing oil, and sweetincensefor the holyplace:according to all that I have commanded thee shall they do. 12Â¶And theLordspake unto Moses, saying, 13Speak thou also unto the children of Israel, saying, Verily mysabbathsye shall keep: for itisa sign between me and you throughout your generations; thatyemay know that IamtheLordthat doth sanctify you. 14Ye shall keep the sabbath therefore; for itisholyunto you: every one that defileth it shall surely be put todeath: for whosoever doethanywork therein, that soul shall be cut off from among his people. 15Six days may work be done; but in the seventhisthe sabbath ofrest, holy to theLord: whosoever doethanyworkin the sabbath day, he shall surely be put to death. 16Wherefore the children of Israel shall keep the sabbath, to observe the sabbath throughout their generations,fora perpetualcovenant. 17Itisa sign between me and the children of Israel for ever: forinsixdays theLordmadeheaven and earth, and on theseventh dayherested, and wasrefreshed. 18Â¶And he gave unto Moses, when he had made an end of communing with him upon mount Sinai, twotablesoftestimony, tables of stone,writtenwith the finger of God."
    },
    {
      "reference": "Exodus 32",
      "title": "Exodus 32",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/32?lang=eng",
      "summary": "Aaron makes a golden calf, which Israel worshipsâMoses serves as a mediator between God and rebellious IsraelâMoses breaks the tablets of stoneâThe Levites slay about 3,000 rebelsâMoses pleads and intercedes for the people.",
      "verses": [
        "1And when the people saw that Mosesdelayedto come down out of the mount, the people gathered themselves together unto Aaron, and said unto him, Up, make usgods, which shallgobefore us; foras forthis Moses, the man that brought us up out of the land of Egypt, wewotnot what is become of him.",
        "2And Aaron said unto them, Break off thegoldenearrings, whicharein the ears of your wives, of your sons, and of your daughters, and bringthemunto me.",
        "3And all the people brake off the golden earrings whichwerein their ears, and broughtthemunto Aaron.",
        "4And he receivedthemat their hand, and fashioned it with a graving tool, after he had made it amoltencalf: and they said,Thesebethygods, O Israel, which brought thee up out of the land of Egypt.",
        "5And when Aaron sawit,he built an altar before it; and Aaron made proclamation, and said, To morrowisa feast to theLord.",
        "6And they rose up early on the morrow, and offered burnt offerings, and broughtpeace offerings; and thepeoplesat down to eat and to drink, and rose up to play.",
        "7Â¶And theLordsaid unto Moses, Go, get thee down; for thy people, which thou broughtest out of the land of Egypt, havecorruptedthemselves:",
        "8They haveturnedasidequicklyout of the way which I commanded them: they have made them amoltencalf, and have worshipped it, and have sacrificed thereunto, and said, Thesebethy gods, O Israel, which have brought thee up out of the land of Egypt.",
        "9And theLordsaid unto Moses, I have seen this people, and, behold, itisastiffneckedpeople:",
        "10Now therefore let me alone, that mywrathmay wax hot against them, and that I mayconsumethem: and I will make of thee a greatnation.",
        "11And MosesbesoughttheLordhis God, and said,Lord, why doth thy wrath wax hot against thy people, which thou hast brought forth out of the land of Egypt with great power, and with a mighty hand?",
        "12Wherefore should theEgyptiansspeak, and say, For mischief did he bring them out, to slay them in the mountains, and to consume them from the face of the earth? Turn from thy fiercewrath, andrepentof this evil against thy people.",
        "13RememberAbraham, Isaac, and Israel, thy servants, to whom thouswarestby thine own self, and saidst unto them, I willmultiplyyourseedas the stars of heaven, and all thislandthat I have spoken of will I give unto your seed, and they shall inherititfor ever.",
        "14AndtheLordrepentedof the evil which he thought to do unto his people.",
        "15Â¶And Moses turned, and went down from the mount, and the twotablesof the testimonywerein his hand: the tableswerewritten on both their sides; on the one side and on the otherwerethey written.",
        "16And thetableswerethe work of God, and thewritingwasthewriting of God, graven upon the tables.",
        "17And whenJoshuaheard the noise of the people as theyshouted, he said unto Moses,There isa noise of war in the camp.",
        "18And he said,It isnot the voice ofthem thatshout for mastery, neitheris itthe voice ofthem thatcry for being overcome:butthe noise ofthem thatsing do I hear.",
        "19Â¶And it came to pass, as soon as he came nigh unto the camp, that hesawthe calf, and the dancing: and Mosesâangerwaxed hot, and he cast the tables out of his hands, andbrakethem beneath the mount.",
        "20And he took thecalfwhich they had made, and burntitin the fire, and grounditto powder, andstraweditupon thewater, and made the children of Israel drinkof it.",
        "21And Moses said unto Aaron, What did this people unto thee, that thou hast brought so great a sin upon them?",
        "22And Aaron said, Let not theangerof my lord wax hot: thou knowest the people, that theyaresetonmischief.",
        "23For they said unto me,Makeusgods, which shall go before us: foras forthis Moses, the man that brought us up out of the land of Egypt, we wot not what is become of him.",
        "24And I said unto them, Whosoever hath any gold, let them breakitoff. So they gaveitme: then I cast it into the fire, and there came out this calf.",
        "25Â¶And when Moses saw that the peoplewerenaked; (for Aaron had made themnakeduntotheirshame among their enemies:)",
        "26Then Moses stood in the gate of the camp, and said, Whoison theLordâs side?let him comeunto me. And all the sons of Levi gathered themselves together unto him.",
        "27And he said unto them, Thus saith theLordGod of Israel, Put every man his sword by his side,andgo in and out from gate to gate throughout the camp, andslayevery man his brother, and every man his companion, and every man his neighbour.",
        "28And the children of Levi did according to the word of Moses: and there fell of the people that day about three thousand men.",
        "29For Moses had said,Consecrateyourselves to day to theLord, even every man upon hisson, and upon his brother; that he may bestow upon you ablessingthis day.",
        "30Â¶And it came to pass on the morrow, that Moses said unto the people, Ye havesinneda great sin: and now I will go up unto theLord;peradventureI shall make anatonementfor your sin.",
        "31And Moses returned unto theLord, and said, Oh, this people have sinned a great sin, and have made themgodsof gold.",
        "32Yet now, if thou wiltforgivetheir sinâ; and if not,blotme, I pray thee, out of thybookwhich thou hastwritten.",
        "33And theLordsaid unto Moses,Whosoeverhathsinnedagainst me, him will Iblot outof mybook.",
        "34Therefore now go,leadthe people untothe placeof which I have spoken unto thee: behold, mineAngelshall go before thee: nevertheless in the day when I visit I will visit their sin upon them.",
        "35And theLordplagued the people, because they made the calf, which Aaron made."
      ],
      "full_text": "1And when the people saw that Mosesdelayedto come down out of the mount, the people gathered themselves together unto Aaron, and said unto him, Up, make usgods, which shallgobefore us; foras forthis Moses, the man that brought us up out of the land of Egypt, wewotnot what is become of him. 2And Aaron said unto them, Break off thegoldenearrings, whicharein the ears of your wives, of your sons, and of your daughters, and bringthemunto me. 3And all the people brake off the golden earrings whichwerein their ears, and broughtthemunto Aaron. 4And he receivedthemat their hand, and fashioned it with a graving tool, after he had made it amoltencalf: and they said,Thesebethygods, O Israel, which brought thee up out of the land of Egypt. 5And when Aaron sawit,he built an altar before it; and Aaron made proclamation, and said, To morrowisa feast to theLord. 6And they rose up early on the morrow, and offered burnt offerings, and broughtpeace offerings; and thepeoplesat down to eat and to drink, and rose up to play. 7Â¶And theLordsaid unto Moses, Go, get thee down; for thy people, which thou broughtest out of the land of Egypt, havecorruptedthemselves: 8They haveturnedasidequicklyout of the way which I commanded them: they have made them amoltencalf, and have worshipped it, and have sacrificed thereunto, and said, Thesebethy gods, O Israel, which have brought thee up out of the land of Egypt. 9And theLordsaid unto Moses, I have seen this people, and, behold, itisastiffneckedpeople: 10Now therefore let me alone, that mywrathmay wax hot against them, and that I mayconsumethem: and I will make of thee a greatnation. 11And MosesbesoughttheLordhis God, and said,Lord, why doth thy wrath wax hot against thy people, which thou hast brought forth out of the land of Egypt with great power, and with a mighty hand? 12Wherefore should theEgyptiansspeak, and say, For mischief did he bring them out, to slay them in the mountains, and to consume them from the face of the earth? Turn from thy fiercewrath, andrepentof this evil against thy people. 13RememberAbraham, Isaac, and Israel, thy servants, to whom thouswarestby thine own self, and saidst unto them, I willmultiplyyourseedas the stars of heaven, and all thislandthat I have spoken of will I give unto your seed, and they shall inherititfor ever. 14AndtheLordrepentedof the evil which he thought to do unto his people. 15Â¶And Moses turned, and went down from the mount, and the twotablesof the testimonywerein his hand: the tableswerewritten on both their sides; on the one side and on the otherwerethey written. 16And thetableswerethe work of God, and thewritingwasthewriting of God, graven upon the tables. 17And whenJoshuaheard the noise of the people as theyshouted, he said unto Moses,There isa noise of war in the camp. 18And he said,It isnot the voice ofthem thatshout for mastery, neitheris itthe voice ofthem thatcry for being overcome:butthe noise ofthem thatsing do I hear. 19Â¶And it came to pass, as soon as he came nigh unto the camp, that hesawthe calf, and the dancing: and Mosesâangerwaxed hot, and he cast the tables out of his hands, andbrakethem beneath the mount. 20And he took thecalfwhich they had made, and burntitin the fire, and grounditto powder, andstraweditupon thewater, and made the children of Israel drinkof it. 21And Moses said unto Aaron, What did this people unto thee, that thou hast brought so great a sin upon them? 22And Aaron said, Let not theangerof my lord wax hot: thou knowest the people, that theyaresetonmischief. 23For they said unto me,Makeusgods, which shall go before us: foras forthis Moses, the man that brought us up out of the land of Egypt, we wot not what is become of him. 24And I said unto them, Whosoever hath any gold, let them breakitoff. So they gaveitme: then I cast it into the fire, and there came out this calf. 25Â¶And when Moses saw that the peoplewerenaked; (for Aaron had made themnakeduntotheirshame among their enemies:) 26Then Moses stood in the gate of the camp, and said, Whoison theLordâs side?let him comeunto me. And all the sons of Levi gathered themselves together unto him. 27And he said unto them, Thus saith theLordGod of Israel, Put every man his sword by his side,andgo in and out from gate to gate throughout the camp, andslayevery man his brother, and every man his companion, and every man his neighbour. 28And the children of Levi did according to the word of Moses: and there fell of the people that day about three thousand men. 29For Moses had said,Consecrateyourselves to day to theLord, even every man upon hisson, and upon his brother; that he may bestow upon you ablessingthis day. 30Â¶And it came to pass on the morrow, that Moses said unto the people, Ye havesinneda great sin: and now I will go up unto theLord;peradventureI shall make anatonementfor your sin. 31And Moses returned unto theLord, and said, Oh, this people have sinned a great sin, and have made themgodsof gold. 32Yet now, if thou wiltforgivetheir sinâ; and if not,blotme, I pray thee, out of thybookwhich thou hastwritten. 33And theLordsaid unto Moses,Whosoeverhathsinnedagainst me, him will Iblot outof mybook. 34Therefore now go,leadthe people untothe placeof which I have spoken unto thee: behold, mineAngelshall go before thee: nevertheless in the day when I visit I will visit their sin upon them. 35And theLordplagued the people, because they made the calf, which Aaron made."
    },
    {
      "reference": "Exodus 33",
      "title": "Exodus 33",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/33?lang=eng",
      "summary": "The Lord promises to be with Israel and drive out the people of the landâThe tabernacle of the congregation is moved away from the campâThe Lord speaks to Moses face to face in the tabernacleâLater, Moses sees the glory of God but not His face.",
      "verses": [
        "1And theLordsaid unto Moses,Depart,andgo up hence, thou and the people which thou hast brought up out of the land of Egypt, unto the land which I sware unto Abraham, to Isaac, and to Jacob, saying, Unto thyseedwill I give it:",
        "2And I will send anangelbefore thee; and I will drive out theCanaanite, the Amorite, and the Hittite, and the Perizzite, the Hivite, and the Jebusite:",
        "3Unto a landflowingwith milk and honey: for I will not go up in the midst of thee; for thouarta stiffnecked people: lest I consume thee in the way.",
        "4Â¶And when the people heard these evil tidings, theymourned: and no man did put on him hisornaments.",
        "5For theLordhad said unto Moses, Say unto the children of Israel, Yeareastiffneckedpeople:Iwill come up into the midst of thee in a moment, and consume thee: therefore now put off thy ornaments from thee, that I may know what to do unto thee.",
        "6And the children of Israel stripped themselves of their ornaments by the mount Horeb.",
        "7And Moses took the tabernacle, and pitched it without the camp, afar off from the camp, and called it theTabernacleof the congregation. And it came to pass,thatevery one which sought theLordwent out unto thetabernacle of the congregation, whichwaswithout the camp.",
        "8And it came to pass, when Moses went out unto the tabernacle,thatall the people rose up, and stood every manathistentdoor, and looked after Moses, until he was gone into the tabernacle.",
        "9And it came to pass, as Moses entered into the tabernacle, thecloudy pillardescended, and stoodatthe door of the tabernacle, andtheLordtalked with Moses.",
        "10And all the people saw the cloudy pillar standatthe tabernacle door: and all the people rose up and worshipped, every maninhis tent door.",
        "11And theLordspakeunto Mosesface to face, as a manspeakethunto hisfriend. And he turned again into the camp: but his servantJoshua, the son ofNun, a young man, departed not out of the tabernacle.",
        "12Â¶And Moses said unto theLord, See, thou sayest unto me,Bringup this people: and thou hast not let me know whom thou wiltsend with me. Yet thou hast said, Iknowthee byname, and thou hast also found grace in my sight.",
        "13Now therefore, I pray thee, if I have foundgracein thy sight,shewme now thyway, that I may know thee, that I may find grace in thy sight: and consider that this nationisthypeople.",
        "14And he said, Mypresenceshall gowith thee,and I will give theerest.",
        "15And he said unto him, If thy presence go notwith me,carry us not up hence.",
        "16For wherein shall it be known here that I and thy people have found grace in thy sight?is itnot in that thougoestwith us? so shall we beseparated, I and thy people, from all the people thatareupon the face of the earth.",
        "17And theLordsaid unto Moses,Iwilldothis thing also that thou hast spoken: for thou hast found grace in my sight, and I know thee by name.",
        "18And he said, I beseech thee,shewme thyglory.",
        "19And he said, I will make all mygoodnesspass before thee, and I willproclaimthe name of theLordbefore thee; and will be gracious to whom I will be gracious, and will shewmercyon whom I will shew mercy.",
        "20Andhe said, Thou canst not see my face: forthereshall no manseeme, and live.",
        "21And theLordsaid, Behold,there isa place by me, and thou shalt stand upon a rock:",
        "22And it shall come to pass, while my glory passeth by, that I will put thee in a clift of the rock, and will cover thee with my handwhile I pass by:",
        "23And I will take away mine hand, and thou shaltseemybackparts: but my face shall not beseen."
      ],
      "full_text": "1And theLordsaid unto Moses,Depart,andgo up hence, thou and the people which thou hast brought up out of the land of Egypt, unto the land which I sware unto Abraham, to Isaac, and to Jacob, saying, Unto thyseedwill I give it: 2And I will send anangelbefore thee; and I will drive out theCanaanite, the Amorite, and the Hittite, and the Perizzite, the Hivite, and the Jebusite: 3Unto a landflowingwith milk and honey: for I will not go up in the midst of thee; for thouarta stiffnecked people: lest I consume thee in the way. 4Â¶And when the people heard these evil tidings, theymourned: and no man did put on him hisornaments. 5For theLordhad said unto Moses, Say unto the children of Israel, Yeareastiffneckedpeople:Iwill come up into the midst of thee in a moment, and consume thee: therefore now put off thy ornaments from thee, that I may know what to do unto thee. 6And the children of Israel stripped themselves of their ornaments by the mount Horeb. 7And Moses took the tabernacle, and pitched it without the camp, afar off from the camp, and called it theTabernacleof the congregation. And it came to pass,thatevery one which sought theLordwent out unto thetabernacle of the congregation, whichwaswithout the camp. 8And it came to pass, when Moses went out unto the tabernacle,thatall the people rose up, and stood every manathistentdoor, and looked after Moses, until he was gone into the tabernacle. 9And it came to pass, as Moses entered into the tabernacle, thecloudy pillardescended, and stoodatthe door of the tabernacle, andtheLordtalked with Moses. 10And all the people saw the cloudy pillar standatthe tabernacle door: and all the people rose up and worshipped, every maninhis tent door. 11And theLordspakeunto Mosesface to face, as a manspeakethunto hisfriend. And he turned again into the camp: but his servantJoshua, the son ofNun, a young man, departed not out of the tabernacle. 12Â¶And Moses said unto theLord, See, thou sayest unto me,Bringup this people: and thou hast not let me know whom thou wiltsend with me. Yet thou hast said, Iknowthee byname, and thou hast also found grace in my sight. 13Now therefore, I pray thee, if I have foundgracein thy sight,shewme now thyway, that I may know thee, that I may find grace in thy sight: and consider that this nationisthypeople. 14And he said, Mypresenceshall gowith thee,and I will give theerest. 15And he said unto him, If thy presence go notwith me,carry us not up hence. 16For wherein shall it be known here that I and thy people have found grace in thy sight?is itnot in that thougoestwith us? so shall we beseparated, I and thy people, from all the people thatareupon the face of the earth. 17And theLordsaid unto Moses,Iwilldothis thing also that thou hast spoken: for thou hast found grace in my sight, and I know thee by name. 18And he said, I beseech thee,shewme thyglory. 19And he said, I will make all mygoodnesspass before thee, and I willproclaimthe name of theLordbefore thee; and will be gracious to whom I will be gracious, and will shewmercyon whom I will shew mercy. 20Andhe said, Thou canst not see my face: forthereshall no manseeme, and live. 21And theLordsaid, Behold,there isa place by me, and thou shalt stand upon a rock: 22And it shall come to pass, while my glory passeth by, that I will put thee in a clift of the rock, and will cover thee with my handwhile I pass by: 23And I will take away mine hand, and thou shaltseemybackparts: but my face shall not beseen."
    },
    {
      "reference": "Exodus 34",
      "title": "Exodus 34",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ex/34?lang=eng",
      "summary": "Moses hews new tables of stoneâHe goes up into Mount Sinai for forty daysâThe Lord proclaims His name and attributes and reveals His lawâHe makes another covenant with IsraelâThe skin of Mosesâ face shines, and he wears a veil.",
      "verses": [
        "1AndtheLordsaid unto Moses,Hewthee twotablesof stone like unto the first: and I willwriteuponthesetables the words that were in the first tables, which thoubrakest.",
        "2And be ready in the morning, and come up in the morning unto mount Sinai, and present thyself there to me in thetopof the mount.",
        "3And no man shallcomeup with thee, neither let any man be seen throughout all the mount; neither let the flocks nor herds feed before that mount.",
        "4Â¶And he hewed twotablesof stone like unto the first; and Mosesrose up early in the morning, and went up unto mount Sinai, as theLordhad commanded him, and took in his hand the two tables of stone.",
        "5And theLorddescended in the cloud, and stood with him there, andproclaimedthe name of theLord.",
        "6And theLordpassed by before him, and proclaimed, TheLord, TheLordGod,mercifulandgracious,longsuffering, and abundant ingoodnessand truth,",
        "7Keeping mercy for thousands,forgivinginiquity and transgression andsin,and thatwill by no meanscleartheguilty;visiting theiniquityof the fathers upon the children, and upon the childrenâs children, unto the third and to the fourthgeneration.",
        "8And Moses made haste, andbowedhis head toward the earth, and worshipped.",
        "9And he said, If now I have foundgracein thy sight, O Lord, let my Lord, I pray thee, go among us; for itisastiffneckedpeople; andpardonour iniquity and our sin, and take us forthineinheritance.",
        "10Â¶And he said, Behold, I make a covenant: before all thy people I will domarvels, such as have not been done in all the earth, nor in any nation: and all the people among which thouartshall see the work of theLord: for itisaterriblething that I will do with thee.",
        "11Observethou that which I command thee this day: behold, Idriveout before thee the Amorite, and the Canaanite, and the Hittite, and the Perizzite, and the Hivite, and the Jebusite.",
        "12Take heed to thyself, lest thou make acovenantwith theinhabitantsof the land whither thou goest, lest itbe for asnare in the midst of thee:",
        "13But ye shalldestroytheiraltars, break their images, and cut down theirgroves:",
        "14For thou shalt worshipnoothergod: for theLord, whose nameisJealous,isajealousGod:",
        "15Lest thou make acovenantwith the inhabitants of the land, and they go awhoringafter theirgods, and do sacrifice unto their gods, andonecallthee, and thoueatof his sacrifice;",
        "16And thoutakeof theirdaughtersunto thy sons, and their daughters go a whoring after their gods, and make thy sons go a whoring after their gods.",
        "17Thou shalt make thee no moltengods.",
        "18Â¶Thefeastofunleavenedbread shalt thou keep. Seven daysthou shalt eat unleavened bread, as I commanded thee, in thetimeof the monthAbib: for in themonthAbib thou camest out from Egypt.",
        "19All thatopeneththematrixismine; and every firstling among thy cattle,whetherox or sheep,that is male.",
        "20But the firstling of an ass thou shalt redeem with a lamb: and if thou redeemhimnot, then shalt thou break his neck. All thefirstbornof thy sons thou shalt redeem. And none shall appear before me empty.",
        "21Â¶Six days thou shalt work, but on the seventh day thou shaltrest: inearingtime and in harvest thou shalt rest.",
        "22Â¶And thou shalt observe thefeastof weeks, of the firstfruits of wheat harvest, and the feast of ingathering at the yearâs end.",
        "23Â¶Thricein the year shall all your men children appear before the LordGod, the God of Israel.",
        "24For I willcast outthe nations before thee, and enlarge thy borders: neither shall any mandesirethy land, when thou shalt go up to appear before theLordthy God thrice in the year.",
        "25Thou shalt not offer thebloodof my sacrifice withleaven; neither shall the sacrifice of the feast of the passover beleftunto the morning.",
        "26The first of thefirstfruitsof thy land thou shalt bring unto the house of theLordthy God. Thou shalt notseethea kid in his motherâs milk.",
        "27And theLordsaid unto Moses,Writethou these words: forafterthe tenor of these words I have made a covenant with thee and with Israel.",
        "28And he was there with theLordfortydays and forty nights; he did neithereatbread, nor drink water. And hewroteupon the tables the words of thecovenant, thetencommandments.",
        "29Â¶And it came to pass, when Moses came down from mount Sinai with thetwotablesof testimony in Mosesâ hand, when he came down from the mount, that Moseswistnot that the skin of his faceshonewhile he talked with him.",
        "30And when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone; and they were afraid to come nigh him.",
        "31And Moses called unto them; and Aaron and all therulersof the congregation returned unto him: and Moses talked with them.",
        "32And afterward all the children of Israel came nigh: and he gave them in commandment all that theLordhad spoken with him in mount Sinai.",
        "33AndtillMoses had done speaking with them, he put aveilon his face.",
        "34But when Moses went in before theLordto speak with him, he took the veil off, until he came out. And he came out, and spake unto the children of Israelthatwhich he was commanded.",
        "35And the children of Israel saw the face of Moses, that the skin of Mosesâ face shone: and Moses put the veil upon his face again, until he went in to speak with him."
      ],
      "full_text": "1AndtheLordsaid unto Moses,Hewthee twotablesof stone like unto the first: and I willwriteuponthesetables the words that were in the first tables, which thoubrakest. 2And be ready in the morning, and come up in the morning unto mount Sinai, and present thyself there to me in thetopof the mount. 3And no man shallcomeup with thee, neither let any man be seen throughout all the mount; neither let the flocks nor herds feed before that mount. 4Â¶And he hewed twotablesof stone like unto the first; and Mosesrose up early in the morning, and went up unto mount Sinai, as theLordhad commanded him, and took in his hand the two tables of stone. 5And theLorddescended in the cloud, and stood with him there, andproclaimedthe name of theLord. 6And theLordpassed by before him, and proclaimed, TheLord, TheLordGod,mercifulandgracious,longsuffering, and abundant ingoodnessand truth, 7Keeping mercy for thousands,forgivinginiquity and transgression andsin,and thatwill by no meanscleartheguilty;visiting theiniquityof the fathers upon the children, and upon the childrenâs children, unto the third and to the fourthgeneration. 8And Moses made haste, andbowedhis head toward the earth, and worshipped. 9And he said, If now I have foundgracein thy sight, O Lord, let my Lord, I pray thee, go among us; for itisastiffneckedpeople; andpardonour iniquity and our sin, and take us forthineinheritance. 10Â¶And he said, Behold, I make a covenant: before all thy people I will domarvels, such as have not been done in all the earth, nor in any nation: and all the people among which thouartshall see the work of theLord: for itisaterriblething that I will do with thee. 11Observethou that which I command thee this day: behold, Idriveout before thee the Amorite, and the Canaanite, and the Hittite, and the Perizzite, and the Hivite, and the Jebusite. 12Take heed to thyself, lest thou make acovenantwith theinhabitantsof the land whither thou goest, lest itbe for asnare in the midst of thee: 13But ye shalldestroytheiraltars, break their images, and cut down theirgroves: 14For thou shalt worshipnoothergod: for theLord, whose nameisJealous,isajealousGod: 15Lest thou make acovenantwith the inhabitants of the land, and they go awhoringafter theirgods, and do sacrifice unto their gods, andonecallthee, and thoueatof his sacrifice; 16And thoutakeof theirdaughtersunto thy sons, and their daughters go a whoring after their gods, and make thy sons go a whoring after their gods. 17Thou shalt make thee no moltengods. 18Â¶Thefeastofunleavenedbread shalt thou keep. Seven daysthou shalt eat unleavened bread, as I commanded thee, in thetimeof the monthAbib: for in themonthAbib thou camest out from Egypt. 19All thatopeneththematrixismine; and every firstling among thy cattle,whetherox or sheep,that is male. 20But the firstling of an ass thou shalt redeem with a lamb: and if thou redeemhimnot, then shalt thou break his neck. All thefirstbornof thy sons thou shalt redeem. And none shall appear before me empty. 21Â¶Six days thou shalt work, but on the seventh day thou shaltrest: inearingtime and in harvest thou shalt rest. 22Â¶And thou shalt observe thefeastof weeks, of the firstfruits of wheat harvest, and the feast of ingathering at the yearâs end. 23Â¶Thricein the year shall all your men children appear before the LordGod, the God of Israel. 24For I willcast outthe nations before thee, and enlarge thy borders: neither shall any mandesirethy land, when thou shalt go up to appear before theLordthy God thrice in the year. 25Thou shalt not offer thebloodof my sacrifice withleaven; neither shall the sacrifice of the feast of the passover beleftunto the morning. 26The first of thefirstfruitsof thy land thou shalt bring unto the house of theLordthy God. Thou shalt notseethea kid in his motherâs milk. 27And theLordsaid unto Moses,Writethou these words: forafterthe tenor of these words I have made a covenant with thee and with Israel. 28And he was there with theLordfortydays and forty nights; he did neithereatbread, nor drink water. And hewroteupon the tables the words of thecovenant, thetencommandments. 29Â¶And it came to pass, when Moses came down from mount Sinai with thetwotablesof testimony in Mosesâ hand, when he came down from the mount, that Moseswistnot that the skin of his faceshonewhile he talked with him. 30And when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone; and they were afraid to come nigh him. 31And Moses called unto them; and Aaron and all therulersof the congregation returned unto him: and Moses talked with them. 32And afterward all the children of Israel came nigh: and he gave them in commandment all that theLordhad spoken with him in mount Sinai. 33AndtillMoses had done speaking with them, he put aveilon his face. 34But when Moses went in before theLordto speak with him, he took the veil off, until he came out. And he came out, and spake unto the children of Israelthatwhich he was commanded. 35And the children of Israel saw the face of Moses, that the skin of Mosesâ face shone: and Moses put the veil upon his face again, until he went in to speak with him."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:28:09",
  "metadata": {
    "week_number": 17,
    "title": "Week 17: April 20–26 - Exodus 19–20; 24; 31–34",
    "date_range": "April 20–26",
    "scraped_at": "2025-12-21T22:28:14.428224",
    "scraper_version": "2.0.0"
  }
}