{
  "week_number": 7,
  "date_range": "February 9–15",
  "title": "Week 7: February 9–15 - Genesis 6–11; Moses 8",
  "bundle_title": "Week 7: February 9–15: \"Week 7: February 9–15 - Genesis 6–11; Moses 8\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/07?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/07?lang=eng",
    "title": "Genesis 6–11;Moses 8",
    "scripture_references": "Genesis 6–11; Moses 8",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“February 9–15. ‘Noah Found Grace in the Eyes of the Lord’: Genesis 6–11; Moses 8,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“February 9–15. ‘Noah Found Grace in the Eyes of the Lord’,”Come, Follow Me: 2026\n\nFebruary 9–15: “Noah Found Grace in the Eyes of the Lord”\n\nLiving in the latter days, we have special reason to pay attention to the story of the Flood. When Jesus Christ taught how we should watch for His Second Coming, He said, “As it was in the days of Noah, so it shall be also at the coming of the Son of Man” (Joseph Smith—Matthew 1:41). In addition, words that describe Noah’s day, like “corrupt” and “filled with violence,” could just as easily describe our time (Genesis 6:12–13;Moses 8:28). The story of the Tower of Babel also feels applicable to our day, with its description of pride followed by confusion and then division.\n\nThese ancient accounts are valuable not just because they show us that wickedness repeats itself throughout history. More important, they teach us what to do about it. Noah “found grace in the eyes of the Lord” (Moses 8:27). And the families of Jared and his brother turned to the Lord and were protected from the confusion and division in Babel (seeEther 1:33–43). If we wonder how to keep ourselves and our families safe during corruption and violence, the stories in these chapters have much to teach us.",
    "learning_at_home_church": [
      {
        "title": "There is spiritual safety in following the Lord’s prophet.",
        "content": "Do you see anything in the description of Noah’s day that seems similar to conditions in our day? In particular, look inMoses 8:15–24, 28. What themes do you see repeated?\n\nOne important similarity you’ll see is that God called Noah to be a prophet, and He has called a prophet today too. Consider making a list of truths you learn about prophets fromMoses 8:13–30. How is our living prophet like Noah? Of course, the Lord’s prophet today isn’t warning of a Flood or inviting us to help build an ark. But what is he warning us about? And what is he inviting us to do? To help answer these questions, you could review a chapter fromTeachings of Presidents of the Churchin Gospel Library, especially the “Invitations and Promised Blessings” section. Perhaps you could pick one warning and one invitation that seem especially important to you.\n\nElder Allen D. Haynie taught, “A perfect and loving Father in Heaven has chosen the pattern of revealing truth to His children through a prophet” (“A Living Prophet for the Latter Days,”Liahona, May 2023, 25). Consider studying Elder Haynie’s message, looking for reasons having a prophet is a sign of Heavenly Father’s love. How has following the Lord’s prophet helped you feel safe living in the latter days?\n\nSee also Topics and Questions, “Prophets,” Gospel Library; “Why Do We Have Prophets?” (video), Gospel Library.\n\nWhy Do We Have Prophets?\n\nGenesis 6:5–13"
      },
      {
        "title": "The Flood was an act of God’s mercy.",
        "content": "Some people wonder about the justice of God in sending the Flood to “destroy man” (Genesis 6:7). Elder Neal A. Maxwell explained that at the time of the Flood, “corruption had reached an agency-destroying point that spirits could not, in justice, be sent here” (We Will Prove Them Herewith[1982], 58). You might also consider how the Flood was an act of mercy. What do you find inGenesis 6:5–13that shows the Lord’s tender mercy and love for the people?\n\nGenesis 9:8–17"
      },
      {
        "title": "Tokens or symbols help me remember my covenants with the Lord.",
        "content": "According toGenesis 9:8–17, what can a rainbow bring to your mind? What doesJoseph Smith Translation, Genesis 9:21–25(in the Bible appendix) add to your understanding? You might also consider making a list of other things (like symbols, objects, or anything else) that God has given you to remind you of your covenants. What do these things teach you? How do they help you remember?\n\nSee also Gerrit W. Gong, “Always Remember Him,”EnsignorLiahona, May 2016, 108–11; “Reverently and Meekly Now,”Hymns, no. 185.\n\nThe Tower of Babel, by David Green\n\nGenesis 11:1–9"
      },
      {
        "title": "Following Jesus Christ is the only way to Heavenly Father.",
        "content": "The account of the people of Babel building a tower provides an interesting contrast to the account of Enoch and his people building Zion, which you studied last week. Both groups of people were trying to reach heaven but in different ways. How did the people of Zion obtain heaven? (seeMoses 7:18–19, 53, 62–63, 69). What do you learn fromGenesis 11:1–9andHelaman 6:26–28about the people of Babel? What does this teach us about our own efforts to return to God’s presence? What has God provided to help us “reach unto heaven”? (Genesis 11:4; see alsoJohn 3:16).\n\nLearn actively.Learning can involve more than just reading or listening. For example, when learning about the Tower of Babel, you and your family or class could write, on slips of paper, things that take us away from God. Then, on other slips of paper, you could write things that bring us nearer to God. Arrange the first group of papers in the shape of a tower and the second group in the shape of a temple.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "Following the Lord’s prophet will bless me and my family.",
        "content": "Most children love the story of Noah and the ark. Consider giving your children opportunities to share what they know about it. To help them, you could use the pictures in this outline, “Noah and His Family” inOld Testament Stories(22–25), and the third verse of “Follow the Prophet” (Children’s Songbook, 110–11). Your children might enjoy acting out parts of the story—for example, by pretending to use a tool to build the ark or walking like animals entering the ark.\n\nAs you talk about Noah together, help your children see how blessed we are to have a prophet of God today. Help your children searchMoses 8:16–24to find things Noah taught that the Lord’s prophets still teach today. How are we blessed when we obey these teachings?\n\nGenesis 9:15–16"
      },
      {
        "title": "God will keep His promises to me.",
        "content": "Your children might enjoy drawing or coloring a rainbow while you talk about what it represents (seeJoseph Smith Translation, Genesis 9:21–25[in the Bible appendix]). What did God want Noah and his family to think of whenever they saw a rainbow?\n\nYou could also show your children something you have that reminds you of something important in your life, such as a wedding ring, a picture, or a journal. Let your children share their own examples. This could lead to a conversation about things that help us remember our covenants, such as the sacrament, which helps us remember our baptismal covenant to follow Jesus Christ (seeDoctrine and Covenants 20:75–79).\n\nGod told Noah’s family that the rainbow would be “the token of the covenant which I make between me and you” (Genesis 9:12).\n\nGenesis 11:1–9"
      },
      {
        "title": "Following Jesus Christ is the only way to heaven.",
        "content": "It could be fun to build a tower out of blocks or other objects with your children. As you do so, explain that the people of Babel thought they could get to heaven by building a tall tower. You could then look together at a picture of the Savior and ask your children how He helps us get to heaven. Then you could talk with each other about things you can do to follow the Savior.\n\nIn addition to reading the story of the tower of Babel inGenesis 11:1–9, you and your children could readHelaman 6:28. According to this verse, why did the people of Babel build the tower? Why was building this tower the wrong way to reach heaven? Then you could search2 Nephi 31:20–21andHelaman 3:28to find the right way to reach heaven. What advice would we give to the people of Babel?\n\nFor more, see this month’s issue of theFriendmagazine.\n\nNoah’s Ark, by Adam Klint Day.adamdayart.com"
      }
    ],
    "study_helps": [],
    "raw_text": "February 9–15. “Noah Found Grace in the Eyes of the Lord”: Genesis 6–11; Moses 8\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nJanuary 26–February 1\nGenesis 5; Moses 6\nFebruary 2–8\nMoses 7\nFebruary 9–15\nGenesis 6–11; Moses 8\nThoughts to Keep in Mind\nThe Covenant\nFebruary 16–22\nGenesis 12–17; Abraham 1–2\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nFebruary 9–15. “Noah Found Grace in the Eyes of the Lord”: Genesis 6–11; Moses 8\n“February 9–15. ‘Noah Found Grace in the Eyes of the Lord’: Genesis 6–11; Moses 8,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“February 9–15. ‘Noah Found Grace in the Eyes of the Lord’,”\nCome, Follow Me: 2026\nJehovah Keeps a Promise\n, by Sam Lawlor\nFebruary 9–15: “Noah Found Grace in the Eyes of the Lord”\nGenesis 6–11\n;\nMoses 8\nLiving in the latter days, we have special reason to pay attention to the story of the Flood. When Jesus Christ taught how we should watch for His Second Coming, He said, “As it was in the days of Noah, so it shall be also at the coming of the Son of Man” (\nJoseph Smith—Matthew 1:41\n). In addition, words that describe Noah’s day, like “corrupt” and “filled with violence,” could just as easily describe our time (\nGenesis 6:12–13\n;\nMoses 8:28\n). The story of the Tower of Babel also feels applicable to our day, with its description of pride followed by confusion and then division.\nThese ancient accounts are valuable not just because they show us that wickedness repeats itself throughout history. More important, they teach us what to do about it. Noah “found grace in the eyes of the Lord” (\nMoses 8:27\n). And the families of Jared and his brother turned to the Lord and were protected from the confusion and division in Babel (see\nEther 1:33–43\n). If we wonder how to keep ourselves and our families safe during corruption and violence, the stories in these chapters have much to teach us.\nIdeas for Learning at Home and at Church\nGenesis 6\n;\nMoses 8\nThere is spiritual safety in following the Lord’s prophet.\nDo you see anything in the description of Noah’s day that seems similar to conditions in our day? In particular, look in\nMoses 8:15–24, 28\n. What themes do you see repeated?\nOne important similarity you’ll see is that God called Noah to be a prophet, and He has called a prophet today too. Consider making a list of truths you learn about prophets from\nMoses 8:13–30\n. How is our living prophet like Noah? Of course, the Lord’s prophet today isn’t warning of a Flood or inviting us to help build an ark. But what is he warning us about? And what is he inviting us to do? To help answer these questions, you could review a chapter from\nTeachings of Presidents of the Church\nin Gospel Library, especially the “Invitations and Promised Blessings” section. Perhaps you could pick one warning and one invitation that seem especially important to you.\nElder Allen D. Haynie taught, “A perfect and loving Father in Heaven has chosen the pattern of revealing truth to His children through a prophet” (“\nA Living Prophet for the Latter Days\n,”\nLiahona\n, May 2023, 25). Consider studying Elder Haynie’s message, looking for reasons having a prophet is a sign of Heavenly Father’s love. How has following the Lord’s prophet helped you feel safe living in the latter days?\nSee also Topics and Questions, “\nProphets\n,” Gospel Library; “Why Do We Have Prophets?” (video), Gospel Library.\n1:37\nWhy Do We Have Prophets?\nGenesis 6:5–13\nThe Flood was an act of God’s mercy.\nSome people wonder about the justice of God in sending the Flood to “destroy man” (\nGenesis 6:7\n). Elder Neal A. Maxwell explained that at the time of the Flood, “corruption had reached an agency-destroying point that spirits could not, in justice, be sent here” (\nWe Will Prove Them Herewith\n[1982], 58). You might also consider how the Flood was an act of mercy. What do you find in\nGenesis 6:5–13\nthat shows the Lord’s tender mercy and love for the people?\nGenesis 9:8–17\nTokens or symbols help me remember my covenants with the Lord.\nAccording to\nGenesis 9:8–17\n, what can a rainbow bring to your mind? What does\nJoseph Smith Translation, Genesis 9:21–25\n(in the Bible appendix) add to your understanding? You might also consider making a list of other things (like symbols, objects, or anything else) that God has given you to remind you of your covenants. What do these things teach you? How do they help you remember?\nSee also Gerrit W. Gong, “\nAlways Remember Him\n,”\nEnsign\nor\nLiahona\n, May 2016, 108–11; “\nReverently and Meekly Now\n,”\nHymns\n, no. 185.\nThe Tower of Babel\n, by David Green\nGenesis 11:1–9\nFollowing Jesus Christ is the only way to Heavenly Father.\nThe account of the people of Babel building a tower provides an interesting contrast to the account of Enoch and his people building Zion, which you studied last week. Both groups of people were trying to reach heaven but in different ways. How did the people of Zion obtain heaven? (see\nMoses 7:18–19, 53, 62–63, 69\n). What do you learn from\nGenesis 11:1–9\nand\nHelaman 6:26–28\nabout the people of Babel? What does this teach us about our own efforts to return to God’s presence? What has God provided to help us “reach unto heaven”? (\nGenesis 11:4\n; see also\nJohn 3:16\n).\nLearn actively.\nLearning can involve more than just reading or listening. For example, when learning about the Tower of Babel, you and your family or class could write, on slips of paper, things that take us away from God. Then, on other slips of paper, you could write things that bring us nearer to God. Arrange the first group of papers in the shape of a tower and the second group in the shape of a temple.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhy did Noah curse Canaan?\nWhat was wrong about building the Tower of Babel?\nWhat is significant about the genealogy of Shem?\nClick to see more.\nIdeas for Teaching Children\nGenesis 6:14–22\n;\n7–8\n;\nMoses 8:16–24\nFollowing the Lord’s prophet will bless me and my family.\nMost children love the story of Noah and the ark. Consider giving your children opportunities to share what they know about it. To help them, you could use the pictures in this outline, “\nNoah and His Family\n” in\nOld Testament Stories\n(22–25), and the third verse of “\nFollow the Prophet\n” (\nChildren’s Songbook\n, 110–11). Your children might enjoy acting out parts of the story—for example, by pretending to use a tool to build the ark or walking like animals entering the ark.\nAs you talk about Noah together, help your children see how blessed we are to have a prophet of God today. Help your children search\nMoses 8:16–24\nto find things Noah taught that the Lord’s prophets still teach today. How are we blessed when we obey these teachings?\nGenesis 9:15–16\nGod will keep His promises to me.\nYour children might enjoy drawing or coloring a rainbow while you talk about what it represents (see\nJoseph Smith Translation, Genesis 9:21–25\n[in the Bible appendix]). What did God want Noah and his family to think of whenever they saw a rainbow?\nYou could also show your children something you have that reminds you of something important in your life, such as a wedding ring, a picture, or a journal. Let your children share their own examples. This could lead to a conversation about things that help us remember our covenants, such as the sacrament, which helps us remember our baptismal covenant to follow Jesus Christ (see\nDoctrine and Covenants 20:75–79\n).\nGod told Noah’s family that the rainbow would be “the token of the covenant which I make between me and you” (\nGenesis 9:12\n).\nGenesis 11:1–9\nFollowing Jesus Christ is the only way to heaven.\nIt could be fun to build a tower out of blocks or other objects with your children. As you do so, explain that the people of Babel thought they could get to heaven by building a tall tower. You could then look together at a picture of the Savior and ask your children how He helps us get to heaven. Then you could talk with each other about things you can do to follow the Savior.\nIn addition to reading the story of the tower of Babel in\nGenesis 11:1–9\n, you and your children could read\nHelaman 6:28\n. According to this verse, why did the people of Babel build the tower? Why was building this tower the wrong way to reach heaven? Then you could search\n2 Nephi 31:20–21\nand\nHelaman 3:28\nto find the right way to reach heaven. What advice would we give to the people of Babel?\nFor more, see this month’s issue of the\nFriend\nmagazine.\nNoah’s Ark\n, by Adam Klint Day.\nadamdayart.com\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Genesis 6",
      "title": "Genesis 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/6?lang=eng",
      "summary": "The sons of God marry the daughters of menâMen turn to wickedness, the earth is filled with violence, and all flesh is corruptedâThe Flood is promisedâGod establishes His covenant with Noah, who builds an ark to save his family and various living things.",
      "verses": [
        "1And it came to pass, when men began to multiply on the face of the earth, and daughters were born unto them,",
        "2That thesonsof God saw the daughters of men that theywerefair; and theytookthemwivesof all which they chose.",
        "3And theLordsaid, Myspiritshall not alwaysstrivewith man, for that he alsoisflesh: yet his days shall be an hundred and twenty years.",
        "4There weregiantsin the earth in those days; and also after that, when the sons of God came in unto the daughters of men, and they barechildrento them, the samebecamemighty men whichwereof old, men of renown.",
        "5Â¶AndGodsaw that thewickednessof manwasgreat in the earth, andthateveryimagination of thethoughtsof hisheartwasonlyevilcontinually.",
        "6Andit repented theLordthat he had made man on the earth, and itgrievedhim at his heart.",
        "7And theLordsaid, I willdestroyman whom I have created from the face of the earth; both man, and beast, and the creeping thing, and the fowls of the air;forit repenteth me that I have made them.",
        "8But Noah foundgracein the eyes of theLord.",
        "9Â¶Thesearethegenerationsof Noah:Noahwas a just manandperfectin his generations,andNoahwalkedwith God.",
        "10And Noah begat three sons, Shem, Ham, and Japheth.",
        "11The earth also wascorruptbefore God, and the earth was filled withviolence.",
        "12And God looked upon the earth, and, behold, it was corrupt; for allfleshhad corrupted hiswayupon the earth.",
        "13And God said unto Noah, The end of all flesh is come before me; for the earth is filled withviolencethrough them; and, behold, I willdestroythemwith the earth.",
        "14Â¶Make thee anarkof gopher wood;roomsshalt thou make in the ark, and shalt pitch it within and without with pitch.",
        "15And thisis the fashionwhich thou shalt make itof:The length of the arkshall bethree hundred cubits, the breadth of it fifty cubits, and the height of it thirty cubits.",
        "16Awindowshalt thou make to the ark, and in a cubit shalt thou finish it above; and the door of the ark shalt thou set in the side thereof;withlower, second, and thirdstoriesshalt thou make it.",
        "17And, behold, I, even I, do bring afloodofwatersupon the earth, to destroy all flesh, whereinisthebreath of life, from under heaven;andevery thing thatisin the earth shall die.",
        "18But with thee will I establishmycovenant; and thou shalt come into the ark, thou, and thy sons, and thy wife, and thy sonsâ wives with thee.",
        "19And of every living thing of all flesh, two of everysortshalt thou bring into the ark, to keepthemalive with thee; they shall be male and female.",
        "20Of fowls after their kind, and of cattle after their kind, of every creeping thing of the earth after his kind, two of everysortshall come unto thee, to keepthemalive.",
        "21And take thou unto thee of all food that is eaten, and thou shalt gatheritto thee; and it shall be forfoodfor thee, and for them.",
        "22ThusdidNoah; according to all that Godcommandedhim, so did he."
      ],
      "full_text": "1And it came to pass, when men began to multiply on the face of the earth, and daughters were born unto them, 2That thesonsof God saw the daughters of men that theywerefair; and theytookthemwivesof all which they chose. 3And theLordsaid, Myspiritshall not alwaysstrivewith man, for that he alsoisflesh: yet his days shall be an hundred and twenty years. 4There weregiantsin the earth in those days; and also after that, when the sons of God came in unto the daughters of men, and they barechildrento them, the samebecamemighty men whichwereof old, men of renown. 5Â¶AndGodsaw that thewickednessof manwasgreat in the earth, andthateveryimagination of thethoughtsof hisheartwasonlyevilcontinually. 6Andit repented theLordthat he had made man on the earth, and itgrievedhim at his heart. 7And theLordsaid, I willdestroyman whom I have created from the face of the earth; both man, and beast, and the creeping thing, and the fowls of the air;forit repenteth me that I have made them. 8But Noah foundgracein the eyes of theLord. 9Â¶Thesearethegenerationsof Noah:Noahwas a just manandperfectin his generations,andNoahwalkedwith God. 10And Noah begat three sons, Shem, Ham, and Japheth. 11The earth also wascorruptbefore God, and the earth was filled withviolence. 12And God looked upon the earth, and, behold, it was corrupt; for allfleshhad corrupted hiswayupon the earth. 13And God said unto Noah, The end of all flesh is come before me; for the earth is filled withviolencethrough them; and, behold, I willdestroythemwith the earth. 14Â¶Make thee anarkof gopher wood;roomsshalt thou make in the ark, and shalt pitch it within and without with pitch. 15And thisis the fashionwhich thou shalt make itof:The length of the arkshall bethree hundred cubits, the breadth of it fifty cubits, and the height of it thirty cubits. 16Awindowshalt thou make to the ark, and in a cubit shalt thou finish it above; and the door of the ark shalt thou set in the side thereof;withlower, second, and thirdstoriesshalt thou make it. 17And, behold, I, even I, do bring afloodofwatersupon the earth, to destroy all flesh, whereinisthebreath of life, from under heaven;andevery thing thatisin the earth shall die. 18But with thee will I establishmycovenant; and thou shalt come into the ark, thou, and thy sons, and thy wife, and thy sonsâ wives with thee. 19And of every living thing of all flesh, two of everysortshalt thou bring into the ark, to keepthemalive with thee; they shall be male and female. 20Of fowls after their kind, and of cattle after their kind, of every creeping thing of the earth after his kind, two of everysortshall come unto thee, to keepthemalive. 21And take thou unto thee of all food that is eaten, and thou shalt gatheritto thee; and it shall be forfoodfor thee, and for them. 22ThusdidNoah; according to all that Godcommandedhim, so did he."
    },
    {
      "reference": "Genesis 7",
      "title": "Genesis 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/7?lang=eng",
      "summary": "Noahâs family and various beasts and fowl enter the arkâThe Flood comes, and water covers the whole earthâAll other life that breathes is destroyed.",
      "verses": [
        "1And theLordsaid untoNoah, Come thou and all thy house into the ark; for thee have I seen righteous before me in this generation.",
        "2Of every clean beast thou shalt take to thee by sevens, the male and his female: and of beasts thatarenot clean by two, the male and his female.",
        "3Of fowls also of the air by sevens, the male and the female; to keep seed alive upon the face of all the earth.",
        "4For yet seven days, and I will cause it torainupon the earth forty days and forty nights; and every living substance that I have made will I destroy from off the face of the earth.",
        "5And Noahdidaccording unto all that theLordcommanded him.",
        "6And Noahwassix hundredyears old when the flood of waters was upon the earth.",
        "7Â¶And Noah went in, and his sons, and his wife, and his sonsâ wives with him, into the ark, because of the waters of the flood.",
        "8Of clean beasts, and of beasts thatarenot clean, and of fowls, and of every thing that creepeth upon the earth,",
        "9There went in two and two unto Noah into the ark, the male and the female, as God had commanded Noah.",
        "10And it came to pass after seven days, that the waters of thefloodwere upon the earth.",
        "11Â¶In the six hundredth year of Noahâs life, in the second month, the seventeenth day of the month, the same day were all thefountainsof the great deepbroken up, and thewindows of heavenwere opened.",
        "12And therainwas upon the earth forty days and forty nights.",
        "13In the selfsame day entered Noah, and Shem, and Ham, and Japheth, the sons of Noah, and Noahâs wife, and the three wives of his sons with them, into the ark;",
        "14They, and every beast after his kind, and all the cattle after their kind, and every creeping thing that creepeth upon the earth after his kind, and every fowl after his kind, every bird of every sort.",
        "15And they went in unto Noah into the ark, two and two of all flesh, whereinisthe breath of life.",
        "16And they that went in, went in male and female of all flesh, as God had commanded him: and theLordshut him in.",
        "17And the flood was forty days upon the earth; and the waters increased, and bare up the ark, anditwas lift up above the earth.",
        "18And the waters prevailed, and were increased greatly upon the earth; and the ark went upon the face of the waters.",
        "19And thewatersprevailed exceedingly upon the earth; andallthe high hills, thatwereunder the whole heaven, were covered.",
        "20Fifteen cubits upward did the waters prevail; and the mountains were covered.",
        "21And all flesh died that moved upon the earth, both of fowl, and of cattle, and of beast, and of every creeping thing that creepeth upon the earth, andevery man:",
        "22All in whose nostrilswasthebreath of life, of all thatwasin the dryland,died.",
        "23And every living substance wasdestroyedwhich was upon the face of the ground, both man, and cattle, and the creeping things, and the fowl of the heaven; and they were destroyed from the earth: andNoahonly remainedalive,and they thatwerewith him in the ark.",
        "24And the waters prevailed upon the earth an hundred and fifty days."
      ],
      "full_text": "1And theLordsaid untoNoah, Come thou and all thy house into the ark; for thee have I seen righteous before me in this generation. 2Of every clean beast thou shalt take to thee by sevens, the male and his female: and of beasts thatarenot clean by two, the male and his female. 3Of fowls also of the air by sevens, the male and the female; to keep seed alive upon the face of all the earth. 4For yet seven days, and I will cause it torainupon the earth forty days and forty nights; and every living substance that I have made will I destroy from off the face of the earth. 5And Noahdidaccording unto all that theLordcommanded him. 6And Noahwassix hundredyears old when the flood of waters was upon the earth. 7Â¶And Noah went in, and his sons, and his wife, and his sonsâ wives with him, into the ark, because of the waters of the flood. 8Of clean beasts, and of beasts thatarenot clean, and of fowls, and of every thing that creepeth upon the earth, 9There went in two and two unto Noah into the ark, the male and the female, as God had commanded Noah. 10And it came to pass after seven days, that the waters of thefloodwere upon the earth. 11Â¶In the six hundredth year of Noahâs life, in the second month, the seventeenth day of the month, the same day were all thefountainsof the great deepbroken up, and thewindows of heavenwere opened. 12And therainwas upon the earth forty days and forty nights. 13In the selfsame day entered Noah, and Shem, and Ham, and Japheth, the sons of Noah, and Noahâs wife, and the three wives of his sons with them, into the ark; 14They, and every beast after his kind, and all the cattle after their kind, and every creeping thing that creepeth upon the earth after his kind, and every fowl after his kind, every bird of every sort. 15And they went in unto Noah into the ark, two and two of all flesh, whereinisthe breath of life. 16And they that went in, went in male and female of all flesh, as God had commanded him: and theLordshut him in. 17And the flood was forty days upon the earth; and the waters increased, and bare up the ark, anditwas lift up above the earth. 18And the waters prevailed, and were increased greatly upon the earth; and the ark went upon the face of the waters. 19And thewatersprevailed exceedingly upon the earth; andallthe high hills, thatwereunder the whole heaven, were covered. 20Fifteen cubits upward did the waters prevail; and the mountains were covered. 21And all flesh died that moved upon the earth, both of fowl, and of cattle, and of beast, and of every creeping thing that creepeth upon the earth, andevery man: 22All in whose nostrilswasthebreath of life, of all thatwasin the dryland,died. 23And every living substance wasdestroyedwhich was upon the face of the ground, both man, and cattle, and the creeping things, and the fowl of the heaven; and they were destroyed from the earth: andNoahonly remainedalive,and they thatwerewith him in the ark. 24And the waters prevailed upon the earth an hundred and fifty days."
    },
    {
      "reference": "Genesis 8",
      "title": "Genesis 8",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/8?lang=eng",
      "summary": "The Flood ceasesâNoah sends forth a dove, which returns with an olive leafâHe releases all living things from the arkâHe offers sacrificesâSeedtime, harvest, and seasons are ensured.",
      "verses": [
        "1And God rememberedNoah, and every living thing, and all the cattle thatwaswith him in the ark: and God made a wind to pass over the earth, and the watersassuaged;",
        "2Thefountainsalso of the deep and the windows of heaven were stopped, and the rain from heaven was restrained;",
        "3And the watersreturnedfrom off the earth continually: and after the end of the hundred and fifty days thewaterswere abated.",
        "4And the ark rested in the seventh month, on the seventeenth day of the month, upon the mountains of Ararat.",
        "5And the waters decreased continually until the tenth month: in the tenthmonth,on the firstdayof the month, were the tops of the mountains seen.",
        "6Â¶And it came to pass at the end of forty days, that Noah opened the window of the ark which he had made:",
        "7And he sent forth a raven, which went forth to and fro, until the waters were dried up from off the earth.",
        "8Also he sent forth a dove from him, to see if the waters were abated from off the face of the ground;",
        "9But the dove found no rest for the sole of her foot, and she returned unto him into the ark, for the waterswereon the face of the whole earth: then he put forth his hand, and took her, and pulled her in unto him into the ark.",
        "10And hestayed yet otherseven days; and again he sent forth the dove out of the ark;",
        "11And the dove came in to him in the evening; and, lo, in her mouthwasan olive leaf plucked off: so Noah knew that the waters were abated from off the earth.",
        "12And he stayed yet other seven days; and sent forth the dove; which returned not again unto him any more.",
        "13Â¶And it came to pass in thesix hundredth and firstyear, in the firstmonth,the firstdayof the month, the waters were dried up from off the earth: and Noah removed the covering of the ark, and looked, and, behold, the face of the ground was dry.",
        "14And in the second month, on the seven and twentieth day of the month, was the earth dried.",
        "15Â¶And God spake unto Noah, saying,",
        "16Go forth of the ark, thou, and thywife, and thy sons, and thy sonsâ wives with thee.",
        "17Bring forth with thee every living thing thatiswith thee, of all flesh,bothof fowl, and of cattle, and of every creeping thing that creepeth upon the earth; that they may breed abundantly in the earth, and befruitful, andmultiplyupon the earth.",
        "18And Noah went forth, and his sons, and his wife, and his sonsâ wives with him:",
        "19Every beast, every creeping thing, and every fowl,andwhatsoever creepeth upon the earth, after theirkinds, went forth out of the ark.",
        "20Â¶AndNoah builded an altar unto theLord; and took of everyclean beast, and of every clean fowl, and offered burntofferingson the altar.",
        "21And theLordsmelled a sweetsavour; and theLordsaid in his heart, I will not againcursethe ground any morefor manâs sake; for theimaginationof manâs heartisevilfrom his youth; neither will I againsmiteany more every thing living, as I have done.",
        "22While the earth remaineth,seedtimeand harvest, and cold and heat, and summer and winter, and day andnightshall not cease."
      ],
      "full_text": "1And God rememberedNoah, and every living thing, and all the cattle thatwaswith him in the ark: and God made a wind to pass over the earth, and the watersassuaged; 2Thefountainsalso of the deep and the windows of heaven were stopped, and the rain from heaven was restrained; 3And the watersreturnedfrom off the earth continually: and after the end of the hundred and fifty days thewaterswere abated. 4And the ark rested in the seventh month, on the seventeenth day of the month, upon the mountains of Ararat. 5And the waters decreased continually until the tenth month: in the tenthmonth,on the firstdayof the month, were the tops of the mountains seen. 6Â¶And it came to pass at the end of forty days, that Noah opened the window of the ark which he had made: 7And he sent forth a raven, which went forth to and fro, until the waters were dried up from off the earth. 8Also he sent forth a dove from him, to see if the waters were abated from off the face of the ground; 9But the dove found no rest for the sole of her foot, and she returned unto him into the ark, for the waterswereon the face of the whole earth: then he put forth his hand, and took her, and pulled her in unto him into the ark. 10And hestayed yet otherseven days; and again he sent forth the dove out of the ark; 11And the dove came in to him in the evening; and, lo, in her mouthwasan olive leaf plucked off: so Noah knew that the waters were abated from off the earth. 12And he stayed yet other seven days; and sent forth the dove; which returned not again unto him any more. 13Â¶And it came to pass in thesix hundredth and firstyear, in the firstmonth,the firstdayof the month, the waters were dried up from off the earth: and Noah removed the covering of the ark, and looked, and, behold, the face of the ground was dry. 14And in the second month, on the seven and twentieth day of the month, was the earth dried. 15Â¶And God spake unto Noah, saying, 16Go forth of the ark, thou, and thywife, and thy sons, and thy sonsâ wives with thee. 17Bring forth with thee every living thing thatiswith thee, of all flesh,bothof fowl, and of cattle, and of every creeping thing that creepeth upon the earth; that they may breed abundantly in the earth, and befruitful, andmultiplyupon the earth. 18And Noah went forth, and his sons, and his wife, and his sonsâ wives with him: 19Every beast, every creeping thing, and every fowl,andwhatsoever creepeth upon the earth, after theirkinds, went forth out of the ark. 20Â¶AndNoah builded an altar unto theLord; and took of everyclean beast, and of every clean fowl, and offered burntofferingson the altar. 21And theLordsmelled a sweetsavour; and theLordsaid in his heart, I will not againcursethe ground any morefor manâs sake; for theimaginationof manâs heartisevilfrom his youth; neither will I againsmiteany more every thing living, as I have done. 22While the earth remaineth,seedtimeand harvest, and cold and heat, and summer and winter, and day andnightshall not cease."
    },
    {
      "reference": "Genesis 9",
      "title": "Genesis 9",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/9?lang=eng",
      "summary": "Noah and his sons are commanded to multiply and fill the earthâThey are given dominion over all forms of lifeâThe death penalty is decreed for murderâGod will not again destroy the earth by a floodâCanaan is cursed; Shem and Japheth are blessed.",
      "verses": [
        "1And God blessed Noah and his sons, and said unto them,Befruitful, andmultiply, andreplenishthe earth.",
        "2And thefearof you and the dread of you shall be upon every beast of the earth, and upon every fowl of the air, upon all that movethuponthe earth, and upon all the fishes of the sea; into your hand are they delivered.",
        "3Every moving thing that liveth shall bemeatfor you; even as the green herb have I given you all things.",
        "4Butflesh with thelifethereof,which isthebloodthereof, shall ye not eat.",
        "5And surelyyourblood of your lives will Irequire; at the hand of every beast will I require it, and at the hand of man; at the hand of every manâs brother will I require the life of man.",
        "6Whososheddethmanâs blood, by man shall hisbloodbe shed: for in theimageof God made he man.",
        "7And you, be yefruitful, and multiply; bring forth abundantly in the earth, and multiply therein.",
        "8Â¶And God spake unto Noah, and to his sons with him, saying,",
        "9And I, behold,Iestablish mycovenantwith you, and with your seed after you;",
        "10And with every living creature thatiswith you, of the fowl, of the cattle, and of every beast of the earth with you; from all that go out of the ark, to every beast of the earth.",
        "11And I will establish my covenant with you; neither shall all flesh be cut off any more by the waters of a flood; neither shall there any more be afloodtodestroytheearth.",
        "12And God said, Thisisthe token of the covenant which I make between me and you and every living creature thatiswith you, for perpetual generations:",
        "13I do set my bow in the cloud, and it shall be for a token of a covenant between me and the earth.",
        "14And it shall come to pass, when I bring a cloud over the earth, that the bow shall be seen in the cloud:",
        "15And I will remember mycovenant,whichisbetween me and you and every living creature of all flesh; and the waters shall no more become afloodto destroy all flesh.",
        "16Andthe bow shall be in the cloud; and I will look upon it, thatI may remember theeverlasting covenantbetween God and every living creature of all flesh thatisupon the earth.",
        "17And God said unto Noah, Thisisthetokenof the covenant, which I have established between me and all flesh thatisupon the earth.",
        "18Â¶And thesonsof Noah, that went forth of the ark, were Shem, and Ham, and Japheth: and Hamisthe father of Canaan.",
        "19Thesearethe three sons of Noah: and of them was the wholeearthoverspread.",
        "20And Noah beganto bean husbandman, and he planted a vineyard:",
        "21And he drank of the wine, and was drunken; and he was uncovered within his tent.",
        "22And Ham, the father of Canaan, saw the nakedness of his father, and told his two brethren without.",
        "23And Shem and Japheth took a garment, and laiditupon both their shoulders, and went backward, and covered the nakedness of their father; and their faceswerebackward, and they saw not their fatherâs nakedness.",
        "24And Noah awoke from his wine, and knew what his younger son had done unto him.",
        "25And he said,CursedbeCanaan; a servant of servants shall he be unto his brethren.",
        "26And he said, BlessedbetheLordGod of Shem; and Canaan shall be hisservant.",
        "27God shall enlarge Japheth, and he shall dwell in the tents of Shem; and Canaan shall be his servant.",
        "28Â¶And Noah lived after the flood three hundred and fifty years.",
        "29And all the days of Noah were nine hundred and fifty years: and he died."
      ],
      "full_text": "1And God blessed Noah and his sons, and said unto them,Befruitful, andmultiply, andreplenishthe earth. 2And thefearof you and the dread of you shall be upon every beast of the earth, and upon every fowl of the air, upon all that movethuponthe earth, and upon all the fishes of the sea; into your hand are they delivered. 3Every moving thing that liveth shall bemeatfor you; even as the green herb have I given you all things. 4Butflesh with thelifethereof,which isthebloodthereof, shall ye not eat. 5And surelyyourblood of your lives will Irequire; at the hand of every beast will I require it, and at the hand of man; at the hand of every manâs brother will I require the life of man. 6Whososheddethmanâs blood, by man shall hisbloodbe shed: for in theimageof God made he man. 7And you, be yefruitful, and multiply; bring forth abundantly in the earth, and multiply therein. 8Â¶And God spake unto Noah, and to his sons with him, saying, 9And I, behold,Iestablish mycovenantwith you, and with your seed after you; 10And with every living creature thatiswith you, of the fowl, of the cattle, and of every beast of the earth with you; from all that go out of the ark, to every beast of the earth. 11And I will establish my covenant with you; neither shall all flesh be cut off any more by the waters of a flood; neither shall there any more be afloodtodestroytheearth. 12And God said, Thisisthe token of the covenant which I make between me and you and every living creature thatiswith you, for perpetual generations: 13I do set my bow in the cloud, and it shall be for a token of a covenant between me and the earth. 14And it shall come to pass, when I bring a cloud over the earth, that the bow shall be seen in the cloud: 15And I will remember mycovenant,whichisbetween me and you and every living creature of all flesh; and the waters shall no more become afloodto destroy all flesh. 16Andthe bow shall be in the cloud; and I will look upon it, thatI may remember theeverlasting covenantbetween God and every living creature of all flesh thatisupon the earth. 17And God said unto Noah, Thisisthetokenof the covenant, which I have established between me and all flesh thatisupon the earth. 18Â¶And thesonsof Noah, that went forth of the ark, were Shem, and Ham, and Japheth: and Hamisthe father of Canaan. 19Thesearethe three sons of Noah: and of them was the wholeearthoverspread. 20And Noah beganto bean husbandman, and he planted a vineyard: 21And he drank of the wine, and was drunken; and he was uncovered within his tent. 22And Ham, the father of Canaan, saw the nakedness of his father, and told his two brethren without. 23And Shem and Japheth took a garment, and laiditupon both their shoulders, and went backward, and covered the nakedness of their father; and their faceswerebackward, and they saw not their fatherâs nakedness. 24And Noah awoke from his wine, and knew what his younger son had done unto him. 25And he said,CursedbeCanaan; a servant of servants shall he be unto his brethren. 26And he said, BlessedbetheLordGod of Shem; and Canaan shall be hisservant. 27God shall enlarge Japheth, and he shall dwell in the tents of Shem; and Canaan shall be his servant. 28Â¶And Noah lived after the flood three hundred and fifty years. 29And all the days of Noah were nine hundred and fifty years: and he died."
    },
    {
      "reference": "Genesis 10",
      "title": "Genesis 10",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/10?lang=eng",
      "summary": "The descendants of Noah are Japheth, whose descendants are Gentiles; Ham, whose descendants include the Canaanites; and Shem, of whom came Peleg (in whose days the earth was divided).",
      "verses": [
        "1Now thesearethegenerationsof thesonsof Noah, Shem, Ham, and Japheth: and unto them were sons born after the flood.",
        "2The sons of Japheth;Gomer, andMagog, and Madai, and Javan, and Tubal, andMeshech, and Tiras.",
        "3And the sons of Gomer; Ashkenaz, and Riphath, andTogarmah.",
        "4And the sons ofJavan;Elishah, and Tarshish, Kittim, andDodanim.",
        "5By thesewere theislesof theGentilesdivided in theirlands; every one after his tongue, after theirfamilies, in their nations.",
        "6Â¶And the sons ofHam;Cush, andMizraim, andPhut, and Canaan.",
        "7And the sons of Cush; Seba, and Havilah, and Sabtah, and Raamah, and Sabtecha: and the sons of Raamah; Sheba, and Dedan.",
        "8And Cush begatNimrod: he began to be a mighty one in the earth.",
        "9He was a mighty hunter before theLord: wherefore it is said, Even asNimrodthe mighty hunter before theLord.",
        "10And the beginning of his kingdom wasBabel, and Erech, and Accad, and Calneh, in the land ofShinar.",
        "11Out of that land went forth Asshur, and builded Nineveh, and the city Rehoboth, and Calah,",
        "12And Resen between Nineveh and Calah: the sameisa great city.",
        "13AndMizraimbegat Ludim, and Anamim, and Lehabim, and Naphtuhim,",
        "14And Pathrusim, and Casluhim, (out of whom camePhilistim,) and Caphtorim.",
        "15Â¶AndCanaanbegat Sidon his firstborn, and Heth,",
        "16And the Jebusite, and the Amorite, and the Girgasite,",
        "17And the Hivite, and the Arkite, and the Sinite,",
        "18And the Arvadite, and the Zemarite, and the Hamathite: and afterward were the families of theCanaanitesspread abroad.",
        "19And the border of the Canaanites was from Sidon, as thou comest toGerar, unto Gaza; as thou goest, unto Sodom, and Gomorrah, and Admah, and Zeboim, even unto Lasha.",
        "20Thesearethe sons of Ham, after their families, after their tongues, in their countries,andin their nations.",
        "21Â¶Unto Shem also, the father of all the children ofEber, the brother of Japheth the elder, even to him werechildrenborn.",
        "22The children ofShem; Elam, and Asshur, and Arphaxad, and Lud, and Aram.",
        "23And the children of Aram;Uz, and Hul, and Gether, and Mash.",
        "24And Arphaxad begat Salah; and Salah begat Eber.",
        "25And unto Eber were born two sons: the name of onewasPeleg; for in his days was the earthdivided; and his brotherâs namewasJoktan.",
        "26And Joktan begat Almodad, and Sheleph, and Hazarmaveth, and Jerah,",
        "27And Hadoram, and Uzal, and Diklah,",
        "28And Obal, and Abimael, and Sheba,",
        "29And Ophir, andHavilah, and Jobab: all thesewerethe sons of Joktan.",
        "30And their dwelling was from Mesha, as thou goest unto Sephar a mount of the east.",
        "31Thesearethe sons of Shem, after their families, after their tongues, in their lands, after their nations.",
        "32Thesearethe families of the sons of Noah, after their generations, in theirnations: andbythese were thenationsdivided in the earth after the flood."
      ],
      "full_text": "1Now thesearethegenerationsof thesonsof Noah, Shem, Ham, and Japheth: and unto them were sons born after the flood. 2The sons of Japheth;Gomer, andMagog, and Madai, and Javan, and Tubal, andMeshech, and Tiras. 3And the sons of Gomer; Ashkenaz, and Riphath, andTogarmah. 4And the sons ofJavan;Elishah, and Tarshish, Kittim, andDodanim. 5By thesewere theislesof theGentilesdivided in theirlands; every one after his tongue, after theirfamilies, in their nations. 6Â¶And the sons ofHam;Cush, andMizraim, andPhut, and Canaan. 7And the sons of Cush; Seba, and Havilah, and Sabtah, and Raamah, and Sabtecha: and the sons of Raamah; Sheba, and Dedan. 8And Cush begatNimrod: he began to be a mighty one in the earth. 9He was a mighty hunter before theLord: wherefore it is said, Even asNimrodthe mighty hunter before theLord. 10And the beginning of his kingdom wasBabel, and Erech, and Accad, and Calneh, in the land ofShinar. 11Out of that land went forth Asshur, and builded Nineveh, and the city Rehoboth, and Calah, 12And Resen between Nineveh and Calah: the sameisa great city. 13AndMizraimbegat Ludim, and Anamim, and Lehabim, and Naphtuhim, 14And Pathrusim, and Casluhim, (out of whom camePhilistim,) and Caphtorim. 15Â¶AndCanaanbegat Sidon his firstborn, and Heth, 16And the Jebusite, and the Amorite, and the Girgasite, 17And the Hivite, and the Arkite, and the Sinite, 18And the Arvadite, and the Zemarite, and the Hamathite: and afterward were the families of theCanaanitesspread abroad. 19And the border of the Canaanites was from Sidon, as thou comest toGerar, unto Gaza; as thou goest, unto Sodom, and Gomorrah, and Admah, and Zeboim, even unto Lasha. 20Thesearethe sons of Ham, after their families, after their tongues, in their countries,andin their nations. 21Â¶Unto Shem also, the father of all the children ofEber, the brother of Japheth the elder, even to him werechildrenborn. 22The children ofShem; Elam, and Asshur, and Arphaxad, and Lud, and Aram. 23And the children of Aram;Uz, and Hul, and Gether, and Mash. 24And Arphaxad begat Salah; and Salah begat Eber. 25And unto Eber were born two sons: the name of onewasPeleg; for in his days was the earthdivided; and his brotherâs namewasJoktan. 26And Joktan begat Almodad, and Sheleph, and Hazarmaveth, and Jerah, 27And Hadoram, and Uzal, and Diklah, 28And Obal, and Abimael, and Sheba, 29And Ophir, andHavilah, and Jobab: all thesewerethe sons of Joktan. 30And their dwelling was from Mesha, as thou goest unto Sephar a mount of the east. 31Thesearethe sons of Shem, after their families, after their tongues, in their lands, after their nations. 32Thesearethe families of the sons of Noah, after their generations, in theirnations: andbythese were thenationsdivided in the earth after the flood."
    },
    {
      "reference": "Genesis 11",
      "title": "Genesis 11",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/gen/11?lang=eng",
      "summary": "All men speak the same languageâThey build the Tower of BabelâThe Lord confounds their language and scatters them over all the earthâThe generations of Shem include Abram, whose wife is SaraiâAbram leaves Ur and settles in Haran.",
      "verses": [
        "1And the whole earth was of onelanguage, and of one speech.",
        "2And it came to pass, as they journeyed from the east, that they found a plain in the land ofShinar; and they dwelt there.",
        "3And they said one to another, Go to, let us make brick, and burn them throughly. And they had brick for stone, andslimehad they for mortar.",
        "4And they said, Go to, let us build us a city and a tower, whose topmayreachunto heaven; and let us make us aname, lest we be scattered abroad upon the face of the whole earth.",
        "5And theLordcame down to see the city and the tower, which the children of men builded.",
        "6And theLordsaid, Behold, the peopleisone, and they have all one language; and this they begin to do: and now nothing will be restrained from them, which they have imagined to do.",
        "7Go to, let us go down, and there confound theirlanguage, that they may not understand one anotherâs speech.",
        "8So theLordscattered them abroad from thence upon the face of all the earth: and they left off to build thecity.",
        "9Therefore is the name of it called Babel; because theLorddid thereconfoundthelanguageof all the earth: and from thence did theLordscatterthemabroadupon the face of all the earth.",
        "10Â¶Thesearethe generations of Shem: Shemwasan hundred years old, and begat Arphaxad two years after the flood:",
        "11And Shem lived after he begat Arphaxad five hundred years, and begat sons and daughters.",
        "12And Arphaxad lived five and thirty years, and begat Salah:",
        "13And Arphaxad lived after he begat Salah four hundred and three years, and begat sons and daughters.",
        "14And Salah lived thirty years, and begat Eber:",
        "15And Salah lived after he begat Eber four hundred and three years, and begat sons and daughters.",
        "16And Eber lived four and thirty years, and begatPeleg:",
        "17And Eber lived after he begat Peleg four hundred and thirty years, and begat sons and daughters.",
        "18And Peleg lived thirty years, and begat Reu:",
        "19And Peleg lived after he begat Reu two hundred and nine years, and begat sons and daughters.",
        "20And Reu lived two and thirty years, and begat Serug:",
        "21And Reu lived after he begat Serug two hundred and seven years, and begat sons and daughters.",
        "22And Serug lived thirty years, and begat Nahor:",
        "23And Serug lived after he begat Nahor two hundred years, and begat sons and daughters.",
        "24And Nahor lived nine and twenty years, and begatTerah:",
        "25And Nahor lived after he begat Terah an hundred and nineteen years, and begat sons and daughters.",
        "26AndTerahlived seventy years, and begatAbram, Nahor, and Haran.",
        "27Â¶Now thesearethe generations of Terah: Terah begat Abram, Nahor, and Haran; and Haran begat Lot.",
        "28And Haran died before his father Terah in the land of his nativity, in Ur of theChaldees.",
        "29And Abram and Nahor took them wives: the name of Abramâs wifewasSarai; and the name of Nahorâs wife,Milcah, the daughter of Haran, the father of Milcah, and the father of Iscah.",
        "30But Sarai wasbarren; shehadno child.",
        "31And Terah took Abram his son, and Lot the son of Haran his sonâs son, and Sarai his daughter in law, his son Abramâs wife; and they went forth with them from Ur of theChaldees, to go into the land ofCanaan; and they came untoHaran, and dwelt there.",
        "32And the days of Terah were two hundred and five years: and Terah died in Haran."
      ],
      "full_text": "1And the whole earth was of onelanguage, and of one speech. 2And it came to pass, as they journeyed from the east, that they found a plain in the land ofShinar; and they dwelt there. 3And they said one to another, Go to, let us make brick, and burn them throughly. And they had brick for stone, andslimehad they for mortar. 4And they said, Go to, let us build us a city and a tower, whose topmayreachunto heaven; and let us make us aname, lest we be scattered abroad upon the face of the whole earth. 5And theLordcame down to see the city and the tower, which the children of men builded. 6And theLordsaid, Behold, the peopleisone, and they have all one language; and this they begin to do: and now nothing will be restrained from them, which they have imagined to do. 7Go to, let us go down, and there confound theirlanguage, that they may not understand one anotherâs speech. 8So theLordscattered them abroad from thence upon the face of all the earth: and they left off to build thecity. 9Therefore is the name of it called Babel; because theLorddid thereconfoundthelanguageof all the earth: and from thence did theLordscatterthemabroadupon the face of all the earth. 10Â¶Thesearethe generations of Shem: Shemwasan hundred years old, and begat Arphaxad two years after the flood: 11And Shem lived after he begat Arphaxad five hundred years, and begat sons and daughters. 12And Arphaxad lived five and thirty years, and begat Salah: 13And Arphaxad lived after he begat Salah four hundred and three years, and begat sons and daughters. 14And Salah lived thirty years, and begat Eber: 15And Salah lived after he begat Eber four hundred and three years, and begat sons and daughters. 16And Eber lived four and thirty years, and begatPeleg: 17And Eber lived after he begat Peleg four hundred and thirty years, and begat sons and daughters. 18And Peleg lived thirty years, and begat Reu: 19And Peleg lived after he begat Reu two hundred and nine years, and begat sons and daughters. 20And Reu lived two and thirty years, and begat Serug: 21And Reu lived after he begat Serug two hundred and seven years, and begat sons and daughters. 22And Serug lived thirty years, and begat Nahor: 23And Serug lived after he begat Nahor two hundred years, and begat sons and daughters. 24And Nahor lived nine and twenty years, and begatTerah: 25And Nahor lived after he begat Terah an hundred and nineteen years, and begat sons and daughters. 26AndTerahlived seventy years, and begatAbram, Nahor, and Haran. 27Â¶Now thesearethe generations of Terah: Terah begat Abram, Nahor, and Haran; and Haran begat Lot. 28And Haran died before his father Terah in the land of his nativity, in Ur of theChaldees. 29And Abram and Nahor took them wives: the name of Abramâs wifewasSarai; and the name of Nahorâs wife,Milcah, the daughter of Haran, the father of Milcah, and the father of Iscah. 30But Sarai wasbarren; shehadno child. 31And Terah took Abram his son, and Lot the son of Haran his sonâs son, and Sarai his daughter in law, his son Abramâs wife; and they went forth with them from Ur of theChaldees, to go into the land ofCanaan; and they came untoHaran, and dwelt there. 32And the days of Terah were two hundred and five years: and Terah died in Haran."
    },
    {
      "reference": "Moses 8",
      "title": "Moses 8",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/pgp/moses/8?lang=eng",
      "summary": "Methuselah prophesiesâNoah and his sons preach the gospelâGreat wickedness prevailsâThe call to repentance is unheededâGod decrees the destruction of all flesh by the Flood.",
      "verses": [
        "1And all the days ofEnochwere four hundred and thirty years.",
        "2And it came to pass that Methuselah, the son of Enoch, wasnottaken, that the covenants of the Lord might be fulfilled, which he made to Enoch; for he truly covenanted with Enoch that Noah should be of the fruit of his loins.",
        "3And it came to pass that Methuselahprophesiedthat from his loins should spring all the kingdoms of the earth (through Noah), and he took glory unto himself.",
        "4And there came forth a greatfamineinto the land, and the Lordcursedthe earth with a sore curse, and many of the inhabitants thereof died.",
        "5And it came to pass that Methuselah lived one hundred and eighty-seven years, and begat Lamech;",
        "6And Methuselah lived, after he begat Lamech, seven hundred and eighty-two years, and begat sons and daughters;",
        "7And all the days of Methuselah were nine hundred and sixty-nine years, and he died.",
        "8And Lamech lived one hundred and eighty-two years, and begat a son,",
        "9And he called his name Noah, saying: This son shall comfort us concerning our work and toil of our hands, because of the ground which the Lord hathcursed.",
        "10And Lamech lived, after he begat Noah, five hundred and ninety-five years, and begat sons and daughters;",
        "11And all the days of Lamech were seven hundred and seventy-seven years, and he died.",
        "12And Noah was four hundred and fifty years old, andbegatJapheth; and forty-two years afterward he begatShemof her who was the mother of Japheth, and when he was five hundred years old he begatHam.",
        "13AndNoahand his sons hearkened unto the Lord, and gave heed, and they were called thesonsof God.",
        "14And when these men began to multiply on the face of the earth, and daughters were born unto them, thesonsof men saw that those daughters were fair, and they took themwives, even as they chose.",
        "15And the Lord said unto Noah: The daughters of thy sons have sold themselves; for behold mine anger is kindled against the sons of men, for they will nothearkento my voice.",
        "16And it came to pass that Noahprophesied, and taught the things of God, even as it was in the beginning.",
        "17And the Lord said unto Noah: My Spirit shall not alwaysstrivewith man, for he shall know that allfleshshall die; yet his days shall be anhundredand twenty years; and if men do not repent, I will send in thefloodsupon them.",
        "18And in those days there weregiantson the earth, and they sought Noah to take away hislife; but the Lord was with Noah, and thepowerof the Lord was upon him.",
        "19And the LordordainedNoahafter his ownorder, and commanded him that he should go forth anddeclarehis Gospel unto the children of men, even as it was given unto Enoch.",
        "20And it came to pass that Noah called upon the children of men that they shouldrepent; but they hearkened not unto his words;",
        "21And also, after that they had heard him, they came up before him, saying: Behold, we are the sons of God; have we not taken unto ourselves the daughters of men? And are we noteatingand drinking, and marrying and giving in marriage? And our wives bear unto us children, and the same are mighty men, which are like unto men of old, men of great renown. And they hearkened not unto the words of Noah.",
        "22And God saw that thewickednessof men had become great in the earth; and every man was lifted up in theimaginationof the thoughts of his heart, being only evil continually.",
        "23And it came to pass that Noah continued hispreachingunto the people, saying: Hearken, and give heed unto my words;",
        "24Believeand repent of your sins and bebaptizedin the name of Jesus Christ, the Son of God, even as our fathers, and ye shall receive the Holy Ghost, that ye may have all things mademanifest; and if ye do not this, the floods will come in upon you; nevertheless they hearkened not.",
        "25And itrepentedNoah, and his heart was pained that the Lord had made man on the earth, and it grieved him at the heart.",
        "26And the Lord said: I willdestroyman whom I have created, from the face of the earth, both man and beast, and the creeping things, and the fowls of the air; for it repenteth Noah that I have created them, and that I have made them; and he hath called upon me; for they have sought hislife.",
        "27And thus Noah foundgracein the eyes of the Lord; for Noah was a just man, andperfectin his generation; and hewalkedwith God, as did also his three sons, Shem, Ham, and Japheth.",
        "28Theearthwascorruptbefore God, and it was filled with violence.",
        "29And God looked upon the earth, and, behold, it was corrupt, for all flesh had corrupted itswayupon the earth.",
        "30And God said unto Noah: The end of all flesh is come before me, for the earth is filled with violence, and behold I willdestroyall flesh from off the earth."
      ],
      "full_text": "1And all the days ofEnochwere four hundred and thirty years. 2And it came to pass that Methuselah, the son of Enoch, wasnottaken, that the covenants of the Lord might be fulfilled, which he made to Enoch; for he truly covenanted with Enoch that Noah should be of the fruit of his loins. 3And it came to pass that Methuselahprophesiedthat from his loins should spring all the kingdoms of the earth (through Noah), and he took glory unto himself. 4And there came forth a greatfamineinto the land, and the Lordcursedthe earth with a sore curse, and many of the inhabitants thereof died. 5And it came to pass that Methuselah lived one hundred and eighty-seven years, and begat Lamech; 6And Methuselah lived, after he begat Lamech, seven hundred and eighty-two years, and begat sons and daughters; 7And all the days of Methuselah were nine hundred and sixty-nine years, and he died. 8And Lamech lived one hundred and eighty-two years, and begat a son, 9And he called his name Noah, saying: This son shall comfort us concerning our work and toil of our hands, because of the ground which the Lord hathcursed. 10And Lamech lived, after he begat Noah, five hundred and ninety-five years, and begat sons and daughters; 11And all the days of Lamech were seven hundred and seventy-seven years, and he died. 12And Noah was four hundred and fifty years old, andbegatJapheth; and forty-two years afterward he begatShemof her who was the mother of Japheth, and when he was five hundred years old he begatHam. 13AndNoahand his sons hearkened unto the Lord, and gave heed, and they were called thesonsof God. 14And when these men began to multiply on the face of the earth, and daughters were born unto them, thesonsof men saw that those daughters were fair, and they took themwives, even as they chose. 15And the Lord said unto Noah: The daughters of thy sons have sold themselves; for behold mine anger is kindled against the sons of men, for they will nothearkento my voice. 16And it came to pass that Noahprophesied, and taught the things of God, even as it was in the beginning. 17And the Lord said unto Noah: My Spirit shall not alwaysstrivewith man, for he shall know that allfleshshall die; yet his days shall be anhundredand twenty years; and if men do not repent, I will send in thefloodsupon them. 18And in those days there weregiantson the earth, and they sought Noah to take away hislife; but the Lord was with Noah, and thepowerof the Lord was upon him. 19And the LordordainedNoahafter his ownorder, and commanded him that he should go forth anddeclarehis Gospel unto the children of men, even as it was given unto Enoch. 20And it came to pass that Noah called upon the children of men that they shouldrepent; but they hearkened not unto his words; 21And also, after that they had heard him, they came up before him, saying: Behold, we are the sons of God; have we not taken unto ourselves the daughters of men? And are we noteatingand drinking, and marrying and giving in marriage? And our wives bear unto us children, and the same are mighty men, which are like unto men of old, men of great renown. And they hearkened not unto the words of Noah. 22And God saw that thewickednessof men had become great in the earth; and every man was lifted up in theimaginationof the thoughts of his heart, being only evil continually. 23And it came to pass that Noah continued hispreachingunto the people, saying: Hearken, and give heed unto my words; 24Believeand repent of your sins and bebaptizedin the name of Jesus Christ, the Son of God, even as our fathers, and ye shall receive the Holy Ghost, that ye may have all things mademanifest; and if ye do not this, the floods will come in upon you; nevertheless they hearkened not. 25And itrepentedNoah, and his heart was pained that the Lord had made man on the earth, and it grieved him at the heart. 26And the Lord said: I willdestroyman whom I have created, from the face of the earth, both man and beast, and the creeping things, and the fowls of the air; for it repenteth Noah that I have created them, and that I have made them; and he hath called upon me; for they have sought hislife. 27And thus Noah foundgracein the eyes of the Lord; for Noah was a just man, andperfectin his generation; and hewalkedwith God, as did also his three sons, Shem, Ham, and Japheth. 28Theearthwascorruptbefore God, and it was filled with violence. 29And God looked upon the earth, and, behold, it was corrupt, for all flesh had corrupted itswayupon the earth. 30And God said unto Noah: The end of all flesh is come before me, for the earth is filled with violence, and behold I willdestroyall flesh from off the earth."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:27:11",
  "metadata": {
    "week_number": 7,
    "title": "Week 7: February 9–15 - Genesis 6–11; Moses 8",
    "date_range": "February 9–15",
    "scraped_at": "2025-12-21T22:27:16.582067",
    "scraper_version": "2.0.0"
  }
}