{
  "week_number": 35,
  "date_range": "August 24–30",
  "title": "Week 35: August 24–30 - Psalms 49–51; 61–66; 69–72; 77–78; 85–86",
  "bundle_title": "Week 35: August 24–30: \"Week 35: August 24–30 - Psalms 49–51; 61–66; 69–72; 77–78; 85–86\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/35?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/35?lang=eng",
    "title": "Psalms 49–51;61–66;69–72;77–78;85–86",
    "scripture_references": "Psalms 49–51; 61–66; 69–72; 77–78; 85–86",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“August 24–30. ‘I Will Declare What He Hath Done for My Soul’: Psalms 49–51; 61–66; 69–72; 77–78; 85–86,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“August 24–30. ‘I Will Declare What He Hath Done for My Soul,’”Come, Follow Me: Old Testament 2026\n\nAugust 24–30: “I Will Declare What He Hath Done for My Soul”\n\nThe writers of the Psalms shared deeply personal feelings in their poetry. They wrote about feeling discouraged, afraid, and remorseful. At times, they even felt abandoned by God, and some psalms carry a tone of frustration or desperation. If you’ve ever felt that way, reading the Psalms can help you know that you aren’t the only one. But you’ll also find psalms that can encourage you when you’re having such feelings, because the psalmists also praised the Lord for His goodness, marveled at His power, and rejoiced in His mercy. They knew that we are burdened by evil and sin but that the Lord is “good, and ready to forgive” (Psalm 86:5). They understood that having faith in the Lord doesn’t mean that you’ll never struggle with anxiety, sin, or fear. It means that you know who to turn to when you do.",
    "learning_at_home_church": [
      {
        "title": "Redemption comes only through Jesus Christ.",
        "content": "Psalm 49has a message for “both low and high, rich and poor” (verse 2). What would you say this message is? What do you feelPsalm 62:5–12adds to that message?\n\nReading these psalms might inspire you to ponder the ways we are tempted to trust something other than God for redemption (seePsalm 49:6–7). How is your life influenced by your testimony that “God will redeem [your] soul from the power of the grave”? (Psalm 49:15).\n\nPsalms 51;85–86"
      },
      {
        "title": "Because of the Savior’s mercy, I can be forgiven.",
        "content": "King David wrotePsalm 51after he recognized his desperate need for forgiveness—something we all need. Which verses describe feelings you’ve had? What do you find in this psalm that gives you hope for forgiveness?\n\nYou might also searchPsalm 51for clues about what it means to repent. Make a list of what you find. See if you can add to your list by searching President Russell M. Nelson’s message “We Can Do Better and Be Better” (EnsignorLiahona, May 2019, 67–69).\n\nHow would you describe what it feels like to receive forgiveness through Christ? If you need help describing your feelings, you could look inPsalms 51:1–2, 7–12;85:2–9. Some people like to draw or find pictures to express their feelings; you might try that. You could also sing or listen to a hymn about the Savior, such as “I Stand All Amazed” (Hymns, no. 193).\n\nTo repent, we need faith not only that Jesus Christcancleanse us but also that Hewill. What do you find inPsalm 86:5, 13, 15that helps you know the Savior is both able and willing to forgive?\n\nSee alsoAlma 36; Peter F. Meurs, “He Could HealMe!,”Liahona, May 2023, 39–41.\n\nPsalms 51:13–15;66:5–20;71:15–24"
      },
      {
        "title": "My testimony of Jesus Christ can help others come unto Him.",
        "content": "Ponder how you gained your testimony of Jesus Christ and His atoning power. Then, as you studyPsalms 51:13–15;66:5–20;71:15–24, think about how you can invite others to “come and see the works of God” (Psalm 66:5). If you were to “declare what [the Lord] hath done for [your] soul” (Psalm 66:16), what would you declare?\n\nWhat does it mean to you to “talk of [His] righteousness all the day long”? (Psalm 71:24).\n\nSee alsoAlma 26.\n\n“Come and hear, … and I will declare what [God] hath done for my soul” (Psalm 66:16).\n\nPsalms 63;69;77–78"
      },
      {
        "title": "The Lord will help me in my time of need.",
        "content": "Several psalms describe what it’s like to feel distant from God and desperately need His help (seePsalms 63:1, 8;69:1–8, 18–21;77:1–9). InPsalms 63;69;77–78, what do you find that gave the psalmists reassurance?\n\nWhen you are distressed, how does it help you to “remember the works of the Lord” and His “wonders of old”? (Psalm 77:11). Some of those wonders are described inPsalm 78. As you read about them, ponder what helps you “set [your] hope in God” (verse 7).\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "When I make a wrong choice, Jesus can help me change.",
        "content": "To help your children discover truths about repentance inPsalm 51, you could draw a large heart. Then you could help your children write inside the heart bad things Satan tempts us to do. How do we get these things out of our hearts? Ask your children to find the word “heart” inPsalm 51:10, 17. Talk about what these verses teach about repentance. Let your children erase the words inside the heart and write new words that describe the ways Jesus can change us when we repent.\n\nYou might want to help your children learn what it means to have “a broken and a contrite heart” (Psalm 51:17). They could take turns breaking open something that has a hard shell, such as an egg or a nut. You could help them compare the shell to things that keep us from feeling Heavenly Father’s love. How can we open our heart to Him?\n\nYou could also look at a picture of the Savior together and ask your children what words they would use to describe Him. Invite them to find words that describe Him inPsalm 86:5, 13, 15. Why is it important to know these things about Him?\n\nPsalm 61:2–3"
      },
      {
        "title": "Jesus Christ is my rock.",
        "content": "Your children might enjoy drawing pictures of the symbols inPsalm 61:2–3. How is Jesus Christ like a high “rock” (verse 2), “a shelter,” and “a strong tower”? (verse 3).\n\n“Thou hast been a shelter for me, and a strong tower” (Psalm 61:3).\n\nPsalms 66:16;77:11;78:6–7"
      },
      {
        "title": "“I will remember the works of the Lord.”",
        "content": "Ask your children to share some of their favorite scripture stories (pictures from theGospel Art Bookmight help). What do these stories teach us about the Lord? You could read togetherPsalm 66:16and take turns answering the question “What has the Lord done for my soul”?\n\nAs you readPsalms 77:11;78:6–7together, you could share with each other how you try to “remember the works of the Lord” (Psalm 77:11), including His works in your life. How does the sacrament help us “always remember”? (Moroni 4:3;5:2).\n\nPsalm 71:8"
      },
      {
        "title": "I can tell others about Jesus Christ.",
        "content": "After readingPsalm 71:8with your children, invite them to draw a large mouth. Ask them to help you “fill” the mouth with pictures or words representing things we can tell others about Jesus Christ.\n\nYou could pass around a picture of Jesus Christ. The person holding the picture could say one thing they know about Him. How can we help other people know these things?\n\nChildren have much to share.“When children learn something new, they naturally want to share it with others. Encourage this desire by giving children opportunities to teach gospel principles to each other, their family members, and their friends. Also ask them to share with you their thoughts, feelings, and experiences related to the principles you are teaching. You will find that they have insights that are simple, pure, and powerful” (Teaching in the Savior’s Way,32).\n\nPsalm 86:7"
      },
      {
        "title": "Heavenly Father hears and answers my prayers.",
        "content": "Many of the psalms are like prayers to God. As you read Psalms with your children, you might show them things we can use to communicate with people who are far away, such as a phone or a letter. Then readPsalm 86:7. How do we “call upon” Heavenly Father? How does He answer us?\n\nYou could sing together a song about prayer, such as “A Child’s Prayer” (Children’s Songbook, 12–13; see also Susan H. Porter, “Pray, He Is There,”Liahona, May 2024, 77–79). Tell each other about times when God answered your prayers.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nCome unto Christ, by Casey Childs"
      }
    ],
    "study_helps": [],
    "raw_text": "August 24–30. “I Will Declare What He Hath Done for My Soul”: Psalms 49–51; 61–66; 69–72; 77–78; 85–86\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nJuly 27–August 2\nEzra 1; 3–7; Nehemiah 2; 4–6; 8\nAugust 3–9\nEsther\nThoughts to Keep in Mind\nReading Poetry in the Old Testament\nAugust 10–16\nJob 1–3; 12–14; 19; 21–24; 38–40; 42\nAugust 17–23\nPsalms 1–2; 8; 19–33; 40; 46\nAugust 24–30\nPsalms 49–51; 61–66; 69–72; 77–78; 85–86\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nAugust 24–30. “I Will Declare What He Hath Done for My Soul”: Psalms 49–51; 61–66; 69–72; 77–78; 85–86\n“August 24–30. ‘I Will Declare What He Hath Done for My Soul’: Psalms 49–51; 61–66; 69–72; 77–78; 85–86,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“August 24–30. ‘I Will Declare What He Hath Done for My Soul,’”\nCome, Follow Me: Old Testament 2026\nSaving That Which Was Lost\n, by Michael Malm\nAugust 24–30: “I Will Declare What He Hath Done for My Soul”\nPsalms 49–51\n;\n61–66\n;\n69–72\n;\n77–78\n;\n85–86\nThe writers of the Psalms shared deeply personal feelings in their poetry. They wrote about feeling discouraged, afraid, and remorseful. At times, they even felt abandoned by God, and some psalms carry a tone of frustration or desperation. If you’ve ever felt that way, reading the Psalms can help you know that you aren’t the only one. But you’ll also find psalms that can encourage you when you’re having such feelings, because the psalmists also praised the Lord for His goodness, marveled at His power, and rejoiced in His mercy. They knew that we are burdened by evil and sin but that the Lord is “good, and ready to forgive” (\nPsalm 86:5\n). They understood that having faith in the Lord doesn’t mean that you’ll never struggle with anxiety, sin, or fear. It means that you know who to turn to when you do.\nIdeas for Learning at Home and at Church\nPsalms 49\n;\n62:5–12\nRedemption comes only through Jesus Christ.\nPsalm 49\nhas a message for “both low and high, rich and poor” (\nverse 2\n). What would you say this message is? What do you feel\nPsalm 62:5–12\nadds to that message?\nReading these psalms might inspire you to ponder the ways we are tempted to trust something other than God for redemption (see\nPsalm 49:6–7\n). How is your life influenced by your testimony that “God will redeem [your] soul from the power of the grave”? (\nPsalm 49:15\n).\nPsalms 51\n;\n85–86\nBecause of the Savior’s mercy, I can be forgiven.\nKing David wrote\nPsalm 51\nafter he recognized his desperate need for forgiveness—something we all need. Which verses describe feelings you’ve had? What do you find in this psalm that gives you hope for forgiveness?\nYou might also search\nPsalm 51\nfor clues about what it means to repent. Make a list of what you find. See if you can add to your list by searching President Russell M. Nelson’s message “\nWe Can Do Better and Be Better\n” (\nEnsign\nor\nLiahona\n, May 2019, 67–69).\nHow would you describe what it feels like to receive forgiveness through Christ? If you need help describing your feelings, you could look in\nPsalms 51:1–2, 7–12\n;\n85:2–9\n. Some people like to draw or find pictures to express their feelings; you might try that. You could also sing or listen to a hymn about the Savior, such as “\nI Stand All Amazed\n” (\nHymns\n, no. 193).\nTo repent, we need faith not only that Jesus Christ\ncan\ncleanse us but also that He\nwill\n. What do you find in\nPsalm 86:5, 13, 15\nthat helps you know the Savior is both able and willing to forgive?\nSee also\nAlma 36\n; Peter F. Meurs, “\nHe Could Heal\nMe\n!,”\nLiahona\n, May 2023, 39–41.\nPsalms 51:13–15\n;\n66:5–20\n;\n71:15–24\nMy testimony of Jesus Christ can help others come unto Him.\nPonder how you gained your testimony of Jesus Christ and His atoning power. Then, as you study\nPsalms 51:13–15\n;\n66:5–20\n;\n71:15–24\n, think about how you can invite others to “come and see the works of God” (\nPsalm 66:5\n). If you were to “declare what [the Lord] hath done for [your] soul” (\nPsalm 66:16\n), what would you declare?\nWhat does it mean to you to “talk of [His] righteousness all the day long”? (\nPsalm 71:24\n).\nSee also\nAlma 26\n.\n“Come and hear, … and I will declare what [God] hath done for my soul” (\nPsalm 66:16\n).\nPsalms 63\n;\n69\n;\n77–78\nThe Lord will help me in my time of need.\nSeveral psalms describe what it’s like to feel distant from God and desperately need His help (see\nPsalms 63:1, 8\n;\n69:1–8, 18–21\n;\n77:1–9\n). In\nPsalms 63\n;\n69\n;\n77–78\n, what do you find that gave the psalmists reassurance?\nWhen you are distressed, how does it help you to “remember the works of the Lord” and His “wonders of old”? (\nPsalm 77:11\n). Some of those wonders are described in\nPsalm 78\n. As you read about them, ponder what helps you “set [your] hope in God” (\nverse 7\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nBecause this Sunday is the fifth Sunday of the month, Primary teachers are encouraged to use learning activities in “Appendix B: Preparing Children for a Lifetime on God’s Covenant Path.”\nPsalms 51\n;\n86:5, 13, 15\nWhen I make a wrong choice, Jesus can help me change.\nTo help your children discover truths about repentance in\nPsalm 51\n, you could draw a large heart. Then you could help your children write inside the heart bad things Satan tempts us to do. How do we get these things out of our hearts? Ask your children to find the word “heart” in\nPsalm 51:10, 17\n. Talk about what these verses teach about repentance. Let your children erase the words inside the heart and write new words that describe the ways Jesus can change us when we repent.\nYou might want to help your children learn what it means to have “a broken and a contrite heart” (\nPsalm 51:17\n). They could take turns breaking open something that has a hard shell, such as an egg or a nut. You could help them compare the shell to things that keep us from feeling Heavenly Father’s love. How can we open our heart to Him?\nYou could also look at a picture of the Savior together and ask your children what words they would use to describe Him. Invite them to find words that describe Him in\nPsalm 86:5, 13, 15\n. Why is it important to know these things about Him?\nPsalm 61:2–3\nJesus Christ is my rock.\nYour children might enjoy drawing pictures of the symbols in\nPsalm 61:2–3\n. How is Jesus Christ like a high “rock” (\nverse 2\n), “a shelter,” and “a strong tower”? (\nverse 3\n).\n“Thou hast been a shelter for me, and a strong tower” (\nPsalm 61:3\n).\nPsalms 66:16\n;\n77:11\n;\n78:6–7\n“I will remember the works of the Lord.”\nAsk your children to share some of their favorite scripture stories (pictures from the\nGospel Art Book\nmight help). What do these stories teach us about the Lord? You could read together\nPsalm 66:16\nand take turns answering the question “What has the Lord done for my soul”?\nAs you read\nPsalms 77:11\n;\n78:6–7\ntogether, you could share with each other how you try to “remember the works of the Lord” (\nPsalm 77:11\n), including His works in your life. How does the sacrament help us “always remember”? (\nMoroni 4:3\n;\n5:2\n).\nPsalm 71:8\nI can tell others about Jesus Christ.\nAfter reading\nPsalm 71:8\nwith your children, invite them to draw a large mouth. Ask them to help you “fill” the mouth with pictures or words representing things we can tell others about Jesus Christ.\nYou could pass around a picture of Jesus Christ. The person holding the picture could say one thing they know about Him. How can we help other people know these things?\nChildren have much to share.\n“When children learn something new, they naturally want to share it with others. Encourage this desire by giving children opportunities to teach gospel principles to each other, their family members, and their friends. Also ask them to share with you their thoughts, feelings, and experiences related to the principles you are teaching. You will find that they have insights that are simple, pure, and powerful” (\nTeaching in the Savior’s Way\n,\n32\n).\nPsalm 86:7\nHeavenly Father hears and answers my prayers.\nMany of the psalms are like prayers to God. As you read Psalms with your children, you might show them things we can use to communicate with people who are far away, such as a phone or a letter. Then read\nPsalm 86:7\n. How do we “call upon” Heavenly Father? How does He answer us?\nYou could sing together a song about prayer, such as “\nA Child’s Prayer\n” (\nChildren’s Songbook\n, 12–13; see also Susan H. Porter, “\nPray, He Is There\n,”\nLiahona\n, May 2024, 77–79). Tell each other about times when God answered your prayers.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nCome unto Christ\n, by Casey Childs"
  },
  "scripture_content": [
    {
      "reference": "Psalms 49",
      "title": "Psalms 49",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/49?lang=eng",
      "summary": "Men cannot be ransomed or redeemed by wealthâGod alone can redeem a soul from the graveâThe glory of a rich man ceases with his death.",
      "verses": [
        "1Hear this, allyepeople; giveear, allyeinhabitants of the world:",
        "2Both low and high, rich and poor, together.",
        "3My mouth shall speak of wisdom; and the meditation of my heartshall beof understanding.",
        "4I will incline mine ear to a parable: I willopenmy dark saying upon the harp.",
        "5Wherefore should I fear in the days of evil,whenthe iniquity of myheelsshall compass me about?",
        "6They that trust in theirwealth, and boast themselves in the multitude of their riches;",
        "7Noneof themcan by any means redeem his brother, nor give to God a ransom for him:",
        "8(For the redemption of theirsoulisprecious, and it ceaseth for ever:)",
        "9That he should stilllivefor ever,andnot see corruption.",
        "10For he seeththatwise mendie, likewise the fool and the brutish person perish, and leave their wealth to others.",
        "11Their inward thoughtis, thattheir housesshall continuefor ever,andtheir dwelling places to all generations; they calltheirlands after their ownnames.",
        "12Nevertheless manbeingin honour abideth not: he is like the beaststhatperish.",
        "13This their wayistheir folly: yet their posterity approve their sayings.Selah.",
        "14Like sheep they are laid in the grave; death shall feed on them; and the upright shall havedominionover them in the morning; and their beauty shall consume in the grave from their dwelling.",
        "15But God willredeemmy soul from the power of the grave: for he shallreceiveme.Selah.",
        "16Be not thou afraid when one is made rich, when the glory of his house is increased;",
        "17For when he dieth he shall carry nothing away: his glory shall not descend after him.",
        "18Though while he lived heblessedhis soul: andmenwill praise thee, when thou doest well to thyself.",
        "19He shall go to the generation of his fathers; they shall never see light.",
        "20Manthat isin honour, and understandeth not, is like the beaststhatperish."
      ],
      "full_text": "1Hear this, allyepeople; giveear, allyeinhabitants of the world: 2Both low and high, rich and poor, together. 3My mouth shall speak of wisdom; and the meditation of my heartshall beof understanding. 4I will incline mine ear to a parable: I willopenmy dark saying upon the harp. 5Wherefore should I fear in the days of evil,whenthe iniquity of myheelsshall compass me about? 6They that trust in theirwealth, and boast themselves in the multitude of their riches; 7Noneof themcan by any means redeem his brother, nor give to God a ransom for him: 8(For the redemption of theirsoulisprecious, and it ceaseth for ever:) 9That he should stilllivefor ever,andnot see corruption. 10For he seeththatwise mendie, likewise the fool and the brutish person perish, and leave their wealth to others. 11Their inward thoughtis, thattheir housesshall continuefor ever,andtheir dwelling places to all generations; they calltheirlands after their ownnames. 12Nevertheless manbeingin honour abideth not: he is like the beaststhatperish. 13This their wayistheir folly: yet their posterity approve their sayings.Selah. 14Like sheep they are laid in the grave; death shall feed on them; and the upright shall havedominionover them in the morning; and their beauty shall consume in the grave from their dwelling. 15But God willredeemmy soul from the power of the grave: for he shallreceiveme.Selah. 16Be not thou afraid when one is made rich, when the glory of his house is increased; 17For when he dieth he shall carry nothing away: his glory shall not descend after him. 18Though while he lived heblessedhis soul: andmenwill praise thee, when thou doest well to thyself. 19He shall go to the generation of his fathers; they shall never see light. 20Manthat isin honour, and understandeth not, is like the beaststhatperish."
    },
    {
      "reference": "Psalms 50",
      "title": "Psalms 50",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/50?lang=eng",
      "summary": "Asaph speaks of the Second ComingâThe Lord accepts the sacrifices of the righteous and will deliver themâThose whose conduct is right will see the salvation of God.",
      "verses": [
        "1The mighty God,eventheLord, hath spoken, and called the earth from the rising of the sun unto the going down thereof.",
        "2Out of Zion, theperfectionofbeauty, God hathshined.",
        "3Our God shall come, and shall not keep silence: afireshall devour before him, and it shall be very tempestuous round about him.",
        "4He shall call to theheavensfrom above, and to the earth, that he mayjudgehis people.",
        "5Gather mysaintstogether untome; those that have made acovenantwith me bysacrifice.",
        "6And the heavens shalldeclarehisrighteousness: for Godisjudgehimself.Selah.",
        "7Hear, O my people, and I will speak; O Israel, and I will testify against thee: IamGod,eventhy God.",
        "8I will not reprove thee for thy sacrifices or thy burnt offerings,to have beencontinually before me.",
        "9I will take no bullock out of thy house,norhe goats out of thy folds.",
        "10For every beast of the forestismine,andthe cattle upon a thousand hills.",
        "11I know all the fowls of the mountains: and the wild beasts of the fieldaremine.",
        "12If I were hungry, I would not tell thee: for theworldismine, and the fulness thereof.",
        "13Will I eat the flesh of bulls, or drink the blood of goats?",
        "14Offer unto Godthanksgiving; and pay thyvowsunto the most High:",
        "15Andcallupon me in the day oftrouble: I will deliver thee, and thou shalt glorify me.",
        "16But unto the wicked God saith,Whathast thou to do to declare my statutes, orthatthou shouldest take my covenant in thy mouth?",
        "17Seeing thou hatest instruction, and castest my words behind thee.",
        "18When thou sawest a thief, then thou consentedst with him, and hast been partaker with adulterers.",
        "19Thou givest thy mouth to evil, and thy tongue framethdeceit.",
        "20Thou sittestandspeakest against thy brother; thouslanderestthine own motherâs son.",
        "21Thesethingshast thou done, and I kept silence; thou thoughtest that I was altogethersuch an oneas thyself:butI will reprove thee,andsetthemin order before thine eyes.",
        "22Now consider this, ye thatforgetGod, lest I tearyouin pieces, andthere benone to deliver.",
        "23Whoso offerethpraiseglorifieth me: and to him that orderethhisconversationarightwill I shew the salvation of God."
      ],
      "full_text": "1The mighty God,eventheLord, hath spoken, and called the earth from the rising of the sun unto the going down thereof. 2Out of Zion, theperfectionofbeauty, God hathshined. 3Our God shall come, and shall not keep silence: afireshall devour before him, and it shall be very tempestuous round about him. 4He shall call to theheavensfrom above, and to the earth, that he mayjudgehis people. 5Gather mysaintstogether untome; those that have made acovenantwith me bysacrifice. 6And the heavens shalldeclarehisrighteousness: for Godisjudgehimself.Selah. 7Hear, O my people, and I will speak; O Israel, and I will testify against thee: IamGod,eventhy God. 8I will not reprove thee for thy sacrifices or thy burnt offerings,to have beencontinually before me. 9I will take no bullock out of thy house,norhe goats out of thy folds. 10For every beast of the forestismine,andthe cattle upon a thousand hills. 11I know all the fowls of the mountains: and the wild beasts of the fieldaremine. 12If I were hungry, I would not tell thee: for theworldismine, and the fulness thereof. 13Will I eat the flesh of bulls, or drink the blood of goats? 14Offer unto Godthanksgiving; and pay thyvowsunto the most High: 15Andcallupon me in the day oftrouble: I will deliver thee, and thou shalt glorify me. 16But unto the wicked God saith,Whathast thou to do to declare my statutes, orthatthou shouldest take my covenant in thy mouth? 17Seeing thou hatest instruction, and castest my words behind thee. 18When thou sawest a thief, then thou consentedst with him, and hast been partaker with adulterers. 19Thou givest thy mouth to evil, and thy tongue framethdeceit. 20Thou sittestandspeakest against thy brother; thouslanderestthine own motherâs son. 21Thesethingshast thou done, and I kept silence; thou thoughtest that I was altogethersuch an oneas thyself:butI will reprove thee,andsetthemin order before thine eyes. 22Now consider this, ye thatforgetGod, lest I tearyouin pieces, andthere benone to deliver. 23Whoso offerethpraiseglorifieth me: and to him that orderethhisconversationarightwill I shew the salvation of God."
    },
    {
      "reference": "Psalms 51",
      "title": "Psalms 51",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/51?lang=eng",
      "summary": "David pleads for forgiveness after he went in to BathshebaâHe pleads, Create in me a clean heart, and renew a right spirit within me.",
      "verses": [
        "1Havemercyupon me, O God, according to thylovingkindness: according unto the multitude of thy tender merciesblot outmytransgressions.",
        "2Wash me throughly from mine iniquity, andcleanseme from my sin.",
        "3For Iacknowledgemy transgressions: and mysinisever before me.",
        "4Against thee, thee only, have Isinned, and donethisevil in thy sight: that thou mightest bejustifiedwhen thou speakest,andbe clear when thou judgest.",
        "5Behold, I was shapen in iniquity; and in sin did my motherconceiveme.",
        "6Behold, thou desirest truth in the inward parts: and in the hiddenpartthou shalt make me to know wisdom.",
        "7Purge me withhyssop, and I shall be clean: wash me, and I shall be whiter than snow.",
        "8Make me to hear joy and gladness;thatthe boneswhichthou hast broken may rejoice.",
        "9Hide thy face from my sins, and blot out all mine iniquities.",
        "10Create in me acleanheart, O God; andrenewa right spirit within me.",
        "11Cast me not away from thypresence; and take not thyholy spiritfrom me.",
        "12Restore unto me the joy of thy salvation; and uphold mewith thyfree spirit.",
        "13Thenwill I teach transgressors thy ways; and sinners shall beconvertedunto thee.",
        "14Deliverme from bloodguiltiness, O God, thou God of my salvation:andmy tongue shall sing aloud of thy righteousness.",
        "15O Lord, open thou my lips; and my mouth shall shew forth thy praise.",
        "16For thou desirest notsacrifice; else would I giveit:thou delightest not in burnt offering.",
        "17Thesacrificesof Godarea broken spirit: a broken and acontrite heart, O God, thou wilt not despise.",
        "18Do good in thy goodpleasureunto Zion: build thou the walls of Jerusalem.",
        "19Then shalt thou be pleased with the sacrifices of righteousness, with burnt offering and whole burnt offering: then shall they offer bullocks upon thine altar."
      ],
      "full_text": "1Havemercyupon me, O God, according to thylovingkindness: according unto the multitude of thy tender merciesblot outmytransgressions. 2Wash me throughly from mine iniquity, andcleanseme from my sin. 3For Iacknowledgemy transgressions: and mysinisever before me. 4Against thee, thee only, have Isinned, and donethisevil in thy sight: that thou mightest bejustifiedwhen thou speakest,andbe clear when thou judgest. 5Behold, I was shapen in iniquity; and in sin did my motherconceiveme. 6Behold, thou desirest truth in the inward parts: and in the hiddenpartthou shalt make me to know wisdom. 7Purge me withhyssop, and I shall be clean: wash me, and I shall be whiter than snow. 8Make me to hear joy and gladness;thatthe boneswhichthou hast broken may rejoice. 9Hide thy face from my sins, and blot out all mine iniquities. 10Create in me acleanheart, O God; andrenewa right spirit within me. 11Cast me not away from thypresence; and take not thyholy spiritfrom me. 12Restore unto me the joy of thy salvation; and uphold mewith thyfree spirit. 13Thenwill I teach transgressors thy ways; and sinners shall beconvertedunto thee. 14Deliverme from bloodguiltiness, O God, thou God of my salvation:andmy tongue shall sing aloud of thy righteousness. 15O Lord, open thou my lips; and my mouth shall shew forth thy praise. 16For thou desirest notsacrifice; else would I giveit:thou delightest not in burnt offering. 17Thesacrificesof Godarea broken spirit: a broken and acontrite heart, O God, thou wilt not despise. 18Do good in thy goodpleasureunto Zion: build thou the walls of Jerusalem. 19Then shalt thou be pleased with the sacrifices of righteousness, with burnt offering and whole burnt offering: then shall they offer bullocks upon thine altar."
    },
    {
      "reference": "Psalms 61",
      "title": "Psalms 61",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/61?lang=eng",
      "summary": "David finds shelter in the Lord, abides in the Lordâs presence, and keeps his own vows.",
      "verses": [
        "1Hear my cry, O God; attend unto my prayer.",
        "2From the end of the earth will I cry unto thee, when my heart is overwhelmed: lead me to therockthatis higher than I.",
        "3For thou hast been a shelter for me,anda strongtowerfrom the enemy.",
        "4I will abide in thy tabernacle for ever: I will trust in the covert of thy wings.Selah.",
        "5For thou, O God, hast heard myvows: thou hast givenmethe heritage of those that fear thy name.",
        "6Thou wilt prolong the kingâs life:andhis years as many generations.",
        "7He shall abide before God for ever: O preparemercyand truth,whichmay preserve him.",
        "8So will I singpraiseunto thy name for ever, that I may daily perform my vows."
      ],
      "full_text": "1Hear my cry, O God; attend unto my prayer. 2From the end of the earth will I cry unto thee, when my heart is overwhelmed: lead me to therockthatis higher than I. 3For thou hast been a shelter for me,anda strongtowerfrom the enemy. 4I will abide in thy tabernacle for ever: I will trust in the covert of thy wings.Selah. 5For thou, O God, hast heard myvows: thou hast givenmethe heritage of those that fear thy name. 6Thou wilt prolong the kingâs life:andhis years as many generations. 7He shall abide before God for ever: O preparemercyand truth,whichmay preserve him. 8So will I singpraiseunto thy name for ever, that I may daily perform my vows."
    },
    {
      "reference": "Psalms 62",
      "title": "Psalms 62",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/62?lang=eng",
      "summary": "David praises God as his defense, his rock, and his salvationâThe Lord judges men according to their works.",
      "verses": [
        "1Truly my soul waiteth upon God: from himcomethmy salvation.",
        "2He onlyismy rock and mysalvation;he ismy defence; I shall not be greatly moved.",
        "3How long will ye imagine mischief against a man? ye shall be slain all of you: as a bowing wallshall ye be, and asa tottering fence.",
        "4They only consult to casthimdown from his excellency: they delight in lies: they bless with their mouth, but theycurseinwardly.Selah.",
        "5My soul, wait thou only upon God; for my expectationisfrom him.",
        "6He onlyismyrockand my salvation:he ismy defence; I shall not be moved.",
        "7In Godismy salvation and myglory: the rock of my strength,andmyrefuge,isin God.",
        "8Trustin him at all times; ye people, pour out your heart before him: Godisa refuge for us.Selah.",
        "9Surely men of low degreearevanity,andmen of high degreearea lie: to be laid in the balance, theyarealtogetherlighterthanvanity.",
        "10Trust not inoppression, and become not vain in robbery: ifrichesincrease, set not yourheartupon them.",
        "11God hath spoken once; twice have I heard this; that powerbelongethunto God.",
        "12Also unto thee, O Lord,belongethmercy: for thou renderest to every man according to hiswork."
      ],
      "full_text": "1Truly my soul waiteth upon God: from himcomethmy salvation. 2He onlyismy rock and mysalvation;he ismy defence; I shall not be greatly moved. 3How long will ye imagine mischief against a man? ye shall be slain all of you: as a bowing wallshall ye be, and asa tottering fence. 4They only consult to casthimdown from his excellency: they delight in lies: they bless with their mouth, but theycurseinwardly.Selah. 5My soul, wait thou only upon God; for my expectationisfrom him. 6He onlyismyrockand my salvation:he ismy defence; I shall not be moved. 7In Godismy salvation and myglory: the rock of my strength,andmyrefuge,isin God. 8Trustin him at all times; ye people, pour out your heart before him: Godisa refuge for us.Selah. 9Surely men of low degreearevanity,andmen of high degreearea lie: to be laid in the balance, theyarealtogetherlighterthanvanity. 10Trust not inoppression, and become not vain in robbery: ifrichesincrease, set not yourheartupon them. 11God hath spoken once; twice have I heard this; that powerbelongethunto God. 12Also unto thee, O Lord,belongethmercy: for thou renderest to every man according to hiswork."
    },
    {
      "reference": "Psalms 63",
      "title": "Psalms 63",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/63?lang=eng",
      "summary": "David thirsts for God, whom he praises with joyful lips.",
      "verses": [
        "1O God, thouartmy God;earlywill I seek thee: my soulthirstethfor thee, my flesh longeth for thee in a dry andthirstyland, where no water is;",
        "2To see thy power and thy glory, soasI have seen thee in the sanctuary.",
        "3Because thy lovingkindnessisbetterthan life, my lips shall praise thee.",
        "4Thus will I bless thee while I live: I will lift up myhandsin thy name.",
        "5My soul shall be satisfied aswithmarrow and fatness; and my mouth shall praisetheewith joyful lips:",
        "6When I remember thee upon mybed,andmeditateon thee in thenightwatches.",
        "7Because thou hast been my help, therefore in the shadow of thy wings will I rejoice.",
        "8My soul followeth hard after thee: thy right hand upholdeth me.",
        "9But thosethatseek my soul, to destroyit,shall go into the lower parts of the earth.",
        "10They shall fall by the sword: they shall be a portion forfoxes.",
        "11But the king shall rejoice in God; every one that sweareth by him shall glory: but the mouth of them that speak lies shall be stopped."
      ],
      "full_text": "1O God, thouartmy God;earlywill I seek thee: my soulthirstethfor thee, my flesh longeth for thee in a dry andthirstyland, where no water is; 2To see thy power and thy glory, soasI have seen thee in the sanctuary. 3Because thy lovingkindnessisbetterthan life, my lips shall praise thee. 4Thus will I bless thee while I live: I will lift up myhandsin thy name. 5My soul shall be satisfied aswithmarrow and fatness; and my mouth shall praisetheewith joyful lips: 6When I remember thee upon mybed,andmeditateon thee in thenightwatches. 7Because thou hast been my help, therefore in the shadow of thy wings will I rejoice. 8My soul followeth hard after thee: thy right hand upholdeth me. 9But thosethatseek my soul, to destroyit,shall go into the lower parts of the earth. 10They shall fall by the sword: they shall be a portion forfoxes. 11But the king shall rejoice in God; every one that sweareth by him shall glory: but the mouth of them that speak lies shall be stopped."
    },
    {
      "reference": "Psalms 64",
      "title": "Psalms 64",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/64?lang=eng",
      "summary": "David prays for safetyâThe righteous will be glad in heart.",
      "verses": [
        "1Hear my voice, O God, in my prayer: preserve my life from fear of the enemy.",
        "2Hide me from the secret counsel of the wicked; from the insurrection of the workers of iniquity:",
        "3Who whet theirtonguelike a sword,andbendtheir bows to shoottheir arrows,evenbitterwords:",
        "4That they mayshootin secret at the perfect: suddenly do they shoot at him, and fear not.",
        "5They encourage themselvesinan evil matter: they commune of laying snaresprivily; they say, Who shallseethem?",
        "6They search outiniquities; they accomplish a diligent search: both the inwardthoughtof every oneof them,and the heart,isdeep.",
        "7But God shall shoot at themwithan arrow; suddenly shall they be wounded.",
        "8So they shall make their own tongue tofallupon themselves: all that see them shallfleeaway.",
        "9And all men shall fear, and shall declare theworkof God; for they shall wisely consider of his doing.",
        "10The righteous shall be glad in theLord, and shalltrustin him; and all the upright in heart shall glory."
      ],
      "full_text": "1Hear my voice, O God, in my prayer: preserve my life from fear of the enemy. 2Hide me from the secret counsel of the wicked; from the insurrection of the workers of iniquity: 3Who whet theirtonguelike a sword,andbendtheir bows to shoottheir arrows,evenbitterwords: 4That they mayshootin secret at the perfect: suddenly do they shoot at him, and fear not. 5They encourage themselvesinan evil matter: they commune of laying snaresprivily; they say, Who shallseethem? 6They search outiniquities; they accomplish a diligent search: both the inwardthoughtof every oneof them,and the heart,isdeep. 7But God shall shoot at themwithan arrow; suddenly shall they be wounded. 8So they shall make their own tongue tofallupon themselves: all that see them shallfleeaway. 9And all men shall fear, and shall declare theworkof God; for they shall wisely consider of his doing. 10The righteous shall be glad in theLord, and shalltrustin him; and all the upright in heart shall glory."
    },
    {
      "reference": "Psalms 65",
      "title": "Psalms 65",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/65?lang=eng",
      "summary": "David speaks of the blessedness of Godâs chosenâThe Lord sends rain and good things upon the earth.",
      "verses": [
        "1Praise waiteth for thee, O God, in Sion: and unto thee shall the vow be performed.",
        "2O thou that hearest prayer, unto thee shallallfleshcome.",
        "3Iniquities prevail against me:asforour transgressions, thou shaltpurgethem away.",
        "4Blessedis the man whomthou choosest, and causest to approachunto thee, thathe may dwell in thycourts: we shall be satisfied with the goodness of thy house,evenof thy holy temple.",
        "5Byterrible things in righteousness wilt thou answer us, O God of our salvation;who artthe confidence of all the ends of the earth, and of them that are afar offuponthe sea:",
        "6Which by his strength setteth fast the mountains;beinggirded with power:",
        "7Whichstilleththe noise of the seas, the noise of their waves, and the tumult of the people.",
        "8They also that dwell in the uttermost parts are afraid at thytokens: thou makest the outgoings of the morning and evening to rejoice.",
        "9Thou visitest the earth, and waterest it: thou greatly enrichest it with the river of God,whichis full of water: thou preparest themcorn, when thou hast so provided for it.",
        "10Thou waterest the ridges thereof abundantly: thou settlest the furrows thereof: thou makest it soft with showers: thou blessest thespringingthereof.",
        "11Thou crownest the year with thy goodness; and thy paths drop fatness.",
        "12They dropuponthe pastures of the wilderness: and the little hills rejoice on every side.",
        "13The pastures are clothed with flocks; the valleys also are covered over with corn; they shout for joy, they also sing."
      ],
      "full_text": "1Praise waiteth for thee, O God, in Sion: and unto thee shall the vow be performed. 2O thou that hearest prayer, unto thee shallallfleshcome. 3Iniquities prevail against me:asforour transgressions, thou shaltpurgethem away. 4Blessedis the man whomthou choosest, and causest to approachunto thee, thathe may dwell in thycourts: we shall be satisfied with the goodness of thy house,evenof thy holy temple. 5Byterrible things in righteousness wilt thou answer us, O God of our salvation;who artthe confidence of all the ends of the earth, and of them that are afar offuponthe sea: 6Which by his strength setteth fast the mountains;beinggirded with power: 7Whichstilleththe noise of the seas, the noise of their waves, and the tumult of the people. 8They also that dwell in the uttermost parts are afraid at thytokens: thou makest the outgoings of the morning and evening to rejoice. 9Thou visitest the earth, and waterest it: thou greatly enrichest it with the river of God,whichis full of water: thou preparest themcorn, when thou hast so provided for it. 10Thou waterest the ridges thereof abundantly: thou settlest the furrows thereof: thou makest it soft with showers: thou blessest thespringingthereof. 11Thou crownest the year with thy goodness; and thy paths drop fatness. 12They dropuponthe pastures of the wilderness: and the little hills rejoice on every side. 13The pastures are clothed with flocks; the valleys also are covered over with corn; they shout for joy, they also sing."
    },
    {
      "reference": "Psalms 66",
      "title": "Psalms 66",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/66?lang=eng",
      "summary": "Praise and worship the LordâHe tests and tries menâSacrifices are to be offered in His house.",
      "verses": [
        "1Make ajoyfulnoise unto God, all ye lands:",
        "2Sing forth the honour of his name: make his praise glorious.",
        "3Say unto God, How terribleart thou inthy works! through the greatness of thy power shall thine enemiessubmitthemselves unto thee.",
        "4All the earth shallworshipthee, and shall sing unto thee; they shall singtothy name.Selah.",
        "5Come and see the works of God:he isterriblein hisdoing toward the children of men.",
        "6He turned theseainto dryland:they went through thefloodon foot: there did we rejoice in him.",
        "7He ruleth by his power for ever; his eyes behold the nations: let not the rebellious exalt themselves.Selah.",
        "8O bless our God, ye people, and make the voice of his praise to be heard:",
        "9Which holdeth our soul in life, and suffereth not ourfeettobe moved.",
        "10For thou, O God, hastprovedus: thou hast tried us, as silver is tried.",
        "11Thou broughtest us into the net; thou laidstafflictionupon our loins.",
        "12Thou hast caused men to ride over our heads; we went through fire and throughwater: but thoubroughtestus out into awealthyplace.",
        "13I will go into thy house with burnt offerings: I will pay thee my vows,",
        "14Which my lips have uttered, and my mouth hath spoken, when I was in trouble.",
        "15I will offer unto thee burnt sacrifices of fatlings, with the incense of rams; I will offer bullocks with goats.Selah.",
        "16Comeandhear, all ye that fear God, and I will declare what he hath done for my soul.",
        "17I cried unto him with my mouth, and he was extolled with my tongue.",
        "18If I regard iniquity in my heart, the Lord will nothearme:",
        "19Butverily God hath heardme;he hath attended to the voice of my prayer.",
        "20BlessedbeGod, which hath not turned away my prayer, nor his mercy from me."
      ],
      "full_text": "1Make ajoyfulnoise unto God, all ye lands: 2Sing forth the honour of his name: make his praise glorious. 3Say unto God, How terribleart thou inthy works! through the greatness of thy power shall thine enemiessubmitthemselves unto thee. 4All the earth shallworshipthee, and shall sing unto thee; they shall singtothy name.Selah. 5Come and see the works of God:he isterriblein hisdoing toward the children of men. 6He turned theseainto dryland:they went through thefloodon foot: there did we rejoice in him. 7He ruleth by his power for ever; his eyes behold the nations: let not the rebellious exalt themselves.Selah. 8O bless our God, ye people, and make the voice of his praise to be heard: 9Which holdeth our soul in life, and suffereth not ourfeettobe moved. 10For thou, O God, hastprovedus: thou hast tried us, as silver is tried. 11Thou broughtest us into the net; thou laidstafflictionupon our loins. 12Thou hast caused men to ride over our heads; we went through fire and throughwater: but thoubroughtestus out into awealthyplace. 13I will go into thy house with burnt offerings: I will pay thee my vows, 14Which my lips have uttered, and my mouth hath spoken, when I was in trouble. 15I will offer unto thee burnt sacrifices of fatlings, with the incense of rams; I will offer bullocks with goats.Selah. 16Comeandhear, all ye that fear God, and I will declare what he hath done for my soul. 17I cried unto him with my mouth, and he was extolled with my tongue. 18If I regard iniquity in my heart, the Lord will nothearme: 19Butverily God hath heardme;he hath attended to the voice of my prayer. 20BlessedbeGod, which hath not turned away my prayer, nor his mercy from me."
    },
    {
      "reference": "Psalms 69",
      "title": "Psalms 69",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/69?lang=eng",
      "summary": "A messianic psalm of DavidâThe zeal of the Lordâs house has eaten Him upâReproach has broken His heartâHe is given gall and vinegar to drinkâHe is persecutedâHe will save Zion.",
      "verses": [
        "1Save me, O God; for the waters are come in untomysoul.",
        "2I sink in deep mire, wherethere isno standing: I am come intodeepwaters, where the floods overflow me.",
        "3I am weary of my crying: my throat is dried: mine eyes fail while I wait for my God.",
        "4They thathateme without a cause are more than the hairs of mine head: they that would destroy me,beingmine enemies wrongfully, are mighty: then I restoredthatwhich I took not away.",
        "5O God, thou knowest myfoolishness; and my sins are not hid from thee.",
        "6Let not them that wait on thee, O LordGodof hosts, be ashamed for my sake: let not those that seek thee be confounded for my sake, O God of Israel.",
        "7Because for thy sake I have borne reproach; shame hath covered my face.",
        "8I am become a stranger unto my brethren, and an alien unto my motherâs children.",
        "9For thezealof thine house hath eaten me up; and thereproachesof them that reproached thee are fallen upon me.",
        "10When I wept,and chastenedmy soul withfasting, that was to my reproach.",
        "11I made sackcloth also my garment; and I became a proverb to them.",
        "12They that sit in the gate speak against me; and Iwasthesongof the drunkards.",
        "13But as for me, my prayerisunto thee, OLord,inan acceptable time: O God, in the multitude of thy mercy hear me, in the truth of thy salvation.",
        "14Deliver me out of the mire, and let me not sink: let me be delivered from them that hate me, and out of the deep waters.",
        "15Let not the waterflood overflow me, neither let the deep swallow me up, and let not thepitshut her mouth upon me.",
        "16Hear me, OLord; for thy lovingkindnessisgood: turn unto me according to the multitude of thy tendermercies.",
        "17And hide not thy face from thy servant; for I am in trouble: hear me speedily.",
        "18Drawnighunto my soul,andredeem it: deliver me because of mine enemies.",
        "19Thou hast known myreproach, and myshame, and my dishonour: mine adversariesareall before thee.",
        "20Reproach hath broken my heart; and I am full ofheaviness: and I lookedfor someto take pity, butthere wasnone; and for comforters, but I found none.",
        "21They gave me also gall for my meat; and in my thirst they gave mevinegarto drink.",
        "22Let their table become asnarebefore them: andthat which should have beenfortheirwelfare,let it becomea trap.",
        "23Let their eyes be darkened, that theysee not; and make their loins continually to shake.",
        "24Pour out thine indignation upon them, and let thy wrathful anger take hold of them.",
        "25Let their habitation bedesolate;andlet none dwell in their tents.",
        "26For they persecutehimwhom thou hast smitten; and they talk to the grief of those whom thou hast wounded.",
        "27Addiniquityunto their iniquity: and let them not come into thy righteousness.",
        "28Let them be blotted out of thebookof the living, and not be written with the righteous.",
        "29But Iampoor and sorrowful: let thy salvation, O God, set me up on high.",
        "30I will praise the name of God with a song, and will magnify him withthanksgiving.",
        "31Thisalso shallpleasetheLordbetter than an oxorbullock that hath horns and hoofs.",
        "32The humble shall seethis, andbe glad: and your heart shall live thatseekGod.",
        "33For theLordheareth the poor, and despiseth nothis prisoners.",
        "34Let the heaven and earth praise him, the seas, and every thing that moveth therein.",
        "35For God will saveZion, and willbuildthe cities of Judah: that they may dwell there, and have it in possession.",
        "36The seed also of his servants shall inherit it: and they that love his name shall dwell therein."
      ],
      "full_text": "1Save me, O God; for the waters are come in untomysoul. 2I sink in deep mire, wherethere isno standing: I am come intodeepwaters, where the floods overflow me. 3I am weary of my crying: my throat is dried: mine eyes fail while I wait for my God. 4They thathateme without a cause are more than the hairs of mine head: they that would destroy me,beingmine enemies wrongfully, are mighty: then I restoredthatwhich I took not away. 5O God, thou knowest myfoolishness; and my sins are not hid from thee. 6Let not them that wait on thee, O LordGodof hosts, be ashamed for my sake: let not those that seek thee be confounded for my sake, O God of Israel. 7Because for thy sake I have borne reproach; shame hath covered my face. 8I am become a stranger unto my brethren, and an alien unto my motherâs children. 9For thezealof thine house hath eaten me up; and thereproachesof them that reproached thee are fallen upon me. 10When I wept,and chastenedmy soul withfasting, that was to my reproach. 11I made sackcloth also my garment; and I became a proverb to them. 12They that sit in the gate speak against me; and Iwasthesongof the drunkards. 13But as for me, my prayerisunto thee, OLord,inan acceptable time: O God, in the multitude of thy mercy hear me, in the truth of thy salvation. 14Deliver me out of the mire, and let me not sink: let me be delivered from them that hate me, and out of the deep waters. 15Let not the waterflood overflow me, neither let the deep swallow me up, and let not thepitshut her mouth upon me. 16Hear me, OLord; for thy lovingkindnessisgood: turn unto me according to the multitude of thy tendermercies. 17And hide not thy face from thy servant; for I am in trouble: hear me speedily. 18Drawnighunto my soul,andredeem it: deliver me because of mine enemies. 19Thou hast known myreproach, and myshame, and my dishonour: mine adversariesareall before thee. 20Reproach hath broken my heart; and I am full ofheaviness: and I lookedfor someto take pity, butthere wasnone; and for comforters, but I found none. 21They gave me also gall for my meat; and in my thirst they gave mevinegarto drink. 22Let their table become asnarebefore them: andthat which should have beenfortheirwelfare,let it becomea trap. 23Let their eyes be darkened, that theysee not; and make their loins continually to shake. 24Pour out thine indignation upon them, and let thy wrathful anger take hold of them. 25Let their habitation bedesolate;andlet none dwell in their tents. 26For they persecutehimwhom thou hast smitten; and they talk to the grief of those whom thou hast wounded. 27Addiniquityunto their iniquity: and let them not come into thy righteousness. 28Let them be blotted out of thebookof the living, and not be written with the righteous. 29But Iampoor and sorrowful: let thy salvation, O God, set me up on high. 30I will praise the name of God with a song, and will magnify him withthanksgiving. 31Thisalso shallpleasetheLordbetter than an oxorbullock that hath horns and hoofs. 32The humble shall seethis, andbe glad: and your heart shall live thatseekGod. 33For theLordheareth the poor, and despiseth nothis prisoners. 34Let the heaven and earth praise him, the seas, and every thing that moveth therein. 35For God will saveZion, and willbuildthe cities of Judah: that they may dwell there, and have it in possession. 36The seed also of his servants shall inherit it: and they that love his name shall dwell therein."
    },
    {
      "reference": "Psalms 70",
      "title": "Psalms 70",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/70?lang=eng",
      "summary": "David proclaims, Let God be magnified.",
      "verses": [
        "1Make haste,O God, to deliver me; make haste to help me, OLord.",
        "2Let them be ashamed and confounded that seek after my soul: let them be turned backward, and put to confusion, that desire my hurt.",
        "3Let them be turned back for a reward of their shame that say, Aha, aha.",
        "4Let all those that seek thee rejoice and be glad in thee: and let such as love thy salvation say continually, Let God be magnified.",
        "5But Iampoor and needy: makehasteunto me, O God: thouartmy help and my deliverer; OLord, make no tarrying."
      ],
      "full_text": "1Make haste,O God, to deliver me; make haste to help me, OLord. 2Let them be ashamed and confounded that seek after my soul: let them be turned backward, and put to confusion, that desire my hurt. 3Let them be turned back for a reward of their shame that say, Aha, aha. 4Let all those that seek thee rejoice and be glad in thee: and let such as love thy salvation say continually, Let God be magnified. 5But Iampoor and needy: makehasteunto me, O God: thouartmy help and my deliverer; OLord, make no tarrying."
    },
    {
      "reference": "Psalms 71",
      "title": "Psalms 71",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/71?lang=eng",
      "summary": "David praises God with thanksgivingâWho is like unto the Lord!",
      "verses": [
        "1In thee, OLord, do I put my trust: let me never be put to confusion.",
        "2Deliver me in thy righteousness, and cause me to escape: incline thine ear unto me, and save me.",
        "3Be thou my strong habitation, whereunto I may continually resort: thou hast given commandment to save me; for thouartmyrockand my fortress.",
        "4Deliver me, O my God, out of the hand of the wicked, out of the hand of the unrighteous andcruelman.",
        "5For thouartmy hope, O LordGod:thou artmy trust from my youth.",
        "6By thee have I been holden up from the womb: thou art he that took me out of my motherâs bowels: my praiseshall becontinually of thee.",
        "7I am as a wonder unto many; but thouartmy strong refuge.",
        "8Let my mouth be filledwiththy praiseand withthy honour all the day.",
        "9Cast me not off in the time ofoldage; forsake me not when my strength faileth.",
        "10For mine enemies speak against me; and they that lay wait for my soul take counsel together,",
        "11Saying, God hath forsaken him: persecute and take him; forthere isnone to deliverhim.",
        "12O God, be not far from me: O my God, make haste for my help.",
        "13Let them be confoundedandconsumed that are adversaries to my soul; let them be coveredwithreproachand dishonour that seek my hurt.",
        "14But I will hope continually, and will yet praise thee more and more.",
        "15My mouth shall shew forth thy righteousnessandthy salvation all the day; for I know not the numbersthereof.",
        "16I will go in thestrengthof the LordGod: I will make mention of thy righteousness,evenof thine only.",
        "17O God, thou hast taught me from my youth: and hitherto have I declared thy wondrous works.",
        "18Now also when I am old and grayheaded, O God, forsake me not; until I have shewed thy strength untothisgeneration,andthy power to every onethatis to come.",
        "19Thyrighteousnessalso, O God,isveryhigh, who hast done great things: O God, whoislikeunto thee!",
        "20Thou,which hast shewed me great and sore troubles, shaltquickenme again, and shalt bring me up again from the depths of the earth.",
        "21Thou shalt increase my greatness, andcomfortme on every side.",
        "22I will also praise thee with the psaltery,eventhy truth, O my God: unto thee will I sing with the harp, O thou Holy One of Israel.",
        "23My lips shall greatly rejoice when I sing unto thee; and my soul, which thou hast redeemed.",
        "24My tongue also shall talk of thy righteousness all the day long: for they are confounded, for they are brought untoshame, that seek my hurt."
      ],
      "full_text": "1In thee, OLord, do I put my trust: let me never be put to confusion. 2Deliver me in thy righteousness, and cause me to escape: incline thine ear unto me, and save me. 3Be thou my strong habitation, whereunto I may continually resort: thou hast given commandment to save me; for thouartmyrockand my fortress. 4Deliver me, O my God, out of the hand of the wicked, out of the hand of the unrighteous andcruelman. 5For thouartmy hope, O LordGod:thou artmy trust from my youth. 6By thee have I been holden up from the womb: thou art he that took me out of my motherâs bowels: my praiseshall becontinually of thee. 7I am as a wonder unto many; but thouartmy strong refuge. 8Let my mouth be filledwiththy praiseand withthy honour all the day. 9Cast me not off in the time ofoldage; forsake me not when my strength faileth. 10For mine enemies speak against me; and they that lay wait for my soul take counsel together, 11Saying, God hath forsaken him: persecute and take him; forthere isnone to deliverhim. 12O God, be not far from me: O my God, make haste for my help. 13Let them be confoundedandconsumed that are adversaries to my soul; let them be coveredwithreproachand dishonour that seek my hurt. 14But I will hope continually, and will yet praise thee more and more. 15My mouth shall shew forth thy righteousnessandthy salvation all the day; for I know not the numbersthereof. 16I will go in thestrengthof the LordGod: I will make mention of thy righteousness,evenof thine only. 17O God, thou hast taught me from my youth: and hitherto have I declared thy wondrous works. 18Now also when I am old and grayheaded, O God, forsake me not; until I have shewed thy strength untothisgeneration,andthy power to every onethatis to come. 19Thyrighteousnessalso, O God,isveryhigh, who hast done great things: O God, whoislikeunto thee! 20Thou,which hast shewed me great and sore troubles, shaltquickenme again, and shalt bring me up again from the depths of the earth. 21Thou shalt increase my greatness, andcomfortme on every side. 22I will also praise thee with the psaltery,eventhy truth, O my God: unto thee will I sing with the harp, O thou Holy One of Israel. 23My lips shall greatly rejoice when I sing unto thee; and my soul, which thou hast redeemed. 24My tongue also shall talk of thy righteousness all the day long: for they are confounded, for they are brought untoshame, that seek my hurt."
    },
    {
      "reference": "Psalms 72",
      "title": "Psalms 72",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/72?lang=eng",
      "summary": "David speaks of Solomon, who is made a type of the MessiahâHe will have dominionâHis name will endure foreverâAll nations will call him blessedâThe whole earth will be filled with the glory of the Lord.",
      "verses": [
        "1Give the king thy judgments, O God, and thy righteousness unto the kingâs son.",
        "2He shalljudgethy people with righteousness, and thy poor with judgment.",
        "3The mountains shall bring peace to the people, and the little hills, by righteousness.",
        "4He shall judge the poor of the people, he shall save the children of the needy, and shall break in pieces theoppressor.",
        "5They shall fear thee as long as the sun and moonendure, throughout all generations.",
        "6He shall come down like rain upon the mown grass: as showersthatwater the earth.",
        "7In his days shall therighteousflourish; and abundance ofpeaceso long as the moon endureth.",
        "8He shall havedominionalso from sea to sea, and from the river unto the ends of the earth.",
        "9They that dwell in the wilderness shallbowbefore him; and his enemies shall lick the dust.",
        "10The kings of Tarshish and of the isles shallbring presents: the kings of Sheba andSebashall offer gifts.",
        "11Yea, all kings shall fall down before him: all nations shall serve him.",
        "12For he shall deliver the needy when he crieth; the poor also, andhimthat hath no helper.",
        "13He shall spare the poor and needy, and shall save the souls of the needy.",
        "14He shallredeemtheir soul from deceit and violence: andpreciousshall their blood be in his sight.",
        "15And he shall live, and to him shall be given of the gold of Sheba:prayer also shall be made for him continually;anddaily shall he be praised.",
        "16There shall be an handful of corn in the earth upon the top of the mountains; the fruit thereof shall shake like Lebanon: andtheyof the city shall flourish likegrassof the earth.",
        "17His name shall endure for ever: his name shall be continued as long as the sun: andmenshall be blessed in him: all nations shall call himblessed.",
        "18BlessedbetheLordGod, the God of Israel, who only doeth wondrous things.",
        "19And blessedbehis glorious name for ever: and let the whole earth befilledwithhisglory; Amen, and Amen.",
        "20The prayers of David the son of Jesse are ended."
      ],
      "full_text": "1Give the king thy judgments, O God, and thy righteousness unto the kingâs son. 2He shalljudgethy people with righteousness, and thy poor with judgment. 3The mountains shall bring peace to the people, and the little hills, by righteousness. 4He shall judge the poor of the people, he shall save the children of the needy, and shall break in pieces theoppressor. 5They shall fear thee as long as the sun and moonendure, throughout all generations. 6He shall come down like rain upon the mown grass: as showersthatwater the earth. 7In his days shall therighteousflourish; and abundance ofpeaceso long as the moon endureth. 8He shall havedominionalso from sea to sea, and from the river unto the ends of the earth. 9They that dwell in the wilderness shallbowbefore him; and his enemies shall lick the dust. 10The kings of Tarshish and of the isles shallbring presents: the kings of Sheba andSebashall offer gifts. 11Yea, all kings shall fall down before him: all nations shall serve him. 12For he shall deliver the needy when he crieth; the poor also, andhimthat hath no helper. 13He shall spare the poor and needy, and shall save the souls of the needy. 14He shallredeemtheir soul from deceit and violence: andpreciousshall their blood be in his sight. 15And he shall live, and to him shall be given of the gold of Sheba:prayer also shall be made for him continually;anddaily shall he be praised. 16There shall be an handful of corn in the earth upon the top of the mountains; the fruit thereof shall shake like Lebanon: andtheyof the city shall flourish likegrassof the earth. 17His name shall endure for ever: his name shall be continued as long as the sun: andmenshall be blessed in him: all nations shall call himblessed. 18BlessedbetheLordGod, the God of Israel, who only doeth wondrous things. 19And blessedbehis glorious name for ever: and let the whole earth befilledwithhisglory; Amen, and Amen. 20The prayers of David the son of Jesse are ended."
    },
    {
      "reference": "Psalms 77",
      "title": "Psalms 77",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/77?lang=eng",
      "summary": "The righteous cry unto the LordâThey remember the wonders of old, how He redeemed the sons of Jacob and led Israel like a flock.",
      "verses": [
        "1I cried unto God with my voice,evenunto God with my voice; and he gave ear unto me.",
        "2In the day of my trouble Isoughtthe Lord: my sore ran in the night, and ceased not: my soul refused to becomforted.",
        "3I remembered God, and was troubled: Icomplained, and my spirit wasoverwhelmed.Selah.",
        "4Thou holdest mine eyes waking: I am so troubled that I cannot speak.",
        "5I have considered the days of old, the years of ancient times.",
        "6I call to remembrance mysongin the night: I commune with mine own heart: and my spirit made diligent search.",
        "7Will the Lord cast off for ever? and will he be favourable no more?",
        "8Is his mercy clean gone for ever? dothhispromise fail for evermore?",
        "9Hath God forgotten to be gracious? hath he in anger shut up his tender mercies?Selah.",
        "10And I said, Thisismy infirmity:but I will rememberthe years of the right hand of the most High.",
        "11I will remember the works of theLord: surely I will remember thy wonders of old.",
        "12I willmeditatealso of all thy work, and talk of thy doings.",
        "13Thy way, O God,isin the sanctuary: whois sogreat a God asourGod?",
        "14Thouartthe God that doestwonders: thou hast declared thy strength among the people.",
        "15Thou hast withthinearm redeemed thy people, the sons of Jacob andJoseph.Selah.",
        "16Thewaterssaw thee, O God, the waters saw thee; they were afraid: the depths also were troubled.",
        "17The clouds poured out water: the skies sent out a sound: thine arrows also went abroad.",
        "18The voice of thy thunderwasin the heaven: the lightningslightenedthe world: the earth trembled and shook.",
        "19Thy wayisin the sea, and thy path in the great waters, and thy footsteps are not known.",
        "20Thouleddestthy people like a flock by the hand ofMosesand Aaron."
      ],
      "full_text": "1I cried unto God with my voice,evenunto God with my voice; and he gave ear unto me. 2In the day of my trouble Isoughtthe Lord: my sore ran in the night, and ceased not: my soul refused to becomforted. 3I remembered God, and was troubled: Icomplained, and my spirit wasoverwhelmed.Selah. 4Thou holdest mine eyes waking: I am so troubled that I cannot speak. 5I have considered the days of old, the years of ancient times. 6I call to remembrance mysongin the night: I commune with mine own heart: and my spirit made diligent search. 7Will the Lord cast off for ever? and will he be favourable no more? 8Is his mercy clean gone for ever? dothhispromise fail for evermore? 9Hath God forgotten to be gracious? hath he in anger shut up his tender mercies?Selah. 10And I said, Thisismy infirmity:but I will rememberthe years of the right hand of the most High. 11I will remember the works of theLord: surely I will remember thy wonders of old. 12I willmeditatealso of all thy work, and talk of thy doings. 13Thy way, O God,isin the sanctuary: whois sogreat a God asourGod? 14Thouartthe God that doestwonders: thou hast declared thy strength among the people. 15Thou hast withthinearm redeemed thy people, the sons of Jacob andJoseph.Selah. 16Thewaterssaw thee, O God, the waters saw thee; they were afraid: the depths also were troubled. 17The clouds poured out water: the skies sent out a sound: thine arrows also went abroad. 18The voice of thy thunderwasin the heaven: the lightningslightenedthe world: the earth trembled and shook. 19Thy wayisin the sea, and thy path in the great waters, and thy footsteps are not known. 20Thouleddestthy people like a flock by the hand ofMosesand Aaron."
    },
    {
      "reference": "Psalms 78",
      "title": "Psalms 78",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/78?lang=eng",
      "summary": "The Israelites are to teach the Lordâs law to their childrenâDisobedient Israel provoked the Lord in the wildernessâThe Egyptian plagues are recountedâThe Lord chooses and blesses Judah and David.",
      "verses": [
        "1Giveear, O my people,tomy law: incline your ears to the words of my mouth.",
        "2I will open my mouth in aparable: I will utter dark sayings of old:",
        "3Which we have heard and known, and ourfathershave told us.",
        "4We will nothidethemfrom their children,shewingto the generation to come the praises of theLord, and his strength, and his wonderful works that he hath done.",
        "5For he established a testimony in Jacob, and appointed a law in Israel, which he commanded ourfathers, that they should make them known to theirchildren:",
        "6That the generation to come might knowthem, eventhe childrenwhichshould be born;whoshould arise and declarethemto their children:",
        "7That they might set their hope in God, and not forget the works of God, but keep his commandments:",
        "8And might not be as theirfathers, astubbornandrebelliousgeneration; a generationthatset not their heart aright, and whose spirit was not steadfast with God.",
        "9The children of Ephraim,beingarmed,andcarrying bows, turned back in the day of battle.",
        "10They kept not thecovenantof God, and refused to walk in his law;",
        "11And forgat his works, and his wonders that he had shewed them.",
        "12Marvellousthings did he in the sight of their fathers, in the land of Egypt,inthe field ofZoan.",
        "13Hedividedthe sea, and caused them to pass through; and he made the waters to stand as an heap.",
        "14In the daytime also he led them with acloud, and all the night with a light of fire.",
        "15Heclavethe rocks in the wilderness, and gavethemdrink asout ofthe great depths.",
        "16He brought streams also out of the rock, and caused waters to run down like rivers.",
        "17And they sinned yet more against him by provoking the most High in the wilderness.",
        "18And they tempted God in their heart by askingmeatfor theirlust.",
        "19Yea, they spake against God; they said, Can God furnish atablein the wilderness?",
        "20Behold, he smote the rock, that the waters gushed out, and the streams overflowed; can he give bread also? can he provide flesh for his people?",
        "21Therefore theLordheardthis,and was wroth: so afirewas kindled against Jacob, and anger also came up against Israel;",
        "22Because theybelieved notin God, andtrustednot in his salvation:",
        "23Though he had commanded the clouds from above, and opened the doors of heaven,",
        "24And had rained down manna upon them to eat, and had given them of thecornof heaven.",
        "25Man did eatangelsâfood: he sent them meat to the full.",
        "26He caused aneast windto blow in the heaven: and by his power he brought in the south wind.",
        "27He rained flesh also upon them as dust, and featheredfowlslike as the sand of the sea:",
        "28And he letitfall in the midst of their camp, round about their habitations.",
        "29So they did eat, and were well filled: for he gave them their own desire;",
        "30They were not estranged from theirlust. But while their meatwasyet in their mouths,",
        "31The wrath of God came upon them, and slew the fattest of them, and smote down the chosenmenof Israel.",
        "32For all this they sinned still, and believed not for his wondrous works.",
        "33Therefore their days did he consume invanity, and their years in trouble.",
        "34When heslewthem, then theysought him: and theyreturnedandinquired earlyafter God.",
        "35And they remembered that Godwastheirrock, and the high God their redeemer.",
        "36Nevertheless they didflatterhim with their mouth, and theyliedunto him with their tongues.",
        "37For theirheartwas not right with him, neither were theysteadfastin his covenant.",
        "38But he,beingfull of compassion, forgavetheiriniquity, and destroyedthemnot: yea, many a time turned he his anger away, and did not stir up all his wrath.",
        "39For he remembered that theywere butflesh; a wind that passeth away, and cometh not again.",
        "40How oft did theyprovokehim in the wilderness,andgrieve him in the desert!",
        "41Yea, they turned back and tempted God, and limited the Holy One of Israel.",
        "42They remembered not his hand,northe day when he delivered them from the enemy.",
        "43How he had wrought his signs in Egypt, and his wonders in the field of Zoan:",
        "44And had turned their rivers into blood; and theirfloods, that they could not drink.",
        "45He sent divers sorts of flies among them, which devoured them; and frogs, which destroyed them.",
        "46He gave also their increase unto the caterpiller, and their labour unto thelocust.",
        "47He destroyed their vines withhail, and their sycomore trees with frost.",
        "48He gave up their cattle also to the hail, and their flocks to hot thunderbolts.",
        "49He cast upon them the fierceness of his anger, wrath, and indignation, and trouble, by sendingevil angelsamong them.",
        "50He made a way to his anger; he spared not their soul from death, but gave their life over to the pestilence;"
      ],
      "full_text": "1Giveear, O my people,tomy law: incline your ears to the words of my mouth. 2I will open my mouth in aparable: I will utter dark sayings of old: 3Which we have heard and known, and ourfathershave told us. 4We will nothidethemfrom their children,shewingto the generation to come the praises of theLord, and his strength, and his wonderful works that he hath done. 5For he established a testimony in Jacob, and appointed a law in Israel, which he commanded ourfathers, that they should make them known to theirchildren: 6That the generation to come might knowthem, eventhe childrenwhichshould be born;whoshould arise and declarethemto their children: 7That they might set their hope in God, and not forget the works of God, but keep his commandments: 8And might not be as theirfathers, astubbornandrebelliousgeneration; a generationthatset not their heart aright, and whose spirit was not steadfast with God. 9The children of Ephraim,beingarmed,andcarrying bows, turned back in the day of battle. 10They kept not thecovenantof God, and refused to walk in his law; 11And forgat his works, and his wonders that he had shewed them. 12Marvellousthings did he in the sight of their fathers, in the land of Egypt,inthe field ofZoan. 13Hedividedthe sea, and caused them to pass through; and he made the waters to stand as an heap. 14In the daytime also he led them with acloud, and all the night with a light of fire. 15Heclavethe rocks in the wilderness, and gavethemdrink asout ofthe great depths. 16He brought streams also out of the rock, and caused waters to run down like rivers. 17And they sinned yet more against him by provoking the most High in the wilderness. 18And they tempted God in their heart by askingmeatfor theirlust. 19Yea, they spake against God; they said, Can God furnish atablein the wilderness? 20Behold, he smote the rock, that the waters gushed out, and the streams overflowed; can he give bread also? can he provide flesh for his people? 21Therefore theLordheardthis,and was wroth: so afirewas kindled against Jacob, and anger also came up against Israel; 22Because theybelieved notin God, andtrustednot in his salvation: 23Though he had commanded the clouds from above, and opened the doors of heaven, 24And had rained down manna upon them to eat, and had given them of thecornof heaven. 25Man did eatangelsâfood: he sent them meat to the full. 26He caused aneast windto blow in the heaven: and by his power he brought in the south wind. 27He rained flesh also upon them as dust, and featheredfowlslike as the sand of the sea: 28And he letitfall in the midst of their camp, round about their habitations. 29So they did eat, and were well filled: for he gave them their own desire; 30They were not estranged from theirlust. But while their meatwasyet in their mouths, 31The wrath of God came upon them, and slew the fattest of them, and smote down the chosenmenof Israel. 32For all this they sinned still, and believed not for his wondrous works. 33Therefore their days did he consume invanity, and their years in trouble. 34When heslewthem, then theysought him: and theyreturnedandinquired earlyafter God. 35And they remembered that Godwastheirrock, and the high God their redeemer. 36Nevertheless they didflatterhim with their mouth, and theyliedunto him with their tongues. 37For theirheartwas not right with him, neither were theysteadfastin his covenant. 38But he,beingfull of compassion, forgavetheiriniquity, and destroyedthemnot: yea, many a time turned he his anger away, and did not stir up all his wrath. 39For he remembered that theywere butflesh; a wind that passeth away, and cometh not again. 40How oft did theyprovokehim in the wilderness,andgrieve him in the desert! 41Yea, they turned back and tempted God, and limited the Holy One of Israel. 42They remembered not his hand,northe day when he delivered them from the enemy. 43How he had wrought his signs in Egypt, and his wonders in the field of Zoan: 44And had turned their rivers into blood; and theirfloods, that they could not drink. 45He sent divers sorts of flies among them, which devoured them; and frogs, which destroyed them. 46He gave also their increase unto the caterpiller, and their labour unto thelocust. 47He destroyed their vines withhail, and their sycomore trees with frost. 48He gave up their cattle also to the hail, and their flocks to hot thunderbolts. 49He cast upon them the fierceness of his anger, wrath, and indignation, and trouble, by sendingevil angelsamong them. 50He made a way to his anger; he spared not their soul from death, but gave their life over to the pestilence; 51And smote all thefirstbornin Egypt; the chief oftheirstrength in thetabernaclesofHam: 52But made his own people to go forth like sheep, and guided them in the wilderness like a flock. 53And he led them on safely, so that they feared not: but theseaoverwhelmed their enemies. 54And he brought themtothe border of his sanctuary,even tothis mountain,whichhis right hand had purchased. 55He cast out the heathen also before them, and divided them an inheritance by line, and made the tribes of Israel to dwell in their tents. 56Yet they tempted and provoked the most high God, and kept not his testimonies: 57But turned back, and dealt unfaithfully like their fathers: they were turned aside like adeceitfulbow. 58For theyprovokedhim to anger with their high places, and moved him to jealousy with their graven images. 59When God heardthis,he was wroth, and greatly abhorred Israel: 60So that he forsook the tabernacle ofShiloh, the tentwhichhe placed among men; 61And delivered his strength into captivity, and his glory into the enemyâs hand. 62He gave his people over also unto the sword; and was wroth with his inheritance. 63The fire consumed their young men; and their maidens were not given to marriage. 64Their priests fell by the sword; and their widows made no lamentation. 65Then the Lordawakedas one out of sleep,andlike a mighty man that shouteth by reason of wine. 66And he smote his enemies in the hinder parts: he put them to a perpetual reproach. 67Moreover he refused the tabernacle of Joseph, and chose not the tribe of Ephraim: 68But chose the tribe of Judah, the mount Zion which he loved. 69And he built his sanctuary like highpalaces,like the earth which he hath established forever. 70He choseDavidalso his servant, and took him from the sheepfolds: 71From following the ewes great with young he brought him to feed Jacob his people, and Israel his inheritance. 72So he fed them according to theintegrityof his heart; and guided them by the skilfulness of his hands."
    },
    {
      "reference": "Psalms 85",
      "title": "Psalms 85",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/85?lang=eng",
      "summary": "The Lord speaks peace to His peopleâTruth will spring out of the earth (the Book of Mormon), and righteousness will look down from heaven.",
      "verses": [
        "1Lord, thou hast beenfavourableunto thy land: thou hast brought backthe captivity of Jacob.",
        "2Thou hast forgiven the iniquity of thy people, thou hast covered all their sin.Selah.",
        "3Thou hast taken away all thy wrath: thou hast turnedthyselffrom the fierceness of thine anger.",
        "4Turn us, O God of our salvation, and cause thineangertoward us to cease.",
        "5Wilt thou be angry with us for ever? wilt thou draw out thine anger to all generations?",
        "6Wilt thou not revive us again: that thy people may rejoice in thee?",
        "7Shew us thy mercy, OLord, and grant us thy salvation.",
        "8I will hear what God theLordwill speak: for he will speakpeaceunto his people, and to his saints: but let them not turnagainto folly.",
        "9Surely hissalvationisnigh them that fear him; that glory may dwell in our land.",
        "10Mercy and truth are met together; righteousness and peace have kissedeach other.",
        "11Truthshall spring out of theearth; and righteousness shall look down from heaven.",
        "12Yea, theLordshall givethat which isgood; and our land shall yield her increase.",
        "13Righteousness shall go before him; and shall setusin the way of his steps."
      ],
      "full_text": "1Lord, thou hast beenfavourableunto thy land: thou hast brought backthe captivity of Jacob. 2Thou hast forgiven the iniquity of thy people, thou hast covered all their sin.Selah. 3Thou hast taken away all thy wrath: thou hast turnedthyselffrom the fierceness of thine anger. 4Turn us, O God of our salvation, and cause thineangertoward us to cease. 5Wilt thou be angry with us for ever? wilt thou draw out thine anger to all generations? 6Wilt thou not revive us again: that thy people may rejoice in thee? 7Shew us thy mercy, OLord, and grant us thy salvation. 8I will hear what God theLordwill speak: for he will speakpeaceunto his people, and to his saints: but let them not turnagainto folly. 9Surely hissalvationisnigh them that fear him; that glory may dwell in our land. 10Mercy and truth are met together; righteousness and peace have kissedeach other. 11Truthshall spring out of theearth; and righteousness shall look down from heaven. 12Yea, theLordshall givethat which isgood; and our land shall yield her increase. 13Righteousness shall go before him; and shall setusin the way of his steps."
    },
    {
      "reference": "Psalms 86",
      "title": "Psalms 86",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ps/86?lang=eng",
      "summary": "David implores God for mercy and is saved from the lowest hellâThe Lord is good and generous in mercyâAll nations will worship before Him.",
      "verses": [
        "1Bow downthine ear, OLord, hear me: for Iampoorand needy.",
        "2Preserve mysoul; for Iamholy: O thou my God, save thy servant that trusteth in thee.",
        "3Be merciful unto me, O Lord: for I cry unto thee daily.",
        "4Rejoice the soul of thy servant: for unto thee, O Lord, do Ilift upmy soul.",
        "5For thou, Lord,artgood, and ready toforgive; and plenteous in mercy unto all them that call upon thee.",
        "6Give ear, OLord, unto my prayer; and attend to the voice of my supplications.",
        "7In the day of my trouble I willcallupon thee: for thou wilt answer me.",
        "8Among thegodsthere isnone like unto thee, O Lord; neitherare there any workslike unto thy works.",
        "9Allnationswhom thou hast made shallcomeand worship before thee, O Lord; and shall glorify thy name.",
        "10For thouartgreat, and doest wondrous things: thouartGod alone.",
        "11Teachme thy way, OLord; I will walk in thy truth: unite my heart to fear thy name.",
        "12I will praise thee, O Lord my God, with all my heart: and I will glorify thy name for evermore.",
        "13For greatisthy mercy toward me: and thou hastdeliveredmy soul from the lowest hell.",
        "14O God, theproudare risen against me, and the assemblies of violentmenhave sought after my soul; and have not set thee before them.",
        "15But thou, OLord,arta God full ofcompassion, and gracious, longsuffering, and plenteous inmercyand truth.",
        "16O turn unto me, and have mercy upon me; give thy strength unto thy servant, and save the son of thine handmaid.",
        "17Shew me a token for good; that they which hate me may seeit,and be ashamed: because thou,Lord, hast holpen me, and comforted me."
      ],
      "full_text": "1Bow downthine ear, OLord, hear me: for Iampoorand needy. 2Preserve mysoul; for Iamholy: O thou my God, save thy servant that trusteth in thee. 3Be merciful unto me, O Lord: for I cry unto thee daily. 4Rejoice the soul of thy servant: for unto thee, O Lord, do Ilift upmy soul. 5For thou, Lord,artgood, and ready toforgive; and plenteous in mercy unto all them that call upon thee. 6Give ear, OLord, unto my prayer; and attend to the voice of my supplications. 7In the day of my trouble I willcallupon thee: for thou wilt answer me. 8Among thegodsthere isnone like unto thee, O Lord; neitherare there any workslike unto thy works. 9Allnationswhom thou hast made shallcomeand worship before thee, O Lord; and shall glorify thy name. 10For thouartgreat, and doest wondrous things: thouartGod alone. 11Teachme thy way, OLord; I will walk in thy truth: unite my heart to fear thy name. 12I will praise thee, O Lord my God, with all my heart: and I will glorify thy name for evermore. 13For greatisthy mercy toward me: and thou hastdeliveredmy soul from the lowest hell. 14O God, theproudare risen against me, and the assemblies of violentmenhave sought after my soul; and have not set thee before them. 15But thou, OLord,arta God full ofcompassion, and gracious, longsuffering, and plenteous inmercyand truth. 16O turn unto me, and have mercy upon me; give thy strength unto thy servant, and save the son of thine handmaid. 17Shew me a token for good; that they which hate me may seeit,and be ashamed: because thou,Lord, hast holpen me, and comforted me."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:31:01",
  "metadata": {
    "week_number": 35,
    "title": "Week 35: August 24–30 - Psalms 49–51; 61–66; 69–72; 77–78; 85–86",
    "date_range": "August 24–30",
    "scraped_at": "2025-12-21T22:31:17.948727",
    "scraper_version": "2.0.0"
  }
}