{
  "week_number": 33,
  "date_range": "August 10–16",
  "title": "Week 33: August 10–16 - Job 1–3; 12–14; 19; 21–24; 38–40; 42",
  "bundle_title": "Week 33: August 10–16: \"Week 33: August 10–16 - Job 1–3; 12–14; 19; 21–24; 38–40; 42\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/33?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/33?lang=eng",
    "title": "Job 1–3;12–14;19;21–24;38–40;42",
    "scripture_references": "Job 1–3; 12–14; 19; 21–24; 38–40; 42",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“August 10–16. ‘Yet Will I Trust in Him’: Job 1–3; 12–14; 19; 21–24; 38–40; 42,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“August 10–16. ‘Yet Will I Trust in Him,’”Come, Follow Me: Old Testament 2026\n\nIt’s natural to wonder why bad things happen to good people—or, for that matter, why good things happen to bad people. Why would God, who is just, allow that? The book of Job explores questions like these. Job was one of those good people to whom a lot of bad things happened. Because of Job’s trials, his friends wondered if he really was good after all. Job asserted his own righteousness and wondered if God really is just after all. But despite his suffering and wondering, Job maintained his integrity and faith in Jesus Christ. In the book of Job, faith is questioned and tested but never completely abandoned. That doesn’t mean all the questions are answered. But the book of Job teaches that until they are answered, questions can coexist with faith. And regardless of what happens in the meantime, we can say of our Lord, “Yet will I trust in him” (Job 13:15).\n\nFor an overview of the book of Job, see “Job” in the Guide to the Scriptures (Gospel Library).",
    "learning_at_home_church": [
      {
        "title": "I can trust God in all circumstances.",
        "content": "The opening chapters of Job emphasize, in a poetic way, Satan’s role as our adversary or accuser; they don’t describe an actual interaction between God and Satan. As you read what Satan said about Job (seeJob 1:9–11;2:4–5), you might ask yourself, “Why do I remain faithful to God?” Why would it be dangerous to obey the Lord solely for the reason Satan suggested?\n\nWhat impresses you about Job’s responses to his trials? (seeJob 1:20–22;2:9–10).\n\nJob’s friends suggested that God was punishing him (seeJob 4–5;8;11). What problems do you see with this idea? Read Job’s response inchapters 12–13. What did Job know about God that enabled him to keep trusting? What do you know about God that helps you face challenges?\n\nJob 19"
      },
      {
        "title": "Jesus Christ is my Redeemer.",
        "content": "Sometimes we learn the most important truths during our most difficult times. Ponder the trials Job described inJob 19:1–22and the truths he proclaimed inverses 23–27. How do you know that your Redeemer lives? What difference does this knowledge make in your life?\n\nConsider singing or listening to a hymn about Jesus Christ, such as “I Know That My Redeemer Lives” (Hymns, no. 136). What words from this hymn express your feelings about Him?\n\nSee alsoDoctrine and Covenants 121:1–12;122.\n\nJob 21–24"
      },
      {
        "title": "“When he hath tried me, I shall come forth as gold.”",
        "content": "InJob 21–24, you’ll read a debate between Job and his friends. At the heart of this debate was a question many people have asked: Why do righteous people sometimes suffer?\n\nAlthough we don’t have all the answers, in the restored gospel of Jesus Christ, we have some truths that can help us make sense of adversity and suffering. Below are latter-day scriptures that contain some of these truths. What do these scriptures teach you about Heavenly Father and His plan?\n\n2 Nephi 2:11–13\n\nMosiah 23:21–23;24:10–16\n\nEther 12:27\n\nDoctrine and Covenants 58:3–5\n\nAbraham 3:22–26\n\nYou could also read President Spencer W. Kimball’s teachings about adversity in “Tragedy or Destiny?” (Teachings of Presidents of the Church: Spencer W. Kimball[2011]), 11–21).\n\nBased on what you have studied, how might you answer a question like “Why does God allow righteous people to suffer?”\n\nCalm and Stars, by Yongsung Kim. Image courtesy of havenlight.com\n\nJob 38–40;42"
      },
      {
        "title": "God’s perspective is greater than mine.",
        "content": "Frustrated with his friends’ accusations (seeJob 16:1–5;19:1–3), Job repeatedly asked God why he had to suffer so much (seeJob 19:6–7;23:1–9;31). The Lord did not give a clear reason in the book of Job. But He did teach an important message inchapters 38–40. How would you summarize that message? For example, what do you learn from the Lord’s questions inJob 38:1–7, 18–24?\n\nYou’ll notice that the Lord spoke to Job about some of His creations and other mighty works (seeJob 38–39). You might look at some of those creations (or pictures of them). How do these things help you think differently about God? about your trials? How did they change Job’s perspective? (seeJob 42:1–6; see alsoMoses 1:8–10).\n\nHere are two general conference messages that can help change our perspective: Tamara W. Runia, “Seeing God’s Family through the Overview Lens” (Liahona, Nov. 2023, 62–69); Russell M. Nelson, “Think Celestial!” (Liahona, Nov. 2023, 117–20). In either message, look for something that you’ll want to remember the next time your trials seem overwhelming. How will you remind yourself of what you learned?\n\nBe creative.Learning doesn’t have to consist only of reading, thinking, and talking. Sometimes the most memorable learning comes in physically active ways. For example, when you read about how the Lord changed Job’s perspective inJob 38–40, you might take a walk and look at some of the Lord’s creations, large and small. Or you might look at an object from different perspectives—from above, below, up close, far away, and so on.\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "Faith in Jesus Christ will help me during hard times.",
        "content": "Encourage your children to tell you what they know about Job. If they need help, you could point them toJob 1:1, 13–22;2:7–10or to “Job” (inOld Testament Stories, 145–47). How did Job respond to challenges? (seeJob 1:21;2:10).\n\nJob\n\nJob was faithful in his challenges because of what he knew about the Lord. Maybe you and your children could look at pictures of Jesus Christ interacting with others (such as the one below or pictures in theGospel Art Book). Talk about what you know about Him and what He is like. Here are some verses that show what Job knew about the Lord:Job 12:10, 13, 16;19:25–27. Why is it valuable to know these things about Him?\n\nHe Healed Them All, by Michael Malm\n\nJob 14:14"
      },
      {
        "title": "Because of Jesus Christ, I will live again after I die.",
        "content": "Job asked an important question inJob 14:14. Maybe you and your children could take turns sharing how you would answer Job. You could look for ideas inAlma 11:42–44, in the video “In a Coming Day” (Gospel Library), or in a song about the Resurrection, such as “Did Jesus Really Live Again?” (Children’s Songbook, 64).\n\n#BECAUSEofHIM: An Easter Message of Hope and Triumph\n\nJob 16:1–5;22:5"
      },
      {
        "title": "Good friends uplift and encourage each other.",
        "content": "When Job was sad, his friends said that God was punishing him because he had sinned (seeJob 22:5). If we were Job’s friends, how would we try to help him? How can our words help others when they are sad? (seeJob 16:5). Consider showing one or more of the pictures in this outline as you discuss these questions.\n\nConsider asking your children to list some qualities of a good friend and to name a friend who has these qualities. Then you could look at a picture of Jesus Christ. In what ways is Jesus a good friend to each of us? You might think of someone who’s going through a hard time. Plan how you will be a Christlike friend to them.\n\nJob 19:23–27"
      },
      {
        "title": "Jesus Christ is my Redeemer.",
        "content": "After readingJob 19:23–27, you and your children could talk about how you know that our Redeemer lives. You might work together to put your testimony (or drawings of the Savior) in a book (seeverse 23).\n\nYou could also sing a song that testifies of the Savior, such as “I Know That My Redeemer Lives” (Hymns, no. 136). Share phrases from the hymn that strengthen your faith in Him. Why is it important to know that Jesus Christ lives?\n\nFor more, see this month’s issue of theFriendmagazine.\n\nJob and His Friends, by Ilya Repin"
      }
    ],
    "study_helps": [],
    "raw_text": "August 10–16. “Yet Will I Trust in Him”: Job 1–3; 12–14; 19; 21–24; 38–40; 42\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nJuly 27–August 2\nEzra 1; 3–7; Nehemiah 2; 4–6; 8\nAugust 3–9\nEsther\nThoughts to Keep in Mind\nReading Poetry in the Old Testament\nAugust 10–16\nJob 1–3; 12–14; 19; 21–24; 38–40; 42\nAugust 17–23\nPsalms 1–2; 8; 19–33; 40; 46\nAugust 24–30\nPsalms 49–51; 61–66; 69–72; 77–78; 85–86\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nAugust 10–16. “Yet Will I Trust in Him”: Job 1–3; 12–14; 19; 21–24; 38–40; 42\n“August 10–16. ‘Yet Will I Trust in Him’: Job 1–3; 12–14; 19; 21–24; 38–40; 42,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“August 10–16. ‘Yet Will I Trust in Him,’”\nCome, Follow Me: Old Testament 2026\nThe Judgments of Job\n, by Joseph Brickey\nAugust 10–16: “Yet Will I Trust in Him”\nJob 1–3\n;\n12–14\n;\n19\n;\n21–24\n;\n38–40\n;\n42\nIt’s natural to wonder why bad things happen to good people—or, for that matter, why good things happen to bad people. Why would God, who is just, allow that? The book of Job explores questions like these. Job was one of those good people to whom a lot of bad things happened. Because of Job’s trials, his friends wondered if he really was good after all. Job asserted his own righteousness and wondered if God really is just after all. But despite his suffering and wondering, Job maintained his integrity and faith in Jesus Christ. In the book of Job, faith is questioned and tested but never completely abandoned. That doesn’t mean all the questions are answered. But the book of Job teaches that until they are answered, questions can coexist with faith. And regardless of what happens in the meantime, we can say of our Lord, “Yet will I trust in him” (\nJob 13:15\n).\nFor an overview of the book of Job, see “\nJob\n” in the Guide to the Scriptures (Gospel Library).\nIdeas for Learning at Home and at Church\nJob 1–3\n;\n12–13\nI can trust God in all circumstances.\nThe opening chapters of Job emphasize, in a poetic way, Satan’s role as our adversary or accuser; they don’t describe an actual interaction between God and Satan. As you read what Satan said about Job (see\nJob 1:9–11\n;\n2:4–5\n), you might ask yourself, “Why do I remain faithful to God?” Why would it be dangerous to obey the Lord solely for the reason Satan suggested?\nWhat impresses you about Job’s responses to his trials? (see\nJob 1:20–22\n;\n2:9–10\n).\nJob’s friends suggested that God was punishing him (see\nJob 4–5\n;\n8\n;\n11\n). What problems do you see with this idea? Read Job’s response in\nchapters 12–13\n. What did Job know about God that enabled him to keep trusting? What do you know about God that helps you face challenges?\nJob 19\nJesus Christ is my Redeemer.\nSometimes we learn the most important truths during our most difficult times. Ponder the trials Job described in\nJob 19:1–22\nand the truths he proclaimed in\nverses 23–27\n. How do you know that your Redeemer lives? What difference does this knowledge make in your life?\nConsider singing or listening to a hymn about Jesus Christ, such as “\nI Know That My Redeemer Lives\n” (\nHymns\n, no. 136). What words from this hymn express your feelings about Him?\nSee also\nDoctrine and Covenants 121:1–12\n;\n122\n.\nJob 21–24\n“When he hath tried me, I shall come forth as gold.”\nIn\nJob 21–24\n, you’ll read a debate between Job and his friends. At the heart of this debate was a question many people have asked: Why do righteous people sometimes suffer?\nAlthough we don’t have all the answers, in the restored gospel of Jesus Christ, we have some truths that can help us make sense of adversity and suffering. Below are latter-day scriptures that contain some of these truths. What do these scriptures teach you about Heavenly Father and His plan?\n2 Nephi 2:11–13\nMosiah 23:21–23\n;\n24:10–16\nEther 12:27\nDoctrine and Covenants 58:3–5\nAbraham 3:22–26\nYou could also read President Spencer W. Kimball’s teachings about adversity in “\nTragedy or Destiny?\n” (\nTeachings of Presidents of the Church: Spencer W. Kimball\n[2011]), 11–21).\nBased on what you have studied, how might you answer a question like “Why does God allow righteous people to suffer?”\nCalm and Stars\n, by Yongsung Kim. Image courtesy of havenlight.com\nJob 38–40\n;\n42\nGod’s perspective is greater than mine.\nFrustrated with his friends’ accusations (see\nJob 16:1–5\n;\n19:1–3\n), Job repeatedly asked God why he had to suffer so much (see\nJob 19:6–7\n;\n23:1–9\n;\n31\n). The Lord did not give a clear reason in the book of Job. But He did teach an important message in\nchapters 38–40\n. How would you summarize that message? For example, what do you learn from the Lord’s questions in\nJob 38:1–7, 18–24\n?\nYou’ll notice that the Lord spoke to Job about some of His creations and other mighty works (see\nJob 38–39\n). You might look at some of those creations (or pictures of them). How do these things help you think differently about God? about your trials? How did they change Job’s perspective? (see\nJob 42:1–6\n; see also\nMoses 1:8–10\n).\nHere are two general conference messages that can help change our perspective: Tamara W. Runia, “\nSeeing God’s Family through the Overview Lens\n” (\nLiahona\n, Nov. 2023, 62–69); Russell M. Nelson, “\nThink Celestial!\n” (\nLiahona\n, Nov. 2023, 117–20). In either message, look for something that you’ll want to remember the next time your trials seem overwhelming. How will you remind yourself of what you learned?\nBe creative.\nLearning doesn’t have to consist only of reading, thinking, and talking. Sometimes the most memorable learning comes in physically active ways. For example, when you read about how the Lord changed Job’s perspective in\nJob 38–40\n, you might take a walk and look at some of the Lord’s creations, large and small. Or you might look at an object from different perspectives—from above, below, up close, far away, and so on.\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nJob 1–2\n;\n12\n;\n19\nFaith in Jesus Christ will help me during hard times.\nEncourage your children to tell you what they know about Job. If they need help, you could point them to\nJob 1:1, 13–22\n;\n2:7–10\nor to “\nJob\n” (in\nOld Testament Stories\n, 145–47). How did Job respond to challenges? (see\nJob 1:21\n;\n2:10\n).\n1:55\nJob\nJob was faithful in his challenges because of what he knew about the Lord. Maybe you and your children could look at pictures of Jesus Christ interacting with others (such as the one below or pictures in the\nGospel Art Book\n). Talk about what you know about Him and what He is like. Here are some verses that show what Job knew about the Lord:\nJob 12:10, 13, 16\n;\n19:25–27\n. Why is it valuable to know these things about Him?\nHe Healed Them All\n, by Michael Malm\nJob 14:14\nBecause of Jesus Christ, I will live again after I die.\nJob asked an important question in\nJob 14:14\n. Maybe you and your children could take turns sharing how you would answer Job. You could look for ideas in\nAlma 11:42–44\n, in the video “In a Coming Day” (Gospel Library), or in a song about the Resurrection, such as “\nDid Jesus Really Live Again?\n” (\nChildren’s Songbook\n, 64).\n1:11\n#BECAUSEofHIM: An Easter Message of Hope and Triumph\nJob 16:1–5\n;\n22:5\nGood friends uplift and encourage each other.\nWhen Job was sad, his friends said that God was punishing him because he had sinned (see\nJob 22:5\n). If we were Job’s friends, how would we try to help him? How can our words help others when they are sad? (see\nJob 16:5\n). Consider showing one or more of the pictures in this outline as you discuss these questions.\nConsider asking your children to list some qualities of a good friend and to name a friend who has these qualities. Then you could look at a picture of Jesus Christ. In what ways is Jesus a good friend to each of us? You might think of someone who’s going through a hard time. Plan how you will be a Christlike friend to them.\nJob 19:23–27\nJesus Christ is my Redeemer.\nAfter reading\nJob 19:23–27\n, you and your children could talk about how you know that our Redeemer lives. You might work together to put your testimony (or drawings of the Savior) in a book (see\nverse 23\n).\nYou could also sing a song that testifies of the Savior, such as “\nI Know That My Redeemer Lives\n” (\nHymns\n, no. 136). Share phrases from the hymn that strengthen your faith in Him. Why is it important to know that Jesus Christ lives?\nFor more, see this month’s issue of the\nFriend\nmagazine.\nJob and His Friends\n, by Ilya Repin\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Job 1",
      "title": "The Book ofJob",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/1?lang=eng",
      "summary": "Job, a just and perfect man, is blessed with great richesâSatan obtains permission from the Lord to tempt and try JobâJobâs property and children are destroyed, and yet he praises and blesses the Lord.",
      "verses": [
        "1There was a man in the land ofUz, whose namewasJob; and that man wasperfectandupright, and one thatfearedGod, and eschewed evil.",
        "2And there were born unto him seven sons and three daughters.",
        "3His substance also was seven thousand sheep, and three thousand camels, and five hundred yoke of oxen, and five hundred she asses, and a very great household; so that this man was the greatest of all the men of the east.",
        "4And hissonswent and feastedin theirhouses, every one his day; and sent and called for their three sisters to eat and to drink with them.",
        "5And it was so, when the days oftheirfeasting were gone about, that Job sent and sanctified them, and rose up early in the morning, and offered burntofferingsaccordingto the number of them all: for Job said, It may be that mysonshave sinned, andcursedGod in their hearts. Thus did Job continually.",
        "6Â¶Now there was a day when thesonsof God came to present themselves before theLord, andSatancame also among them.",
        "7And theLordsaid unto Satan, Whence comest thou? Then Satan answered theLord, and said, From goingtoand fro in the earth, and from walking up and down in it.",
        "8And theLordsaid unto Satan, Hast thou considered myservantJob, thatthere isnone like him in the earth, a perfect and an upright man, one that feareth God, and escheweth evil?",
        "9Then Satan answered theLord, and said, Doth Job fear God for nought?",
        "10Hast not thou made an hedge about him, and about his house, and about all that he hath on every side? thou hast blessed the work of his hands, and his substance is increased in the land.",
        "11But put forth thinehandnow, and touch all that he hath, and he willcursethee to thy face.",
        "12And theLordsaid unto Satan, Behold, all that he hathisin thypower; only upon himself put not forth thine hand. So Satan went forth from the presence of theLord.",
        "13Â¶And there was a day when his sons and his daughterswereeating and drinking wine in their eldest brotherâs house:",
        "14And there came a messenger unto Job, and said, The oxen were plowing, and the asses feeding beside them:",
        "15And the Sabeans fellupon them,and took them away; yea, they have slain the servants with the edge of the sword; and I only am escaped alone to tell thee.",
        "16While hewasyet speaking, there came also another, and said, The fire of God is fallen from heaven, and hath burned up the sheep, and the servants, and consumed them; and I only am escaped alone to tell thee.",
        "17While hewasyet speaking, there came also another, and said, TheChaldeansmade out three bands, and fell upon the camels, and have carried them away, yea, and slain the servants with the edge of the sword; and I only am escaped alone to tell thee.",
        "18While hewasyet speaking, there came also another, and said, Thysonsand thy daughterswereeating and drinking wine in their eldest brotherâs house:",
        "19And, behold, there came a great wind from the wilderness, and smote the four corners of the house, and it fell upon the young men, and theyare dead; and I only am escaped alone to tell thee.",
        "20Then Job arose, andrenthis mantle, and shaved his head, and fell down upon the ground, and worshipped,",
        "21And said,Nakedcame I out of my motherâs womb, and naked shall I return thither: theLordgave, and theLordhathtakenaway;blessedbe the name of theLord.",
        "22In all this Jobsinnednot, nor charged God foolishly."
      ],
      "full_text": "1There was a man in the land ofUz, whose namewasJob; and that man wasperfectandupright, and one thatfearedGod, and eschewed evil. 2And there were born unto him seven sons and three daughters. 3His substance also was seven thousand sheep, and three thousand camels, and five hundred yoke of oxen, and five hundred she asses, and a very great household; so that this man was the greatest of all the men of the east. 4And hissonswent and feastedin theirhouses, every one his day; and sent and called for their three sisters to eat and to drink with them. 5And it was so, when the days oftheirfeasting were gone about, that Job sent and sanctified them, and rose up early in the morning, and offered burntofferingsaccordingto the number of them all: for Job said, It may be that mysonshave sinned, andcursedGod in their hearts. Thus did Job continually. 6Â¶Now there was a day when thesonsof God came to present themselves before theLord, andSatancame also among them. 7And theLordsaid unto Satan, Whence comest thou? Then Satan answered theLord, and said, From goingtoand fro in the earth, and from walking up and down in it. 8And theLordsaid unto Satan, Hast thou considered myservantJob, thatthere isnone like him in the earth, a perfect and an upright man, one that feareth God, and escheweth evil? 9Then Satan answered theLord, and said, Doth Job fear God for nought? 10Hast not thou made an hedge about him, and about his house, and about all that he hath on every side? thou hast blessed the work of his hands, and his substance is increased in the land. 11But put forth thinehandnow, and touch all that he hath, and he willcursethee to thy face. 12And theLordsaid unto Satan, Behold, all that he hathisin thypower; only upon himself put not forth thine hand. So Satan went forth from the presence of theLord. 13Â¶And there was a day when his sons and his daughterswereeating and drinking wine in their eldest brotherâs house: 14And there came a messenger unto Job, and said, The oxen were plowing, and the asses feeding beside them: 15And the Sabeans fellupon them,and took them away; yea, they have slain the servants with the edge of the sword; and I only am escaped alone to tell thee. 16While hewasyet speaking, there came also another, and said, The fire of God is fallen from heaven, and hath burned up the sheep, and the servants, and consumed them; and I only am escaped alone to tell thee. 17While hewasyet speaking, there came also another, and said, TheChaldeansmade out three bands, and fell upon the camels, and have carried them away, yea, and slain the servants with the edge of the sword; and I only am escaped alone to tell thee. 18While hewasyet speaking, there came also another, and said, Thysonsand thy daughterswereeating and drinking wine in their eldest brotherâs house: 19And, behold, there came a great wind from the wilderness, and smote the four corners of the house, and it fell upon the young men, and theyare dead; and I only am escaped alone to tell thee. 20Then Job arose, andrenthis mantle, and shaved his head, and fell down upon the ground, and worshipped, 21And said,Nakedcame I out of my motherâs womb, and naked shall I return thither: theLordgave, and theLordhathtakenaway;blessedbe the name of theLord. 22In all this Jobsinnednot, nor charged God foolishly."
    },
    {
      "reference": "Job 2",
      "title": "Job 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/2?lang=eng",
      "summary": "Satan obtains permission from the Lord to afflict Job physicallyâJob is smitten with boilsâEliphaz, Bildad, and Zophar come to comfort him.",
      "verses": [
        "1Again there was a day when thesonsof God came to present themselves before theLord, andSatancame also among them to present himself before theLord.",
        "2And theLordsaid unto Satan, From whence comest thou? And Satan answered theLord, and said, From going to and fro in the earth, and from walking up and down in it.",
        "3And theLordsaid unto Satan, Hast thou considered my servant Job, thatthere isnone like him in the earth, aperfectand an upright man, one that feareth God, andeschewethevil? and still heholdethfast hisintegrity, although thou movedst me against him, to destroy him without cause.",
        "4And Satan answered theLord, and said, Skin for skin, yea, all that a man hath will he give for hislife.",
        "5But put forth thine hand now, and touch his bone and his flesh, and he willcursethee to thy face.",
        "6And theLordsaid unto Satan, Behold, heisin thinehand; but save his life.",
        "7Â¶So went Satan forth from the presence of theLord, and smote Job withsoreboilsfrom the sole of his foot unto his crown.",
        "8And he took him a potsherd to scrape himself withal; and he sat down among theashes.",
        "9Â¶Then said his wife unto him, Dost thou stillretainthineintegrity?curseGod, and die.",
        "10But he said unto her, Thou speakest as one of the foolish women speaketh. What? shall we receivegoodat the hand of God, and shall we not receiveevil? In all this did not Jobsinwith his lips.",
        "11Â¶Now when Jobâs threefriendsheard of all this evil that was come upon him, they came every one from his own place; Eliphaz the Temanite, and Bildad the Shuhite, and Zophar the Naamathite: for they had made an appointment together to come to mourn with him and to comfort him.",
        "12And when they lifted up their eyes afar off, and knew him not, they lifted up their voice, and wept; and they rent every one his mantle, and sprinkled dust upon their heads toward heaven.",
        "13So they sat down with him upon the groundsevendays and seven nights, and none spake a word unto him: for they saw thathisgriefwas very great."
      ],
      "full_text": "1Again there was a day when thesonsof God came to present themselves before theLord, andSatancame also among them to present himself before theLord. 2And theLordsaid unto Satan, From whence comest thou? And Satan answered theLord, and said, From going to and fro in the earth, and from walking up and down in it. 3And theLordsaid unto Satan, Hast thou considered my servant Job, thatthere isnone like him in the earth, aperfectand an upright man, one that feareth God, andeschewethevil? and still heholdethfast hisintegrity, although thou movedst me against him, to destroy him without cause. 4And Satan answered theLord, and said, Skin for skin, yea, all that a man hath will he give for hislife. 5But put forth thine hand now, and touch his bone and his flesh, and he willcursethee to thy face. 6And theLordsaid unto Satan, Behold, heisin thinehand; but save his life. 7Â¶So went Satan forth from the presence of theLord, and smote Job withsoreboilsfrom the sole of his foot unto his crown. 8And he took him a potsherd to scrape himself withal; and he sat down among theashes. 9Â¶Then said his wife unto him, Dost thou stillretainthineintegrity?curseGod, and die. 10But he said unto her, Thou speakest as one of the foolish women speaketh. What? shall we receivegoodat the hand of God, and shall we not receiveevil? In all this did not Jobsinwith his lips. 11Â¶Now when Jobâs threefriendsheard of all this evil that was come upon him, they came every one from his own place; Eliphaz the Temanite, and Bildad the Shuhite, and Zophar the Naamathite: for they had made an appointment together to come to mourn with him and to comfort him. 12And when they lifted up their eyes afar off, and knew him not, they lifted up their voice, and wept; and they rent every one his mantle, and sprinkled dust upon their heads toward heaven. 13So they sat down with him upon the groundsevendays and seven nights, and none spake a word unto him: for they saw thathisgriefwas very great."
    },
    {
      "reference": "Job 3",
      "title": "Job 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/3?lang=eng",
      "summary": "Job curses the circumstances of his birthâHe asks, Why died I not from the womb?",
      "verses": [
        "1After this opened Job his mouth, andcursedhis day.",
        "2And Job spake, and said,",
        "3Let the dayperishwherein I wasborn, and the nightin whichit was said, There is a man child conceived.",
        "4Let that day be darkness; let not God regard it from above, neither let the light shine upon it.",
        "5Let darkness and theshadow of deathstain it; let a cloud dwell upon it; let the blackness of the day terrify it.",
        "6As forthat night, let darkness seize upon it; let it not be joined unto the days of the year, let it not come into the number of the months.",
        "7Lo, let that night be solitary, let no joyful voice come therein.",
        "8Let them curse it that curse the day, who are ready to raise up their mourning.",
        "9Let the stars of the twilight thereof be dark; let it look for light, buthavenone; neither let it see the dawning of the day:",
        "10Because it shut not up the doors of mymotherâswomb, nor hid sorrow from mine eyes.",
        "11WhydiedI not from the womb?whydid Inotgive up the ghost when I came out of the belly?",
        "12Why did the kneespreventme? or why the breasts that I should suck?",
        "13For now should I have lain still and been quiet, I should have slept: then had I been at rest,",
        "14With kings and counsellors of the earth,which built desolate placesfor themselves;",
        "15Or with princes that had gold, who filled their houses with silver:",
        "16Or as an hidden untimely birth I had not been; as infantswhichnever saw light.",
        "17There the wicked ceasefromtroubling; and there the weary be atrest.",
        "18Therethe prisoners rest together; they hear not the voice of the oppressor.",
        "19The small and great are there; and the servantisfree from his master.",
        "20Wherefore islightgiven to him that is inmisery, and life unto the bitterinsoul;",
        "21Which long fordeath, but itcomethnot; and dig for it more than for hid treasures;",
        "22Which rejoice exceedingly,andare glad, when they can find the grave?",
        "23Why is light givento a man whose way is hid, and whom God hath hedged in?",
        "24For my sighing cometh before I eat, and my roarings are poured out like the waters.",
        "25For the thing which I greatly feared is come upon me, and that which I was afraid of is come unto me.",
        "26I was not in safety, neither had I rest, neither was I quiet; yet trouble came."
      ],
      "full_text": "1After this opened Job his mouth, andcursedhis day. 2And Job spake, and said, 3Let the dayperishwherein I wasborn, and the nightin whichit was said, There is a man child conceived. 4Let that day be darkness; let not God regard it from above, neither let the light shine upon it. 5Let darkness and theshadow of deathstain it; let a cloud dwell upon it; let the blackness of the day terrify it. 6As forthat night, let darkness seize upon it; let it not be joined unto the days of the year, let it not come into the number of the months. 7Lo, let that night be solitary, let no joyful voice come therein. 8Let them curse it that curse the day, who are ready to raise up their mourning. 9Let the stars of the twilight thereof be dark; let it look for light, buthavenone; neither let it see the dawning of the day: 10Because it shut not up the doors of mymotherâswomb, nor hid sorrow from mine eyes. 11WhydiedI not from the womb?whydid Inotgive up the ghost when I came out of the belly? 12Why did the kneespreventme? or why the breasts that I should suck? 13For now should I have lain still and been quiet, I should have slept: then had I been at rest, 14With kings and counsellors of the earth,which built desolate placesfor themselves; 15Or with princes that had gold, who filled their houses with silver: 16Or as an hidden untimely birth I had not been; as infantswhichnever saw light. 17There the wicked ceasefromtroubling; and there the weary be atrest. 18Therethe prisoners rest together; they hear not the voice of the oppressor. 19The small and great are there; and the servantisfree from his master. 20Wherefore islightgiven to him that is inmisery, and life unto the bitterinsoul; 21Which long fordeath, but itcomethnot; and dig for it more than for hid treasures; 22Which rejoice exceedingly,andare glad, when they can find the grave? 23Why is light givento a man whose way is hid, and whom God hath hedged in? 24For my sighing cometh before I eat, and my roarings are poured out like the waters. 25For the thing which I greatly feared is come upon me, and that which I was afraid of is come unto me. 26I was not in safety, neither had I rest, neither was I quiet; yet trouble came."
    },
    {
      "reference": "Job 12",
      "title": "Job 12",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/12?lang=eng",
      "summary": "Job says, The souls of all things are in the hands of the Lord, with the ancient is wisdom, and the Lord governs in all things.",
      "verses": [
        "1And Job answered and said,",
        "2No doubt but yearethe people, and wisdom shall die with you.",
        "3But I have understanding as well as you; Iamnot inferior to you: yea, who knoweth not such things as these?",
        "4I amasonemockedof his neighbour, who calleth upon God, and he answereth him: the just uprightman islaughed to scorn.",
        "5He that is ready to slip withhisfeetis asa lamp despised in the thought of him that is at ease.",
        "6Thetabernaclesof robbersprosper, and they that provoke God are secure; into whose hand God bringethabundantly.",
        "7But ask now the beasts, and they shall teach thee; and the fowls of the air, and they shall tell thee:",
        "8Or speak to theearth, and it shall teach thee: and the fishes of the sea shall declare unto thee.",
        "9Who knoweth not in all these that the hand of theLordhath wrought this?",
        "10In whose handisthe soul of everylivingthing, and thebreathof all mankind.",
        "11Doth not the ear try words? and the mouth taste his meat?",
        "12With theancientiswisdom; and in length of days understanding.",
        "13With himiswisdomandstrength, he hath counsel and understanding.",
        "14Behold, he breaketh down, and it cannot be built again: he shutteth up a man, and there can be no opening.",
        "15Behold, hewithholdeththe waters, and they dry up: also he sendeth them out, and they overturn the earth.",
        "16With himisstrength and wisdom: the deceived and the deceiverarehis.",
        "17He leadeth counsellors away spoiled, and maketh the judges fools.",
        "18He looseth the bond of kings, and girdeth their loins with a girdle.",
        "19He leadeth princes away spoiled, and overthroweth the mighty.",
        "20He removeth away the speech of the trusty, and taketh away the understanding of the aged.",
        "21He poureth contempt uponprinces, and weakeneth the strength of the mighty.",
        "22He discovereth deep things out of darkness, and bringeth out to light the shadow of death.",
        "23He increaseth the nations, and destroyeth them: he enlargeth the nations, and straiteneth themagain.",
        "24He taketh away the heart ofthe chief of the people of the earth, and causeth them towanderin a wildernesswhere there isno way.",
        "25They grope in the dark without light, and he maketh them to stagger likeadrunkenman."
      ],
      "full_text": "1And Job answered and said, 2No doubt but yearethe people, and wisdom shall die with you. 3But I have understanding as well as you; Iamnot inferior to you: yea, who knoweth not such things as these? 4I amasonemockedof his neighbour, who calleth upon God, and he answereth him: the just uprightman islaughed to scorn. 5He that is ready to slip withhisfeetis asa lamp despised in the thought of him that is at ease. 6Thetabernaclesof robbersprosper, and they that provoke God are secure; into whose hand God bringethabundantly. 7But ask now the beasts, and they shall teach thee; and the fowls of the air, and they shall tell thee: 8Or speak to theearth, and it shall teach thee: and the fishes of the sea shall declare unto thee. 9Who knoweth not in all these that the hand of theLordhath wrought this? 10In whose handisthe soul of everylivingthing, and thebreathof all mankind. 11Doth not the ear try words? and the mouth taste his meat? 12With theancientiswisdom; and in length of days understanding. 13With himiswisdomandstrength, he hath counsel and understanding. 14Behold, he breaketh down, and it cannot be built again: he shutteth up a man, and there can be no opening. 15Behold, hewithholdeththe waters, and they dry up: also he sendeth them out, and they overturn the earth. 16With himisstrength and wisdom: the deceived and the deceiverarehis. 17He leadeth counsellors away spoiled, and maketh the judges fools. 18He looseth the bond of kings, and girdeth their loins with a girdle. 19He leadeth princes away spoiled, and overthroweth the mighty. 20He removeth away the speech of the trusty, and taketh away the understanding of the aged. 21He poureth contempt uponprinces, and weakeneth the strength of the mighty. 22He discovereth deep things out of darkness, and bringeth out to light the shadow of death. 23He increaseth the nations, and destroyeth them: he enlargeth the nations, and straiteneth themagain. 24He taketh away the heart ofthe chief of the people of the earth, and causeth them towanderin a wildernesswhere there isno way. 25They grope in the dark without light, and he maketh them to stagger likeadrunkenman."
    },
    {
      "reference": "Job 13",
      "title": "Job 13",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/13?lang=eng",
      "summary": "Job testifies of his confidence in the Lord and says, Though He slay me, yet will I trust in Him, and He also will be my salvation.",
      "verses": [
        "1Lo, mine eye hath seen allthis,mine ear hath heard and understood it.",
        "2What ye know,the samedo I know also: Iamnot inferior unto you.",
        "3Surely I would speak to the Almighty, and I desire to reason with God.",
        "4But yeareforgers of lies, yeareallphysiciansof no value.",
        "5O that ye would altogetherholdyour peace! and it should be your wisdom.",
        "6Hear now my reasoning, and hearken to the pleadings of my lips.",
        "7Will ye speak wickedly for God? and talk deceitfully for him?",
        "8Will ye accept his person? will ye contend for God?",
        "9Is it good that he should search you out? or as one man mocketh another, do yesomock him?",
        "10He will surely reprove you, if ye do secretly accept persons.",
        "11Shall not his excellency make you afraid? and his dread fall upon you?",
        "12Your remembrancesarelike unto ashes, your bodies to bodies of clay.",
        "13Hold your peace, let me alone, that I may speak, and let come on me whatwill.",
        "14Wherefore do I take my flesh in my teeth, and put my life in mine hand?",
        "15Though heslayme, yet will Itrustin him: but I will maintain mine own ways before him.",
        "16He alsoshall bemy salvation: for anhypocriteshall not come before him.",
        "17Hear diligently my speech, and my declaration with your ears.",
        "18Behold now, I have orderedmycause; I know that I shall bejustified.",
        "19Whoishethatwillpleadwith me? for now, if I hold my tongue, I shall give up the ghost.",
        "20Only do not twothingsunto me: then will I not hide myself from thee.",
        "21Withdraw thine hand far from me: and let not thy dread make me afraid.",
        "22Then call thou, and I will answer: or let me speak, and answer thou me.",
        "23How manyaremine iniquities and sins? make me toknowmy transgression and my sin.",
        "24Wherefore hidest thou thy face, and holdest me for thine enemy?",
        "25Wilt thou break a leaf driven to and fro? and wilt thou pursue the dry stubble?",
        "26For thou writest bitter things against me, and makest me to possess theiniquitiesof my youth.",
        "27Thou puttest my feet also in the stocks, and lookest narrowly unto all my paths; thou settest a print upon the heels of my feet.",
        "28And he, as a rotten thing, consumeth, as a garment that is moth eaten."
      ],
      "full_text": "1Lo, mine eye hath seen allthis,mine ear hath heard and understood it. 2What ye know,the samedo I know also: Iamnot inferior unto you. 3Surely I would speak to the Almighty, and I desire to reason with God. 4But yeareforgers of lies, yeareallphysiciansof no value. 5O that ye would altogetherholdyour peace! and it should be your wisdom. 6Hear now my reasoning, and hearken to the pleadings of my lips. 7Will ye speak wickedly for God? and talk deceitfully for him? 8Will ye accept his person? will ye contend for God? 9Is it good that he should search you out? or as one man mocketh another, do yesomock him? 10He will surely reprove you, if ye do secretly accept persons. 11Shall not his excellency make you afraid? and his dread fall upon you? 12Your remembrancesarelike unto ashes, your bodies to bodies of clay. 13Hold your peace, let me alone, that I may speak, and let come on me whatwill. 14Wherefore do I take my flesh in my teeth, and put my life in mine hand? 15Though heslayme, yet will Itrustin him: but I will maintain mine own ways before him. 16He alsoshall bemy salvation: for anhypocriteshall not come before him. 17Hear diligently my speech, and my declaration with your ears. 18Behold now, I have orderedmycause; I know that I shall bejustified. 19Whoishethatwillpleadwith me? for now, if I hold my tongue, I shall give up the ghost. 20Only do not twothingsunto me: then will I not hide myself from thee. 21Withdraw thine hand far from me: and let not thy dread make me afraid. 22Then call thou, and I will answer: or let me speak, and answer thou me. 23How manyaremine iniquities and sins? make me toknowmy transgression and my sin. 24Wherefore hidest thou thy face, and holdest me for thine enemy? 25Wilt thou break a leaf driven to and fro? and wilt thou pursue the dry stubble? 26For thou writest bitter things against me, and makest me to possess theiniquitiesof my youth. 27Thou puttest my feet also in the stocks, and lookest narrowly unto all my paths; thou settest a print upon the heels of my feet. 28And he, as a rotten thing, consumeth, as a garment that is moth eaten."
    },
    {
      "reference": "Job 14",
      "title": "Job 14",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/14?lang=eng",
      "summary": "Job testifies of the shortness of life, the certainty of death, and the guarantee of a resurrectionâHe asks, If a man die, will he live again?âJob answers that he will await the Lordâs call to come forth from the grave.",
      "verses": [
        "1Manthat isborn of a womanisof few days, and full of trouble.",
        "2He cometh forth like a flower, and iscutdown: he fleeth also as a shadow, and continueth not.",
        "3And dost thou open thine eyes upon such an one, and bringest me into judgment with thee?",
        "4Who can bring a cleanthingout of anunclean? not one.",
        "5Seeing hisdaysaredetermined, the number of his monthsarewith thee, thou hast appointed hisboundsthat he cannot pass;",
        "6Turn from him, that he may rest, till he shall accomplish, as anhireling, his day.",
        "7For there is hope of a tree, if it be cut down, that it will sprout again, and that the tender branch thereof will not cease.",
        "8Though the root thereof wax old in the earth, and the stock thereof die in the ground;",
        "9Yetthrough the scent of water it will bud, and bring forth boughs like a plant.",
        "10But mandieth, and wasteth away: yea, man giveth up the ghost, and whereishe?",
        "11Asthe waters fail from the sea, and the flood decayeth and drieth up:",
        "12So man lieth down, and riseth not: till the heavensbeno more, they shall not awake, nor be raised out of their sleep.",
        "13O that thou wouldest hide me in the grave, that thou wouldest keep me secret, until thy wrath be past, that thou wouldest appoint me a set time, and remember me!",
        "14If a man die, shall heliveagain?all the days of my appointed time will I wait, till my change come.",
        "15Thou shalt call, and I will answer thee: thou wilt have a desire to the work of thine hands.",
        "16For now thou numberest my steps: dost thou not watch over my sin?",
        "17My transgressionissealed up in a bag, and thou sewest up mine iniquity.",
        "18And surely the mountain falling cometh to nought, and the rock is removed out of his place.",
        "19The waters wear the stones: thou washest away the things which growoutof the dust of the earth; and thou destroyest the hope of man.",
        "20Thou prevailest for ever against him, and he passeth: thou changest his countenance, and sendest him away.",
        "21His sons come to honour, and he knowethitnot; and they are brought low, but he perceivethitnot of them.",
        "22But his flesh upon him shall havepain, and his soul within him shall mourn."
      ],
      "full_text": "1Manthat isborn of a womanisof few days, and full of trouble. 2He cometh forth like a flower, and iscutdown: he fleeth also as a shadow, and continueth not. 3And dost thou open thine eyes upon such an one, and bringest me into judgment with thee? 4Who can bring a cleanthingout of anunclean? not one. 5Seeing hisdaysaredetermined, the number of his monthsarewith thee, thou hast appointed hisboundsthat he cannot pass; 6Turn from him, that he may rest, till he shall accomplish, as anhireling, his day. 7For there is hope of a tree, if it be cut down, that it will sprout again, and that the tender branch thereof will not cease. 8Though the root thereof wax old in the earth, and the stock thereof die in the ground; 9Yetthrough the scent of water it will bud, and bring forth boughs like a plant. 10But mandieth, and wasteth away: yea, man giveth up the ghost, and whereishe? 11Asthe waters fail from the sea, and the flood decayeth and drieth up: 12So man lieth down, and riseth not: till the heavensbeno more, they shall not awake, nor be raised out of their sleep. 13O that thou wouldest hide me in the grave, that thou wouldest keep me secret, until thy wrath be past, that thou wouldest appoint me a set time, and remember me! 14If a man die, shall heliveagain?all the days of my appointed time will I wait, till my change come. 15Thou shalt call, and I will answer thee: thou wilt have a desire to the work of thine hands. 16For now thou numberest my steps: dost thou not watch over my sin? 17My transgressionissealed up in a bag, and thou sewest up mine iniquity. 18And surely the mountain falling cometh to nought, and the rock is removed out of his place. 19The waters wear the stones: thou washest away the things which growoutof the dust of the earth; and thou destroyest the hope of man. 20Thou prevailest for ever against him, and he passeth: thou changest his countenance, and sendest him away. 21His sons come to honour, and he knowethitnot; and they are brought low, but he perceivethitnot of them. 22But his flesh upon him shall havepain, and his soul within him shall mourn."
    },
    {
      "reference": "Job 19",
      "title": "Job 19",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/19?lang=eng",
      "summary": "Job tells of the ills that have befallen him and then testifies, I know that my Redeemer livesâJob prophesies that he will be resurrected and that in his flesh he will see God.",
      "verses": [
        "1Then Job answered and said,",
        "2How long will ye vex my soul, and break me in pieces with words?",
        "3These ten times have ye reproached me: ye are not ashamedthatye make yourselves strange to me.",
        "4And be it indeedthatI have erred, mine error remaineth with myself.",
        "5If indeed ye will magnifyyourselvesagainst me, and plead against me my reproach:",
        "6Know now that God hath overthrown me, and hath compassed me with his net.",
        "7Behold, I cry out of wrong, but I am not heard: I cry aloud, butthere isnojudgment.",
        "8He hath fenced up my way that I cannot pass, and he hath set darkness in my paths.",
        "9He hath stripped me of my glory, and taken the crownfrommy head.",
        "10He hath destroyed me on every side, and I am gone: and mine hope hath he removed like a tree.",
        "11He hath also kindled his wrath against me, and he counteth me unto him asone ofhis enemies.",
        "12His troops come together, and raise up their way against me, and encamp round about mytabernacle.",
        "13He hath put my brethren far from me, and mine acquaintance are verily estranged from me.",
        "14My kinsfolk have failed, and my familiar friends haveforgottenme.",
        "15They that dwell in mine house, and my maids, count me for a stranger: I am an alien in their sight.",
        "16I called my servant, and he gavemeno answer; I entreated him with my mouth.",
        "17Mybreathis strange to my wife, though I entreated for the childrenâssakeof mine own body.",
        "18Yea, young children despised me; I arose, and they spake against me.",
        "19All myinwardfriends abhorred me: and they whom I loved are turned against me.",
        "20My bone cleaveth to my skin and to my flesh, and I am escaped with the skin of my teeth.",
        "21Have pity upon me, have pity upon me, O ye myfriends; for thehandof God hath touched me.",
        "22Why do ye persecute me as God, and are not satisfied withmy flesh?",
        "23Oh that my words were now written! oh that they were printed in a book!",
        "24That they were graven with an iron pen and lead in the rock for ever!",
        "25For Iknowthatmyredeemerliveth, andthatheshallstandat the latterdayupon the earth:",
        "26Andthoughafter my skinwormsdestroy thisbody,yet in myfleshshall IseeGod:",
        "27Whom I shall see for myself, and mine eyes shall behold, and not another;thoughmy reins be consumed within me.",
        "28But ye should say, Why persecute we him, seeing the root of the matter is found in me?",
        "29Be ye afraid of the sword: for wrathbringeththe punishments of the sword, that ye may knowthere isa judgment."
      ],
      "full_text": "1Then Job answered and said, 2How long will ye vex my soul, and break me in pieces with words? 3These ten times have ye reproached me: ye are not ashamedthatye make yourselves strange to me. 4And be it indeedthatI have erred, mine error remaineth with myself. 5If indeed ye will magnifyyourselvesagainst me, and plead against me my reproach: 6Know now that God hath overthrown me, and hath compassed me with his net. 7Behold, I cry out of wrong, but I am not heard: I cry aloud, butthere isnojudgment. 8He hath fenced up my way that I cannot pass, and he hath set darkness in my paths. 9He hath stripped me of my glory, and taken the crownfrommy head. 10He hath destroyed me on every side, and I am gone: and mine hope hath he removed like a tree. 11He hath also kindled his wrath against me, and he counteth me unto him asone ofhis enemies. 12His troops come together, and raise up their way against me, and encamp round about mytabernacle. 13He hath put my brethren far from me, and mine acquaintance are verily estranged from me. 14My kinsfolk have failed, and my familiar friends haveforgottenme. 15They that dwell in mine house, and my maids, count me for a stranger: I am an alien in their sight. 16I called my servant, and he gavemeno answer; I entreated him with my mouth. 17Mybreathis strange to my wife, though I entreated for the childrenâssakeof mine own body. 18Yea, young children despised me; I arose, and they spake against me. 19All myinwardfriends abhorred me: and they whom I loved are turned against me. 20My bone cleaveth to my skin and to my flesh, and I am escaped with the skin of my teeth. 21Have pity upon me, have pity upon me, O ye myfriends; for thehandof God hath touched me. 22Why do ye persecute me as God, and are not satisfied withmy flesh? 23Oh that my words were now written! oh that they were printed in a book! 24That they were graven with an iron pen and lead in the rock for ever! 25For Iknowthatmyredeemerliveth, andthatheshallstandat the latterdayupon the earth: 26Andthoughafter my skinwormsdestroy thisbody,yet in myfleshshall IseeGod: 27Whom I shall see for myself, and mine eyes shall behold, and not another;thoughmy reins be consumed within me. 28But ye should say, Why persecute we him, seeing the root of the matter is found in me? 29Be ye afraid of the sword: for wrathbringeththe punishments of the sword, that ye may knowthere isa judgment."
    },
    {
      "reference": "Job 21",
      "title": "Job 21",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/21?lang=eng",
      "summary": "Job admits that the wicked sometimes prosper in this lifeâThen he testifies that their judgment will be hereafter in the day of wrath and destruction.",
      "verses": [
        "1But Job answered and said,",
        "2Hear diligently my speech, and let this be your consolations.",
        "3Suffer me that I may speak; and after that I have spoken,mockon.",
        "4As for me,ismy complaint to man? and ifit were so,why should not my spirit be troubled?",
        "5Mark me, and be astonished, and layyourhanduponyourmouth.",
        "6Even when I remember I am afraid, and trembling taketh hold on my flesh.",
        "7Wherefore do the wicked live, become old, yea, aremightyin power?",
        "8Their seed is established in their sight with them, and their offspring before their eyes.",
        "9Their housesaresafe from fear, neitheristhe rod of God upon them.",
        "10Their bull gendereth, and faileth not; their cow calveth, and casteth not her calf.",
        "11They send forth their little ones like a flock, and their children dance.",
        "12They take the timbrel and harp, and rejoice at the sound of theorgan.",
        "13They spend their days in wealth, and in a moment go down to the grave.",
        "14Therefore they say unto God, Depart from us; for we desire not the knowledge of thy ways.",
        "15Whatisthe Almighty, that we should serve him? and what profit should we have, if we pray unto him?",
        "16Lo, their goodisnot in their hand: the counsel of the wicked is far from me.",
        "17How oft is the candle of the wicked put out! andhow oftcometh their destruction upon them!Goddistributeth sorrows in his anger.",
        "18They are as stubble before the wind, and aschaffthat the storm carrieth away.",
        "19God layeth up his iniquity for his children: herewardethhim, and he shall knowit.",
        "20His eyes shall see his destruction, and he shalldrinkof the wrath of the Almighty.",
        "21For what pleasurehathhe in his house after him, when the number of his months is cut off in the midst?",
        "22ShallanyteachGodknowledge? seeing he judgeth those that are high.",
        "23One dieth in his full strength, being wholly at ease and quiet.",
        "24His breasts are full of milk, and his bones are moistened with marrow.",
        "25And another dieth in the bitterness of his soul, and never eateth with pleasure.",
        "26They shall lie down alike in thedust, and the worms shall cover them.",
        "27Behold, I know your thoughts, and the deviceswhichye wrongfully imagine against me.",
        "28For ye say, Whereisthe house of the prince? and wherearethe dwelling places of the wicked?",
        "29Have ye not asked them that go by the way? and do ye not know their tokens,",
        "30That the wicked is reserved to the day of destruction? they shall be brought forth to the day of wrath.",
        "31Who shall declare his way to his face? and who shallrepayhimwhathe hath done?",
        "32Yet shall he be brought to the grave, and shall remain in the tomb.",
        "33The clods of the valley shall be sweet unto him, and every man shall draw after him, asthere areinnumerable before him.",
        "34How then comfort ye me in vain, seeing in your answers there remainethfalsehood?"
      ],
      "full_text": "1But Job answered and said, 2Hear diligently my speech, and let this be your consolations. 3Suffer me that I may speak; and after that I have spoken,mockon. 4As for me,ismy complaint to man? and ifit were so,why should not my spirit be troubled? 5Mark me, and be astonished, and layyourhanduponyourmouth. 6Even when I remember I am afraid, and trembling taketh hold on my flesh. 7Wherefore do the wicked live, become old, yea, aremightyin power? 8Their seed is established in their sight with them, and their offspring before their eyes. 9Their housesaresafe from fear, neitheristhe rod of God upon them. 10Their bull gendereth, and faileth not; their cow calveth, and casteth not her calf. 11They send forth their little ones like a flock, and their children dance. 12They take the timbrel and harp, and rejoice at the sound of theorgan. 13They spend their days in wealth, and in a moment go down to the grave. 14Therefore they say unto God, Depart from us; for we desire not the knowledge of thy ways. 15Whatisthe Almighty, that we should serve him? and what profit should we have, if we pray unto him? 16Lo, their goodisnot in their hand: the counsel of the wicked is far from me. 17How oft is the candle of the wicked put out! andhow oftcometh their destruction upon them!Goddistributeth sorrows in his anger. 18They are as stubble before the wind, and aschaffthat the storm carrieth away. 19God layeth up his iniquity for his children: herewardethhim, and he shall knowit. 20His eyes shall see his destruction, and he shalldrinkof the wrath of the Almighty. 21For what pleasurehathhe in his house after him, when the number of his months is cut off in the midst? 22ShallanyteachGodknowledge? seeing he judgeth those that are high. 23One dieth in his full strength, being wholly at ease and quiet. 24His breasts are full of milk, and his bones are moistened with marrow. 25And another dieth in the bitterness of his soul, and never eateth with pleasure. 26They shall lie down alike in thedust, and the worms shall cover them. 27Behold, I know your thoughts, and the deviceswhichye wrongfully imagine against me. 28For ye say, Whereisthe house of the prince? and wherearethe dwelling places of the wicked? 29Have ye not asked them that go by the way? and do ye not know their tokens, 30That the wicked is reserved to the day of destruction? they shall be brought forth to the day of wrath. 31Who shall declare his way to his face? and who shallrepayhimwhathe hath done? 32Yet shall he be brought to the grave, and shall remain in the tomb. 33The clods of the valley shall be sweet unto him, and every man shall draw after him, asthere areinnumerable before him. 34How then comfort ye me in vain, seeing in your answers there remainethfalsehood?"
    },
    {
      "reference": "Job 22",
      "title": "Job 22",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/22?lang=eng",
      "summary": "Eliphaz accuses Job of various sins and exhorts him to repent.",
      "verses": [
        "1Then Eliphaz the Temanite answered and said,",
        "2Can a man be profitable unto God, as he that is wise may be profitable unto himself?",
        "3Is itany pleasure to the Almighty, that thou artrighteous? oris itgainto him,that thou makest thy waysperfect?",
        "4Will he reprove thee for fear of thee? will he enter with thee into judgment?",
        "5Isnot thy wickedness great? and thine iniquities infinite?",
        "6For thou hast taken a pledge from thy brother for nought, and stripped the naked of their clothing.",
        "7Thou hast not given water to the weary to drink, and thou hast withholdenbreadfrom thehungry.",
        "8Butas forthe mighty man, he had the earth; and the honourable man dwelt in it.",
        "9Thou hast sent widows away empty, and the arms of thefatherlesshave been broken.",
        "10Therefore snaresareround about thee, and sudden fear troubleth thee;",
        "11Or darkness,thatthou canst not see; and abundance of waters cover thee.",
        "12Isnot God in the height of heaven? and behold the height of the stars, how high they are!",
        "13And thou sayest, How doth Godknow? can hejudgethrough the dark cloud?",
        "14Thick cloudsarea covering to him, that he seeth not; and he walketh in the circuit of heaven.",
        "15Hast thou marked the old way which wicked men have trodden?",
        "16Which were cut down out of time, whose foundation was overflown with a flood:",
        "17Which said unto God, Depart from us: and what can the Almighty do for them?",
        "18Yet he filled their houses with goodthings:but the counsel of the wicked is far from me.",
        "19The righteous seeit,and are glad: and the innocent laugh them to scorn.",
        "20Whereas our substance is not cut down, but the remnant of them the fire consumeth.",
        "21Acquaint now thyself withhim, and be atpeace: thereby good shall come unto thee.",
        "22Receive, I pray thee, the law from his mouth, and lay up his words in thine heart.",
        "23If thou return to the Almighty, thou shalt bebuiltup, thou shalt put away iniquity far from thy tabernacles.",
        "24Then shalt thou lay up gold as dust, and thegoldof Ophir as the stones of the brooks.",
        "25Yea, the Almighty shall be thy defence, and thou shalt have plenty of silver.",
        "26For then shalt thou have thy delight in the Almighty, and shalt lift up thyfaceunto God.",
        "27Thou shalt make thy prayer unto him, and he shall hear thee, and thou shalt pay thyvows.",
        "28Thou shalt also decree a thing, and it shall be established unto thee: and the light shall shine upon thy ways.",
        "29Whenmenare cast down, then thou shalt say,There islifting up; and he shall save thehumbleperson.",
        "30He shall deliver the island of the innocent: and it is delivered by the pureness of thine hands."
      ],
      "full_text": "1Then Eliphaz the Temanite answered and said, 2Can a man be profitable unto God, as he that is wise may be profitable unto himself? 3Is itany pleasure to the Almighty, that thou artrighteous? oris itgainto him,that thou makest thy waysperfect? 4Will he reprove thee for fear of thee? will he enter with thee into judgment? 5Isnot thy wickedness great? and thine iniquities infinite? 6For thou hast taken a pledge from thy brother for nought, and stripped the naked of their clothing. 7Thou hast not given water to the weary to drink, and thou hast withholdenbreadfrom thehungry. 8Butas forthe mighty man, he had the earth; and the honourable man dwelt in it. 9Thou hast sent widows away empty, and the arms of thefatherlesshave been broken. 10Therefore snaresareround about thee, and sudden fear troubleth thee; 11Or darkness,thatthou canst not see; and abundance of waters cover thee. 12Isnot God in the height of heaven? and behold the height of the stars, how high they are! 13And thou sayest, How doth Godknow? can hejudgethrough the dark cloud? 14Thick cloudsarea covering to him, that he seeth not; and he walketh in the circuit of heaven. 15Hast thou marked the old way which wicked men have trodden? 16Which were cut down out of time, whose foundation was overflown with a flood: 17Which said unto God, Depart from us: and what can the Almighty do for them? 18Yet he filled their houses with goodthings:but the counsel of the wicked is far from me. 19The righteous seeit,and are glad: and the innocent laugh them to scorn. 20Whereas our substance is not cut down, but the remnant of them the fire consumeth. 21Acquaint now thyself withhim, and be atpeace: thereby good shall come unto thee. 22Receive, I pray thee, the law from his mouth, and lay up his words in thine heart. 23If thou return to the Almighty, thou shalt bebuiltup, thou shalt put away iniquity far from thy tabernacles. 24Then shalt thou lay up gold as dust, and thegoldof Ophir as the stones of the brooks. 25Yea, the Almighty shall be thy defence, and thou shalt have plenty of silver. 26For then shalt thou have thy delight in the Almighty, and shalt lift up thyfaceunto God. 27Thou shalt make thy prayer unto him, and he shall hear thee, and thou shalt pay thyvows. 28Thou shalt also decree a thing, and it shall be established unto thee: and the light shall shine upon thy ways. 29Whenmenare cast down, then thou shalt say,There islifting up; and he shall save thehumbleperson. 30He shall deliver the island of the innocent: and it is delivered by the pureness of thine hands."
    },
    {
      "reference": "Job 23",
      "title": "Job 23",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/23?lang=eng",
      "summary": "Job seeks the Lord and asserts his own righteousnessâHe says, When the Lord has tried me, I will come forth as gold.",
      "verses": [
        "1Then Job answered and said,",
        "2Even to dayismycomplaintbitter: my stroke is heavier than my groaning.",
        "3Oh that I knew where I might find him!thatI might comeevento his seat!",
        "4I would ordermycause before him, and fill my mouth with arguments.",
        "5I would know the wordswhichhe would answer me, and understand what he would say unto me.",
        "6Will he plead against me withhisgreat power? No; but he would putstrengthin me.",
        "7There the righteous mightdisputewith him; so should I bedeliveredfor ever from my judge.",
        "8Behold, I go forward, but heisnotthere;and backward, but I cannot perceive him:",
        "9On the left hand, where he doth work, but I cannot beholdhim:he hideth himself on the right hand, that I cannot seehim:",
        "10But heknoweththe way that I take:whenhe hathtriedme, I shall come forth as gold.",
        "11My foot hath held his steps, his way have I kept, and not declined.",
        "12Neither have I gone back fromthe commandment of his lips; I have esteemed the words of his mouth more than my necessaryfood.",
        "13But heisin onemind,and who can turn him? andwhathis soul desireth, eventhathe doeth.",
        "14For he performeththe thing that isappointed for me: and many suchthings arewith him.",
        "15Therefore am Itroubledat his presence: when I consider, I am afraid of him.",
        "16For God maketh my heart soft, and the Almighty troubleth me:",
        "17Because I was not cut off before the darkness,neitherhath he covered the darkness from my face."
      ],
      "full_text": "1Then Job answered and said, 2Even to dayismycomplaintbitter: my stroke is heavier than my groaning. 3Oh that I knew where I might find him!thatI might comeevento his seat! 4I would ordermycause before him, and fill my mouth with arguments. 5I would know the wordswhichhe would answer me, and understand what he would say unto me. 6Will he plead against me withhisgreat power? No; but he would putstrengthin me. 7There the righteous mightdisputewith him; so should I bedeliveredfor ever from my judge. 8Behold, I go forward, but heisnotthere;and backward, but I cannot perceive him: 9On the left hand, where he doth work, but I cannot beholdhim:he hideth himself on the right hand, that I cannot seehim: 10But heknoweththe way that I take:whenhe hathtriedme, I shall come forth as gold. 11My foot hath held his steps, his way have I kept, and not declined. 12Neither have I gone back fromthe commandment of his lips; I have esteemed the words of his mouth more than my necessaryfood. 13But heisin onemind,and who can turn him? andwhathis soul desireth, eventhathe doeth. 14For he performeththe thing that isappointed for me: and many suchthings arewith him. 15Therefore am Itroubledat his presence: when I consider, I am afraid of him. 16For God maketh my heart soft, and the Almighty troubleth me: 17Because I was not cut off before the darkness,neitherhath he covered the darkness from my face."
    },
    {
      "reference": "Job 24",
      "title": "Job 24",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/24?lang=eng",
      "summary": "Murderers, adulterers, those who oppress the poor, and wicked people in general often go unpunished for a little while.",
      "verses": [
        "1Why, seeing times are not hidden from the Almighty, do they that know him not see his days?",
        "2Someremove thelandmarks; they violently take away flocks, and feedthereof.",
        "3They drive away the ass of the fatherless, they take the widowâs ox for a pledge.",
        "4They turn the needy out of the way: the poor of the earth hide themselves together.",
        "5Behold,aswild asses in the desert, go they forth to their work; rising betimes for a prey: the wildernessyieldethfood for themandfortheirchildren.",
        "6They reapevery onehiscornin the field: and they gather the vintage of the wicked.",
        "7They cause the naked to lodge without clothing, thatthey haveno covering in the cold.",
        "8They are wet with the showers of the mountains, and embrace the rock for want of a shelter.",
        "9They pluck the fatherless from the breast, and take a pledge of the poor.",
        "10They causehimto go naked without clothing, and they take away the sheaffromthe hungry;",
        "11Whichmake oil within their walls,andtreadtheirwinepresses, and suffer thirst.",
        "12Men groan from out of the city, and the soul of the wounded crieth out: yet Godlayethnot follyto them.",
        "13They are of those thatrebelagainst thelight; they know not the ways thereof, nor abide in the paths thereof.",
        "14The murderer rising with the light killeth the poor and needy, and in the night is as a thief.",
        "15The eye also of the adulterer waiteth for thetwilight, saying, No eye shall see me: and disguisethhisface.",
        "16In the dark they dig through houses,whichthey had marked for themselves in the daytime: they know not thelight.",
        "17For the morningisto them even as the shadow of death: ifoneknowthem, they are inthe terrors of the shadow of death.",
        "18Heisswift as the waters; their portion is cursed in the earth: he beholdeth not the way of the vineyards.",
        "19Droughtand heat consume the snow waters:so doththe gravethose whichhave sinned.",
        "20The womb shall forget him; the worm shall feed sweetly on him; he shall be no more remembered; and wickedness shall be broken as a tree.",
        "21He evil entreateth the barrenthatbeareth not: and doeth not good to the widow.",
        "22He draweth also the mighty with his power: he riseth up, and nomanis sure of life.",
        "23Thoughit be given himto beinsafety, whereon he resteth; yet his eyesareupon their ways.",
        "24They are exalted for alittle while, but are gone and broughtlow; they are taken out of the way as allother,and cut off as thetopsof the ears of corn.",
        "25And ifit benotsonow, who will make me a liar, and make my speech nothing worth?"
      ],
      "full_text": "1Why, seeing times are not hidden from the Almighty, do they that know him not see his days? 2Someremove thelandmarks; they violently take away flocks, and feedthereof. 3They drive away the ass of the fatherless, they take the widowâs ox for a pledge. 4They turn the needy out of the way: the poor of the earth hide themselves together. 5Behold,aswild asses in the desert, go they forth to their work; rising betimes for a prey: the wildernessyieldethfood for themandfortheirchildren. 6They reapevery onehiscornin the field: and they gather the vintage of the wicked. 7They cause the naked to lodge without clothing, thatthey haveno covering in the cold. 8They are wet with the showers of the mountains, and embrace the rock for want of a shelter. 9They pluck the fatherless from the breast, and take a pledge of the poor. 10They causehimto go naked without clothing, and they take away the sheaffromthe hungry; 11Whichmake oil within their walls,andtreadtheirwinepresses, and suffer thirst. 12Men groan from out of the city, and the soul of the wounded crieth out: yet Godlayethnot follyto them. 13They are of those thatrebelagainst thelight; they know not the ways thereof, nor abide in the paths thereof. 14The murderer rising with the light killeth the poor and needy, and in the night is as a thief. 15The eye also of the adulterer waiteth for thetwilight, saying, No eye shall see me: and disguisethhisface. 16In the dark they dig through houses,whichthey had marked for themselves in the daytime: they know not thelight. 17For the morningisto them even as the shadow of death: ifoneknowthem, they are inthe terrors of the shadow of death. 18Heisswift as the waters; their portion is cursed in the earth: he beholdeth not the way of the vineyards. 19Droughtand heat consume the snow waters:so doththe gravethose whichhave sinned. 20The womb shall forget him; the worm shall feed sweetly on him; he shall be no more remembered; and wickedness shall be broken as a tree. 21He evil entreateth the barrenthatbeareth not: and doeth not good to the widow. 22He draweth also the mighty with his power: he riseth up, and nomanis sure of life. 23Thoughit be given himto beinsafety, whereon he resteth; yet his eyesareupon their ways. 24They are exalted for alittle while, but are gone and broughtlow; they are taken out of the way as allother,and cut off as thetopsof the ears of corn. 25And ifit benotsonow, who will make me a liar, and make my speech nothing worth?"
    },
    {
      "reference": "Job 38",
      "title": "Job 38",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/38?lang=eng",
      "summary": "God asks Job where he was when the foundations of the earth were laid, when the morning stars sang together, and when all the sons of God shouted for joyâThe phenomena of nature show the greatness of God and the weakness of man.",
      "verses": [
        "1Then theLordanswered Job out of the whirlwind, and said,",
        "2Whoisthis that darkeneth counsel by words without knowledge?",
        "3Gird up now thy loins like a man; for I will demand of thee, and answer thou me.",
        "4Where wast thou when Ilaidthefoundationsof theearth? declare, if thou hast understanding.",
        "5Who hathlaid the measures thereof, if thou knowest? or who hath stretched the line upon it?",
        "6Whereupon are the foundations thereof fastened? or who laid thecorner stonethereof;",
        "7When the morning starssangtogether, and all thesonsof God shouted forjoy?",
        "8Orwhoshut up the sea with doors, when it brake forth,as ifit had issued out of the womb?",
        "9When I made the cloud the garment thereof, and thick darkness a swaddlingband for it,",
        "10And brake up for it my decreedplace,and set bars and doors,",
        "11And said, Hitherto shalt thou come, but no further: and here shall thy proud waves be stayed?",
        "12Hast thou commanded the morning since thy days;andcaused the dayspring to know his place;",
        "13That it might take hold of the ends of the earth, that the wicked might be shaken out of it?",
        "14It is turned as claytothe seal; and they stand as a garment.",
        "15And from the wicked their light iswithholden, and the higharmshall be broken.",
        "16Hast thou entered into the springs of the sea? or hast thou walked in the search of the depth?",
        "17Have the gates of death been opened unto thee? or hast thou seen the doors of the shadow of death?",
        "18Hast thou perceived the breadth of the earth? declare if thou knowest it all.",
        "19Whereisthe waywherelight dwelleth? andas fordarkness, whereisthe place thereof,",
        "20That thou shouldest take it to the bound thereof, and that thou shouldest know the pathstothe house thereof?",
        "21Knowest thouit,because thou wast then born? orbecausethe number of thy daysisgreat?",
        "22Hast thou entered into thetreasuresof the snow? or hast thou seen the treasures of the hail,",
        "23Which I have reserved against the time of trouble, against the day of battle and war?",
        "24By what way is the light parted,whichscattereth the east wind upon the earth?",
        "25Who hath divided a watercourse for the overflowing of waters, or a way for the lightning of thunder;",
        "26To cause it to rain on the earth,whereno manis; onthe wilderness, whereinthere isno man;",
        "27To satisfy the desolate and wasteground;and to cause the bud of the tender herb to spring forth?",
        "28Hath the rain a father? or who hath begotten the drops of dew?",
        "29Out of whose womb came the ice? and the hoary frost of heaven, who hath gendered it?",
        "30The waters are hid aswitha stone, and the face of the deep is frozen.",
        "31Canst thou bind the sweet influences of Pleiades, or loose the bands ofOrion?",
        "32Canst thou bring forth Mazzaroth in his season? or canst thou guide Arcturus with his sons?",
        "33Knowest thou theordinancesofheaven? canst thou set the dominion thereof in the earth?",
        "34Canst thou lift up thy voice to the clouds, that abundance of waters may cover thee?",
        "35Canst thou send lightnings, that they may go, and say unto thee, Here weare?",
        "36Who hath put wisdom in the inward parts? or who hath given understanding to the heart?",
        "37Who can number the clouds in wisdom? or who can stay thebottlesof heaven,",
        "38When the dust groweth into hardness, and the clods cleave fast together?",
        "39Wilt thou hunt the prey for the lion? or fill the appetite of the young lions,",
        "40When they couch intheirdens,andabide in the covert to lie in wait?",
        "41Who provideth for theravenhis food? when his young ones cry unto God, they wander for lack of meat."
      ],
      "full_text": "1Then theLordanswered Job out of the whirlwind, and said, 2Whoisthis that darkeneth counsel by words without knowledge? 3Gird up now thy loins like a man; for I will demand of thee, and answer thou me. 4Where wast thou when Ilaidthefoundationsof theearth? declare, if thou hast understanding. 5Who hathlaid the measures thereof, if thou knowest? or who hath stretched the line upon it? 6Whereupon are the foundations thereof fastened? or who laid thecorner stonethereof; 7When the morning starssangtogether, and all thesonsof God shouted forjoy? 8Orwhoshut up the sea with doors, when it brake forth,as ifit had issued out of the womb? 9When I made the cloud the garment thereof, and thick darkness a swaddlingband for it, 10And brake up for it my decreedplace,and set bars and doors, 11And said, Hitherto shalt thou come, but no further: and here shall thy proud waves be stayed? 12Hast thou commanded the morning since thy days;andcaused the dayspring to know his place; 13That it might take hold of the ends of the earth, that the wicked might be shaken out of it? 14It is turned as claytothe seal; and they stand as a garment. 15And from the wicked their light iswithholden, and the higharmshall be broken. 16Hast thou entered into the springs of the sea? or hast thou walked in the search of the depth? 17Have the gates of death been opened unto thee? or hast thou seen the doors of the shadow of death? 18Hast thou perceived the breadth of the earth? declare if thou knowest it all. 19Whereisthe waywherelight dwelleth? andas fordarkness, whereisthe place thereof, 20That thou shouldest take it to the bound thereof, and that thou shouldest know the pathstothe house thereof? 21Knowest thouit,because thou wast then born? orbecausethe number of thy daysisgreat? 22Hast thou entered into thetreasuresof the snow? or hast thou seen the treasures of the hail, 23Which I have reserved against the time of trouble, against the day of battle and war? 24By what way is the light parted,whichscattereth the east wind upon the earth? 25Who hath divided a watercourse for the overflowing of waters, or a way for the lightning of thunder; 26To cause it to rain on the earth,whereno manis; onthe wilderness, whereinthere isno man; 27To satisfy the desolate and wasteground;and to cause the bud of the tender herb to spring forth? 28Hath the rain a father? or who hath begotten the drops of dew? 29Out of whose womb came the ice? and the hoary frost of heaven, who hath gendered it? 30The waters are hid aswitha stone, and the face of the deep is frozen. 31Canst thou bind the sweet influences of Pleiades, or loose the bands ofOrion? 32Canst thou bring forth Mazzaroth in his season? or canst thou guide Arcturus with his sons? 33Knowest thou theordinancesofheaven? canst thou set the dominion thereof in the earth? 34Canst thou lift up thy voice to the clouds, that abundance of waters may cover thee? 35Canst thou send lightnings, that they may go, and say unto thee, Here weare? 36Who hath put wisdom in the inward parts? or who hath given understanding to the heart? 37Who can number the clouds in wisdom? or who can stay thebottlesof heaven, 38When the dust groweth into hardness, and the clods cleave fast together? 39Wilt thou hunt the prey for the lion? or fill the appetite of the young lions, 40When they couch intheirdens,andabide in the covert to lie in wait? 41Who provideth for theravenhis food? when his young ones cry unto God, they wander for lack of meat."
    },
    {
      "reference": "Job 39",
      "title": "Job 39",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/39?lang=eng",
      "summary": "Manâs weakness and ignorance are compared with Godâs mighty worksâDoes man even know how the laws of nature operate?",
      "verses": [
        "1Knowest thou the time when the wildgoatsof the rock bring forth?orcanst thou mark when the hinds do calve?",
        "2Canst thou number the monthsthatthey fulfil? or knowest thou the time when they bring forth?",
        "3They bow themselves, they bring forth their young ones, they cast out their sorrows.",
        "4Their young ones are in good liking, they grow up with corn; they go forth, and return not unto them.",
        "5Who hath sent out the wild ass free? or who hath loosed the bands of the wild ass?",
        "6Whose house I have made the wilderness, and the barren land his dwellings.",
        "7He scorneth the multitude of the city, neither regardeth he the crying of the driver.",
        "8The range of the mountainsishis pasture, and he searcheth after every green thing.",
        "9Will theunicornbe willing to serve thee, or abide by thy crib?",
        "10Canst thou bind the unicorn with his band in the furrow? or will he harrow the valleys after thee?",
        "11Wilt thou trust him, because his strengthisgreat? or wilt thou leave thy labour to him?",
        "12Wilt thou believe him, that he will bring home thy seed, and gatherit intothy barn?",
        "13Gavest thouthe goodly wings unto the peacocks? or wings and feathers unto the ostrich?",
        "14Which leaveth her eggs in the earth, and warmeth them in dust,",
        "15And forgetteth that the foot may crush them, or that the wild beast may break them.",
        "16She ishardenedagainst her young ones, as thoughthey werenot hers: her labour is in vain without fear;",
        "17Because God hath deprived her of wisdom, neither hath he imparted to her understanding.",
        "18What time she lifteth up herself on high, she scorneth the horse and his rider.",
        "19Hast thou given the horse strength? hast thou clothed his neck with thunder?",
        "20Canst thou make him afraid as a grasshopper? the glory of his nostrilsisterrible.",
        "21He paweth in the valley, and rejoiceth inhisstrength: he goeth on to meet the armed men.",
        "22He mocketh at fear, and is not affrighted; neither turneth he back from the sword.",
        "23The quiver rattleth against him, the glittering spear and the shield.",
        "24He swalloweth the ground with fierceness and rage: neither believeth he thatit isthe sound of the trumpet.",
        "25He saith among the trumpets, Ha, ha; and he smelleth the battle afar off, the thunder of the captains, and the shouting.",
        "26Doth the hawk fly by thy wisdom,andstretch her wings toward the south?",
        "27Doth the eagle mount up at thy command, and make her nest on high?",
        "28She dwelleth and abideth on the rock, upon the crag of the rock, and the strong place.",
        "29From thence she seeketh the prey,andher eyes behold afar off.",
        "30Her young ones also suck up blood: and where the slainare,thereisshe."
      ],
      "full_text": "1Knowest thou the time when the wildgoatsof the rock bring forth?orcanst thou mark when the hinds do calve? 2Canst thou number the monthsthatthey fulfil? or knowest thou the time when they bring forth? 3They bow themselves, they bring forth their young ones, they cast out their sorrows. 4Their young ones are in good liking, they grow up with corn; they go forth, and return not unto them. 5Who hath sent out the wild ass free? or who hath loosed the bands of the wild ass? 6Whose house I have made the wilderness, and the barren land his dwellings. 7He scorneth the multitude of the city, neither regardeth he the crying of the driver. 8The range of the mountainsishis pasture, and he searcheth after every green thing. 9Will theunicornbe willing to serve thee, or abide by thy crib? 10Canst thou bind the unicorn with his band in the furrow? or will he harrow the valleys after thee? 11Wilt thou trust him, because his strengthisgreat? or wilt thou leave thy labour to him? 12Wilt thou believe him, that he will bring home thy seed, and gatherit intothy barn? 13Gavest thouthe goodly wings unto the peacocks? or wings and feathers unto the ostrich? 14Which leaveth her eggs in the earth, and warmeth them in dust, 15And forgetteth that the foot may crush them, or that the wild beast may break them. 16She ishardenedagainst her young ones, as thoughthey werenot hers: her labour is in vain without fear; 17Because God hath deprived her of wisdom, neither hath he imparted to her understanding. 18What time she lifteth up herself on high, she scorneth the horse and his rider. 19Hast thou given the horse strength? hast thou clothed his neck with thunder? 20Canst thou make him afraid as a grasshopper? the glory of his nostrilsisterrible. 21He paweth in the valley, and rejoiceth inhisstrength: he goeth on to meet the armed men. 22He mocketh at fear, and is not affrighted; neither turneth he back from the sword. 23The quiver rattleth against him, the glittering spear and the shield. 24He swalloweth the ground with fierceness and rage: neither believeth he thatit isthe sound of the trumpet. 25He saith among the trumpets, Ha, ha; and he smelleth the battle afar off, the thunder of the captains, and the shouting. 26Doth the hawk fly by thy wisdom,andstretch her wings toward the south? 27Doth the eagle mount up at thy command, and make her nest on high? 28She dwelleth and abideth on the rock, upon the crag of the rock, and the strong place. 29From thence she seeketh the prey,andher eyes behold afar off. 30Her young ones also suck up blood: and where the slainare,thereisshe."
    },
    {
      "reference": "Job 40",
      "title": "Job 40",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/40?lang=eng",
      "summary": "The Lord challenges Job, and Job replies humblyâThe Lord speaks of His power to JobâHe asks, Hast thou an arm like God?âHe points to His power in the behemoth.",
      "verses": [
        "1Moreover theLordanswered Job, and said,",
        "2Shall he that contendeth with the Almighty instructhim?he that reproveth God, let him answer it.",
        "3Â¶Then Job answered theLord, and said,",
        "4Behold, I am vile; what shall I answer thee? I will lay mine hand upon my mouth.",
        "5Once have I spoken; but I will not answer: yea, twice; but I will proceed no further.",
        "6Â¶Then answered theLordunto Job out of the whirlwind, and said,",
        "7Gird up thy loins now like a man: I will demand of thee, and declare thou unto me.",
        "8Wilt thou also disannul my judgment? wilt thou condemn me, that thou mayest be righteous?",
        "9Hast thou an arm like God? or canst thou thunder with a voice like him?",
        "10Deck thyself nowwithmajesty and excellency; and array thyself with glory and beauty.",
        "11Cast abroad the rage of thy wrath: and behold every onethat isproud, and abase him.",
        "12Look on every onethat isproud,andbring him low; and tread down the wicked in their place.",
        "13Hide them in the dust together;andbind their faces in secret.",
        "14Then will I also confess unto thee that thine own right hand can save thee.",
        "15Â¶Behold now behemoth, which I made with thee; he eateth grass as an ox.",
        "16Lo now, his strengthisin his loins, and his forceisin the navel of his belly.",
        "17He moveth his tail like a cedar: the sinews of his stones are wrapped together.",
        "18His bonesare asstrong pieces of brass; his bonesarelike bars of iron.",
        "19Heisthe chief of the ways of God: he that made him can make his sword to approachunto him.",
        "20Surely the mountains bring him forth food, where all the beasts of the field play.",
        "21He lieth under the shady trees, in the covert of the reed, andfens.",
        "22The shady trees cover himwiththeir shadow; the willows of the brook compass him about.",
        "23Behold, he drinketh up a river,andhasteth not: he trusteth that he can draw up Jordan into his mouth.",
        "24He taketh it with his eyes:hisnose pierceth through snares."
      ],
      "full_text": "1Moreover theLordanswered Job, and said, 2Shall he that contendeth with the Almighty instructhim?he that reproveth God, let him answer it. 3Â¶Then Job answered theLord, and said, 4Behold, I am vile; what shall I answer thee? I will lay mine hand upon my mouth. 5Once have I spoken; but I will not answer: yea, twice; but I will proceed no further. 6Â¶Then answered theLordunto Job out of the whirlwind, and said, 7Gird up thy loins now like a man: I will demand of thee, and declare thou unto me. 8Wilt thou also disannul my judgment? wilt thou condemn me, that thou mayest be righteous? 9Hast thou an arm like God? or canst thou thunder with a voice like him? 10Deck thyself nowwithmajesty and excellency; and array thyself with glory and beauty. 11Cast abroad the rage of thy wrath: and behold every onethat isproud, and abase him. 12Look on every onethat isproud,andbring him low; and tread down the wicked in their place. 13Hide them in the dust together;andbind their faces in secret. 14Then will I also confess unto thee that thine own right hand can save thee. 15Â¶Behold now behemoth, which I made with thee; he eateth grass as an ox. 16Lo now, his strengthisin his loins, and his forceisin the navel of his belly. 17He moveth his tail like a cedar: the sinews of his stones are wrapped together. 18His bonesare asstrong pieces of brass; his bonesarelike bars of iron. 19Heisthe chief of the ways of God: he that made him can make his sword to approachunto him. 20Surely the mountains bring him forth food, where all the beasts of the field play. 21He lieth under the shady trees, in the covert of the reed, andfens. 22The shady trees cover himwiththeir shadow; the willows of the brook compass him about. 23Behold, he drinketh up a river,andhasteth not: he trusteth that he can draw up Jordan into his mouth. 24He taketh it with his eyes:hisnose pierceth through snares."
    },
    {
      "reference": "Job 42",
      "title": "Job 42",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/job/42?lang=eng",
      "summary": "Job repents in dust and ashesâHe sees the Lord with his eyesâThe Lord chastises Jobâs friends, accepts Job, blesses him, and makes his latter days greater than his beginning.",
      "verses": [
        "1Then Job answered theLord, and said,",
        "2I know that thou canstdoeverything,andthatno thought can be withholden from thee.",
        "3Whoishe that hideth counsel without knowledge? therefore have I uttered that I understood not; things toowonderfulfor me, which I knew not.",
        "4Hear, I beseech thee, and I will speak: I will demand of thee, and declare thou unto me.",
        "5I have heard of thee by the hearing of the ear: but now mine eye seeth thee.",
        "6Wherefore I abhormyself,and repent in dust andashes.",
        "7Â¶And it wasso,that after theLordhad spoken these words unto Job, theLordsaid to Eliphaz the Temanite, My wrath is kindled against thee, and against thy two friends: for ye have not spoken of methe thing that isright, as my servant Jobhath.",
        "8Therefore take unto you now seven bullocks and seven rams, and go to my servant Job, and offer up for yourselves a burntoffering; and my servant Job shallprayfor you: for him will I accept: lest I deal with youafter yourfolly, in that ye have not spoken of methe thing which isright, like my servant Job.",
        "9So Eliphaz the Temanite and Bildad the ShuhiteandZophar the Naamathite went, and did according as theLordcommanded them: theLordalsoacceptedJob.",
        "10And theLordturned the captivity of Job, when heprayedfor hisfriends: also theLordgave Job twice as much as he had before.",
        "11Then came there unto him all his brethren, and all his sisters, and all they that had been of his acquaintance before, and did eat bread with him in his house: and they bemoaned him, and comforted him over all the evil that theLordhad brought upon him: every man also gave him a piece of money, and every one an earring of gold.",
        "12So theLordblessedthe latter end of Job more than his beginning: for he had fourteen thousand sheep, and six thousand camels, and a thousand yoke of oxen, and a thousand she asses.",
        "13He had also seven sons and three daughters.",
        "14And he called the name of the first, Jemima; and the name of the second, Kezia; and the name of the third, Keren-happuch.",
        "15And in all the land were no women foundsofair as the daughters of Job: and their father gave them inheritance among their brethren.",
        "16After this lived Job an hundred and forty years, and saw his sons, and his sonsâ sons,evenfour generations.",
        "17So Job died,beingold and full of days."
      ],
      "full_text": "1Then Job answered theLord, and said, 2I know that thou canstdoeverything,andthatno thought can be withholden from thee. 3Whoishe that hideth counsel without knowledge? therefore have I uttered that I understood not; things toowonderfulfor me, which I knew not. 4Hear, I beseech thee, and I will speak: I will demand of thee, and declare thou unto me. 5I have heard of thee by the hearing of the ear: but now mine eye seeth thee. 6Wherefore I abhormyself,and repent in dust andashes. 7Â¶And it wasso,that after theLordhad spoken these words unto Job, theLordsaid to Eliphaz the Temanite, My wrath is kindled against thee, and against thy two friends: for ye have not spoken of methe thing that isright, as my servant Jobhath. 8Therefore take unto you now seven bullocks and seven rams, and go to my servant Job, and offer up for yourselves a burntoffering; and my servant Job shallprayfor you: for him will I accept: lest I deal with youafter yourfolly, in that ye have not spoken of methe thing which isright, like my servant Job. 9So Eliphaz the Temanite and Bildad the ShuhiteandZophar the Naamathite went, and did according as theLordcommanded them: theLordalsoacceptedJob. 10And theLordturned the captivity of Job, when heprayedfor hisfriends: also theLordgave Job twice as much as he had before. 11Then came there unto him all his brethren, and all his sisters, and all they that had been of his acquaintance before, and did eat bread with him in his house: and they bemoaned him, and comforted him over all the evil that theLordhad brought upon him: every man also gave him a piece of money, and every one an earring of gold. 12So theLordblessedthe latter end of Job more than his beginning: for he had fourteen thousand sheep, and six thousand camels, and a thousand yoke of oxen, and a thousand she asses. 13He had also seven sons and three daughters. 14And he called the name of the first, Jemima; and the name of the second, Kezia; and the name of the third, Keren-happuch. 15And in all the land were no women foundsofair as the daughters of Job: and their father gave them inheritance among their brethren. 16After this lived Job an hundred and forty years, and saw his sons, and his sonsâ sons,evenfour generations. 17So Job died,beingold and full of days."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:30:26",
  "metadata": {
    "week_number": 33,
    "title": "Week 33: August 10–16 - Job 1–3; 12–14; 19; 21–24; 38–40; 42",
    "date_range": "August 10–16",
    "scraped_at": "2025-12-21T22:30:39.683311",
    "scraper_version": "2.0.0"
  }
}