{
  "week_number": 23,
  "date_range": "June 1–7",
  "title": "Week 23: June 1–7 - Ruth; 1 Samuel 1–7",
  "bundle_title": "Week 23: June 1–7: \"Week 23: June 1–7 - Ruth; 1 Samuel 1–7\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/23?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/23?lang=eng",
    "title": "Ruth;1 Samuel 1–7",
    "scripture_references": "Ruth; 1 Samuel 1–7",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“June 1–7. ‘My Heart Rejoiceth in the Lord’: Ruth 1; 1 Samuel 1–7,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“June 1–7. ‘My Heart Rejoiceth in the Lord,’”Come, Follow Me: Old Testament 2026\n\nSometimes we imagine that our lives should follow a clear path from beginning to end. The shortest distance between two points is a straight line, after all. And yet life is often full of delays and detours that take us in unexpected directions.\n\nRuth and Hannah surely understood this. Ruth was not an Israelite, but she married one, and when her husband died, she had a choice to make. Would she return to her family and her old, familiar life, or would she embrace the Israelite faith and a new home with her mother-in-law? (seeRuth 1:4–18). Hannah’s plan for her life was to bear children, but she could not, and that left her “in bitterness of soul” (see1 Samuel 1:1–10). As you read about Ruth and Hannah, consider the faith they must have had to travel their unexpected paths. Then think about your own journey. It’s different from Ruth’s and Hannah’s—and anyone else’s. But throughout the trials and surprises between here and your eternal destination, you can learn to say with Hannah, “My heart rejoiceth in the Lord” (1 Samuel 2:1).\n\nSee also the Bible Dictionary for an overview of the books ofRuthand1 Samuel.",
    "learning_at_home_church": [
      {
        "title": "Jesus Christ can turn tragedy into triumph.",
        "content": "Life is hard for a widow in any era. But when Ruth’s husband died, her situation was especially hard. In Israelite culture at the time, a woman without a husband or sons had no right to property and very few ways to earn a living. As you read Ruth’s story, notice how the Lord turned tragedy into great blessings. What do you notice about Ruth that might have helped her? How did Boaz redeem Ruth from her desperate situation? (seeRuth 4:4–10). How were both Ruth and Boaz like Jesus Christ?\n\nSee also “Be Still, My Soul,”Hymns, no. 124.\n\nRuth;1 Samuel 1"
      },
      {
        "title": "I can trust that God will guide and help me regardless of my situation.",
        "content": "Perhaps you have suffered a great loss, as Ruth and Naomi did (seeRuth 1:1–5). Or maybe, like Hannah, you long for blessings you have not yet received (see1 Samuel 1:1–10). How did these women show their faith in God? What do you learn from their examples?\n\nOf course, not everyone who prays for a child receives one, and not everyone whose spouse dies remarries. But everyone who turns to the Savior receives His help and guidance. Consider how you have “come to trust” the Lord (Ruth 2:12) during your difficult times.\n\nSee also Amy A. Wright, “Abide the Day in Christ,”Liahona, Nov. 2023, 9–11.\n\nFor This Child I Prayed, by Elspeth Young\n\n1 Samuel 2;4–7"
      },
      {
        "title": "To receive the Lord’s help, I need to trust Him and obey His commandments.",
        "content": "When their enemies attacked, the Israelites apparently thought that simply possessing the ark of the covenant would protect them. As you read1 Samuel 4–6, think about why that didn’t work. (Note also the unrighteous actions of Eli’s sons, who served as priests in the tabernacle, in1 Samuel 2:12–25.) What do you think the Lord was trying to teach His people? What do you learn from what happened to the Philistines after capturing the ark? (seechapters 5–6). What do you learn from Israel’s efforts to regain the Lord’s protection in1 Samuel 7?\n\nYou might be inspired by reading Hannah’s poem of praise in1 Samuel 2:1–10. What do you find in her words that could have helped Eli’s sons and the rest of the Israelites?\n\n1 Samuel 3"
      },
      {
        "title": "I can hear and obey the voice of the Lord.",
        "content": "At times, you may feel like Samuel, who heard the voice of the Lord but did not recognize it. Like all of us, Samuel had to learn how to recognize the Lord’s voice. As you study1 Samuel 3, what do you learn from this young boy about hearing and obeying the Lord’s voice? You might also search these additional scriptures and make a list of guidelines that can help a person recognize the Lord’s voice:1 Kings 19:11–12;Luke 24:15–32;3 Nephi 11:3–7;Doctrine and Covenants 6:22–23;8:2–3;9:7–9.\n\nOther times, you may feel that the heavens are shut and that God does not want to communicate with you. President Russell M. Nelson said, “Does God reallywantto speak to you? Yes!” (“Revelation for the Church, Revelation for Our Lives,”EnsignorLiahona, May 2018, 93–96). As you study President Nelson’s message, what do you find that inspires you to hear and obey the voice of the Lord? What does President Nelson invite you to do, and what blessings does he promise? You can also find invitations and promised blessings about revelation in “Walk in God’s light” (For the Strength of Youth: A Guide for Making Choices, 16–20). Consider choosing one thing you can do to “increase your spiritual capacity to receive revelation.”\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "I can show love and kindness to people around me.",
        "content": "As you share with your children the story of Ruth (you could use “Ruth and Naomi” inOld Testament Stories, 100–103), invite them to raise their hands every time they hear an act of kindness in the story. They could also share how they feel when others are kind to them, or when they are kind to others. How has the Savior been kind to us? How can we follow His example? (see “Kindness Begins with Me,”Children’s Songbook, 145).\n\nRuth and Naomi\n\nRuth;1 Samuel 1"
      },
      {
        "title": "I can have faith in the Lord.",
        "content": "The stories of Ruth and Hannah can inspire your children to stay faithful during hard times. Consider helping them create a simple chart with the headingsTrials,Actions,Blessings. Then you could read togetherRuth 1:3–5, 8, 16;2:1–3, 8–12;4:13–17;1 Samuel 1:1–18and write under the headings what they find in these verses. How did Ruth and Hannah show their faith in the Lord? You or your children could then share examples of how the Lord has blessed you during hard times.\n\n1 Samuel 1:1–18"
      },
      {
        "title": "Heavenly Father hears and answers my prayers.",
        "content": "To learn about Hannah, your children could read1 Samuel 1:1–18or “Hannah” inOld Testament Stories(104–5) or watch “Hannah’s Faith” (video, Gospel Library). It might be fun to toss a ball to a child and invite them to tell part of the story before passing the ball to someone else. What do we learn about prayer from Hannah’s example?\n\nHannah\n\nHannah's Faith\n\nSamuel Tells Eli the Truth, by Robert T. Barrett\n\n1 Samuel 3:1–10"
      },
      {
        "title": "I can hear and obey the Lord’s voice.",
        "content": "Perhaps a simple role-play could help your children learn from Samuel’s experience with revelation. One child could pretend to be Samuel, and another could pretend to be Eli as you read1 Samuel 3:1–10(see also “Samuel the Prophet” inOld Testament Stories, 106–9, or the video “Samuel and Eli,” Gospel Library). What do we learn from Samuel about how to hear the voice of the Lord? How do we show that we are willing to hear when the Lord speaks to us?\n\nSamuel the Prophet\n\nSamuel and Eli\n\nAsk your children how they would explain to someone how the Lord speaks to them. You could help them look for answers inDoctrine and Covenants 6:22–23;8:2–3;9:7–9.\n\nHelp your children learn to recognize the Spirit.It’s not easy to discern between our own feelings and the Holy Ghost. Everyone struggles with this from time to time. Take every opportunity you can to help your children recognize when they are feeling the influence of the Spirit. For example, as you read1 Samuel 3:1–10and the suggested verses in the Doctrine and Covenants, you could share experiences in which the Lord has taught you in your mind and heart.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nBoy Samuel Called by the Lord, by Harry Anderson"
      }
    ],
    "study_helps": [],
    "raw_text": "June 1–7. “My Heart Rejoiceth in the Lord”: Ruth; 1 Samuel 1–7\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJune 1–7\nRuth; 1 Samuel 1–7\nJune 8–14\n1 Samuel 8–10; 13; 15–16\nJune 15–21\n1 Samuel 17–18; 24–26; 2 Samuel 5–7\nJune 22–28\n2 Samuel 11–12; 1 Kings 3; 6–9; 11\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\nAppendixes\nJune 1–7. “My Heart Rejoiceth in the Lord”: Ruth; 1 Samuel 1–7\n“June 1–7. ‘My Heart Rejoiceth in the Lord’: Ruth 1; 1 Samuel 1–7,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“June 1–7. ‘My Heart Rejoiceth in the Lord,’”\nCome, Follow Me: Old Testament 2026\nWhither Thou Goest\n, by Sandy Freckleton Gagon\nJune 1–7: “My Heart Rejoiceth in the Lord”\nRuth\n;\n1 Samuel 1–7\nSometimes we imagine that our lives should follow a clear path from beginning to end. The shortest distance between two points is a straight line, after all. And yet life is often full of delays and detours that take us in unexpected directions.\nRuth and Hannah surely understood this. Ruth was not an Israelite, but she married one, and when her husband died, she had a choice to make. Would she return to her family and her old, familiar life, or would she embrace the Israelite faith and a new home with her mother-in-law? (see\nRuth 1:4–18\n). Hannah’s plan for her life was to bear children, but she could not, and that left her “in bitterness of soul” (see\n1 Samuel 1:1–10\n). As you read about Ruth and Hannah, consider the faith they must have had to travel their unexpected paths. Then think about your own journey. It’s different from Ruth’s and Hannah’s—and anyone else’s. But throughout the trials and surprises between here and your eternal destination, you can learn to say with Hannah, “My heart rejoiceth in the Lord” (\n1 Samuel 2:1\n).\nSee also the Bible Dictionary for an overview of the books of\nRuth\nand\n1 Samuel\n.\nIdeas for Learning at Home and at Church\nRuth\nJesus Christ can turn tragedy into triumph.\nLife is hard for a widow in any era. But when Ruth’s husband died, her situation was especially hard. In Israelite culture at the time, a woman without a husband or sons had no right to property and very few ways to earn a living. As you read Ruth’s story, notice how the Lord turned tragedy into great blessings. What do you notice about Ruth that might have helped her? How did Boaz redeem Ruth from her desperate situation? (see\nRuth 4:4–10\n). How were both Ruth and Boaz like Jesus Christ?\nSee also “\nBe Still, My Soul\n,”\nHymns\n, no. 124.\nRuth\n;\n1 Samuel 1\nI can trust that God will guide and help me regardless of my situation.\nPerhaps you have suffered a great loss, as Ruth and Naomi did (see\nRuth 1:1–5\n). Or maybe, like Hannah, you long for blessings you have not yet received (see\n1 Samuel 1:1–10\n). How did these women show their faith in God? What do you learn from their examples?\nOf course, not everyone who prays for a child receives one, and not everyone whose spouse dies remarries. But everyone who turns to the Savior receives His help and guidance. Consider how you have “come to trust” the Lord (\nRuth 2:12\n) during your difficult times.\nSee also Amy A. Wright, “\nAbide the Day in Christ\n,”\nLiahona\n, Nov. 2023, 9–11.\nFor This Child I Prayed\n, by Elspeth Young\n1 Samuel 2\n;\n4–7\nTo receive the Lord’s help, I need to trust Him and obey His commandments.\nWhen their enemies attacked, the Israelites apparently thought that simply possessing the ark of the covenant would protect them. As you read\n1 Samuel 4–6\n, think about why that didn’t work. (Note also the unrighteous actions of Eli’s sons, who served as priests in the tabernacle, in\n1 Samuel 2:12–25\n.) What do you think the Lord was trying to teach His people? What do you learn from what happened to the Philistines after capturing the ark? (see\nchapters 5–6\n). What do you learn from Israel’s efforts to regain the Lord’s protection in\n1 Samuel 7\n?\nYou might be inspired by reading Hannah’s poem of praise in\n1 Samuel 2:1–10\n. What do you find in her words that could have helped Eli’s sons and the rest of the Israelites?\n1 Samuel 3\nI can hear and obey the voice of the Lord.\nAt times, you may feel like Samuel, who heard the voice of the Lord but did not recognize it. Like all of us, Samuel had to learn how to recognize the Lord’s voice. As you study\n1 Samuel 3\n, what do you learn from this young boy about hearing and obeying the Lord’s voice? You might also search these additional scriptures and make a list of guidelines that can help a person recognize the Lord’s voice:\n1 Kings 19:11–12\n;\nLuke 24:15–32\n;\n3 Nephi 11:3–7\n;\nDoctrine and Covenants 6:22–23\n;\n8:2–3\n;\n9:7–9\n.\nOther times, you may feel that the heavens are shut and that God does not want to communicate with you. President Russell M. Nelson said, “Does God really\nwant\nto speak to you? Yes!” (“\nRevelation for the Church, Revelation for Our Lives\n,”\nEnsign\nor\nLiahona\n, May 2018, 93–96). As you study President Nelson’s message, what do you find that inspires you to hear and obey the voice of the Lord? What does President Nelson invite you to do, and what blessings does he promise? You can also find invitations and promised blessings about revelation in “\nWalk in God’s light\n” (\nFor the Strength of Youth: A Guide for Making Choices\n, 16–20). Consider choosing one thing you can do to “increase your spiritual capacity to receive revelation.”\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nStudy Helps\nWhat did it mean to glean a field?\nWhy was it significant that Boaz was one of Naomi’s “next kinsmen”?\nWhy did Naomi instruct Ruth to lay at the feet of Boaz?\nClick to see more.\nIdeas for Teaching Children\nRuth\nI can show love and kindness to people around me.\nAs you share with your children the story of Ruth (you could use “\nRuth and Naomi\n” in\nOld Testament Stories\n, 100–103), invite them to raise their hands every time they hear an act of kindness in the story. They could also share how they feel when others are kind to them, or when they are kind to others. How has the Savior been kind to us? How can we follow His example? (see “\nKindness Begins with Me,\n”\nChildren’s Songbook\n, 145).\n2:0\nRuth and Naomi\nRuth\n;\n1 Samuel 1\nI can have faith in the Lord.\nThe stories of Ruth and Hannah can inspire your children to stay faithful during hard times. Consider helping them create a simple chart with the headings\nTrials\n,\nActions\n,\nBlessings\n. Then you could read together\nRuth 1:3–5, 8, 16\n;\n2:1–3, 8–12\n;\n4:13–17\n;\n1 Samuel 1:1–18\nand write under the headings what they find in these verses. How did Ruth and Hannah show their faith in the Lord? You or your children could then share examples of how the Lord has blessed you during hard times.\n1 Samuel 1:1–18\nHeavenly Father hears and answers my prayers.\nTo learn about Hannah, your children could read\n1 Samuel 1:1–18\nor “\nHannah\n” in\nOld Testament Stories\n(104–5) or watch “Hannah’s Faith” (video, Gospel Library). It might be fun to toss a ball to a child and invite them to tell part of the story before passing the ball to someone else. What do we learn about prayer from Hannah’s example?\n1:15\nHannah\n3:9\nHannah's Faith\nSamuel Tells Eli the Truth\n, by Robert T. Barrett\n1 Samuel 3:1–10\nI can hear and obey the Lord’s voice.\nPerhaps a simple role-play could help your children learn from Samuel’s experience with revelation. One child could pretend to be Samuel, and another could pretend to be Eli as you read\n1 Samuel 3:1–10\n(see also “\nSamuel the Prophet\n” in\nOld Testament Stories\n, 106–9, or the video “Samuel and Eli,” Gospel Library). What do we learn from Samuel about how to hear the voice of the Lord? How do we show that we are willing to hear when the Lord speaks to us?\n2:10\nSamuel the Prophet\n1:58\nSamuel and Eli\nAsk your children how they would explain to someone how the Lord speaks to them. You could help them look for answers in\nDoctrine and Covenants 6:22–23\n;\n8:2–3\n;\n9:7–9\n.\nHelp your children learn to recognize the Spirit.\nIt’s not easy to discern between our own feelings and the Holy Ghost. Everyone struggles with this from time to time. Take every opportunity you can to help your children recognize when they are feeling the influence of the Spirit. For example, as you read\n1 Samuel 3:1–10\nand the suggested verses in the Doctrine and Covenants, you could share experiences in which the Lord has taught you in your mind and heart.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nBoy Samuel Called by the Lord\n, by Harry Anderson"
  },
  "scripture_content": [
    {
      "reference": "Ruth 1",
      "title": "The Book ofRuth",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ruth/1?lang=eng",
      "summary": "Elimelech and his family go to Moab because of famineâHis sons marryâThe father and sons dieâRuth, the Moabitess, her husband having died, remains constant to NaomiâThey come to Bethlehem.",
      "verses": [
        "1Now it came to pass in the days when thejudgesruled, that there was a famine in the land. And a certain man of Beth-lehem-judah went to sojourn in the country of Moab, he, and his wife, and his two sons.",
        "2And the name of the manwasElimelech, and the name of his wife Naomi, and the name of his two sons Mahlon and Chilion,Ephrathitesof Beth-lehem-judah. And they came into the country of Moab, and continued there.",
        "3And Elimelech Naomiâs husband died; and she was left, and her two sons.",
        "4And they took them wives of the women of Moab; the name of the onewasOrpah, and the name of the other Ruth: and they dwelled there about ten years.",
        "5And Mahlon and Chilion died also both of them; and the woman was left of her two sons and her husband.",
        "6Â¶Then she arose with her daughters in law, that she might return from the country of Moab: for she had heard in the country of Moab how that theLordhad visited his people in giving them bread.",
        "7Wherefore she went forth out of the place where she was, and her two daughters in law with her; and they went on the way to return unto the land of Judah.",
        "8And Naomi said unto her two daughters in law, Go, return each to her motherâs house: theLorddeal kindly with you, as ye have dealt with the dead, and with me.",
        "9TheLordgrant you that ye may find rest, eachof youin the house of her husband. Then she kissed them; and they lifted up their voice, and wept.",
        "10And they said unto her, Surely we will return with thee unto thy people.",
        "11And Naomi said, Turn again, my daughters: why will ye go with me?arethere yetany moresonsin my womb, that they may be your husbands?",
        "12Turn again, my daughters, goyour way;for I am too old to have an husband. If I should say, I have hope,ifI should have an husband also to night, and should also bear sons;",
        "13Would ye tarry for them till they were grown? would ye stay for them from having husbands? nay, my daughters; for it grieveth me much for your sakes that the hand of theLordis gone out against me.",
        "14And they lifted up their voice, and wept again: and Orpah kissed her mother in law; but Ruthclave untoher.",
        "15And she said, Behold, thy sister in law is gone back unto her people, and unto her gods: return thou after thy sister in law.",
        "16And Ruth said, Entreat me not to leave thee,orto return fromfollowingafter thee: for whither thou goest, I willgo; and where thoulodgest, I will lodge: thypeopleshall bemy people, and thy God myGod:",
        "17Where thou diest, will I die, and there will I be buried: theLorddo so to me, and more also,if oughtbut death part thee and me.",
        "18When she saw that she wassteadfastlyminded to go with her, then she left speaking unto her.",
        "19Â¶So they two went until they came to Beth-lehem. And it came to pass, when they were come to Beth-lehem, that all the city was moved about them, and they said,Isthis Naomi?",
        "20And she said unto them, Call me notNaomi, call meMara: for the Almighty hath dealt very bitterly with me.",
        "21I went out full, and theLordhath brought me home again empty: whythencall ye me Naomi, seeing theLordhathtestified against me, and the Almighty hath afflicted me?",
        "22So Naomi returned, and Ruth the Moabitess, her daughter in law, with her, which returned out of the country of Moab: and they came to Beth-lehem in the beginning of barley harvest."
      ],
      "full_text": "1Now it came to pass in the days when thejudgesruled, that there was a famine in the land. And a certain man of Beth-lehem-judah went to sojourn in the country of Moab, he, and his wife, and his two sons. 2And the name of the manwasElimelech, and the name of his wife Naomi, and the name of his two sons Mahlon and Chilion,Ephrathitesof Beth-lehem-judah. And they came into the country of Moab, and continued there. 3And Elimelech Naomiâs husband died; and she was left, and her two sons. 4And they took them wives of the women of Moab; the name of the onewasOrpah, and the name of the other Ruth: and they dwelled there about ten years. 5And Mahlon and Chilion died also both of them; and the woman was left of her two sons and her husband. 6Â¶Then she arose with her daughters in law, that she might return from the country of Moab: for she had heard in the country of Moab how that theLordhad visited his people in giving them bread. 7Wherefore she went forth out of the place where she was, and her two daughters in law with her; and they went on the way to return unto the land of Judah. 8And Naomi said unto her two daughters in law, Go, return each to her motherâs house: theLorddeal kindly with you, as ye have dealt with the dead, and with me. 9TheLordgrant you that ye may find rest, eachof youin the house of her husband. Then she kissed them; and they lifted up their voice, and wept. 10And they said unto her, Surely we will return with thee unto thy people. 11And Naomi said, Turn again, my daughters: why will ye go with me?arethere yetany moresonsin my womb, that they may be your husbands? 12Turn again, my daughters, goyour way;for I am too old to have an husband. If I should say, I have hope,ifI should have an husband also to night, and should also bear sons; 13Would ye tarry for them till they were grown? would ye stay for them from having husbands? nay, my daughters; for it grieveth me much for your sakes that the hand of theLordis gone out against me. 14And they lifted up their voice, and wept again: and Orpah kissed her mother in law; but Ruthclave untoher. 15And she said, Behold, thy sister in law is gone back unto her people, and unto her gods: return thou after thy sister in law. 16And Ruth said, Entreat me not to leave thee,orto return fromfollowingafter thee: for whither thou goest, I willgo; and where thoulodgest, I will lodge: thypeopleshall bemy people, and thy God myGod: 17Where thou diest, will I die, and there will I be buried: theLorddo so to me, and more also,if oughtbut death part thee and me. 18When she saw that she wassteadfastlyminded to go with her, then she left speaking unto her. 19Â¶So they two went until they came to Beth-lehem. And it came to pass, when they were come to Beth-lehem, that all the city was moved about them, and they said,Isthis Naomi? 20And she said unto them, Call me notNaomi, call meMara: for the Almighty hath dealt very bitterly with me. 21I went out full, and theLordhath brought me home again empty: whythencall ye me Naomi, seeing theLordhathtestified against me, and the Almighty hath afflicted me? 22So Naomi returned, and Ruth the Moabitess, her daughter in law, with her, which returned out of the country of Moab: and they came to Beth-lehem in the beginning of barley harvest."
    },
    {
      "reference": "Ruth 2",
      "title": "Ruth 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ruth/2?lang=eng",
      "summary": "Ruth gleans in the fields of Boaz, a near relative of NaomiâHe treats Ruth kindly.",
      "verses": [
        "1And Naomi had a kinsman of her husbandâs, a mighty man of wealth, of the family of Elimelech; and his namewasBoaz.",
        "2And Ruth the Moabitess said unto Naomi, Let me now go to the field, andgleanears ofcornafterhimin whose sight I shall find grace. And she said unto her, Go, my daughter.",
        "3And she went, and came, and gleaned in the field after the reapers: and herhapwas to light on a part of the fieldbelongingunto Boaz, whowasof the kindred of Elimelech.",
        "4Â¶And, behold, Boaz came from Beth-lehem, and said unto the reapers, TheLordbewith you. And they answered him, TheLordbless thee.",
        "5Then said Boaz unto his servant that was set over the reapers, Whose damselisthis?",
        "6And the servant that was set over the reapers answered and said, Itisthe Moabitish damsel that came back with Naomi out of the country of Moab:",
        "7And she said, I pray you, let me glean and gather after the reapers among the sheaves: so she came, and hath continued even from the morning until now, that she tarried a little in the house.",
        "8Then said Boaz unto Ruth, Hearest thou not, my daughter? Go not togleanin another field, neither go from hence, but abide herefastby my maidens:",
        "9Letthine eyesbeon the field that they do reap, and go thou after them: have I not charged the young men that they shall not touch thee? and when thou art athirst, go unto the vessels, and drink ofthatwhich the young men have drawn.",
        "10Then she fell on her face, and bowed herself to the ground, and said unto him, Why have I found grace in thine eyes, that thou shouldest takeknowledgeof me, seeing Iama stranger?",
        "11And Boaz answered and said unto her, It hath fully been shewed me, all that thou hast done unto thy mother in law since the death of thine husband: andhowthou hast left thy father and thy mother, and the land of thy nativity, and art come unto a people which thou knewest not heretofore.",
        "12TheLordrecompense thy work, and a fullrewardbe given thee of theLordGod of Israel, under whosewingsthou art come to trust.",
        "13Then she said, Let me find favour in thy sight, my lord; for that thou hast comforted me, and for that thou hast spokenfriendlyunto thine handmaid, though I be not like unto one of thine handmaidens.",
        "14And Boaz said unto her, At mealtime come thou hither, and eat of the bread, and dip thy morsel in the vinegar. And she sat beside the reapers: and he reached her parchedcorn,and she did eat, and was sufficed, andleft.",
        "15And when she was risen up to glean, Boaz commanded his young men, saying, Let her glean even among the sheaves, and reproach her not:",
        "16And let fall alsosomeof the handfuls of purpose for her, and leavethem,that she may gleanthem,and rebuke her not.",
        "17So she gleaned in the field until even, and beat out that she had gleaned: and it was about an ephah of barley.",
        "18Â¶And she tookitup, and went into the city: and her mother in law saw what she had gleaned: and she brought forth, and gave to her that she had reserved after she was sufficed.",
        "19And her mother in law said unto her, Where hast thou gleaned to day? and where wroughtest thou? blessed be he that did take knowledge of thee. And sheshewedher mother in law with whom she hadwrought, and said, The manâs name with whom I wrought to dayisBoaz.",
        "20And Naomi said unto her daughter in law, Blessedbehe of theLord, who hath notleft offhis kindness to the living and to the dead. And Naomi said unto her, The manisnear of kin unto us, one of ournextkinsmen.",
        "21And Ruth the Moabitess said, He said unto me also, Thou shalt keepfastby my young men, until they have ended all my harvest.",
        "22And Naomi said unto Ruth her daughter in law,It isgood, my daughter, that thou go out with his maidens, that theymeetthee not in any other field.",
        "23So she kept fast by the maidens of Boaz to glean unto the end of barley harvest and of wheat harvest; and dwelt with her mother in law."
      ],
      "full_text": "1And Naomi had a kinsman of her husbandâs, a mighty man of wealth, of the family of Elimelech; and his namewasBoaz. 2And Ruth the Moabitess said unto Naomi, Let me now go to the field, andgleanears ofcornafterhimin whose sight I shall find grace. And she said unto her, Go, my daughter. 3And she went, and came, and gleaned in the field after the reapers: and herhapwas to light on a part of the fieldbelongingunto Boaz, whowasof the kindred of Elimelech. 4Â¶And, behold, Boaz came from Beth-lehem, and said unto the reapers, TheLordbewith you. And they answered him, TheLordbless thee. 5Then said Boaz unto his servant that was set over the reapers, Whose damselisthis? 6And the servant that was set over the reapers answered and said, Itisthe Moabitish damsel that came back with Naomi out of the country of Moab: 7And she said, I pray you, let me glean and gather after the reapers among the sheaves: so she came, and hath continued even from the morning until now, that she tarried a little in the house. 8Then said Boaz unto Ruth, Hearest thou not, my daughter? Go not togleanin another field, neither go from hence, but abide herefastby my maidens: 9Letthine eyesbeon the field that they do reap, and go thou after them: have I not charged the young men that they shall not touch thee? and when thou art athirst, go unto the vessels, and drink ofthatwhich the young men have drawn. 10Then she fell on her face, and bowed herself to the ground, and said unto him, Why have I found grace in thine eyes, that thou shouldest takeknowledgeof me, seeing Iama stranger? 11And Boaz answered and said unto her, It hath fully been shewed me, all that thou hast done unto thy mother in law since the death of thine husband: andhowthou hast left thy father and thy mother, and the land of thy nativity, and art come unto a people which thou knewest not heretofore. 12TheLordrecompense thy work, and a fullrewardbe given thee of theLordGod of Israel, under whosewingsthou art come to trust. 13Then she said, Let me find favour in thy sight, my lord; for that thou hast comforted me, and for that thou hast spokenfriendlyunto thine handmaid, though I be not like unto one of thine handmaidens. 14And Boaz said unto her, At mealtime come thou hither, and eat of the bread, and dip thy morsel in the vinegar. And she sat beside the reapers: and he reached her parchedcorn,and she did eat, and was sufficed, andleft. 15And when she was risen up to glean, Boaz commanded his young men, saying, Let her glean even among the sheaves, and reproach her not: 16And let fall alsosomeof the handfuls of purpose for her, and leavethem,that she may gleanthem,and rebuke her not. 17So she gleaned in the field until even, and beat out that she had gleaned: and it was about an ephah of barley. 18Â¶And she tookitup, and went into the city: and her mother in law saw what she had gleaned: and she brought forth, and gave to her that she had reserved after she was sufficed. 19And her mother in law said unto her, Where hast thou gleaned to day? and where wroughtest thou? blessed be he that did take knowledge of thee. And sheshewedher mother in law with whom she hadwrought, and said, The manâs name with whom I wrought to dayisBoaz. 20And Naomi said unto her daughter in law, Blessedbehe of theLord, who hath notleft offhis kindness to the living and to the dead. And Naomi said unto her, The manisnear of kin unto us, one of ournextkinsmen. 21And Ruth the Moabitess said, He said unto me also, Thou shalt keepfastby my young men, until they have ended all my harvest. 22And Naomi said unto Ruth her daughter in law,It isgood, my daughter, that thou go out with his maidens, that theymeetthee not in any other field. 23So she kept fast by the maidens of Boaz to glean unto the end of barley harvest and of wheat harvest; and dwelt with her mother in law."
    },
    {
      "reference": "Ruth 3",
      "title": "Ruth 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ruth/3?lang=eng",
      "summary": "By Naomiâs instruction, Ruth lies at the feet of BoazâHe promises as a relative to take her as his wife.",
      "verses": [
        "1Then Naomi her mother in law said unto her, My daughter, shall I not seekrestfor thee, that it may be well with thee?",
        "2And nowisnot Boaz of our kindred, with whose maidens thou wast? Behold, he winnoweth barley to night in the threshingfloor.",
        "3Wash thyself therefore, and anoint thee, and put thy raiment upon thee, and get thee down to thefloor:butmake not thyself known unto the man, until he shall have done eating and drinking.",
        "4And it shall be, when he lieth down, that thou shalt mark the place where he shall lie, and thou shalt go in, and uncover his feet, and lay thee down; and he will tell thee what thou shalt do.",
        "5And she said unto her, All that thou sayest unto me I will do.",
        "6Â¶And she went down unto the floor, and did according to all that her mother in law bade her.",
        "7And when Boaz had eaten and drunk, and his heart was merry,he went to lie down at the end of the heap ofcorn: and she came softly, and uncovered his feet, and laid her down.",
        "8Â¶And it came to pass at midnight, that the man was afraid, and turned himself: and, behold, a woman lay at his feet.",
        "9And he said, Whoartthou? And she answered, IamRuth thine handmaid: spread therefore thy skirt over thine handmaid; for thouarta nearkinsman.",
        "10And he said, Blessedbethou of theLord, my daughter:forthou hast shewed more kindness in the latter end than at the beginning, inasmuch as thou followedst not young men, whether poor or rich.",
        "11And now, my daughter, fear not; I will do to thee all that thou requirest: for all the city of my people doth know that thouartavirtuouswoman.",
        "12And now it is true that Iam thynearkinsman: howbeit there is a kinsman nearer than I.",
        "13Tarry this night, and it shall be in the morning,thatif he will perform unto thee thepartof a kinsman, well; let him do the kinsmanâs part: but if he will not do the part of a kinsman to thee, then will I do the part of a kinsman to thee,astheLordliveth: lie down until the morning.",
        "14Â¶And she lay at his feet until the morning: and she rose up before one could know another. And he said, Let it not be known that a woman came into the floor.",
        "15Also he said, Bring theveilthatthou hastupon thee, and hold it. And when she held it, he measured sixmeasuresof barley, and laiditon her: and she went into the city.",
        "16And when she came to her mother in law, she said, Whoartthou, my daughter? And she told her all that the man had done to her.",
        "17And she said, These sixmeasuresof barley gave he me; for he said to me, Go not empty unto thy mother in law.",
        "18Then said she, Sit still, my daughter, until thou know how the matter will fall: for the man will not be in rest, until he have finished the thing this day."
      ],
      "full_text": "1Then Naomi her mother in law said unto her, My daughter, shall I not seekrestfor thee, that it may be well with thee? 2And nowisnot Boaz of our kindred, with whose maidens thou wast? Behold, he winnoweth barley to night in the threshingfloor. 3Wash thyself therefore, and anoint thee, and put thy raiment upon thee, and get thee down to thefloor:butmake not thyself known unto the man, until he shall have done eating and drinking. 4And it shall be, when he lieth down, that thou shalt mark the place where he shall lie, and thou shalt go in, and uncover his feet, and lay thee down; and he will tell thee what thou shalt do. 5And she said unto her, All that thou sayest unto me I will do. 6Â¶And she went down unto the floor, and did according to all that her mother in law bade her. 7And when Boaz had eaten and drunk, and his heart was merry,he went to lie down at the end of the heap ofcorn: and she came softly, and uncovered his feet, and laid her down. 8Â¶And it came to pass at midnight, that the man was afraid, and turned himself: and, behold, a woman lay at his feet. 9And he said, Whoartthou? And she answered, IamRuth thine handmaid: spread therefore thy skirt over thine handmaid; for thouarta nearkinsman. 10And he said, Blessedbethou of theLord, my daughter:forthou hast shewed more kindness in the latter end than at the beginning, inasmuch as thou followedst not young men, whether poor or rich. 11And now, my daughter, fear not; I will do to thee all that thou requirest: for all the city of my people doth know that thouartavirtuouswoman. 12And now it is true that Iam thynearkinsman: howbeit there is a kinsman nearer than I. 13Tarry this night, and it shall be in the morning,thatif he will perform unto thee thepartof a kinsman, well; let him do the kinsmanâs part: but if he will not do the part of a kinsman to thee, then will I do the part of a kinsman to thee,astheLordliveth: lie down until the morning. 14Â¶And she lay at his feet until the morning: and she rose up before one could know another. And he said, Let it not be known that a woman came into the floor. 15Also he said, Bring theveilthatthou hastupon thee, and hold it. And when she held it, he measured sixmeasuresof barley, and laiditon her: and she went into the city. 16And when she came to her mother in law, she said, Whoartthou, my daughter? And she told her all that the man had done to her. 17And she said, These sixmeasuresof barley gave he me; for he said to me, Go not empty unto thy mother in law. 18Then said she, Sit still, my daughter, until thou know how the matter will fall: for the man will not be in rest, until he have finished the thing this day."
    },
    {
      "reference": "Ruth 4",
      "title": "Ruth 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/ruth/4?lang=eng",
      "summary": "The nearest relative declines, and Boaz takes Ruth to wifeâRuth bears Obed, through whom came David the king.",
      "verses": [
        "1Then went Boaz up to thegate, and sat him down there: and, behold, thekinsmanof whom Boaz spake came by; unto whom he said,Ho, such a one! turn aside, sit down here. And he turned aside, and sat down.",
        "2And he took ten men of theeldersof the city, and said, Sit ye down here. And they sat down.",
        "3And he said unto the kinsman, Naomi, that is come again out of the country of Moab, selleth a parcel of land, whichwasour brother Elimelechâs:",
        "4And I thought to advertise thee, saying,Buyitbefore the inhabitants, and before the elders of my people. If thou wiltredeemit,redeemit:but if thou wilt not redeemit, thentell me, that I may know: forthere isnone to redeemitbeside thee; and Iamafter thee. And he said, I will redeemit.",
        "5Then said Boaz, What day thou buyest the field of the hand of Naomi, thou must buyitalso of Ruth the Moabitess, thewifeof the dead, to raise up thenameof the dead upon his inheritance.",
        "6Â¶And the kinsman said, I cannotredeemitfor myself, lest Imarmine own inheritance: redeem thou my right to thyself; for I cannot redeemit.",
        "7Now thiswas the mannerin former time in Israel concerning redeeming and concerningchanging, for to confirm all things; a man plucked off hisshoe, and gaveitto his neighbour: and thiswasa testimony in Israel.",
        "8Therefore the kinsman said unto Boaz, Buyitfor thee. So he drew off his shoe.",
        "9Â¶And Boaz said unto the elders, anduntoall the people, Yearewitnesses this day, that I have bought all thatwasElimelechâs, and all thatwasChilionâs and Mahlonâs, of the hand of Naomi.",
        "10Moreover Ruth the Moabitess, the wife of Mahlon, have I purchased to be my wife, to raise up the name of the dead upon his inheritance, that thenameof the dead be not cut off from among his brethren, and from the gate of his place: yearewitnesses this day.",
        "11And all the people thatwerein the gate, and the elders, said,We arewitnesses. TheLordmake the woman that is come into thine house like Rachel and like Leah, which two did build the house of Israel: anddo thou worthilyin Ephratah, and be famous in Beth-lehem:",
        "12And let thy house be like the house of Pharez, whom Tamar bare unto Judah, of the seed which theLordshall give thee of this young woman.",
        "13Â¶So Boaz took Ruth, and she was his wife: and when he went in unto her, theLordgave her conception, and she bare a son.",
        "14And the women said unto Naomi, BlessedbetheLord, which hath not left thee this day without a kinsman, that his name may be famous in Israel.",
        "15And he shall be unto thee a restorer ofthylife, and a nourisher of thineoldage: for thy daughter in law, which loveth thee, which is better to thee than seven sons, hath born him.",
        "16And Naomi took the child, and laid it in her bosom, and became nurse unto it.",
        "17And the women her neighbours gave it a name, saying, There is a son born to Naomi; and they called his name Obed: heisthe father of Jesse, the father of David.",
        "18Â¶Now thesearethe generations ofPharez: Pharez begat Hezron,",
        "19And Hezron begat Ram, and Ram begat Amminadab,",
        "20And Amminadab begat Nahshon, and Nahshon begat Salmon,",
        "21And Salmon begatBoaz, and Boaz begat Obed,",
        "22And Obed begat Jesse, and Jesse begat David."
      ],
      "full_text": "1Then went Boaz up to thegate, and sat him down there: and, behold, thekinsmanof whom Boaz spake came by; unto whom he said,Ho, such a one! turn aside, sit down here. And he turned aside, and sat down. 2And he took ten men of theeldersof the city, and said, Sit ye down here. And they sat down. 3And he said unto the kinsman, Naomi, that is come again out of the country of Moab, selleth a parcel of land, whichwasour brother Elimelechâs: 4And I thought to advertise thee, saying,Buyitbefore the inhabitants, and before the elders of my people. If thou wiltredeemit,redeemit:but if thou wilt not redeemit, thentell me, that I may know: forthere isnone to redeemitbeside thee; and Iamafter thee. And he said, I will redeemit. 5Then said Boaz, What day thou buyest the field of the hand of Naomi, thou must buyitalso of Ruth the Moabitess, thewifeof the dead, to raise up thenameof the dead upon his inheritance. 6Â¶And the kinsman said, I cannotredeemitfor myself, lest Imarmine own inheritance: redeem thou my right to thyself; for I cannot redeemit. 7Now thiswas the mannerin former time in Israel concerning redeeming and concerningchanging, for to confirm all things; a man plucked off hisshoe, and gaveitto his neighbour: and thiswasa testimony in Israel. 8Therefore the kinsman said unto Boaz, Buyitfor thee. So he drew off his shoe. 9Â¶And Boaz said unto the elders, anduntoall the people, Yearewitnesses this day, that I have bought all thatwasElimelechâs, and all thatwasChilionâs and Mahlonâs, of the hand of Naomi. 10Moreover Ruth the Moabitess, the wife of Mahlon, have I purchased to be my wife, to raise up the name of the dead upon his inheritance, that thenameof the dead be not cut off from among his brethren, and from the gate of his place: yearewitnesses this day. 11And all the people thatwerein the gate, and the elders, said,We arewitnesses. TheLordmake the woman that is come into thine house like Rachel and like Leah, which two did build the house of Israel: anddo thou worthilyin Ephratah, and be famous in Beth-lehem: 12And let thy house be like the house of Pharez, whom Tamar bare unto Judah, of the seed which theLordshall give thee of this young woman. 13Â¶So Boaz took Ruth, and she was his wife: and when he went in unto her, theLordgave her conception, and she bare a son. 14And the women said unto Naomi, BlessedbetheLord, which hath not left thee this day without a kinsman, that his name may be famous in Israel. 15And he shall be unto thee a restorer ofthylife, and a nourisher of thineoldage: for thy daughter in law, which loveth thee, which is better to thee than seven sons, hath born him. 16And Naomi took the child, and laid it in her bosom, and became nurse unto it. 17And the women her neighbours gave it a name, saying, There is a son born to Naomi; and they called his name Obed: heisthe father of Jesse, the father of David. 18Â¶Now thesearethe generations ofPharez: Pharez begat Hezron, 19And Hezron begat Ram, and Ram begat Amminadab, 20And Amminadab begat Nahshon, and Nahshon begat Salmon, 21And Salmon begatBoaz, and Boaz begat Obed, 22And Obed begat Jesse, and Jesse begat David."
    },
    {
      "reference": "1 Samuel 1",
      "title": "The First Book ofSamuel",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-sam/1?lang=eng",
      "summary": "Hannah prays for a son and vows to give him to the LordâEli the priest blesses herâSamuel is bornâHannah loans him to the Lord.",
      "verses": [
        "1Now there was a certain man ofRamathaim-zophim, of mount Ephraim, and his namewasElkanah, the son of Jeroham, the son of Elihu, the son of Tohu, the son of Zuph, an Ephrathite:",
        "2And he had two wives; the name of the onewasHannah, and the name of the other Peninnah: and Peninnah had children, but Hannah hadno children.",
        "3And this man went up out of his cityyearlyto worship and to sacrifice unto theLordof hosts inShiloh. And the two sons of Eli, Hophni and Phinehas, the priests of theLord,werethere.",
        "4Â¶And when the time was that Elkanah offered, he gave to Peninnah his wife, and to all her sons and her daughters, portions:",
        "5But unto Hannah he gave a worthy portion; for he loved Hannah: but theLordhad shut up her womb.",
        "6And her adversary alsoprovokedher sore, for to make her fret, because theLordhad shut up her womb.",
        "7Andashe did so year by year, when she went up to thehouseof theLord, so she provoked her; therefore she wept, and did not eat.",
        "8Then said Elkanah her husband to her, Hannah, why weepest thou? and why eatest thou not? and why is thy heart grieved?amnot I better to thee than ten sons?",
        "9Â¶So Hannah rose up after they had eaten in Shiloh, and after they had drunk. Now Eli the priest sat upon aseatby a post of the temple of theLord.",
        "10And shewasinbitternessof soul, and prayed unto theLord, and wept sore.",
        "11And shevowedavow, and said, OLordof hosts, if thou wilt indeed look on the affliction of thinehandmaid, and remember me, and not forget thine handmaid, but wilt give unto thine handmaid a man child, then I will give him unto theLordall the days of his life, and there shall norazorcome upon his head.",
        "12And it came to pass, as she continued praying before theLord, that Elimarkedher mouth.",
        "13Now Hannah, she spake in her heart; only her lips moved, but her voice was not heard: therefore Eli thought she had been drunken.",
        "14And Eli said unto her, How long wilt thou be drunken? put away thy wine from thee.",
        "15And Hannah answered and said, No, my lord, Iama woman of a sorrowful spirit: I have drunk neitherwine nor strong drink, but havepouredout my soul before theLord.",
        "16Count not thine handmaid for adaughterofBelial: for out of the abundance of my complaint and grief have I spoken hitherto.",
        "17Then Eli answered and said, Go in peace: and the God of Israel granttheethy petition that thou hast asked of him.",
        "18And she said, Let thine handmaid find grace in thy sight. So the woman went her way, and did eat, and her countenance was no moresad.",
        "19Â¶And they rose up in the morning early, and worshipped before theLord, and returned, and came to their house toRamah: and Elkanah knew Hannah his wife; and theLordrememberedher.",
        "20Wherefore it came to pass, when the time was come about after Hannah had conceived, that she bare ason, and called his name Samuel,saying,Because I have asked him of theLord.",
        "21And the man Elkanah, and all his house, went up to offer unto theLordtheyearlysacrifice, and his vow.",
        "22But Hannah went not up; for she said unto her husband,I will not go upuntil the child be weaned, andthenI will bring him, that he may appear before theLord, and there abide for ever.",
        "23And Elkanah her husband said unto her, Do what seemeth thee good; tarry until thou have weaned him; only theLordestablish his word. So the woman abode, and gave her son suck until she weaned him.",
        "24Â¶And when she had weaned him, she took him up with her, with three bullocks, and one ephah of flour, and a bottle of wine, and brought him unto the house of theLordin Shiloh: and the childwasyoung.",
        "25And they slew a bullock, and brought the child to Eli.",
        "26And she said, Oh my lord,asthy soul liveth, my lord, Iamthe woman that stood by thee here, praying unto theLord.",
        "27For thischildI prayed; and theLordhath given me my petition which I asked of him:",
        "28Therefore also I have lent him to theLord; as long as he liveth he shall belentto theLord. And he worshipped theLordthere."
      ],
      "full_text": "1Now there was a certain man ofRamathaim-zophim, of mount Ephraim, and his namewasElkanah, the son of Jeroham, the son of Elihu, the son of Tohu, the son of Zuph, an Ephrathite: 2And he had two wives; the name of the onewasHannah, and the name of the other Peninnah: and Peninnah had children, but Hannah hadno children. 3And this man went up out of his cityyearlyto worship and to sacrifice unto theLordof hosts inShiloh. And the two sons of Eli, Hophni and Phinehas, the priests of theLord,werethere. 4Â¶And when the time was that Elkanah offered, he gave to Peninnah his wife, and to all her sons and her daughters, portions: 5But unto Hannah he gave a worthy portion; for he loved Hannah: but theLordhad shut up her womb. 6And her adversary alsoprovokedher sore, for to make her fret, because theLordhad shut up her womb. 7Andashe did so year by year, when she went up to thehouseof theLord, so she provoked her; therefore she wept, and did not eat. 8Then said Elkanah her husband to her, Hannah, why weepest thou? and why eatest thou not? and why is thy heart grieved?amnot I better to thee than ten sons? 9Â¶So Hannah rose up after they had eaten in Shiloh, and after they had drunk. Now Eli the priest sat upon aseatby a post of the temple of theLord. 10And shewasinbitternessof soul, and prayed unto theLord, and wept sore. 11And shevowedavow, and said, OLordof hosts, if thou wilt indeed look on the affliction of thinehandmaid, and remember me, and not forget thine handmaid, but wilt give unto thine handmaid a man child, then I will give him unto theLordall the days of his life, and there shall norazorcome upon his head. 12And it came to pass, as she continued praying before theLord, that Elimarkedher mouth. 13Now Hannah, she spake in her heart; only her lips moved, but her voice was not heard: therefore Eli thought she had been drunken. 14And Eli said unto her, How long wilt thou be drunken? put away thy wine from thee. 15And Hannah answered and said, No, my lord, Iama woman of a sorrowful spirit: I have drunk neitherwine nor strong drink, but havepouredout my soul before theLord. 16Count not thine handmaid for adaughterofBelial: for out of the abundance of my complaint and grief have I spoken hitherto. 17Then Eli answered and said, Go in peace: and the God of Israel granttheethy petition that thou hast asked of him. 18And she said, Let thine handmaid find grace in thy sight. So the woman went her way, and did eat, and her countenance was no moresad. 19Â¶And they rose up in the morning early, and worshipped before theLord, and returned, and came to their house toRamah: and Elkanah knew Hannah his wife; and theLordrememberedher. 20Wherefore it came to pass, when the time was come about after Hannah had conceived, that she bare ason, and called his name Samuel,saying,Because I have asked him of theLord. 21And the man Elkanah, and all his house, went up to offer unto theLordtheyearlysacrifice, and his vow. 22But Hannah went not up; for she said unto her husband,I will not go upuntil the child be weaned, andthenI will bring him, that he may appear before theLord, and there abide for ever. 23And Elkanah her husband said unto her, Do what seemeth thee good; tarry until thou have weaned him; only theLordestablish his word. So the woman abode, and gave her son suck until she weaned him. 24Â¶And when she had weaned him, she took him up with her, with three bullocks, and one ephah of flour, and a bottle of wine, and brought him unto the house of theLordin Shiloh: and the childwasyoung. 25And they slew a bullock, and brought the child to Eli. 26And she said, Oh my lord,asthy soul liveth, my lord, Iamthe woman that stood by thee here, praying unto theLord. 27For thischildI prayed; and theLordhath given me my petition which I asked of him: 28Therefore also I have lent him to theLord; as long as he liveth he shall belentto theLord. And he worshipped theLordthere."
    },
    {
      "reference": "1 Samuel 2",
      "title": "1 Samuel 2",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-sam/2?lang=eng",
      "summary": "Hannah sings praises to the LordâSamuel ministers before the LordâEli blesses Elkanah and Hannah, and they have sons and daughtersâThe sons of Eli reject the Lord and live in wickednessâThe Lord rejects the house of Eli.",
      "verses": [
        "1And Hannahprayed, and said, My heartrejoicethin theLord, minehornis exalted in theLord: my mouth is enlarged over mine enemies; because I rejoice in thysalvation.",
        "2There isnoneholy as theLord: forthere isnone beside thee: neitheris thereanyrocklike our God.",
        "3Talk no more so exceeding proudly; letnotarrogancy come out of your mouth: for theLordisa God ofknowledge, and by himactionsare weighed.",
        "4The bows of the mighty menarebroken, and they that stumbled are girded with strength.",
        "5They that werefull have hired out themselves for bread; andthey that werehungry ceased: so that thebarrenhath born seven; and she that hath many children is waxed feeble.",
        "6TheLordkilleth, and maketh alive: hebringethdown to the grave, and bringeth up.",
        "7TheLordmakethpoor, and makethrich: he bringeth low, and lifteth up.",
        "8Heraisethup thepoorout of the dust,andlifteth up the beggar from the dunghill, to setthemamong princes, and to make them inherit the throne of glory: for thepillarsof the eartharetheLordâs, and he hath set the world upon them.",
        "9He will keep the feet of his saints, and the wicked shall besilentin darkness; for bystrengthshall no man prevail.",
        "10The adversaries of theLordshall be broken to pieces; out of heaven shall he thunder upon them: theLordshalljudgethe ends of the earth; and he shall give strength unto his king, and exalt the horn of hisanointed.",
        "11And Elkanah went to Ramah to his house.Andthe child did minister unto theLordbefore Eli the priest.",
        "12Â¶Now thesonsof EliweresonsofBelial; they knew not theLord.",
        "13And the priestsâ custom with the peoplewas, that,when any man offered sacrifice, the priestâs servant came, while the flesh wasin seething, with a fleshhook of three teeth in his hand;",
        "14And he struckitinto the pan, or kettle, or caldron, or pot; all that the fleshhook brought up the priesttookfor himself. So they did in Shiloh unto all the Israelites that came thither.",
        "15Also before they burnt the fat, the priestâs servant came, and said to the man that sacrificed, Give flesh to roast for the priest; for he will not havesoddenflesh of thee, but raw.",
        "16Andifany man said unto him, Let them not fail to burn the fatpresently, andthentakeas muchas thy soul desireth; then he would answer him,Nay;but thou shalt giveit menow: and if not, I will takeitby force.",
        "17Wherefore the sin of the young men was very great before theLord: for menabhorredthe offering of theLord.",
        "18Â¶But Samuel ministered before theLord,beinga child, girded with a linenephod.",
        "19Moreover hismothermade him a little coat, and broughtitto him from year to year, when she came up with her husband to offer the yearly sacrifice.",
        "20Â¶And EliblessedElkanah and his wife, and said, TheLordgive thee seed of this woman forthe loanwhich islentto theLord. And they went unto their own home.",
        "21And theLordvisitedHannah, so that she conceived, and bare three sons and two daughters. Andthe child Samuel grew before theLord.",
        "22Â¶Now Eli was very old, and heard all that his sons did unto all Israel; and how they lay with the women that assembledatthe door of the tabernacle of the congregation.",
        "23And he said unto them, Why do ye such things? for I hear of your evil dealings by all this people.",
        "24Nay, my sons; forit isno good report that I hear: ye make theLordâs people totransgress.",
        "25If one man sin against another, the judge shalljudgehim: but if a man sin against theLord, who shall entreat for him? Notwithstanding they hearkened not unto the voice of their father, because theLordwould slay them.",
        "26And the child Samuelgrewon, and was infavourboth with theLord, and also with men.",
        "27Â¶And there came a man of God unto Eli, and said unto him, Thus saith theLord, Did I plainly appear unto the house of thy father, when they were in Egypt in Pharaohâs house?",
        "28And did Ichoosehim out of all the tribes of Israelto bemy priest, to offer upon mine altar, to burn incense, to wear anephodbefore me? and did I give unto the house of thy father all theofferingsmade by fire of the children of Israel?",
        "29Whereforekick ye atmy sacrifice and at mine offering, which I have commandedin myhabitation; andhonourestthy sons above me, to make yourselves fat with the chiefest of all the offerings of Israel my people?",
        "30Wherefore theLordGod of Israel saith, I said indeedthatthy house, and thehouseof thy father, shouldwalkbefore me for ever: but now theLordsaith, Be it far from me; for them thathonourme I will honour, and they that despise me shall be lightlyesteemed.",
        "31Behold, thedayscome, that I willcut offthine arm, and the arm of thy fatherâs house, that there shall not be an old man in thine house.",
        "32And thou shalt see an enemyin myhabitation, in allthe wealthwhichGodshall give Israel: and there shall not be an old man in thine house for ever.",
        "33And the man of thine,whomI shall not cut off from mine altar,shall beto consume thine eyes, and to grieve thine heart: and all the increase of thine house shall die in the flower of their age.",
        "34And thisshall bea sign unto thee, that shall come upon thy two sons, on Hophni and Phinehas; in one day they shalldieboth of them.",
        "35And I willraiseme up a faithfulpriest,thatshall do according tothatwhichisin mine heart and in my mind: andIwill build him a sure house; and he shall walk before mine anointed for ever.",
        "36And it shall come to pass,thatevery one that is left in thine house shall comeandcrouch to him for a piece of silver and a morsel of bread, and shall say, Put me, I pray thee, into one of the priestsâ offices, that I may eat a piece of bread."
      ],
      "full_text": "1And Hannahprayed, and said, My heartrejoicethin theLord, minehornis exalted in theLord: my mouth is enlarged over mine enemies; because I rejoice in thysalvation. 2There isnoneholy as theLord: forthere isnone beside thee: neitheris thereanyrocklike our God. 3Talk no more so exceeding proudly; letnotarrogancy come out of your mouth: for theLordisa God ofknowledge, and by himactionsare weighed. 4The bows of the mighty menarebroken, and they that stumbled are girded with strength. 5They that werefull have hired out themselves for bread; andthey that werehungry ceased: so that thebarrenhath born seven; and she that hath many children is waxed feeble. 6TheLordkilleth, and maketh alive: hebringethdown to the grave, and bringeth up. 7TheLordmakethpoor, and makethrich: he bringeth low, and lifteth up. 8Heraisethup thepoorout of the dust,andlifteth up the beggar from the dunghill, to setthemamong princes, and to make them inherit the throne of glory: for thepillarsof the eartharetheLordâs, and he hath set the world upon them. 9He will keep the feet of his saints, and the wicked shall besilentin darkness; for bystrengthshall no man prevail. 10The adversaries of theLordshall be broken to pieces; out of heaven shall he thunder upon them: theLordshalljudgethe ends of the earth; and he shall give strength unto his king, and exalt the horn of hisanointed. 11And Elkanah went to Ramah to his house.Andthe child did minister unto theLordbefore Eli the priest. 12Â¶Now thesonsof EliweresonsofBelial; they knew not theLord. 13And the priestsâ custom with the peoplewas, that,when any man offered sacrifice, the priestâs servant came, while the flesh wasin seething, with a fleshhook of three teeth in his hand; 14And he struckitinto the pan, or kettle, or caldron, or pot; all that the fleshhook brought up the priesttookfor himself. So they did in Shiloh unto all the Israelites that came thither. 15Also before they burnt the fat, the priestâs servant came, and said to the man that sacrificed, Give flesh to roast for the priest; for he will not havesoddenflesh of thee, but raw. 16Andifany man said unto him, Let them not fail to burn the fatpresently, andthentakeas muchas thy soul desireth; then he would answer him,Nay;but thou shalt giveit menow: and if not, I will takeitby force. 17Wherefore the sin of the young men was very great before theLord: for menabhorredthe offering of theLord. 18Â¶But Samuel ministered before theLord,beinga child, girded with a linenephod. 19Moreover hismothermade him a little coat, and broughtitto him from year to year, when she came up with her husband to offer the yearly sacrifice. 20Â¶And EliblessedElkanah and his wife, and said, TheLordgive thee seed of this woman forthe loanwhich islentto theLord. And they went unto their own home. 21And theLordvisitedHannah, so that she conceived, and bare three sons and two daughters. Andthe child Samuel grew before theLord. 22Â¶Now Eli was very old, and heard all that his sons did unto all Israel; and how they lay with the women that assembledatthe door of the tabernacle of the congregation. 23And he said unto them, Why do ye such things? for I hear of your evil dealings by all this people. 24Nay, my sons; forit isno good report that I hear: ye make theLordâs people totransgress. 25If one man sin against another, the judge shalljudgehim: but if a man sin against theLord, who shall entreat for him? Notwithstanding they hearkened not unto the voice of their father, because theLordwould slay them. 26And the child Samuelgrewon, and was infavourboth with theLord, and also with men. 27Â¶And there came a man of God unto Eli, and said unto him, Thus saith theLord, Did I plainly appear unto the house of thy father, when they were in Egypt in Pharaohâs house? 28And did Ichoosehim out of all the tribes of Israelto bemy priest, to offer upon mine altar, to burn incense, to wear anephodbefore me? and did I give unto the house of thy father all theofferingsmade by fire of the children of Israel? 29Whereforekick ye atmy sacrifice and at mine offering, which I have commandedin myhabitation; andhonourestthy sons above me, to make yourselves fat with the chiefest of all the offerings of Israel my people? 30Wherefore theLordGod of Israel saith, I said indeedthatthy house, and thehouseof thy father, shouldwalkbefore me for ever: but now theLordsaith, Be it far from me; for them thathonourme I will honour, and they that despise me shall be lightlyesteemed. 31Behold, thedayscome, that I willcut offthine arm, and the arm of thy fatherâs house, that there shall not be an old man in thine house. 32And thou shalt see an enemyin myhabitation, in allthe wealthwhichGodshall give Israel: and there shall not be an old man in thine house for ever. 33And the man of thine,whomI shall not cut off from mine altar,shall beto consume thine eyes, and to grieve thine heart: and all the increase of thine house shall die in the flower of their age. 34And thisshall bea sign unto thee, that shall come upon thy two sons, on Hophni and Phinehas; in one day they shalldieboth of them. 35And I willraiseme up a faithfulpriest,thatshall do according tothatwhichisin mine heart and in my mind: andIwill build him a sure house; and he shall walk before mine anointed for ever. 36And it shall come to pass,thatevery one that is left in thine house shall comeandcrouch to him for a piece of silver and a morsel of bread, and shall say, Put me, I pray thee, into one of the priestsâ offices, that I may eat a piece of bread."
    },
    {
      "reference": "1 Samuel 3",
      "title": "1 Samuel 3",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-sam/3?lang=eng",
      "summary": "The Lord calls SamuelâThe house of Eli will not be purged by sacrifices and offeringsâSamuel is recognized as a prophet by all IsraelâThe Lord appears to him.",
      "verses": [
        "1And the child Samuel ministered unto theLordbefore Eli. And the word of theLordwas precious in those days;there wasno openvision.",
        "2And it came to pass at that time, when Eliwaslaid down in his place, and hiseyesbegan to wax dim,thathe could not see;",
        "3And ere thelampof God went out in the temple of theLord, where the ark of Godwas,and Samuel was laid downto sleep;",
        "4That theLordcalled Samuel: and he answered, HereamI.",
        "5And he ran unto Eli, and said, HereamI; for thou calledst me. And he said, I called not; lie down again. And he went and lay down.",
        "6And theLordcalled yet again, Samuel. And Samuel arose and went to Eli, and said, HereamI; for thou didst call me. And he answered, I called not, my son; lie down again.",
        "7Now Samuel did not yet know theLord, neither was the word of theLordyet revealed unto him.",
        "8And theLordcalled Samuel again the third time. And he arose and went to Eli, and said, HereamI; for thou didst call me. And Eli perceived that theLordhad called the child.",
        "9Therefore Eli said unto Samuel, Go, lie down: and it shall be, if he call thee, that thou shalt say, Speak,Lord; for thy servant heareth. So Samuel went and lay down in his place.",
        "10And theLordcame, andstood, and called as at other times, Samuel, Samuel. Then Samuel answered, Speak; for thyservantheareth.",
        "11Â¶And theLordsaid to Samuel, Behold, I will do a thing in Israel, at which both the ears of every one that heareth it shalltingle.",
        "12In that day I will performagainstEli allthingswhich I have spoken concerning his house: when I begin, I will also make an end.",
        "13For I have told him that I willjudgehis house for ever for the iniquity which he knoweth; because hissonsmade themselves vile, and herestrainedthem not.",
        "14And therefore I have sworn unto the house of Eli, that the iniquity of Eliâs house shall not be purged with sacrifice nor offering for ever.",
        "15Â¶And Samuel lay until the morning, and opened the doors of the house of theLord. And Samuelfearedto shew Eli the vision.",
        "16Then Eli called Samuel, and said, Samuel, my son. And he answered, HereamI.",
        "17And he said, Whatisthe thing thattheLordhath said unto thee? I pray thee hideitnot from me: God do so to thee, and more also, if thou hideanything from me of all the things that he said unto thee.",
        "18And Samuel told him every whit, and hid nothing from him. And he said, ItistheLord: let him do what seemeth him good.",
        "19Â¶And Samuelgrew, and theLordwaswithhim, and did let none of his wordsfallto the ground.",
        "20And all Israel from Dan even to Beer-sheba knew that Samuelwasestablishedto bea prophet of theLord.",
        "21And theLordappearedagain inShiloh: for theLordrevealed himself to Samuel in Shiloh by thewordof theLord."
      ],
      "full_text": "1And the child Samuel ministered unto theLordbefore Eli. And the word of theLordwas precious in those days;there wasno openvision. 2And it came to pass at that time, when Eliwaslaid down in his place, and hiseyesbegan to wax dim,thathe could not see; 3And ere thelampof God went out in the temple of theLord, where the ark of Godwas,and Samuel was laid downto sleep; 4That theLordcalled Samuel: and he answered, HereamI. 5And he ran unto Eli, and said, HereamI; for thou calledst me. And he said, I called not; lie down again. And he went and lay down. 6And theLordcalled yet again, Samuel. And Samuel arose and went to Eli, and said, HereamI; for thou didst call me. And he answered, I called not, my son; lie down again. 7Now Samuel did not yet know theLord, neither was the word of theLordyet revealed unto him. 8And theLordcalled Samuel again the third time. And he arose and went to Eli, and said, HereamI; for thou didst call me. And Eli perceived that theLordhad called the child. 9Therefore Eli said unto Samuel, Go, lie down: and it shall be, if he call thee, that thou shalt say, Speak,Lord; for thy servant heareth. So Samuel went and lay down in his place. 10And theLordcame, andstood, and called as at other times, Samuel, Samuel. Then Samuel answered, Speak; for thyservantheareth. 11Â¶And theLordsaid to Samuel, Behold, I will do a thing in Israel, at which both the ears of every one that heareth it shalltingle. 12In that day I will performagainstEli allthingswhich I have spoken concerning his house: when I begin, I will also make an end. 13For I have told him that I willjudgehis house for ever for the iniquity which he knoweth; because hissonsmade themselves vile, and herestrainedthem not. 14And therefore I have sworn unto the house of Eli, that the iniquity of Eliâs house shall not be purged with sacrifice nor offering for ever. 15Â¶And Samuel lay until the morning, and opened the doors of the house of theLord. And Samuelfearedto shew Eli the vision. 16Then Eli called Samuel, and said, Samuel, my son. And he answered, HereamI. 17And he said, Whatisthe thing thattheLordhath said unto thee? I pray thee hideitnot from me: God do so to thee, and more also, if thou hideanything from me of all the things that he said unto thee. 18And Samuel told him every whit, and hid nothing from him. And he said, ItistheLord: let him do what seemeth him good. 19Â¶And Samuelgrew, and theLordwaswithhim, and did let none of his wordsfallto the ground. 20And all Israel from Dan even to Beer-sheba knew that Samuelwasestablishedto bea prophet of theLord. 21And theLordappearedagain inShiloh: for theLordrevealed himself to Samuel in Shiloh by thewordof theLord."
    },
    {
      "reference": "1 Samuel 4",
      "title": "1 Samuel 4",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-sam/4?lang=eng",
      "summary": "The Israelites are smitten and defeated by the Philistines, who also capture the ark of GodâEliâs sons are slain, Eli dies in an accident, and his daughter-in-law dies in childbirth.",
      "verses": [
        "1And the word of Samuel came to all Israel. Now Israel went out against the Philistines to battle, and pitched besideEben-ezer: and the Philistines pitched inAphek.",
        "2And the Philistines put themselves in array against Israel: and when they joined battle, Israel was smitten before the Philistines: and they slew of the army in the field about four thousand men.",
        "3Â¶And when the people were come into the camp, the elders of Israel said, Wherefore hath theLordsmitten us to day before the Philistines? Let us fetch thearkof the covenant of theLordout of Shiloh unto us, that, when it cometh among us, it may save us out of the hand of our enemies.",
        "4So the people sent to Shiloh, that they might bring from thence the ark of the covenant of theLordof hosts, which dwellethbetweenthecherubims: and the two sons of Eli, Hophni and Phinehas,werethere with the ark of the covenant of God.",
        "5And when the ark of the covenant of theLordcame into the camp, all Israel shouted with a great shout, so that the earth rang again.",
        "6And when the Philistines heard the noise of the shout, they said, Whatmeaneththe noise of this great shout in the camp of the Hebrews? And they understood that the ark of theLordwas come into the camp.",
        "7And the Philistines were afraid, for they said, God is come into the camp. And they said, Woe unto us! for there hath not been such a thing heretofore.",
        "8Woe unto us! who shall deliver us out of the hand of thesemighty Gods? thesearethe Gods that smote the Egyptians with all the plagues in the wilderness.",
        "9Be strong, andquityourselves likemen, O ye Philistines, that ye be notservantsunto the Hebrews, as they have been to you: quit yourselves like men, and fight.",
        "10Â¶And the Philistines fought, and Israel was smitten, and they fled every man into his tent: and there was a very great slaughter; for there fell of Israel thirty thousand footmen.",
        "11And the ark of God was taken; and the two sons of Eli, Hophni and Phinehas, wereslain.",
        "12Â¶And there ran a man of Benjamin out of the army, and came to Shiloh the same day with his clothesrent, and with earth upon his head.",
        "13And when he came, lo, Eli sat upon a seat by the wayside watching: for his heart trembled for the ark of God. And when the man came into the city, and toldit,all the city cried out.",
        "14And when Eli heard the noise of the crying, he said, Whatmeaneththe noise of this tumult? And the man came in hastily, and told Eli.",
        "15Now Eli was ninety and eight years old; and hiseyeswere dim, that he could not see.",
        "16And the man said unto Eli, Iamhe that came out of the army, and I fled to day out of the army. And he said, What is there done, my son?",
        "17And the messenger answered and said, Israel is fled before the Philistines, and there hath been also a great slaughter among the people, and thy two sons also, Hophni and Phinehas, are dead, and the ark of God is taken.",
        "18And it came to pass, when he made mention of the ark of God, that he fell from off theseatbackward by the side of the gate, and hisneck brake, and he died: for he was an old man, and heavy. And he had judged Israel forty years.",
        "19Â¶And his daughter in law, Phinehasâ wife, was with child,nearto be delivered: and when she heard the tidings that the ark of God was taken, and that her father in law and her husband were dead, she bowed herself and travailed; for her pains came upon her.",
        "20And about the time of her death the women that stood by her said unto her, Fear not; for thou hast born a son. But she answered not, neither did she regardit.",
        "21And she named the childI-chabod, saying, The glory is departed from Israel: because the ark of God was taken, and because of her father in law and her husband.",
        "22And she said, The glory is departed from Israel: for the ark of God is taken."
      ],
      "full_text": "1And the word of Samuel came to all Israel. Now Israel went out against the Philistines to battle, and pitched besideEben-ezer: and the Philistines pitched inAphek. 2And the Philistines put themselves in array against Israel: and when they joined battle, Israel was smitten before the Philistines: and they slew of the army in the field about four thousand men. 3Â¶And when the people were come into the camp, the elders of Israel said, Wherefore hath theLordsmitten us to day before the Philistines? Let us fetch thearkof the covenant of theLordout of Shiloh unto us, that, when it cometh among us, it may save us out of the hand of our enemies. 4So the people sent to Shiloh, that they might bring from thence the ark of the covenant of theLordof hosts, which dwellethbetweenthecherubims: and the two sons of Eli, Hophni and Phinehas,werethere with the ark of the covenant of God. 5And when the ark of the covenant of theLordcame into the camp, all Israel shouted with a great shout, so that the earth rang again. 6And when the Philistines heard the noise of the shout, they said, Whatmeaneththe noise of this great shout in the camp of the Hebrews? And they understood that the ark of theLordwas come into the camp. 7And the Philistines were afraid, for they said, God is come into the camp. And they said, Woe unto us! for there hath not been such a thing heretofore. 8Woe unto us! who shall deliver us out of the hand of thesemighty Gods? thesearethe Gods that smote the Egyptians with all the plagues in the wilderness. 9Be strong, andquityourselves likemen, O ye Philistines, that ye be notservantsunto the Hebrews, as they have been to you: quit yourselves like men, and fight. 10Â¶And the Philistines fought, and Israel was smitten, and they fled every man into his tent: and there was a very great slaughter; for there fell of Israel thirty thousand footmen. 11And the ark of God was taken; and the two sons of Eli, Hophni and Phinehas, wereslain. 12Â¶And there ran a man of Benjamin out of the army, and came to Shiloh the same day with his clothesrent, and with earth upon his head. 13And when he came, lo, Eli sat upon a seat by the wayside watching: for his heart trembled for the ark of God. And when the man came into the city, and toldit,all the city cried out. 14And when Eli heard the noise of the crying, he said, Whatmeaneththe noise of this tumult? And the man came in hastily, and told Eli. 15Now Eli was ninety and eight years old; and hiseyeswere dim, that he could not see. 16And the man said unto Eli, Iamhe that came out of the army, and I fled to day out of the army. And he said, What is there done, my son? 17And the messenger answered and said, Israel is fled before the Philistines, and there hath been also a great slaughter among the people, and thy two sons also, Hophni and Phinehas, are dead, and the ark of God is taken. 18And it came to pass, when he made mention of the ark of God, that he fell from off theseatbackward by the side of the gate, and hisneck brake, and he died: for he was an old man, and heavy. And he had judged Israel forty years. 19Â¶And his daughter in law, Phinehasâ wife, was with child,nearto be delivered: and when she heard the tidings that the ark of God was taken, and that her father in law and her husband were dead, she bowed herself and travailed; for her pains came upon her. 20And about the time of her death the women that stood by her said unto her, Fear not; for thou hast born a son. But she answered not, neither did she regardit. 21And she named the childI-chabod, saying, The glory is departed from Israel: because the ark of God was taken, and because of her father in law and her husband. 22And she said, The glory is departed from Israel: for the ark of God is taken."
    },
    {
      "reference": "1 Samuel 5",
      "title": "1 Samuel 5",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-sam/5?lang=eng",
      "summary": "The Philistines place the ark in the house of Dagon, their godâThe Philistines in Ashdod, then Gath, and then Ekron are plagued and slain because the ark is lodged with them.",
      "verses": [
        "1And the Philistines took thearkof God, and brought it fromEben-ezerunto Ashdod.",
        "2When the Philistines took thearkof God, they brought it into the house ofDagon, and set it by Dagon.",
        "3Â¶And when they of Ashdod arose early on the morrow, behold, Dagonwasfallen upon his face to the earth before the ark of theLord. And they took Dagon, and set him in his place again.",
        "4And when they arose early on the morrow morning, behold, Dagonwasfallen upon his face to the ground before the ark of theLord; and the head of Dagon and both the palms of his handswerecut off upon the threshold; onlythe stump ofDagon was left to him.",
        "5Therefore neither the priests of Dagon, nor any that come into Dagonâs house, tread on the threshold of Dagon in Ashdod unto this day.",
        "6But the hand of theLordwas heavy upon them of Ashdod, and he destroyed them, and smote them withemerods,evenAshdod and the coasts thereof.",
        "7And when the men of Ashdod saw thatit wasso, they said, The ark of the God of Israel shall not abide with us: for his hand is sore upon us, and upon Dagon our god.",
        "8They sent therefore and gathered all the lords of the Philistines unto them, and said, What shall we do with the ark of the God of Israel? And they answered, Let the ark of the God of Israel be carried about untoGath. And they carried the ark of the God of Israel aboutthither.",
        "9And it wasso,that, after they had carried it about, thehandof theLordwas against the city with a very great destruction: and he smote the men of the city, both small and great, and they had emerods in their secret parts.",
        "10Â¶Therefore they sent the ark of God to Ekron. And it came to pass, as the ark of God came to Ekron, that the Ekronites cried out, saying, They have brought about the ark of the God of Israel to us, to slay us and our people.",
        "11So they sent and gathered together all the lords of the Philistines, and said, Send away the ark of the God of Israel, and let it go again to his own place, that it slay us not, and our people: for there was a deadly destruction throughout all the city; the hand of God was very heavy there.",
        "12And the men that died not were smitten with the emerods: and the cry of the city went up to heaven."
      ],
      "full_text": "1And the Philistines took thearkof God, and brought it fromEben-ezerunto Ashdod. 2When the Philistines took thearkof God, they brought it into the house ofDagon, and set it by Dagon. 3Â¶And when they of Ashdod arose early on the morrow, behold, Dagonwasfallen upon his face to the earth before the ark of theLord. And they took Dagon, and set him in his place again. 4And when they arose early on the morrow morning, behold, Dagonwasfallen upon his face to the ground before the ark of theLord; and the head of Dagon and both the palms of his handswerecut off upon the threshold; onlythe stump ofDagon was left to him. 5Therefore neither the priests of Dagon, nor any that come into Dagonâs house, tread on the threshold of Dagon in Ashdod unto this day. 6But the hand of theLordwas heavy upon them of Ashdod, and he destroyed them, and smote them withemerods,evenAshdod and the coasts thereof. 7And when the men of Ashdod saw thatit wasso, they said, The ark of the God of Israel shall not abide with us: for his hand is sore upon us, and upon Dagon our god. 8They sent therefore and gathered all the lords of the Philistines unto them, and said, What shall we do with the ark of the God of Israel? And they answered, Let the ark of the God of Israel be carried about untoGath. And they carried the ark of the God of Israel aboutthither. 9And it wasso,that, after they had carried it about, thehandof theLordwas against the city with a very great destruction: and he smote the men of the city, both small and great, and they had emerods in their secret parts. 10Â¶Therefore they sent the ark of God to Ekron. And it came to pass, as the ark of God came to Ekron, that the Ekronites cried out, saying, They have brought about the ark of the God of Israel to us, to slay us and our people. 11So they sent and gathered together all the lords of the Philistines, and said, Send away the ark of the God of Israel, and let it go again to his own place, that it slay us not, and our people: for there was a deadly destruction throughout all the city; the hand of God was very heavy there. 12And the men that died not were smitten with the emerods: and the cry of the city went up to heaven."
    },
    {
      "reference": "1 Samuel 6",
      "title": "1 Samuel 6",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-sam/6?lang=eng",
      "summary": "The Philistines send back the ark with an offeringâThe Lord smites and slays the Israelites in Beth-shemesh who look into the ark.",
      "verses": [
        "1And the ark of theLordwas in the country of the Philistines seven months.",
        "2And the Philistines called for the priests and thediviners, saying, What shall we do to the ark of theLord? tell us wherewith we shall send it to his place.",
        "3And they said, If ye send away the ark of the God of Israel, send it not empty; but in any wise return him atrespass offering: then ye shall be healed, and it shall be known to you why his hand is not removed from you.",
        "4Then said they, Whatshall bethe trespass offering which we shall return to him? They answered, Five golden emerods, and five golden mice,according tothe number of the lords of the Philistines: for one plaguewason you all, and on your lords.",
        "5Wherefore ye shall make images of your emerods, and images of your mice that mar the land; and ye shall givegloryunto the God of Israel: peradventure he will lighten his hand from off you, and from off your gods, and from off your land.",
        "6Wherefore then do yehardenyour hearts, as the Egyptians and Pharaohhardenedtheir hearts? when he had wrought wonderfully among them, did they not let the people go, and they departed?",
        "7Now therefore make a new cart, and take twomilch kine, on which there hath come no yoke, and tie the kine to the cart, and bring their calves home from them:",
        "8And take the ark of theLord, and lay it upon the cart; and put the jewels of gold, which ye return himfora trespass offering, in acofferby the side thereof; and send it away, that it may go.",
        "9And see, if it goeth up by the way of his own coast to Beth-shemesh,thenhe hath done us this great evil: but if not, then we shall know thatit isnot his handthatsmote us; itwasa chancethathappened to us.",
        "10Â¶And the men did so; and took two milch kine, and tied them to the cart, and shut up their calves at home:",
        "11And they laid the ark of theLordupon the cart, and the coffer with the mice of gold and the images of theiremerods.",
        "12And the kine took the straight way to the way of Beth-shemesh,andwent along the highway, lowing as they went, and turned not asidetothe right hand ortothe left; and the lords of the Philistines went after them unto the border of Beth-shemesh.",
        "13Andthey ofBeth-shemeshwerereaping their wheat harvest in the valley: and they lifted up their eyes, and saw the ark, and rejoiced to seeit.",
        "14And the cart came into the field of Joshua, a Beth-shemite, and stood there, wherethere wasa great stone: and theyclavethe wood of the cart, and offered the kine a burnt offering unto theLord.",
        "15And the Levites took down the ark of theLord, and the coffer thatwaswith it, wherein the jewels of goldwere,and putthemon the great stone: and the men of Beth-shemesh offered burnt offerings and sacrificed sacrifices the same day unto theLord.",
        "16And when the five lords of the Philistines had seenit,they returned to Ekron the same day.",
        "17And thesearethe golden emerods which the Philistines returnedfora trespass offering unto theLord; for Ashdod one, for Gaza one, for Askelon one, for Gath one, for Ekron one;",
        "18And the golden mice,accordingtothe number of all the cities of the Philistinesbelongingto the five lords,bothoffencedcities, and of country villages, even unto the greatstone ofAbel, whereon they set down the ark of theLord:which stone remainethunto this day in the field of Joshua, the Beth-shemite.",
        "19Â¶And hesmotethe men of Beth-shemesh, because they hadlookedinto the ark of theLord, even he smote of the people fifty thousand and threescore and ten men: and the people lamented, because theLordhad smittenmanyof the people with a great slaughter.",
        "20And the men of Beth-shemesh said, Who is able to stand before this holyLordGod? and to whom shall he go up from us?",
        "21Â¶And they sent messengers to the inhabitants of Kirjath-jearim, saying, The Philistines have brought again thearkof theLord; come ye down,andfetch it up to you."
      ],
      "full_text": "1And the ark of theLordwas in the country of the Philistines seven months. 2And the Philistines called for the priests and thediviners, saying, What shall we do to the ark of theLord? tell us wherewith we shall send it to his place. 3And they said, If ye send away the ark of the God of Israel, send it not empty; but in any wise return him atrespass offering: then ye shall be healed, and it shall be known to you why his hand is not removed from you. 4Then said they, Whatshall bethe trespass offering which we shall return to him? They answered, Five golden emerods, and five golden mice,according tothe number of the lords of the Philistines: for one plaguewason you all, and on your lords. 5Wherefore ye shall make images of your emerods, and images of your mice that mar the land; and ye shall givegloryunto the God of Israel: peradventure he will lighten his hand from off you, and from off your gods, and from off your land. 6Wherefore then do yehardenyour hearts, as the Egyptians and Pharaohhardenedtheir hearts? when he had wrought wonderfully among them, did they not let the people go, and they departed? 7Now therefore make a new cart, and take twomilch kine, on which there hath come no yoke, and tie the kine to the cart, and bring their calves home from them: 8And take the ark of theLord, and lay it upon the cart; and put the jewels of gold, which ye return himfora trespass offering, in acofferby the side thereof; and send it away, that it may go. 9And see, if it goeth up by the way of his own coast to Beth-shemesh,thenhe hath done us this great evil: but if not, then we shall know thatit isnot his handthatsmote us; itwasa chancethathappened to us. 10Â¶And the men did so; and took two milch kine, and tied them to the cart, and shut up their calves at home: 11And they laid the ark of theLordupon the cart, and the coffer with the mice of gold and the images of theiremerods. 12And the kine took the straight way to the way of Beth-shemesh,andwent along the highway, lowing as they went, and turned not asidetothe right hand ortothe left; and the lords of the Philistines went after them unto the border of Beth-shemesh. 13Andthey ofBeth-shemeshwerereaping their wheat harvest in the valley: and they lifted up their eyes, and saw the ark, and rejoiced to seeit. 14And the cart came into the field of Joshua, a Beth-shemite, and stood there, wherethere wasa great stone: and theyclavethe wood of the cart, and offered the kine a burnt offering unto theLord. 15And the Levites took down the ark of theLord, and the coffer thatwaswith it, wherein the jewels of goldwere,and putthemon the great stone: and the men of Beth-shemesh offered burnt offerings and sacrificed sacrifices the same day unto theLord. 16And when the five lords of the Philistines had seenit,they returned to Ekron the same day. 17And thesearethe golden emerods which the Philistines returnedfora trespass offering unto theLord; for Ashdod one, for Gaza one, for Askelon one, for Gath one, for Ekron one; 18And the golden mice,accordingtothe number of all the cities of the Philistinesbelongingto the five lords,bothoffencedcities, and of country villages, even unto the greatstone ofAbel, whereon they set down the ark of theLord:which stone remainethunto this day in the field of Joshua, the Beth-shemite. 19Â¶And hesmotethe men of Beth-shemesh, because they hadlookedinto the ark of theLord, even he smote of the people fifty thousand and threescore and ten men: and the people lamented, because theLordhad smittenmanyof the people with a great slaughter. 20And the men of Beth-shemesh said, Who is able to stand before this holyLordGod? and to whom shall he go up from us? 21Â¶And they sent messengers to the inhabitants of Kirjath-jearim, saying, The Philistines have brought again thearkof theLord; come ye down,andfetch it up to you."
    },
    {
      "reference": "1 Samuel 7",
      "title": "1 Samuel 7",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/1-sam/7?lang=eng",
      "summary": "Samuel exhorts Israel to forsake Ashtaroth and Baalim and serve the LordâIsrael fasts and seeks the LordâThe Philistines are subduedâSamuel judges Israel.",
      "verses": [
        "1And the men of Kirjath-jearim came, and fetched up thearkof theLord, and brought it into the house of Abinadab in the hill, and sanctified Eleazar his son to keep the ark of theLord.",
        "2And it came to pass, while the ark abode in Kirjath-jearim, that the time was long; for it was twenty years: and all the house of Israel lamented after theLord.",
        "3Â¶And Samuel spake unto all the house of Israel, saying, If ye doreturnunto theLordwith all your hearts,thenput awaythe strangegodsandAshtarothfrom among you, and prepare yourheartsunto theLord, andservehim only: and he will deliver you out of the hand of the Philistines.",
        "4Then the children of Israel did put awayBaalimand Ashtaroth, and served theLordonly.",
        "5And Samuel said, Gather all Israel toMizpeh, and I willprayfor you unto theLord.",
        "6And they gathered together to Mizpeh, and drew water, and poureditout before theLord, and fasted on that day, and said there, We havesinnedagainst theLord. And Samuel judged the children of Israel in Mizpeh.",
        "7And when the Philistines heard that the children of Israel were gathered together to Mizpeh, the lords of the Philistines went up against Israel. And when the children of Israel heardit,they were afraid of the Philistines.",
        "8And the children of Israel said to Samuel,Ceasenot to cry unto theLordour God for us, that he will save us out of the hand of the Philistines.",
        "9Â¶And Samuel took a sucking lamb, and offeredit fora burnt offering wholly unto theLord: and Samuelcriedunto theLordfor Israel; and theLordheardhim.",
        "10And as Samuel was offering up the burnt offering, the Philistines drew near to battle against Israel: but theLordthundered with a great thunder on that day upon the Philistines, anddiscomfited them; and they were smitten before Israel.",
        "11And the men of Israel went out of Mizpeh, and pursued the Philistines, and smote them, untilthey cameunder Beth-car.",
        "12Then Samuel took astone, and setitbetween Mizpeh and Shen, and called the name of itEben-ezer, saying, Hitherto hath theLordhelped us.",
        "13Â¶So the Philistines weresubdued, and they came no more into the coast of Israel: and thehandof theLordwas against the Philistines all the days of Samuel.",
        "14And the cities which the Philistines had taken from Israel were restored to Israel, from Ekron even unto Gath; and the coasts thereof did Israel deliver out of the hands of the Philistines. And there was peace between Israel and the Amorites.",
        "15And Samuel judged Israel all the days of his life.",
        "16And he went from year to year in circuit to Beth-el, and Gilgal, and Mizpeh, and judged Israel in all those places.",
        "17And his returnwasto Ramah; for therewashis house; and there he judged Israel; and there he built an altar unto theLord."
      ],
      "full_text": "1And the men of Kirjath-jearim came, and fetched up thearkof theLord, and brought it into the house of Abinadab in the hill, and sanctified Eleazar his son to keep the ark of theLord. 2And it came to pass, while the ark abode in Kirjath-jearim, that the time was long; for it was twenty years: and all the house of Israel lamented after theLord. 3Â¶And Samuel spake unto all the house of Israel, saying, If ye doreturnunto theLordwith all your hearts,thenput awaythe strangegodsandAshtarothfrom among you, and prepare yourheartsunto theLord, andservehim only: and he will deliver you out of the hand of the Philistines. 4Then the children of Israel did put awayBaalimand Ashtaroth, and served theLordonly. 5And Samuel said, Gather all Israel toMizpeh, and I willprayfor you unto theLord. 6And they gathered together to Mizpeh, and drew water, and poureditout before theLord, and fasted on that day, and said there, We havesinnedagainst theLord. And Samuel judged the children of Israel in Mizpeh. 7And when the Philistines heard that the children of Israel were gathered together to Mizpeh, the lords of the Philistines went up against Israel. And when the children of Israel heardit,they were afraid of the Philistines. 8And the children of Israel said to Samuel,Ceasenot to cry unto theLordour God for us, that he will save us out of the hand of the Philistines. 9Â¶And Samuel took a sucking lamb, and offeredit fora burnt offering wholly unto theLord: and Samuelcriedunto theLordfor Israel; and theLordheardhim. 10And as Samuel was offering up the burnt offering, the Philistines drew near to battle against Israel: but theLordthundered with a great thunder on that day upon the Philistines, anddiscomfited them; and they were smitten before Israel. 11And the men of Israel went out of Mizpeh, and pursued the Philistines, and smote them, untilthey cameunder Beth-car. 12Then Samuel took astone, and setitbetween Mizpeh and Shen, and called the name of itEben-ezer, saying, Hitherto hath theLordhelped us. 13Â¶So the Philistines weresubdued, and they came no more into the coast of Israel: and thehandof theLordwas against the Philistines all the days of Samuel. 14And the cities which the Philistines had taken from Israel were restored to Israel, from Ekron even unto Gath; and the coasts thereof did Israel deliver out of the hands of the Philistines. And there was peace between Israel and the Amorites. 15And Samuel judged Israel all the days of his life. 16And he went from year to year in circuit to Beth-el, and Gilgal, and Mizpeh, and judged Israel in all those places. 17And his returnwasto Ramah; for therewashis house; and there he judged Israel; and there he built an altar unto theLord."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:29:01",
  "metadata": {
    "week_number": 23,
    "title": "Week 23: June 1–7 - Ruth; 1 Samuel 1–7",
    "date_range": "June 1–7",
    "scraped_at": "2025-12-21T22:29:12.431734",
    "scraper_version": "2.0.0"
  }
}