{
  "week_number": 41,
  "date_range": "October 5–11",
  "title": "Week 41: October 5–11 - Isaiah 50–57",
  "bundle_title": "Week 41: October 5–11: \"Week 41: October 5–11 - Isaiah 50–57\"",
  "cfm_lesson_url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/41?lang=eng",
  "cfm_lesson_content": {
    "url": "https://www.churchofjesuschrist.org/study/manual/come-follow-me-for-home-and-church-old-testament-2026/41?lang=eng",
    "title": "Isaiah 50–57",
    "scripture_references": "Isaiah 50–57",
    "introduction": "Come, Follow Me—For Home and Church: Old Testament 2026\n\n“October 5–11. ‘He Hath Borne Our Griefs, and Carried Our Sorrows’: Isaiah 50–57,”Come, Follow Me—For Home and Church: Old Testament 2026(2026)\n\n“October 5–11. ‘He Hath Borne Our Griefs, and Carried Our Sorrows,’”Come, Follow Me: Old Testament 2026\n\nOctober 5–11: “He Hath Borne Our Griefs, and Carried Our Sorrows”\n\nThroughout his ministry, Isaiah spoke of a mighty deliverer. These prophecies would have been especially precious to the Israelites centuries later when they were in captivity in Babylon. Someone who could tear down the walls of Babylon would be a mighty conqueror indeed. But that isn’t the kind of Messiah that Isaiah described inchapters 52–53: “He is despised and rejected of men; a man of sorrows, and acquainted with grief: and we hid as it were our faces from him. … We did esteem him stricken, smitten of God, and afflicted” (Isaiah 53:3–4).\n\nBy sending such an unexpected deliverer, God taught us about true deliverance. To save us from oppression and affliction, God sent One who Himself “was oppressed, and … afflicted.” Where some expected a lion, He sent a lamb (seeIsaiah 53:7). Surely, God’s ways are not our ways (seeIsaiah 55:8–9). Jesus Christ frees us not by just opening the prison but by taking our place there. He relieves us from our chains of grief and sorrow by bearing them Himself (seeIsaiah 53:4–5, 12). He does not save us from a distance. He suffers with us, in acts of “everlasting kindness” that “shall not depart from thee” (Isaiah 54:8, 10).",
    "learning_at_home_church": [
      {
        "title": "The future is bright for the Lord’s people.",
        "content": "Even though the Israelites spent many years in captivity—and even though that captivity was a result of their own poor choices—the Lord wanted them to look to the future with hope. What do you find in Isaiah’s message that gives you hope? A chart like this one might help you study:\n\nWhat I learn about God(see, for example,Isaiah 50:2, 5–9;51:3–8, 15–16;52:3, 9–10)\n\nMessages of hope(see, for example,Isaiah 50:9;51:3–5, 11–12, 22–23;52:9–10)\n\nWhat I can do to make hope a reality(see, for example,Isaiah 50:10;51:1–2, 6–9;52:1–3, 9–11)\n\nSee alsoMosiah 12:20–24;15:13–18;3 Nephi 20:29–46;Doctrine and Covenants 113:7–10; Russell M. Nelson, “Embrace the Future with Faith,”EnsignorLiahona, Nov. 2020, 73–76.\n\nBecause of Love, by Angela Johnson\n\nHelp learners come unto Jesus Christ.“Nothing you do as a teacher will bless learners more than helping them know Heavenly Father and Jesus Christ and feel Their love” (Teaching in the Savior’s Way,8). As you prepare to teachIsaiah 50–57to others, consider how you can help them see connections between Israel’s challenges, Isaiah’s prophecies of Christ, and receiving divine help with their own struggles.\n\nIsaiah 53"
      },
      {
        "title": "Jesus Christ took upon Himself my sins and sorrows.",
        "content": "Few chapters in scripture describe Jesus Christ’s redemptive mission more beautifully thanIsaiah 53. Consider activities like these to better understand and apply these powerful teachings:\n\nPonder or discuss how stories and movies often depict heroes who rescue people. Contrast those depictions with the descriptions of the Savior inIsaiah 53.\n\nAfter reading each verse, pause to contemplate what the Savior suffered—the “griefs,” “sorrows,” and “transgressions” He bore—for all people and specifically for you. You might replace words like “we” and “our” with “I” and “my” as you read. What feelings or thoughts do these verses inspire in you?\n\nConsider watching the video “My Kingdom Is Not of This World” (Gospel Library), and ponder how the prophecies inIsaiah 53were fulfilled. What are some of the griefs and sorrows the Savior carries for you?\n\nMy Kingdom Is Not of This World\n\nFind pictures of the events surrounding the Atonement of Jesus Christ (seeGospel Art Book,nos. 56–60). You could then find phrases inIsaiah 53that describe the events in the pictures. What do these teachings inspire you to do?\n\nSee also “Behold the Great Redeemer Die,”Hymns, no. 191.\n\nIsaiah 54;57:15–19"
      },
      {
        "title": "Jesus Christ wants me to return to Him.",
        "content": "We all have times when we feel distant from the Lord because of our sins or weaknesses. Some have even given up hope that He will ever forgive them.Isaiah 54and57are great chapters to read for reassurance and encouragement during such times. Particularly inIsaiah 54:4–10;57:15–19, what words teach you how the Savior feels about you? What difference does it make in your life to know these things about Him?\n\nPresident Dieter F. Uchtdorf taught:\n\n“It matters not how completely ruined our lives may seem. It matters not how scarlet our sins, how deep our bitterness, how lonely, abandoned, or broken our hearts may be. Even those who are without hope, who live in despair, who have betrayed trust, surrendered their integrity, or turned away from God can be rebuilt. …\n\n“The joyous news of the gospel is this: because of the eternal plan of happiness provided by our loving Heavenly Father and through the infinite sacrifice of Jesus the Christ, we can not only be redeemed from our fallen state and restored to purity, but we can also transcend mortal imagination and become heirs of eternal life and partakers of God’s indescribable glory” (“He Will Place You on His Shoulders and Carry You Home,”EnsignorLiahona, May 2016, 102).\n\nSee also Patrick Kearon, “God’s Intent Is to Bring You Home,”Liahona, May 2024, 87–89.\n\nIsaiah 55–56"
      },
      {
        "title": "The Lord invites all to “take hold of my covenant.”",
        "content": "For generations, Israel had been identified as God’s covenant people. However, God’s plan has always included more than just one nation, for “every one that thirsteth” is invited to “come … to the waters” (Isaiah 55:1). Keep this in mind as you readIsaiah 55and56, and ponder what it means to be God’s people. What is God’s message to those who feel “utterly separated” from Him? (Isaiah 56:3). Consider marking verses that describe attitudes and actions of those who “take hold of my covenant” (seeIsaiah 56:4–7).\n\nFor more, see this month’s issues of theLiahonaandFor the Strength of Youthmagazines."
      }
    ],
    "teaching_children": [
      {
        "title": "The Lord invites me to “put on [my] strength.”",
        "content": "It might be fun for your children to discover phrases like “awake,” “stand up,” and “put on thy strength” inIsaiah 51:9, 17;52:1–2, 9and then act out those phrases. After doing so, you could talk about what it means to awake, stand up, and put on strength spiritually. What is the Lord asking us to do in these verses?\n\nYour children could also readIsaiah 51:1, 4, 7and identify who the Lord is speaking to and what He wants them to do. What does it mean to “hearken unto” the Lord? How can we show the Lord that we “hearken unto” Him?\n\nIsaiah 53:3–9"
      },
      {
        "title": "Jesus Christ took upon Himself my sins and sorrows.",
        "content": "You and your children could look at several pictures showing the suffering and death of Jesus Christ (see, for example,Gospel Art Book, nos.56,57,58). Then you could read togetherIsaiah 53:3–6, 9and look for words that describe what is happening in the pictures. Help your children understand that Isaiah shared these truths hundreds of years before they happened. Why would it be important for people to know these things so many years in advance? (seeAlma 39:15–19).\n\nAfter reading fromIsaiah 53:4, “He hath borne our griefs, and carried our sorrows,” your children could try to lift a heavy object (or pretend to lift one). Talk about how “grief” and “sorrow” or sadness can feel heavy and hard to carry. Why did Jesus carry our “griefs,” “sorrows,” and “iniquities” or sins? (see alsoAlma 7:11–12).\n\nIsaiah 55:6"
      },
      {
        "title": "I can seek the Lord and call upon Him.",
        "content": "To teach your children aboutIsaiah 55:6, you could hide a picture of Jesus somewhere in the room. You could invite your children to find the picture and name one way they can “seek … the Lord while he may be found.” A song like “Seek the Lord Early” (Children’s Songbook, 108) could give them ideas. Then you could let one of the children hide the picture and repeat the activity.\n\nIsaiah 55:8–9"
      },
      {
        "title": "The Lord’s ways are higher than mine.",
        "content": "After readingIsaiah 55:9, it might be fun for your children to stand on a stool and talk about how things look different when you are “higher.” Or they could draw a picture of whatIsaiah 55:9means to them. You could then discuss some of the Lord’s ways that are higher than our ways. For example, what is His way of treating sinners? (seeMark 2:15–17). What is His way of leading others? (seeMatthew 20:25–28). Share with your children how you have learned to trust the Lord’s higher ways and thoughts.\n\nFor more, see this month’s issue of theFriendmagazine.\n\nHis Light, by Michael Malm"
      }
    ],
    "study_helps": [],
    "raw_text": "October 5–11. “He Hath Borne Our Griefs, and Carried Our Sorrows”: Isaiah 50–57\nAuthenticating...\nCome, Follow Me\nCome, Follow Me—For Home and Church: Old Testament 2026\nContents\nIntroductory Materials\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nSeptember 28–October 4\nIsaiah 40–49\nOctober 5–11\nIsaiah 50–57\nOctober 12–18\nIsaiah 58–66\nOctober 19–25\nJeremiah 1–3; 7; 16–18; 20\nNovember\nDecember\nAppendixes\nOctober 5–11. “He Hath Borne Our Griefs, and Carried Our Sorrows”: Isaiah 50–57\n“October 5–11. ‘He Hath Borne Our Griefs, and Carried Our Sorrows’: Isaiah 50–57,”\nCome, Follow Me—For Home and Church: Old Testament 2026\n(2026)\n“October 5–11. ‘He Hath Borne Our Griefs, and Carried Our Sorrows,’”\nCome, Follow Me: Old Testament 2026\nThe Mocking of Christ\n, by Carl Heinrich Bloch\nOctober 5–11: “He Hath Borne Our Griefs, and Carried Our Sorrows”\nIsaiah 50–57\nThroughout his ministry, Isaiah spoke of a mighty deliverer. These prophecies would have been especially precious to the Israelites centuries later when they were in captivity in Babylon. Someone who could tear down the walls of Babylon would be a mighty conqueror indeed. But that isn’t the kind of Messiah that Isaiah described in\nchapters 52–53\n: “He is despised and rejected of men; a man of sorrows, and acquainted with grief: and we hid as it were our faces from him. … We did esteem him stricken, smitten of God, and afflicted” (\nIsaiah 53:3–4\n).\nBy sending such an unexpected deliverer, God taught us about true deliverance. To save us from oppression and affliction, God sent One who Himself “was oppressed, and … afflicted.” Where some expected a lion, He sent a lamb (see\nIsaiah 53:7\n). Surely, God’s ways are not our ways (see\nIsaiah 55:8–9\n). Jesus Christ frees us not by just opening the prison but by taking our place there. He relieves us from our chains of grief and sorrow by bearing them Himself (see\nIsaiah 53:4–5, 12\n). He does not save us from a distance. He suffers with us, in acts of “everlasting kindness” that “shall not depart from thee” (\nIsaiah 54:8, 10\n).\nIdeas for Learning at Home and at Church\nIsaiah 50–52\nThe future is bright for the Lord’s people.\nEven though the Israelites spent many years in captivity—and even though that captivity was a result of their own poor choices—the Lord wanted them to look to the future with hope. What do you find in Isaiah’s message that gives you hope? A chart like this one might help you study:\nWhat I learn about God\n(see, for example,\nIsaiah 50:2, 5–9\n;\n51:3–8, 15–16\n;\n52:3, 9–10\n)\nMessages of hope\n(see, for example,\nIsaiah 50:9\n;\n51:3–5, 11–12, 22–23\n;\n52:9–10\n)\nWhat I can do to make hope a reality\n(see, for example,\nIsaiah 50:10\n;\n51:1–2, 6–9\n;\n52:1–3, 9–11\n)\nSee also\nMosiah 12:20–24\n;\n15:13–18\n;\n3 Nephi 20:29–46\n;\nDoctrine and Covenants 113:7–10\n; Russell M. Nelson, “\nEmbrace the Future with Faith\n,”\nEnsign\nor\nLiahona\n, Nov. 2020, 73–76.\nBecause of Love\n, by Angela Johnson\nHelp learners come unto Jesus Christ.\n“Nothing you do as a teacher will bless learners more than helping them know Heavenly Father and Jesus Christ and feel Their love” (\nTeaching in the Savior’s Way\n,\n8\n). As you prepare to teach\nIsaiah 50–57\nto others, consider how you can help them see connections between Israel’s challenges, Isaiah’s prophecies of Christ, and receiving divine help with their own struggles.\nIsaiah 53\nJesus Christ took upon Himself my sins and sorrows.\nFew chapters in scripture describe Jesus Christ’s redemptive mission more beautifully than\nIsaiah 53\n. Consider activities like these to better understand and apply these powerful teachings:\nPonder or discuss how stories and movies often depict heroes who rescue people. Contrast those depictions with the descriptions of the Savior in\nIsaiah 53\n.\nAfter reading each verse, pause to contemplate what the Savior suffered—the “griefs,” “sorrows,” and “transgressions” He bore—for all people and specifically for you. You might replace words like “we” and “our” with “I” and “my” as you read. What feelings or thoughts do these verses inspire in you?\nConsider watching the video “My Kingdom Is Not of This World” (Gospel Library), and ponder how the prophecies in\nIsaiah 53\nwere fulfilled. What are some of the griefs and sorrows the Savior carries for you?\n5:25\nMy Kingdom Is Not of This World\nFind pictures of the events surrounding the Atonement of Jesus Christ (see\nGospel Art Book\n,\nnos. 56–60\n). You could then find phrases in\nIsaiah 53\nthat describe the events in the pictures. What do these teachings inspire you to do?\nSee also “\nBehold the Great Redeemer Die\n,”\nHymns\n, no. 191.\nIsaiah 54\n;\n57:15–19\nJesus Christ wants me to return to Him.\nWe all have times when we feel distant from the Lord because of our sins or weaknesses. Some have even given up hope that He will ever forgive them.\nIsaiah 54\nand\n57\nare great chapters to read for reassurance and encouragement during such times. Particularly in\nIsaiah 54:4–10\n;\n57:15–19\n, what words teach you how the Savior feels about you? What difference does it make in your life to know these things about Him?\nPresident Dieter F. Uchtdorf taught:\n“It matters not how completely ruined our lives may seem. It matters not how scarlet our sins, how deep our bitterness, how lonely, abandoned, or broken our hearts may be. Even those who are without hope, who live in despair, who have betrayed trust, surrendered their integrity, or turned away from God can be rebuilt. …\n“The joyous news of the gospel is this: because of the eternal plan of happiness provided by our loving Heavenly Father and through the infinite sacrifice of Jesus the Christ, we can not only be redeemed from our fallen state and restored to purity, but we can also transcend mortal imagination and become heirs of eternal life and partakers of God’s indescribable glory” (“\nHe Will Place You on His Shoulders and Carry You Home\n,”\nEnsign\nor\nLiahona\n, May 2016, 102).\nSee also Patrick Kearon, “\nGod’s Intent Is to Bring You Home\n,”\nLiahona\n, May 2024, 87–89.\nIsaiah 55–56\nThe Lord invites all to “take hold of my covenant.”\nFor generations, Israel had been identified as God’s covenant people. However, God’s plan has always included more than just one nation, for “every one that thirsteth” is invited to “come … to the waters” (\nIsaiah 55:1\n). Keep this in mind as you read\nIsaiah 55\nand\n56\n, and ponder what it means to be God’s people. What is God’s message to those who feel “utterly separated” from Him? (\nIsaiah 56:3\n). Consider marking verses that describe attitudes and actions of those who “take hold of my covenant” (see\nIsaiah 56:4–7\n).\nFor more, see this month’s issues of the\nLiahona\nand\nFor the Strength of Youth\nmagazines.\nIdeas for Teaching Children\nIsaiah 51–52\nThe Lord invites me to “put on [my] strength.”\nIt might be fun for your children to discover phrases like “awake,” “stand up,” and “put on thy strength” in\nIsaiah 51:9, 17\n;\n52:1–2, 9\nand then act out those phrases. After doing so, you could talk about what it means to awake, stand up, and put on strength spiritually. What is the Lord asking us to do in these verses?\nYour children could also read\nIsaiah 51:1, 4, 7\nand identify who the Lord is speaking to and what He wants them to do. What does it mean to “hearken unto” the Lord? How can we show the Lord that we “hearken unto” Him?\nIsaiah 53:3–9\nJesus Christ took upon Himself my sins and sorrows.\nYou and your children could look at several pictures showing the suffering and death of Jesus Christ (see, for example,\nGospel Art Book\n, nos.\n56\n,\n57\n,\n58\n). Then you could read together\nIsaiah 53:3–6, 9\nand look for words that describe what is happening in the pictures. Help your children understand that Isaiah shared these truths hundreds of years before they happened. Why would it be important for people to know these things so many years in advance? (see\nAlma 39:15–19\n).\nAfter reading from\nIsaiah 53:4\n, “He hath borne our griefs, and carried our sorrows,” your children could try to lift a heavy object (or pretend to lift one). Talk about how “grief” and “sorrow” or sadness can feel heavy and hard to carry. Why did Jesus carry our “griefs,” “sorrows,” and “iniquities” or sins? (see also\nAlma 7:11–12\n).\nIsaiah 55:6\nI can seek the Lord and call upon Him.\nTo teach your children about\nIsaiah 55:6\n, you could hide a picture of Jesus somewhere in the room. You could invite your children to find the picture and name one way they can “seek … the Lord while he may be found.” A song like “\nSeek the Lord Early\n” (\nChildren’s Songbook\n, 108) could give them ideas. Then you could let one of the children hide the picture and repeat the activity.\nIsaiah 55:8–9\nThe Lord’s ways are higher than mine.\nAfter reading\nIsaiah 55:9\n, it might be fun for your children to stand on a stool and talk about how things look different when you are “higher.” Or they could draw a picture of what\nIsaiah 55:9\nmeans to them. You could then discuss some of the Lord’s ways that are higher than our ways. For example, what is His way of treating sinners? (see\nMark 2:15–17\n). What is His way of leading others? (see\nMatthew 20:25–28\n). Share with your children how you have learned to trust the Lord’s higher ways and thoughts.\nFor more, see this month’s issue of the\nFriend\nmagazine.\nHis Light\n, by Michael Malm\nOpen PDF"
  },
  "scripture_content": [
    {
      "reference": "Isaiah 50",
      "title": "Isaiah 50",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/50?lang=eng",
      "summary": "Isaiah speaks as the MessiahâHe will have the tongue of the learnedâHe will give His back to the smitersâHe will not be confoundedâCompare2Â Nephi 7.",
      "verses": [
        "1Thussaith theLord, Whereisthe bill of your motherâsdivorcement, whom I have put away? or which of my creditorsis itto whom I have sold you? Behold, for youriniquitieshave ye sold yourselves, and for your transgressions is yourmotherput away.",
        "2Wherefore, when I came,was thereno man? when I called,was therenone to answer? Is myhandshortened at all, that it cannot redeem? or have I nopowerto deliver? behold, at my rebuke Idry upthe sea, I make the rivers a wilderness: their fish stinketh, becausethere isno water, and dieth for thirst.",
        "3I clothe the heavens with blackness, and I make sackcloth their covering.",
        "4The LordGodhath given me the tongue of thelearned, that I should know how to speak awordin season tohim that isweary: he wakeneth morning by morning, he wakeneth mine ear to hear as the learned.",
        "5Â¶The LordGodhath opened mineear, and I was notrebellious, neither turned away back.",
        "6Igavemybackto thesmiters, and mycheeksto them that plucked off the hair: Ihidnot my face fromshameandspitting.",
        "7Â¶For the LordGodwill help me; therefore shall I not be confounded: therefore have I set my face like a flint, and I know that I shall not be ashamed.",
        "8He isnear thatjustifiethme; who will contend with me? let us stand together: whoismine adversary? let him come near to me.",
        "9Behold, the LordGodwill help me; whoishethatshall condemn me? lo, they all shall waxoldas a garment; themothshall eat them up.",
        "10Â¶Whoisamong you that feareth theLord, that obeyeth thevoiceof hisservant, that walkethindarkness, and hath nolight? lethimtrustin the name of theLord, andstay uponhis God.",
        "11Behold, all ye that kindle a fire, that compassyourselvesabout with sparks: walk in thelightof your fire, and in the sparksthatye have kindled. This shall ye have of mine hand; ye shall lie down insorrow."
      ],
      "full_text": "1Thussaith theLord, Whereisthe bill of your motherâsdivorcement, whom I have put away? or which of my creditorsis itto whom I have sold you? Behold, for youriniquitieshave ye sold yourselves, and for your transgressions is yourmotherput away. 2Wherefore, when I came,was thereno man? when I called,was therenone to answer? Is myhandshortened at all, that it cannot redeem? or have I nopowerto deliver? behold, at my rebuke Idry upthe sea, I make the rivers a wilderness: their fish stinketh, becausethere isno water, and dieth for thirst. 3I clothe the heavens with blackness, and I make sackcloth their covering. 4The LordGodhath given me the tongue of thelearned, that I should know how to speak awordin season tohim that isweary: he wakeneth morning by morning, he wakeneth mine ear to hear as the learned. 5Â¶The LordGodhath opened mineear, and I was notrebellious, neither turned away back. 6Igavemybackto thesmiters, and mycheeksto them that plucked off the hair: Ihidnot my face fromshameandspitting. 7Â¶For the LordGodwill help me; therefore shall I not be confounded: therefore have I set my face like a flint, and I know that I shall not be ashamed. 8He isnear thatjustifiethme; who will contend with me? let us stand together: whoismine adversary? let him come near to me. 9Behold, the LordGodwill help me; whoishethatshall condemn me? lo, they all shall waxoldas a garment; themothshall eat them up. 10Â¶Whoisamong you that feareth theLord, that obeyeth thevoiceof hisservant, that walkethindarkness, and hath nolight? lethimtrustin the name of theLord, andstay uponhis God. 11Behold, all ye that kindle a fire, that compassyourselvesabout with sparks: walk in thelightof your fire, and in the sparksthatye have kindled. This shall ye have of mine hand; ye shall lie down insorrow."
    },
    {
      "reference": "Isaiah 51",
      "title": "Isaiah 51",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/51?lang=eng",
      "summary": "In the last days, the Lord will comfort Zion and gather IsraelâThe redeemed will come to Zion amid great joyâCompare2Â Nephi 8.",
      "verses": [
        "1Hearkento me, ye that follow after righteousness, ye that seek theLord: look unto therockwhenceye are hewn, and to the hole of the pitwhenceye are digged.",
        "2Look untoAbrahamyourfather, and unto Sarahthatbare you: for I called himalone, andblessedhim, and increased him.",
        "3For theLordshallcomfortZion: he will comfort all her waste places; and he will make her wilderness likeEden, and her desert like thegardenof theLord; joy and gladness shall be found therein, thanksgiving, and the voice of melody.",
        "4Â¶Hearken unto me, my people; and give ear unto me, O my nation: for alawshall proceed from me, and I will make my judgment to rest for a light of the people.",
        "5My righteousnessisnear; mysalvationis gone forth, and mine arms shalljudgethe people; theislesshall wait upon me, and on mine arm shall they trust.",
        "6Lift up your eyes to the heavens, and look upon the earth beneath: for the heavens shallvanish awaylike smoke, and the earth shallwaxoldlike a garment, and they that dwell therein shall die in like manner: but my salvation shall be for ever, and my righteousness shall not be abolished.",
        "7Â¶Hearken unto me, ye that know righteousness, the people in whoseheartismy law;fearye not thereproachofmen, neither be ye afraid of theirrevilings.",
        "8For themothshall eat them up like a garment, and the worm shall eat them like wool: but my righteousness shall be for ever, and my salvation from generation to generation.",
        "9Â¶Awake, awake, put onstrength, O arm of theLord; awake, as in the ancient days, in the generations of old.Artthou not it that hath cut Rahab,andwounded thedragon?",
        "10Artthou not it which hathdriedthe sea, the waters of the great deep; that hath made the depths of the sea awayfor theransomedto pass over?",
        "11Therefore theredeemedof theLordshallreturn, and come with singing unto Zion; and everlastingjoyshall beupon their head: they shall obtain gladness and joy;andsorrow andmourningshall flee away.",
        "12I,evenI,amhe that comforteth you: whoartthou, that thou shouldest beafraidof a manthatshall die, and of the son of manwhichshall be madeasgrass;",
        "13AndforgettesttheLordthy maker, that hath stretched forth the heavens, and laid the foundations of theearth; and hast feared continually every day because of the fury of the oppressor, as if he were ready to destroy? and whereisthe fury of the oppressor?",
        "14The captive exile hasteneth that he may be loosed, and that he should not die in thepit, nor that his bread should fail.",
        "15But IamtheLordthy God, that divided thesea, whose waves roared: TheLordof hostsishis name.",
        "16And I have put mywordsin thy mouth, and I have covered thee in the shadow of mine hand, that I may plant the heavens, and lay the foundations of the earth, and say unto Zion, Thouartmy people.",
        "17Â¶Awake, awake, stand up, O Jerusalem, which hast drunk at the hand of theLordthecupof hisfury; thou hast drunken the dregs of thecupof trembling,andwrungthemout.",
        "18There isnone to guide her among all the sonswhomshe hath brought forth; neitheris there anythat taketh her by the hand of all the sonsthatshe hath brought up.",
        "19Thesetwothingsare come unto thee; who shall be sorry for thee? desolation, and destruction, and the famine, and the sword: by whom shall I comfort thee?",
        "20Thy sons have fainted, they lie at the head of all the streets, as awild bullin a net: they are full of the fury of theLord, the rebuke of thy God.",
        "21Â¶Therefore hear now this, thou afflicted, and drunken, but not with wine:",
        "22Thus saith thy Lord theLord, and thy Godthatpleadeththe cause of his people, Behold, I have taken out of thine hand the cup of trembling,eventhe dregs of the cup of my fury; thou shalt no more drink it again:",
        "23But I will put it into thehandof them thatafflictthee; which have said to thy soul,Bow down, that we may go over: and thou hast laid thy body as the ground, and as the street, to them that went over."
      ],
      "full_text": "1Hearkento me, ye that follow after righteousness, ye that seek theLord: look unto therockwhenceye are hewn, and to the hole of the pitwhenceye are digged. 2Look untoAbrahamyourfather, and unto Sarahthatbare you: for I called himalone, andblessedhim, and increased him. 3For theLordshallcomfortZion: he will comfort all her waste places; and he will make her wilderness likeEden, and her desert like thegardenof theLord; joy and gladness shall be found therein, thanksgiving, and the voice of melody. 4Â¶Hearken unto me, my people; and give ear unto me, O my nation: for alawshall proceed from me, and I will make my judgment to rest for a light of the people. 5My righteousnessisnear; mysalvationis gone forth, and mine arms shalljudgethe people; theislesshall wait upon me, and on mine arm shall they trust. 6Lift up your eyes to the heavens, and look upon the earth beneath: for the heavens shallvanish awaylike smoke, and the earth shallwaxoldlike a garment, and they that dwell therein shall die in like manner: but my salvation shall be for ever, and my righteousness shall not be abolished. 7Â¶Hearken unto me, ye that know righteousness, the people in whoseheartismy law;fearye not thereproachofmen, neither be ye afraid of theirrevilings. 8For themothshall eat them up like a garment, and the worm shall eat them like wool: but my righteousness shall be for ever, and my salvation from generation to generation. 9Â¶Awake, awake, put onstrength, O arm of theLord; awake, as in the ancient days, in the generations of old.Artthou not it that hath cut Rahab,andwounded thedragon? 10Artthou not it which hathdriedthe sea, the waters of the great deep; that hath made the depths of the sea awayfor theransomedto pass over? 11Therefore theredeemedof theLordshallreturn, and come with singing unto Zion; and everlastingjoyshall beupon their head: they shall obtain gladness and joy;andsorrow andmourningshall flee away. 12I,evenI,amhe that comforteth you: whoartthou, that thou shouldest beafraidof a manthatshall die, and of the son of manwhichshall be madeasgrass; 13AndforgettesttheLordthy maker, that hath stretched forth the heavens, and laid the foundations of theearth; and hast feared continually every day because of the fury of the oppressor, as if he were ready to destroy? and whereisthe fury of the oppressor? 14The captive exile hasteneth that he may be loosed, and that he should not die in thepit, nor that his bread should fail. 15But IamtheLordthy God, that divided thesea, whose waves roared: TheLordof hostsishis name. 16And I have put mywordsin thy mouth, and I have covered thee in the shadow of mine hand, that I may plant the heavens, and lay the foundations of the earth, and say unto Zion, Thouartmy people. 17Â¶Awake, awake, stand up, O Jerusalem, which hast drunk at the hand of theLordthecupof hisfury; thou hast drunken the dregs of thecupof trembling,andwrungthemout. 18There isnone to guide her among all the sonswhomshe hath brought forth; neitheris there anythat taketh her by the hand of all the sonsthatshe hath brought up. 19Thesetwothingsare come unto thee; who shall be sorry for thee? desolation, and destruction, and the famine, and the sword: by whom shall I comfort thee? 20Thy sons have fainted, they lie at the head of all the streets, as awild bullin a net: they are full of the fury of theLord, the rebuke of thy God. 21Â¶Therefore hear now this, thou afflicted, and drunken, but not with wine: 22Thus saith thy Lord theLord, and thy Godthatpleadeththe cause of his people, Behold, I have taken out of thine hand the cup of trembling,eventhe dregs of the cup of my fury; thou shalt no more drink it again: 23But I will put it into thehandof them thatafflictthee; which have said to thy soul,Bow down, that we may go over: and thou hast laid thy body as the ground, and as the street, to them that went over."
    },
    {
      "reference": "Isaiah 52",
      "title": "Isaiah 52",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/52?lang=eng",
      "summary": "In the last days, Zion will return, and Israel will be redeemedâThe Messiah will deal prudently and be exalted.",
      "verses": [
        "1Awake, awake; put on thystrength, OZion; put on thybeautifulgarments, OJerusalem, the holy city: for henceforth there shall no more come into thee the uncircumcised and the unclean.",
        "2Shakethyself from the dust;arise,andsit down, O Jerusalem: loose thyself from thebandsof thy neck, O captive daughter of Zion.",
        "3For thus saith theLord, Ye havesoldyourselves for nought; and ye shall be redeemed withoutmoney.",
        "4For thus saith the LordGod, My people went down aforetime intoEgyptto sojourn there; and theAssyrian oppressed them without cause.",
        "5Now therefore, what have I here, saith theLord, that my people is taken away for nought? they that rule over them make them to howl, saith theLord; and my name continually every dayisblasphemed.",
        "6Therefore my people shall know my name: thereforethey shall knowin thatdaythat Iamhe that doth speak: behold,it isI.",
        "7Â¶Howbeautifulupon the mountains are the feet of him thatbringethgoodtidings, thatpublishethpeace; that bringeth good tidings of good, that publisheth salvation; that saith untoZion, Thy God reigneth!",
        "8Thywatchmenshall lift up the voice; with the voice together shall they sing: for they shallseeeye to eye, when theLordshall bring againZion.",
        "9Â¶Break forth into joy, sing together, yewaste placesof Jerusalem: for theLordhath comforted his people, he hath redeemed Jerusalem.",
        "10TheLordhath madebarehis holyarmin the eyes of all the nations; and all the ends of the earth shallseethesalvationof our God.",
        "11Â¶Depart ye, depart ye, go yeoutfrom thence,touchnouncleanthing;go yeoutof the midst of her; be yeclean, that bear the vessels of theLord.",
        "12For ye shall not go out withhaste, nor go by flight: for theLordwill go before you; and the God of Israelwill beyourrearward.",
        "13Â¶Behold, myservantshall dealprudently, he shall be exalted and extolled, and be very high.",
        "14As many wereastoniedat thee; hisvisagewas so marred more than any man, and his form more than the sons of men:",
        "15So shall hesprinklemany nations; the kings shall shut their mouths at him: forthatwhich had not beentoldthem shall they see; andthatwhich they had not heard shall they consider."
      ],
      "full_text": "1Awake, awake; put on thystrength, OZion; put on thybeautifulgarments, OJerusalem, the holy city: for henceforth there shall no more come into thee the uncircumcised and the unclean. 2Shakethyself from the dust;arise,andsit down, O Jerusalem: loose thyself from thebandsof thy neck, O captive daughter of Zion. 3For thus saith theLord, Ye havesoldyourselves for nought; and ye shall be redeemed withoutmoney. 4For thus saith the LordGod, My people went down aforetime intoEgyptto sojourn there; and theAssyrian oppressed them without cause. 5Now therefore, what have I here, saith theLord, that my people is taken away for nought? they that rule over them make them to howl, saith theLord; and my name continually every dayisblasphemed. 6Therefore my people shall know my name: thereforethey shall knowin thatdaythat Iamhe that doth speak: behold,it isI. 7Â¶Howbeautifulupon the mountains are the feet of him thatbringethgoodtidings, thatpublishethpeace; that bringeth good tidings of good, that publisheth salvation; that saith untoZion, Thy God reigneth! 8Thywatchmenshall lift up the voice; with the voice together shall they sing: for they shallseeeye to eye, when theLordshall bring againZion. 9Â¶Break forth into joy, sing together, yewaste placesof Jerusalem: for theLordhath comforted his people, he hath redeemed Jerusalem. 10TheLordhath madebarehis holyarmin the eyes of all the nations; and all the ends of the earth shallseethesalvationof our God. 11Â¶Depart ye, depart ye, go yeoutfrom thence,touchnouncleanthing;go yeoutof the midst of her; be yeclean, that bear the vessels of theLord. 12For ye shall not go out withhaste, nor go by flight: for theLordwill go before you; and the God of Israelwill beyourrearward. 13Â¶Behold, myservantshall dealprudently, he shall be exalted and extolled, and be very high. 14As many wereastoniedat thee; hisvisagewas so marred more than any man, and his form more than the sons of men: 15So shall hesprinklemany nations; the kings shall shut their mouths at him: forthatwhich had not beentoldthem shall they see; andthatwhich they had not heard shall they consider."
    },
    {
      "reference": "Isaiah 53",
      "title": "Isaiah 53",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/53?lang=eng",
      "summary": "Isaiah speaks about the MessiahâHis humiliation and sufferings are describedâHe makes His soul an offering for sin and makes intercession for the transgressorsâCompareMosiah 14.",
      "verses": [
        "1Who hathbelievedour report? and to whom is the arm of theLordrevealed?",
        "2For he shall grow up before him as a tenderplant, and as arootout of adryground: he hath no form nor comeliness; and when we shall see him,there isnobeautythat we should desire him.",
        "3He isdespisedand rejected ofmen; a man ofsorrows, and acquainted with grief: and we hid as it wereourfaces from him; he was despised, and weesteemedhim not.",
        "4Â¶Surely he hathborneourgriefs, and carried our sorrows: yet we did esteem him stricken, smitten of God, and afflicted.",
        "5But hewaswoundedfor ourtransgressions,he wasbruised for our iniquities: the chastisement of our peacewasupon him; and with hisstripeswe arehealed.",
        "6All we likesheephave goneastray; we have turned every one to hisownway; and theLordhath laid on him theiniquityof us all.",
        "7He wasoppressed, and he wasafflicted, yet heopenednot his mouth: he is brought as alambto theslaughter, and as a sheep before her shearers is dumb, so he openeth not his mouth.",
        "8He was taken from prison and from judgment: and who shall declare hisgeneration? for he was cut off out of the land of the living: for thetransgressionof my people was he stricken.",
        "9And he made his grave with thewicked, and with the rich in hisdeath;becausehe had done noviolence, neitherwas anydeceitin his mouth.",
        "10Â¶Yet it pleased theLordtobruisehim; he hath puthimto grief: when thou shalt make his soul anofferingfor sin, he shall seehisseed, he shall prolonghisdays, and thepleasureof theLordshall prosper in his hand.",
        "11He shall see of the travail of his soul,andshall be satisfied: by hisknowledgeshall my righteousservantjustifymany; for he shallbeartheir iniquities.",
        "12Therefore will I divide hima portionwith the great, and he shall divide the spoil with the strong; because he hath poured out his soul untodeath: and he was numbered with thetransgressors; and he bare the sin of many, and madeintercessionfor the transgressors."
      ],
      "full_text": "1Who hathbelievedour report? and to whom is the arm of theLordrevealed? 2For he shall grow up before him as a tenderplant, and as arootout of adryground: he hath no form nor comeliness; and when we shall see him,there isnobeautythat we should desire him. 3He isdespisedand rejected ofmen; a man ofsorrows, and acquainted with grief: and we hid as it wereourfaces from him; he was despised, and weesteemedhim not. 4Â¶Surely he hathborneourgriefs, and carried our sorrows: yet we did esteem him stricken, smitten of God, and afflicted. 5But hewaswoundedfor ourtransgressions,he wasbruised for our iniquities: the chastisement of our peacewasupon him; and with hisstripeswe arehealed. 6All we likesheephave goneastray; we have turned every one to hisownway; and theLordhath laid on him theiniquityof us all. 7He wasoppressed, and he wasafflicted, yet heopenednot his mouth: he is brought as alambto theslaughter, and as a sheep before her shearers is dumb, so he openeth not his mouth. 8He was taken from prison and from judgment: and who shall declare hisgeneration? for he was cut off out of the land of the living: for thetransgressionof my people was he stricken. 9And he made his grave with thewicked, and with the rich in hisdeath;becausehe had done noviolence, neitherwas anydeceitin his mouth. 10Â¶Yet it pleased theLordtobruisehim; he hath puthimto grief: when thou shalt make his soul anofferingfor sin, he shall seehisseed, he shall prolonghisdays, and thepleasureof theLordshall prosper in his hand. 11He shall see of the travail of his soul,andshall be satisfied: by hisknowledgeshall my righteousservantjustifymany; for he shallbeartheir iniquities. 12Therefore will I divide hima portionwith the great, and he shall divide the spoil with the strong; because he hath poured out his soul untodeath: and he was numbered with thetransgressors; and he bare the sin of many, and madeintercessionfor the transgressors."
    },
    {
      "reference": "Isaiah 54",
      "title": "Isaiah 54",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/54?lang=eng",
      "summary": "In the last days, Zion and her stakes will be established, and Israel will be gathered in mercy and tendernessâIsrael will triumphâCompare3Â Nephi 22.",
      "verses": [
        "1Sing, Obarren, thouthatdidst not bear; break forth into singing, and cry aloud, thouthatdidst not travail with child: for morearethe children of the desolate than the children of the married wife, saith theLord.",
        "2Enlarge the place of thy tent, and let them stretch forth the curtainsof thine habitations: spare not, lengthen thy cords, and strengthen thystakes;",
        "3For thou shalt break forth on the right hand and on the left; and thy seed shall inherit the Gentiles, and make the desolate cities to be inhabited.",
        "4Fear not; for thou shalt not be ashamed: neither be thou confounded; for thou shalt not be put to shame: for thou shalt forget theshameof thy youth, and shalt not remember thereproachof thy widowhood any more.",
        "5For thy Makeristhinehusband; theLordof hostsishis name; and thyRedeemerthe Holy One of Israel; TheGodof the whole earth shall he be called.",
        "6For theLordhath called thee as awomanforsakenand grieved in spirit, and awifeof youth,when thou wast refused, saith thy God.",
        "7For a smallmomenthave Iforsakenthee; but with great mercies will Igatherthee.",
        "8In a littlewrathIhidmyfacefrom thee for a moment; but with everlastingkindnesswill I havemercyon thee, saith theLordthy Redeemer.",
        "9For thisis asthe waters of Noah unto me: forasI have sworn that thewaters of Noahshould no more go over the earth; so have I sworn that I would not be wroth with thee, nor rebuke thee.",
        "10For themountainsshall depart, and the hills be removed; but my kindness shall not depart from thee, neither shall thecovenantof my peace be removed, saith theLordthat hath mercy on thee.",
        "11Â¶O thou afflicted, tossed with tempest,andnot comforted, behold, I will lay thystoneswith fair colours, and lay thy foundations with sapphires.",
        "12And I will make thy windows of agates, and thy gates of carbuncles, and all thy borders of pleasant stones.",
        "13And all thychildrenshall betaughtof theLord; and greatshall bethepeaceof thy children.",
        "14In righteousness shalt thou be established: thou shalt be far from oppression; for thou shalt not fear: and from terror; for it shall not come near thee.",
        "15Behold, they shall surely gather together,butnot by me: whosoever shall gather together against thee shall fall for thy sake.",
        "16Behold, I have created the smith that bloweth the coals in the fire, and that bringeth forth an instrument for his work; and I have created thewasterto destroy.",
        "17Â¶Noweaponthat is formed against thee shall prosper; and everytonguethatshall rise against thee in judgment thou shalt condemn. Thisisthe heritage of theservantsof theLord, and their righteousnessisof me, saith theLord."
      ],
      "full_text": "1Sing, Obarren, thouthatdidst not bear; break forth into singing, and cry aloud, thouthatdidst not travail with child: for morearethe children of the desolate than the children of the married wife, saith theLord. 2Enlarge the place of thy tent, and let them stretch forth the curtainsof thine habitations: spare not, lengthen thy cords, and strengthen thystakes; 3For thou shalt break forth on the right hand and on the left; and thy seed shall inherit the Gentiles, and make the desolate cities to be inhabited. 4Fear not; for thou shalt not be ashamed: neither be thou confounded; for thou shalt not be put to shame: for thou shalt forget theshameof thy youth, and shalt not remember thereproachof thy widowhood any more. 5For thy Makeristhinehusband; theLordof hostsishis name; and thyRedeemerthe Holy One of Israel; TheGodof the whole earth shall he be called. 6For theLordhath called thee as awomanforsakenand grieved in spirit, and awifeof youth,when thou wast refused, saith thy God. 7For a smallmomenthave Iforsakenthee; but with great mercies will Igatherthee. 8In a littlewrathIhidmyfacefrom thee for a moment; but with everlastingkindnesswill I havemercyon thee, saith theLordthy Redeemer. 9For thisis asthe waters of Noah unto me: forasI have sworn that thewaters of Noahshould no more go over the earth; so have I sworn that I would not be wroth with thee, nor rebuke thee. 10For themountainsshall depart, and the hills be removed; but my kindness shall not depart from thee, neither shall thecovenantof my peace be removed, saith theLordthat hath mercy on thee. 11Â¶O thou afflicted, tossed with tempest,andnot comforted, behold, I will lay thystoneswith fair colours, and lay thy foundations with sapphires. 12And I will make thy windows of agates, and thy gates of carbuncles, and all thy borders of pleasant stones. 13And all thychildrenshall betaughtof theLord; and greatshall bethepeaceof thy children. 14In righteousness shalt thou be established: thou shalt be far from oppression; for thou shalt not fear: and from terror; for it shall not come near thee. 15Behold, they shall surely gather together,butnot by me: whosoever shall gather together against thee shall fall for thy sake. 16Behold, I have created the smith that bloweth the coals in the fire, and that bringeth forth an instrument for his work; and I have created thewasterto destroy. 17Â¶Noweaponthat is formed against thee shall prosper; and everytonguethatshall rise against thee in judgment thou shalt condemn. Thisisthe heritage of theservantsof theLord, and their righteousnessisof me, saith theLord."
    },
    {
      "reference": "Isaiah 55",
      "title": "Isaiah 55",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/55?lang=eng",
      "summary": "Come and drink; salvation is freeâThe Lord will make an everlasting covenant with IsraelâSeek the Lord while He is near.",
      "verses": [
        "1Ho, every one thatthirsteth, come ye to thewaters, and he that hath no money; come ye, buy, and eat; yea, come,buywine and milk without money and withoutprice.",
        "2Wherefore do yespendmoney forthat which isnot bread? and yourlabourforthat whichsatisfieth not? hearkendiligentlyunto me, and eat yethat which isgood, and let your soul delight itself in fatness.",
        "3Incline your ear, andcomeunto me: hear, and yoursoulshall live; and I will make an everlastingcovenantwith you,eventhesuremercies of David.",
        "4Behold, I have given himforawitnessto the people, aleaderand commander to the people.",
        "5Behold, thou shalt call a nationthatthou knowest not, andnationsthatknew not thee shall run unto thee because of theLordthy God, and for the Holy One of Israel; for he hath glorified thee.",
        "6Â¶Seekye theLordwhile he may be found, call ye upon him while he is near:",
        "7Let the wicked forsake his way, and the unrighteous man his thoughts: and let himreturnunto theLord, and he will have mercy upon him; and to our God, for he will abundantlypardon.",
        "8Â¶For mythoughtsarenotyourthoughts, neitherareyourwaysmyways, saith theLord.",
        "9Forasthe heavens are higher than the earth, so are mywayshigherthan your ways, and mythoughtsthan your thoughts.",
        "10For as theraincometh down, and the snow from heaven, and returneth not thither, but watereth the earth, and maketh it bring forth and bud, that it may give seed to the sower, andbreadto the eater:",
        "11So shall mywordbe that goeth forth out of my mouth: it shall not return unto me void, but it shall accomplish that which I please, and it shall prosperin the thingwhereto I sent it.",
        "12For ye shall go out withjoy, and be led forth with peace: the mountains and the hills shall break forth before you into singing, and all thetreesof the field shall claptheirhands.",
        "13Instead of the thorn shall come up thefir tree, and instead of the brier shall come up the myrtle tree: and it shall be to theLordfor a name, for an everlasting signthatshall not be cut off."
      ],
      "full_text": "1Ho, every one thatthirsteth, come ye to thewaters, and he that hath no money; come ye, buy, and eat; yea, come,buywine and milk without money and withoutprice. 2Wherefore do yespendmoney forthat which isnot bread? and yourlabourforthat whichsatisfieth not? hearkendiligentlyunto me, and eat yethat which isgood, and let your soul delight itself in fatness. 3Incline your ear, andcomeunto me: hear, and yoursoulshall live; and I will make an everlastingcovenantwith you,eventhesuremercies of David. 4Behold, I have given himforawitnessto the people, aleaderand commander to the people. 5Behold, thou shalt call a nationthatthou knowest not, andnationsthatknew not thee shall run unto thee because of theLordthy God, and for the Holy One of Israel; for he hath glorified thee. 6Â¶Seekye theLordwhile he may be found, call ye upon him while he is near: 7Let the wicked forsake his way, and the unrighteous man his thoughts: and let himreturnunto theLord, and he will have mercy upon him; and to our God, for he will abundantlypardon. 8Â¶For mythoughtsarenotyourthoughts, neitherareyourwaysmyways, saith theLord. 9Forasthe heavens are higher than the earth, so are mywayshigherthan your ways, and mythoughtsthan your thoughts. 10For as theraincometh down, and the snow from heaven, and returneth not thither, but watereth the earth, and maketh it bring forth and bud, that it may give seed to the sower, andbreadto the eater: 11So shall mywordbe that goeth forth out of my mouth: it shall not return unto me void, but it shall accomplish that which I please, and it shall prosperin the thingwhereto I sent it. 12For ye shall go out withjoy, and be led forth with peace: the mountains and the hills shall break forth before you into singing, and all thetreesof the field shall claptheirhands. 13Instead of the thorn shall come up thefir tree, and instead of the brier shall come up the myrtle tree: and it shall be to theLordfor a name, for an everlasting signthatshall not be cut off."
    },
    {
      "reference": "Isaiah 56",
      "title": "Isaiah 56",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/56?lang=eng",
      "summary": "All who keep the commandments will be exaltedâOther people will join IsraelâThe Lord will gather others to the house of Israel.",
      "verses": [
        "1Thus saith theLord, Keep ye judgment, and dojustice: for my salvationisnearto come, and my righteousness to be revealed.",
        "2Blessedisthe manthatdoeth this, and the son of manthatlayeth holdon it; that keepeth thesabbathfrom polluting it, and keepeth his hand from doing anyevil.",
        "3Â¶Neither let thesonof thestranger, that hath joined himself to theLord, speak, saying, TheLordhath utterly separated me from his people: neither let the eunuch say, Behold, Iama dry tree.",
        "4For thus saith theLordunto the eunuchs that keep my sabbaths, and choosethe thingsthat please me, and take hold of my covenant;",
        "5Even unto them will I give in minehouseand within my walls a place and a name better than ofsonsand of daughters: I will give them an everlasting name, that shall not be cut off.",
        "6Also the sons of the stranger, that join themselves to theLord, to serve him, and to love the name of theLord, to be his servants, every one that keepeth the sabbath from polluting it, and taketh hold of my covenant;",
        "7Even them will I bring to my holymountain, and make them joyful in myhouseofprayer: their burnt offerings and their sacrificesshall beacceptedupon mine altar; for minehouseshall be called an house of prayer forallpeople.",
        "8The LordGodwhichgathereththe outcasts of Israel saith, Yet will I gatherothersto him, beside those that are gathered unto him.",
        "9Â¶Allye beasts of the field, come to devour,yea,all ye beasts in the forest.",
        "10Hiswatchmenareblind: they are all ignorant, theyareall dumb dogs, they cannot bark; sleeping, lying down, loving to slumber.",
        "11Yea,they aregreedydogswhichcan never have enough, and theyareshepherdsthatcannot understand: they all look to theirownway, every one for his gain, from his quarter.",
        "12Come ye,say they,I will fetch wine, and we will fill ourselves with strong drink; and to morrow shall be as this day,andmuch more abundant."
      ],
      "full_text": "1Thus saith theLord, Keep ye judgment, and dojustice: for my salvationisnearto come, and my righteousness to be revealed. 2Blessedisthe manthatdoeth this, and the son of manthatlayeth holdon it; that keepeth thesabbathfrom polluting it, and keepeth his hand from doing anyevil. 3Â¶Neither let thesonof thestranger, that hath joined himself to theLord, speak, saying, TheLordhath utterly separated me from his people: neither let the eunuch say, Behold, Iama dry tree. 4For thus saith theLordunto the eunuchs that keep my sabbaths, and choosethe thingsthat please me, and take hold of my covenant; 5Even unto them will I give in minehouseand within my walls a place and a name better than ofsonsand of daughters: I will give them an everlasting name, that shall not be cut off. 6Also the sons of the stranger, that join themselves to theLord, to serve him, and to love the name of theLord, to be his servants, every one that keepeth the sabbath from polluting it, and taketh hold of my covenant; 7Even them will I bring to my holymountain, and make them joyful in myhouseofprayer: their burnt offerings and their sacrificesshall beacceptedupon mine altar; for minehouseshall be called an house of prayer forallpeople. 8The LordGodwhichgathereththe outcasts of Israel saith, Yet will I gatherothersto him, beside those that are gathered unto him. 9Â¶Allye beasts of the field, come to devour,yea,all ye beasts in the forest. 10Hiswatchmenareblind: they are all ignorant, theyareall dumb dogs, they cannot bark; sleeping, lying down, loving to slumber. 11Yea,they aregreedydogswhichcan never have enough, and theyareshepherdsthatcannot understand: they all look to theirownway, every one for his gain, from his quarter. 12Come ye,say they,I will fetch wine, and we will fill ourselves with strong drink; and to morrow shall be as this day,andmuch more abundant."
    },
    {
      "reference": "Isaiah 57",
      "title": "Isaiah 57",
      "url": "https://www.churchofjesuschrist.org/study/scriptures/ot/isa/57?lang=eng",
      "summary": "When the righteous die, they enter into peaceâMercy is promised to the penitentâThere is no peace for the wicked.",
      "verses": [
        "1The righteousperisheth, and no man layethitto heart: and merciful menaretaken away, none considering that the righteous is taken away from the evilto come.",
        "2He shall enter intopeace: they shall rest in their beds,each onewalkinginhis uprightness.",
        "3Â¶But draw near hither, yesonsof the sorceress, the seed of theadultererand the whore.",
        "4Against whom do ye sport yourselves? against whom make ye a wide mouth,anddraw out the tongue?areye notchildrenof transgression, a seed of falsehood,",
        "5Enflaming yourselves withidolsunder every green tree,slayingthechildrenin the valleys under the clifts of the rocks?",
        "6Among the smoothstonesof the streamisthy portion; they, theyarethy lot: even to them hast thou poured a drink offering, thou hastoffered a meat offering. Should I receive comfort in these?",
        "7Upon a lofty and high mountain hast thou set thybed: even thither wentest thou up to offer sacrifice.",
        "8Behind the doors also and the posts hast thou set up thy remembrance: for thou hastdiscoveredthyself toanotherthan me, and art gone up; thou hast enlarged thy bed, and made theea covenantwith them; thou lovedst their bed where thou sawestit.",
        "9And thou wentest to thekingwith ointment, and didst increase thy perfumes, and didst send thy messengers far off, and didst debasethyself evenunto hell.",
        "10Thou art wearied in the greatness of thy way;yetsaidst thou not, There is nohope: thou hast found thelife of thine hand; therefore thou wast not grieved.",
        "11And of whom hast thou been afraid orfeared, that thou hastlied, and hast not remembered me, nor laiditto thy heart? have not I held my peace even of old, and thou fearest me not?",
        "12I willdeclarethy righteousness, and thy works; for they shall not profit thee.",
        "13Â¶When thou criest, let thy companies deliver thee; but the wind shall carry them all away; vanity shall takethem:but he that putteth his trust in me shall possess the land, and shall inherit my holymountain;",
        "14And shall say, Cast ye up, cast ye up,preparethe way, take up thestumblingblockout of the way of my people.",
        "15For thus saith the high and lofty One that inhabitetheternity, whose nameisHoly; I dwell in the high and holyplace,with him alsothat isof acontriteandhumblespirit, torevivethe spirit of thehumble, and to revive the heart of the contrite ones.",
        "16For I will notcontendfor ever, neither will I be always wroth: for the spirit should fail before me, and thesoulswhichI have made.",
        "17For theiniquityof hiscovetousnesswas I wroth, and smote him: I hid me, and was wroth, and he went onfrowardlyin the way of his heart.",
        "18I have seen his ways, and will heal him: I willleadhim also, and restorecomfortsunto him and to hismourners.",
        "19I create thefruitof the lips; Peace, peace tohim that isfaroff, and tohim that isnear, saith theLord; and I will heal him.",
        "20But thewickedarelike the troubled sea, when it cannot rest, whose waters cast up mire and dirt.",
        "21There isnopeace, saith my God, to the wicked."
      ],
      "full_text": "1The righteousperisheth, and no man layethitto heart: and merciful menaretaken away, none considering that the righteous is taken away from the evilto come. 2He shall enter intopeace: they shall rest in their beds,each onewalkinginhis uprightness. 3Â¶But draw near hither, yesonsof the sorceress, the seed of theadultererand the whore. 4Against whom do ye sport yourselves? against whom make ye a wide mouth,anddraw out the tongue?areye notchildrenof transgression, a seed of falsehood, 5Enflaming yourselves withidolsunder every green tree,slayingthechildrenin the valleys under the clifts of the rocks? 6Among the smoothstonesof the streamisthy portion; they, theyarethy lot: even to them hast thou poured a drink offering, thou hastoffered a meat offering. Should I receive comfort in these? 7Upon a lofty and high mountain hast thou set thybed: even thither wentest thou up to offer sacrifice. 8Behind the doors also and the posts hast thou set up thy remembrance: for thou hastdiscoveredthyself toanotherthan me, and art gone up; thou hast enlarged thy bed, and made theea covenantwith them; thou lovedst their bed where thou sawestit. 9And thou wentest to thekingwith ointment, and didst increase thy perfumes, and didst send thy messengers far off, and didst debasethyself evenunto hell. 10Thou art wearied in the greatness of thy way;yetsaidst thou not, There is nohope: thou hast found thelife of thine hand; therefore thou wast not grieved. 11And of whom hast thou been afraid orfeared, that thou hastlied, and hast not remembered me, nor laiditto thy heart? have not I held my peace even of old, and thou fearest me not? 12I willdeclarethy righteousness, and thy works; for they shall not profit thee. 13Â¶When thou criest, let thy companies deliver thee; but the wind shall carry them all away; vanity shall takethem:but he that putteth his trust in me shall possess the land, and shall inherit my holymountain; 14And shall say, Cast ye up, cast ye up,preparethe way, take up thestumblingblockout of the way of my people. 15For thus saith the high and lofty One that inhabitetheternity, whose nameisHoly; I dwell in the high and holyplace,with him alsothat isof acontriteandhumblespirit, torevivethe spirit of thehumble, and to revive the heart of the contrite ones. 16For I will notcontendfor ever, neither will I be always wroth: for the spirit should fail before me, and thesoulswhichI have made. 17For theiniquityof hiscovetousnesswas I wroth, and smote him: I hid me, and was wroth, and he went onfrowardlyin the way of his heart. 18I have seen his ways, and will heal him: I willleadhim also, and restorecomfortsunto him and to hismourners. 19I create thefruitof the lips; Peace, peace tohim that isfaroff, and tohim that isnear, saith theLord; and I will heal him. 20But thewickedarelike the troubled sea, when it cannot rest, whose waters cast up mire and dirt. 21There isnopeace, saith my God, to the wicked."
    }
  ],
  "scraped_timestamp": "2025-12-21 22:32:18",
  "metadata": {
    "week_number": 41,
    "title": "Week 41: October 5–11 - Isaiah 50–57",
    "date_range": "October 5–11",
    "scraped_at": "2025-12-21T22:32:24.207581",
    "scraper_version": "2.0.0"
  }
}