{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "adult",
  "word_count": 1035,
  "character_count": 6576,
  "content": "# Come, Follow Me Study Plan: Week 1 – Introduction to the Old Testament (December 29–January 4)\n\n## Weekly Overview\nThe Old Testament, one of the world's oldest scriptural collections, invites us into ancient lives marked by faith, repentance, covenants, and hope in a Savior—experiences that echo our own amid family joys, uncertainties, and triumphs. Its pages testify richly of Jesus Christ through symbols like manna and the sacrificial lamb, reveal Him as Jehovah who spoke to prophets, and highlight restored \"plain and precious things\" through Joseph Smith that clarify its gospel truths. In our day, as President Russell M. Nelson teaches in “The Everlasting Covenant” (Liahona, October 2022, 8), these covenants position us as God's \"peculiar treasure,\" offering timeless guidance for building faith in Christ.\n\n## Doctrinal Key Points\n1. **The Old Testament testifies of Jesus Christ as the Bread of Life**: Symbols such as manna (Exodus 16:4, 11–15; John 6:35), the sacrificial lamb (Exodus 12:3–5; John 1:29), the brass serpent (Numbers 21:4–10; John 3:14), and Jonah (Jonah 1:4–17; Matthew 12:38–41) bear record of Him, as the Lord told Adam, “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63).\n\n2. **Jesus Christ is Jehovah in the Old Testament**: President Dallin H. Oaks explained, “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (“The Teachings of Jesus Christ,” Liahona, May 2023, 102). This is evident in Exodus 3:13–15; 6:3–5, where Jehovah declares “I AM,” echoing Jesus's words in John 8:58–59.\n\n3. **Focus on Jesus Christ brings spiritual nourishment**: Elder Dale G. Renlund urged us to “remember and always focus on Jesus Christ” (“Jesus Christ Is the Treasure,” Liahona, Nov. 2023, 98), helping us find meaning even in unfamiliar ancient writings, as with Psalm 119:105: “Thy word is a lamp unto my feet, and a light unto my path.”\n\n4. **The Lord restored plain and precious truths**: Nephi saw that “many plain and precious things” were removed from the Bible (1 Nephi 13:21–29, 38–42), but the Lord would make them known through prophets like Joseph Smith, including the books of Moses and Abraham, and Joseph Smith Translation passages like Moses 7:18–19 on Enoch’s Zion (see also 2 Nephi 3:12).\n\n5. **Covenants define our relationship with God**: The Old Testament unfolds as God seeking to make Israel His “peculiar treasure” by covenant (Exodus 19:5), a theme echoed in Jeremiah 31:31–34 and fulfilled in the everlasting covenant President Nelson describes as bringing “special kind of love and mercy” (“The Everlasting Covenant,” Liahona, October 2022, 10).\n\n6. **Ancient prophets' faith mirrors ours**: Figures like Abraham, Sarah, Hannah, and Daniel exercised faith, repented, made covenants, and trusted in the Savior's promise, showing God's consistent hand in human lives (Psalm 119:140).\n\n## Personal Study Guide\n**Day 1: Embracing the Old Testament**  \nRead the Come, Follow Me introduction and Psalm 119:105, 140. Reflect: How do familiar experiences like family joy or uncertainty in these ancient lives reflect my own? Cross-reference Elder Renlund’s “Jesus Christ Is the Treasure” (Liahona, Nov. 2023, 98).\n\n**Day 2: Symbols of Christ**  \nStudy Exodus 16:4, 11–15; 12:3–5; Numbers 21:4–10; Jonah 1:4–17 with John 6:35; 1:29; 3:14; Matthew 12:38–41. Reflect: What do these teach about the Savior? List other symbols you know. See “Types or Symbols of Christ” in Guide to the Scriptures.\n\n**Day 3: Jesus Christ as Jehovah**  \nRead Exodus 3:13–15; 6:3–5; John 8:58–59 and President Oaks’s quote (Liahona, May 2023, 102). Reflect: Why is it significant that Jehovah is Jesus Christ? Note Joseph Smith Translation, Exodus 6:3 (footnote c).\n\n**Day 4: Restored Plain and Precious Things**  \nRead 1 Nephi 13:21–29, 38–42; 2 Nephi 3:12; examples in Moses 7:18–19; Abraham 3:22–28; Joseph Smith Translation, Genesis 14:25–40. Reflect: How do these clarify the Old Testament for you?\n\n**Day 5: The Everlasting Covenant**  \nStudy Exodus 19:5; Jeremiah 31:31–34 and President Nelson’s “The Everlasting Covenant” (Liahona, October 2022, 4–11). Reflect: What “special kind of love and mercy” do I receive by keeping covenants?\n\n**Day 6: Moses 6:63 and Teaching Focus**  \nRead Moses 6:63 and Teaching in the Savior’s Way, 7. Reflect: How can focusing on Christ increase my love for the scriptures? Review children’s helps like Isaiah 7:14; 9:6; Psalm 23.\n\n**Day 7: Synthesis and Review**  \nRe-read key symbols and covenants. Reflect: With the psalmist, how does God’s word light my path (Psalm 119:105)? Ponder prophetic messages for the week.\n\n## Group Discussion Ideas\n1. How have Old Testament symbols like the sacrificial lamb deepened your testimony of Christ’s Atonement?\n2. Why does knowing Jesus Christ is Jehovah change how you read phrases like “the Lord spake”?\n3. Share an experience where focusing on Jesus Christ, as Elder Renlund teaches, brought clarity to a challenging scripture.\n4. In what ways do restored accounts like Enoch’s Zion feel “plain and precious” in your life?\n5. How does Exodus 19:5 describe your covenant path with God?\n6. What from President Nelson’s “The Everlasting Covenant” motivates you to honor covenants this year?\n7. Like ancient prophets, when have you seen God move in moments of uncertainty?\n8. How can we help each other, as in Teaching in the Savior’s Way, find Christ throughout the Old Testament?\n\n## Application Challenges\n1. **Daily Christ-Focus**: Each morning, identify one Old Testament symbol of Jesus (e.g., manna) and note how it applies to your needs, as Elder Renlund encourages.\n2. **Covenant Journal**: Track one way this week to live your covenants, asking, “What mercy does God extend?” (per President Nelson).\n3. **Share with One Person**: Discuss a restored truth like Abraham 3:22–28 with a family member or friend, highlighting its Restoration clarity.\n4. **Scripture Light**: When facing a decision, turn to Psalm 119:105 and an Old Testament verse, recording how it guided you.\n\n## Testimony Builder\nThrough the Old Testament’s symbols, Jehovah’s voice, and covenant promises—restored plainly in this dispensation—we see Jesus Christ as the unchanging Savior who has always sought His people. As Nephi foresaw, these truths unite the Bible and Book of Mormon to testify of Him (2 Nephi 3:12). Ponder how He illuminates your path this year, drawing you nearer through ancient witnesses made fresh by living prophets.\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-10 22:21:46",
  "source_week_file": "cfm_2026_week_01.json"
}