{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "adult",
  "word_count": 1314,
  "character_count": 7999,
  "content": "# Come, Follow Me Study Plan for Adults: Week 2 (January 5–11) - Moses 1; Abraham 3\n\n## Weekly Overview\nThis week’s study of Moses 1 and Abraham 3 invites us into profound truths about our divine identity, God’s eternal purposes, and our premortal existence. These scriptures, revealed through the Prophet Joseph Smith, provide a foundational understanding of who we are as children of God, why we are here on earth, and what God’s work entails. Set against the backdrop of Moses’s visionary experiences and Abraham’s glimpse into the premortal realm, these chapters answer fundamental questions about our relationship with Heavenly Father and Jesus Christ. Their teachings are as relevant today as ever, helping us navigate life’s challenges with an eternal perspective.\n\n## Doctrinal Key Points\n1. **I Am a Child of God with Divine Worth** (Moses 1:4, 6): God affirms to Moses, “Thou art my son” (Moses 1:4), and “thou art in the similitude of mine Only Begotten” (Moses 1:6), emphasizing our divine identity and potential as His children.\n2. **Satan Seeks to Undermine My Identity** (Moses 1:12): In contrast to God’s uplifting message, Satan tells Moses, “Moses, son of man, worship me” (Moses 1:12), attempting to diminish his divine worth and lead him astray.\n3. **I Can Resist Satan with God’s Help** (Moses 1:13-18, 24-26): Moses’s repeated rejection of Satan and reliance on God’s power show that we can overcome temptation by remembering our identity and calling upon the Lord.\n4. **God’s Work and Glory Is My Eternal Life** (Moses 1:39): The Lord declares, “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39), revealing His ultimate purpose for us.\n5. **I Lived as a Spirit Before Earth** (Abraham 3:22-23): Abraham saw “the intelligences that were organized before the world was” (Abraham 3:22), teaching us that we existed as spirits and were chosen for specific purposes.\n6. **Jesus Christ Was Chosen in the Premortal Life** (Abraham 3:24, 27): Among the spirits, “one among them that was like unto God” (Abraham 3:24) was chosen to be our Savior, highlighting Christ’s central role in the plan of salvation.\n7. **Earth Life Is a Test of Obedience** (Abraham 3:25): The Lord explained, “We will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them” (Abraham 3:25), underscoring the purpose of mortality as a time of testing and growth.\n\n## Personal Study Guide\n**Day 1: Moses 1:1-11 – My Identity as a Child of God**  \n- Reading: Moses 1:1-11  \n- Reflection: How does God’s personal address to Moses as “my son” (Moses 1:4) deepen your understanding of your relationship with Heavenly Father?  \n- Cross-Reference: President Russell M. Nelson, “Choices for Eternity” (worldwide devotional for young adults, May 2022), section “First: Know the truth about who you are.”\n\n**Day 2: Moses 1:12-26 – Resisting Satan’s Counterfeits**  \n- Reading: Moses 1:12-26  \n- Reflection: What specific actions did Moses take to resist Satan (see Moses 1:13, 18)? How can you apply these in moments of temptation?  \n- Cross-Reference: Gary E. Stevenson, “Deceive Me Not,” Ensign or Liahona, Nov. 2019, 93–96.\n\n**Day 3: Moses 1:27-39 – God’s Work and Glory**  \n- Reading: Moses 1:27-39  \n- Reflection: How does knowing that God’s purpose is your eternal life (Moses 1:39) influence your daily priorities?  \n- Cross-Reference: Gospel Topics, “Eternal Life,” Gospel Library.\n\n**Day 4: Abraham 3:1-17 – The Lord’s Creations and Order**  \n- Reading: Abraham 3:1-17  \n- Reflection: What do these verses teach about God’s power and organization in the universe? How does this perspective affect your trust in Him?  \n- Cross-Reference: Moses 1:27-33 for comparison.\n\n**Day 5: Abraham 3:18-23 – Premortal Spirits and Identity**  \n- Reading: Abraham 3:18-23  \n- Reflection: How does knowing you were among the “noble and great ones” (Abraham 3:22-23) shape your sense of purpose?  \n- Cross-Reference: Gospel Topics, “Premortal Life,” Gospel Library.\n\n**Day 6: Abraham 3:24-28 – The Plan of Salvation**  \n- Reading: Abraham 3:24-28  \n- Reflection: What do these verses teach about agency and the purpose of earth life (see Abraham 3:25)? How does Christ’s role inspire you?  \n- Cross-Reference: Moses 1:39 for God’s stated purpose.\n\n**Day 7: Synthesis and Testimony Building**  \n- Reading: Review Moses 1:4, 39; Abraham 3:22-25  \n- Reflection: Write down how these truths about your divine identity and God’s plan impact your life choices. How can you live more aligned with your premortal purpose?  \n- Cross-Reference: Hymn, “I Am a Child of God,” Hymns (1985), no. 301.\n\n## Group Discussion Ideas\n1. How does understanding our identity as children of God (Moses 1:4, 6) influence the way we treat ourselves and others in daily interactions?  \n2. What are some modern counterfeits Satan uses to distract us from our divine worth, and how can we recognize and reject them as Moses did (Moses 1:13-18)?  \n3. How does knowing God’s work and glory is to bring about our eternal life (Moses 1:39) change the way we view challenges or setbacks?  \n4. In what ways has understanding your premortal existence (Abraham 3:22-23) given you strength or purpose during difficult times?  \n5. How can we help each other remember our divine identity when faced with worldly labels or pressures, as President Nelson taught in “Choices for Eternity” (May 2022)?  \n6. What lessons from Moses’s resistance to Satan (Moses 1:12-26) can we apply as a family or ward to support one another in overcoming temptation?  \n7. How does the knowledge of Christ’s premortal role (Abraham 3:24, 27) deepen our gratitude for His Atonement and leadership in our lives?  \n8. How can we create teaching moments in everyday life to share these truths with children or friends, as suggested in *Teaching in the Savior’s Way* (p. 31)?\n\n## Application Challenges\n1. **Affirm Your Identity**: Each morning this week, look in the mirror and say, “I am a child of God,” then make one decision based on that truth, such as showing kindness or avoiding negative self-talk.  \n2. **Resist Temptation**: Identify a recurring temptation and follow Moses’s example by praying for strength (Moses 1:18) and focusing on your divine purpose when faced with it.  \n3. **Serve with Purpose**: Seek a small way to contribute to God’s work of bringing others to eternal life (Moses 1:39), such as reaching out to a struggling ward member or sharing a gospel truth.  \n4. **Reflect on Premortal Choices**: Ponder how your premortal commitment to follow God (Abraham 3:25) can inspire a specific act of obedience this week, like keeping a commandment more faithfully.\n\n## Testimony Builder\nAs I study Moses 1 and Abraham 3, I feel a deep reverence for the Savior, Jesus Christ, who was chosen before the foundation of the world to be our Redeemer (Abraham 3:24, 27). These scriptures remind me that the Restoration, through Joseph Smith, brought to light these eternal truths about our divine identity and God’s plan—truths that anchor us in a world of confusion. I invite you to reflect on how knowing you are a child of God, with a premortal heritage and a divine destiny, draws you closer to Christ and strengthens your desire to follow Him. His love and the Father’s plan are the foundation of all we are and hope to become.\n\n**Relevant Prophetic Quotes**:  \n- “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” – President Russell M. Nelson, “Choices for Eternity” (worldwide devotional for young adults, May 2022).  \n- “The way you think about who you really are affects almost every decision you will ever make” – President Russell M. Nelson, “Choices for Eternity” (May 2022).  \n- “Satan is no match for the Savior. Satan’s fate is decided. He knows he has lost, but he wants to take as many with him as he can” – Elder Gary E. Stevenson, “Deceive Me Not,” Ensign or Liahona, Nov. 2019, 94.",
  "generated_timestamp": "2025-12-31 23:58:14",
  "source_week_file": "cfm_2026_week_02.json"
}