{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "audience": "younger-primary",
  "word_count": 555,
  "character_count": 3270,
  "content": "# Jesus Created a Beautiful World for Us!\n\n## Lesson Overview\nJesus created the beautiful world for us to enjoy and care for. We can thank Him by loving His creations.\n\n## TEACHER LESSON (8-10 minutes)\n**Get Attention (1-2 minutes):** Hold up a shiny apple or flower. \"Look at this pretty thing! Who made it?\" Let kids shout \"Jesus!\"\n\n**Simple Story (3-4 minutes):** Use pictures of sun, animals, plants. Act it out: Wiggle fingers for light (\"Let there be light!\"), roar like animals, wave arms like trees. \"Jesus created day and night, sky and sea, plants and animals, just like in Genesis 1 and Moses 2. He made a beautiful world!\"\n\n**Big Idea (2-3 minutes):** Repeat 3 times: \"Jesus created the world for us! Jesus created the world for us! Jesus created the world for us!\" Point to kids: \"He made YOU special too!\"\n\n**We Can Do This (1-2 minutes):** \"We can say thank you by picking up toys and being kind to animals, just like caring for God's creations (Genesis 1:28).\"\n\n## Wiggle Activity (2-3 minutes)\nSing \"My Heavenly Father Loves Me\" (CS, 228-29) while marching around the room. Point to eyes, ears, mouth as you sing. Add jumps for \"He gave me my eyes that I might see.\"\n\n## Simple Scripture\n\"God created... man in his own image\" (Genesis 1:27).  \n*Say together 3 times with motions: Point up for God, hug self for \"man,\" mirror pose for \"image.\"*\n\n## Fun Activities (15 minutes total)\n**1. Creation Object Lesson (3 minutes)**  \n*Materials:* Rock, feather, leaf, toy fish.  \n*Steps:* 1. Pass items around. 2. Ask \"Who made this?\" 3. Say \"Jesus!\"  \n*Say:* \"Jesus made rocks, birds, trees, fish (Moses 2)! Feel how special!\"  \n\n**2. Animal Freeze Dance Game (4 minutes)**  \n*Materials:* None.  \n*Steps:* 1. Play music, dance like animals Jesus made. 2. Freeze when music stops. 3. Shout \"Jesus made me!\"  \n*Say:* \"Dance like lions, birds, fish from Genesis 1! Jesus created them for us!\"  \n\n**3. Draw God's World Craft (4 minutes)**  \n*Materials:* Paper, crayons.  \n*Steps:* 1. Draw one thing Jesus made (sun, flower, you!). 2. Add sticker heart. 3. Share with friend.  \n*Say:* \"Draw something beautiful Jesus created (Abraham 4). Take it home to remember!\"  \n\n**4. Body Puzzle Hands-On (4 minutes)**  \n*Materials:* Pre-drawn body outlines cut into 4-5 pieces per child.  \n*Steps:* 1. Mix pieces. 2. Put puzzle together. 3. Say \"I'm made in God's image!\"  \n*Say:* \"We are like Heavenly Father (Moses 2:26-27)! Puzzle shows we are special.\"  \n\n## Picture Time\nShow \"The Creation\" by Annie Henrie Nader (Gospel Art Book). Ask: \"What do you see Jesus making?\" \"How does it make you feel happy?\" \"What would you thank Jesus for?\"\n\n## Song\n\"My Heavenly Father Loves Me\" (CS, 228-29). Add actions: Clap for mountains, flap arms for birds, touch heart for love.\n\n## Snack Idea\nGoldfish crackers. \"Jesus made fish in the sea (Genesis 1)! Crunch and say thank you.\"\n\n## Testimony Moment\n\"I know Jesus created this beautiful world and loves each of you so much.\" Invite: Fold arms and say together, \"Jesus made me special. I love Jesus!\"\n\n## Teacher Survival Tips\n1. If a child wiggles, give a job like holding a picture.  \n2. Use timer for activities—sing a quick song to switch.  \n3. If short on time, skip one activity and add more song time.  \n\n*(Word count: 612)*",
  "generated_timestamp": "2026-01-11 18:34:39",
  "source_week_file": "cfm_2026_week_03.json"
}