{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "youth",
  "word_count": 805,
  "character_count": 5024,
  "content": "# Come, Follow Me Youth Lesson Plan: Genesis 3–4; Moses 4–5 (January 19–25)\n\nHey, youth leaders! This lesson turns the story of Adam and Eve from a \"what if they hadn't eaten the fruit?\" vibe into an epic reminder that life's messiness is part of God's plan for growth. Teens will see how the Fall sets up agency, opposition, redemption, and real choices—perfect for navigating Snapchat drama, group chat pressure, or deciding if that party invite aligns with their standards. Aim for 45-50 minutes. Grab props like paper for journaling or a phone for videos.\n\n## Attention Grabber (5 minutes)\nKick off with this scenario: \"Picture this—you're killing it in a video game, infinite lives, no fails, perfect world. Then bam, level up means real stakes: losing points, tough bosses, teamwork required. Sounds frustrating, right? But without it, you'd never git gud. Adam and Eve left Eden's paradise for exactly that—a world of opposition to grow (see Genesis 3:16–19; Moses 4). Ask: 'Why do you think God designed life with hard parts instead of easy mode?' Let 2-3 teens share quick thoughts. Boom—hooked on why the Fall matters.\"\n\n## Core Doctrines (5 minutes)\nShare these 5 key truths simply, with verses on the board or slides. Tie to *For the Strength of Youth* (FSY) where it fits.\n\n1. **The Fall was necessary for God’s plan**: Adam and Eve's choice brought pain and separation but opened growth, choices, repentance, and joy. \"And Adam and Eve, his wife, heard the voices of the Lord God... And Adam called upon the name of the Lord, and Eve also... And in that day Adam blessed God... saying: Blessed be the name of God... because of my transgression my eyes are opened, and in transgressing thy commandment... I have eaten of the tree... wherefore... I know these things\" (Moses 5:9–12). See also 2 Nephi 2:19–25.\n\n2. **Jesus Christ offers hope and redemption**: The Fall brought spiritual and physical death, but Christ's Atonement redeems us. Adam and Eve were \"glad\" after an angel taught them of sacrifice and the Savior (Moses 5:4–15). Watch snippet of “Because of Him” video (Gospel Library).\n\n3. **Agency and opposition help us grow**: Heavenly Father and Jesus protected our right to choose. \"Our Heavenly Father’s goal... is to have His children choose to do what is right\" (Elder Dale G. Renlund, “Choose You This Day,” Ensign or Liahona, Nov. 201 8, 104). Opposition is essential (Moses 4:1–4; 2 Nephi 2:11–20, 25–30; FSY: “Make inspired choices,” 4–5).\n\n4. **Satan seeks to deceive and blind us**: He tempts with lies, like to Adam, Eve, and Cain (Moses 4:4–12; 5:13–33). Spot his tactics today!\n\n5. **God accepts willing sacrifices**: Offer with real obedience, like Abel—not half-hearted like Cain (Moses 5:4–9, 16–26).\n\n## Interactive Activities (20-25 minutes)\nPick 2-3 based on group size. Rotate for everyone to participate.\n\n1. **Video + \"Because of Him\" Discussion (10 minutes)**: Play “Because of Him” (Church video, Gospel Library; 3:30 min). In pairs, complete: \"Because of the Fall, I experience... [e.g., temptations, hard classes]. Because of Jesus Christ, I can... [e.g., repent, feel joy].\" Share 1-2 aloud. Ties to Moses 4:25; 5:8–11, 14–15.\n\n2. **Small Group Satan Spotter Challenge (10 minutes)**: Groups of 3-4 list 3 ways Satan tempted in Moses 4:4–12; 5:13–33 (e.g., deceive about fruit, blind Cain with jealousy). Then, modern twists: fake friends pushing bad choices, TikTok filters hiding truth. Report back: \"How does Heavenly Father help resist?\" (See Genesis 3:1–7; Moses 4:22–31). Play “Choose the Right” (Hymns, no. 239) softly.\n\n3. **Agency Role-Play Dilemmas (10 minutes)**: \"Would You Rather\" style. Pairs act out: (a) Friend texts party invite with sketchy vibes—choose fun or standards? (b) Group project tempts cheating—agency or easy A? Use Moses 4:1–4; 2 Nephi 2:27: \"Men are free... to choose liberty and eternal life... or... captivity and death.\" Debrief: What opposition helped choose right?\n\n## Real-Life Application (5 minutes)\nMake it hit home: \"Peer pressure? That's Satan's old playbook from Moses 4—deceive like the serpent. Use agency daily: Scroll social media? Choose uplifting over endless compare (FSY standards). Dating? Honor equal partnership like 'The Family: A Proclamation'—respect, no ruling over (Genesis 3:16; Elder Ulisses Soares, “Equal Partnership in Marriage” video). School stress? Opposition builds testimonies, preps for missions. Sacrifice screen time willingly (Moses 5:16–26) to pray like Adam (Moses 5:4,8). Track one choice this week!\"\n\n## Testimony Moment (5 minutes)\nGather close: \"As we've seen, the Fall wasn't tragedy—it launched God's plan for us to choose joy through Christ (Moses 5:11). I love how Adam and Eve turned questions into blessings. What stands out to you? Share if you feel it.\" Pause for 3-4 quick shares. Challenge: \"This week, spot one opposition (like a tough choice), choose Christ, journal how it felt. Report back next week—let's grow together!\" End singing “Choose the Right” chorus. (Word count: 812)",
  "generated_timestamp": "2026-01-11 18:08:33",
  "source_week_file": "cfm_2026_week_04.json"
}