{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "adult",
  "word_count": 1024,
  "character_count": 6472,
  "content": "# Come, Follow Me Study Plan: Week 4 (January 19–25)  \n**Genesis 3–4; Moses 4–5**\n\n## Weekly Overview\nThe account of Adam and Eve's Fall in Genesis 3–4 and Moses 4–5 reveals it not as a tragedy but as an essential step in God's plan for our growth and exaltation (Come, Follow Me—For Home and Church: Old Testament 2026). In the restored truths of Moses, we see how leaving Eden opened the way for opposition, agency, choices, repentance, and redemption through the Savior's Atonement, leading to \"the joy of our redemption\" (Moses 5:11). This doctrine underscores the modern relevance of facing mortality's challenges with hope, as prophets affirm that such experiences enable us to become like our Heavenly Father.\n\n## Doctrinal Key Points\n1. **The Fall was a necessary part of God’s plan** (Genesis 3; Moses 4): Adam and Eve's choice brought pain, sorrow, and death, yet it provided opposition essential for growth, as Lehi taught: \"It must needs be, that there was an opposition; even the forbidden fruit in opposition to the tree of life; the one being sweet and the other bitter\" (2 Nephi 2:15, see also 2 Nephi 2:19–25; Mosiah 3:19; Alma 12:21–37; Doctrine and Covenants 29:39–43).  \n2. **Jesus Christ offers hope and redemption** (Genesis 3:1–7; Moses 4:22–31; 5:4–15): The effects of the Fall—spiritual and physical death—are overcome through the Savior, leaving Adam and Eve \"glad\" after learning of His gospel (Moses 5:11).  \n3. **Husbands and wives are equal partners** (Genesis 3:16; Moses 4:22): Righteous husbands \"will seek to minister; he will acknowledge error and seek forgiveness; he will be quick to offer praise; he will be considerate of family members’ preferences; he will feel the great weight of responsibility to provide ‘the necessities of life and protection’ for his family; he will treat his wife with the utmost respect and deference. … He will bless his family\" (Elder Dale G. Renlund and Sister Ruth Lybbert Renlund, *The Melchizedek Priesthood: Understanding the Doctrine, Living the Principles* [2018], 23; “The Family: A Proclamation to the World”).  \n4. **Agency and opposition enable righteous choices** (Moses 4:1–4): \"Our Heavenly Father’s goal in parenting is not to have His children *do* what is right; it is to have His children *choose* to do what is right and ultimately become like Him\" (Elder Dale G. Renlund, “Choose You This Day,” *Ensign* or *Liahona*, Nov. 2018, 104; see 2 Nephi 2:11–20, 25–30).  \n5. **Satan seeks to deceive and blind us** (Moses 4:4–12; 5:13–33): He tempted Adam, Eve, and their children through lies and secret combinations, mirroring modern tactics we resist through God's help.  \n6. **God clothes and covers us** (Moses 4:13–16, 27): After their futile attempts, \"I, the Lord God … clothed them,\" symbolizing divine protection (see Revelation 7:9, 13–15; 2 Nephi 9:14; Doctrine and Covenants 109:22–26, 76).  \n7. **God accepts willing, obedient sacrifices** (Moses 5:4–9, 16–26): Abel's offering was received because of his heart, unlike Cain's, teaching us to offer our sacrifices with real intent.\n\n## Personal Study Guide\n**Day 1 (Monday): The Fall's Necessity** – Read Genesis 3; Moses 4. Reflect: Why was the Fall important to God’s plan (Moses 5:9–12)? Cross-reference: 2 Nephi 2:19–25. How do Adam and Eve's feelings apply to your life?  \n**Day 2 (Tuesday): Redemption Through Christ** – Read Genesis 3:1–7; Moses 4:22–31; 5:4–15. List Fall's results and God's remedies. Why were they \"glad\" (Moses 5:11)? Watch “Because of Him” (Gospel Library).  \n**Day 3 (Wednesday): Equal Partnership** – Study Genesis 3:16; Moses 4:22. Ponder “The Family: A Proclamation to the World” and Elder Ulisses Soares's “Equal Partnership in Marriage” (video, Gospel Library). How does this clarify ruling over as ministering?  \n**Day 4 (Thursday): Agency Protected** – Read Moses 4:1–4; 2 Nephi 2:11–20, 25–30. Journal: How do Heavenly Father and Jesus protect your agency? See “Make inspired choices” in *For the Strength of Youth* (4–5); Elder Dallin H. Oaks, “Opposition in All Things,” *Ensign* or *Liahona*, May 2016.  \n**Day 5 (Friday): Satan's Deceptions** – Read Moses 4:4–12; 5:13–33. List temptations then and now. How does God help you resist?  \n**Day 6 (Saturday): Clothed by God** – Study Moses 4:13–16, 27. What do nakedness and clothing represent? If endowed, reflect on temple garments (“Sacred Temple Clothing,” Gospel Library).  \n**Day 7 (Sunday): Acceptable Sacrifices** – Read Moses 5:4–9, 16–26; Genesis 4. Why Abel's yes, Cain's no? What sacrifices does God ask of you?\n\n## Group Discussion Ideas\n1. According to Moses 5:9–12, how did Adam and Eve feel post-Fall? Share a time opposition brought growth (2 Nephi 2:19–25).  \n2. What effects of the Fall do you see in your life, and how does Christ redeem them (Moses 5:4–15)?  \n3. How does Genesis 3:16 align with equal partnership today (“The Family: A Proclamation to the World”)? Share marriage experiences.  \n4. Why must we *choose* righteousness (Moses 4:1–4; Elder Renlund, Nov. 2018)? How has agency blessed you?  \n5. In what ways does Satan deceive today, like in Moses 5:13–33? How do you resist?  \n6. What does God's clothing of Adam and Eve teach about His care (Moses 4:13–16, 27)?  \n7. Compare Abel and Cain's sacrifices (Moses 5:16–26). What changes your heart's intent?  \n8. How does the Fall point to the Savior's joy (Moses 5:11)? Share a redemption story.\n\n## Application Challenges\n1. This week, when facing opposition, complete: \"Because of the Fall, I … Because of Jesus Christ, I …\" (Moses 4:25; 5:8–11; 6:59) and share with family.  \n2. In family roles, practice ministering like the righteous husband described (Elder Renlunds, 2018)—seek forgiveness, praise, or provide necessities respectfully.  \n3. Make an inspired choice daily using *For the Strength of Youth* (4–5), thanking Christ for agency (2 Nephi 2:27).  \n4. Offer a \"sacrifice\" with willing heart, like extra service, pondering Abel's example (Moses 5:16–26).\n\n## Testimony Builder\nThese chapters witness that the Fall, preserved through Joseph Smith's revelations in Moses, thrust us into a world where Christ's Atonement shines brightest, turning opposition into opportunity for godliness (Moses 5:11). As Adam and Eve learned the gospel and rejoiced, so can we in the restored plan—agency protected, deceptions pierced, sacrifices hallowed by Him who redeems all. Ponder how this truth draws you nearer to the Savior today.\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-10 22:24:22",
  "source_week_file": "cfm_2026_week_04.json"
}