{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "children",
  "word_count": 601,
  "character_count": 3607,
  "content": "# Come, Follow Me for Kids: Week 1  \n**Introduction to the Old Testament** (December 29–January 4)  \n\nYay! Let's start a super fun adventure in the Old Testament to find Jesus like hidden treasures!  \n\n## Fun Start  \nImagine a big treasure map full of stories about Jesus—manna from heaven, a special lamb, and brave friends like Jonah. How exciting to hunt for Jesus every week! (Younger kids: Point and giggle at pictures. Older kids: Share what you know about Jesus.)  \n\n## Key Gospel Ideas  \n1. **Jesus is in the Old Testament like bread!** \"Manna\" fed God's people (Exodus 16:4, 11–15). Jesus said, \"I am the bread of life\" (John 6:35). *Color white fluffy manna clouds!*  \n2. **Jesus is like a lamb!** Pick a perfect lamb for Passover (Exodus 12:3–5). John called Jesus \"the Lamb of God\" (John 1:29). *Draw a fluffy lamb with a heart.*  \n3. **Jesus is Jehovah!** God told Moses His name \"I AM\" (Exodus 3:13–15; 6:3). Jesus is the Lord who spoke long ago! *Color a shining name tag.*  \n4. **God wants covenants with us!** Promises like baptism (Mosiah 18:10, 13). Yay for keeping promises to Heavenly Father! *Picture a baptism hug.*  \n5. **Look for Jesus symbols!** Like the brass serpent (Numbers 21:4–10; John 3:14). *Finger paint a snake on a pole.* (Younger: Simple shapes. Older: Add Bible words.)  \n\n## Daily Adventures  \n**Day 1:** Sing \"Seek the Lord Early\" (Children’s Songbook, 108). Draw manna raining down!  \n**Day 2:** Pretend to eat yummy bread. Read John 6:35. Make bread dough hearts.  \n**Day 3:** Act like a lamb—baa and jump! Color Exodus 12:3–5 lamb.  \n**Day 4:** Whisper \"I AM\" like Jehovah. Draw Moses at the bush (Exodus 3:13–15).  \n**Day 5:** Talk about family promises. Sing \"When I Am Baptized\" (Children’s Songbook, 103).  \n**Day 6:** Find Jesus words in Psalm 23. Color green pastures.  \n**Day 7:** Read Isaiah 9:6. Make star paper chains for baby Jesus! (Younger: Stick stickers. Older: Write \"Wonderful.\")  \n\n## Story Time (248 words)  \nLong ago, God's people grumbled in the desert—they were hungry! Heavenly Father said, \"Watch this!\" and sent fluffy white manna like bread from heaven every morning (Exodus 16:4, 11–15). \"It is manna,\" an angel said. The people gathered it, ground it, and ate yummy cakes. But they had to trust God each day—no saving extra for lazy days!  \n\nThis manna pointed to Jesus, our Bread of Life who feeds our hearts forever (John 6:35). God always provides, just like rainbows after rain or hugs from mom. Another treasure: a lamb without spots for Passover night (Exodus 12:3–5). Its blood kept families safe, showing Jesus as the Lamb of God who saves us (John 1:29).  \n\nYay, Jesus is everywhere in the Old Testament!  \n\n*Questions:* What did manna taste like? How does Jesus feed you? Who is the Lamb? (Younger: Clap for manna. Older: Tell why Jesus saves.)  \n\n## Play and Learn  \n1. **Treasure Hunt:** Hide pictures of manna, lamb, serpent. Find and shout \"Jesus!\" (Younger: Big pics. Older: Read clues from Exodus.)  \n2. **Name Tag Jehovah:** Make tags with \"I AM.\" March and say names Jesus had (Exodus 6:3).  \n3. **Covenant Promises:** Hold hands in circle. Share \"I promise to...\" like baptism friends (Mosiah 18:10).  \n4. **Symbol Blocks:** Build with blocks: tower for manna, animal for lamb. Knock down and say \"Jesus saves!\" (Younger: Stack soft toys. Older: Act stories.)  \n\n## Jesus Connection  \nJesus loves you so much—He's the treasure in every Old Testament story, like manna feeding us! Pray: \"Thank You, Jesus, for being our Bread and Lamb.\" I know Jesus lives and leads us. Share one way you see Him today! Yay for Jesus!",
  "generated_timestamp": "2026-01-10 22:22:21",
  "source_week_file": "cfm_2026_week_01.json"
}