{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "older-primary",
  "word_count": 748,
  "character_count": 4736,
  "content": "# Lesson Plan: Introduction to the Old Testament\n\n## Lesson Overview\nThe Old Testament is full of stories and symbols that teach us about Jesus Christ, like manna or a sacrificial lamb (Exodus 16:4, 11–15; John 6:35; Exodus 12:3–5; John 1:29). It also shows Heavenly Father making special promises, called covenants, with His people (Exodus 19:5; Mosiah 18:10). For 8-10-year-olds, this lesson builds excitement for scripture study by helping them see Jesus as the center and feel joy in keeping promises with God.\n\n## TEACHER LESSON (8-10 minutes)\n**Hook (1-2 minutes):** Hold up a treasure map or flashlight in a dim room. Ask, \"Have you ever used a map or light to find hidden treasure? The Old Testament is like that—it lights the way to find Jesus Christ!\" (Psalm 119:105).\n\n**Scripture Story (3-4 minutes):** Share the story of manna: \"God's people were hungry in the desert. Each morning, Heavenly Father sent bread from heaven called manna (Exodus 16:4, 11–15). They had to trust Him to gather just enough. Jesus said, 'I am the bread of life' (John 6:35). Ask: What if you found food from heaven? How does manna help us know Jesus?\"\n\n**Gospel Principle (2-3 minutes):** \"The Old Testament has symbols like manna, a lamb, or a brass serpent that point to Jesus Christ (Numbers 21:4–10; John 3:14; Exodus 12:3–5; John 1:29). Jesus is Jehovah, the Lord who spoke to prophets (Exodus 6:3). It also teaches covenants—promises like baptism (Mosiah 18:10).\"\n\n**Application (1-2 minutes):** \"At home, look for Jesus in Old Testament pictures. At school, keep promises with friends like covenants with God.\"\n\n## Opening Activity (5 minutes)\n**Flashlight Treasure Hunt (Object Lesson):** Dim the lights. Hide 3-4 small pictures or words (manna, lamb, light) around the room. Give kids flashlights to find them. \"Just like 'Thy word is a lamp unto my feet' (Psalm 119:105), scriptures light our way to Jesus!\" Discuss quickly: \"What 'treasures' did you find?\"\n\n*Materials:* 3-4 flashlights, printed pictures/words.\n\n## Scripture Focus\n**Psalm 119:105**: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it.”  \n*Child-friendly:* God's words in scriptures are like a flashlight showing us where to go, especially to Jesus—turn it on when you're lost!\n\n**Isaiah 9:6** (simplified from teaching children): \"For unto us a child is born... and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.\"  \n*Child-friendly:* Isaiah saw baby Jesus and called Him our Prince of Peace—Old Testament prophets knew Him!\n\n## Interactive Activities (15-20 minutes total)\n\n**Activity 1: Symbol Match-Up (Games – 5 minutes)**  \n*Step-by-step:* Prepare 8 cards: 4 OT symbols (manna pic, lamb pic, serpent pic, Jonah pic) and 4 matching Jesus verses (John 6:35, John 1:29, John 3:14, Matthew 12:38–41). Shuffle face down. Kids take turns flipping 2 cards to match. First match gets to read the simple verse aloud.  \n*Materials:* Cardstock/paper, markers (print or draw pics).  \n*Connection:* Shows how Old Testament symbols testify of Jesus Christ.  \n*Discussion:* \"What does manna teach about Jesus? How does this make Old Testament exciting?\"\n\n**Activity 2: Covenant Promise Hands (Hands-On Crafts – 7 minutes)**  \n*Step-by-step:* Trace each child's hand on paper. On fingers, write/draw promises like \"Pray daily,\" \"Be kind,\" \"Follow Jesus\" (like baptism covenant, Mosiah 18:10). Color and cut out. Make a chain by linking hands.  \n*Materials:* Paper, crayons/markers, tape.  \n*Connection:* Covenants are promises with God, like in Old Testament (Exodus 19:5).  \n*Discussion:* \"Why keep promises? How does this feel like Heavenly Father's love?\"\n\n**Activity 3: Jesus Seekers Dance (Music & Movement – 5-8 minutes)**  \n*Step-by-step:* Sing \"Seek the Lord Early\" (Children’s Songbook, 108) with actions: March for \"seek,\" point up for \"early,\" freeze and name an OT symbol (manna, lamb). Add claps for \"Jesus is Jehovah\" (Exodus 6:3).  \n*Materials:* Printed lyrics or song on phone.  \n*Connection:* Helps find Jesus in Old Testament through joyful movement.  \n*Discussion:* \"What symbol did you act out? How does singing help you love scriptures?\"\n\n## Testimony Time (3 minutes)\nPass a soft ball. Say, \"The Old Testament shows me Jesus Christ every day—I feel His love through these stories.\" Prompt: \"Share one feeling or thing you learned about Jesus today.\" Listen warmly, affirm each child.\n\n## Take-Home Challenge\nDraw or find one Old Testament symbol of Jesus (like manna) and tell your family how it points to Him.\n\n## Teacher Tips\nPrep cards and traces ahead for smooth flow. For wiggly kids, add more movement; for shy ones, pair for sharing. (712 words)",
  "generated_timestamp": "2026-01-11 18:31:34",
  "source_week_file": "cfm_2026_week_01.json"
}