{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "children",
  "word_count": 860,
  "character_count": 4765,
  "content": "# Come Follow Me Study Plan for Children: Week 1 (December 29–January 4)  \n## Introduction to the Old Testament\n\n**Fun Start**  \nHello, little friends! Imagine you’re on a treasure hunt to find stories about Jesus in a super old book called the Old Testament. What kind of clues do you think we’ll find about Him?\n\n**Key Gospel Ideas**  \nHere are some simple truths to learn this week. Let’s talk about them with pictures and scriptures!  \n1. **The Old Testament Tells Us About Jesus!** Jesus is in the Old Testament, even before He was born. Look at symbols like manna (bread from heaven) that remind us of Him (John 6:35: “And Jesus said unto them, I am the bread of life”). Draw a picture of bread to remember Jesus feeds our spirits!  \n2. **Jesus Is Jehovah!** In the Old Testament, Jesus is called Jehovah, one of His special names (Exodus 6:3: “And I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them”). Color a picture of Jesus with a crown to show He’s our King!  \n3. **God Makes Covenants With Us!** A covenant is a special promise with God. He loves us and wants to help us (Exodus 19:5: “Now therefore, if ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me”). Draw a heart to show God’s love in promises.  \n4. **We Can Find Jesus in Stories!** People like Isaiah told about Jesus long ago (Isaiah 9:6: “For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace”). Make a star to remember Jesus’s birth!  \n\n**Daily Adventures**  \nLet’s have fun every day learning about the Old Testament!  \n- **Day 1**: Sing “Seek the Lord Early” (Children’s Songbook, 108) and talk about looking for Jesus in stories.  \n- **Day 2**: Draw a picture of bread to remember Jesus is the Bread of Life (John 6:35).  \n- **Day 3**: Make a paper heart and write “I Promise to Obey” to think about covenants (Exodus 19:5).  \n- **Day 4**: Read Isaiah 9:6 and draw a star for Jesus, our Wonderful King!  \n- **Day 5**: Sing “When I Am Baptized” (Children’s Songbook, 103) and talk about promises with God.  \n- **Day 6**: Color a picture of Jesus as Jehovah with a crown (Exodus 6:3).  \n- **Day 7**: Share a family story about keeping a promise. How does it feel to keep promises?\n\n**Story Time: Isaiah Tells About Jesus**  \nA long, long time ago, a prophet named Isaiah lived. He loved God and told people about a wonderful day that was coming. Isaiah said, “For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace” (Isaiah 9:6). Isaiah was talking about Jesus! He told everyone that Jesus would be born as a baby, but He would be a King and save everyone. Isaiah also said, “Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel” (Isaiah 7:14). Immanuel means “God with us,” and that’s who Jesus is—God coming to be with us! Isaiah wanted everyone to be excited and ready for Jesus. Even though Isaiah lived hundreds of years before Jesus was born, he knew Jesus would come to love and help us all. Can you imagine how happy Isaiah felt to share this news? Let’s think about it!  \n- What did Isaiah say about Jesus?  \n- How does it make you feel to know Jesus was planned long ago?  \n- What name for Jesus do you like best from Isaiah’s words?\n\n**Play and Learn**  \nLet’s play and learn together! (Adapt for ages: Younger kids can do simpler actions; older kids can add details or read verses.)  \n1. **Treasure Hunt for Jesus Symbols**: Hide pictures of bread, a lamb, and a star around the room. Kids find them and shout, “I found Jesus!” Talk about how each symbol shows Jesus (John 6:35).  \n2. **Act Out Isaiah’s Prophecy**: Pretend to be Isaiah telling about Baby Jesus. Use a blanket as a cape and hold a toy baby. Say, “A child is born!” (Isaiah 9:6).  \n3. **Promise Heart Craft**: Cut out paper hearts and write or draw one way to obey God. Hang them up to remember covenants (Exodus 19:5).  \n4. **Sing and March**: Sing “Seek the Lord Early” (Children’s Songbook, 108) while marching like you’re searching for Jesus in the scriptures!\n\n**Jesus Connection**  \nThe Old Testament shows us Jesus’s love everywhere, even before He came to earth! He is Jehovah, our protector, and He planned to save us long ago. Let’s say a little prayer thanking Jesus for being in every story and loving us so much. I feel so happy knowing He’s always with us through His words! Can you tell Jesus one thing you love about Him today?",
  "generated_timestamp": "2025-12-31 23:57:41",
  "source_week_file": "cfm_2026_week_01.json"
}