{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "adult",
  "word_count": 987,
  "character_count": 6176,
  "content": "# Come, Follow Me Week 4: Genesis 3–4; Moses 4–5 (January 19–25)\n\n## Weekly Overview\nThe account of Adam and Eve's Fall in Genesis 3–4 and Moses 4–5 reveals it not as a tragedy but as an essential step in God's plan for growth, allowing opposition, choice, repentance, and redemption through Jesus Christ (Moses 5:11). In the restored truths of the book of Moses, we see Adam and Eve embracing their mortal probation with gladness after learning of the Savior's Atonement, transitioning from Eden's beauty to the opportunities of a fallen world. Today, these chapters illuminate agency, eternal marriage partnerships, and victory over Satan's deceptions, inviting us to trust Heavenly Father's plan amid life's challenges.\n\n## Doctrinal Key Points\n1. **The Fall was a necessary part of God’s plan** (Genesis 3:16–19; Moses 5:9–12): Adam and Eve were cast out into pain and death, yet \"Adam and Eve... were glad\" after angels taught them of joy in redemption, showing mortality enables progression toward God.\n2. **Jesus Christ offers hope and redemption** (Genesis 3:1–7; Moses 4:22–31; 5:4–15): The Fall brought separation and sorrow, but God's plan through the Savior overcomes these, as Adam and Eve learned, \"Satan... shall not have power... because of the righteousness of [God’s] people\" (Moses 5:11).\n3. **Husbands and wives are equal partners** (Genesis 3:16; Moses 4:22): \"Rule over\" does not justify unkindness; prophets teach husbands and wives as \"equal partners,\" with a righteous husband who \"will seek to minister... treat his wife with the utmost respect and deference... [and] bless his family\" (Elder Dale G. Renlund and Sister Ruth Lybbert Renlund, *The Melchizedek Priesthood*, 2018, 23; “The Family: A Proclamation to the World”).\n4. **Agency requires opposition to grow** (Moses 4:1–4; 2 Nephi 2:19–25): Heavenly Father and Jesus protected our right to choose, as \"it must needs be, that there was an opposition; even the forbidden fruit... that they might... know good from evil\" (2 Nephi 2:19); Elder Dale G. Renlund taught, “Our Heavenly Father’s goal in parenting is not to have His children *do* what is right; it is to have His children *choose* to do what is right and ultimately become like Him” (“Choose You This Day,” *Liahona*, Nov. 2018, 104).\n5. **Satan seeks to deceive and blind** (Moses 4:4–12; 5:13–33): He tempted Adam, Eve, and Cain through lies and secret combinations, mirroring modern tactics we resist through God's help.\n6. **God provides sacred clothing** (Moses 4:13–16, 27): After their own coverings failed, \"I, the Lord God... made coats of skins, and clothed them,\" symbolizing protection and covenants (see Revelation 7:9, 13–15).\n7. **Sacrifices must be offered willingly** (Moses 5:4–9, 16–26): God accepted Abel's but not Cain's due to heart attitudes, teaching us to offer obedience with real intent.\n\n## Personal Study Guide\n**Day 1 (Jan 19): Genesis 3:1–7; Moses 4:22–31** – Read about the Fall's results. Reflect: How do these affect you? Cross-reference “Because of Him” video. Quote: \"Adam fell that men might be; and men are, that they might have joy\" (2 Nephi 2:25).\n\n**Day 2 (Jan 20): Moses 5:4–15** – Study Adam and Eve's gladness post-angel visit. Ask: Why were they glad? Ponder Elder Ulisses Soares on equal partnership (video). See Mosiah 3:19.\n\n**Day 3 (Jan 21): Moses 4:1–4; 2 Nephi 2:11–20, 25–30** – Focus on agency. Question: How does opposition enable choice? Read Dallin H. Oaks, “Opposition in All Things” (*Liahona*, May 2016).\n\n**Day 4 (Jan 22): Moses 4:4–12; 5:13–33; Genesis 4** – List Satan's tactics. Reflect: How does he tempt today? Cross-reference “Agency” Gospel Topics.\n\n**Day 5 (Jan 23): Moses 4:13–16, 27** – Ponder nakedness and divine clothing. If endowed, reflect privately on temple garment significance (see “Sacred Temple Clothing” video). See D&C 109:22–26.\n\n**Day 6 (Jan 24): Moses 5:4–9, 16–26; Alma 12:21–37** – Compare sacrifices of Abel and Cain. Ask: What shapes your sacrifices? Read D&C 29:39–43.\n\n**Day 7 (Jan 25): Review Genesis 3–4; Moses 4–5** – Journal applications. Study For the Strength of Youth, “Make inspired choices” (4–5). Sing “Choose the Right” (*Hymns*, no. 239).\n\n## Group Discussion Ideas\n1. According to Moses 5:9–12, how did Adam and Eve feel about the Fall? Share how this applies to your life (see 2 Nephi 2:19–25).\n2. What results of the Fall in Genesis 3:1–7 do you see redeemed in Moses 5:4–15? How has the Savior helped you?\n3. Elder Renlund describes a righteous husband (2018, 23)—how can couples be equal partners today (“The Family: A Proclamation”)?\n4. Why did Heavenly Father protect agency in Moses 4:1–4? Share a time opposition helped you choose right (2 Nephi 2:27).\n5. List Satan's deceptions in Moses 4:4–12; 5:13–33—what modern parallels? How does God help resist?\n6. What do Moses 4:13–16, 27 teach about divine clothing? Discuss symbolic meanings.\n7. Why was Abel's sacrifice accepted but not Cain's (Moses 5:16–26)? What sacrifices does God ask of us?\n8. As families or classes, complete: \"Because of the Fall, I… Because of Jesus Christ, I…\" (Moses 5:8–11; Alma 11:42).\n\n## Application Challenges\n1. **Choose daily with agency**: Use For the Strength of Youth to make one inspired choice opposing a temptation, thanking Jesus for freedom (2 Nephi 2:27).\n2. **Strengthen partnership**: Husbands, minister to your wife with praise and deference (Elder Renlund, 2018); wives and families, discuss “The Family: A Proclamation” and commit to equality.\n3. **Offer willing sacrifice**: Identify a personal sacrifice (time, pride) and offer it with Abel-like intent, praying as Adam did (Moses 5:4, 8).\n4. **Resist deception**: List a modern satanic tactic from Moses 5:13–33; counter it through scripture study and prayer this week.\n\n## Testimony Builder\nThrough Joseph Smith's restoration of Moses 4–5, we glimpse Heavenly Father's plan where the Fall opens doors to joy via opposition and Christ's Atonement (Moses 5:10–11). Jesus, who cast down Satan to preserve our agency (Moses 4:3), redeems every Fall effect, inviting us to choose Him amid deception and sacrifice. Ponder how these truths draw you nearer the Savior this week.",
  "generated_timestamp": "2026-01-11 18:08:09",
  "source_week_file": "cfm_2026_week_04.json"
}