{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "audience": "children",
  "word_count": 651,
  "character_count": 3833,
  "content": "# Come, Follow Me for Kids: Week 3 – God Created the Beautiful World!\n\n## Fun Start\nImagine a dark, empty world turning bright and full of animals, flowers, and you! God and Jesus made everything good and beautiful, just like in Genesis 1:1—“In the beginning God created the heaven and the earth.” What do you love most that Jesus created?\n\n## Key Gospel Ideas\n1. **Jesus created the earth** with Heavenly Father! “By mine Only Begotten I created these things” (Moses 2:1). *Color pictures of stars, fish, and birds from “The Creation of the Earth” in Old Testament Stories (pages 8-12).*\n   \n2. **We are created in God's image!** “God said, Let us make man in our image, after our likeness” (Genesis 1:26; Moses 2:26-27). *Look in a mirror and smile—God made you special!*\n\n3. **Care for God's creations.** “Be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over ... every living thing” (Genesis 1:28). *Pick up litter to show love for God's world.*\n\n4. **The Sabbath day is holy.** “God blessed the seventh day, and sanctified it” (Genesis 2:2-3). *Make Sunday special with family time and Jesus.*\n\n*(Younger kids: Simple coloring. Older kids: Add why it matters.)*\n\n## Daily Adventures\n- **Day 1:** Sing “My Heavenly Father Loves Me” (Children’s Songbook, 228-29). Point to eyes, ears—thank Jesus!\n- **Day 2:** Go outside! Find grass, sky, bugs from Creation days (Genesis 1). Younger: Point and say “Jesus made!” Older: Count 7 days.\n- **Day 3:** Draw your body like God's image (Moses 2:26-27). Cut into puzzle—put together while saying “I am special!”\n- **Day 4:** Role-play Adam and Eve in the garden (Genesis 2:18-25). Act caring for animals.\n- **Day 5:** Make Sunday pictures: church, family, no playtime toys (Genesis 2:3). Share why Sabbath is happy.\n- **Day 6:** Sing “All Creatures of Our God and King” (Hymns, no. 62). Draw favorite creation.\n- **Day 7:** Family prayer thanking Jesus for Creation. Read Moses 2:1 together.\n\n## Story Time (245 words)\nLong ago, the earth was empty and dark, like a big messy room (Genesis 1:2). Heavenly Father said, “Let’s make a beautiful world!” Jesus helped! Day 1: Light! “God said, Let there be light: and there was light” (Genesis 1:3). Day 2: Sky and water. Day 3: Land, plants, yummy fruits. Day 4: Sun, moon, twinkly stars. Day 5: Birds flying, fish swimming. Day 6: Animals big and small, then people! “Let us make man in our image” (Genesis 1:26; Moses 2:26). God made Adam and Eve, boy and girl, to care for everything (Genesis 1:28). Day 7: God rested and made it holy (Genesis 2:2-3).\n\nJesus created a perfect world for us! He put us in a lovely garden with trees and rivers (Genesis 2:10). Adam and Eve were happy, walking with God.\n\n*Questions:* What did Jesus make on Day 4? (Sun and stars!) Why are we special? (God's image!) How can we care for creations? (Be kind to animals, earth!) What makes Sunday holy? (Rest, worship!) *(Younger: Act it out. Older: Draw the days.)*\n\n## Play and Learn\n1. **Creation Hunt:** Hide toy animals/plants. Find one per day (Genesis 1). Cheer “Jesus made you!”\n2. **Mirror Me:** Look in mirror, say “I’m in God’s image!” (Moses 2:27). Make funny faces God loves. *(Younger: Giggle time. Older: Draw self-portraits.)*\n3. **Sabbath Blocks:** Build “holy day” tower with family blocks, no “work” toys (Genesis 2:3). Top with Jesus picture.\n4. **Animal Care Relay:** Pass stuffed animals, pretend feeding (Genesis 1:28). Race to show love!\n\n## Jesus Connection\nJesus created this beautiful world because He loves you so much! “By mine Only Begotten I created these things” (Moses 2:1). Feel His love in every flower and star. Pray: “Thank You, Jesus, for making me in Your image.” I know Jesus lives and made you special—He does! *(Younger: Hug prompt. Older: Share one feeling.)* \n\n*(Total: 612 words)*",
  "generated_timestamp": "2026-01-10 22:24:03",
  "source_week_file": "cfm_2026_week_03.json"
}