{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "adult",
  "word_count": 1191,
  "character_count": 7242,
  "content": "# Come, Follow Me Study Plan for Adults: December 29–January 4  \n**Introduction to the Old Testament**\n\nAs we embark on this year’s study of the Old Testament, I’m thrilled to guide you through these sacred writings that testify of Jesus Christ and reveal God’s covenant relationship with His children. With decades of study and a heart full of gratitude for these scriptures, I’ve crafted this plan to help deepen your doctrinal understanding, inspire practical application, and strengthen your personal testimony. Let’s dive into this ancient record with faith, seeking the Savior on every page.\n\n---\n\n## Weekly Overview\nThis first week introduces the Old Testament, a collection of ancient writings that can feel both foreign and familiar. These scriptures, spanning thousands of years, recount the lives of prophets and people who faced trials, joys, and spiritual experiences much like ours, while pointing us to Jesus Christ as the central figure of God’s plan. The themes of covenant, restoration, and Christ’s divine identity as Jehovah resonate deeply with our modern journey of faith. As we begin, we’re invited to see how these stories illuminate our path and draw us closer to the Savior.\n\n---\n\n## Doctrinal Key Points\n1. **The Old Testament Testifies of Jesus Christ**: The scriptures are filled with symbols and prophecies of the Savior, such as manna (Exodus 16:4, 11–15; John 6:35), the sacrificial lamb (Exodus 12:3–5; John 1:29), and the brass serpent (Numbers 21:4–10; John 3:14). These teach us of His role as our sustenance, sacrifice, and healer.\n2. **Jesus Christ is Jehovah**: President Dallin H. Oaks taught, “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). This truth connects the God of the Old Testament to the Savior we know (see Exodus 3:13–15; John 8:58–59).\n3. **Symbols Bear Record of Christ**: As the Lord told Adam, “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). Looking for these symbols deepens our faith in Him.\n4. **Restoration of Plain and Precious Truths**: Through Joseph Smith, the Lord restored vital teachings, such as Enoch’s city of Zion (Moses 7:18–19) and Abraham’s vision of the premortal council (Abraham 3:22–28), fulfilling Nephi’s prophecy (1 Nephi 13:21–29).\n5. **Covenants Define Our Relationship with God**: The Old Testament is a story of God making covenants with His people, calling them His “peculiar treasure” (Exodus 19:5). These covenants reveal His love and mercy.\n6. **The Bible and Book of Mormon Work Together**: As Nephi taught, these records “shall grow together, unto the confounding of false doctrines” (2 Nephi 3:12), providing clarity and unity in truth.\n\n---\n\n## Personal Study Guide\n**Day 1: Introduction and Overview**  \n- Reading: “Introduction to the Old Testament” in Come, Follow Me: 2026  \n- Reflection: How do I feel about studying the Old Testament this year? What do I hope to learn about Jesus Christ?  \n- Cross-Reference: Read Elder Dale G. Renlund, “Jesus Christ Is the Treasure” (Liahona, Nov. 2023, 98).\n\n**Day 2: Jesus Christ in the Old Testament**  \n- Reading: Exodus 16:4, 11–15; John 6:35; Exodus 12:3–5; John 1:29  \n- Reflection: How do symbols like manna and the sacrificial lamb point me to the Savior’s role in my life?  \n- Cross-Reference: “Types or Symbols of Christ,” Guide to the Scriptures.\n\n**Day 3: Jesus Christ as Jehovah**  \n- Reading: Exodus 3:13–15; John 8:58–59  \n- Reflection: Why is it meaningful to know that Jesus Christ is the Jehovah of the Old Testament?  \n- Cross-Reference: President Dallin H. Oaks, “The Teachings of Jesus Christ” (Liahona, May 2023, 102).\n\n**Day 4: Restoration of Truth**  \n- Reading: 1 Nephi 13:21–29; Moses 7:18–19  \n- Reflection: How do restored truths, like the account of Enoch, strengthen my testimony of the Prophet Joseph Smith?  \n- Cross-Reference: “Book of Abraham,” Gospel Topics, Gospel Library.\n\n**Day 5: Covenants with God**  \n- Reading: Exodus 19:5; Jeremiah 31:31–34  \n- Reflection: What does it mean to be God’s “peculiar treasure” through covenants?  \n- Cross-Reference: President Russell M. Nelson, “The Everlasting Covenant” (Liahona, Oct. 2022, 4–11).\n\n**Day 6: Unity of Scriptures**  \n- Reading: 2 Nephi 3:12  \n- Reflection: How can studying the Old Testament alongside the Book of Mormon clarify gospel truths for me?  \n- Cross-Reference: Review “Introduction,” Come, Follow Me: 2026.\n\n**Day 7: Personal Reflection and Testimony**  \n- Reading: Psalm 119:105, 140  \n- Reflection: How has this week’s study helped me see God’s hand in my life, as a “lamp unto my feet”? Write your thoughts and feelings about starting this journey.\n\n---\n\n## Group Discussion Ideas\n1. What feelings or expectations do you have as we begin studying the Old Testament this year?  \n2. How have you seen Jesus Christ in Old Testament symbols or stories in the past, and what did those teach you about Him?  \n3. Why is it significant to know that Jesus Christ is Jehovah, the God of the Old Testament?  \n4. How do the restored truths through Joseph Smith, like the Book of Moses, enhance your understanding of the Old Testament?  \n5. What does the concept of being God’s “peculiar treasure” through covenants mean to you personally?  \n6. How can focusing on Christ while studying the Old Testament strengthen our faith in His gospel?  \n7. What insights have you gained this week about God’s love and mercy through His covenants?  \n8. How can we support each other in finding personal meaning in these ancient scriptures throughout the year?\n\n---\n\n## Application Challenges\n1. **Seek Christ Daily**: Each day this week, look for a symbol or reference to Jesus Christ in your personal study or daily experiences, and record how it deepens your connection to Him.  \n2. **Reflect on Covenants**: Take time to ponder a covenant you’ve made with God (such as baptism or temple covenants) and write down one way you can honor it more fully in your family or church service.  \n3. **Share a Symbol**: Discuss with a family member or friend a symbol of Christ from the Old Testament (like manna or the brass serpent) and how it applies to your life today.  \n4. **Study with Purpose**: As President Russell M. Nelson taught, “The covenant path is all about our relationship with God” (Liahona, Oct. 2022, 5). Set a goal to study the Old Testament with an eye toward understanding your covenant relationship with Him.\n\n---\n\n## Testimony Builder\nAs we begin this sacred study of the Old Testament, I feel a profound gratitude for the way these ancient writings point us to Jesus Christ, the center of God’s plan. From the symbols of manna to the prophecies of Isaiah, every page whispers of His love and Atonement. I know that through the Restoration, led by the Prophet Joseph Smith, we have received “plain and precious things” that illuminate these scriptures and bind us to the Savior through covenants. I invite you to reflect on how this week’s study has drawn you closer to Christ and to write down a personal commitment to seek Him throughout this year. His light truly is our path, as the psalmist declared, and I’m eager to walk it with you.",
  "generated_timestamp": "2025-12-31 23:56:48",
  "source_week_file": "cfm_2026_week_01.json"
}