{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "youth",
  "word_count": 721,
  "character_count": 4459,
  "content": "# Come, Follow Me Youth Lesson: Week 4 (January 19–25)  \n**Genesis 3–4; Moses 4–5**  \n**“Why the Fall? It Opened the Door to Growth, Choices, and Christ”**\n\n## Attention Grabber  \nPicture this: You're scrolling social media, and a friend posts about skipping class for a \"harmless\" party. Everyone's going—feels fun, but you know it's not right. Do you go with the flow or stand out? That's opposition in action, just like Adam and Eve faced in the Garden. Today, we'll see how their choice wasn't a dead end—it launched God's plan for us to grow, choose, and return to Him (Moses 5:9–12).\n\n## Core Doctrines  \n1. **The Fall was necessary for God's plan**: Adam and Eve left paradise, facing pain and separation, but it gave us opposition to grow. \"Adam and Eve... needed... an opportunity to grow. Leaving the Garden of Eden was the necessary first step toward returning to God\" (CFM Introduction). They said, \"Adam fell that men might be; and men are, that they might have joy\" (2 Nephi 2:25).  \n\n2. **Jesus Christ offers hope and redemption**: The Fall brought sorrow and death (Genesis 3:16–19; Moses 4:22–31), but an angel taught Adam and Eve of sacrifice and the Savior. They were \"glad\" because of \"the joy of our redemption\" (Moses 5:11). Watch for this in Moses 5:4–15.  \n\n3. **Agency and opposition let us choose to become like God**: Satan wanted to destroy agency (Moses 4:1–4), but Heavenly Father and Jesus protected it. \"Our Heavenly Father’s goal... is to have His children choose to do what is right\" (Elder Dale G. Renlund, “Choose You This Day,” Ensign or Liahona, Nov. 2018, 104). Opposition is essential: \"There must needs be an opposition\" (2 Nephi 2:11). See For the Strength of Youth: \"Make inspired choices\" (4–5).  \n\n4. **Satan deceives, but God helps us resist**: He tempted with lies (Moses 4:4–12; 5:13–33). Today, he blinds us the same way—list his tricks in these verses.  \n\n5. **God clothes and accepts willing sacrifices**: After the Fall, \"I, the Lord God... made coats of skins, and clothed them\" (Moses 4:27). Abel's sacrifice was accepted because of his heart (Moses 5:16–26).  \n\n## Interactive Activities (Choose 2-3)  \n**1. Video and \"Because of Him\" Chart (15 min)**: Show the Church video “Because of Him” (Gospel Library, 3 min). In pairs, complete two columns on paper: \"Because of the Fall, I...\" (e.g., feel pain, make mistakes—from Genesis 3:16; Moses 4:22) and \"Because of Jesus Christ, I...\" (e.g., can repent, have joy—from Moses 5:8–11, 14–15). Share one from each. Ties to Moses 5:4–15.  \n\n**2. Role-Play Agency Dilemmas (15 min)**: Small groups draw scenarios like: Peer dares you to cheat on a test (opposition, Moses 4:1–4); Fake account spreads lies online (Satan deceives, Moses 4:4–12). Role-play using agency to choose right, then report: \"How did Heavenly Father/Jesus protect your choice?\" (2 Nephi 2:27). Play “Choose the Right” (Hymns, no. 239) to debrief.  \n\n**3. Small Group Opposition Teach-Back (10 min)**: Split into groups—one studies Moses 4:1–4 and For the Strength of Youth \"Make inspired choices\"; another does 2 Nephi 2:11–20, 25–30. Teach each other: \"Why opposition for agency?\" Report key idea.  \n\n## Real-Life Application  \nTeens, the Fall means life's messy—peer pressure at school, FOMO on TikTok trends tempting you to lie or skip standards, dating choices testing agency. Use opposition to grow: When friends push boundaries, remember Satan \"seeks to deceive and to blind\" (Moses 4:4–12; 5:13–33)—pause, pray like Adam (Moses 5:4,8), choose Christ's way for joy (Moses 5:11). Prep for missions by practicing \"inspired choices\" now (For the Strength of Youth, 4–5). In relationships, see equality like “The Family: A Proclamation to the World”—minister, respect, no unkind rule (Genesis 3:16; Elder Ulisses Soares video). Sacrifice willingly, like Abel, by ditching screen time for scripture (Moses 5:16–26). These build testimonies amid real stakes.  \n\n## Testimony Moment  \nAs we dive into Adam and Eve's story, I feel the Savior's hand guiding us through opposition—He protected agency so we could choose Him (Moses 4:1–4). Share one thing that hit you today, maybe how the Fall leads to joy (2 Nephi 2:25). This week, pick one: Chart your \"Because of Him\" list daily, or role-play a real dilemma with a friend. Act, then next week, tell us how it strengthened your trust in Christ's redemption (Moses 5:9–12). He’s real, and He’s cheering your choices.  \n\n*(Word count: 748)*",
  "generated_timestamp": "2026-01-11 18:35:15",
  "source_week_file": "cfm_2026_week_04.json"
}