{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "youth",
  "word_count": 849,
  "character_count": 5260,
  "content": "# Come, Follow Me Youth Lesson: Moses 1; Abraham 3 (January 5–11)\n\n**Preparation for Teachers**: Gather devices for Church videos (“Our True Identity” and “I Am a Son of God” from Gospel Library), printed scriptures or Pearl of Great Price, paper for journaling, and hymnals or access to “I Am a Child of God” (Hymns, no. 301). Time: 40-50 minutes. Adapt for class size.\n\n## Attention Grabber (5 minutes)\nPicture this: You're scrolling Instagram, and the algorithm hits you with \"influencer,\" \"gamer,\" \"average student,\" or worse—those comments that make you question if you're good enough. Sound familiar? Now imagine if Heavenly Father DM'd you right then: \"Thou art my son/daughter; wherefore … look!\" (Moses 1:4, 6). What if the labels that stick don't come from likes or followers, but from premortal councils where you were chosen for something huge? Let's dive into Moses 1 and Abraham 3 to see your real profile—divine edition.\n\n## Core Doctrines (5 minutes)\nShare these on the board or slides with key quotes. Keep it punchy—teens, these aren't just facts; they're your power-up for life.\n\n1. **I am a child of God with divine worth and destiny.** God tells Moses, “thou art my son” and shows him the world “because of thy faith” (Moses 1:4, 6). President Russell M. Nelson taught, “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity,” worldwide devotional for young adults, May 2022, Gospel Library). This tops every other label.\n\n2. **Satan confuses our identity with counterfeits.** God affirms worth; Satan says, “Moses, son of man” (Moses 1:12). Spot the fake—like an artificial plant vs. real growth (Moses 1:13–18).\n\n3. **With the Lord’s help, I can resist Satan.** After his vision, Moses faces temptation but commands, “Depart hence, Satan” after glory fills him (Moses 1:20–22, 24–26). Prayer, truth, and power from God win.\n\n4. **God’s work is my immortality and eternal life.** “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39). Jesus Christ makes it happen.\n\n5. **I lived as a spirit before birth to prove myself.** “Ye were … in the beginning with the heavens and the earth … organized before the world was; … to see if they will do all things whatsoever the Lord their God shall command them” (Abraham 3:22, 25). Jesus was your leader there.\n\nTie to *For the Strength of Youth*: Knowing this helps choices like honest social media use or standing firm with friends.\n\n## Interactive Activities (20 minutes)\nPick 2-3 based on time/group. Rotate to keep energy high.\n\n1. **Media + Discussion: \"Our True Identity\" Video (10 minutes)**  \n   Play “Our True Identity” (Gospel Library, ~3 minutes). Pause at key moments. Ask:  \n   - How does Satan counterfeit God's message today (e.g., TikTok trends saying you're \"not enough\")? Compare Moses 1:4, 6 vs. 1:12.  \n   - President Nelson said, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”). What decision changes for you?  \n   Deeper than Primary: Share a time doubt hit after a spiritual high—what pulled you back like Moses?\n\n2. **Small Group Challenge: Premortal Truth Hunt (7 minutes)**  \n   Groups of 3-4 read Abraham 3:22–28. List 5 truths about yourself/Jesus (e.g., \"spirits … before the world was,\" \"prove\" ourselves). Report one back. Why valuable now? (See Topics and Questions, “Premortal Life,” Gospel Library.) Play “I Am a Child of God” (Hymns, no. 301) softly.\n\n3. **Role-Play Scenarios: Resist Like Moses (8 minutes)**  \n   Pairs act out:  \n   - Friend pressures vaping at a party—respond with Moses 1:13, 15 (\"Get thee behind me!\").  \n   - Social media FOMO whispers \"You're worthless without 1K followers\"—counter with Moses 1:24–26 (call on God).  \n   Debrief: What gave Moses power? How can we get it (see Matthew 4:1–11 for Jesus' example)?\n\n## Real-Life Application (5 minutes)\nThese truths aren't ancient history—they're your toolkit for 2026 chaos.  \n- **Peer Pressure/School**: When bullies label you, remember Moses 1:4—\"Thou art my son/daughter.\" List 3 choices (dating, friends, grades) that shift knowing you're premortal nobility (Abraham 3:22–28).  \n- **Social Media**: Spot Satan's fakes (Moses 1:12–18)—delete doubt, post truth. *For the Strength of Youth* says base choices on eternal truths.  \n- **Missionary Prep**: You're here to \"prove\" faithful (Abraham 3:25). Practice resisting now for that call.  \nChallenge whisper: Tonight, journal one choice you'll make differently as God's child.\n\n## Testimony Moment (5 minutes)\nAs we wrap, feel that quiet burn inside? That's the Spirit echoing God's words to Moses—and you. I've seen lives light up knowing this: a youth standing alone against the crowd because \"I am a child of God\" became louder than the noise. Share one truth from today that hits home, if you feel it.  \n\nYour challenge: This week, make a list of choices flowing from your divine identity (“Choices for Eternity”). Act on one—like affirming it in the mirror or to a friend. Report back next week—what shifted? Heavenly Father sees you as He saw Moses and Abraham. Let's live worthy of that vision.\n\n*(Word count: 812)*",
  "generated_timestamp": "2026-01-11 18:32:26",
  "source_week_file": "cfm_2026_week_02.json"
}