{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "audience": "adult",
  "word_count": 965,
  "character_count": 6293,
  "content": "**Weekly Overview**  \nThe accounts of Creation in Genesis 1–2, Moses 2–3, and Abraham 4–5 reveal Heavenly Father and Jesus Christ as masterful Creators who brought order from chaos, forming a beautiful world from what was “without form, and void” (Genesis 1:2; Abraham 4:2). These scriptures emphasize Jesus Christ's role as the Creator under the Father's direction (“By mine Only Begotten I created these things,” Moses 2:1), our divine identity as beings made in God's image (Genesis 1:26–27), the sacredness of marriage, stewardship over the earth, and the sanctified Sabbath. In our chaotic world, these truths remind us that God continues His creative work in our lives, transforming emptiness into exaltation as we become like Him.\n\n**Doctrinal Key Points**  \n1. **Jesus Christ Created the Heavens and Earth Under the Father's Direction** (Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25): These parallel accounts teach that God organized the earth through His Only Begotten, bringing light and life from desolation, as affirmed in Doctrine and Covenants 101:32–34.  \n2. **We Are Created in God's Image, Male and Female** (Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27): This divine likeness affirms our sacred potential and bodies, countering worldly messages; President Russell M. Nelson testified in “God’s Greatest Creation” (Gospel Library) of the miraculous human body as a gift from Heavenly Father.  \n3. **Marriage Between Man and Woman Is Ordained of God** (Genesis 1:27–28; 2:18–25; Moses 3:18, 21–25; Abraham 5:14–19): Adam and Eve were sealed eternally by priesthood power (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87), emphasizing sacred unity as in “The Family: A Proclamation to the World.”  \n4. **We Are Responsible Stewards Over God's Creations** (Genesis 1:28; Moses 2:28; Abraham 4:28): We must care for the earth, as expanded in Doctrine and Covenants 59:16–21 and 104:13–18; President Gérald Caussé taught, “Our Earthly Stewardship,” Liahona, Nov. 2022, 57–59.  \n5. **God Sanctified the Sabbath Day** (Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3): After creation, He blessed the seventh day as holy, inviting us to keep it as a delight (Doctrine and Covenants 59:9–13).  \n6. **Natural Tendencies Require Overcoming Through Christ** (Mosiah 3:19; Ether 12:27): Being in God's image does not mean all desires are approved; we must yield to the Spirit for divine potential.  \n\n**Personal Study Guide**  \n**Day 1: Creation's Majesty** – Read Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25. What does this reveal about Heavenly Father and Jesus Christ? Cross-reference Doctrine and Covenants 101:32–34. Reflect: How has God brought order to chaos in your life?  \n**Day 2: In God's Image** – Read Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27. Watch “God’s Greatest Creation” (Gospel Library). Ponder: “Because I know I am created in God’s image, I choose to…” Cross-reference “Your body is sacred” in For the Strength of Youth, 22–29.  \n**Day 3: Sacred Marriage** – Read Genesis 1:27–28; 2:18–25; Moses 3:18, 21–25; Abraham 5:14–19. Study “The Family: A Proclamation to the World.” Reflect: How does priesthood eternal marriage elevate family life?  \n**Day 4: Stewardship Responsibilities** – Read Genesis 1:28; Moses 2:28; Abraham 4:28; Doctrine and Covenants 59:16–21; 104:13–18. Read Caussé, “Our Earthly Stewardship.” Journal: What one creation will you better care for this week?  \n**Day 5: The Holy Sabbath** – Read Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3; Doctrine and Covenants 59:9–13. Watch “The Sabbath Is a Delight” (Gospel Library). Ask: What makes the Sabbath blessed for me?  \n**Day 6: Overcoming Natural Man** – Read Mosiah 3:19; Ether 12:27 alongside Genesis 1:26–27. Reflect: How do these clarify our divine image and need for Christ? Review Nelson, “Your Body: A Magnificent Gift to Cherish,” Liahona, Aug. 2019.  \n**Day 7: Synthesis and Testimony** – Review all readings. Among God's creations, note pictures or a walk outdoors. Write: How does Creation testify of Jesus Christ as my ongoing Creator?  \n\n**Group Discussion Ideas**  \n1. What stands out about Jesus Christ's role in Creation from Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25? How does this deepen your worship?  \n2. How does knowing we are created in God's image (Genesis 1:26–27) change self-perception or treatment of others? Share an experience.  \n3. President Nelson said Adam and Eve were married eternally by priesthood power (“Lessons from Eve”). How can we honor marriage's sacredness today?  \n4. What do Genesis 1:28 and Doctrine and Covenants 59:16–21 teach about environmental stewardship? How are you applying this?  \n5. Why did God sanctify the Sabbath (Genesis 2:2–3)? What makes it a delight in your life (see “The Sabbath Is a Delight” video)?  \n6. How do Mosiah 3:19 and Ether 12:27 balance the truth of our divine image? Share a time Christ helped you overcome natural tendencies.  \n7. Ponder Nelson's words on the body in “God’s Greatest Creation”—how does this contrast worldly views?  \n8. How has studying Creation brought light to a “dark moment” in your life, as in the manual's introduction?  \n\n**Application Challenges**  \n1. Complete: “Because I am created in God’s image, I choose to…” (e.g., treat my body sacredly, per For the Strength of Youth) and act on it daily.  \n2. This week, perform one act of stewardship: care for a garden, reduce waste, or thank God for a creation, inspired by Caussé's “Our Earthly Stewardship.”  \n3. Make the Sabbath distinct: plan family activities from Genesis 2:2–3, like worship or service, avoiding worldly distractions (Doctrine and Covenants 59:9–13).  \n4. Share a Creation testimony or photo with a friend or social media, including Moses 2:1, to invite others to ponder the Creator.  \n\n**Testimony Builder**  \nThese Creation accounts center on Jesus Christ, the Only Begotten who organized the universe under the Father and continues crafting us into His likeness (Moses 2:26–27). Through the Restoration, we gain fuller light on our divine potential, eternal marriage, and stewardship, as prophets like President Nelson affirm. As you study, let these truths invite the Savior to transform your chaos into celestial glory—reflect prayerfully on how He is creating you anew today.  \n\n(Word count: 1028)",
  "generated_timestamp": "2026-01-18 21:19:14",
  "source_week_file": "cfm_2026_week_03.json"
}