{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "older-primary",
  "word_count": 832,
  "character_count": 5081,
  "content": "# Week 4: The Fall—Part of God's Plan (Genesis 3–4; Moses 4–5)\n\n## Lesson Overview (for the teacher)\nThe Fall of Adam and Eve left the beautiful Garden of Eden but was a necessary step in God's plan for us to grow, face opposition, make choices, learn to repent, and find joy through Jesus Christ's Atonement (Moses 5:11). For 8-10 year olds, this teaches that challenges aren't tragedies but opportunities to choose right and become like Heavenly Father. It builds gratitude for agency and the Savior's redemption.\n\n## TEACHER LESSON (8-10 minutes)\n- **Hook (1-2 minutes)**: Hold up a seed and a fully grown plant. Ask, \"What does a seed need to become a beautiful plant? Sun? Water? Sometimes hard things like wind?\" Explain that Adam and Eve needed to leave Eden to grow, just like us (Moses 5:9–12).\n- **Scripture Story (3-4 minutes)**: Tell simply: In the Garden, Adam and Eve could eat any fruit except one. A snake (Satan) tricked them to eat it (Genesis 3:1–7; Moses 4:22–31). They felt shame, hid, and were sent out to a world with work, pain, and choices. But an angel taught them about Jesus' sacrifice, and they were glad (Moses 5:4–15). Ask: \"How do you think Adam and Eve felt at first? What made them glad?\"\n- **Gospel Principle (2-3 minutes)**: The Fall let us have agency to choose right or wrong, face opposition to grow, and be saved by Jesus (Moses 4:1–4; 2 Nephi 2:19–25). Without it, \"we never should have known good and evil, and the joy of our redemption\" (Moses 5:11).\n- **Application (1-2 minutes)**: At home or school, choose to pray like Adam and Eve (Moses 5:4, 8), obey, and thank Jesus for helping with hard choices.\n\n## Opening Activity (5 minutes)\n**One-Color Coloring (Object Lesson)**  \nMaterials: Activity page printouts (simple Eden picture), crayons (give only one color per child).  \nHave kids color the picture with one color. Ask: \"Why is it better to have choices of colors?\" (From CFM teaching children: Moses 4:1–4). Transition: Heavenly Father and Jesus protect our choices to pick good, like many colors.\n\n## Scripture Focus\n**Moses 5:10–11** (full verse): \"And Eve, his wife, heard all these things and was glad, saying: Were it not for our transgression we never should have had seed, and never should have known good and evil, and the joy of our redemption, and the eternal life which God giveth unto all the obedient.\"  \n*Child-friendly*: Adam and Eve were happy about leaving Eden because it let them have families, learn right from wrong, and be saved by Jesus to live with God forever.\n\n**Moses 5:4**: \"And Adam and Eve, his wife, called upon the name of the Lord, and they heard the voice of the Lord from the way toward the Garden of Eden, speaking unto them...\"  \n*Child-friendly*: After leaving Eden, they prayed and heard Heavenly Father, so we can pray anytime.\n\n## Interactive Activities (15-20 minutes total)\n### 1. Choice Path Relay (Game, 5 minutes)\n**Materials**: Masking tape for two floor paths (one labeled \"Right Choice,\" one \"Tricky Path\"), 6-8 picture cards (draw/print: snake/apple, praying, sharing toy, lying).  \nSteps: Divide class in half. Kids run relay-style: Pick a card at start, run to path, place on \"Right Choice\" or \"Tricky Path,\" run back. Switch teams.  \nConnection: Shows agency and Satan's tricks (Moses 4:4–12; 5:13–33).  \nQuestions: \"What trick did Satan use on Eve? How can Jesus help you choose right?\"\n\n### 2. Adam and Eve Role-Play (Role-Play & Acting, 5-7 minutes)\n**Materials**: Simple props (green paper leaves for Eden clothes, red paper fruit, angel headband from paper).  \nSteps: Assign roles (2-3 Adams/Eves, snake, angel). Act scenes: Eat fruit (Genesis 3:6), hide/shame (Moses 4:13–16), angel teaches sacrifice/Jesus (Moses 5:5–9). Switch roles 2x. Freeze for discussion.  \nConnection: Fall brings opposition but Jesus redeems (Moses 5:4–15).  \nQuestions: \"How did Adam and Eve feel glad? What would you say to the angel?\"\n\n### 3. \"Because of Jesus\" Cards (Hands-On Crafts & Creative Expression, 5-7 minutes)\n**Materials**: Cardstock hearts (pre-cut 1/child), markers/crayons, stickers.  \nSteps: Kids draw/write on one side: \"Because of the Fall, I...\" (e.g., \"make mistakes\"). Other side: \"Because of Jesus, I...\" (e.g., \"can repent and be happy,\" from Moses 5:8–11; CFM children section). Decorate.  \nConnection: Jesus overcomes Fall effects (Romans 5:12; 2 Nephi 2:22–23).  \nQuestions: \"Share your card—what makes you grateful for Jesus?\"\n\n## Testimony Time (3 minutes)\nPlay soft music. Prompt: \"What do you feel when you think of Jesus helping you choose right after the Fall, like Adam and Eve?\" Invite 2-3 kids to share simply. Say: \"I know Jesus saves us—He makes hard things lead to joy.\"\n\n## Take-Home Challenge\nDraw one good choice you'll make this week (like praying when tempted) and show your family. Tell them why you're glad for Jesus (Moses 5:10–11).\n\n## Teacher Tips\nUse a timer for smooth transitions; pair shy kids with buddies for activities. For larger classes, do relays in two rounds; adapt crafts for shorter attention by pre-drawing outlines. (712 words)",
  "generated_timestamp": "2026-01-11 18:35:41",
  "source_week_file": "cfm_2026_week_04.json"
}