{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "youth",
  "word_count": 816,
  "character_count": 5042,
  "content": "# Come, Follow Me Youth Lesson: Week 2 (Jan 5–11) – Moses 1; Abraham 3: \"God Knows You by Name\"\n\n## Attention Grabber (5 minutes)\nPicture this: You're scrolling social media, and influencers are all about labels—\"popular kid,\" \"athlete,\" \"gamer,\" or worse, \"not good enough.\" What if Heavenly Father DM'd you right now? According to President Russell M. Nelson, \"If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity\" (“Choices for Eternity” [worldwide devotional for young adults, May 2022], Gospel Library). Today, Moses 1 and Abraham 3 show us God's straight talk on who we really are—and why Satan hates that truth. Who's ready to claim your divine ID?\n\n## Core Doctrines (10 minutes)\nShare these on a whiteboard or slides with key quotes. Keep it simple: God sees your eternal potential.\n\n1. **You are a child of God with divine worth.** God told Moses, in Moses 1:4,6: Look for this pattern in God’s message to Moses in Moses 1:4, 6 and in Satan’s messages in Moses 1:12. What do you learn from these verses about the differences between God and Satan? President Nelson added, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”). (Connects to For the Strength of Youth: Build your identity on Christ, not trends.)\n\n2. **With the Lord's help, you can resist Satan.** After Moses's vision, Satan tempted him to doubt (Moses 1:12–26). Moses commanded, “Depart from me, Satan” (Moses 1:20) and relied on God’s power (Moses 1:24–26). Spot Satan's counterfeits—like fake plants vs. real ones—and reject them.\n\n3. **God's work is your eternal life.** After his vision, Moses asked, “Tell me … why these things are so” (Moses 1:30). The Lord replied in Moses 1:39: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.” Jesus Christ makes this possible. (See Topics and Questions, “Eternal Life,” Gospel Library.)\n\n4. **You chose to come to earth from premortal life.** Abraham 3:22–28 reveals: We were spirits “before the world was” (Abraham 3:22). God said, “We will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them” (Abraham 3:25). Jesus was the noblest spirit.\n\n5. **You have divine work ahead.** God prepared Moses “for a work” (Moses 1:6). What's yours? (See Doctrine and Covenants 11:20 from teaching children section.)\n\n## Interactive Activities (20-25 minutes)\n**Activity 1: Video + \"Would You Rather\" Dilemmas (10 minutes)**  \nWatch “Our True Identity” (video, Gospel Library) or “I Am a Son of God” (video, Gospel Library)—both under 3 minutes. Then play \"Would You Rather\":  \n- Would you rather chase social media likes or remember “thou art my son/daughter” (Moses 1:4,6)?  \n- Would you rather give in to peer pressure or say “Get thee hence, Satan” like Moses (Moses 1:20)?  \nDiscuss: How does knowing your premortal choice (Abraham 3:25) change your pick? Groups of 3-4 share one insight.\n\n**Activity 2: Small Group Role-Play Challenges (10-15 minutes)**  \nSplit into groups. Give scenarios:  \n- Friend texts a shady link (Satan's counterfeit, Moses 1:13–18). Role-play resisting like Moses—pray, command it away (Moses 1:20,26).  \n- School stress hits: Doubt your worth? Counter with God's words (Moses 1:4) and premortal purpose (Abraham 3:22–28).  \nGroups perform 1 skit and report: What helped most? Tie to President Nelson: Your identity shapes decisions (“Choices for Eternity”).\n\n**Activity 3 (Optional Quick Reflection):** Journal prompt: List 3 choices you make because you're a child of God first. (2 minutes silent.)\n\n## Real-Life Application (10 minutes)\nThese truths hit hard in teen life:  \n- **Social media/peer pressure:** Satan pushes labels to confuse you (Moses 1:12). Pause, affirm “I am a child of God” (like mirror activity for kids), then scroll less. For the Strength of Youth says base choices on eternal truths.  \n- **Dating/school temptations:** Spot counterfeits—fake flattery vs. God's real power (Moses 1:13–18). Pray for strength to “prove” yourself (Abraham 3:25).  \n- **Missionary prep/future goals:** Your premortal \"work\" (Moses 1:6) includes building Zion. When stressed, remember God's glory is your eternal life (Moses 1:39)—Christ bridges mistakes. Practice at dinner: Share a \"resist Satan\" win (Teaching in the Savior’s Way, 31). Sing “I Am a Child of God” (Hymns, no. 301) for a boost.\n\n## Testimony Moment (5 minutes)\nAs we wrap, ponder: What did God whisper to you today from Moses and Abraham? I know He sees you as His child with a premortal plan—it's changed how I face my own doubts. Share one feeling or takeaway if you want. **Challenge:** This week, when tempted or labeled, quote Moses 1:39 or Abraham 3:25 aloud. Text your teacher a win by Sunday—let's build testimonies together! Sing “I Will Follow God’s Plan” (Children’s Songbook, 164–65) to end strong.\n\n*(Total time: 50-60 minutes. Word count: 812. Adapt for class size; prep videos ahead.)*",
  "generated_timestamp": "2026-01-11 18:05:48",
  "source_week_file": "cfm_2026_week_02.json"
}