{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "children",
  "word_count": 638,
  "character_count": 3699,
  "content": "# Come, Follow Me for Kids: Week 4 – Adam and Eve Leave the Garden (Genesis 3–4; Moses 4–5)\n\n## Fun Start\nImagine a beautiful garden where Adam and Eve lived happily with Heavenly Father, but they needed to learn, grow, and choose! What happy adventures come when we follow God's plan?\n\n## Key Gospel Ideas\n1. **The Fall helps us grow**: Adam and Eve left the garden to have joy and learn to choose right (Moses 5:9–12). *Color a garden turning into a happy world—add flowers for growth!*\n2. **Jesus Christ saves us from the Fall**: Because of Jesus, we can be forgiven and happy again (Moses 5:8–11; 5:14–15). *Draw a sad face turning happy with Jesus' help!*\n3. **We can choose the right**: Heavenly Father and Jesus help us pick good choices (Moses 4:1–4). *Younger (3-5): Point to good/bad pictures. Older (6-11): Draw your good choices.*\n4. **Pray to Heavenly Father**: Adam and Eve prayed and felt close to Him (Moses 5:4, 8). *Make a prayer heart craft!*\n\n## Daily Adventures\n**Day 1**: Read Moses 4:1–4. Color an activity page with *one* color—then choose more! Talk about choosing right (younger: clap for good choices).\n**Day 2**: Sing “Choose the Right Way” (Children’s Songbook, 160–61). Draw pictures of good choices like helping or praying.\n**Day 3**: Read Moses 5:4, 8. Practice family prayers—say what you're thankful for!\n**Day 4**: Use pictures from “Adam and Eve” (Old Testament Stories, 13–16). Put them in order and cheer, \"God has a plan!\"\n**Day 5**: Finish sentences: \"Because of the Fall, I learn to...\" (Moses 4:25). \"Because of Jesus, I can...\" (Moses 5:8–11).\n**Day 6**: Read Moses 5:9–12. Act out Adam and Eve being glad—jump for joy!\n**Day 7**: Sing “Choose the Right” (Hymns, no. 239). Share a time you chose right and felt happy.\n\n## Story Time (248 words)\nOnce, Adam and Eve lived in a beautiful Garden of Eden with Heavenly Father. A snake tricked Eve, and she and Adam ate the special fruit (Genesis 3:1–7; Moses 4:22–31). Oh no! They felt sad and tried to hide because they knew they did wrong. Heavenly Father found them and said they must leave the garden. Now there would be hard work, pain, and no more walking with Him (Genesis 3:16–19).\n\nBut Heavenly Father had a happy plan! An angel came and taught them about Jesus Christ. \"Jesus will save you!\" Adam and Eve offered sacrifices like Jesus would do (Moses 5:4–9). They learned to pray and call on God’s name (Moses 5:4, 8). Soon, they were *glad*! \"We know God loves us and Jesus saves us\" (Moses 5:10–11). They had babies, taught them right from wrong, and grew strong in God's plan.\n\n*Questions for kids*: Why were Adam and Eve glad? (Moses 5:11). How does Jesus help you when things are hard? What good choice can you make today?\n\n*Younger (3-5)*: Use big pictures and simple words. *Older (6-11)*: Read verses together.\n\n## Play and Learn\n1. **Choice Coloring Game**: Give one crayon first (Moses 4:1–4). Then let kids choose colors—yay, agency! (Adapt: Younger stack blocks for choices).\n2. **Picture Sequence Relay**: Cut “Adam and Eve” pictures (Old Testament Stories). Race to order them—talk about God's plan!\n3. **Prayer Circle**: Sit in a circle, pray like Adam and Eve (Moses 5:4, 8). Pass a soft toy to say thanks. (Younger: Whisper prayers).\n4. **Sacrifice Hearts**: Draw hearts, color \"willing\" ones red for Abel, gray for Cain (Moses 5:16–26). Act offering with toys!\n\n## Jesus Connection\nJesus Christ brings hope and joy after the Fall—He saves us so we can choose right, pray, and grow forever (Moses 5:14–15; “Because of Him” video)! Let's pray: \"Thank You, Jesus, for Your love and happy plan.\" Share one way Jesus helps you feel glad today. I know Jesus loves each of you! (Moses 5:11)",
  "generated_timestamp": "2026-01-10 22:24:58",
  "source_week_file": "cfm_2026_week_04.json"
}