{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "youth",
  "word_count": 812,
  "character_count": 5194,
  "content": "# Come, Follow Me Youth Study Plan: Week 4 (Jan 19–25)  \n**Genesis 3–4; Moses 4–5**  \n*Why the Fall? Growth, Choices, and Christ's Redemption*\n\n## Youth Kickoff\nPicture scrolling TikTok where one choice leads to viral fame or epic fail—Adam and Eve's Garden exit feels like that, but way bigger! This week's scriptures flip the script: the Fall wasn't a tragedy but God's setup for us to grow, choose right, and grab eternal glory (Moses 5:11). Teens, in your fast-scroll world of peer pressure and big dreams, see how leaving \"paradise\" unlocks real joy through Jesus Christ!\n\n## Core Truths\n1. **The Fall was necessary for God's plan**: Adam and Eve needed opposition to progress. \"Adam and Eve were cast out... But... Leaving the Garden of Eden was the necessary first step toward returning to God\" (CFM intro). See Moses 5:9–12: Adam said, \"Blessed be the name of God, for because of my transgression my eyes are opened, and in this life I shall have joy, and again in the flesh I shall see God.\" Ties to For the Strength of Youth: \"Make inspired choices\" (p. 4–5).\n   \n2. **Jesus Christ redeems us from the Fall**: He overcomes pain, sorrow, death. In Moses 5:4–15, an angel taught them of sacrifice and the Savior; they were \"glad\" (Moses 5:10). Watch “Because of Him” video (Gospel Library).\n\n3. **Husbands and wives are equal partners**: Genesis 3:16's \"rule over\" means ministering with respect. \"A righteous husband will seek to minister... treat his wife with the utmost respect\" (Elder Dale G. Renlund, *The Melchizedek Priesthood*, 2018, 23). See “The Family: A Proclamation to the World” and Elder Ulisses Soares’ “Equal Partnership in Marriage” video.\n\n4. **Agency needs opposition to grow**: Heavenly Father and Jesus protected our choices. Moses 4:1–4 shows Satan tempting, but \"Our Heavenly Father’s goal... is to have His children choose to do what is right\" (Elder Dale G. Renlund, “Choose You This Day,” *Liahona*, Nov. 2018, 104). Links to 2 Nephi 2:27: \"men are free... to choose liberty and eternal life.\"\n\n5. **Satan deceives, but God clothes and protects**: List his tactics in Moses 4:4–12; 5:13–33. God \"clothed them\" (Moses 4:27), symbolizing spiritual covering.\n\n6. **Sacrifice with a willing heart**: Abel's offering pleased God; Cain's didn't (Moses 5:16–26). Offer your sacrifices obediently.\n\n## Daily Dive\n**Day 1 (Mon)**: Read Genesis 3:1–7; Moses 4:22–31. List Fall effects (pain, death). Text a friend: \"How does opposition help at school?\" Journal one \"because of the Fall, I...\" (Moses 4:25).\n\n**Day 2 (Tue)**: Moses 5:4–15. Watch “Because of Him” (2 min). Finish: \"Because of Jesus Christ, I can...\" (Moses 5:8–11). Snap a meme: Adam/Eve glad post-angel.\n\n**Day 3 (Wed)**: Moses 4:1–4; 2 Nephi 2:19–25, 27. Why opposition for agency? (For the Strength of Youth, p. 4–5). Group text quorum: \"Best choice you made this week?\"\n\n**Day 4 (Thu)**: Moses 4:4–12; 5:13–33. List Satan's tricks on Cain/Adam. Pray: How does Heavenly Father help me spot fakes on social media?\n\n**Day 5 (Fri)**: Genesis 3:16; Moses 4:22. Watch “Equal Partnership in Marriage.” Journal: How can I honor equal roles now/with future family?\n\n**Day 6 (Sat)**: Moses 4:13–16, 27; 5:4–9, 16–26. Ponder clothing/sacrifice symbols. (Temple clothing is sacred—talk to your bishop.) Sing “Choose the Right” (Hymns, no. 239).\n\n**Day 7 (Sun)**: Moses 5:9–12. Share in family chat: \"How has a hard choice brought joy?\" Prep testimony for class.\n\n## Activity Ideas\n1. **Fall Flip Role-Play**: Groups act Genesis 3 temptations vs. Moses 5 redemption. Switch roles—deceiver to disciple. Debrief: \"How's Christ our hope?\" (5–10 min).\n\n2. **Agency Object Lesson**: Give one-color markers to draw \"perfect day\"—then add colors. Read Moses 4:1–4. Sing “Choose the Right Way” (Children’s Songbook, 160–61). Pairs share peer pressure wins.\n\n3. **Video & Meme Mashup**: Watch “Because of Him” and “Sacred Temple Clothing.” Create memes applying to school drama. Vote best in class!\n\n4. **Sacrifice Chain**: Read Moses 5:16–26. Each youth writes a \"willing sacrifice\" (time, social media fast) on paper chain links. Hang in room; commit for week.\n\n5. **Opposition Scavenger Hunt**: Teams find 2 Nephi 2:11–20, 25–30 verses in app. Discuss: \"How's opposition missionary prep?\" Service twist: Text encouraging missionary.\n\n## Real-Life Connections\nDodge Satan's Instagram deceptions (Moses 4:4–12) by choosing agency amid peer pressure—text scriptures to friends instead of ghosting. Prep missions with opposition: like Adam/Eve learning sacrifice (Moses 5:4–9), fast from games to build testimony. Social media \"nakedness\"? Let God's \"clothing\" (Moses 4:27) be your spiritual armor. Equal partnerships? Honor guy/girl friends now as future eternal teammates (“The Family: A Proclamation”).\n\n## Faith Boost\nBrothers and sisters, I've felt the joy Moses 5:11 promises when choosing Christ amid my own \"falls\"—He truly redeems. Share one takeaway testimony in class (record for your journal). Challenge: This week, make one opposition-powered choice (like Moses 5:9), journal the joy, and tag a friend to join. You've got this—think celestial! (President Nelson, Oct 2024, \"Think Celestial!\"). \n\n*(748 words)*",
  "generated_timestamp": "2026-01-10 22:24:41",
  "source_week_file": "cfm_2026_week_04.json"
}