{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "children",
  "word_count": 708,
  "character_count": 4124,
  "content": "# Come, Follow Me for Kids: Week 2 (Jan 5–11)  \n**Moses 1; Abraham 3**  \n*You are a child of God with a special work to do! Let's discover God's love together.*\n\n## Fun Start  \nImagine looking in a mirror and hearing God say, \"You are my child!\" (Moses 1:4). What would that make you feel? This week, we'll learn we are God's children who lived with Him before earth!\n\n## Key Gospel Ideas  \n1. **I am a child of God!** God told Moses, \"Thou art my son\" (Moses 1:4, 6). *Color pictures of children saying, \"I am a child of God!\" Younger kids: Simple faces. Older: Add families.*  \n2. **I can resist Satan with God's help.** Moses said \"Get thee hence, Satan\" and called on God (Moses 1:20–22, 26). *Draw God’s strong words vs. Satan’s sneaky ones (Moses 1:4, 12).*  \n3. **Heavenly Father has work for me!** God said to Moses, \"This is my work and my glory—to bring to pass the immortality and eternal life of man\" (Moses 1:39). *Color Moses seeing God's creations.*  \n4. **I lived as a spirit before earth.** \"Ye were … in the beginning with the heavens and the earth … intelligence … organized before the world\" (Abraham 3:22). *Draw happy spirits choosing to come to earth.*  \n5. **I can follow God's plan.** Find words like \"spirits,\" \"prove,\" \"make an earth\" (Abraham 3:22–28). Sing \"I Will Follow God’s Plan\" (Children’s Songbook, 164–65)!\n\n## Daily Adventures  \n- **Day 1:** Look in a mirror and say, \"I am a child of God\" (Moses 1:4). Hug family! (Younger: Repeat with mom. Older: Say why.)  \n- **Day 2:** Sing \"I Am a Child of God\" (Hymns, no. 301). Draw your divine self!  \n- **Day 3:** Act out Moses telling Satan \"Get thee hence\" (Moses 1:20). Practice saying no to bad choices.  \n- **Day 4:** Read Moses 1:39. Build earth with playdough—God's work!  \n- **Day 5:** Circle \"before the world was\" in Abraham 3:22. Draw premortal spirits.  \n- **Day 6:** Sing \"I Will Follow God’s Plan.\" Practice choices to \"prove\" ourselves (Abraham 3:25).  \n- **Day 7:** Share work God has for you, like Moses (Moses 1:6). Family prayer of thanks!\n\n## Story Time (248 words)  \nOnce, God called righteous Moses to a high mountain. God showed Moses the earth and all His creations—worlds without number! \"Worlds have I created,\" God said (Moses 1:33). Moses saw God's glory and knew, \"Now I know that man is nothing\" (Moses 1:10).  \n\nGod hugged Moses with His love: \"Thou art my son; wherefore look … for world is mine\" (Moses 1:4, 6). Moses was filled with joy!  \n\nThen Satan came, sneaky and mad: \"Moses, son of man, worship me\" (Moses 1:12). Moses said no! \"Who art thou? … I am a son of God, in the similitude of his Only Begotten\" (Moses 1:13, 16). Satan got fierce, but Moses called, \"In the name of the Only Begotten, depart!\" (Moses 1:21). Angels came, and Satan left (Moses 1:26).  \n\nGod returned: \"This is my work … eternal life of man\" (Moses 1:39). Later, Abraham saw spirits before earth: \"These I will make my rulers … Abraham, thou art one of them\" (Abraham 3:22–23). We chose to come prove ourselves!  \n\n*Questions:* How did God make Moses feel special (Moses 1:4)? What did Moses say to Satan (Moses 1:20)? Why did we come to earth (Abraham 3:25)? (Younger: Point and repeat. Older: Share feelings.)\n\n## Play and Learn  \n1. **Mirror Messages:** Say \"You are a child of God\" to reflections or pictures (Moses 1:4). Switch turns! (Younger: Just look/smile. Older: Compare to Satan's lie, Moses 1:12.)  \n2. **Resist Temptation Act-Out:** Pretend Satan's tricks; kids say \"Get thee hence!\" and pray (Moses 1:12–26). Use blocks as mountains.  \n3. **Premortal Puzzle:** Hide words \"spirits,\" \"prove\" (Abraham 3:22–28). Find and draw. Sing song after!  \n4. **God's Work Builders:** Stack blocks as \"worlds\" (Moses 1:33). Talk Heavenly Father's plan (Moses 1:39). (Primary class fun!)\n\n## Jesus Connection  \nJesus is God's Only Begotten—He helps bring eternal life (Moses 1:39)! He was chosen before earth to help us (Abraham 3:22–28). Pray: \"Thank You, Jesus, for loving me as God's child.\" I know Jesus helps us follow the plan—He makes it possible! (Younger: Simple thanks. Older: Share a time He helped.)  \n\n*(512 words)*",
  "generated_timestamp": "2026-01-10 22:23:12",
  "source_week_file": "cfm_2026_week_02.json"
}