{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "younger-primary",
  "word_count": 579,
  "character_count": 3524,
  "content": "# Adam and Eve Learn Heavenly Father's Happy Plan\n\n## Lesson Overview (for the teacher)\nHeavenly Father gave Adam and Eve a beautiful garden, but His plan let them choose, learn, grow, and feel joy through Jesus Christ (Moses 5:10–11).\n\n## TEACHER LESSON (8-10 minutes)\n**Get Attention (1-2 minutes):** Hold up a shiny apple or fruit picture. \"Look! What do you think this is for? Adam and Eve saw one too!\" Wiggle like a snake: \"S-s-s-sss!\"\n\n**Simple Story (3-4 minutes):** Use pictures from Old Testament Stories (pages 13–16). Show Garden of Eden. \"Adam and Eve lived with Heavenly Father. A snake tricked them to eat fruit. They had to leave the garden (Genesis 3:1–7; Moses 4:22–31). But an angel came! He taught them to pray and about Jesus (Moses 5:4–15). They felt glad!\" Kids repeat: \"They felt glad!\"\n\n**Big Idea (2-3 minutes):** \"Heavenly Father's plan is happy! We leave the garden to choose right, pray, and let Jesus help us. Say with me: 'Heavenly Father's plan is happy!' (Repeat 3 times.)\"\n\n**We Can Do This (1-2 minutes):** \"We can pray like Adam and Eve. Fold arms—let's pray now: 'Thank you, Heavenly Father, for Jesus!'\"\n\n## Wiggle Activity (2-3 minutes)\n**Happy Plan March:** March around the room singing \"If You're Happy and You Know It\" but change to \"Choose the right way, choose the right way!\" Clap, stomp, shout \"Hooray for Jesus!\" (Music & Movement.)\n\n## Simple Scripture\n**Moses 5:10** (short phrase): \"Adam and Eve... were glad.\"  \nSay together 3 times with happy claps: \"Glad! Glad! Glad!\"\n\n## Fun Activities (15 minutes total)\n**1. Choice Path Game (3 minutes) (Physical Activities)**  \n*What to do:* Tape two paths on floor: \"Happy Path\" and \"Ouch Path.\" Call choices (share toy/good; take toy/bad). Kids walk to path.  \n*Materials:* Painter's tape.  \n*What to say:* \"Walk to Happy Path if you share! Jesus helps us choose happy!\"  \n\n**2. Prayer Hands Craft (4 minutes) (Hands-On Crafts)**  \n*What to do:* Trace kids' hands on paper, color praying hands. Add smiley Jesus sticker.  \n*Materials:* Paper, crayons, stickers.  \n*What to say:* \"Adam prayed like this (Moses 5:4,8). Draw your happy prayer face!\"  \n\n**3. Good Choice Toss (3 minutes) (Games)**  \n*What to do:* Toss beanbag to child who says \"Choose right!\" for pictures (help friend/bad lie).  \n*Materials:* Beanbag, choice pictures.  \n*What to say:* \"Toss if good choice! Heavenly Father loves our right choices (Moses 4:1–4)!\"  \n\n**4. Glad Dance Freeze (5 minutes) (Music & Movement)**  \n*What to do:* Play music. Dance \"glad\" for Jesus. Freeze and say \"Because of Jesus, I can... (be happy)!\"  \n*Materials:* Phone music.  \n*What to say:* \"Freeze and wiggle glad like Adam and Eve (Moses 5:10–11)!\"\n\n## Picture Time\nShow \"Adam and Eve\" (Old Testament Stories, page 13) or \"The Fall, by Robert T. Barrett\" (Gospel Art Book). Ask: \"What do you see? How do they look? How does Jesus make us glad?\"\n\n## Song\n“Choose the Right Way” (Children’s Songbook, 160–61). Actions: Point up for \"Heavenly Father,\" hug self for \"Jesus helps.\"\n\n## Snack Idea (optional)\nApple slices (safe, no allergies). \"Like Adam and Eve's fruit—now we choose happy with Jesus!\"\n\n## Testimony Moment\n\"I know Heavenly Father and Jesus love you so much. Their plan makes us glad. Say with me: 'I can choose the right!'\"\n\n## Teacher Survival Tips\n1. If a child wanders, gently guide with \"Come choose happy path with friends!\"  \n2. Shorten activities if wiggly—jump to song or march.  \n3. Praise every try: \"You chose right—Jesus is proud!\"  \n\n(Word count: 612)",
  "generated_timestamp": "2026-01-11 18:36:06",
  "source_week_file": "cfm_2026_week_04.json"
}