{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "children",
  "word_count": 841,
  "character_count": 4525,
  "content": "# Come Follow Me Study Plan for Children: Week 2 (January 5–11) - Moses 1; Abraham 3\n\n## Fun Start\nHello, little friends! Have you ever wondered who you are or where you came from before you were born? Today, we’re going to learn amazing things about being children of God and how He has a special plan for each of us!\n\n## Key Gospel Ideas\nHere are some wonderful truths to learn together. Let’s read, draw, and talk about them!\n\n1. **I Am a Child of God** - God told Moses, “Behold, thou art my son” (Moses 1:4). You are a child of God too! **Activity**: Look in a mirror and say, “I am a child of God!” Draw a picture of yourself with a big heart around it.\n2. **God Has a Work for Me** - God said to Moses, “Thou art in the similitude of mine Only Begotten; and mine Only Begotten is and shall be the Savior” (Moses 1:6). God has important things for us to do! **Activity**: Color a picture of Moses from the Gospel Art Book (no. 13).\n3. **I Can Resist Satan** - Moses told Satan, “I will not cease to call upon God, I have other things to inquire of him” (Moses 1:18). We can pray and say no to bad choices! **Activity**: Draw yourself praying to Heavenly Father.\n4. **I Lived Before I Was Born** - Abraham saw that “the intelligences that were organized before the world was” were spirits (Abraham 3:22). We lived with God as spirits before coming to earth! **Activity**: Draw a picture of stars to show where we lived with God.\n\n## Daily Adventures\nLet’s have fun every day learning about God’s plan! Here are family activities for each day:\n\n- **Day 1**: Sing “I Am a Child of God” (Children’s Songbook, 2–3). Talk about why you’re glad to be God’s child.\n- **Day 2**: Read Moses 1:4 together. Draw a picture of your family with Heavenly Father watching over you.\n- **Day 3**: Sing “I Will Follow God’s Plan” (Children’s Songbook, 164–65). Talk about good choices.\n- **Day 4**: Read Abraham 3:22–23. Make paper stars to remind you of living with God before earth.\n- **Day 5**: Act out saying no to bad choices like Moses did (Moses 1:12–13). Practice praying for help.\n- **Day 6**: Look at pictures of Moses in Old Testament Stories (pages 64–84). Talk about God’s work for him.\n- **Day 7**: Share with someone, “You are a child of God!” Draw a happy picture to give them.\n\n## Story Time: Moses Talks with God (Moses 1)\nOnce, a man named Moses was on a mountain, and something amazing happened! God spoke to him and showed him the whole earth and many stars. God said, “Behold, thou art my son” (Moses 1:4). Moses felt so special knowing he was a child of God. But then Satan came and tried to make Moses forget who he was. Satan said, “Moses, son of man, worship me” (Moses 1:12). Moses said no! He remembered God’s words and prayed for help. He told Satan, “I am a son of God… depart hence, Satan” (Moses 1:13–16). God helped Moses, and Satan had to leave. Later, God told Moses about His big plan: “This is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39). That means God wants us to live with Him forever! **Questions**: Who did God say Moses was? What did Moses do when Satan came? How does God help us like He helped Moses?\n\n## Play and Learn\nLet’s play and grow closer to Heavenly Father with these fun games! **Younger Kids (3–5)** can do simpler actions; **Older Kids (6–11)** can add more details or talk about feelings.\n\n1. **Mirror Game** - Hold up a mirror or pretend to. Say, “I am a child of God!” Pass it around so everyone says it. **Younger**: Just say the words. **Older**: Add why it makes you happy.\n2. **Act Out Moses** - Pretend to be Moses saying no to Satan. Practice praying for help! **Younger**: Say, “No, Satan!” **Older**: Add a prayer like Moses did.\n3. **Star Craft** - Cut out paper stars to show we lived with God before earth (Abraham 3:22). Hang them up! **Younger**: Color the stars. **Older**: Write “Child of God” on them.\n4. **Find the Work** - Hide pictures of Moses or hearts around the room. Find them and talk about God’s work for us. **Younger**: Find just a few. **Older**: Add a clue about Moses.\n\n## Jesus Connection\nSweet children, all these stories show us how much Jesus loves us. God’s plan in Moses 1:39 is to help us live with Him forever, and Jesus is the Savior who makes that possible. Let’s say a little prayer together: “Heavenly Father, thank You for loving me and sending Jesus to help me. Help me remember I’m Your child. Amen.” I feel so happy knowing Jesus is always with us, guiding us back to Heavenly Father.",
  "generated_timestamp": "2025-12-31 23:59:20",
  "source_week_file": "cfm_2026_week_02.json"
}