{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "youth",
  "word_count": 1044,
  "character_count": 5928,
  "content": "# Come Follow Me Study Plan for Youth: Moses 1; Abraham 3 (January 5–11)\n\nHey, awesome youth! Get ready to dive into some mind-blowing truths about who you are and why you’re here! This week’s study of Moses 1 and Abraham 3 is like getting a backstage pass to God’s plan for you—let’s jump in and discover your divine VIP status!\n\n## Youth Kickoff\nEver wonder who you *really* are in the grand scheme of things? In a world full of labels and likes, Moses 1 and Abraham 3 are like a cosmic Snapchat filter showing your true identity as a child of God! Let’s explore how knowing this changes everything about how you live, love, and face challenges.\n\n## Core Truths\nHere are the big ideas from this week’s scriptures, simplified for your life right now, with ties to *For the Strength of Youth* principles:\n\n1. **I Am a Child of God with Divine Worth** - God told Moses, “Thou art my son” (Moses 1:4), and President Russell M. Nelson reminds us, “The first thing He would make sure you understand is your true identity” (“Choices for Eternity,” May 2022). Your worth isn’t based on followers or grades—it’s eternal! (*FSY*: “You are a child of God.”)\n2. **I Can Resist Satan with God’s Help** - Moses stood firm against Satan by saying, “I am a son of God” (Moses 1:13), showing us we can reject temptation by remembering who we are. (*FSY*: “Choose to do what is right.”)\n3. **God’s Work Is My Eternal Life** - The Lord declared, “This is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39). Your purpose ties into His plan! (*FSY*: “Live the standards.”)\n4. **I Lived as a Spirit Before Earth** - Abraham saw “the spirits that God had placed with him” before the world was (Abraham 3:22–23). You’re not new—you’ve been part of God’s family forever! (*FSY*: “Prepare now for the future.”)\n5. **Jesus Christ Was Chosen Before the World** - Abraham learned that Jesus was “like unto God” and chosen to be our Savior (Abraham 3:24). He’s always been our way back home. (*FSY*: “Follow Jesus Christ.”)\n\n## Daily Dive\nA 7-day plan to keep you connected to these truths with quick readings, activities, and real-life questions. Takes just 10-15 minutes a day!\n\n- **Day 1: Moses 1:1–6** - Read about God calling Moses His son. Journal: How does knowing you’re a child of God help with tough days at school? \n- **Day 2: Moses 1:12–18** - See how Moses resists Satan. Activity: Text a friend one way you can say “no” to a bad choice this week. Question: What’s one temptation you face often?\n- **Day 3: Moses 1:27–39** - Learn God’s purpose for you. Journal: What’s one way you can help someone feel God’s love today? Question: How does this help your future goals?\n- **Day 4: Abraham 3:22–23** - Discover your premortal life. Activity: Make a meme about being a “spirit star” before earth and share it in a group chat. Question: How does this change how you see yourself?\n- **Day 5: Abraham 3:24–26** - Read about Jesus’ role in the plan. Journal: How has the Savior helped you lately? Question: How can you share Him with friends?\n- **Day 6: Moses 1:4, 13** - Revisit your identity. Activity: Listen to “I Am a Child of God” (Hymns, no. 301) and write down one lyric that hits you. Question: What labels at school conflict with your divine identity?\n- **Day 7: Abraham 3:25** - Ponder being “proved” on earth. Activity: Watch “Our True Identity” (video, Gospel Library). Question: What’s one choice this week you can make to follow God’s plan?\n\n## Activity Ideas\nSpice up your quorum or class with these interactive ideas to bring the scriptures to life:\n\n1. **Identity Mirror Game** - Set up a mirror or phone camera. Have each youth look at themselves and say, “I am a child of God” (Moses 1:4). Discuss how this truth helps with self-worth and hard choices.\n2. **Temptation Role-Play** - Act out scenarios like Moses resisting Satan (Moses 1:12–18). Split into pairs to practice saying “no” to peer pressure, using phrases like “I’m a son/daughter of God.”\n3. **Premortal Life Art** - Draw or collage what you imagine the premortal life looked like based on Abraham 3:22–23. Share your art and feelings about being part of God’s family forever.\n4. **God’s Work Discussion** - Watch “I Am a Son of God” (video, Gospel Library), then brainstorm small service projects to help with God’s work (Moses 1:39), like writing kind notes or helping a neighbor.\n5. **Youth Music Jam** - Play “I Will Follow God’s Plan” from the *Children’s Songbook* or a track from the Youth Music album. Sing along and talk about how following God’s plan feels in daily life.\n\n## Real-Life Connections\nLet’s apply these truths to stuff you face every day:\n- **Social Media**: Filters and comments can mess with how you see yourself. Remember Moses 1:4—your worth as God’s child doesn’t change with likes or trends. Challenge: Post something positive this week that reflects your true identity.\n- **Peer Pressure**: Like Moses resisting Satan (Moses 1:13), you can say no to wrong choices. Practice responses for when friends push you to break standards, and pray for strength.\n- **Missionary Prep**: Knowing you’re part of God’s plan (Moses 1:39) and lived before earth (Abraham 3:22) helps you share the gospel with confidence. Start by telling a friend why you believe in Jesus Christ.\n\n## Faith Boost\nI’m so inspired by how Moses and Abraham learned their true identity and purpose straight from God. I know that as you study these chapters, the Spirit will whisper to your heart that you are a beloved child of God with a divine destiny. I’ve felt that truth in my own life as I’ve turned to the Lord in tough times, and it gives me strength to keep going. I invite you to share with someone this week—maybe a friend, parent, or quorum/class—how knowing you’re a child of God helps you. Then, pick one principle, like resisting temptation or serving others, and act on it. Let’s live like the eternal beings we are!",
  "generated_timestamp": "2025-12-31 23:58:57",
  "source_week_file": "cfm_2026_week_02.json"
}