{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "adult",
  "word_count": 928,
  "character_count": 6008,
  "content": "# Come, Follow Me Study Plan: Week 2  \n**January 5–11: Moses 1; Abraham 3**\n\n## Weekly Overview\nThese chapters from the Pearl of Great Price reveal foundational truths about our identity and purpose, beginning not with creation's \"beginning\" but with Moses's vision that frames Genesis. Through Joseph Smith's inspired translation and Abraham's record, we learn who God is, who we are as His spirit children, and His eternal work to bring us to exaltation amid premortal councils and mortal proving (Moses 1:1–6, 27–39; Abraham 3:22–28). In our day, these revelations counter Satan's deceptions about identity, offering clarity for decisions and resilience against temptation, as President Russell M. Nelson has emphasized.\n\n## Doctrinal Key Points\n1. **God declares our divine identity**: In Moses 1:4, the Lord tells Moses, \"thou art my son,\" and in verse 6, \"mine Only Begotten is and shall be the Savior.\" This echoes President Nelson's counsel: “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity” [worldwide devotional for young adults, May 2022]).\n   \n2. **Satan seeks to undermine divine worth**: Contrast God's words in Moses 1:4, 6 with Satan's in verse 12: \"Moses, son of man, worship me.\" This pattern reveals Satan's counterfeits, as seen in Moses 1:13–18.\n\n3. **We resist Satan through the Lord's power**: Moses prevails by commanding, \"Depart hence, Satan\" (Moses 1:20), and receiving strength: \"the power of God\" comes upon him (Moses 1:25–26). This teaches reliance on divine help after sacred experiences.\n\n4. **God's work is our immortality and eternal life**: After beholding creations, Moses asks, \"why these things are so?\" (Moses 1:30). The Lord replies, \"For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man\" (Moses 1:39).\n\n5. **Jesus Christ enables exaltation**: As the Only Begotten, Christ brings both immortality and eternal life (Moses 1:39; see Abraham 3:24–26, where noble spirits, including Christ, are chosen for earth's creation).\n\n6. **Premortal existence shapes mortal purpose**: Abraham saw spirits \"before the world was\" (Abraham 3:22), organized to \"prove\" themselves through agency (Abraham 3:25–26).\n\n7. **Identity as God's child precedes all labels**: President Nelson taught, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”).\n\n## Personal Study Guide\n**Day 1 (Jan 5): Moses 1:1–6**  \nRead God's declaration to Moses. Reflect: What differences emerge between God's messages (verses 4, 6) and potential doubts? Cross-reference: President Nelson, “Choices for Eternity,” section “First: Know the truth about who you are.”\n\n**Day 2 (Jan 6): Moses 1:12–26**  \nStudy Moses's resistance to Satan. Ponder: What counterfeits does Satan use today (verses 13–18)? How does the Lord strengthen us (verses 24–26)? Cross-reference: Matthew 4:1–11; Gary E. Stevenson, “Deceive Me Not” (Liahona, Nov. 2019).\n\n**Day 3 (Jan 7): Moses 1:27–39**  \nExamine God's response to Moses's question (verses 31–39). Journal: How does verse 39 distinguish immortality from eternal life? Cross-reference: Gospel Topics, “Eternal Life.”\n\n**Day 4 (Jan 8): Abraham 3:1–21**  \nNote Abraham's vision of heavenly bodies. Reflect: How does this prepare for premortal truths? Cross-reference: Gospel Topics, “Premortal Life.”\n\n**Day 5 (Jan 9): Abraham 3:22–28**  \nList truths about spirits, Christ, and proving (verses 22–28). Ask: Why are these valuable for my choices? Cross-reference: Doctrine and Covenants 11:20.\n\n**Day 6 (Jan 10): Review Moses 1 and Abraham 3**  \nCompare visions. Pray: How does knowing my premortal identity affect decisions? Cross-reference: President Nelson, “Choices for Eternity.”\n\n**Day 7 (Jan 11): Synthesis**  \nRe-read Moses 1:39; Abraham 3:25–26. Write one truth to anchor your week. Sing “I Am a Child of God” (Hymns, no. 301).\n\n## Group Discussion Ideas\n1. How does Moses 1:4 contrast with Satan's words in verse 12, and what does this teach about discerning truth?\n2. President Nelson said our identity as God's children should come before other labels—what choices does this influence for you?\n3. In Moses 1:20–26, what steps did Moses take to overcome Satan, and how can we apply them?\n4. What impresses you about God's response in Moses 1:31–39 to \"why these things are so?\"\n5. How does Abraham 3:22–28 describe premortal life, and why does it matter for treating ourselves and others?\n6. Share an experience where relying on the Lord's power (Moses 1:25) helped resist temptation.\n7. What difference does understanding eternal life versus immortality (Moses 1:39) make in daily priorities?\n8. How has knowing you lived \"before the world was\" (Abraham 3:22) shaped a recent decision?\n\n## Application Challenges\n1. **Affirm identity daily**: Make a list of choices rooted in being a child of God first, as in President Nelson's counsel. Review it each morning (Moses 1:4, 6).\n2. **Spot and reject counterfeits**: When tempted, pause to identify Satan's fake (like artificial plants in the manual) versus God's truth, then command departure as Moses did (Moses 1:13–20).\n3. **Pursue God's work**: This week, serve someone to further eternal life—perhaps mentoring youth or temple preparation—echoing Moses 1:39 and Abraham 3:25.\n4. **Teach premortal truths**: Share Abraham 3:22–28 with a child or friend, using a mirror activity: \"You are a child of God\" (from teaching children section).\n\n## Testimony Builder\nThese visions testify of Jesus Christ, the Only Begotten who stood foremost in premortal councils to make an earth where we prove faithful (Abraham 3:22–27; Moses 1:6, 39). Through the Restoration, Joseph Smith restored this light, revealing our divine potential amid Satan's lies. Ponder how embracing your identity as a spirit child advances Christ's work of eternal life in your life—what truth from Moses or Abraham stirs your soul toward Him today?",
  "generated_timestamp": "2026-01-11 18:32:07",
  "source_week_file": "cfm_2026_week_02.json"
}