{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "youth",
  "word_count": 837,
  "character_count": 5225,
  "content": "# Come, Follow Me Youth Lesson Plan: Week 1  \n**December 29–January 4: Introduction to the Old Testament**\n\n## Attention Grabber  \nImagine scrolling social media and seeing a massive group project assignment drop—like studying a whole ancient history book for the year. Does it feel exciting, overwhelming, or straight-up scary? The Old Testament can hit like that: ancient stories from a world that feels worlds away. But just like those real-life heroes Abraham, Sarah, Hannah, and Daniel faced family drama, doubts, wins, and losses (just like your group chats or family dinners), their lives point straight to Jesus Christ. As the psalmist said, “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105, 140). Today, let's uncover how this \"lamp\" lights up your path.\n\n## Core Doctrines  \nHere are five key principles from this week's study, straight from the scriptures and prophets—simplified to power your faith:  \n\n1. **The Old Testament testifies of Jesus Christ as the Bread of Life.** Look for Him in symbols like manna: “I am the bread of life” (John 6:35; see Exodus 16:4, 11–15); the sacrificial lamb (Exodus 12:3–5; John 1:29); the brass serpent (Numbers 21:4–10; John 3:14); and Jonah (Jonah 1:4–17; Matthew 12:38–41). Elder Dale G. Renlund taught to “remember and always focus on Jesus Christ” (“Jesus Christ Is the Treasure,” Liahona, Nov. 2023, 98).  \n\n2. **Jesus Christ is Jehovah in the Old Testament.** President Dallin H. Oaks explained: “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (“The Teachings of Jesus Christ,” Liahona, May 2023, 102). See Exodus 3:13–15; 6:3–5—why Jesus saying “Before Abraham was, I am” (John 8:58) shocked people.  \n\n3. **All things bear record of Christ.** The Lord told Adam, “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63). Spot these symbols to build faith (see “Types or Symbols of Christ” in Guide to the Scriptures).  \n\n4. **The Lord restored plain and precious things.** Nephi saw “many plain and precious things” removed from the Bible, but God would restore them (1 Nephi 13:21–29, 38–42). The Bible and Book of Mormon “establish his word” (2 Nephi 3:12). Examples: Enoch’s Zion (Moses 7:18–19), Abraham’s council (Abraham 3:22–28), Melchizedek’s ministry (Joseph Smith Translation, Genesis 14:25–40).  \n\n5. **The Old Testament reveals our covenant path.** God seeks to make us His “peculiar treasure” by covenant (Exodus 19:5). Study President Russell M. Nelson’s “The Everlasting Covenant” (Liahona, October 2022, 4–11) to see the “special kind of love and mercy” in keeping covenants (see Jeremiah 31:31–34). Ties right to For the Strength of Youth: Honor your baptismal covenants daily.\n\n## Interactive Activities (Choose 2-3)  \n**1. Small Group Symbol Hunt (15 minutes):** Divide into groups of 3-4. Assign each: manna, lamb, serpent, or Jonah. Read the paired scriptures (e.g., Exodus 16:4, 11–15 and John 6:35). Have them list: What does this teach about Jesus? Report back—what other OT symbols do you know? Play “Seek the Lord Early” (Children’s Songbook, 108) to wrap up.  \n\n**2. \"Would You Rather\" Gospel Dilemmas (10 minutes):** Pose these: Would you rather face a \"fiery serpent\" trial (Numbers 21:4–10) by looking to Christ or ignoring it? Would you rather eat daily manna (Exodus 16) trusting God’s provision or hoard it? Discuss: How does knowing Jesus is Jehovah (Exodus 3:13–15) change your choice?  \n\n**3. Personal Reflection Prompt (Journal Time, 5 minutes):** “Why are restored accounts like Abraham’s council (Abraham 3:22–28) ‘plain and precious’ to me? How do covenants make me God’s ‘peculiar treasure’ (Exodus 19:5)?” Share one insight voluntarily.\n\n## Real-Life Application  \nTeens, the Old Testament isn't dusty history—it's your playbook for today's chaos. Facing peer pressure to scroll endless TikTok? Look for Christ like manna: trust His daily bread over distractions (John 6:35; For the Strength of Youth: \"Make time for the Lord\"). School stress or friend drama like ancient family discord? Remember Jesus as Jehovah spoke to Moses (Exodus 3:13–15)—He's the same voice guiding you now. Prep for missions or dates? Covenants are your anchor: keep them for that “special kind of love and mercy” (Nelson, “The Everlasting Covenant”). When social media tempts comparison, hunt Christ symbols to refocus, just as Elder Renlund urges. Spot restored truths like Enoch’s Zion (Moses 7:18–19) to dream big about your future Zion life.\n\n## Testimony Moment  \nI’ve felt the Old Testament light my path through tough high school years, seeing Christ in every symbol and covenant promise. As we wrap, ponder: How does knowing Jesus is Jehovah and the OT points to Him change your view of scripture this year? Share if you feel prompted—one sentence is plenty. Your challenge: This week, pick one symbol (like the lamb) and note in your journal or phone notes how it shows up in your life. Act on it—maybe share with a friend. Watch how God moves, just like with Abraham and Daniel. He’s seeking you as His peculiar treasure.  \n\n*(Word count: 812)*",
  "generated_timestamp": "2026-01-11 18:31:12",
  "source_week_file": "cfm_2026_week_01.json"
}