{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "youth",
  "word_count": 877,
  "character_count": 5411,
  "content": "# Come, Follow Me Youth Lesson Plan: Week 1 – Introduction to the Old Testament (Dec 29–Jan 4)\n\n## Attention Grabber (5 minutes)\nPicture this: You're scrolling TikTok, and you see a video about ancient myths—dragons, floods, giants. Kinda weird, right? Now imagine diving into the Old Testament, one of the oldest books ever, full of stories from a world super different from ours. Does it feel exciting, scary, or just confusing? The Come, Follow Me intro nails it: \"When you consider studying the Old Testament this year, how do you feel? Eager? Uncertain? Afraid?\" (Come, Follow Me—For Home and Church: Old Testament 2026). Today, we're flipping that intimidation into adventure by spotting Jesus Christ everywhere in it—like hidden Easter eggs that light up your path: “Thy word is a lamp unto my feet, and a light unto my path” (Psalm 119:105).\n\n## Core Doctrines (10 minutes)\nBreak these down on the board with quick doodles (bread for manna, serpent on pole, etc.) to keep it visual. Here are 4 key truths from this week's study, straight from the scriptures and prophets:\n\n1. **The Old Testament testifies of Jesus Christ as the Bread of Life.** Look for symbols like manna: “I am the bread of life” (John 6:35; see Exodus 16:4, 11–15). Or the sacrificial lamb (Exodus 12:3–5; John 1:29), brass serpent (Numbers 21:4–10; John 3:14), and Jonah (Jonah 1:4–17; Matthew 12:38–41). Elder Dale G. Renlund said to “remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98).\n\n2. **Jesus Christ is Jehovah in the Old Testament.** President Dallin H. Oaks taught: “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (“The Teachings of Jesus Christ,” Liahona, May 2023, 102). Check Exodus 3:13–15; 6:3–5—Jesus even said, “Before Abraham was, I am” (John 8:58).\n\n3. **The Lord restored plain and precious things through Joseph Smith.** Nephi saw “many plain and precious things” removed from the Bible, but God makes them known again (1 Nephi 13:21–29, 38–42). The Bible and Book of Mormon “grow together” (2 Nephi 3:12). Examples: Enoch’s Zion (Moses 7:18–19), Abraham’s council in heaven (Abraham 3:22–28).\n\n4. **The Old Testament teaches our covenant relationship with God.** God wants us as His “peculiar treasure” by covenant (Exodus 19:5). President Russell M. Nelson explains the “everlasting covenant” and the “special kind of love and mercy” we receive (Liahona, October 2022, 4–11). “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63).\n\nThese connect to *For the Strength of Youth*: Focus on Christ daily (like in \"Jesus Christ Is the Treasure\") and honor covenants (baptism, temple prep).\n\n## Interactive Activities (20-25 minutes)\nPick 2-3 based on your group's vibe—keep energy high with timers and movement.\n\n1. **Symbol Hunt Small Groups (10 minutes).** Split into 4 groups, each gets one symbol (manna, lamb, serpent, Jonah). Read the verses, draw it modern-style (e.g., manna as Insta-worthy bread truck), and share: \"What does this teach about Jesus?\" Report back. Play “Seek the Lord Early” (Children’s Songbook, 108) softly as they work—discuss how symbols pop up in youth life like FTSOY reminders.\n\n2. **Would You Rather: Jehovah Edition (8 minutes).** Whole class: \"Would you rather face Pharaoh's army trusting Jehovah (Exodus 3) or a school bully knowing Jesus is the same Lord? Why?\" Or \"Follow restored truths from Joseph Smith or stick to incomplete info online?\" Ties to why knowing Jesus as Jehovah matters. Debrief: How does this build faith like Abraham or Daniel?\n\n3. **Covenant Role-Play Scenarios (10 minutes).** Pairs act out: Peer pressuring a friend to break a promise vs. keeping a baptism covenant (Mosiah 18:10, 13). Or social media scroll tempting covenant-break vs. choosing God's \"peculiar treasure\" path (Exodus 19:5). Switch roles, then share one takeaway. Use Church video \"The Everlasting Covenant\" clip from President Nelson's talk (Gospel Library) to kick off.\n\n## Real-Life Application (10 minutes)\nThe Old Testament isn't dusty history—it's your playbook for now. Facing peer pressure to cheat on a test? Spot Jesus as the lamb who takes away sin (Exodus 12:3–5; John 1:29)—choose integrity like ancient covenant-keepers. Social media drama? Covenants bring God's \"special kind of love and mercy\" (Nelson, Liahona, Oct. 2022)—log off and journal symbols of Christ like manna for daily strength. Dating standards or school stress? Knowing Jesus is Jehovah (Oaks, Liahona, May 2023) means He's the same voice guiding your choices today. Prep for missions by hunting restored truths (Moses 7)—they'll fuel your testimony. Check *For the Strength of Youth* mag this month for covenant tips.\n\n## Testimony Moment (5-10 minutes)\nAs we wrap, think of one symbol or covenant truth that hit home today. I love how the Old Testament shows God moving in messy lives like ours—Abraham's family joys and fights, Hannah's faith amid uncertainty. It reminds me Jesus is right here, as Jehovah, lighting our path (Psalm 119:105). Who's feeling that? Share quick if you want. Your challenge: This week, pick one way to spot Jesus in the Old Testament (read a symbol verse daily) or honor a covenant (like family prayer). Act on it, then text a friend your \"aha\" moment. Watch Him show up in your life—He always does.\n\n*(Word count: 812)*",
  "generated_timestamp": "2026-01-11 18:04:22",
  "source_week_file": "cfm_2026_week_01.json"
}