{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "audience": "adult",
  "word_count": 1063,
  "character_count": 6951,
  "content": "# Come, Follow Me Study Plan: Week 3 (January 12–18)  \n**Genesis 1–2; Moses 2–3; Abraham 4–5**\n\n## Weekly Overview\nThese sacred accounts in Genesis 1–2, Moses 2–3, and Abraham 4–5 reveal the majestic Creation performed by Heavenly Father through His Only Begotten Son, Jesus Christ, transforming an earth that was “without form, and void” and “empty and desolate” (Genesis 1:2; Abraham 4:2). They teach profound truths about our divine origins, including being created in God’s image, the eternal nature of marriage between man and woman, our stewardship over His creations, and the sanctification of the Sabbath day. In our modern world of chaos, these principles remind us that Heavenly Father and Jesus Christ continue Their creative work in our lives, filling emptiness with life and helping us become exalted beings like Them (see Genesis 1:26).\n\n## Doctrinal Key Points\n1. **Heavenly Father and Jesus Christ are the Creators**: “By mine Only Begotten I created these things” (Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25). These verses emphasize Jesus Christ’s role in organizing the earth from unformed matter, revealing God’s power to bring light and order from darkness.\n   \n2. **We are created in God’s image and likeness**: “God said, Let us make man in our image, after our likeness” (Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27). This truth affirms our divine potential as male and female, countering negative self-perceptions and inviting us to cherish our sacred bodies (see Russell M. Nelson, “Your Body: A Magnificent Gift to Cherish,” *Liahona*, Aug. 2019, 50–55).\n\n3. **Marriage between man and woman is ordained of God**: Adam and Eve were “joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18; see Russell M. Nelson, “Lessons from Eve,” *Ensign*, Nov. 1987, 87).\n\n4. **We are stewards over God’s creations**: “Be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over … every living thing that moveth upon the earth” (Genesis 1:28; Moses 2:28; Abraham 4:28; see Doctrine and Covenants 59:16–21; 104:13–18; Gérald Caussé, “Our Earthly Stewardship,” *Liahona*, Nov. 2022, 57–59).\n\n5. **God blessed and sanctified the Sabbath day**: “And on the seventh day God ended his work which he had made; and he rested on the seventh day, and sanctified it” (Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3; see Doctrine and Covenants 59:9–13).\n\n6. **Natural tendencies must yield to divine potential**: Insights from these Creation accounts pair with Mosiah 3:19 and Ether 12:27, teaching that being in God’s image does not mean all thoughts or desires are approved but requires becoming humble and perfect through Christ.\n\n## Personal Study Guide\n**Day 1: Creation’s Majesty (Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25)**  \nRead these verses outdoors among God’s creations or while listening to “All Creatures of Our God and King” (*Hymns*, no. 62). Reflect: What do they teach about Heavenly Father, Jesus Christ, the world, and yourself? Cross-reference: Doctrine and Covenants 101:32–34.\n\n**Day 2: In God’s Image (Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27)**  \nPonder: How does being created in God’s image affect how you see yourself and others? Watch “God’s Greatest Creation” (Gospel Library) and note how Heavenly Father wants you to feel about your body. Cross-reference: “Your body is sacred,” *For the Strength of Youth*, 22–29; Mosiah 3:19; Ether 12:27.\n\n**Day 3: Eternal Marriage (Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18)**  \nStudy these passages. Reflect: How can you treat marriage with the sacredness God intends? Cross-reference: 1 Corinthians 11:11; “The Family: A Proclamation to the World” (Gospel Library).\n\n**Day 4: Stewardship Responsibilities (Genesis 1:28; Moses 2:28; Abraham 4:28)**  \nRead and consider your duties toward God’s creations. Reflect: What do these suggest about caring for the earth? Cross-reference: Doctrine and Covenants 59:16–21; 104:13–18; “Environmental Stewardship and Conservation,” Gospel Library.\n\n**Day 5: The Sabbath Sanctified (Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3)**  \nPonder what makes the Sabbath “blessed” for you. Watch “The Sabbath Is a Delight” (Gospel Library). Cross-reference: Doctrine and Covenants 59:9–13.\n\n**Day 6: Synthesis and Self-Reflection**  \nReview Genesis 1–2. Complete: “Because I know I am created in God’s image, I choose to…” Cross-reference: Russell M. Nelson, “Lessons from Eve.”\n\n**Day 7: Testimony and Sharing**  \nRe-read key verses (e.g., Genesis 1:26–28). Share pictures of creations with your testimony via text or social media.\n\n## Group Discussion Ideas\n1. What stands out about Jesus Christ’s role in the Creation from Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25? How does this deepen your appreciation for Him?\n2. How has knowing you are created in God’s image (Genesis 1:26–27) helped during times of self-doubt? Share an experience.\n3. In what ways do Mosiah 3:19 and Ether 12:27 clarify what it means to be in God’s likeness?\n4. How can we honor the sacredness of marriage as depicted in Genesis 2:18–25 and Abraham 5:14–18?\n5. What responsibilities toward God’s creations feel most relevant today (Genesis 1:28; Doctrine and Covenants 104:13–18)? Share a personal action.\n6. What makes the Sabbath a delight for you (Genesis 2:2–3)? How has keeping it holy blessed your life?\n7. President Nelson taught of the human body as a “magnificent gift to cherish.” How does this truth counter worldly messages?\n8. How do these Creation accounts show God’s ongoing work in our lives amid chaos?\n\n## Application Challenges\n1. Spend time daily reverencing one of God’s creations (e.g., watch a sunset), then express gratitude in prayer or journaling, honoring your stewardship (Genesis 1:28; Doctrine and Covenants 59:16–21).\n2. Choose one way to treat your body as sacred this week—perhaps reviewing *For the Strength of Youth* (22–29)—and complete: “Because I am created in God’s image, I choose to…” (Genesis 1:26–27).\n3. Plan a Sabbath activity that feels “blessed,” like family worship or service, distinct from other days (Genesis 2:2–3; “The Sabbath Is a Delight”).\n4. Discuss eternal marriage principles from “The Family: A Proclamation to the World” with a spouse, family member, or friend, strengthening relationships (Genesis 2:18–25).\n\n## Testimony Builder\nThese Creation accounts testify of Jesus Christ as the divine organizer under the Father’s direction, inviting us to see ourselves as His cherished handiwork with eternal potential. Through the Restoration, we gain fuller light on our premortal council, divine image, and covenants that echo Eden’s truths, including temple marriage. Ponder how Christ’s creative power is at work in you today—transforming voids into glory—and record what the Spirit whispers about your place in His plan.\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-11 18:33:32",
  "source_week_file": "cfm_2026_week_03.json"
}