{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "younger-primary",
  "word_count": 541,
  "character_count": 3209,
  "content": "# Old Testament Week 1: Jesus is in Old Testament Stories!\n\n## Lesson Overview (for the teacher)\nThis lesson teaches little ones that Jesus Christ shows up in Old Testament symbols and stories, like manna and a shepherd, so they feel excited to find Him this year.\n\n## Wiggle Activity (2-3 minutes)\n**Happy March Time**  \nMarch around the room while singing \"If You're Happy and You Know It\" with claps, stomps, and jumps. Yell \"Jesus loves us!\" at the end. Gets wiggles out fast!\n\n## Simple Scripture\n**\"The Lord is my shepherd.\" (Psalm 23:1)**  \nSay it together 3 times. Make motions: Point up for \"Lord,\" hug self for \"my,\" pat head like petting a sheep for \"shepherd.\" Sing it to \"Twinkle Twinkle\" tune.\n\n## Main Activities (15 minutes total)\n\n### 1. Manna Surprise! (Object Lesson, 4 minutes)  \n**Materials:** Soft bread pieces or crackers (one per child).  \n**Steps:** 1. Hold up bread: \"In Old Testament, God sent bread from heaven called manna!\" 2. Give each child a piece to touch and nibble. 3. Say, \"Jesus is our Bread of Life too! (John 6:35).\"  \n**What to say:** \"Yum! God feeds us like He fed His people. Jesus is our special bread from heaven. Eat and smile for Jesus!\"\n\n### 2. Find Jesus Game! (Games, 4 minutes)  \n**Materials:** Picture cards (lamb, bread, serpent on stick—draw simply or print). Hide 3 around room.  \n**Steps:** 1. Hide cards before class. 2. Say \"Ready, find Jesus helpers!\" Kids hunt and bring back. 3. Cheer for each: \"Lamb like Jesus! Bread like Jesus!\" (Exodus 12:3–5; John 1:29).  \n**What to say:** \"Jesus hides in stories like a treasure hunt! Go find Him—whoopee!\"\n\n### 3. Shepherd Sheep Craft (Hands-On Crafts, 4 minutes)  \n**Materials:** Paper plates, crayons, stickers (sheep faces).  \n**Steps:** 1. Give plates. 2. Kids draw/color sheep and write/draw \"Jesus is my shepherd.\" 3. Stick on room wall.  \n**What to say:** \"Color your sheep! Jesus watches us like a shepherd. (Psalm 23). Take it home to show families!\"\n\n### 4. Promise March (Music & Movement, 3 minutes)  \n**Materials:** None.  \n**Steps:** 1. March in circle holding hands. 2. Chant \"I promise to follow Jesus!\" with jumps. 3. Stop and high-five.  \n**What to say:** \"God makes promises with us, like in Old Testament! March and promise: 'I will find Jesus!'\"\n\n## Picture Time\nShow **The Prophet Isaiah Foretells Christ’s Birth** by Harry Anderson (Gospel Art Book, picture of Isaiah writing about baby Jesus). Ask: \"What baby do you see? Who is coming? How does it make you happy?\" Point to baby Jesus.\n\n## Song\n**\"Seek the Lord Early\" (Children’s Songbook, 108)**  \nSing with actions: Reach high for \"seek,\" clap for \"early,\" wiggle like lambs for \"find Him.\"\n\n## Snack Idea\nCrackers or bread bites—\"Manna from heaven! Jesus is our Bread of Life (John 6:35). Thank Heavenly Father!\"\n\n## Testimony Moment\n\"Hold hands. I know Jesus is in Old Testament stories and loves each of you so much.\" Invite: \"Say 'Jesus loves me!' Hug a friend.\"\n\n## Teacher Survival Tips\n1. Set a timer for each activity—kids love the \"beep go!\" signal.  \n2. For wiggles, add surprise hugs or \"freeze like sheep!\"  \n3. If a child disrupts, whisper \"Help me find Jesus?\" and give a job like card holder. Short and sweet wins!",
  "generated_timestamp": "2026-01-11 18:05:00",
  "source_week_file": "cfm_2026_week_01.json"
}