{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "adult",
  "word_count": 1152,
  "character_count": 7002,
  "content": "# Come Follow Me Study Plan for Adults: December 29–January 4  \n**Introduction to the Old Testament**\n\n## Weekly Overview\nAs we embark on studying the Old Testament this year, we are invited to explore one of the oldest collections of sacred writings in the world, filled with both challenges and profound spiritual treasures. These ancient texts, though rooted in a culture vastly different from ours, reveal universal human experiences—faith, doubt, joy, and struggle—and consistently testify of Jesus Christ as the central figure of God’s plan. This introductory week sets the tone for our journey by focusing on how the Old Testament points us to the Savior, restores plain and precious truths through the Prophet Joseph Smith, and teaches us about our covenant relationship with God. In a world seeking direction, these scriptures can truly be “a lamp unto [our] feet, and a light unto [our] path” (Psalm 119:105).\n\n## Doctrinal Key Points\n1. **The Old Testament Testifies of Jesus Christ** - The scriptures are replete with symbols and prophecies of the Savior, such as manna (Exodus 16:4, 11–15; John 6:35), the sacrificial lamb (Exodus 12:3–5; John 1:29), and the brass serpent (Numbers 21:4–10; John 3:14). These teach us of His role as our sustenance, sacrifice, and healer.\n2. **Jesus Christ Is Jehovah** - President Dallin H. Oaks taught, “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). This truth deepens our understanding of Christ’s premortal role (see Exodus 3:13–15; John 8:58–59).\n3. **Symbols Bear Record of Christ** - As taught in Moses 6:63, “All things are created and made to bear record of me.” Focusing on Christ in the Old Testament brings meaning and strengthens faith.\n4. **Restoration of Plain and Precious Truths** - Through Joseph Smith, the Lord restored vital truths lost from the Bible, such as accounts of Enoch’s Zion (Moses 7:18–19) and Abraham’s vision of the premortal council (Abraham 3:22–28), as foretold in 1 Nephi 13:21–29.\n5. **Covenants Define Our Relationship with God** - The Old Testament narrates God’s desire to make us His “peculiar treasure” through covenants (Exodus 19:5), a theme emphasized by President Russell M. Nelson in “The Everlasting Covenant” (Liahona, Oct. 2022, 4–11).\n6. **The Old Testament Illuminates the Gospel** - Despite cultural differences, the experiences of ancient prophets like Abraham and Hannah mirror our own, showing how God works in our lives through faith and repentance (Psalm 119:105, 140).\n\n## Personal Study Guide\n**Day 1: Introduction to the Old Testament**  \n- Read: “Introduction to the Old Testament” in Come, Follow Me: 2026  \n- Reflect: How do I feel about studying the Old Testament this year? What do I hope to gain?  \n- Cross-Reference: Psalm 119:105, 140  \n\n**Day 2: Jesus Christ in the Old Testament**  \n- Read: Exodus 16:4, 11–15; John 6:35; John 1:29  \n- Reflect: How do symbols like manna and the sacrificial lamb help me see Christ’s role in my life?  \n- Cross-Reference: Elder Dale G. Renlund, “Jesus Christ Is the Treasure” (Liahona, Nov. 2023, 98)  \n\n**Day 3: Jesus Christ as Jehovah**  \n- Read: Exodus 3:13–15; John 8:58–59  \n- Reflect: Why is it significant to know that Jesus Christ spoke as Jehovah in the Old Testament?  \n- Cross-Reference: President Dallin H. Oaks, “The Teachings of Jesus Christ” (Liahona, May 2023, 102)  \n\n**Day 4: Symbols of Christ**  \n- Read: Moses 6:63; Numbers 21:4–10; John 3:14  \n- Reflect: How can I train my eyes to see Christ in all things as I study the scriptures?  \n- Cross-Reference: “Types or Symbols of Christ,” Guide to the Scriptures  \n\n**Day 5: Restoration of Truths**  \n- Read: 1 Nephi 13:21–29; Moses 7:18–19  \n- Reflect: How do restored truths, like Enoch’s story, strengthen my testimony of the Prophet Joseph Smith?  \n- Cross-Reference: “Book of Abraham,” Gospel Topics, Gospel Library  \n\n**Day 6: Covenant Relationship with God**  \n- Read: Exodus 19:5; Jeremiah 31:31–34  \n- Reflect: What does it mean to be God’s “peculiar treasure” through covenants?  \n- Cross-Reference: President Russell M. Nelson, “The Everlasting Covenant” (Liahona, Oct. 2022, 4–11)  \n\n**Day 7: Personal Reflection**  \n- Read: Psalm 23; Isaiah 53:3–9  \n- Reflect: How do these passages about the Savior touch my heart? What can I do to draw closer to Him this year?  \n- Cross-Reference: “Seek the Lord Early,” Children’s Songbook, 108  \n\n## Group Discussion Ideas\n1. What feelings or expectations do you have as we begin studying the Old Testament this year?  \n2. How have you seen Jesus Christ in the symbols or stories of the Old Testament, such as manna or the brass serpent?  \n3. Why is it meaningful to know that Jesus Christ is Jehovah, the God of the Old Testament?  \n4. How do the restored truths through Joseph Smith, like the Book of Moses, enhance your understanding of the gospel?  \n5. In what ways have covenants shaped your relationship with God, as seen in the Old Testament theme of being a “peculiar treasure”?  \n6. How can focusing on Christ as we study the Old Testament bring greater meaning to our personal challenges?  \n7. What experiences have you had that mirror the faith, struggles, or repentance of Old Testament figures?  \n8. How can we help each other stay motivated to find spiritual nourishment in these ancient texts throughout the year?  \n\n## Application Challenges\n1. **Seek Christ Daily** - Each day this week, identify one way a scripture or symbol points to Jesus Christ, and write in your journal how it strengthens your faith in Him, as encouraged by Elder Dale G. Renlund: “Remember and always focus on Jesus Christ” (Liahona, Nov. 2023, 98).  \n2. **Covenant Reflection** - Spend time pondering your baptismal and other covenants, asking how you can better live as God’s “peculiar treasure” (Exodus 19:5), and act on one specific prompting.  \n3. **Share a Symbol** - Discuss with a family member or friend a symbol of Christ from the Old Testament (like the sacrificial lamb) and how it deepens your appreciation for His Atonement.  \n4. **Study Restored Truths** - Read a section of the Book of Moses or Abraham this week, noting in your journal how these “plain and precious things” (1 Nephi 13:29) enrich your understanding of God’s plan.  \n\n## Testimony Builder\nAs we begin this journey through the Old Testament, I’m filled with gratitude for the way these ancient writings point us directly to Jesus Christ, the center of all scripture and the heart of the Restoration. His voice as Jehovah echoes through these pages, His symbols surround us, and His covenants bind us to Him. I invite you to reflect on how seeing Christ in the Old Testament can draw you closer to Him, knowing that through the Prophet Joseph Smith, many plain and precious truths have been restored to guide us back to our Savior. My heart rejoices in the promise that as we seek Him in these scriptures, we will find His light guiding our path.",
  "generated_timestamp": "2025-12-31 23:41:53",
  "source_week_file": "cfm_2026_week_01.json"
}