{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "youth",
  "word_count": 982,
  "character_count": 5589,
  "content": "# Come Follow Me Study Plan for Youth: Week 1 (December 29–January 4) - Introduction to the Old Testament\n\nHey, youth! Get ready to dive into the Old Testament this year with a fresh perspective and a whole lot of spiritual power! This ancient book isn’t just history—it’s a treasure map pointing straight to Jesus Christ and showing us how to live as His covenant people in a crazy, fast-paced world. Let’s unpack it together with energy, fun, and faith!\n\n## Youth Kickoff\nWhy does the Old Testament matter to you right now? Think of it like an epic movie trailer—full of drama, heroes, and a powerful story of God’s love that connects directly to your life today. How can ancient prophets like Abraham or Hannah help you with school stress or friend drama? Let’s find out!\n\n## Core Truths\nHere are the big ideas from this week’s intro to the Old Testament, made simple and tied to your life with principles from *For the Strength of Youth*:\n\n1. **The Old Testament Testifies of Jesus Christ** - It’s packed with symbols of the Savior, like manna (Exodus 16:4; John 6:35, “I am the bread of life”) and the brass serpent (Numbers 21:9; John 3:14). Look for Him as you read! (*FSY Principle: Follow the Savior*)\n2. **Jesus Christ Is Jehovah** - He’s the “Lord” speaking in these scriptures, the same Savior we know today (John 8:58, “Before Abraham was, I am”). Knowing this makes the Old Testament personal. (*FSY Principle: Trust in the Lord*)\n3. **God Restores Truth Through Joseph Smith** - “Plain and precious things” were brought back through the Book of Moses and Book of Abraham (1 Nephi 13:28-29). These truths help us understand God’s plan. (*FSY Principle: Seek Truth*)\n4. **Covenants Connect Us to God** - The Old Testament shows God making us His “peculiar treasure” through covenants (Exodus 19:5). Your baptism and future temple covenants are part of this story! (*FSY Principle: Make Covenants*)\n5. **Scripture Lights Our Path** - As the psalmist said, “Thy word is a lamp unto my feet, and a light unto my path” (Psalm 119:105). The Old Testament can guide your choices every day. (*FSY Principle: Choose to Follow God*)\n\n## Daily Dive\nA 7-day plan to explore the Old Testament intro with quick reads, activities, and questions to connect it to your world:\n\n- **Day 1: Jesus in the Old Testament** - Read John 6:35. How is Jesus like “bread” in your life? Journal a time He’s helped you feel “fed” spiritually.\n- **Day 2: Jehovah Is Jesus** - Read Exodus 3:14 and John 8:58. Text a friend: “Did you know Jesus was called ‘I Am’ in the Old Testament? How cool is that?” Discuss.\n- **Day 3: Symbols of Christ** - Read Numbers 21:4-9. How does the brass serpent point to Jesus? Draw a quick sketch of a symbol that reminds you of Him.\n- **Day 4: Restored Truths** - Read 1 Nephi 13:28-29. Why do “plain and precious things” matter to your future goals? Write one question you hope the Old Testament answers.\n- **Day 5: Covenant Power** - Read Exodus 19:5. How do covenants (like baptism) make you feel special to God? Share a thought with a family member.\n- **Day 6: Scripture as Light** - Read Psalm 119:105. Make a meme about scripture being a “lamp” for tough choices at school and post it in a group chat.\n- **Day 7: Focus on Christ** - Read Elder Renlund’s quote from “Jesus Christ Is the Treasure” (Liahona, Nov. 2023, 98). How can you focus on Jesus this week? Set a goal.\n\n## Activity Ideas\nSpice up your quorum or class meetings with these interactive ideas:\n1. **Symbol Scavenger Hunt** - Split into teams and find Old Testament symbols of Christ (like manna or the lamb) using Gospel Library. Share what each teaches about Jesus.\n2. **“Seek the Lord Early” Sing-Along** - Play “Seek the Lord Early” from the *Children’s Songbook* (p. 108) or a Youth Music track. Discuss how music helps us seek Christ.\n3. **Covenant Role-Play** - Act out making a covenant with God (like Abraham might have). Talk about how keeping promises feels with friends vs. with God.\n4. **Video Spotlight** - Watch a short Church video on the Old Testament from the Gospel Library (search “Old Testament overview”). Discuss one thing that surprised you.\n5. **Service Prep** - Plan a simple service project for the year (like helping a neighbor) to live as God’s “peculiar treasure” (Exodus 19:5). Brainstorm ideas together.\n\n## Real-Life Connections\nLet’s apply the Old Testament to your challenges today:\n- **Social Media** - When online drama hits, remember Psalm 119:105—let scripture light your path. Post something uplifting instead of arguing.\n- **Peer Pressure** - Think of Daniel’s courage in the Old Testament. Stand up for your beliefs, even if you’re the only one, just as he did.\n- **Missionary Prep** - Start seeing Jesus in every story (John 6:35). Practice sharing how Old Testament symbols point to Him—it’s a powerful way to teach on a mission.\n- **School Stress** - Covenants remind you God’s got your back (Exodus 19:5). Pray for strength before a big test, knowing you’re part of His family.\n\n## Faith Boost\nI’m so excited to start this Old Testament journey with you! I’ve seen in my own life how these ancient stories reveal Jesus Christ’s love and power, and I know they’ll strengthen your faith too. Take a moment to share with a friend or in class: What’s one way you’ve felt God guiding you lately, like a “lamp unto your feet”? This week, I challenge you to pick one Core Truth (like looking for Jesus in scripture) and act on it—maybe by reading with a new focus or sharing a verse with someone. Let’s see how God moves in our lives as we study His word together!",
  "generated_timestamp": "2025-12-31 23:42:24",
  "source_week_file": "cfm_2026_week_01.json"
}