{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "younger-primary",
  "word_count": 485,
  "character_count": 2793,
  "content": "# Week 2: I Am a Child of God (Moses 1; Abraham 3)\n\n## Lesson Overview\nHeavenly Father loves us and calls us His children (Moses 1:4). We are special spirits who lived with Him before we came to earth (Abraham 3:22–28).\n\n## Wiggle Activity (2-3 minutes)\n**Happy March**: March around the room while singing \"If You're Happy and You Know It\" with claps, stomps, and jumps. Say, \"Heavenly Father made our bodies to move and be happy!\"\n\n## Simple Scripture\n\"Thou art my son\" (Moses 1:4).  \n*(Point to self on \"thou,\" hug self on \"my,\" pat head on \"son.\") Say it 3 times fast, then slow.*\n\n## Main Activities (15 minutes total)\n\n### 1. Mirror Smiles (Object Lesson, 3 minutes)\n**Materials**: Small hand mirrors (or phone screens).  \n**What to do**: 1. Give each child a mirror. 2. Look at reflection and smile big. 3. Say together, \"I am a child of God!\"  \n**What to say**: \"God told Moses, 'Thou art my son' (Moses 1:4). Look—you are Heavenly Father's child too! Smile at His happy child.\"\n\n### 2. Spirit Freeze Dance (Music & Movement, 4 minutes)\n**Materials**: None.  \n**What to do**: 1. Play soft music or clap a beat. 2. Dance like twinkly spirits from heaven (Abraham 3:22). 3. Freeze when music stops and say, \"I lived with God before!\"  \n**What to say**: \"Before earth, we were spirits with Heavenly Father (Abraham 3:22–28). Dance like happy spirits He loves!\"\n\n### 3. Child of God Hearts (Hands-On Crafts, 4 minutes)\n**Materials**: Paper hearts, crayons, stickers.  \n**What to do**: 1. Color heart. 2. Draw smiley face or stick figure self. 3. Stick on \"child of God.\"  \n**What to say**: \"Heavenly Father says we are His children (Moses 1:4). Make a heart to show you are special to Him.\"\n\n### 4. Say No to Tricks (Physical Activities, 4 minutes)\n**Materials**: None.  \n**What to do**: 1. Stand in circle. 2. Pretend Satan whispers (shake head no). 3. Jump back and say, \"Get thee hence, Satan\" (Moses 1:13).  \n**What to say**: \"Moses said no to Satan (Moses 1:12–26). Jump away from tricks and choose God's way!\"\n\n## Picture Time\nShow *Moses Sees Jehovah* by Joseph Brickey (Gospel Art Book). Ask: \"Who is talking to Moses? How does Moses look? What does God say to him?\"\n\n## Song\n\"I Am a Child of God\" (Children's Songbook, 2–3). *Point up to heaven on \"Father,\" hug self on \"child,\" march on \"lead me.\"*\n\n## Snack Idea\nHeart-shaped crackers. \"These hearts remind us Heavenly Father loves His children!\"\n\n## Testimony Moment\n\"Heavenly Father calls you His child (Moses 1:4). I know He loves you.\" Invite: Fold arms and say together, \"I am a child of God!\"\n\n## Teacher Survival Tips\n1. Use a timer for each activity—kids love the \"beep\" surprise!  \n2. If someone gets upset, give a quick hug and whisper, \"Heavenly Father loves you.\"  \n3. Too wiggly? Add extra jumps between activities.",
  "generated_timestamp": "2026-01-11 18:06:24",
  "source_week_file": "cfm_2026_week_02.json"
}