{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "younger-primary",
  "word_count": 602,
  "character_count": 3494,
  "content": "# Old Testament Lesson: Jesus is in the Old Testament!\n\n## Lesson Overview\nWe will help the children feel excited about the Old Testament by discovering that Jesus Christ is in its stories and symbols, like bread and a lamb. They will see Heavenly Father’s love through simple symbols that point to Jesus.\n\n## Teacher Lesson (8-10 minutes)\n**Get Attention (1-2 minutes):** Hold up a loaf of bread or cracker. \"Look at this yummy bread! In the Old Testament, God gave manna like bread to His people (Exodus 16:4, 11–15). It teaches about Jesus!\"\n\n**Simple Story (3-4 minutes):** Show pictures of manna, lamb, and baby Jesus. \"Long ago, God sent bread from heaven called manna to feed His people (Exodus 16). He asked for a lamb without spot for Passover (Exodus 12:3–5). These show Jesus is the Bread of Life (John 6:35) and Lamb of God (John 1:29). Jesus is in the Old Testament!\"\n\n**Big Idea (2-3 minutes):** Repeat 3 times: \"Jesus is in the Old Testament! Jesus is in the Old Testament! Jesus is in the Old Testament!\" Point to pictures each time.\n\n**We Can Do This (1-2 minutes):** \"We can look for Jesus in Old Testament stories, like bread and lamb. When we read, say, 'That's Jesus!'\"\n\n## Wiggle Activity (2-3 minutes)\n**Marching Manna March:** Play soft music or clap. Children march around the room pretending to pick up manna bread from the ground. Say, \"God gives us Jesus like bread! Pick it up and eat!\"\n\n## Simple Scripture\n\"Jesus is the Bread of Life\" (John 6:35, 48).  \nRepeat 3 times together. Hand motion: Hold arms like a big loaf of bread, then pat tummy happily.\n\n## Fun Activities (15 minutes total)\n**1. Object Lesson: Manna Bread (3 minutes) - Object Lessons**  \n- Hold bread or crackers. Pretend to rain \"manna\" from above.  \n- Materials: Bread/crackers, basket.  \n- Say: \"God sent manna bread! It shows Jesus feeds us always (Exodus 16:4). Eat and say, 'Thank you, Jesus!'\"  \n\n**2. Game: Lamb Hide-and-Seek (4 minutes) - Games**  \n- Hide lamb picture cards around room. Children find and bring back.  \n- Materials: Printed lamb pictures (or draw).  \n- Say: \"Find the lamb like in Passover (Exodus 12:3–5)! It points to Jesus, our Lamb (John 1:29). Yay, you found Jesus!\"  \n\n**3. Hands-On Craft: Jesus Bread Hearts (4 minutes) - Hands-On Crafts**  \n- Children draw or stick hearts on paper bread shape.  \n- Materials: Paper bread cutouts, crayons, heart stickers.  \n- Say: \"Draw ways Jesus is your bread—like love! This shows Jesus in Old Testament (John 6:35).\"  \n\n**4. Music & Movement: Isaiah Baby Dance (4 minutes) - Music & Movement**  \n- Dance and sway like holding baby Jesus.  \n- Materials: None.  \n- Say: \"Isaiah saw baby Jesus! Dance and sing: 'A child is born!' (Isaiah 9:6). Jesus is here!\"\n\n## Picture Time\nShow *The Prophet Isaiah Foretells Christ’s Birth* by Harry Anderson (Gospel Art Book). Ask: \"What baby do you see? Who is He? How does it make you happy?\"\n\n## Song\n“Seek the Lord Early” (Children’s Songbook, 108). Actions: Point up for \"seek,\" march for \"early,\" hug self for \"find Him.\"\n\n## Snack Idea\nCrackers or bread pieces—\"Manna from heaven! Thank Jesus for being our Bread (John 6:35).\"\n\n## Testimony Moment\n\"I know Jesus is in the Old Testament, showing His love for us.\" Invite: \"Say with me: 'Jesus loves me!'\"\n\n## Teacher Survival Tips\n1. If a child wanders, gently guide with a hug and back to activity.  \n2. Use timer for 3-5 minutes per fun activity to keep energy high.  \n3. If short on time, skip one activity and add extra marching.",
  "generated_timestamp": "2026-01-11 18:31:49",
  "source_week_file": "cfm_2026_week_01.json"
}