{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "audience": "youth",
  "word_count": 717,
  "character_count": 4638,
  "content": "**Lesson Title: Created in God's Image—Our Divine Potential and Purpose**\n\n**Opening Connection**  \nGather the youth and ask: \"Have you ever felt like your life was a bit chaotic—like everything was 'without form, and void' (Genesis 1:2; Abraham 4:2)? Maybe with school pressures, friendships, or figuring out who you are. The Creation story reminds us that God and Jesus Christ are master Creators who bring order, light, and life out of emptiness. Today, we'll discover how They created the world—and you—in Their image, with divine potential.\"\n\n**Scripture Discovery**  \nDivide into pairs or small groups for interactive study. First, have them read Genesis 1:1–25; Moses 2:1–25; and Abraham 4:1–25. Provide colored pencils for marking: underline what these teach about Heavenly Father, Jesus Christ (\"By mine Only Begotten I created these things\"), the world, and ourselves. In partners, discuss: \"Why does God want us to know these things?\" (Come, Follow Me, Week 3).  \n\nNext, do a compare-and-contrast treasure hunt on Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27. Assign groups one verse set; have them hunt for words like \"image,\" \"likeness,\" \"male and female.\" Share findings: \"Ponder what it means to be created in God’s image or likeness\" (Come, Follow Me, Week 3). Finally, read Genesis 1:28; Moses 2:28; Abraham 4:28 together—mark phrases about dominion and replenishing the earth.\n\n**Core Gospel Principles**  \n1. **Jesus Christ created the heavens and earth under the Father's direction** (Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25). This reveals God's power to organize chaos into beauty, showing His ongoing creative work in our lives.  \n2. **We are created in God's image and likeness**, male and female, with sacred bodies and divine potential (Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27). As President Russell M. Nelson teaches in “God’s Greatest Creation” (Gospel Library), our bodies are \"miraculous,\" not to be treated casually but cherished.  \n3. **We have a stewardship to care for God's creations**, including the earth and our bodies (Genesis 1:28; Moses 2:28; Abraham 4:28; Doctrine and Covenants 59:16–21).  \n4. **God sanctified the Sabbath as a holy day of rest and renewal** (Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3; Doctrine and Covenants 59:9–13).\n\n**Engaging Activities**  \n**Activity 1: Image of God Puzzle (Creative Expression, 10 minutes)**. In small groups, have youth draw a simple human figure, then cut it into a puzzle (inspired by Teaching in the Savior’s Way, p. 32). As they reassemble, discuss: \"Because I know I am created in God’s image, I choose to...\" (Come, Follow Me, Week 3). Connect to \"Your body is sacred\" (For the Strength of Youth, pp. 22–29) and counter ideas from Mosiah 3:19 or Ether 12:27 that we don't need to improve.  \n\n**Activity 2: Stewardship Scenarios (Case Study Discussions, 10 minutes)**. Present teen-relevant cases: \"A friend posts body-negative comments online—what do you say, knowing we're in God's image (Genesis 1:27)?\" or \"How can you care for God's creations at school or home (Genesis 1:28; Doctrine and Covenants 104:13–18)?\" Groups problem-solve and share.  \n\n**Activity 3: Sabbath Role-Play (10 minutes)**. Pairs role-play explaining to a friend why they choose holy Sabbath activities (Genesis 2:2–3; \"The Sabbath Is a Delight\" video, Gospel Library). Builds on self-image by showing rest honors our divine nature.\n\n**Life Application Bridge**  \nHelp youth bridge to their world: In school, where body image pressures abound, remember you're \"created in God’s image\" (Genesis 1:26–27)—choose actions that honor your sacred body, unlike worldly messages (President Nelson, “Your Body: A Magnificent Gift to Cherish,” Liahona, Aug. 2019). Care for creations through simple acts like picking up litter or kind words (Doctrine and Covenants 59:16–21). In family dynamics, honor marriage as \"ordained of God\" between man and woman (Genesis 2:18–25; “The Family: A Proclamation to the World”). Use the Sabbath for renewal amid busy schedules, making it \"a delight.\"\n\n**Unified Closing**  \nWe've seen how God transforms chaos into creation—and does the same for us, molding us into His likeness. Your challenge: This week, complete one sentence: \"Because I am created in God’s image, I choose to...\" (e.g., treat my body sacredly, care for a creation, keep the Sabbath holy). Act on it and share next week. I know God sees your divine potential; trusting this has filled my own life with purpose. Invite 1–2 youth to share a quick insight—what does being in His image mean to you? Close with prayer committing to the challenge.\n\n(Word count: 812)",
  "generated_timestamp": "2026-01-18 21:19:36",
  "source_week_file": "cfm_2026_week_03.json"
}