{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "younger-primary",
  "word_count": 652,
  "character_count": 3738,
  "content": "# I Am a Child of God!\n\n## Lesson Overview\nWe will teach little ones that they are children of God who Heavenly Father loves (Moses 1:4). This helps them feel special and know God has work for them (Moses 1:6, 39).\n\n## TEACHER LESSON (8-10 minutes)\n**Get Attention (1-2 minutes):** Hold up a big smiley face picture. Say, \"Smile big—who loves you most? Heavenly Father does!\" Have kids copy your big smile and wiggle their happy dance.\n\n**Simple Story (3-4 minutes):** Show pictures of Moses. \"Moses saw Heavenly Father and Jesus. Heavenly Father said, 'Moses, you are my son!' (Moses 1:4). Then a bad guy, Satan, came and said, 'Worship me!' (Moses 1:12). Moses said no! He prayed and said, 'Get behind me, Satan!' (Moses 1:20). Heavenly Father helped him. We lived with Heavenly Father as spirits before earth (Abraham 3:22). Now we are His children here!\"\n\n**Big Idea (2-3 minutes):** Point to each child: \"You are a child of God! (Moses 1:4). Say it with me: 'I am a child of God!' Again! Heavenly Father loves you and has work for you (Moses 1:39).\"\n\n**We Can Do This (1-2 minutes):** \"Like Moses, say no to bad things. Pray and Heavenly Father helps! Hug a friend and say, 'You are a child of God!'\"\n\n## Wiggle Activity (2-3 minutes)\n**Spirit March:** March around the room like happy spirits coming from heaven to earth (Abraham 3:22). Sing \"Twinkle Twinkle Little Star\" tune: \"I am a child of God\" while flapping arms like flying spirits. Stop and freeze when you say \"Freeze!\"\n\n## Simple Scripture\n\"I am a child of God\" (Moses 1:4).  \nSay it 3 times together. Point to your heart, then hug yourself. Clap on \"child\"!\n\n## Fun Activities (15 minutes total)\n**1. Mirror Me! (Object Lesson, 3 minutes)**  \n*What to do:* 1. Give each child a small mirror. 2. Look in mirror and smile. 3. Say together, \"I am a child of God!\" (Moses 1:4).  \n*Materials:* Small mirrors (one per child).  \n*What to say:* \"Look! Heavenly Father made you special (Moses 1:4). Smile and say it loud!\"\n\n**2. No to Satan Game (Physical Activity, 4 minutes)**  \n*What to do:* 1. Kids stand. 2. Say good choice (share toy)—jump yes! Bad choice (push friend)—shake head no and step back. 3. Like Moses (Moses 1:20).  \n*Materials:* None.  \n*What to say:* \"Moses said no to Satan (Moses 1:12–26). Jump for good choices!\"\n\n**3. God’s Kid Crafts (Hands-On Crafts, 4 minutes)**  \n*What to do:* 1. Draw your face on paper plate. 2. Add happy eyes and \"I am a child of God!\" sticker. 3. Hold up high.  \n*Materials:* Paper plates, crayons, stickers.  \n*What to say:* \"Draw you as Heavenly Father’s child (Moses 1:4). He loves your picture!\"\n\n**4. Follow the Plan Dance (Music & Movement, 4 minutes)**  \n*What to do:* 1. Sing \"I Will Follow God’s Plan\" with claps. 2. March for \"before I came,\" jump for \"plan of love.\" 3. Freeze and say \"I am a child of God!\"  \n*Materials:* None.  \n*What to say:* \"We were spirits with God’s plan (Abraham 3:22). Dance it!\"\n\n## Picture Time\nShow \"Moses Sees Jehovah\" by Joseph Brickey (detail, from bundle). Ask: \"Who is Moses talking to? How does Moses look happy? You can feel God’s love too!\"\n\n## Song\n\"I Am a Child of God\" (Children’s Songbook, 2–3). Add actions: Point up for \"Heavenly Father,\" hug self for \"child of God,\" march for \"here on earth.\"\n\n## Snack Idea\nHeart-shaped crackers. \"Hearts like God’s love for His children (Moses 1:4)!\"\n\n## Testimony Moment\n\"Heavenly Father and Jesus love you so much—you are Their child (Moses 1:4).\" Invite: \"Say 'I love Heavenly Father!' \" Give hugs.\n\n## Teacher Survival Tips\n1. Use a timer for each activity—wiggly kids love \"next fun!\"  \n2. If a child disrupts, hug and whisper \"You are a child of God—help a friend!\"  \n3. No mirrors? Use shiny spoons. Shorten if needed—more wiggles!",
  "generated_timestamp": "2026-01-11 18:33:12",
  "source_week_file": "cfm_2026_week_02.json"
}