{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "adult",
  "word_count": 940,
  "character_count": 6052,
  "content": "# Come, Follow Me Study Plan: Week 2 (January 5–11)  \n**Moses 1; Abraham 3**\n\n## Weekly Overview\nThese chapters from the Pearl of Great Price illuminate profound truths about our identity and purpose, revealed through visions to Moses and Abraham that expand beyond the Genesis account. Moses 1 provides context for the Creation by recounting Moses's encounter with God and Satan, while Abraham 3 reveals premortal councils where intelligences were organized for earthly probation. In our day, these revelations answer timeless questions: Who is God? Who are we? What is God’s work? They frame our Old Testament study with eternal perspective, helping us recognize our divine destiny amid Satan's deceptions.\n\n## Doctrinal Key Points\n1. **God declares our divine identity**: In Moses 1:4,6, the Lord tells Moses, \"thou art in the similitude of mine Only Begotten,\" contrasting sharply with Satan's message in Moses 1:12. President Russell M. Nelson taught, “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity” [worldwide devotional for young adults, May 2022]).\n   \n2. **Satan tempts with counterfeits and doubt**: After Moses's vision, Satan appears saying, \"Moses, son of man, worship me\" (Moses 1:12), offering false power. Moses resists by affirming, \"I will not\" (Moses 1:18,20–22), relying on the Lord's deliverance (Moses 1:24–26).\n\n3. **We can resist Satan through the Lord’s power**: Moses overcomes by commanding in God's name: \"Depart from me, Satan\" (Moses 1:20), and glory fills him as the Lord speaks (Moses 1:26). This shows spiritual experiences equip us against temptation.\n\n4. **God’s work is our immortality and eternal life**: Moses asks, “Tell me … why these things are so” (Moses 1:30), and the Lord replies, \"For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man\" (Moses 1:39). Jesus Christ enables both.\n\n5. **Premortal existence shapes our purpose**: Abraham sees \"the intelligences that were organized before the world was\" (Abraham 3:22), including \"one among the souls... like unto God\" as Jesus Christ (Abraham 3:24).\n\n6. **Earth life is a probation to prove us**: God chose \"noble and great ones\" to lead, saying, \"We will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them\" (Abraham 3:22–25).\n\n7. **Choices reflect eternal identity**: President Nelson added, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”), linking premortal truths to daily life.\n\n## Personal Study Guide\n**Day 1 (Moses 1:1–8)**: Read Moses beholding God and learning his identity (Moses 1:4,6). Reflect: How does knowing \"thou art in the similitude of mine Only Begotten\" change your self-view? Cross-reference President Nelson’s “Choices for Eternity” section “First: Know the truth about who you are.”\n\n**Day 2 (Moses 1:9–26)**: Study Satan's temptation and Moses's resistance (Moses 1:12–26). Journal: What counterfeits does Satan use today? How did invoking God's name help Moses? See Matthew 4:1–11; Gary E. Stevenson, “Deceive Me Not” (Liahona, Nov. 2019).\n\n**Day 3 (Moses 1:27–39)**: Ponder the vision of worlds and God's purpose (Moses 1:31–39). Ask: What distinguishes immortality from eternal life? How does Christ fulfill this? Refer to Gospel Library, “Eternal Life.”\n\n**Day 4 (Abraham 3:1–21)**: Note Abraham's astronomical vision preparing for premortal truths. Reflect: How does seeing God's order inspire awe? List truths about divine governance.\n\n**Day 5 (Abraham 3:22–26)**: Identify premortal roles (Abraham 3:22–24). Question: Why were \"noble and great ones\" chosen? Connect to your potential leadership.\n\n**Day 6 (Abraham 3:27–28)**: Focus on probation: \"We will prove them herewith\" (Abraham 3:25). Pray: How can premortal knowledge guide current choices? See Gospel Library, “Premortal Life.”\n\n**Day 7 (Review)**: Re-read Moses 1:36 and Abraham 3:22–28. Summarize insights on identity and purpose. Sing or read “I Am a Child of God” (Hymns, no. 301).\n\n## Group Discussion Ideas\n1. Compare God's words to Moses (Moses 1:4,6) with Satan's (Moses 1:12). What patterns reveal true vs. false messengers?\n2. How did Moses resist Satan (Moses 1:13,15,18,20–22,26)? Share a time you overcame temptation through the Lord.\n3. What impresses you about God's response to Moses's question (Moses 1:31–39)? How does Christ bring immortality and eternal life?\n4. From Abraham 3:22–28, list truths about premortal life. How do they affect daily decisions?\n5. President Nelson said our identity affects every choice (“Choices for Eternity”). Discuss examples from your life.\n6. How can we distinguish Satan's counterfeits today, as in Moses 1:13–18?\n7. What \"work\" does God have for us, echoing Moses 1:6 (see D&C 11:20)?\n8. Share how premortal truths (Abraham 3:24–26) strengthen your testimony of Christ.\n\n## Application Challenges\n1. **Affirm identity daily**: List choices rooted in being a child of God before other labels, as suggested in the manual. Review at day's end.\n2. **Resist counterfeits**: When tempted, pause and command as Moses did (Moses 1:20), invoking Christ's name; track successes in a journal.\n3. **Prove faithful in probation**: Identify one area to \"do all things whatsoever the Lord... shall command\" (Abraham 3:25), like service or repentance, and act this week.\n4. **Teach spontaneously**: During a meal or chore, share Moses 1:4 with family or friends, affirming, \"You are a child of God,\" and discuss its impact.\n\n## Testimony Builder\nThese visions testify that Jesus Christ, the noble and great One (Abraham 3:22–24), stands at the center of God's work to bring us eternal life (Moses 1:39). Through Joseph Smith's revelations, we glimpse our premortal valiance and earthly purpose, inviting us to live worthy of that heritage. Ponder how embracing your divine identity draws you nearer to the Savior—He who proved faithful will sustain you in your proving.",
  "generated_timestamp": "2026-01-10 22:22:36",
  "source_week_file": "cfm_2026_week_02.json"
}