{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "youth",
  "word_count": 1150,
  "character_count": 6618,
  "content": "# Come Follow Me Study Plan for Youth (Ages 12-18)  \n**Week 1: December 29–January 4 - Introduction to the Old Testament**\n\nHey, youth! Get ready to dive into the Old Testament this year with an open heart and a curious mind. This ancient book isn’t just history—it’s a treasure map pointing straight to Jesus Christ and showing us how to live as His covenant people in a crazy, fast-paced world. Let’s uncover these stories together and see how they light up our lives today!\n\n---\n\n## Youth Kickoff  \nWhy does the Old Testament matter to you right now? Think of it like an epic movie trailer—full of action, drama, and a Hero (Jesus Christ) who’s been there since the beginning. How can these ancient stories help you face modern battles like stress, doubt, or tough choices at school?\n\n---\n\n## Core Truths  \nHere are the big ideas from this week’s study, simplified for you, with scriptures and ties to *For the Strength of Youth* principles. These truths can anchor you no matter what’s going on in your life.  \n1. **The Old Testament Testifies of Jesus Christ** - It’s all about pointing to the Savior, even thousands of years before He was born. Look for Him in symbols like the manna (Exodus 16:4, “Behold, I will rain bread from heaven for you”) or the brass serpent (Numbers 21:9). *For the Strength of Youth* reminds us to “seek Jesus Christ” in all we do.  \n2. **Jesus Christ is Jehovah** - The God of the Old Testament is our Savior! President Dallin H. Oaks taught, “The scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (Liahona, May 2023, 102). This connects to trusting His guidance today.  \n3. **The Lord Restored Truths through Joseph Smith** - Plain and precious things were brought back through the Book of Mormon and other scriptures like the Book of Moses (see 1 Nephi 13:38–42). This ties to “Live the Gospel” by valuing modern revelation.  \n4. **Covenants Connect Us to God** - The Old Testament shows God making covenants with His people to make them His “peculiar treasure” (Exodus 19:5). *For the Strength of Youth* encourages us to “make and keep covenants” as a source of strength.  \n5. **God’s Word Lights Our Path** - The scriptures guide us like a lamp, as the psalmist said, “Thy word is a lamp unto my feet, and a light unto my path” (Psalm 119:105). This connects to “Choose to Be Happy” by finding peace in God’s words.  \n\n---\n\n## Daily Dive  \nHere’s a 7-day plan to explore the Old Testament intro. Each day has a quick reading, a fun activity, and a question to think about for school, friends, or your future.  \n- **Day 1: Jesus in the Old Testament** - Read John 6:35. Activity: Draw or meme a symbol of Christ (like manna as “spiritual snacks”). Question: How can Jesus “feed” you when you’re stressed at school?  \n- **Day 2: Jehovah is Jesus** - Read Exodus 3:13–15. Activity: Text a friend one cool fact about Jesus being Jehovah. Question: How does knowing Jesus was always there boost your trust in Him?  \n- **Day 3: Symbols of the Savior** - Read Numbers 21:4–9. Activity: Journal how looking to Christ “heals” you like the brass serpent. Question: What’s one struggle you can turn over to Him this week?  \n- **Day 4: Restored Truths** - Read 1 Nephi 13:21–29. Activity: Watch the Church video “The Book of Mormon and the Bible” (Gospel Library). Question: How does modern revelation help with doubts or confusion?  \n- **Day 5: Covenant Power** - Read Exodus 19:5. Activity: Write down a covenant you’ve made (like baptism) and how it helps you. Question: How can keeping promises to God help with friend drama?  \n- **Day 6: Scripture as Light** - Read Psalm 119:105. Activity: Listen to “Seek the Lord Early” (Children’s Songbook, 108) or a Youth Music song like “I Will Go and Do.” Question: How can scriptures guide a big decision you’re facing?  \n- **Day 7: Finding Christ Today** - Read Elder Renlund’s “Jesus Christ Is the Treasure” (Liahona, Nov. 2023). Activity: Share a thought on social media about finding Jesus in your life. Question: What’s one way you’ll look for Him this week?  \n\n---\n\n## Activity Ideas  \nMake quorum or class time unforgettable with these interactive ideas. Pick one or mix and match!  \n1. **Symbol Hunt Game** - Split into teams and find symbols of Christ in the Old Testament (like manna or the lamb) using Exodus 16 and John 1:29. Discuss how each points to Jesus.  \n2. **Covenant Promise Board** - Create a group poster of promises we make with God (baptism, temple) and how He blesses us back. Use Exodus 19:5 as a guide.  \n3. **Video Moment** - Watch a short Church video on the Old Testament from Gospel Library (like “Introduction to the Old Testament”). Chat about one thing that surprised or inspired you.  \n4. **Role-Play Ancient Faith** - Act out a story like Abraham’s trust in God. Discuss how his faith can inspire us to trust during tough times at school or home.  \n5. **Service Mini-Challenge** - Plan a quick service act (like texting encouragement to a friend) to show covenant love, tying to God’s promises in Jeremiah 31:31–34.  \n\n---\n\n## Real-Life Connections  \nThe Old Testament isn’t just old stories—it’s a guide for today’s challenges. Here’s how to apply it:  \n- **Social Media** - The scriptures are a “lamp” (Psalm 119:105). When online noise gets overwhelming, turn to a verse or story for clarity instead of scrolling endlessly.  \n- **Peer Pressure** - Covenants remind us we’re God’s “peculiar treasure” (Exodus 19:5). Stand out by sticking to your standards, even if friends push otherwise.  \n- **Missionary Prep** - Learning how the Old Testament points to Christ (like Jonah in Matthew 12:38–41) prepares you to teach others about Him. Practice sharing these symbols with a friend or family member.  \n- **Daily Stress** - Jesus as Jehovah (Exodus 3:14) means He’s always been there for His people. Lean on Him in prayer when school or life feels heavy.  \n\n---\n\n## Faith Boost  \nAs we kick off this Old Testament journey, I’m thrilled to see how these ancient words will strengthen your faith in Jesus Christ. I’ve felt His presence in my life as I’ve studied these stories, and I know He’s in every page, waiting for you to find Him. This week, share with a friend or family member one way you’ve seen Jesus in the scriptures or your life. Then, take on this challenge: Pick one symbol of Christ (like manna or the brass serpent) and think about it during a tough moment this week. Let it remind you that He’s with you, no matter what. Let’s do this together—2026 is going to be an amazing year of growing closer to our Savior!",
  "generated_timestamp": "2025-12-31 23:57:18",
  "source_week_file": "cfm_2026_week_01.json"
}