{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "audience": "adult",
  "word_count": 1032,
  "character_count": 6574,
  "content": "# Come, Follow Me Study Plan: Week 3, January 12–18  \n**Genesis 1–2; Moses 2–3; Abraham 4–5**\n\n## Weekly Overview\nThe accounts of the Creation in Genesis 1–2, Moses 2–3, and Abraham 4–5 reveal Heavenly Father and Jesus Christ as masterful Creators who brought order from chaos, forming a beautiful world from what was once “without form, and void” and “empty and desolate” (Genesis 1:2; Abraham 4:2). These scriptures emphasize Jesus Christ’s role as the Only Begotten through whom “these things” were created (Moses 2:1), our divine potential as beings made in God’s image (Genesis 1:26–27), and sacred responsibilities like marriage, stewardship over the earth, and keeping the Sabbath holy. In our chaotic world, these truths remind us that the Creators continue Their work in us, transforming emptiness into divine likeness.\n\n## Doctrinal Key Points\n1. **Jesus Christ Created the Heavens and Earth Under the Father’s Direction**: “By mine Only Begotten I created these things” (Moses 2:1; see also Genesis 1:1–25; Abraham 4:1–25). These parallel accounts teach God’s power to organize chaos into majesty, revealing Heavenly Father’s plan and the Savior’s role as Creator.\n   \n2. **We Are Created in God’s Image and Likeness**: “And I, God, said unto mine Only Begotten, which was with me from the beginning: Let us make man in our image, after our likeness” (Moses 2:26; see Genesis 1:26–27; Abraham 4:26–27). This affirms our sacred potential as male and female, countering negative self-views.\n\n3. **Marriage Between Man and Woman Is Ordained of God**: “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (Russell M. Nelson, “Lessons from Eve,” Ensign, Nov. 1987, 87; see Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18).\n\n4. **We Are Responsible Stewards Over God’s Creations**: “Be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth” (Genesis 1:28; see Moses 2:28; Abraham 4:28; Doctrine and Covenants 59:16–21; 104:13–18).\n\n5. **God Sanctified the Sabbath Day**: “And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made. And God blessed the seventh day, and sanctified it” (Genesis 2:2–3; see Moses 3:2–3; Abraham 5:2–3).\n\n6. **Natural Tendencies Must Be Put Off Through Christ**: Insights from these verses pair with “the natural man is an enemy to God” (Mosiah 3:19) and weaknesses becoming strengths through Christ (Ether 12:27), showing Creation’s purpose includes divine transformation.\n\n7. **The Human Body Is a Magnificent Gift**: President Russell M. Nelson taught, “Your body is sacred” (“Your Body: A Magnificent Gift to Cherish,” Liahona, Aug. 2019, 50–55; see “God’s Greatest Creation” video, Gospel Library).\n\n## Personal Study Guide\n**Day 1 (Monday)**: Read Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25. What does this teach about Heavenly Father, Jesus Christ, the world, and yourself? Cross-reference Doctrine and Covenants 101:32–34. Reflect: How has the Savior brought light into your chaos?\n\n**Day 2 (Tuesday)**: Study Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27. Complete: “Because I know I am created in God’s image, I choose to…” Watch “God’s Greatest Creation” (Gospel Library). Journal: How does this differ from worldly messages?\n\n**Day 3 (Wednesday)**: Read Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18. Ponder President Nelson’s quote on Adam and Eve’s eternal marriage. Cross-reference “The Family: A Proclamation to the World” and 1 Corinthians 11:11. Reflect: How can you honor marriage’s sacredness?\n\n**Day 4 (Thursday)**: Examine Genesis 1:28; Moses 2:28; Abraham 4:28; Doctrine and Covenants 59:16–21; 104:13–18. Read Gérald Caussé, “Our Earthly Stewardship,” Liahona, Nov. 2022, 57–59. Note: “Our Earthly Stewardship” emphasizes conservation (Gospel Library, Topics and Questions). Pray: What is my stewardship?\n\n**Day 5 (Friday)**: Focus on Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3; Doctrine and Covenants 59:9–13. Watch “The Sabbath Is a Delight” (Gospel Library). Reflect: What makes your Sabbath blessed?\n\n**Day 6 (Saturday)**: Review Mosiah 3:19; Ether 12:27 with Creation verses. How do these show God’s ongoing creative work in you? Read “Your body is sacred” in For the Strength of Youth (pages 22–29).\n\n**Day 7 (Sunday)**: Ponder all readings outdoors or with “All Creatures of Our God and King” (Hymns, no. 62). Share a picture of creation with your testimony.\n\n## Group Discussion Ideas\n1. What stands out about Jesus Christ’s role in the Creation accounts (Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25)? How does this deepen your reverence for Him?\n2. How does knowing you are created in God’s image (Genesis 1:26–27) change how you view yourself and others?\n3. Share: “Because I am created in God’s image, I choose to…” How has this truth combated negative feelings?\n4. President Nelson said Adam and Eve were married eternally by priesthood power—what does this teach about marriage today (Genesis 2:18–25)?\n5. What responsibilities do we have toward God’s creations (Genesis 1:28; Doctrine and Covenants 59:16–21)? Share an experience.\n6. How can we make the Sabbath “blessed” and holy in our lives (Genesis 2:2–3)?\n7. Brother Caussé taught on earthly stewardship—how can we apply this personally and as a ward?\n8. How do Mosiah 3:19 and Ether 12:27 connect to our divine potential from the Creation?\n\n## Application Challenges\n1. Spend time among God’s creations (e.g., a walk), then share a photo with your testimony of the Creator via text or social media.\n2. Choose one way to honor your body as sacred—review For the Strength of Youth (pages 22–29) and commit to it this week.\n3. Plan a family or personal Sabbath activity from “The Sabbath Is a Delight” video, making it distinct and holy.\n4. Perform an act of stewardship: Care for your home, garden, or environment, pondering Doctrine and Covenants 104:13–18 and Brother Caussé’s words.\n\n## Testimony Builder\nThese Creation accounts witness of Jesus Christ, the Only Begotten who organized the heavens and earth, and who invites us to become like our Heavenly Father through His Atonement. In the Restoration, Joseph Smith’s visions unveiled Moses and Abraham’s fuller testimonies, confirming our divine image and eternal potential. Ponder how the Creators are molding you even now—record what stirs in your heart.\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-10 22:23:29",
  "source_week_file": "cfm_2026_week_03.json"
}