{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "adult",
  "word_count": 1146,
  "character_count": 7199,
  "content": "# Come, Follow Me Study Plan: Week 2 (January 5–11)  \n**Moses 1; Abraham 3**\n\n## Weekly Overview\nThrough visions granted to Moses and Abraham, the Lord reveals profound truths about our existence before the world's creation, framing the Old Testament's opening chapters with restored clarity (Moses 1:36; Abraham 3:22–28). These accounts address Moses's plea: “Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens” (Moses 1:36), illuminating God's identity, our divine heritage as His spirit children, and His eternal work. In our day, these scriptures counter confusion about identity, as President Russell M. Nelson has taught: “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity” [worldwide devotional for young adults, May 2022], Gospel Library), guiding us to live with purpose amid modern distractions.\n\n## Doctrinal Key Points\n1. **I am a child of God with divine worth and destiny** (Moses 1:4, 6). God declares to Moses, “thou art in the similitude of mine Only Begotten; and mine Only Begotten is and shall be the Savior,” affirming our sacred identity that precedes all other labels, as President Nelson emphasized: “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”).\n   \n2. **God and Satan contrast sharply in their messages** (Moses 1:4, 6, 12). God affirms divine sonship, while Satan tempts with doubt: “Moses, son of man, worship me,” highlighting Satan's aim to obscure our true identity.\n\n3. **With the Lord’s help, I can resist Satan’s temptations and counterfeits** (Moses 1:12–26). Moses prevails by commanding, “Depart hence, Satan” (Moses 1:20), relying on God's power: “the Lord … received strength, and called upon God … and the glory of God was upon Moses” (Moses 1:25–26).\n\n4. **God’s work and glory is to help His children gain eternal life** (Moses 1:27–39). After beholding creations, Moses asks, “why these things are so” (Moses 1:30), and the Lord responds: “For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39).\n\n5. **Jesus Christ enables immortality and eternal life** (Moses 1:31–39; Abraham 3:24–26). Worlds without number witness Christ's role: “mine Only Begotten is and shall be the Savior” (Moses 1:6), redeeming all through His Atonement.\n\n6. **I lived as a spirit before birth, with purpose to prove faithful** (Abraham 3:22–28). Abraham saw “the intelligences that were organized before the world was; and among all these there were many of the noble and great ones,” including noble spirits chosen for earth's proving (Abraham 3:22–23, 25).\n\n7. **Premortal choices prepare us for mortal probation** (Abraham 3:22–28). We covenanted as spirits “to go down to earth … and we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them” (Abraham 3:25).\n\n## Personal Study Guide\n**Day 1: Divine Identity (Moses 1:1–11)**  \nRead Moses 1:1–11. Reflect: What do you learn from God’s words in verses 4 and 6 about your identity versus Satan’s deceptions in verse 12? Cross-reference President Nelson’s “Choices for Eternity” section “First: Know the truth about who you are.” Ponder decisions shaped by knowing you are God’s child.\n\n**Day 2: Resisting Satan (Moses 1:12–26)**  \nRead Moses 1:12–26. Journal: How did Moses overcome temptation (verses 13, 15, 18, 20–22, 26)? What counterfeits does Satan use today, and how does the Lord strengthen us (verse 24–26)? See Matthew 4:1–11; Gary E. Stevenson, “Deceive Me Not,” Liahona, Nov. 2019, 93–96.\n\n**Day 3: God’s Vast Creations (Moses 1:27–33)**  \nRead Moses 1:27–33. Consider: What impresses you about the vision of “worlds without number” (verse 33)? How does this expand Moses’s question in verse 30? Topics and Questions, “Eternal Life,” Gospel Library.\n\n**Day 4: God’s Work and Glory (Moses 1:34–42)**  \nRead Moses 1:34–42. Reflect: What is the difference between immortality and eternal life (Moses 1:39)? How does Christ fulfill this? Cross-reference Abraham 3:24–26; Topics and Questions, “Premortal Life,” Gospel Library.\n\n**Day 5: Premortal Council (Abraham 3:1–21)**  \nRead Abraham 3:1–21. Note truths about God’s order and our premortal nobility. Ponder your place among “the noble and great ones” (Abraham 3:22–23).\n\n**Day 6: Spirits Before the World (Abraham 3:22–28)**  \nRead Abraham 3:22–28. List truths about premortal life, Christ, and earth’s purpose (e.g., “prove,” verse 25). How do these truths influence your choices?\n\n**Day 7: Synthesis and Review**  \nRe-read Moses 1:39; Abraham 3:25. Reflect: How do these visions answer “Who is God? Who are we? What is our place in His work?” Review notes; pray for testimony of your divine destiny.\n\n## Group Discussion Ideas\n1. What differences do you see in God’s message to Moses (Moses 1:4, 6) versus Satan’s (Moses 1:12), and how does this pattern appear in your life?\n2. How did Moses gain strength to resist Satan (Moses 1:20–26)? Share an experience when the Lord helped you overcome temptation.\n3. President Nelson taught, “The way you think about who you really are affects almost every decision you will ever make” (“Choices for Eternity”). What choices has your divine identity shaped for you?\n4. Discuss “worlds without number” (Moses 1:33). How does God’s response in verse 39 define His work and glory?\n5. What truths from Abraham 3:22–28 about premortal life strengthen your sense of purpose? Why are they valuable?\n6. How does Christ’s role as Savior (Moses 1:6; Abraham 3:24–26) bring immortality and eternal life?\n7. In what ways do Satan’s counterfeits mimic God’s truths today (Moses 1:13–18)? How can we recognize and reject them?\n8. How has knowing “we will prove them herewith” (Abraham 3:25) influenced a recent decision?\n\n## Application Challenges\n1. **Affirm Identity Daily**: Make a list of choices influenced by being a child of God first (e.g., work, relationships), as prompted in “Choices for Eternity.” Share one with a loved one.\n2. **Resist Counterfeits**: When tempted, pause to command as Moses did (Moses 1:20)—pray for God’s glory to be upon you (Moses 1:25)—and note the outcome in a journal.\n3. **Embrace Proving**: In a challenging situation, recall Abraham 3:25 and choose faithfulness; discuss with family how Christ helps when we falter.\n4. **Teach a Child**: Use a mirror to affirm, “I am/You are a child of God” (Moses 1:4), then explore God’s work for you (Moses 1:6; Doctrine and Covenants 11:20).\n\n## Testimony Builder\nThese visions restore eternal perspective through Joseph Smith’s revelations, centering all on Jesus Christ, the Savior who organized spirits premortally (Abraham 3:22–27) and whose Atonement fulfills the Father’s glory: “to bring to pass the immortality and eternal life of man” (Moses 1:39). As we embrace our premortal nobility and resist the adversary as Moses did, we prove faithful in Christ’s enabling power. Ponder today: How does knowing your divine origin draw you nearer to the Redeemer? I know He lives and prepares us for eternal life.",
  "generated_timestamp": "2026-01-11 18:05:25",
  "source_week_file": "cfm_2026_week_02.json"
}