{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "audience": "younger-primary",
  "word_count": 456,
  "character_count": 2770,
  "content": "# Week 3: Jesus Created a Beautiful World\n\n## Lesson Overview\nJesus created the beautiful world for us. We are made in Heavenly Father's image, special like Him.\n\n## Wiggle Activity (2-3 minutes)\n**Creation March**  \nMarch around the room while singing \"On the first day, God made light!\" (clap on \"light\"). Add arm waves for sky, stomp for land. Do 3 days fast—wiggle arms like fish, flap like birds!\n\n## Simple Scripture\n\"God created man in his own image.\" (Genesis 1:27)  \nPoint to your heart, then smile big. Say it 3 times together with claps: \"God cre-a-ted *me* in His image!\"\n\n## Main Activities (15 minutes total)\n\n### 1. Object Lesson: World in a Box (3 minutes)  \n**Materials**: Shoebox with toy sun, grass, animal picture, flower.  \n**Steps**: 1. Hold empty box—\"This was empty like earth at first.\" 2. Add items one by one. 3. Let kids touch and name.  \n**Say**: \"Jesus filled empty space with beautiful things! He made sun, grass, animals for us. What do you love He made?\" (Moses 2:1–25)\n\n### 2. Game: Creation Hunt (4 minutes)  \n**Materials**: Hide 5 picture cards (sun, tree, bird, fish, flower) around room.  \n**Steps**: 1. Say \"Go find what Jesus made!\" 2. Kids run to find. 3. Bring back, shout \"Jesus made [item]!\"  \n**Say**: \"Jesus created everything good! Run and find His creations.\" (Genesis 1:1–25)\n\n### 3. Hands-On Craft: My Special Body (4 minutes)  \n**Materials**: Paper outlines of kid bodies, crayons.  \n**Steps**: 1. Trace hand or draw smiley face. 2. Color \"God's image.\" 3. Say \"I am special!\"  \n**Say**: \"Draw how God made you special in His image. We look like Him inside!\" (Genesis 1:26–27; Moses 2:26–27)\n\n### 4. Music & Movement: Animal Dance (4 minutes)  \n**Materials**: None.  \n**Steps**: 1. Swim like fish, fly like birds. 2. Freeze when teacher says \"Jesus made you!\" 3. Wiggle and roar like lions.  \n**Say**: \"Jesus made animals—move like them! He made you too.\"\n\n## Picture Time\nShow \"The Creation\" by Annie Henrie Nader (Gospel Art Book).  \nAsk: \"What do you see Jesus making?\" \"How does it make you feel happy?\" \"Point to beautiful things!\"\n\n## Song\n“My Heavenly Father Loves Me” (Children’s Songbook, 228–29).  \nActions: Point up for heaven, touch eyes/nose/mouth, hug self for love.\n\n## Snack Idea\nApple slices—red like pretty flowers Jesus made! (Allergy-friendly.)\n\n## Testimony Moment\n\"Jesus created this beautiful world and you in Heavenly Father's image. He loves you so much.\"  \nInvite: Fold arms and say together, \"I love Jesus! Thank You for creating me.\"\n\n## Teacher Survival Tips\n1. Use a timer bell for quick switches—keeps wiggles excited!  \n2. If a child disrupts, hug and whisper \"Jesus made you special—help friend?\"  \n3. Too wiggly? Add extra marches; skip one activity for more play.\n\n*(Word count: 528)*",
  "generated_timestamp": "2026-01-11 18:07:45",
  "source_week_file": "cfm_2026_week_03.json"
}