{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "youth",
  "word_count": 778,
  "character_count": 4732,
  "content": "# Come, Follow Me Youth Study Plan: Week 2 (Jan 5–11)  \n**Moses 1; Abraham 3** – God's Vision of You Before the World Began!\n\n## Youth Kickoff\nEver wonder what God saw in you *before* you were born—like scrolling through your premortal Instagram highlights? This week's Moses 1 and Abraham 3 hit hard on your divine VIP status as a child of God (Moses 1:4, 6), why Satan tries to fake you out (Moses 1:12), and God's big plan to help you win eternal life (Moses 1:39). Teens, in a world of filters and FOMO, knowing you're premortal royalty changes *everything*—let's dive in!\n\n## Core Truths\n1. **You're a Child of God First**: God told Moses, “thou art my son” (Moses 1:4, 6). President Nelson taught, “If the Lord were speaking to you directly, the first thing He would make sure you understand is your true identity” (“Choices for Eternity,” May 2022). This beats any label—ties to For the Strength of Youth: base choices on eternal worth.\n   \n2. **Satan Pushes Fakes**: Satan tempted Moses right after his vision, saying “Moses, son of man” (Moses 1:12). Spot counterfeits like fake plants vs. real ones (Moses 1:13–18)—God helps you resist (Moses 1:24–26).\n\n3. **God's Work is Your Eternal Win**: “This is my work and my glory—to bring to pass the immortality and eternal life of man” (Moses 1:39). Jesus makes it happen—immortality for all, eternal life for the faithful (Topics and Questions, “Eternal Life”).\n\n4. **Premortal Spirit Life**: You lived as a spirit “before the world was” (Abraham 3:22–28). God chose spirits to “prove” themselves on earth (Abraham 3:25)—Jesus was the top noble one (Abraham 3:22–24).\n\n5. **Resist with God's Power**: Moses called on God and angels came (Moses 1:20–26). Pray, walk away, get help—like Matthew 4:1–11.\n\n## Daily Dive\n**Day 1: Identity Check (Moses 1:4, 6)** – Read God's words to Moses. Mirror selfie: Say, “I am a child of God.” Journal: List 3 choices this makes (school drama? Friends?). Text a buddy: Share Pres. Nelson quote.\n\n**Day 2: Spot the Fake (Moses 1:12–18)** – Compare God vs. Satan messages. Meme it: Fake plant vs. real. Question: What's a social media counterfeit tempting you? Pray like Moses (Moses 1:18).\n\n**Day 3: Beat Temptation (Moses 1:20–26)** – Note Moses's wins (pray, command in God's name). Group text quorum: Share a resist-Satan story from school. Watch “I Am a Son of God” video (5 min).\n\n**Day 4: God's Big Why (Moses 1:31–39)** – Vision of worlds! Define immortality vs. eternal life. Tie to future goals: How's Jesus helping your eternal life?\n\n**Day 5: Premortal Squad (Abraham 3:22–28)** – List truths: Spirits, prove, Jesus as leader. Blast “I Am a Child of God” (Hymns, no. 301) or Youth Music remix. Question: How's this change peer pressure choices?\n\n**Day 6: Prove It (Abraham 3:24–26)** – God knew you'd face tests. Journal for missionary prep: One way to “prove” faithful this week? Share with fam at dinner.\n\n**Day 7: Wrap & Act (Moses 1:36)** – Moses asked about earth/heavens—you can too. Review list from Day 1. Challenge: Make identity your top filter for one decision today.\n\n## Activity Ideas\n1. **Mirror Affirmation Relay** (10 min): Line up, each teen mirrors God's words to Moses (Moses 1:4). Pass a \"divine destiny\" ball—say why you're glad (like kids' idea, but hype it up!).\n   \n2. **Satan Role-Play Showdown** (15 min): Groups act Moses 1:12–26 temptations (social media fake-out). Vote best resist moves—end with “Our True Identity” video.\n\n3. **Premortal Vision Board** (20 min): Abraham 3:22–28 keywords on sticky notes. Build boards for \"before the world was\"—add pics of service/mission goals. Sing “I Will Follow God’s Plan.”\n\n4. **Counterfeit Hunt** (10 min): Bring fake items (doll, plant). Match to Satan tactics (Moses 1:13–18). Brainstorm real vs. fake in apps/games.\n\n5. **Moses Mission Service** (30 min): Like Moses's work (D&C 11:20 nod), plan mini-service (text encouragement). Discuss God's work (Moses 1:39).\n\n## Real-Life Connections\nCrush peer pressure? Remember premortal \"prove\" (Abraham 3:25)—choose eternal over Insta likes. Social media blues? Ditch Satan's \"son of man\" lies for \"child of God\" (Moses 1:4 vs. 12). Mission prep? You're chosen like premortal spirits (Abraham 3:22–23). School stress? God's glory is *your* eternal life (Moses 1:39)—Jesus bridges mistakes. For the Strength of Youth: Let identity guide every choice.\n\n## Faith Boost\nYou are literally God's child with a premortal plan and eternal destiny—Satan can't fake that out if you call on God like Moses. Share one truth from this week that fired you up (text or class circle). Challenge: This week, before a big decision, whisper Moses 1:6 and act—watch your life level up! I know you're nobility in His eyes. (612 words)",
  "generated_timestamp": "2026-01-10 22:22:54",
  "source_week_file": "cfm_2026_week_02.json"
}