{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "adult",
  "word_count": 947,
  "character_count": 5969,
  "content": "# Come, Follow Me: Week 1 – Introduction to the Old Testament (December 29–January 4)\n\n## Weekly Overview\nThe Old Testament invites us into ancient stories that echo our own lives—family joys and sorrows, faith and doubt, triumphs and repentance—all bearing witness to the Savior's promise (Psalm 119:105: “Thy word is a lamp unto my feet, and a light unto my path”). Though its culture feels distant, it reveals Jesus Christ through symbols like manna and the sacrificial lamb, identifies Him as Jehovah who spoke to prophets, and highlights restored truths through Joseph Smith that clarify covenants binding us to God. In our day, as President Russell M. Nelson taught in “The Everlasting Covenant” (Liahona, October 2022, 8), these covenants offer “special kind of love and mercy” amid modern challenges, drawing us nearer to the Redeemer.\n\n## Doctrinal Key Points\n1. **The Old Testament testifies of Jesus Christ as the Bread of Life**: Symbols like manna (Exodus 16:4, 11–15; John 6:35), the sacrificial lamb (Exodus 12:3–5; John 1:29), the brass serpent (Numbers 21:4–10; John 3:14), and Jonah (Jonah 1:4–17; Matthew 12:38–41) point to His sustaining power, Atonement, healing, and Resurrection, as Elder Dale G. Renlund urged: “remember and always focus on Jesus Christ” (“Jesus Christ Is the Treasure,” Liahona, Nov. 2023, 98).\n\n2. **Jesus Christ is Jehovah in the Old Testament**: He declared, “Before Abraham was, I am” (John 8:58), echoing His name revealed to Moses (Exodus 3:13–15; 6:3–5). President Dallin H. Oaks explained: “the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (“The Teachings of Jesus Christ,” Liahona, May 2023, 102).\n\n3. **All things bear record of Christ**: “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63), helping us find meaning and increase faith as we study.\n\n4. **Plain and precious truths restored through Joseph Smith**: Nephi saw losses from the Bible (1 Nephi 13:21–29, 38–42), but the Lord restores them via the Book of Mormon (2 Nephi 3:12), book of Moses (e.g., Moses 7:18–19), book of Abraham (Abraham 3:22–28), and Joseph Smith Translation (e.g., Genesis 14:25–40).\n\n5. **Covenants make us God’s peculiar treasure**: “Ye shall be a peculiar treasure unto me above all people” (Exodus 19:5), as explored in President Nelson’s “The Everlasting Covenant,” with promises of mercy for the faithful (Jeremiah 31:31–34).\n\n6. **God seeks covenant relationships through prophets**: From Abraham to us, the Old Testament unfolds God’s pursuit to bind His people eternally.\n\n## Personal Study Guide\n**Day 1: Symbols of Christ**  \nRead Exodus 16:4, 11–15; John 6:35; Exodus 12:3–5; John 1:29. Reflect: How do these reveal Christ’s role in your sustenance and redemption? Cross-reference Elder Renlund, Liahona, Nov. 2023, 98.\n\n**Day 2: Christ as Jehovah**  \nRead Exodus 3:13–15; 6:3–5; John 8:58–59. Reflect: Why does knowing Jesus as Jehovah deepen your reverence? See President Oaks, Liahona, May 2023, 102.\n\n**Day 3: Restoration of Plain Truths**  \nRead 1 Nephi 13:21–29, 38–42; 2 Nephi 3:12. Reflect: How do these assure you of God’s careful plan? Note restored accounts like Moses 7:18–19.\n\n**Day 4: Covenants in the Old Testament**  \nRead Exodus 19:5; Jeremiah 31:31–34; President Nelson, “The Everlasting Covenant” (Liahona, Oct. 2022, 4–11). Reflect: What mercy do covenants bring to your life?\n\n**Day 5: Types and Shadows**  \nRead Numbers 21:4–10; John 3:14; Jonah 1:4–17; Matthew 12:38–41; Moses 6:63. Reflect: Where else do you see Christ’s record in creation?\n\n**Day 6: Psalmist’s Witness**  \nRead Psalm 119:105, 140; Psalm 23. Reflect: How has the Old Testament been a lamp to your path? Connect to restored books like Abraham 3:22–28.\n\n**Day 7: Synthesis and Preparation**  \nReview all; read “Types or Symbols of Christ,” Guide to the Scriptures. Reflect: What excites you for the year? Ponder your covenant path forward.\n\n## Group Discussion Ideas\n1. How have Old Testament symbols like the brass serpent strengthened your testimony of the Atonement (Numbers 21:4–10; John 3:14)?\n2. What does it mean that Jesus Christ is Jehovah, as in Exodus 6:3 (see President Oaks, Liahona, May 2023, 102)?\n3. Share an experience finding Christ in unfamiliar scriptures—how does Moses 6:63 guide us?\n4. Why are restored accounts like Enoch’s Zion (Moses 7:18–19) “plain and precious” (1 Nephi 13:28)?\n5. How do covenants position us as God’s “peculiar treasure” (Exodus 19:5; President Nelson, Liahona, Oct. 2022)?\n6. In what ways does the Bible and Book of Mormon fulfill 2 Nephi 3:12?\n7. How can focusing on Christ, per Elder Renlund (Liahona, Nov. 2023, 98), transform our Old Testament study?\n8. What family or personal “uncertainties” mirror ancient prophets, and how did they overcome through covenants?\n\n## Application Challenges\n1. **Seek Christ Daily**: Each morning, identify one Old Testament symbol (e.g., manna) and apply it—thank Him as your Bread of Life in prayer or journaling.\n2. **Covenant Review**: Study President Nelson’s “The Everlasting Covenant”; list one way to honor your covenants this week in family or service.\n3. **Jehovah Journal**: As you read, note verses where “Lord” speaks (e.g., Exodus 3:14); ponder His voice in your life, sharing with a loved one.\n4. **Restoration Gratitude**: Read a JST passage (e.g., Genesis 14:25–40); express thanks in fasting or temple prayer for Joseph Smith’s role.\n\n## Testimony Builder\nThese introductory truths remind us that the Old Testament, clarified by the Restoration, centers on Jesus Christ—Jehovah of old, who covenants to make us His treasure through mercy and plain truths. As we heed Nephi’s vision (1 Nephi 13:40), the Savior draws near, His light illuminating our path just as promised. Pause now: How does seeing Him in these ancient pages stir your faith in His gospel today? I know He lives and speaks still.",
  "generated_timestamp": "2026-01-11 18:30:51",
  "source_week_file": "cfm_2026_week_01.json"
}