{
  "week_number": 3,
  "title": "Week 3: January 12–18 - Genesis 1–2; Moses 2–3; Abraham 4–5",
  "date_range": "January 12–18",
  "audience": "adult",
  "word_count": 938,
  "character_count": 6245,
  "content": "# Come, Follow Me Study Plan: Week 3, January 12–18  \n**Genesis 1–2; Moses 2–3; Abraham 4–5**\n\n## Weekly Overview\nThese inspired accounts of the Creation reveal Heavenly Father and Jesus Christ as masterful organizers who bring light, order, and life from chaos and emptiness (Genesis 1:2; Abraham 4:2). Multiple witnesses in Genesis, Moses, and Abraham emphasize truths about our divine identity, sacred roles in family and stewardship, and the holiness of the Sabbath, providing ancient context through patriarchal revelations restored in latter days. In our chaotic world, these principles remind us that the Creators continue Their work in us, transforming us into beings of light and glory after Their image (Genesis 1:26).\n\n## Doctrinal Key Points\n1. **Jesus Christ created the heavens and earth under the Father's direction**: \"By mine Only Begotten I created these things\" (paraphrased from Moses 2, as highlighted). Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25 teach God's deliberate process, revealing His power and purpose (Doctrine and Covenants 101:32–34).\n   \n2. **We are created in God's image and likeness**: Genesis 1:26–27 states, \"And God said, Let us make man in our image, after our likeness... So God created man in his own image, in the image of God created he him; male and female created he them.\" Moses 2:26–27 and Abraham 4:26–27 affirm this divine potential, countering worldly devaluation (Mosiah 3:19; Ether 12:27; Nelson, “Your Body: A Magnificent Gift to Cherish,” *Liahona*, Aug. 2019).\n\n3. **Marriage between man and woman is ordained of God**: Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18 show Adam and Eve united eternally. President Russell M. Nelson taught, “Adam and Eve were joined together in marriage for time and for all eternity by the power of [the] everlasting priesthood” (“Lessons from Eve,” *Ensign*, Nov. 1987, 87; see 1 Corinthians 11:11; “The Family: A Proclamation to the World”).\n\n4. **We are stewards over God's creations**: Genesis 1:28; Moses 2:28; Abraham 4:28 command to \"replenish the earth, and subdue it,\" expanded in Doctrine and Covenants 59:16–21; 104:13–18. President Gérald Caussé affirmed, our duty includes reverent care (*Liahona*, Nov. 2022).\n\n5. **God blessed and sanctified the Sabbath day**: Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3 declare the seventh day holy, inviting rest and worship (Doctrine and Covenants 59:9–13).\n\n6. **Creation teaches God's transformative power**: From \"without form, and void\" (Genesis 1:2) to magnificent order, mirroring His ongoing work in our lives toward exaltation (Genesis 1:26).\n\n## Personal Study Guide\n**Day 1: Creation's Order (Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25)**  \nRead while observing nature or listening to “All Creatures of Our God and King” (*Hymns*, no. 62). Reflect: What does this teach about Heavenly Father and Jesus Christ? Cross-reference: Doctrine and Covenants 101:32–34.\n\n**Day 2: In God's Image (Genesis 1:26–27; Moses 2:26–27; Abraham 4:26–27)**  \nPonder: \"Because I know I am created in God’s image, I choose to...\" Watch “God’s Greatest Creation” (Gospel Library). How does this differ from worldly messages? Cross-reference: “Your body is sacred,” *For the Strength of Youth*, 22–29; Mosiah 3:19.\n\n**Day 3: Eternal Marriage (Genesis 1:27–28; 2:18–25; Moses 3:18, 21–24; Abraham 5:14–18)**  \nStudy family roles. Reflect: How does priesthood power sanctify marriage? Cross-reference: “The Family: A Proclamation to the World”; 1 Corinthians 11:11.\n\n**Day 4: Stewardship (Genesis 1:28; Moses 2:28; Abraham 4:28)**  \nRead Doctrine and Covenants 59:16–21; 104:13–18. Reflect: What is my responsibility toward God's creations? Cross-reference: Caussé, “Our Earthly Stewardship” (*Liahona*, Nov. 2022).\n\n**Day 5: The Sabbath (Genesis 2:2–3; Moses 3:2–3; Abraham 5:2–3)**  \nWatch “The Sabbath Is a Delight” (Gospel Library). Reflect: What makes the Sabbath blessed for me? Cross-reference: Doctrine and Covenants 59:9–13.\n\n**Day 6: Synthesis and Self-Reflection**  \nReview Genesis 1–2; Moses 2–3. Journal: How does Creation transform chaos in my life? Cross-reference: Nelson, “Think Celestial!” (Oct 2024 General Conference, implied modern tie).\n\n**Day 7: Testimony and Sharing**  \nPonder full accounts; share a creation photo with your testimony. Reflect: How do these truths affect how I see myself and God?\n\n## Group Discussion Ideas\n1. What stands out about how God reveals the Creation in Genesis 1:1–25; Moses 2:1–25; Abraham 4:1–25? Why these details?\n2. How does knowing we are created in God's image (Genesis 1:26–27) change self-view or treatment of others?\n3. Share: \"Because I am in God’s image, I choose to...\" How does this combat negative feelings?\n4. What does eternal marriage teach from Genesis 2:18–25 and President Nelson’s words?\n5. How can we honor stewardship (Genesis 1:28; Doctrine and Covenants 59:16–21) in daily choices?\n6. What makes the Sabbath \"blessed\" and holy (Genesis 2:2–3)? Share experiences.\n7. How does Creation show God's power to bring light from darkness in our lives?\n8. Insights from “God’s Greatest Creation” video on the body as sacred?\n\n## Application Challenges\n1. **Honor Your Body**: Choose one action from “Your body is sacred” (*For the Strength of Youth*) to show gratitude for being in God's image, like temple-worthy care.\n2. **Strengthen Marriage/Family**: Discuss with spouse or family how to treat marriage sacredly, per “The Family: A Proclamation to the World” and Genesis 2:18–25.\n3. **Stewardship Act**: Care for a creation—plant, clean environment, or thank God for nature (Doctrine and Covenants 59:16–21; Caussé, Nov. 2022).\n4. **Sabbath Delight**: Plan one worship-focused activity to keep the day holy (Genesis 2:2–3; “The Sabbath Is a Delight”).\n\n## Testimony Builder\nJesus Christ, the Only Begotten, organized this magnificent earth from formless void, inviting us into His creative work as those made in God's image with eternal potential (Moses 2:26–27; Abraham 4:26–27). Through the Restoration, these truths shine anew in the Pearl of Great Price, testifying of priesthood power in marriage, stewardship, and Sabbath rest—all pointing to exaltation in families forever. Ponder how the Creators are molding you today.",
  "generated_timestamp": "2026-01-11 18:06:48",
  "source_week_file": "cfm_2026_week_03.json"
}