{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "older-primary",
  "word_count": 665,
  "character_count": 4136,
  "content": "# Introduction to the Old Testament\n\n## Lesson Overview\nThe Old Testament teaches us about Jesus Christ through symbols like manna and the sacrificial lamb, and it shows how Heavenly Father makes covenants with us, just like at baptism (see \"Teaching Children\" in Come, Follow Me—For Home and Church: Old Testament 2026). For 8-10-year-olds, this builds excitement for scripture study by connecting ancient stories to Jesus and personal promises with God. It helps them feel God's love and see the Old Testament as a light for their lives (Psalm 119:105).\n\n## Opening Activity (5 minutes): Flashlight Object Lesson\n**Type: Object Lesson**  \nHold up a flashlight in a dim room (or cover lights). Shine it on the floor: \"This light shows the path ahead, just like the scriptures!\" Read Psalm 119:105: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it.” Turn it off and on to show how the Old Testament lights our way to Jesus. Ask: \"How can the Old Testament be like this light?\" Transition: \"Today, we'll find Jesus in Old Testament symbols!\"\n\n**Materials:** Flashlight.\n\n## Scripture Focus\n**Psalm 119:105**: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105).  \n*Child-friendly explanation:* God's words in the Old Testament are like a flashlight—they guide us to Jesus Christ, who is the Bread of Life and our Savior (see John 6:48; Exodus 16:4, 11–15).  \n\n**Exodus 6:3** (with Joseph Smith Translation footnote): Jesus was known as \"God\" or \"the Lord\" (Jehovah) in the Old Testament before He was born (see \"Jesus Christ is Jehovah in the Old Testament\").\n\n## Main Activities (15-20 minutes total)\n\n### 1. Symbol Hunt Game (5 minutes)\n**Type: Games**  \n**Step-by-step:** Print or draw 8 cards with Old Testament symbols (manna as bread, lamb, brass serpent, Jonah/fish, baby Jesus from Isaiah). Hide them around the room. Kids hunt in pairs (2 minutes). Gather and match: \"Which shows Jesus?\" (e.g., manna to John 6:35; lamb to John 1:29).  \n**Materials:** 8 picture cards (paper, markers), timer.  \n**Connection:** These symbols testify of Jesus Christ in the Old Testament (see \"The Old Testament testifies of Jesus Christ\").  \n**Discussion:** \"What do these teach about Jesus? (e.g., He gives us daily bread.) Which is your favorite?\"\n\n### 2. Covenant Promise Crafts (5-7 minutes)\n**Type: Hands-On Crafts**  \n**Step-by-step:** Give each child a paper heart. They draw/write one promise to God (e.g., \"Be kind like Jesus,\" from baptism covenants). Decorate with crayons. Share one with the group.  \n**Materials:** Paper hearts (cut from construction paper), crayons, markers.  \n**Connection:** Covenants are promises with God, like baptism (Mosiah 18:10, 13), making us His \"peculiar treasure\" (Exodus 19:5).  \n**Discussion:** \"Why keep promises with family or God? How does it feel to make a covenant like at baptism?\"\n\n### 3. Jehovah March & Sing (5 minutes)\n**Type: Music & Movement**  \n**Step-by-step:** Sing \"Seek the Lord Early\" (Children’s Songbook, 108) while marching. Pause to shout names: \"Who is Jehovah? Jesus!\" Act out Exodus 6:3 by pointing up (Heavenly Father) then to self (Jesus as Jehovah). Repeat with actions for symbols (pretend eat manna).  \n**Materials:** None (song lyrics printed if needed).  \n**Connection:** Jesus Christ is Jehovah in the Old Testament (see President Dallin H. Oaks, “The Teachings of Jesus Christ,” Liahona, May 2023, 102).  \n**Discussion:** \"How does knowing Jesus is Jehovah make you feel about the Old Testament?\"\n\n## Testimony Time (3 minutes)\nPass a soft ball. Child holding it shares: \"What did you learn about Jesus today? How do you feel about finding Him in the Old Testament?\" Listen warmly; add: \"I love seeing Jesus as our light too.\"\n\n## Take-Home Challenge\nDraw one Old Testament symbol of Jesus (like manna) on paper and tell your family how it shows Him. Read Psalm 119:105 together.\n\n## Teacher Tips\nUse a timer for smooth transitions; pair shy kids with friends. For wiggly groups, add more movement—let them \"shine\" like lamps by standing tall. (Word count: 612)",
  "generated_timestamp": "2026-01-11 18:04:40",
  "source_week_file": "cfm_2026_week_01.json"
}