{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "adult",
  "word_count": 1044,
  "character_count": 6468,
  "content": "# Come, Follow Me Study Plan: Week 1 – Introduction to the Old Testament (December 29–January 4)\n\n## Weekly Overview\nThe Old Testament invites us into ancient stories that feel both foreign and profoundly familiar, revealing gospel themes that witness of Jesus Christ amid family joys, discords, faith, and failures (see “Introduction to the Old Testament,” *Come, Follow Me—For Home and Church: Old Testament 2026*). From a historical lens, these writings emerge from an ancient culture yet center on covenants, symbols of the Savior, and His identity as Jehovah, with plain and precious truths restored through Joseph Smith. Today, this study nourishes us by illuminating our covenant path, as the psalmist declares: “Thy word is a lamp unto my feet, and a light unto my path. … Therefore thy servant loveth it” (Psalm 119:105, 140), guiding us to see God moving in our lives as He did in theirs.\n\n## Doctrinal Key Points\n1. **The Old Testament testifies of Jesus Christ as the Bread of Life**: Symbols like manna (Exodus 16:4, 11–15; see John 6:35), the sacrificial lamb (Exodus 12:3–5; John 1:29), the brass serpent (Numbers 21:4–10; John 3:14), and Jonah (Jonah 1:4–17; Matthew 12:38–41) point to Him, teaching of His sustaining power, atoning sacrifice, healing, and resurrection.\n   \n2. **All things bear record of Jesus Christ**: The Lord taught Adam, “All things have their likeness, and all things are created and made to bear record of me” (Moses 6:63), helping us find meaning and increase faith as we study.\n\n3. **Jesus Christ is Jehovah in the Old Testament**: President Dallin H. Oaks taught: “The Father introduced His Only Begotten Son, Jesus Christ, as our Savior and Redeemer and gave us the command to ‘hear Him.’ From this direction we conclude that the scriptural records of words spoken by ‘God’ or the ‘Lord’ are almost always the words of Jehovah, our risen Lord, Jesus Christ” (*Liahona*, May 2023, “The Teachings of Jesus Christ,” 102; see Exodus 3:13–15; 6:3–5; John 8:58–59).\n\n4. **Plain and precious truths were restored through Joseph Smith**: Nephi saw that many such things were removed from the Bible, but the Lord would restore them via the Book of Mormon and “other books” like the book of Moses, book of Abraham, and Joseph Smith Translation (1 Nephi 13:21–29, 38–42; 2 Nephi 3:12), including Enoch’s Zion (Moses 7:18–19) and Abraham’s council (Abraham 3:22–28).\n\n5. **The Old Testament reveals our covenant relationship with God**: God seeks to make us His “peculiar treasure” by covenant (Exodus 19:5; see Jeremiah 31:31–34), as in the everlasting covenant to prophets like Abraham.\n\n6. **Focusing on Jesus Christ brings spiritual nourishment**: Elder Dale G. Renlund urged us to “remember and always focus on Jesus Christ” (*Liahona*, Nov. 2023, “Jesus Christ Is the Treasure,” 98), finding Him in scriptures and life.\n\n## Personal Study Guide\n**Day 1: Embracing the Old Testament**  \nRead the introduction in *Come, Follow Me* and Psalm 119:105, 140. Reflect: How do ancient experiences like those of Abraham or Hannah mirror my own? Cross-reference: “Types or Symbols of Christ” in *Guide to the Scriptures*.\n\n**Day 2: Symbols of the Savior**  \nStudy Exodus 16:4, 11–15; 12:3–5; Numbers 21:4–10; Jonah 1:4–17 (with John 6:35; 1:29; 3:14; Matthew 12:38–41). Ponder: What do these teach about Jesus Christ? Note other familiar references.\n\n**Day 3: Focus on the Treasure**  \nRead Elder Dale G. Renlund, “Jesus Christ Is the Treasure” (*Liahona*, Nov. 2023, 98). Ask: How can I apply his counsel to find Christ in the Old Testament and my life? Sing “Seek the Lord Early” (*Children’s Songbook*, 108).\n\n**Day 4: Jesus Christ as Jehovah**  \nRead Exodus 3:13–15; 6:3–5; John 8:58–59 and President Dallin H. Oaks (*Liahona*, May 2023, 102). Reflect: Why is it significant that Jesus Christ is Jehovah?\n\n**Day 5: Plain and Precious Restoration**  \nStudy 1 Nephi 13:21–29, 38–42; 2 Nephi 3:12. Consider examples: Moses 7:18–19; Abraham 3:22–28; Joseph Smith Translation, Genesis 14:25–40. Why are these precious to me?\n\n**Day 6: Covenants in the Old Testament**  \nRead President Russell M. Nelson, “The Everlasting Covenant” (*Liahona*, Oct. 2022, 4–11) and Exodus 19:5; Jeremiah 31:31–34. Journal: Why are covenants important? What “special kind of love and mercy” do I receive?\n\n**Day 7: All Things Testify**  \nReview Moses 6:63 and *Teaching in the Savior’s Way*, 7. Pray: How will I watch for Christ and covenants this year?\n\n## Group Discussion Ideas\n1. How do symbols like manna or the sacrificial lamb help you see Jesus Christ in the Old Testament?\n2. What familiar Old Testament references to the Savior come to mind, and what do they teach?\n3. President Oaks teaches that words of “God” or “Lord” are usually Jehovah’s (*Liahona*, May 2023, 102). How does this change your reading?\n4. Why were Jews upset at Jesus claiming “I am” (John 8:58–59; Exodus 3:13–15)?\n5. How do restored accounts like Enoch’s city (Moses 7:18–19) feel plain and precious?\n6. In what ways does the Bible and Book of Mormon work together (2 Nephi 3:12)?\n7. What does studying covenants teach about God’s desire for us as His “peculiar treasure” (Exodus 19:5)?\n8. Share an experience of finding Christ in unfamiliar scriptures.\n\n## Application Challenges\n1. **Seek Christ daily**: As you read the Old Testament, mark symbols testifying of Him, like the brass serpent, and note one in your life this week.\n2. **Honor covenants**: Review President Nelson’s “The Everlasting Covenant” (*Liahona*, Oct. 2022) and identify one way to feel God’s “special kind of love and mercy” through covenant keeping at home or church.\n3. **Focus as Elder Renlund taught**: “Remember and always focus on Jesus Christ” (*Liahona*, Nov. 2023, 98)—choose one action, like studying a General Conference talk, to center your week on Him.\n4. **Prepare with children**: Use images like *The Prophet Isaiah Foretells Christ’s Birth* or Psalm 23 to help family see Christ, discussing baptism covenants (Mosiah 18:10, 13).\n\n## Testimony Builder\nThese introductory truths remind us that the Old Testament, enriched by the Restoration’s plain and precious additions through Joseph Smith, bears continual record of Jesus Christ—our Jehovah, the Bread of Life, and covenant Keeper (Moses 6:63; 1 Nephi 13:28–29). As we feast here, we draw nearer to Him who makes us His peculiar treasure, inviting each of us to reflect: How is He lighting your path this year?\n\n*(Word count: 1,048)*",
  "generated_timestamp": "2026-01-11 18:04:01",
  "source_week_file": "cfm_2026_week_01.json"
}