{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "older-primary",
  "word_count": 734,
  "character_count": 4436,
  "content": "# Primary Lesson Plan: Week 2 (January 5–11) - I Am a Child of God (Moses 1; Abraham 3)\n\n## Lesson Overview\nThis lesson helps 8-10-year-olds discover they are children of God with a divine destiny, as taught in Moses 1:4 and Abraham 3:22–28. Children learn Heavenly Father knows them, has work for them, and helps them resist Satan (Moses 1:12–26). Knowing their true identity builds confidence to choose right daily, like Moses did.\n\n## TEACHER LESSON (8-10 minutes)\n**Hook (1-2 minutes):** Hold up a mirror and ask, \"Who do you see? Heavenly Father sees you as His child with important work to do!\" (Moses 1:4, 6).\n\n**Scripture Story (3-4 minutes):** Tell how Moses saw God, who said, \"Thou art my son\" (Moses 1:4, 6). Satan tempted Moses to worship him (Moses 1:12), but Moses said, \"Get thee hence, Satan\" and called on God (Moses 1:13–26). God helped Moses see his divine worth. Ask: \"How did Moses feel when God called him His son? What did Moses do when Satan came?\"\n\n**Gospel Principle (2-3 minutes):** We are children of God who lived as spirits \"before the world was\" (Abraham 3:22–28). Heavenly Father sent us to earth to \"prove\" ourselves by choosing good (Abraham 3:25). Satan tries to confuse us, but God helps us resist, like Moses.\n\n**Application (1-2 minutes):** At home, say \"I am a child of God\" in the mirror. At school, choose to be kind because you have divine worth.\n\n## Opening Activity (5 minutes) - Object Lesson\n**Materials:** Small mirror.  \nPass the mirror; each child looks and repeats: \"I am a child of God\" (Moses 1:4). Discuss: Why are we glad Heavenly Father sees us this way? Connects to divine identity.\n\n## Scripture Focus\n- **Moses 1:4** (full verse): \"And thou art my son; wherefore look and I will show thee the workmanship of mine hands...\" *Child-friendly:* God told Moses, \"You are my child! Look at all I created for you.\"\n- **Abraham 3:23** (simplified from bundle): \"In the midst... intelligences that were organized before the world was; and among all these, here are many that are noble and great.\" *Child-friendly:* We were spirits with Heavenly Father before earth; He has work for us here.\n\n## Interactive Activities (15-20 minutes total)\n### 1. Mirror Message Relay (Physical Activity, 5 minutes)\n**Materials:** None.  \n**Steps:** Children stand in lines. Teacher says God's message: \"You are my child\" (Moses 1:4). First child pretends to look in mirror, says it loud, runs to tag next. Switch to Satan's lie (Moses 1:12: \"Moses, son of man, worship me\")—they sit down instead.  \n**Connection:** Shows choosing God's truth over Satan's, like Moses (Moses 1:12–26).  \n**Questions:** \"How did Moses feel saying no? What helps you say no to bad choices?\"\n\n### 2. Resist Satan Charades (Role-Play & Acting, 5-7 minutes)\n**Materials:** Simple props (paper \"Satan\" mask, toy sword for \"armor of God\").  \n**Steps:** Divide into pairs/small groups. Act out temptations (e.g., \"lie to a friend,\" \"watch bad show\"). One is Satan tempting; other is child of God resisting like Moses: pray, say \"Get thee hence,\" call for help (Moses 1:20–22, 26). Switch roles; perform for class.  \n**Connection:** Moses resisted by remembering he was God's son (Moses 1:13, 15, 18).  \n**Questions:** \"What did Moses do to win? (Prayed, remembered God's power—Moses 1:24–26). How can Jesus help us?\"\n\n### 3. Premortal Spirit Drawings (Creative Expression, 5-7 minutes)\n**Materials:** Paper, crayons.  \n**Steps:** Children draw themselves as a spirit \"before the world was\" (Abraham 3:22), with Heavenly Father, Jesus, and earth mission (Abraham 3:24–26). Add \"I will prove myself by...\" (e.g., being kind). Share one drawing.  \n**Connection:** We chose to come to earth for God's work (Abraham 3:25–28).  \n**Questions:** \"What work does God have for you? How does knowing you are His child change choices?\"\n\n## Testimony Time (3 minutes)\nInvite quietly: \"What do you feel when you know you are a child of God?\" (Moses 1:4). Share if comfortable. Teacher: \"I know Heavenly Father loves each of you and helps you, as He did Moses.\"\n\n## Take-Home Challenge\nLook in a mirror daily and say, \"I am a child of God\" (Moses 1:4). Tell one family member why it matters.\n\n## Teacher Tips\n- For wiggly kids, add claps/stomps during relays. Adapt for shy ones by pairing or drawing first. Time activities strictly to fit 30-40 minutes total. Use Gospel Art Book images of Moses for visuals (nos. 13–16).\n\n*(Word count: 712)*",
  "generated_timestamp": "2026-01-11 18:32:50",
  "source_week_file": "cfm_2026_week_02.json"
}