{
  "week_number": 1,
  "title": "Week 1: December 29–January 4 - Introduction to the Old Testament",
  "date_range": "December 29–January 4",
  "audience": "children",
  "word_count": 843,
  "character_count": 4651,
  "content": "# Come, Follow Me Study Plan for Children: Introduction to the Old Testament  \n**Week 1: December 29–January 4**\n\nHey, little friends! Let’s start a super exciting adventure with the Old Testament! This big book is full of stories about people who loved God and learned about Jesus, even a long, long time ago. Ready to find Jesus in these stories? Let’s go!\n\n## Fun Start  \nHave you ever found a hidden treasure in a book or a game? Today, we’re going on a treasure hunt in the Old Testament to find clues about Jesus Christ, our best friend and Savior!\n\n## Key Gospel Ideas  \nHere are some simple truths to learn this week. Let’s read, draw, and talk about them!  \n1. **The Old Testament Tells Us About Jesus**: The Old Testament is an old book, but it’s full of stories and signs that point to Jesus. Read John 6:35, where Jesus says, “I am the bread of life: he that cometh to me shall never hunger.” (Draw a picture of bread to remember Jesus feeds our hearts!)  \n2. **Jesus Is Jehovah**: In the Old Testament, Jesus is called Jehovah. That’s His special name before He was born! Read Exodus 6:3 and see His name. (Color a picture of a shining light to show Jesus is our guide!)  \n3. **God Makes Covenants With Us**: God made promises with people long ago, and He makes promises with us too. Read Exodus 19:5 about being God’s “peculiar treasure.” (Draw a treasure chest to show how special we are to God!)  \n4. **We Can Find Jesus in Symbols**: Things like manna or a lamb in the Old Testament remind us of Jesus. Read John 1:29, where Jesus is called “the Lamb of God.” (Color a lamb picture to think of Jesus!)  \n\n## Daily Adventures  \nLet’s have fun every day learning about the Old Testament!  \n- **Day 1**: Sing “Seek the Lord Early” (Children’s Songbook, 108) and talk about finding Jesus in stories.  \n- **Day 2**: Draw a picture of bread to remember Jesus is the “Bread of Life” (John 6:35).  \n- **Day 3**: Color a lamb and talk about Jesus as the “Lamb of God” (John 1:29).  \n- **Day 4**: Make a paper treasure chest to show we’re God’s “peculiar treasure” (Exodus 19:5).  \n- **Day 5**: Read Psalm 23 together and draw a shepherd to remember Jesus takes care of us.  \n- **Day 6**: Sing “When I Am Baptized” (Children’s Songbook, 103) and talk about promises with God.  \n- **Day 7**: Look at a family picture and talk about how God loves families in the Old Testament and today.\n\n## Story Time  \n**God’s Promises in the Old Testament**  \nA long, long time ago, God spoke to people like Abraham, Sarah, and Moses. These stories are in the Old Testament, a very old book. God told His friends, “I will be with you, and I will make promises with you called covenants.” One special promise was that a Savior, Jesus Christ, would come to help everyone. In Exodus 19:5, God said, “Ye shall be a peculiar treasure unto me.” That means God loved them so much and wanted them to be close to Him, just like He loves us! Even when people made mistakes, God never gave up. He sent signs, like manna from heaven to feed them (Exodus 16:4), to show He cared. These signs also pointed to Jesus, who would be the “Bread of Life” (John 6:35). God’s friends learned to trust Him, and they waited for Jesus to come. We can trust God too, because He keeps His promises!  \n**Questions for Kids**: What promise did God make to His people? How does Jesus help us like bread helps our tummies? What’s one way you can trust God today?\n\n## Play and Learn  \nLet’s play and learn about the Old Testament! (Younger kids: simplify with fewer steps; older kids: add details or questions.)  \n1. **Treasure Hunt Game**: Hide paper “treasures” around the room with Old Testament names (like Abraham or Moses). Find them and talk about being God’s “peculiar treasure” (Exodus 19:5).  \n2. **Act It Out**: Pretend to be Moses finding manna (Exodus 16:4). Use crackers as pretend manna and talk about Jesus as the “Bread of Life” (John 6:35).  \n3. **Build a Promise Tower**: Use blocks to build a tower. Each block is a promise God keeps. Say, “God promises to love us!” each time you add a block.  \n4. **Shepherd and Sheep Game**: One child is the shepherd (like Jesus in Psalm 23), guiding the “sheep” (other kids) to a safe spot. Talk about Jesus guiding us.\n\n## Jesus Connection  \nEvery story in the Old Testament helps us see Jesus’s love. He is Jehovah, the one who helped people long ago, and He helps us now. Let’s say a little prayer together: “Thank you, Heavenly Father, for sending Jesus to be our Savior. Help us find Him in the Old Testament. Amen.” I feel so happy knowing Jesus is always with us, guiding us like a shepherd. How do you feel about Jesus today?",
  "generated_timestamp": "2025-12-31 23:42:49",
  "source_week_file": "cfm_2026_week_01.json"
}