{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "older-primary",
  "word_count": 658,
  "character_count": 3974,
  "content": "# Adam and Eve's Choice: Part of God's Plan!\n\n## Lesson Overview\nAdam and Eve chose to leave the Garden of Eden so they could have children, learn good from evil, and grow like Heavenly Father wants (Moses 5:10–11). For 8-10-year-olds, this shows why we have choices and hard things, but Jesus Christ saves us and brings joy (Moses 5:14–15). It helps kids feel grateful for agency and the Savior's help in their own lives.\n\n## Opening Activity (5 minutes): *Choose the Right* Song Freeze Dance  \n**Activity Type**: Music & Movement  \nPlay \"Choose the Right Way\" (Children’s Songbook, 160–61) on a phone or sing together. Kids dance or march around the room. When music stops, they freeze in a \"good choice\" pose (like helping a friend or praying). Ask: \"What good choice are you showing?\" This grabs attention and introduces choosing right, like Adam and Eve (Moses 4:1–4).\n\n## Scripture Focus  \n**Moses 5:10–11** (full verse): \"And Eve, his wife, heard all these things and was glad, saying: Were it not for our transgression we never should have had seed, and never should have known good and evil, and the joy of our redemption, and the eternal life which God giveth unto all the obedient. And Adam blessed God, and was filled with the Holy Ghost, and began to prophesy concerning all the families of the earth, saying: Blessed be the name of God, for because of my transgression my eyes are opened, and in this life I shall have joy, and again in the flesh I shall see God.\"  \n\n*Child-friendly explanation*: Adam and Eve were happy about leaving Eden because it let them have families and learn to choose good. Jesus helps us have that joy too!\n\n## Main Activities (15-20 minutes total)  \n\n### 1. Crayon Choices Object Lesson (5 minutes)  \n**Activity Type**: Object Lessons  \n**Materials**: A few crayons (one color per child, then a box of colors); paper.  \n**Steps**: Give each child paper and one crayon. Say, \"Color a picture of your family!\" After 30 seconds, ask why it's hard with one color. Then give the full box. Let them recolor happily.  \n**Connection**: Heavenly Father and Jesus protect our agency to choose right, not just do right (Moses 4:1–4).  \n**Discussion**: \"Why did God give us choices? How do Adam and Eve's choice help us?\"  \n\n### 2. Good Choice Corners Game (5 minutes)  \n**Activity Type**: Physical Activities  \n**Materials**: None (use room corners).  \n**Steps**: Label corners: \"Helps Family,\" \"Shares with Friend,\" \"Listens to Mean Voice,\" \"Prays.\" Read choices like \"Tell truth when tempted\" or \"Ignore friend in need.\" Kids walk quickly to the best corner. Discuss as a group. Repeat 4-5 times.  \n**Connection**: Satan tempts like with Adam and Eve, but we choose Jesus' way (Moses 4:4–12; 5:13–33).  \n**Discussion**: \"How do you feel making good choices? What helps like Heavenly Father did for Adam?\"  \n\n### 3. Because of Jesus Craft (5-7 minutes)  \n**Activity Type**: Hands-On Crafts  \n**Materials**: Paper plates or white paper, crayons/markers, tape.  \n**Steps**: Fold paper in half. Left side: Draw \"Because of the Fall, I...\" (e.g., get sad, make mistakes—Moses 4:25). Right side: \"Because of Jesus Christ, I...\" (e.g., can be happy, forgiven—Moses 5:8–11, 14–15). Kids color and share one each. Tape to sticks for puppets if time.  \n**Connection**: Jesus overcomes Fall effects so we can return to God (Moses 5:4–15).  \n**Discussion**: \"What did Adam and Eve learn from the angel? How does Jesus help you?\"  \n\n## Testimony Time (3 minutes)  \nSit in a circle. Share first: \"I love how Jesus saves us because of Adam and Eve's choice.\" Prompt: \"What do you feel about Jesus helping us choose right?\" Let 3-4 kids share simply—no pressure.\n\n## Take-Home Challenge  \nDraw one good choice you'll make this week (like praying when sad, Moses 5:4, 8). Show your family and tell why it makes you happy.\n\n## Teacher Tips  \nPair wiggly kids for activities to help focus. For shy ones, let them draw answers first before sharing. (612 words)",
  "generated_timestamp": "2026-01-11 18:08:54",
  "source_week_file": "cfm_2026_week_04.json"
}