{
  "week_number": 2,
  "title": "Week 2: January 5–11 - Moses 1; Abraham 3",
  "date_range": "January 5–11",
  "audience": "older-primary",
  "word_count": 671,
  "character_count": 4154,
  "content": "# Week 2: I Am a Child of God (Moses 1; Abraham 3)\n\n## Lesson Overview\nChildren will discover they are children of God with divine worth and purpose, as revealed to Moses and Abraham. This truth helps 8-10-year-olds feel valued, resist Satan's lies, and choose eternal perspectives in daily decisions (Moses 1:4, 12; Abraham 3:22–28). Knowing their premortal spirit identity builds confidence to follow God's plan.\n\n## Opening Activity (5 minutes): Mirror Messages (Object Lesson)\nHold up a hand mirror and invite each child to look into it while you read Moses 1:4. Say together: \"You are a child of God!\" Have them repeat it to a partner.  \n*Materials*: Small hand mirror (or phone reflection).  \nThis grabs attention by making the principle personal, echoing God's words to Moses (Moses 1:4).\n\n## Scripture Focus\n**Moses 1:4**: \"And thou art my son; wherefore look and I will show thee the workmanship of mine hands; but not all, for my works are without end, and also my words, for they never cease.\"  \n*Child-friendly*: God told Moses, \"You are my son!\" just like He says to each of us—we are His precious children with endless worth.  \n\n**Abraham 3:22–23** (excerpt): \"Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones; And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers...\"  \n*Child-friendly*: Before earth, we lived as spirits with Heavenly Father—many were noble and good, chosen for important work here.\n\n## Main Activities (15-20 minutes total)\n\n### 1. God's Truth Toss (Game, 5 minutes)\n**Activity Type**: Games  \n**Steps**: Write 6 phrases on cards (3 true from God like \"You are my child\" [Moses 1:4]; 3 false from Satan like \"You are nothing\" [Moses 1:12]). Toss a beanbag; child reads card aloud, says \"God\" or \"Satan,\" and tosses to next. Switch teams for speed.  \n**Materials**: Beanbag (or balled sock), 6 index cards, marker.  \n**Connection**: Helps spot God's affirming messages vs. Satan's counterfeits, like Moses did (Moses 1:12–26).  \n**Questions**: \"How did Moses reply to Satan? (Moses 1:13, 15, 18). What truths make you feel strong?\"\n\n### 2. Premortal Spirit Parade (Music & Movement, 5 minutes)\n**Activity Type**: Music & Movement  \n**Steps**: Teach \"I Will Follow God’s Plan\" (Children’s Songbook, 164–65). March in a circle singing; add actions—point up for \"before I came to earth,\" flex muscles for \"prove,\" hug self for \"child of God.\" Pause to draw quick stick-figure spirits in notebooks.  \n**Materials**: Printed lyrics (optional), notebooks/pencils.  \n**Connection**: Reinforces premortal life truths—we chose to come prove ourselves (Abraham 3:22–28).  \n**Questions**: \"What words like 'before the world was' or 'spirits' did you find? (Abraham 3:22–28). How does this change your choices?\"\n\n### 3. Resist Like Moses Skit (Role-Play & Acting, 5-7 minutes)\n**Activity Type**: Role-Play & Acting  \n**Steps**: Divide into 3 groups. Assign scenes from Moses 1:12–26: Group 1—Moses sees God’s glory (v. 13–15); Group 2—Satan tempts, Moses commands \"Get thee hence\" (v. 20–22); Group 3—God sends angel (v. 26). Use scarves as robes; act with big voices, then perform for class.  \n**Materials**: Scarves or paper towels as props.  \n**Connection**: Shows how Moses resisted Satan by remembering his divine identity and calling for help (Moses 1:12–26).  \n**Questions**: \"What helped Moses win? (Pray, remember God’s power [v. 24–26]). How can Jesus help us?\"\n\n## Testimony Time (3 minutes)\nSit in a circle. Pass a soft ball; child holding it shares one feeling, like \"I feel happy knowing I'm God's child\" (prompt: \"What do you feel when you remember you are a child of God?\"). Listen warmly—Heavenly Father loves their simple words.\n\n## Take-Home Challenge\nEach night, look in a mirror and say, \"I am a child of God\" (Moses 1:4). Draw one way you'll follow His plan that day.\n\n## Teacher Tips\nUse a timer for smooth transitions; pair shy children with buddies. For wiggly groups, add jumping jacks between activities. (Total: 612 words)",
  "generated_timestamp": "2026-01-11 18:06:08",
  "source_week_file": "cfm_2026_week_02.json"
}