{
  "week_number": 4,
  "title": "Week 4: January 19–25 - Genesis 3–4; Moses 4–5",
  "date_range": "January 19–25",
  "audience": "adult",
  "word_count": 957,
  "character_count": 5956,
  "content": "# Week 4: January 19–25  \n**Genesis 3–4; Moses 4–5**\n\n## Weekly Overview\nThe account of Adam and Eve's Fall in Genesis 3–4 and Moses 4–5 reveals it as an essential step in God's plan, moving them from Eden's beauty to a world of opposition where growth, choice, and redemption become possible (see Moses 5:11). Through restored truths in the book of Moses, we see not tragedy but divine purpose: facing choices, learning repentance, and trusting the Savior's Atonement for progression toward exaltation. Today, this teaches us to embrace mortality's challenges as opportunities for joy and returning to God.\n\n## Doctrinal Key Points\n1. **The Fall was necessary for God's plan** (Moses 5:9–12; 2 Nephi 2:19–25): Adam and Eve rejoiced after the Fall, saying, \"we know nothing about God; nevertheless long will we seek after him,\" recognizing it opened the path to knowledge, agency, and redemption.\n2. **Jesus Christ offers hope and redemption** (Genesis 3:1–7; Moses 4:22–31; 5:4–15): The angel taught Adam and Eve of the Savior's sacrifice, leading them to be \"glad, saying: We are glad to know these things,\" as it redeems us from spiritual and physical death.\n3. **Agency requires opposition** (Moses 4:1–4; 2 Nephi 2:11–20, 25–30): Elder Dale G. Renlund taught, “Our Heavenly Father’s goal in parenting is not to have His children do what is right; it is to have His children choose to do what is right and ultimately become like Him” (“Choose You This Day,” Ensign or Liahona, Nov. 2018, 104).\n4. **Husbands and wives are equal partners** (Genesis 3:16; Moses 4:22): \"The Family: A Proclamation to the World\" affirms husbands and wives as equal partners; Elder Dale G. Renlund and Sister Ruth Lybbert Renlund described a righteous husband as one who ministers, seeks forgiveness, praises, and treats his wife with utmost respect.\n5. **Satan seeks to deceive** (Moses 4:4–12; 5:13–33): He tempted Adam, Eve, and Cain through lies and blindness, just as he does today.\n6. **The Lord clothes us spiritually** (Moses 4:13–16, 27): After Adam and Eve's attempt to cover themselves, \"I, the Lord God … clothed them,\" symbolizing divine protection and temple covenants.\n7. **Sacrifices require a willing heart** (Moses 5:4–9, 16–26): The Lord accepted Abel's offering but not Cain's due to heart attitudes.\n\n## Personal Study Guide\n**Day 1: The Fall's Purpose**  \nRead Genesis 3; Moses 4. Why was the Fall important to God’s plan (Moses 5:9–12)? Reflect: How do Adam and Eve's feelings apply to your life (see 2 Nephi 2:19–25; Mosiah 3:19)? Cross-reference: Alma 12:21–37.\n\n**Day 2: Redemption Through Christ**  \nRead Moses 5:4–15; watch “Because of Him” video. List Fall's effects (Genesis 3:1–7; Moses 4:22–31) and God's remedies. Why were Adam and Eve glad? Reflect: How does this bring hope amid trials (Doctrine and Covenants 29:39–43)?\n\n**Day 3: Protecting Agency**  \nRead Moses 4:1–4; 2 Nephi 2:11–20, 25–30. What did Heavenly Father and Jesus do to safeguard choice? Reflect: How can you access Their power (“Make inspired choices,” For the Strength of Youth, 4–5)? See Dallin H. Oaks, “Opposition in All Things,” Ensign or Liahona, May 2016.\n\n**Day 4: Satan's Deceptions**  \nRead Moses 4:4–12; 5:13–33. List Satan's tactics against Adam, Eve, and Cain. Reflect: How does he tempt you today? How does Heavenly Father help resist?\n\n**Day 5: Clothing and Covenants**  \nRead Moses 4:13–16, 27. Ponder nakedness/clothing symbols (2 Nephi 9:14; Doctrine and Covenants 109:22–26). Reflect: What do these teach about divine covering? Watch “Sacred Temple Clothing” video.\n\n**Day 6: Offering Sacrifices**  \nRead Moses 5:4–9, 16–26. Compare attitudes of Adam/Eve, Abel, and Cain. Reflect: What sacrifices does the Lord ask of you? See Liahona and For the Strength of Youth magazines.\n\n**Day 7: Equal Partnership and Prayer**  \nRead Genesis 3:16; Moses 4:22; Moses 5:4, 8. Study “The Family: A Proclamation to the World” and Elder Ulisses Soares's “Equal Partnership in Marriage” video. Reflect: How did Adam and Eve pray to draw near God?\n\n## Group Discussion Ideas\n1. According to Moses 5:9–12, how did Adam and Eve feel post-Fall? Share how this shifts your view of mortality.\n2. What effects of the Fall do you see in Genesis 3:1–7 and Moses 4:22–31? How does Moses 5:4–15 show Christ's redemption?\n3. Why is choosing right essential (Moses 4:1–4; Elder Renlund quote)? Share a time opposition helped you grow.\n4. How does Satan deceive today, as in Moses 4:4–12 and 5:13–33? What protections work for you?\n5. Discuss Genesis 3:16 in light of “The Family: A Proclamation to the World.” What does equal partnership mean?\n6. What do Moses 4:13–16, 27 teach about the Lord's clothing? Share insights on spiritual covering.\n7. Why did God accept Abel's sacrifice (Moses 5:16–26)? How does heart attitude affect your offerings?\n8. How did prayer help Adam and Eve (Moses 5:4, 8)? Share experiences feeling God's nearness.\n\n## Application Challenges\n1. Complete “Because of Him” sentences daily: “Because of the Fall, I … Because of Jesus Christ, I …” (Moses 4:25; 5:8–11; 2 Nephi 2:22–23).\n2. Make one inspired choice amid opposition, thanking Christ for agency (2 Nephi 2:27; For the Strength of Youth).\n3. Minister to your spouse or family with respect and praise, as equal partners (“The Family: A Proclamation”).\n4. Offer a willing sacrifice this week, like time in service, reflecting Abel's heart (Moses 5:20–21).\n\n## Testimony Builder\nThese chapters center on Jesus Christ, whose Atonement turns the Fall's opposition into eternal progression, as Adam and Eve learned from the angel (Moses 5:10–11). Through Joseph Smith's revelations in Moses, we see the Restoration's light: agency preserved by the Father and Son, redemption freely offered, and covenants that clothe us for glory. Ponder how the Savior's sacrifice makes your choices lead back to Him—what opposition has drawn you nearer? I know He redeems us through every step. \n\n*(Word count: 1028)*",
  "generated_timestamp": "2026-01-11 18:34:57",
  "source_week_file": "cfm_2026_week_04.json"
}